{
 "submission_id": "162zu8s",
 "title": "What was the worst first impression you ever had with someone?",
 "selftext": "",
 "created_utc": 1693165348,
 "permalink": "/r/AskReddit/comments/162zu8s/what_was_the_worst_first_impression_you_ever_had/",
 "score": 117,
 "url": "https://www.reddit.com/r/AskReddit/comments/162zu8s/what_was_the_worst_first_impression_you_ever_had/",
 "comments": [
  {
   "comment_id": "jy08utu",
   "message": "Another post just reminded me of this so allow me to share my friend’s trauma.\n\nFreshman year of college my roommate (now friend) came home in tears, after giving her first hand job to this guy she had just started seeing.\n\nShe really liked him but she had zero experience, so she watched this YouTube tutorial that said giving a hand job was **just like shucking corn…so that’s how she did it…and nearly shucked the skin off his entire dick.**\n\nShe said he screamed out after the first jerk but she did it again, because she thought he was enjoying it. Then he grabbed her wrist in a death grip and pulled it away.\n\nShe was sure he was done with her. I tried reassuring her but, frankly, I was filled with dread because I had just given my first hand job a week earlier, to my now boyfriend, and I started wondering if it was equally bad but he was just too polite to say. \n\nWhen I broached the topic he \n\n1. Laughed his ass off at the other guy’s suffering and\n\n2. Assured me he wasn’t too polite to let me know if I was about to shuck his dick.",
   "created_utc": 1693169750,
   "score": 53,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jxzzol3",
   "message": "when I went before the Judge, I was drunk and argued with him.\n\n10 extra days for contempt of court.\n\n\n6 years sober",
   "created_utc": 1693166047,
   "score": 76,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy02x5m",
   "message": "I'm a nurse and when I worked on a ward for the elderly, I had to call and ask the family of a very lovely lady who was dying to come and see her. They only lived a few miles away from the hospital but took 7 hours to arrive. By that time, the lady had passed away. I had to tell the family as soon as they arrived. I expected tears and sadness but the daughter only said ' It's okay, mum had a great life insurance policy.'\nNo tears. No upset. They were all smiling and trying to hide it. I hated them.",
   "created_utc": 1693167353,
   "score": 48,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0a5y8",
   "message": "I was on a date and he tried to change my order with the waitress because I didn’t order what he’d recommended.",
   "created_utc": 1693170284,
   "score": 16,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0312w",
   "message": "Went into a dealership so support my wife as she shopped for her car.  Skeeezy salesman comes up. Introduces himself to me immediately acts all buddy buddy and starts calling me by my first name. Never acknowledges my wife.  I tell him she's actually the one car shopping, he barely bats an eye and keeps trying to sell to me.  Politely reminded him and he still refuses to deal with her.  Walked right out without a word.  Fuck that guy.  And fuck Bob Howard toyota in North okc.",
   "created_utc": 1693167399,
   "score": 46,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0b1jb",
   "message": "Family friend who wanted to introduce her new boyfriend to her friend group.\n\nThe dude was a know-it-all. He talked over everybody, was very condescending, and was just a rude jerk.\n\nWe gave him a do-over and he was even worse the second time.\n\nThat was over 15 years ago and they're still together. I don't see my friend much anymore.",
   "created_utc": 1693170640,
   "score": 12,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy07ukb",
   "message": "I met a girl at work. Thought she was cute until she bragged about purposefully hitting a bird with her truck because, “birds are stupid.” Nothing like some animal cruelty to kill your attraction level.",
   "created_utc": 1693169346,
   "score": 18,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0d7bs",
   "message": "My friend’s husband showed himself to be the toxic misogynist he is. I look young for my age, my voice is kind of like a chipmunk, and I’m kind of bubbly, dark, opinionated, sarcastic, and laugh a lot. He kept rolling his eyes and expressing how much he hated the way I talk, how my voice sounds ridiculous, “don’t say ‘bye like that, it sounds like a gay guy’”..\n\n\nAnything that came out of my mouth pretty much was annoying and needed to be put in its place by him. It was exhausting. I adore her, she’s nothing like him, so I tolerated it, didn’t call him out, didn’t get to confrontative. I just leaned into the sarcasm and bubbly to intentionally bug him sometimes. \n\nHaven’t been to their place since, wasn’t surprised that when they finally had a baby after years of trying, that he said,” no pink! Not in our house, not on her, nowhere.” When they found it’s a girl. I’ve been so happy seeing so much pink at the shower, and in pictures throughout her first year on Facebook.",
   "created_utc": 1693171529,
   "score": 8,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy024ct",
   "message": "First impression, I had a professor strait up not show up for the first day of class, in a class that met once a week.\n\nSecond impression of the same professor, he said \"I'm terrible at business, finance, and investments,\" in a class about business and finances on the day he showed up.",
   "created_utc": 1693167030,
   "score": 25,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy06trz",
   "message": "I was dating this girl in another town and I was there visiting her. We were walking around down town and these 6 or 7 guys cornered me in a dark parking lot. This one guy started shoving me, going on about how I was \"in his town\" and he should kick my face in for being where I shouldn't. I was so pissed. If he didn't have 6 other guys with him, it would've went down very different. He really embarassed me in front of my girl. Thankfully the cops showed up before it escalated though, with those 6 other guys there... I might be dead.\n\n20 years later, he marries my sister. He's actually a really great guy, a great husband, and a great father for my neices and nephew... but I still have a hard time getting past that first encounter. I HATE the fact that I have to think of him as a decent person.",
   "created_utc": 1693168934,
   "score": 13,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy09sey",
   "message": "First date, she suggest I go to therapy and asked if I have ADHD",
   "created_utc": 1693170130,
   "score": 6,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy01nk7",
   "message": "About 6 months into dating my ex, I met a friend of his and the friend's girlfriend. \n\nMy ex and the girl had a history, and when we first were introduced, the girl wouldn't acknowledge my presence or even speak to me. I disliked her from that moment on because it told me everything I needed to know. She had feelings for my now ex. It typically wouldn't have bothered me, being introduced to someone my ex had a past with, given I was friends with a few of the guys I had a past with. But, when one of those past flames holds on to feelings that aren't reciprocated, and can see there's a new person involved, that's when I have problems. \n\nSince then, the girl and my ex's friend married, only for her to walk out on him with another dude.",
   "created_utc": 1693166842,
   "score": 11,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy05adm",
   "message": "A cute woman complimented my car at the gas station. She clearly wanted to talk because she kept approaching me. What she didn’t know was I stopped at the gas station to puke in the trash can. I had food poisoning. I didn’t make it to the trash can by the way.",
   "created_utc": 1693168312,
   "score": 10,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0di1t",
   "message": "My best friend. We met in middle school and she’s blonde, gorgeous, and seemed super stuck up when I first met her. Obviously, I made assumptions about her. Turns out she’s super socially awkward and once I got to know her, I found out that she has a super bizarre sense of humour (which I love), but she doesn’t show it to strangers. 20 years later and we’re still best friends.",
   "created_utc": 1693171650,
   "score": 5,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0hl2x",
   "message": "The first day of grade 8 I thought the girl who just dyed her hair jet black and wore dark clothes/hoodies must be a dark, broody person. \n\n17 years later and we’ve been together for 11 years and have a child together. She is the most vibrant, fun-loving person I know who makes my life better every day. \n\nSometimes you’ve gotta say fuck first impressions. 😃",
   "created_utc": 1693173370,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ara3",
   "message": "My brothers ex girlfriend the first time i met her I was working in care with disabled adults her kid (3) had just fallen down some stairs and she said \" at least if he'd been injured I'd have got disability money for him\" she wasn't joking.",
   "created_utc": 1693170525,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy07jlg",
   "message": "I had to pick up a new coworker to drive to the location we'd be working for the week. After talking about the job for about 25 minutes he asks, \"So what do you think about 9/11?\" I knew it was going to be a long week.\n\n*Edit because I'm on mobile and am clumsy. I said the most non-committal thing I could imagine because we still had hours in the car. \"It was a thing that happened.\" He rolled his eyes and said, \"Oh so you think it happened.\"",
   "created_utc": 1693169220,
   "score": 8,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy09zdc",
   "message": "Friend invited me to another of his friend’s place to do some shooting. I made a joke about his arsenal. ‘You’re geared up for the zombies. Hahaha’. This guy takes a hit of his joint and actually goes ‘I don’t believe in zombies. These are for the n$4\u0026amp;@rs’. Never hanging out with the dude again. On top of it, he’s a hardcore Trumper.",
   "created_utc": 1693170210,
   "score": 6,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0bma2",
   "message": "I was with my friend (let's call her Sara) when she told me that another new friend of hers (let's call her Rose) was going to join us.\n\nRose didn't like me even before I met her. \nHer father drove her to where we were but had the sense of direction of a 3-year-old because we waited half an hour for them to show up when it was barely a 10 minute long drive by car from where they said they were.\nRose was at the phone on speaker and we could hear everything they said.\nWhen Sara told her she was with me her father asked her who I was and she, rudely, replied \"I don't know who the fuck he is, a friend of hers I suppose\".\n\nWhen I finally met her in person she wanted to ignore me but she couldn't because I was there so she has to introduce herself to me and endure me for the entirety of the night.\n\nAnd then she started rambling about stupid ignorant stuff. That a \"whore\" stole her boyfriend from her and that she wants him back, then she said that she hated Moroccans because they stink and (questionable) stuff like that...\n\nWhen I told her I was trans she made a face... \nShe clearly wanted to avoid stupid questions and that's the only good thing I can say of her...\n\nBut she still clearly didn't want me there since she never asked me anything, she seemed to refer only to Sara when talking, etc.\n\nI didn't see her anymore and I'm so glad.",
   "created_utc": 1693170878,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0fl87",
   "message": "my GF at that time,  told me from the start , her very best friend is **a guy** and he is \"like a brother to her\". I thought, ok sure why not, i dont have a problem.   \n\n\nBut Every opportunity to meet he would always avoid me, a bit weird, for almost one year, weirder.   \nUntil finaly 1 year later at her birthday i met him. The definitation of being friend zoned. He was following her like a shadow, He could never look at me while even when we talked, always asked for her approbation on all topics, trying to twist my word to make me look bad and quickly add \"naahhh just joking lol right\" still avoiding eyes contact with me.   \n\n\nIn the end, no need to talk to him,  I just felt sorry for him.   \nFor some reason we broke up much later, and she used him for a month as a rebound. thinking about it, It was probably the best month of his life.",
   "created_utc": 1693172523,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0fo4v",
   "message": "This guy I go to university with. First he told me about an anime he likes and while telling me about it he said he knows he shouldn't be watching it, I thought he meant as in he is too old for \"cartoons\" he is in his 40s for context.\n\n\nSo I told him \"hey man, there's nothing wrong with liking anime and he should watch it and not care what others think.\"\n\nThen he started explaining it was because they are evil and have satanic messages. I was like oh boy. I tried not to be judgemental, I had bad experiences with people who thought this so it did make me a little uncomfortable though.\n\n\nA little while later we were at a Christmas party we were having in class. There was a music video of a drag queen in class on the TV. He was saying some pretty homophobic stuff, but not going to far with it so I just thought it was just very mild homophobia and he wasn't doing it intentionally.\n\n\nThen after the party was ending we were pretty much alone and he came to me and said \"you know, I just don't like homosexuals.\" \n\n\nAnd I was kind of shocked because I am Bisexual and while I have seen homophobia before I have never seen it this blatant and said like it was completely normal. So I got uncomfortable and tried to keep social interactions with him to a minimum. (Hard because we are in the same class)\n\n\nNow he constantly goes on homophobic, racist, and sexist rants. I have been calling him out a lot lately, but I feel like I should maybe stop. Because it's like I am talking to a brick wall and I almost feel like I am going down to his level somehow.\n\nHe is starting to really dislike me now, which is cool because I am hoping he'll stop talking to me when he sees me shopping/walking down the street or in class.\n\n\nAlso I now wear a bi pride pin and bracelet to class because I feel like it annoys the hell out of him.\n\nTLDR: classmate feels guilty for watching anime because it's satanic, I try not to judge him even though I had bad experiences with people who said this. He ironically tells me he is unapologeticly homophobic, not knowing I was BI and goes on sexist, homophobic and racist rants Offen. And I gotta go to class with him 3 days a week, fun...",
   "created_utc": 1693172557,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0fopt",
   "message": "I met Donald Trump in NYC in the mid-90s.  I was dating a make-up artist who worked for VH-1 and tagged along to her at work one day just to see what it was like.  Trump was a guest that day.\n\nI've never met anyone like him before.  He was at the same time arrogant, miserable, and insufferable... but at the same time making jokes.  My girlfriend was Guanese and you could literally feel his contempt for her touching his hair.\n\nI'm a big white guy from the mid-west and he gave me the creeps... something I will never forget.",
   "created_utc": 1693172563,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy007re",
   "message": "It might have been while I was working in group home care and met the family of a resident while I had been awake for the past 27 hours and at work for 22 of them. I just explained the situation and apologized, but I made a few unusual mistakes that made me seem incompetent.",
   "created_utc": 1693166263,
   "score": 6,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0bs1z",
   "message": "How “genuinely” fake they were. Like you could smell it.",
   "created_utc": 1693170945,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0cb69",
   "message": "Oh man. This girl in my 20's, name purposely excluded. \nInvited herself over with one of her friends. Got drunk. Broke a ton of shit in my apartment. Her \"friend\" left her at mine. Stupid frustrating night. In the morning she kept harassing me to drive her home. I didn't even invite her! I finally drove her to a train station, which she was pissed about.  For years after she kept blowing me up to come back over to my place. Couldn't block enough numbers.",
   "created_utc": 1693171163,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0clet",
   "message": "I was like 7-8, and I was at a party and I kept seeing this little person across the room and I couldn’t tell if they were a boy or a girl.  I walked up to them, asked them if they were a boy or a girl,. She says “girl” and then I say “ok thanks!” And walk back to my position across the room. I was an idiot.",
   "created_utc": 1693171277,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0dicw",
   "message": "I met a woman who went on to defend torture at length. Even when her arguments were debunked, she was still in favour of it.",
   "created_utc": 1693171654,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0f9aq",
   "message": "I met this woman and tried to be friends with her. But she told me I was too intense to deal with and decided to cut off contact. I still don’t know why I was called that. None of my guy friends have a problem with me and I act the same with them. \n\nIt has happened twice with two women now. It has done an impact in my desire to even meet new people.",
   "created_utc": 1693172384,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0gfbr",
   "message": "Talked to the head of machinery and saw he had a 30 yr award. I said damn thats longer than I've been alive. Stupidly, I ment it as a compliment because the guy knows his shit, didnt come off that way.",
   "created_utc": 1693172875,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0hfsu",
   "message": "working on a bar and a new guy started. busy saturday service so it was quick introductions and then get on with the serving. i said \"hi, masksignal94\" and put my hand out and he pushed my hand away and said \"er...my name's dan, actually, idiot.\" he began as, and continued to be a proper knobhead.",
   "created_utc": 1693173307,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0hjq4",
   "message": "When someone shot at me, and missed",
   "created_utc": 1693173354,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ieqb",
   "message": "Miami police officer during spring break \n\nI kept telling them I wasn’t drunk but they still arrested me because I was exercising my constitutional right to party. \n\nNext summer I’m heading to Ibiza instead.",
   "created_utc": 1693173726,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy02enh",
   "message": "Let’s just say my boss was on some bullshit the very first day I walked in, it was a very long day.",
   "created_utc": 1693167145,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy09lur",
   "message": "My wife’s cousin. First time we met we walked around a mall for a little bit, I talked with her and my wife as openly and calmly as I could. After she met me she told my wife I creeped her out because I was “too nice”. I’ve since treated her to “f*ck you you fat c*nt” for the past 10 years.",
   "created_utc": 1693170054,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy08qq2",
   "message": "So one night walking home this guy pulled a knife and started slashing at me. \nI still don't think he was all that nice.",
   "created_utc": 1693169705,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0cxoa",
   "message": "At school, i fell while playing football (soccer for americans). I fell right next to some guy i didnt know and just automaticly sat down in a sexy pose and just said: \"Why hello there\". And then just stood up and ran away. I havent really had anymore encounters  with that guy.",
   "created_utc": 1693171418,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy02x3o",
   "message": "We switched management and I offered to do photography for the company's social media. The younger boss didn't understand or value what goes into taking a good photo and asked, \"Doesn't it take five minutes to edit a photo?\" Needless to say, I didn't take any photos for them after being insulted.",
   "created_utc": 1693167353,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0dx8p",
   "message": "new coworker. bro told me he hates kanye",
   "created_utc": 1693171826,
   "score": 0,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ijb3",
   "message": "Wow, talk about leaving a lasting impression! Glad to hear you've turned things around. Cheers to your sobriety!",
   "created_utc": 1693173783,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ilh0",
   "message": "New neighbor.  First contact she starts listing all the things they moved there to do, most of which were illegal (dog related, not murder) or against the rules of the HOA. Then proceeded to complain about how bad the weather was, how there were no decent restaurants, shopping or community activities, how she would be having lots of dinner parties and expected everyone to come then reciprocate, how much she expected people to spend...on and on.  I love people that move here from out of state, then tell me how much better their old state is.  Why?",
   "created_utc": 1693173810,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0jy0v",
   "message": "I'm pretty sure it was like peter griffin or something",
   "created_utc": 1693174402,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0lbwz",
   "message": "Came to work one day when I knew a new person was starting. In the employee parking area was a car I'd never seen before using up two spaces. First thought: \"She's one of *those* people.\"\n\nAnd she was.",
   "created_utc": 1693175019,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0mdzq",
   "message": "Was recently at a little get together, and there was a stunning individual there. From the moment she first spoke, I happily assumed that our personality types were compatible as she showed signs of quirkiness and eccentricism. More often than not, these traits go hand-in-hand with my own and can usually make for fantastic conversation. \n\nUnfortunately, we didn't work out. I think it was due to the fact that she's a couple of rungs higher than I on the privilege-pole. And by that, I mean that I am at the bottom, and she's been at the top for so long that she forgot how to look down.\n\nStill, a very remarkable, kind individual. Wish you the best, Steph.",
   "created_utc": 1693175491,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0mk35",
   "message": "A friend of my wife had been unlucky in love for a long time and finally met the guy of her dreams. I hated him from the second I met him. He had these beady little evil eyes, weak handshake, squeaky voice and he just felt very slimy. He could not look anyone in the eyes when he spoke and he was very gropey. He kept saying he works in intelligence and none of us pushed it any further than that, but he kept trying to make it a point that he was a spy for the Government. Alarm bells were going off in my head all night and the next day I had to tell my wife's friend to be careful but she made me feel like shit because she thought I was trying to sabotage her final chance at love. About a year later, she finds out the weed has a wife and family, he did work for the government but only as an accountant. He had basically been preying on her vulnerability and fabricating this elaborate story to keep her on the hook. They had an investment property they were remodeling which he pretended was his own house and thats where he took my wife's friend.",
   "created_utc": 1693175569,
   "score": 1,
   "submission_id": "162zu8s"
  }
 ]
}