{
 "submission_id": "162zu8s",
 "title": "What was the worst first impression you ever had with someone?",
 "selftext": "",
 "created_utc": 1693165348,
 "permalink": "/r/AskReddit/comments/162zu8s/what_was_the_worst_first_impression_you_ever_had/",
 "score": 211,
 "url": "https://www.reddit.com/r/AskReddit/comments/162zu8s/what_was_the_worst_first_impression_you_ever_had/",
 "comments": [
  {
   "comment_id": "jy08utu",
   "message": "Another post just reminded me of this so allow me to share my friend’s trauma.\n\nFreshman year of college my roommate (now friend) came home in tears, after giving her first hand job to this guy she had just started seeing.\n\nShe really liked him but she had zero experience, so she watched this YouTube tutorial that said giving a hand job was **just like shucking corn…so that’s how she did it…and nearly shucked the skin off his entire dick.**\n\nShe said he screamed out after the first jerk but she did it again, because she thought he was enjoying it. Then he grabbed her wrist in a death grip and pulled it away.\n\nShe was sure he was done with her. I tried reassuring her but, frankly, I was filled with dread because I had just given my first hand job a week earlier, to my now boyfriend, and I started wondering if it was equally bad but he was just too polite to say. \n\nWhen I broached the topic he \n\n1. Laughed his ass off at the other guy’s suffering and\n\n2. Assured me he wasn’t too polite to let me know if I was about to shuck his dick.",
   "created_utc": 1693169750,
   "score": 244,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jxzzol3",
   "message": "when I went before the Judge, I was drunk and argued with him.\n\n10 extra days for contempt of court.\n\n\n6 years sober",
   "created_utc": 1693166047,
   "score": 90,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy02x5m",
   "message": "I'm a nurse and when I worked on a ward for the elderly, I had to call and ask the family of a very lovely lady who was dying to come and see her. They only lived a few miles away from the hospital but took 7 hours to arrive. By that time, the lady had passed away. I had to tell the family as soon as they arrived. I expected tears and sadness but the daughter only said ' It's okay, mum had a great life insurance policy.'\nNo tears. No upset. They were all smiling and trying to hide it. I hated them.",
   "created_utc": 1693167353,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0a5y8",
   "message": "I was on a date and he tried to change my order with the waitress because I didn’t order what he’d recommended.",
   "created_utc": 1693170284,
   "score": 16,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0312w",
   "message": "Went into a dealership so support my wife as she shopped for her car.  Skeeezy salesman comes up. Introduces himself to me immediately acts all buddy buddy and starts calling me by my first name. Never acknowledges my wife.  I tell him she's actually the one car shopping, he barely bats an eye and keeps trying to sell to me.  Politely reminded him and he still refuses to deal with her.  Walked right out without a word.  Fuck that guy.  And fuck Bob Howard toyota in North okc.",
   "created_utc": 1693167399,
   "score": 41,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0b1jb",
   "message": "Family friend who wanted to introduce her new boyfriend to her friend group.\n\nThe dude was a know-it-all. He talked over everybody, was very condescending, and was just a rude jerk.\n\nWe gave him a do-over and he was even worse the second time.\n\nThat was over 15 years ago and they're still together. I don't see my friend much anymore.",
   "created_utc": 1693170640,
   "score": 149,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy07ukb",
   "message": "I met a girl at work. Thought she was cute until she bragged about purposefully hitting a bird with her truck because, “birds are stupid.” Nothing like some animal cruelty to kill your attraction level.",
   "created_utc": 1693169346,
   "score": 213,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0d7bs",
   "message": "My friend’s husband showed himself to be the toxic misogynist he is. I look young for my age, my voice is kind of like a chipmunk, and I’m kind of bubbly, dark, opinionated, sarcastic, and laugh a lot. He kept rolling his eyes and expressing how much he hated the way I talk, how my voice sounds ridiculous, “don’t say ‘bye like that, it sounds like a gay guy’”..\n\n\nAnything that came out of my mouth pretty much was annoying and needed to be put in its place by him. It was exhausting. I adore her, she’s nothing like him, so I tolerated it, didn’t call him out, didn’t get to confrontative. I just leaned into the sarcasm and bubbly to intentionally bug him sometimes. \n\nHaven’t been to their place since, wasn’t surprised that when they finally had a baby after years of trying, that he said,” no pink! Not in our house, not on her, nowhere.” When they found it’s a girl. I’ve been so happy seeing so much pink at the shower, and in pictures throughout her first year on Facebook.",
   "created_utc": 1693171529,
   "score": 49,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy024ct",
   "message": "First impression, I had a professor strait up not show up for the first day of class, in a class that met once a week.\n\nSecond impression of the same professor, he said \"I'm terrible at business, finance, and investments,\" in a class about business and finances on the day he showed up.",
   "created_utc": 1693167030,
   "score": 125,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy06trz",
   "message": "I was dating this girl in another town and I was there visiting her. We were walking around down town and these 6 or 7 guys cornered me in a dark parking lot. This one guy started shoving me, going on about how I was \"in his town\" and he should kick my face in for being where I shouldn't. I was so pissed. If he didn't have 6 other guys with him, it would've went down very different. He really embarassed me in front of my girl. Thankfully the cops showed up before it escalated though, with those 6 other guys there... I might be dead.\n\n20 years later, he marries my sister. He's actually a really great guy, a great husband, and a great father for my neices and nephew... but I still have a hard time getting past that first encounter. I HATE the fact that I have to think of him as a decent person.",
   "created_utc": 1693168934,
   "score": 116,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy09sey",
   "message": "First date, she suggest I go to therapy and asked if I have ADHD",
   "created_utc": 1693170130,
   "score": 45,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy01nk7",
   "message": "About 6 months into dating my ex, I met a friend of his and the friend's girlfriend. \n\nMy ex and the girl had a history, and when we first were introduced, the girl wouldn't acknowledge my presence or even speak to me. I disliked her from that moment on because it told me everything I needed to know. She had feelings for my now ex. It typically wouldn't have bothered me, being introduced to someone my ex had a past with, given I was friends with a few of the guys I had a past with. But, when one of those past flames holds on to feelings that aren't reciprocated, and can see there's a new person involved, that's when I have problems. \n\nSince then, the girl and my ex's friend married, only for her to walk out on him with another dude.",
   "created_utc": 1693166842,
   "score": 41,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy05adm",
   "message": "A cute woman complimented my car at the gas station. She clearly wanted to talk because she kept approaching me. What she didn’t know was I stopped at the gas station to puke in the trash can. I had food poisoning. I didn’t make it to the trash can by the way.",
   "created_utc": 1693168312,
   "score": 80,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0di1t",
   "message": "My best friend. We met in middle school and she’s blonde, gorgeous, and seemed super stuck up when I first met her. Obviously, I made assumptions about her. Turns out she’s super socially awkward and once I got to know her, I found out that she has a super bizarre sense of humour (which I love), but she doesn’t show it to strangers. 20 years later and we’re still best friends.",
   "created_utc": 1693171650,
   "score": 143,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0hl2x",
   "message": "The first day of grade 8 I thought the girl who just dyed her hair jet black and wore dark clothes/hoodies must be a dark, broody person. \n\n17 years later and we’ve been together for 11 years and have a child together. She is the most vibrant, fun-loving person I know who makes my life better every day. \n\nSometimes you’ve gotta say fuck first impressions. 😃",
   "created_utc": 1693173370,
   "score": 45,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ara3",
   "message": "My brothers ex girlfriend the first time i met her I was working in care with disabled adults her kid (3) had just fallen down some stairs and she said \" at least if he'd been injured I'd have got disability money for him\" she wasn't joking.",
   "created_utc": 1693170525,
   "score": 19,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy07jlg",
   "message": "I had to pick up a new coworker to drive to the location we'd be working for the week. After talking about the job for about 25 minutes he asks, \"So what do you think about 9/11?\" I knew it was going to be a long week.\n\n*Edit because I'm on mobile and am clumsy. I said the most non-committal thing I could imagine because we still had hours in the car. \"It was a thing that happened.\" He rolled his eyes and said, \"Oh so you think it happened.\"",
   "created_utc": 1693169220,
   "score": 64,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy09zdc",
   "message": "Friend invited me to another of his friend’s place to do some shooting. I made a joke about his arsenal. ‘You’re geared up for the zombies. Hahaha’. This guy takes a hit of his joint and actually goes ‘I don’t believe in zombies. These are for the n$4\u0026amp;@rs’. Never hanging out with the dude again. On top of it, he’s a hardcore Trumper.",
   "created_utc": 1693170210,
   "score": 50,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0bma2",
   "message": "I was with my friend (let's call her Sara) when she told me that another new friend of hers (let's call her Rose) was going to join us.\n\nRose didn't like me even before I met her. \nHer father drove her to where we were but had the sense of direction of a 3-year-old because we waited half an hour for them to show up when it was barely a 10 minute long drive by car from where they said they were.\nRose was at the phone on speaker and we could hear everything they said.\nWhen Sara told her she was with me her father asked her who I was and she, rudely, replied \"I don't know who the fuck he is, a friend of hers I suppose\".\n\nWhen I finally met her in person she wanted to ignore me but she couldn't because I was there so she has to introduce herself to me and endure me for the entirety of the night.\n\nAnd then she started rambling about stupid ignorant stuff. That a \"whore\" stole her boyfriend from her and that she wants him back, then she said that she hated Moroccans because they stink and (questionable) stuff like that...\n\nWhen I told her I was trans she made a face... \nShe clearly wanted to avoid stupid questions and that's the only good thing I can say of her...\n\nBut she still clearly didn't want me there since she never asked me anything, she seemed to refer only to Sara when talking, etc.\n\nI didn't see her anymore and I'm so glad.",
   "created_utc": 1693170878,
   "score": 8,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0fl87",
   "message": "my GF at that time,  told me from the start , her very best friend is **a guy** and he is \"like a brother to her\". I thought, ok sure why not, i dont have a problem.   \n\n\nBut Every opportunity to meet he would always avoid me, a bit weird, for almost one year, weirder.   \nUntil finaly 1 year later at her birthday i met him. The definitation of being friend zoned. He was following her like a shadow, He could never look at me while even when we talked, always asked for her approbation on all topics, trying to twist my word to make me look bad and quickly add \"naahhh just joking lol right\" still avoiding eyes contact with me.   \n\n\nIn the end, no need to talk to him,  I just felt sorry for him.   \nFor some reason we broke up much later, and she used him for a month as a rebound. thinking about it, It was probably the best month of his life.",
   "created_utc": 1693172523,
   "score": 11,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0fo4v",
   "message": "This guy I go to university with. First he told me about an anime he likes and while telling me about it he said he knows he shouldn't be watching it, I thought he meant as in he is too old for \"cartoons\" he is in his 40s for context.\n\n\nSo I told him \"hey man, there's nothing wrong with liking anime and he should watch it and not care what others think.\"\n\nThen he started explaining it was because they are evil and have satanic messages. I was like oh boy. I tried not to be judgemental, I had bad experiences with people who thought this so it did make me a little uncomfortable though.\n\n\nA little while later we were at a Christmas party we were having in class. There was a music video of a drag queen in class on the TV. He was saying some pretty homophobic stuff, but not going to far with it so I just thought it was just very mild homophobia and he wasn't doing it intentionally.\n\n\nThen after the party was ending we were pretty much alone and he came to me and said \"you know, I just don't like homosexuals.\" \n\n\nAnd I was kind of shocked because I am Bisexual and while I have seen homophobia before I have never seen it this blatant and said like it was completely normal. So I got uncomfortable and tried to keep social interactions with him to a minimum. (Hard because we are in the same class)\n\n\nNow he constantly goes on homophobic, racist, and sexist rants. I have been calling him out a lot lately, but I feel like I should maybe stop. Because it's like I am talking to a brick wall and I almost feel like I am going down to his level somehow.\n\nHe is starting to really dislike me now, which is cool because I am hoping he'll stop talking to me when he sees me shopping/walking down the street or in class.\n\n\nAlso I now wear a bi pride pin and bracelet to class because I feel like it annoys the hell out of him.\n\nTLDR: classmate feels guilty for watching anime because it's satanic, I try not to judge him even though I had bad experiences with people who said this. He ironically tells me he is unapologeticly homophobic, not knowing I was BI and goes on sexist, homophobic and racist rants Offen. And I gotta go to class with him 3 days a week, fun...",
   "created_utc": 1693172557,
   "score": 36,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0fopt",
   "message": "I met Donald Trump in NYC in the mid-90s.  I was dating a make-up artist who worked for VH-1 and tagged along with her at work one day just to see what it was like.  Trump was a guest that day.\n\nI've never met anyone like him before.  He was at once arrogant, miserable, and insufferable, but also making cringe jokes.  She is Guyanese and you could literally feel his contempt for her touching his hair.  Also, he didn't have the spray tan back then.\n\nI'm a big white guy from the mid-west and he gave me the creeps... something I will never forget.",
   "created_utc": 1693172563,
   "score": 59,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy007re",
   "message": "It might have been while I was working in group home care and met the family of a resident while I had been awake for the past 27 hours and at work for 22 of them. I just explained the situation and apologized, but I made a few unusual mistakes that made me seem incompetent.",
   "created_utc": 1693166263,
   "score": 11,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0bs1z",
   "message": "How “genuinely” fake they were. Like you could smell it.",
   "created_utc": 1693170945,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0cb69",
   "message": "Oh man. This girl in my 20's, name purposely excluded. \nInvited herself over with one of her friends. Got drunk. Broke a ton of shit in my apartment. Her \"friend\" left her at mine. Stupid frustrating night. In the morning she kept harassing me to drive her home. I didn't even invite her! I finally drove her to a train station, which she was pissed about.  For years after she kept blowing me up to come back over to my place. Couldn't block enough numbers.",
   "created_utc": 1693171163,
   "score": 7,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0clet",
   "message": "I was like 7-8, and I was at a party and I kept seeing this little person across the room and I couldn’t tell if they were a boy or a girl.  I walked up to them, asked them if they were a boy or a girl,. She says “girl” and then I say “ok thanks!” And walk back to my position across the room. I was an idiot.",
   "created_utc": 1693171277,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0dicw",
   "message": "I met a woman who went on to defend torture at length. Even when her arguments were debunked, she was still in favour of it.",
   "created_utc": 1693171654,
   "score": 15,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0f9aq",
   "message": "I met this woman and tried to be friends with her. But she told me I was too intense to deal with and decided to cut off contact. I still don’t know why I was called that. None of my guy friends have a problem with me and I act the same with them. \n\nIt has happened twice with two women now. It has done an impact in my desire to even meet new people.",
   "created_utc": 1693172384,
   "score": 7,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0gfbr",
   "message": "Talked to the head of machinery and saw he had a 30 yr award. I said damn thats longer than I've been alive. Stupidly, I ment it as a compliment because the guy knows his shit, didnt come off that way.",
   "created_utc": 1693172875,
   "score": 8,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0hfsu",
   "message": "working on a bar and a new guy started. busy saturday service so it was quick introductions and then get on with the serving. i said \"hi, masksignal94\" and put my hand out and he pushed my hand away and said \"er...my name's dan, actually, idiot.\" he began as, and continued to be a proper knobhead.",
   "created_utc": 1693173307,
   "score": 10,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0hjq4",
   "message": "When someone shot at me, and missed",
   "created_utc": 1693173354,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ieqb",
   "message": "Miami police officer during spring break \n\nI kept telling them I wasn’t drunk but they still arrested me because I was exercising my constitutional right to party. \n\nNext summer I’m heading to Ibiza instead.",
   "created_utc": 1693173726,
   "score": 5,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy02enh",
   "message": "Let’s just say my boss was on some bullshit the very first day I walked in, it was a very long day.",
   "created_utc": 1693167145,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy09lur",
   "message": "My wife’s cousin. First time we met we walked around a mall for a little bit, I talked with her and my wife as openly and calmly as I could. After she met me she told my wife I creeped her out because I was “too nice”. I’ve since treated her to “f*ck you you fat c*nt” for the past 10 years.",
   "created_utc": 1693170054,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy08qq2",
   "message": "So one night walking home this guy pulled a knife and started slashing at me. \nI still don't think he was all that nice.",
   "created_utc": 1693169705,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0cxoa",
   "message": "At school, i fell while playing football (soccer for americans). I fell right next to some guy i didnt know and just automaticly sat down in a sexy pose and just said: \"Why hello there\". And then just stood up and ran away. I havent really had anymore encounters  with that guy.",
   "created_utc": 1693171418,
   "score": 5,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy02x3o",
   "message": "We switched management and I offered to do photography for the company's social media. The younger boss didn't understand or value what goes into taking a good photo and asked, \"Doesn't it take five minutes to edit a photo?\" Needless to say, I didn't take any photos for them after being insulted.",
   "created_utc": 1693167353,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0dx8p",
   "message": "new coworker. bro told me he hates kanye",
   "created_utc": 1693171826,
   "score": 249,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ijb3",
   "message": "Wow, talk about leaving a lasting impression! Glad to hear you've turned things around. Cheers to your sobriety!",
   "created_utc": 1693173783,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ilh0",
   "message": "New neighbor.  First contact she starts listing all the things they moved there to do, most of which were illegal (dog related, not murder) or against the rules of the HOA. Then proceeded to complain about how bad the weather was, how there were no decent restaurants, shopping or community activities, how she would be having lots of dinner parties and expected everyone to come then reciprocate, how much she expected people to spend...on and on.  I love people that move here from out of state, then tell me how much better their old state is.  Why?",
   "created_utc": 1693173810,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0jy0v",
   "message": "I'm pretty sure it was like peter griffin or something",
   "created_utc": 1693174402,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0lbwz",
   "message": "Came to work one day when I knew a new person was starting. In the employee parking area was a car I'd never seen before using up two spaces. First thought: \"She's one of *those* people.\"\n\nAnd she was.",
   "created_utc": 1693175019,
   "score": 10,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0mdzq",
   "message": "Was recently at a little get together, and there was a stunning individual there. From the moment she first spoke, I happily assumed that our personality types were compatible as she showed signs of quirkiness and eccentricism. More often than not, these traits go hand-in-hand with my own and can usually make for fantastic conversation. \n\nUnfortunately, we didn't work out. I think it was due to the fact that she's a couple of rungs higher than I on the privilege-pole. And by that, I mean that I am at the bottom, and she's been at the top for so long that she forgot how to look down.\n\nStill, a very remarkable, kind individual. Wish you the best, Steph.",
   "created_utc": 1693175491,
   "score": 0,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0mk35",
   "message": "A friend of my wife had been unlucky in love for a long time and finally met the guy of her dreams. I hated him from the second I met him. He had these beady little evil eyes, weak handshake, squeaky voice and he just felt very slimy. He could not look anyone in the eyes when he spoke and he was very gropey. He kept saying he works in intelligence and none of us pushed it any further than that, but he kept trying to make it a point that he was a spy for the Government. Alarm bells were going off in my head all night and the next day I had to tell my wife's friend to be careful but she made me feel like shit because she thought I was trying to sabotage her final chance at love. About a year later, she finds out the weed has a wife and family, he did work for the government but only as an accountant. He had basically been preying on her vulnerability and fabricating this elaborate story to keep her on the hook. They had an investment property they were remodeling which he pretended was his own house and thats where he took my wife's friend.",
   "created_utc": 1693175569,
   "score": 8,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy16wfl",
   "message": "It was an old school friend's partner I'd never met before. My friend's parents emigrated in the late 1960s and we were penpals after she went to NZ. Her partner was coming over alone for three weeks for some research to do with his MA at Otago University in Dunedin and I said he could stay with us. This was back in the 90s. When he turned up at our door he was in shorts and a vest and waving a bottle of spirits in one hand and a skateboard under the other arm. He was heavily tattooed (including his face) and dreadlocked. I maintained a friendly smile but my heart did sink, I can't lie.\n\nI was so very, very wrong. Brilliant bloke. I didn't know he was half Maori and had never encountered Maori tattoos before. The spirits were for us (he's teetotal) and he was a great house guest, always cleaned the bath after he used it, bought food and cooked really brilliant meals, very funny, the cats loved him, he took the dog for walks (who spent about three weeks gazing adoringly at him and slept at his feet) the kids and my husband loved him. He taught my kids the Haka. My kids got major kudos because the cool Maori skateboarder was staying at their house. When he left he gave us a beautiful framed drawing he'd done of a native NZ bird on a Manuka shrub as a thank you present. It taught me an important lesson. First impressions can be very misleading. I wish he'd been here for more than three weeks (although he's visited since).",
   "created_utc": 1693184856,
   "score": 29,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0x7nu",
   "message": "I was 19 years old and just starting my first real full time job. I was taken around by the foreman and introduced to my new co-workers. All was well until I was introduced to Walter, the resident old prick, who was to be my supervisor. He took one look at me and said, \"When are are you quitting?\" I never even got a chance. He rode my ass everyday. He told the boss I was no good and I should find another job. He got fired 2 months later for being a dick to everyone. I lasted 36 years.",
   "created_utc": 1693180403,
   "score": 21,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0wf3h",
   "message": "I was a lifeguard at a summer pool. It was run by the small town, and was fairly large (50M and a diving area), so needed 5 guards on deck at all times.\n\nThe parks and recreation director, who I had never met before, comes by to check out how things are going. At this particular moment, I am the lifeguard at the bottom of the water slide, where there is a slightly elevated guard chair to sit in with a high back rest.\n\nThis day was very slow because it was cloudy out and dark storm clouds were slowly rolling over the pool. As there is only one swimmer in my entire area (a little girl that is just going down the slide over and over again and can clearly swim fine in the 3.5 ft depth), I am looking up at the sky for some time to look for any lightning that might strike so I can whistle for the pool to shut down (any lightning strikes at an outdoor pool require you to clear the pool until no strikes have occurred for a certain period of time).\n\nWell, I am wearing sunglasses at the time purely out of habit even though it wasn’t really that bright out. What I failed to think about was how I was coming off from the other side of the pool. Apparently with my sunglasses on, it looked as though my head tilted toward the sky was me resting my head back on the back rest with my eyes closed taking a snooze while actively on duty.\n\nEven though I am completely aware of my surroundings and know the director is watching across the pool, I hear “HEY, WAKE UP. YOU DONT GET TO NAP BECAUSE ITS SLOW”\n\nI immediately jolt up confused and gradually begin to realize he is talking to me. I yell back that I was watching the sky for lightning, and he just turns and goes back to the office without responding.\n\nWhen my rotation is done, I go back to the office and get told by the head guard that I am going home for the day and am told my shifts for the rest of the week are going to be covered by other guards, and I can pick back up next week.\n\nImmediately, I am both upset and frustrated as I was very much awake and aware of what was going on. I ask the head guard to give me the directors number so I can call and explain myself and apologize for the misunderstanding.\n\nI call and very quickly get cut off as I am explaining myself to be told this guy knows when someone is sleeping on the job and that I need to accept the consequences before I get fired altogether. At this point, not wanting to lose my job, I just say okay and get off the phone. I was furious and left without saying anything to anyone. Still makes me mad to this day lol",
   "created_utc": 1693180044,
   "score": 14,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1ekz6",
   "message": "This guy i went on a date with ( note 29M ), we went to my friends restaurant ( note : she is nepalese ) the restaurant serves strictly typical dishes from China and Nepal ( He didn't know, and I went there just to be in a general safe place , also her cooking is amazing ! )\nHe had previously told me how he was fluent in Japanese. ( and how he liked anime , and Japanese culture )\nAs we were talking , I did the whole order, and while waiting he is talking about his love for Asian food and culture, I mostly listened to him then talking about this trip to Taiwan, and has she serves the food, he turns to her and does a small bow and says \" arigato \" and having his hands together.\nShe looks at him in shock, and then looks at me for a second.\nShe gives a small chuckle , says \" have a good meal \" and walks away.\nAs he starts to eat I ask him why he did that, and he goes \" oh I'm just appreciating the culture\" , I go \" oh ... Thats nice, but she's Nepalese, he goes \" oh yeah but in Japan -- \"\nAnd goes on this massive talk about Japanese cultural habits..\nNote : he is white.\nI never felt so confused in my life... I do enjoy other cultures, but this just seemed a bit off to me.\n( plus turnes out he knew Japanese words from anime, like loose words or quotes , not the language per se/ how to speak)",
   "created_utc": 1693188555,
   "score": 8,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ssn8",
   "message": "When I was fifteen, I was waiting for my parents after church service finished. Some weird old guy, who I’d never met before, walked up and hugged me and I was so taken aback I went along with it. Then he rambled about how he used to give my grandpa back rubs. \n\nPSA, everyone: Hugging random teenage girls on your first time meeting them makes you look like a giant creep.",
   "created_utc": 1693178399,
   "score": 7,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy19vfz",
   "message": "A new hire I was supposed to train, let's call him Chad because that's his name, came in on day 1 and said during introductions, \"Some people say they're a jack-of-all-trades, but a master of none; not me, I'm a master at everything I touch,\" and that was that, instand dislike. He was gone the next day lol.",
   "created_utc": 1693186280,
   "score": 8,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy13f9j",
   "message": "We had a plumbing issue at our house, some dumbfuck from applewood plumbing and HVAC shows up, doesn't even look, tells my wife it's going to be 10k to fix due to a grease trap. Then tells her she should check with her husband before spending the money. Was 800 bucks to fix through another plumber. \n\n\nApplewood plumbing and heating is total fucking garbage, fuck their company, 100% stay away from them.",
   "created_utc": 1693183243,
   "score": 5,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1eeii",
   "message": "For me? I was 13, my brother brought home some college roommates with no warning, and I was (apparently) having a bad enough hair day to literally *dive* behind our couch to hide from them. My mom called me to come introduce myself, and I continued to hide, but when my mom sent my little sisters to find me, I was worried I’d get found so I *popped* up out of nowhere and said hi, still standing behind the couch. \n\nTo this day my brothers roommates said they was one of the funniest things they’d ever experienced, lol, and  one of my cringiest memories. Haha!",
   "created_utc": 1693188468,
   "score": 6,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy178ac",
   "message": "This guy who was my boss back in 1984. He wrote me up for crashing a machine. The manufacturer from Japan had to come and fix it. My boss thought a lot of himself, too. I ended up marrying him in 1988. We're still together.",
   "created_utc": 1693185014,
   "score": 4,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1exby",
   "message": "When I was dating my wife, she and I went out to dinner with her friend, and the friend's husband. I knew the friend, and she was great. My wife really liked the husband and thought we'd hit it off.\n\nDuring dinner, his wife basically waited on him, he made several crude jokes at his wife's expense, his table manners were quite bad, and about the only thing he seemed to want to talk about was Pokemon (we were in our thirties, at a romantic dinner with our wives).\n\nAfter the dinner, I told my soon-to-be wife that the guy creeped me out, and I didn't really want to hang out with him.\n\nA couple of years later he went to jail for being a child molester.",
   "created_utc": 1693188720,
   "score": 5,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0px2t",
   "message": "When I met my now mother-in-law. She treated me like\nI was not an adult. But a child. Even threatened to spank me.",
   "created_utc": 1693177094,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0xeo5",
   "message": "When I was around 10 years old a kid at a party wanted to have a sleepover at my house but even though our parents knew each other we didn't. We were tired so we just went straight to bed, but when I woke up he was a foot away from me staring at me. Now we've been best friends for 15 years",
   "created_utc": 1693180493,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy165sf",
   "message": "Ha so I have a good story for this. I was out a few weeks ago at the club with a few friends and my sister. She ended up dancing with this guy who seems like a good guy - she’s super into him (even though she’s trying to keep it under wraps, I see right through that lol). Anyway, he seems cool, but turns out that guy is there with his sisters and two other guy friends and they actually all seem super douchey and like they think they’re so great just because they’re from [big city in our country]. 🙄 \n\nThen it gets worse 😆 My friend and I are standing at the bar waiting to get our drinks and Sister’s Hot Guy goes up to his friend and starts trying to convince him to dance with me (which…okay, dude, that’s sort of sweet, but so old fashioned). Then this POS literally - and I mean literally and he knows I’m the chick whose sister his friend has been trying to get with all night so best wingman in the world or what lol - this POS says my sister is the only hot chick in the room, and I’m “okay looking” but not enough to want to dance with. 😆\n\nWhatever, I don’t even care, fuck that guy 😆 he’s such a douche it would suck if he was into me.",
   "created_utc": 1693184505,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy16o6w",
   "message": "One of my first day’s station to my very first assignment overseas when I joined the Air Force. This guy who is probably six years older than me, and is a Staff Sergeant is walking by carrying a box. Someone stopped him to introduce him to me, and the very first thing he said to me was, “Your hair is touching your collar.”  (Out of regulations, but really, barely, and he could have said hello first.)  \n\nWe were professional and cordial to each other in the years that we worked together, and I’m not quite sure how this happened, but by the time we both got stationed back in the states, we became very close friends. He’s my best guy friend. 38 years and I still tease him about that first encounter. 😄",
   "created_utc": 1693184748,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy17r74",
   "message": "I was invited to a party that  grandmothers neighbor was having. my grandmother wasn't feeling up for it. But I went anyway by myself.  the room was filed with strangers. The only person I knew there was my  grandmothers friend and neighbor.   this guy comes in the house like he owns the place with this ridiculous swagger of a walk . All chatty and smiling and laughing  with the other guests. He comes up to me and his smile disappears and he says. \"Who the hell are you?\"  I started to  explain who my grandmother was, but I was interrupted by the other guests who were chastising him for being so rude to me. And rightfully so.  Anyways that's my worst first impression story.",
   "created_utc": 1693185265,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1bc4z",
   "message": "One time I walked into the front area of a crowded restaurant and immediately threw up on the floor. I was absolutely embarrassed and offered to clean it up but they asked me to leave.",
   "created_utc": 1693186986,
   "score": 3,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0qyxh",
   "message": "My stepmother. We sat down for a spaghetti dinner and she smacked me hard with a fork. For not twirling the spaghetti on a spoon. \n\nI was just twirling it on my plate with a fork.",
   "created_utc": 1693177576,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0xo9s",
   "message": "I leant across a table to shake the hand of a new work colleague during a training session and the table collapsed, spilling her hot, freshly-poured cup of tea in her lap.\n\nI don't remember ever interacting with her again after that day.",
   "created_utc": 1693180615,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy12hdq",
   "message": "My ex's bf punched me, not a word said, he thought I was following her when I showed up to mutual friends party, which I was invited too. I hadn't seen her in a year and didnt know she would be there.\n\nHe was kicked out, soon after she broke up with him when he became abusive to her. He was a paranoid psychopath.",
   "created_utc": 1693182818,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy13w4e",
   "message": "first thing my precalc teacher ever told us is that he hates babies\n\nit’s fine to not like babies but is that seriously the most important part of your personality 😭",
   "created_utc": 1693183459,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy19uxe",
   "message": "Shook the hand of a coworker's son when we were introduced. I could not get my hand back fast enough. That guy gave me the creeps so badly; I hope to never see him again for as long as I live",
   "created_utc": 1693186273,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1bdn7",
   "message": "A friend of my ex's.  I have a messed up right leg, the bones turn out at the hip, knee, and ankle so my foot is at an angle all the time.  First thing this guy ever said to me was \"BOY WHAT THE HELL IS WRONG WITH YOUR LEG?\"",
   "created_utc": 1693187006,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1c0bd",
   "message": "On my first date with my now wife of 10 years, we went to a concert. Her brother was going to be there as well, so she was really excited for us to meet. She and I weren't there long when she got a call that he had drunk way too much and was being taken to the hospital. We left the concert to go see him at the hospital and the entire time, he was cussing at me and kept calling me \"Lance\"(apparently the name of the hospital's security guard) and he kept saying that he was going to fight me. To this day, I have never seen the man drunk again. Actually a pretty cool dude.",
   "created_utc": 1693187313,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1cced",
   "message": "A few years ago I was about to start a bonfire with some friends. Some new guy (friend of a friend) came by. The group left to get drinks. Dude walked into the 7/11, grabbed 12 cheese sticks, and ran out without paying, leaving the rest of us in the store. I don’t come across him often, but when our paths cross, all I can think of is how he stole 15$ of low quality cheese the first time we met.",
   "created_utc": 1693187475,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1e6g2",
   "message": "Had a new hire on day one say we should really be more open to other perspectives and suggested we read mein kampf. Then he said he’d been a crime scene cleaner in a past job and offered to show us some dead bodies he kept on his phone.",
   "created_utc": 1693188361,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1fz2h",
   "message": "it was my first night out as a freshman in college. i got invited to a girl's dorm room and she had a bunch off people over. i met all of them that very night, but i'd eventually ruin things by getting black out drunk, puking multiple times, and having to be dragged out of the dorm room by 3 or 4 people.",
   "created_utc": 1693189231,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1iefr",
   "message": "Drunk friend of a friend was passed out in my basement.\nI went to check on him and he sprang up to throw up. I very quickly handed him a clean, Rubbermaid type smaller garbage can. He shoved it away, stepped forward a couple feet and threw up directly into our washing machine. After having opened the lid, thankfully.\nMy wife was thrilled.",
   "created_utc": 1693190413,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1koct",
   "message": "Many years ago, a man I was casually seeing had a female friend whom I had heard was a bit, shall we say, off-kilter, and they both liked their weed.  Upon meeting me, she said, \"He says you're a Christian.\"  Of course I was not going to deny this, so she asked me, \"So, does it say anywhere in the Bible that Jesus ever got high?  BWA HA HA HAHAHa.\"  \n\nYeah, not a good first impression.",
   "created_utc": 1693191558,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1l1e5",
   "message": "My roommate at my first uni complained about getting not enough financial aid and how it was unfair bc her family only vacations in Martha Vineyard once a fucking year. One of the most insufferable people I have ever met.",
   "created_utc": 1693191747,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1l47s",
   "message": "I met a friend of a friend and I asked what her ethnicity was, since her name was Spanish. She said “oh I’m Filipino and white but not the colonizer type” UNIRONICALLY. I chuckled thinking she was joking but she got offended.",
   "created_utc": 1693191788,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1nt6s",
   "message": "Being visually impaired and having eyes with no irises with eyelids that won't open fully, the department manager couldn't look me in the face on our first meeting almost 2 months into the contract job. I got a call later that day from my recruitment agency saying the company were giving me my 1 week notice. Coincidentally, the previous day I had also spoken to the agency about some great feedback they had been getting and how they were happy they had got me in.\n\nWent to an eye gazing speed date thing, i.e. instead of talking to different people for 5 mins you only gaze into their eyes trying to communicate all and sundry. My lack of irises and involuntary eye movement gave her motion sickness and she suddenly got up, grabbed her mouth, and ran for the toilets. She never came back so that I could apologise and explain. I did get the host to send her message after the event to check if she was okay. Her response suggested she thought I was trying to hypnotise her and her sickness was caused by her body repelling my devilish/cultish pagan rituals.",
   "created_utc": 1693193231,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1nxql",
   "message": "I guess it wasn't really bad, but it was weird.  \n\nI was getting ready for work, went outside for a smoke, and my upstairs neighbor said hey,  from her balcony.  She wanted to introduce me to her visiting sister, so I said 'hey there how's it going' and pointed at my name tag while saying 'I'm Bob, of course'.  The sister looked at me a bit weird, but I didn't think much of it.\n\nThen I went back in to finish getting ready, and realized I did not in fact have my work shirt on yet, so there was no name tag.  So...as far as that lady knew, I just said my name and randomly pointed at my manboob.  Like, \"Hey, I'm Bob...check THIS out.\"  \n\nI mean, you can't go back and explain at that point.  I have no idea what she thought of me but I am guessing it was somewhere between moron and weirdo, and I never tried to find out.",
   "created_utc": 1693193302,
   "score": 2,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1qc8e",
   "message": "First time I met my best friend's dad I drank a six pack of Mike's Hard Lemonade in 45 minutes and tried to fight him. I was 19 and he was a lot bigger than me. We get along fine now.",
   "created_utc": 1693194631,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0ojno",
   "message": "I met my new platoon sergeant when he had to come pick me up after I was arrested...",
   "created_utc": 1693176472,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0noe6",
   "message": "So, for context; I was driving to my first job shift when i somehow ended up right next to my manager by the stop light. But get this, this was when i was belting out a 70s tune out loud with my windows rolled down, and that time i let loose a swear word! He and i stared at one another for a while, even after the light had turned green and finally he started laughing and i joined in the laughter! Emberassing at first but we got past it and i still held the job after that shift!",
   "created_utc": 1693176079,
   "score": 0,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy1ijb7",
   "message": "Just a personal dating vent here. \n\nThere was a woman who I spoke to on a Muslim dating app Muzmatch a few years ago. She asked me a lot of questions.\n\nBasically, she opened up about how she had just gotten out of a marriage with an abusive husband and wanted to make sure it was okay to talk to me about abuse. I said I would, but I did mention sometimes it makes me uncomfortable, referring to how many of my friends have opened up to me their stories, and I was still dealing with my own trauma.\n\nI wasn't ready to talk about the subject so quickly and immediately, but she kept getting pushy in trying to understand why I felt uncomfortable. She said, \"Why do you feel uncomfortable?\" | said, \"It's a very sensitive subject and I have friends who have been through things like that.\" She continued, \"But why do you feel uncomfortable?\"\n\nShe accused me of stigmatizing abuse - saying that as a South Asian Muslim man - our families often stigmatize abuse and treat women poorly. When I expressed discomfort, saying I didn't want to talk about it, I said “Please, i don't want to talk about this\". She just said \"Very well. We won't talk about it.\"\n\n(Just to put things in context, she wanted to know so much about me - scouting my social media - while she blurred her own profile picture.)\n\nI later told her I felt like she just interrogated me with force and wasn't okay with it. I blocked her.\n\nI understand that, for her, a Muslim woman seeking out potential partners, she wants to be careful/cautious about potential sexism/abuse from Muslim men. She's trying to protect herself as a woman and collect information about me. I understand that.\n\nTruthfully, even with that, I still perceive it as racist/Islamophobic. I can be empathetic and accomodating to understanding her needs and concerns, but if she crosses limits and accuses me of something on the grounds of my race/religion, yes, I’m not okay with that. \n\nMen, don’t put up with this. Know your worth.",
   "created_utc": 1693190480,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0pwvj",
   "message": "My uncle, he molested me after I stuttered",
   "created_utc": 1693177091,
   "score": 0,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0rpb2",
   "message": "Walked up to me with My friends (i know surprising I have friends) and asked, \"do you beat you meat.\" I replied, \"no.\"",
   "created_utc": 1693177909,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0teo0",
   "message": "A date, the moment we made eye contact we both new it wasn’t going to work out. It was the most awkward 45 minutes of my life.",
   "created_utc": 1693178675,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0vu30",
   "message": "My new boss coming in lat at my budget meeting. Everyone having a great time and asking questions and he walks in, says it's all details and he wants me to cut it short",
   "created_utc": 1693179774,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0xmlh",
   "message": "That I’m shy and quiet. I might be around someone new but doesn’t last.",
   "created_utc": 1693180594,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy0y81t",
   "message": "So me, my brother, his girlfriend, his friend, and his friends dad goes out to eat at Applebees couple years back, and out of know where, my brother’s friends dad says to me “so this kid is special, right?”",
   "created_utc": 1693180871,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy12mo6",
   "message": "Whoever it is wasn't memorable enough to go on about now.",
   "created_utc": 1693182884,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy15vi4",
   "message": "Years ago. I don't even remember his name. I met him and wanted to rub his face on hot asphalt.",
   "created_utc": 1693184370,
   "score": 1,
   "submission_id": "162zu8s"
  },
  {
   "comment_id": "jy16ycb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162zu8s"
  }
 ]
}