{
 "submission_id": "16316r9",
 "title": "[Serious] what’s the creepiest/paranormal activity you ever encountered?",
 "selftext": "",
 "created_utc": 1693168416,
 "permalink": "/r/AskReddit/comments/16316r9/serious_whats_the_creepiestparanormal_activity/",
 "score": 37,
 "url": "https://www.reddit.com/r/AskReddit/comments/16316r9/serious_whats_the_creepiestparanormal_activity/",
 "comments": [
  {
   "comment_id": "jy05jo3",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1693168418,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy0reet",
   "message": "\nBit of background. When my wife was young,  her parents and siblings lived with one set of her grandparents. Her grandfather was murdered in the home.  It happened in his bedroom upstairs.  The room was used primarily as storage for the next 20+ years. Her parents tried to sell the house multiple times, but living in a small town, everyone knew and the house would not sell, so they stayed. \n\nYears later, and while my wife and I were engaged, there was a murder trial which I attended in support of her family.  I saw the crime scene photos (important later). \n\nAnother few years later, we had 2 kids, the oldest was 6 at the time.  My wife's family does not talk about the murder, and our kids do not know about the murder to this day.  \n\nMy FIL decided he wanted the room where the murder happened to be a hangout for the grandkids when the family was in town.  He put sleeping bags and a tv in the room ahead of a holiday, days-long get-together. We didn't like it but stayed silent since the murder was a sore subject.  My FIL also wanted all the grandkids to all sleep in there together. \n\nWe were the first to arrive and my son went into the room alone.  He usually couldn't sit still long at that age, so after a couple of hours I decided to check in on him.  Here is our conversation: \n\nDuring the whole converstation, he was still and rigid and would not look away from the tv.  \n\"Hey buddy, is everything ok up here?\"  \n\"Yeah.\"  \n\"Ok, have fun!\" \n\"Daddy, do I have to sleep in here?  I don't want to.\"  \n\"Why not?\"  \n\"I am not alone.\"  Every hair on my body stood up. \n\"Well yeah, I'm here with you buddy!\" \n\"No, there is someone in here with us\"  \n\"Are they nice? Mean? A grown-up?  A kid?\"  \n\"A grown-up.\"\n\"What are they doing right now?\" \n\"They are watching you.\"  \n\"You have never said anything like this at your grandparent's house before and you have been here a lot.\"  \n\"They don't leave this room and I have never been in here before.\" \n\"Where are they now?\" Without looking away from the tv, he points to the far corner where his great-grandfather was murdered and said, \"they are standing over there. They don't move much.\"  \n\"Ok buddy, you don't have to stay in here,\" and he left the room with me. ",
   "created_utc": 1693177771,
   "score": 100,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy0b6fk",
   "message": "I worked in an elderly carehome doing Nightshift ,a lady named Elizabeth who had Alzheimer's came down which was scary In itself in her long nighty , she told me all about living in Sheffield,her parents and her love of church music ,I had to go check everyone and do some toileting,not a huge home about 12 residents ,when I got to her room she shared with another lady I found Elizabeth in bed passed away. To this day I don't know if I'd sat chatting to her ghost or she had gone back to bed and died. I spent the rest of the night sitting by the phone frozen .",
   "created_utc": 1693170697,
   "score": 244,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy18alp",
   "message": "Ex husbands family owns a massive farmhouse that was built in the late 1800's and has been passed down through generations. They inherited from a pair of bachelor brothers and their sister, \"Aunt Kate\". So it goes she died in the attic so thats why you hear pacing up there at night. She loves to take things like exMil's jewelry and move it around the house.\n\nThe music room used to be used as the funeral parlor for that area way back in the day. They had the original furnace in the basement that looked big enough to burn bodies. One time I came home and noticed my cat was halfway off the ottoman kneeding with his paws like something not there was petting him and holding the front half of him. I went over and ran my hand under him but not touching him and he fell down. \n\nEx was woken up one night with a lady in white standing over him staring down at him. Ex is an electrician/farmer who wouldnt make shit up. \n\nAunt Kates room that she once lived in is freezing cold all year round. Theres no a/c and it gets hot and humid in that house. One time I slept in there and had 7 quilts on in the middle of summer. I went to bed with the door closed, they all squeek loudly when opened and the wood floors squeek too. In the middle of the night I sort of woke up feeling hands going up and down me tucking the blankets in my sides like you do with little kids. I opened my eyes even though I was terrified and nothing was there. The door was open too which would have woken me up from loud squeek.\n\nEx remarried and had a daughter who always sees an old man in overalls at the top of the stairs who doesnt wznt her to go up. Shes 10 now and has seen him constantly since she was little.",
   "created_utc": 1693185521,
   "score": 80,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy0ygu2",
   "message": "I stayed in my wife's room at her mom's home in Yorktown, Va when our first child was born. I would always observe my infant talk to something in the room. He would cry nonstop and then would start cooing at something or to himself. One day, while i was sleeping i felt something choking me.. i opened my eyes thinking it was a nightmare,  and still couldn't breathe. This went on for 5-10 seconds longer. I've always felt creeped out in that room. \n\nWeeks later, i mentioned this story to my wife's best friend, and the same thing happened to her..\n\nNever believed in ghosts, but there is something going on at that house.. i know there used to be slave plantations around that location back in the day..\n\nTldr~ got choked by a ghost in my wife's mom's house",
   "created_utc": 1693180982,
   "score": 107,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy10xjr",
   "message": "In high school, I was babysitting for a single mom and her two kids. It was the middle of winter and when I arrived it was already pitch black out, around like 6PM. She lived in a duplex.\n\nWhile I was standing in the living room with her and her girls talking about how the rest of the night would go, a little boy in full snow gear came in through her front door, stomped through the living room past us and headed down the stairs to the basement. The mom never even looked at him or stopped talking. The girls didn’t make any acknowledgement that they saw him.\n\nI was super weirded out but I was also an extremely introverted teenager so I didn’t ask the mom what was up. \n\nOnce the mom left, I asked the girls who the little boy was that came in and they both had no idea what I was talking about. So I got brave and grabbed a broom and headed downstairs. It was a small unfinished basement, one single room with no closets or anything.\n\nNo one was down there and the little boy definitely had not come back upstairs in that time.\n\nSo, so weird and the only time I have truly believed I experienced something paranormal; I normally scoff at ghost stories and stuff.",
   "created_utc": 1693182112,
   "score": 141,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy11yum",
   "message": "Not nearly as creepy as the other ones but one time I was walking to my friend's house in the fog as they asked me if I wanted to hang out with them.\n\nI live in an estate, and there are 2 paths to their house, side by side. One is paved and the other one is a gravel path surrounded by trees and grass. \n\nBecause it was foggy out, I took the paved path as it was more open and felt safer. I have a habit of glancing around as I walk and when I looked in the direction of the gravel path I saw a weird shadowy figure in the trees. It was tall, skinny, and I couldn't see its head. Was as tall as the trees I'd say. Creeped me the hell out. It wasn't moving or anything, and honestly I think it would've been much worse if it did.\n\nFucking hope it's just a hallucination",
   "created_utc": 1693182584,
   "score": 29,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy071gr",
   "message": "I've mentioned both these stories on Reddit before so apologies if this a redux:\n\n1) at an old Norman castle in South East England (the one with a single round tower) was playing hide and seek with my sister. Found shelter in a small archway under the castle walls above what used to be the moat. Was hiding and peeking around the wall when I heard a voice in my ear saying \"Go\". I ran for my life and never looked back. I swear that castle is haunted.\n\n2) living in a victorian two-up two down (again SE England) with an outside toilet with my first seriois long term partner as an adult. We moved in and placed the rabbit Hutch in the yard outside between the kitchen and old toilet. The rabbit died frothing at the mouth within an hour. Several weeks later, sat watching TV in the front room and a picture we had of dolphins just lifted off its nail, floated about 12\" off the wall then fell to the ground and shattered. We moved out when the 6 month tennancy was up",
   "created_utc": 1693169019,
   "score": 84,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy16aik",
   "message": "I'm from Vancouver BC. Wife and I stayed at The Empress (known for being haunted etc, google it) hotel in Victoria for my sisters wedding weekend. Nothing weird happened while we were there, but when we got home back to Vancouver on the Sunday night, my wife was unpacking both our suitcases to do laundry etc. I hear here from the laundry room say \"What the FUCK?!\". She comes out holding some clothes. Says where the hell did these come from? It was a set of women's flannel pyjamas. Very large. Like it could have fit me (6-3 240). But they looked like something a 90y old granny would wear. We googled the brand on the label, was some mom and pop shop in a southern US state, can't recall which. They only sell at local farmers markets etc. Weird.",
   "created_utc": 1693184568,
   "score": 34,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy16o3a",
   "message": "Bit of background: My dad was in the military and was stationed in Germany when I was a kid. My home school group traveled to a ruined concentration camp as a field trip. All throughout the tour, I felt like someone was watching me and more than once I swore I heard crying. \n\nWhen we went through the “shower,” I nearly screamed because I felt something push against my back towards the wall. I told my parents I wanted to go home then and there. Unfortunately we had to finish the tour.",
   "created_utc": 1693184746,
   "score": 37,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy0dr3z",
   "message": "the ghost of a former owner is here in my house.\n\nI've seen her 3 times, always in the hallway.\n\nwe expanded the bathroom and covered the bathroom door and made another door to the bathroom from the laundry room\n\nevery time I've seen her, she comes out of the wall where the old bathroom door used to be.",
   "created_utc": 1693171755,
   "score": 76,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1dx5g",
   "message": "When I was a teenager my bedroom was in the basement. You could hear clearly anytime someone came down the stairs and my bed was creaky. Like lay down, sit or move and the springs would let anyone nearby know creaky. \n\nI was just starting to fall asleep one night and heard footsteps. I thought, No big deal. it's probably my mom coming to do laundry.' Fell back asleep. I felt pressure on the bed behind me (I slept with my back to the stairs) and it creaked. Everything in me was screaming don't move. Don't move just lay here and don't move.' I eventually fell asleep out of exhaustion. This happened multiple times and one night I had enough of being terrified and when I heard the creak(I hadn't moved to do it) and felt the pressure next to me, I rolled over and sat up. Nothing. There was nobody physically there. \n\nI've experienced things before that and since but that was the one that freaked me out the most.",
   "created_utc": 1693188237,
   "score": 38,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy12d6n",
   "message": "My mom and I went to the Flight 93 memorial in Pennsylvania a few years ago on a cold, snowy winter day. I think there were only 2 other visitors there who had left by the time we walked down to the wall with the names of the victims on them, which is the field where the plane crashed. We were standing there then suddenly heard all these voices. It sounded like a big group of people talking loudly. We didn’t think anything of it because we were reading the plaques but the second we got back to the car we both mentioned hearing a bunch of people talking/yelling and realized there wasn’t anyone else even close to there.",
   "created_utc": 1693182766,
   "score": 54,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy10ctn",
   "message": "I have a haunted house in SC.\n\nIt’s an old plantation house that is abandoned now but we still own it.\n\nOne time we heard something jump off of a bed upstairs and footsteps right after. Like a dog. But the only dog in the house was right next to my feet. This sound repeated every 10 ish minutes for at least an hour. Only after I checked the room did the sound stop.\n\nAnother time I was home alone and heard a loud crash. Like something got smashed. I ran to the dining room (where I heard the noise) and the giant painting above the fireplace was on the ground very broken. However, the giant nail holding the painting in place was still there, at an upward angle. The string to the panting was still intact. The ONLY way that painting would have fallen is if something picked it up and smashed it. I then thought there was someone in the house, so I called the cops. This giant ex-football SC trooper showed up, tough as nails kind of guy. He searched the house with me, had his gun drawn, and was visibly shaking. He dropped his gun twice, shaking. He left shortly after not finding anyone, and floored it out of the driveway.\n\nAnother time I was lying in bed sick, and there is a closet with an old door handle. It’s also really hard to open. It had a giant latch and the wood door grinds against the floor. So here I am, in bed, and the handle starts turning. The door opens, just a crack, but it opened. Idk how, but it fucking happened. I ignored it and went to bed, thinking it was a dream and I was just sick dreaming (you know how those dreams can get crazy). Well I wasn’t dreaming because when I woke up boom it was still open.\n\nThe next day, still in bed sick, I remember vividly my right hand trying to strangle me. I know that sounds crazy but I was choking myself and I couldn’t stop. I had to use my left hand to stop myself. Eventually I regained control of my right arm/hand but I never forgot what happened. Same room, same bedroom (it was the master bedroom).\n\nAnother time I remember seeing a young girl walk the halls. She was wearing a blue dress and had blonde hair. She never did anything to me, didn’t scare me, she was just there. She disappeared after walking into the green room (a room with green walls, this house has like 5 living rooms).\n\nThere is also a graveyard next to the property. Over time the land was sold off, so we don’t actually own the graveyard. In the graveyard there are graves going back to the 1700’s and there is a grave of a baby. Definitely the original owners of the house.\n\nWe also got shot at by a crazy neighbor one Fourth of July. His name was Willy. Why do I know this? He came to our front porch one time, shirtless, to introduce himself. He had a giant scar on his back. He asked us to make sure to put away the lawnmower because people might try to steal it. (The lawn mower was on the other side of the property, hidden, the only way he could have known we had one was if he was wandering our property.) Anyways, he shot at us, barely missing my brother in the head. Willy’s house burned down shortly after, with him in it.\n\nWe don’t go back there anymore :/\n\nEdit: spellchecks",
   "created_utc": 1693181849,
   "score": 64,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1esit",
   "message": "When I was pregnant and alone in bed, I’d hear scratching/tapping coming from inside my walls nearly every night. I’ve had squirrels and mice in my walls before and know how they sound, this was different. It would start right by my head and slowly make its way up the wall to the ceiling then turn and start down the other wall on the opposite side of my bed. Every night for like a month this would happen but I was so exhausted, I would just force myself to sleep.\n\nThen it all came to a head one night: the tapping/scratches would start as normal up the wall but then it stopped when it got to the ceiling. Next thing I know something has LANDED on the tops of my blanketed legs. It felt like a cat or something. I screamed, turned on the light and tore out of bed. Nothing was there. I checked the entire room, under the bed..in the closet. Nothing. I slept down on the couch that night.\n\nThe next night the scratches/tapping starts up *again* on my wall but I had had enough at this point. I yelled loudly into my dark room, “Knock it off tonight! I want to sleep!” And it stopped! Just like that. Never heard another tapping or scratching sound again. The fact that it was intelligent enough to respect my wishes though is what scares me the most.",
   "created_utc": 1693188656,
   "score": 65,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy05s2k",
   "message": " One time, in the dead of night, I heard a faint whisper coming from my closet. When I investigated, there was no one there, but I couldn't shake off the feeling of being watched. It was downright chilling. \\[Serious\\]",
   "created_utc": 1693168511,
   "score": 59,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy0dpv6",
   "message": "I wish I could find the picture but when I was young we lived in a really old house and someone took a picture of me playing on the floor. Years later I was looking through the family photos and noticed that it looked like a black shadowy dog was coming through the window. It might not be paranormal, it might just be 2000s disposable cameras being garbage but it creeped me the fuck out.",
   "created_utc": 1693171740,
   "score": 29,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy11rvk",
   "message": "As a kid in my bedroom I always felt like I was being watched from one particular corner. It always felt darker than the rest of the room as well.  Something would talk to me at night. Very up close and a whisper like in my ear. \n\nNever knew what it was but sure as hell know that after I left that house I never heard it again.",
   "created_utc": 1693182497,
   "score": 35,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy15vda",
   "message": "A series of experiences:\n\nFor as long as I can remember, I’ve seen shadows and heard creaking, closing doors, misplaced items, and other unexplainable things throughout my childhood home. I’ve ask always watched horror movies and scared myself by reading creepypastas; which means I had several different escape roots planned out depending on where the serial killer that was obviously going to come for me tried to get in. One day when I was in high school, I was home alone after school, sitting in the living room watching TV. From the mud room that connected the living room to the garage, I heard a loud bang like someone smashing their fist against the door connecting the garage and mud room. Ran up to the kitchen with my phone, grabbed a knife, and peaked over the counter out the window towards the front of the house. No one is outside, no cars, and the garage door was still closed meaning no one got into the garage, no wind slammed the door. I eventually talked myself out of the whole serial killer thing, but I haven’t been able to explain it and it hasn’t happened again.\n\nA different night, my parents were gone when I went to sleep. I wake up to knocking on my bedroom door - my parents wouldn’t have knocked to check in on me sleeping. Without access to a weapon, I froze, because obviously THIS time it’s gonna be the serial killer, and just laid there for 10 minutes. Never heard any footsteps. Nothing. Got up and went to my parents room, they were both fast asleep. So it’s not even like they had just come home when I heard the knocking.\n\nA different day, I set a water bottle on the kitchen counter and continued walking towards the hallway. A couple seconds later, I hear the bottle fall. But when I get back into the kitchen, the bottle is across the room. Yet another day, I was home alone in the living room when I heard a sneeze from back towards the bedrooms. My first instinct was to say “bless you”. My second thought was “didn’t my boyfriend leave 30 minutes ago?”\n\nDuring college, I came home for a break. I had to sleep in a loft bed, and I brought my sisters dog up with me because she liked to cuddle. I was woken up by both the feeling and sound of someone climbing up the ladder - which I was very acquainted with at that time. I could feel my sisters dog against my leg laying between me and the edge, when I felt something pet down the blanket like they were petting the dog. I must have moved, because the dog realized I was awake and immediately turned around to jump onto my chest with her ears down, shaking.\n\nThe intensity of events has toned down quite a bit. But for a stretch of time, something wanted to make itself known",
   "created_utc": 1693184369,
   "score": 20,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy0mmt9",
   "message": "My house was built in 1962 and has only had 1 owner. That owner passed peacefully in her sleep in the house. Every now and again I feel her presence when I'm doing things like using the laundry line and digging in her garden. I've seen her at night in my kids rooms but she has a comforting grandmother feel so I leave her.\n\nThe creepiest was the man in my mirror. He was evil and has appeared to both my dad, my husband and me. He was a old plantation owner and always glared at me and I could feel him squeezing my legs. He rushed my dad when Dad saw him.",
   "created_utc": 1693175603,
   "score": 61,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy07h30",
   "message": "I’ll try to make it short, I’m not the best at explaining things. This happened at my grandpas house which is a very old farm house in the middle of the country. I was pretty young, I can’t remember exactly but maybe around 6-7 years old. I have a brother and a sister and we’re all around the same age. We were staying the night there visiting for a few days. That night, my brother and sister were sleeping upstairs in the two spare rooms. I slept downstairs in another bedroom that was around the corner from the bottom of the steps that led upstairs. It was really late, I thought everyone was asleep and I heard running up and down the steps clear as day. Thumping up and down them, like kids were playing. I ran to the steps because I thought my brother and sister were playing without me. When I got there, no one was there. I ran back to my bed and hid under the covers🤣 The feeling that I had when I realized no one was there has stuck with me",
   "created_utc": 1693169192,
   "score": 34,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy16ky5",
   "message": "About a week after my mom passed, I saw a bright flash next to me. Not creepy though.",
   "created_utc": 1693184706,
   "score": 10,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy18tp1",
   "message": "When I was little I had a toy wand and pointed it at the sky and yelled “let it snow” and it started snowing. That’s all I’ve got.",
   "created_utc": 1693185773,
   "score": 41,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1k4ar",
   "message": "I managed a internet cafe / comic shop that was in an 150 year old building. On this particularly day we had a bunch of people that wanted to keep gaming after hours, so we closed quite late.\n\nAfter finally getting all the customers out after midnight, I was doing some paperwork in the back office. I was alone in the store for about an hour when I looked up out the two way mirror and saw someone standing standing near the front of the store.\n\nMost of the lights were off, but I could clearly see a man wearing a fedora standing by our front cash register. The building we were in was quite large and the distance from the back of the store to the front was close to 100ft. We had big bay windows backlight by street lamps and I could clearly see a person standing like they were waiting for service.\n\nI cursed myself for forgetting to lock the door, walked down the hallway and out into the main store area and there was no one there. Double checked the door. Locked tight. I felt like I wasn't alone but after flicking the lights back on, it seemed I was.\n\nLights off, back to my papers. Half an hour later I felt myself being watched. I looked up out the mirrored window again and saw the same shadow, except this time it was a few feet to the left and much closer. A man, on the short side, wearing a fedora, facing the security window. I immediately grabbed my keys and left out the back door.",
   "created_utc": 1693191268,
   "score": 14,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1j7wc",
   "message": "I’ve had a few experiences throughout my life, but here’s one I’ve never shared on here before. \n\nI was at my grandparents, getting changed in the bathroom to go swimming in their pool. The bathroom had a small octagon shaped window, the window was high up, and overlooked the porch. I was sitting on the toilet below it, when I looked up and saw a man, who looked like he was screaming through the window. His skin looked like it was burnt and smoldering. His hair was patchy and dark and his expression never changed. It was like he was frozen in time. For some reason I didn’t mention it to anyone and just quickly bolted out of the bathroom and went to the one upstairs without a window \u0026amp; did so until my grandparents moved out of that house. \n\nThe house wasn’t old or creepy",
   "created_utc": 1693190819,
   "score": 13,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy192n7",
   "message": "I've had bad sleep paralysis once. But one time I was awake light on heard giggling. Tried to sleep after reading with light on more talking. Watched that evil shit move my blanket felt up my leg. I hated my room.",
   "created_utc": 1693185894,
   "score": 7,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1g9ko",
   "message": "I have several....\n\nOne time my now ex and I were laying in bed watching TV. Im quite tall so my feet go right to the edge of the mattress. What feels like a hand grabs and squeezes my foot, weirded out and assuming there is a logical explanation I ask her \"how did you just squeeze my foot with *your* foot??\". She goes \"what are you talking about and wiggles her feet there were well away from mine. We were both speechless and utterly creeped out, all I could do was pull my feet in close... \n\nTldr: don't let your feet hang off the bed",
   "created_utc": 1693189371,
   "score": 14,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1pv0v",
   "message": "Growing up I had just seen the movie White Noise.  And I was, and still am, big into the Paranormal Stuff.  (\\*dreams happily of the day I met Zak Baggans\\*).  So I thought I would try to talk to the dead.  At the time, I had an Urn with my dad's ashes, took them out, put them on my bed and sat there with a digital recorder and started to ask questions, talk, and listen back.  I heard nothing, and after about 30 minutes assumed I was just dumb, or needed better gear.  But I was 15 so like...where was I getting the money.  So I got up, turned around and thats when, alone in the house at 1 am, there was a single knock at the front door.  But not like a pounding, just like a gentle tap, like you had to knock, but you were trying not to be noticed.  So I go out, sweating bullets, and I happen to be able to see the front porch outside that door from inside, so I POP on the lights!  Nothing is there.  The front yard, drive way, and yard are empty.  So I close the blinds, go back to the door and turn the lights off.  Maybe a half second later I can hear this sound, like someone was dragging their nails individually down the little cross hatching of a screen door.  A quick \\*tickticktickticktick\\*.  But no one was there, and there is just no way I missed it or they ran up that fast.  So I immediately put my back against the door and just said loudly \"I'm sorry Dad I wont do it again!\" and the sound immediately stopped.  And I will never, ever try that shit again.",
   "created_utc": 1693194365,
   "score": 14,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1bu98",
   "message": "When I was 4 and left alone, I was sitting in my living room playing with Legos. When I randomly decided to look up, I saw some black figure walking from my kitchen to my living room. It then disappeared. Also when I was 4, I had the imaginary friends phase. I treated all my friends like they were imaginary because I was more conscious of that. However, one guy's name was \"Invisible Todd.\" I'd never met a person named Todd. I treated him like a real human being, and when my mom asked how old he was, I said 57. Exactly 57.",
   "created_utc": 1693187230,
   "score": 9,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy10xzb",
   "message": "Years ago after I had inherited some war trophies that my great uncle brought back from the pacific theater, I caught a glimpse of what I could only describe as a reflection of a Japanese soldier in a mirror. Would also hear heavy footsteps and a friend said she got shoved.  2 of the items were a small Japanese flag and a sword that was dated to the late 18th century,  I had both displayed on my mantle. After a couple months I took them down and packed them away, the weirdness stopped for the most part",
   "created_utc": 1693182118,
   "score": 11,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy13132",
   "message": "I grew up in a huanted house which was over 350 yo. Lots of stuff happened but I saw nothing. I heard lots and experienced a lot over the years. I was terrified. When I was a teenager, I thought that if I survived this long, they must not be evil or out to get me.",
   "created_utc": 1693183063,
   "score": 11,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1bvjs",
   "message": "My own sleeping paralysis, happened once and i hope it never ever happens again.",
   "created_utc": 1693187247,
   "score": 5,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1jv6d",
   "message": "When my dad lived in my house with the fam, weird shit was constantly happening. The most egregious episodes would coincide with family drama/ high emotions. This night was creepy, everyone was asleep or near to it, and it was early in the morning. I was in my room in the basement by the stairs fully awake when I heard footsteps creeping up the stairs. The stairs are old wood covered by carpet, so even when you’re trying to be quiet you can hear each respective stair. There would be no reason for someone to be creeping around so it caught my attention. \n\nThere’s around 12 or 13 stairs and I heard each step. The steps stopped when the reached the top stair and I didn’t hear anything else for a few moments, I would’ve heard it if they’d went to the kitchen. Then I had a sort of vision looking down the stairs, and whoever/whatever it was ran like hell down the stairs, stomping on each step. That had me sitting bolt right in my bed, and the sound faded out after it went a couple steps down the hall. I was terrified and didn’t get out of my room for the rest of the night. We didn’t need to be creeping around but no one in their right mind would be stomping around like that. The next morning, we found out that everyone except my brother had been woken up by the steps, and everyone had thought it was someone else.",
   "created_utc": 1693191141,
   "score": 8,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1n1ce",
   "message": "My dad worked in security, I got into it after he passed. One night I was called on my night off, they need someone to go fill in on another site. I never worked the site before but hey, overtime, I accepted... It was one of my dad's old sites. So it is about 0200, I am doing a round, I enter one of the buildings and I think I see someone moving up ahead. It is 0200 and the building is locked, there should not be anyone in there, I quietly close the door behind me and creep up for a closer look. At the end of the hall is a security guard, which is odd as I am the only guard on duty at the time, so I am eyeing this guy, and I notice the uniform, it is for a company that doesn't exist anymore, in fact it is for the company my dad worked for when he was at this site. So it hits me that it is my dad, I'm standing there watching him, he is apparently doing a round of the building I am patrolling. So I watch him, he looks directly at me as if he could see me, he looks at me for about 30 seconds or so, he then turns the corner. I run to catch up with him but he was gone. Almost 2 years later I still swear I actually saw him that night. I don't know if it was a ghost, if I was hallucinating because it was one of his old posts and I was emotional, or if maybe some how time loops exist and I actually saw him working the site in the past. I honestly don't know but every time I have a night off and they can't find anyone to fill in, I jump at it, no longer for the overtime but with the hope that whatever happened that first time happens again. I have filled in there over 20 times since that encounter and I haven't seen anything since.",
   "created_utc": 1693192816,
   "score": 46,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1c3z5",
   "message": "Last night. Holy shit. Woke up to howling. It's literally howling, but not a high-pitched howling you'd expect from a dog. This was demonic. I thought it was a dream, but I realized I was awake, and so was my husband. It was what you'd expect to hear from a werewolf. Our dogs didn't react to the noise, so it tells me it wasn't coming from one of them, and the noise wasn't coming from the living room where our dogs were. It sounded like it was right outside our door. It was a seriously what the fuck was that moment. I didn't want to move. I had never felt more terrified in my life than last night. Even my husband was hesitant to get up and see what the noise was.",
   "created_utc": 1693187361,
   "score": 9,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1b77e",
   "message": "Told my bf to be sure his alarm (and the back up mode)was not set so we could sleep in the morning. At 4:30 am, alarm went off. I’m screaming to up plug it. He did but it kept alarming. As I was yelling to remove the battery back up he flipped it over to show me there were no batteries in place. This followed weeks of doors opening, TV going static, things being misplaced, lights on/off.",
   "created_utc": 1693186920,
   "score": 8,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1jm06",
   "message": "I was installing a floor furnace at chapel of the chimes in Oakland California… at the old caretakers house he built with his bare hands…. Well my girlfriend ( hot AF) wanted me to get off early and have some fun.. anyway, I say “ let’s throw this floor furnace in!” Meaning, let’s just hurry up and do the bare minimum… well, that night I would see bright orbs of light streak by, when I went to bed it was like something was sitting on my chest\nThis went of for like 3 nights, I was loosing my mind, every time I laid down to sleep… sleep paralysis, well the 5th or 6th night, my girlfriend starts experiencing it, only this time, it is reaching its hands up her crotch…. \nLike the 6th or 7th day of orbs and weirds shit, I woke up, terrified BUT this time I could move, however, there was a fat old lady in black clothing blocking my only exit, I stood up, ran past her and pushed open the door to yell for help but no words came out…. I woke up sweating with my girlfriend looking concerned. I guess I been making the gargling noises again… long story short I used the arch angel michel prayer and it went away",
   "created_utc": 1693191013,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1n6lo",
   "message": "MY TIME HAS COME!!! I grew up in New England so these are in order of when they happened.\n\n— The house I grew up in was super haunted - my bed would shake, full-bodied apparitions, boots going up the stairs and out the window next to my bedroom, the desk chair spinning on its own when I was the only one home, a gravestone in the basement, etc.\n\n— My aunt was a preschool teacher at The Conjuring house in the early 2000s when I was about 8. I walked in the front door and out the back to the “playground” and refused to go back inside. \n\n— I had encountered something traumatic in my everyday life that I was dealing with mentally and I used to go ghost hunting regularly. I went with my mom and my aunt and we were sitting atop a mausoleum that looked like an old Greek ruin in the middle of this small cemetery in the center of a city (very oddly placed, in hindsight) and my spirit box said, “Blow your brains out!” in a really taunting voice - at the same time my mom heard, “why don’t you just shoot yourself already?” We left, our post, headed for the car and I saged the crap out of us all before we got in and drove away. That same night, we went to another (older) graveyard and I refused to get out of the car. I ended up blacking out and came-to at a stoplight about 12 minutes later.\n\n— I went ghost hunting in an old graveyard and blacked out and came-to in a spot that someone close to me had done a ritual in and I was staring at the treetops. \n\n— I work overnight in psych and I’ve had a little kid talk to me multiple times, a hand come out of a doorway of an empty patient room (I just shut the door) and last night we spent about 6 hours talking about this stuff and a patient directly next to our nursing station started talking in their sleep and we saw shadows in their room walking around.",
   "created_utc": 1693192893,
   "score": 3,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1omxd",
   "message": "I've had several encounters before, but only one really has freaked me out. For context, my encounters have been both in extremely vivid dreams and when I've been awake. The awake ones probably startle me more, but they're few and far between and have been harmless. \n\nI don't often have the vivid dreams, but when I do, I wake up with messages. One night, I dreamt my best friend's mom came to visit me and asked me to take care of her daughter (my best friend). Made me promise. When I woke up that morning, I learned that she died from cancer. \n\nThe encounter that scared me was when I was staying over at my husband's house for the first time. I had a very vivid dream about a woman in posh Victorian clothes who rode a stage coach. I had a number of children around me that I didn't recognize, but I somehow instinctively knew she was there to do them harm, so I hid them in a special spot in a tunnel. (No idea which one or where we were.) She rode up to me, got out of the carriage, and demanded I give her the children or else she'd come after me. I told her that I'd stand in her way forever and that she could never have the children or hurt anyone else. She pulled a gun and went to shoot me, but my husband woke me up before she struck me. Her words to me as I was waking up were, \"I'll get those kids. You won't stop me forever.\"\n\nI didn't want my husband to think I was some weirdo (it was the beginning of our relationship), so I didn't say anything about it. But I started connecting some dots: his roommate (his BFF) was a single mom with multiple kids, and it turned out to be the same number of kids I was protecting. And while watching \"ghost adventures\" my husband told me that there's a \"lady in white\" who wears a fancy dress who he's seen in the hallway late at night. His BFF has seen her too.\n\nNeedless to say, I was very upset with that dream. And subsequently was very happy that everyone moved away from that house.",
   "created_utc": 1693193687,
   "score": 4,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1ove4",
   "message": "When I was a kid, we lived pretty far out of town, heading up in to the mountains. Right next to old railroad tracks. The area was big for logging, and at one time, gold mining. \n\nI remember waking up in the middle of the night. The moon was bright, and made it easy to see. For some reason, I peaked out the blinds, and about 20 yards away, standing on the road, was a man. He was wearing an old miners hat, and was just standing completely still, staring at our house. I have no idea if he could see me, but I was frozen. After about 10 minutes I eased away from the window, and laid in bed, trying not to think about it. About an hour later, still not able to sleep, I checked the window again, and he was still there. It freaked me out so I refused to look out the window again that night.\n\nI kind of forgot about this incident, until several years later, the exact same thing happened again. Another bright moon. I once again woke up in the middle of the night, and felt compelled to look out the window. Same man, same hat, standing in the same spot, just staring. I never talked to anyone about it, and I’m not sure if it was something paranormal, or just a man with a creepy habit.",
   "created_utc": 1693193815,
   "score": 3,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1pefe",
   "message": "It was just probably having sleep paralysis induced hallucinations but… I was visiting my sister in NC in her home she purchased about 20 years ago… sleeping in the bedroom they prepared in the attic, I woke up at about 2-3 am with the sight of a child standing by my bed, white eyes and symbols carved in his face, he had his palm in my chest, feeling my heartbeat… that’s it, it was sleep paralysis, I couldn’t move or speak or scream… until the dream(?) was over… My sister later told me that she and her children have heard steps in the attic and that they found a box in the attic’s storage area with toys that looked like over 50 years old… that was about 8 years ago… Definitely sleep paralysis…",
   "created_utc": 1693194110,
   "score": 3,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1pnl0",
   "message": "I bought a house in the country a few years ago, it’s a two story with a staircase and landing outside to the second floor.  Hadn’t even been moved in for a week so I didn’t have Internet yet and that meant zero phone reception.  I wake up on my day off to boots pounding up the 21 stairs.  It’s not like I hadn’t met anyone yet, a few people who live nearby had seen me out in the yard and stopped by to say hello but this was something very different.  No one is just randomly stopping by before 7 AM let alone trying to get in upstairs.  \n\nSo I don’t have the ability to call the cops and being foolish and pissed I throw on jeans, tuck my Beretta 92FS in my waist band and grab my Mossberg 12 gauge.  I peek out the window next to my mudroom and see a new Jeep with out of state plates and no people.  Enter the mudroom, leave the 12 gauge sitting in a corner where I can grab it and open the door to the outside as I hear this person coming back down the stairs.  \n\nI immediately ask him who are you and why are you here in a not quite threatening but definitely you need to answer for yourself tone.  The guy says he’s here to do some handyman work but the address he provides is both very wrong and does not exist.  I tell him the address is out front now on the post box, outside of the connector between the garage and the house and also on the inside because the previous owner was very specific.  That I don’t believe your story and you need to leave.\n\nThis wasn’t the only time I had a weird experience, a few months later, the snow it started to melt and I was outside working in the yard.  A car with a few people poles down my long driveway, it’s not one of my neighbors cars.  They just sit there, staring at me as a loudly ask them can I help you with anything?  They didn’t bother to say a word, just left after a few seconds.  Always made me wonder if the previous owner owed people money or if people thought the house was still up for sale and empty and that there might be something good to grab.  Also, why I always carry a firearm.",
   "created_utc": 1693194251,
   "score": 3,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1r6ru",
   "message": "When I was around 7, I had been feeling sick one day and fell asleep on the sofa in my dad’s office, which has two doors and is between the kitchen and a hallway. I must have fallen asleep in the early evening and slept like a rock until I woke up in the middle of the night with our two cats locked in the office with me, and they were meowing frantically.\n\nI was sick, a little kid, and I didn’t know what to do, so I just sat there and cried. After a couple minutes my older brother must have heard me (which was weird because he used to listen to/wear his Walkman headphones at night) because he opened the door from the kitchen side and reached out for me as if to say, “alright, come here.” He had his Walkman and headphones in the other hand. I took his hand and he walked me downstairs to his bed, and he let me sleep with him that night.\n\nYears later when I was a teenager I was retelling that story at some family event and my brother cut me off to say that he didn’t come upstairs, I walked down to his room. \n\nI had woken up disoriented and scared, there was no way I left that room by myself. I was also skittish of my dad’s basement at that age, hence needing the escort. I vividly remember just sitting there crying when he opened the door, while he has equally specific memories of me showing up next to his bed. So to this day, who or what took my hand and walked me downstairs is anyone’s guess.",
   "created_utc": 1693195119,
   "score": 5,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1s7bz",
   "message": "I’ve posted this elsewhere before. Almost 10 years ago I went in for surgery at a smallish, older hospital. I was there for 3 days total, including the day of surgery.  It was a private room, set up with a half wall inside the door that blocked the view of the room/patient bed from the hall. There was a sink on the door side of that wall and a room with a toilet and shower to the side. Every person who came in the room would stop at the sink to wash their hands. The door closed automatically but the sink was operated manually.\n\nThe morning of they day I was to be discharged, I was waiting for the nurse. I heard the door open, the sink turn on, the door shut, and then the sink turn off. I kept watching the wall, waiting for the person to come around and talk to me, but nobody ever came. The door didn’t open again until someone else came in a while later. I was fully lucid and on minimal pain meds so I wasn’t hallucinating. \n\nI was discharged and a nurse pushed me in a wheelchair to the hospital entrance. My ride wasn’t up to the door yet so we chatted some. I asked her if anyone ever mentioned the hospital being haunted. She looked at me for a moment and then asked if I was on the 3rd floor at all. I told her I was on the 2nd the entire time. She said there were a lot of stories about the third floor but not many about the second. The car pulled up so I didn’t get to ask her for stories.  Thankfully I haven’t had to go back since.",
   "created_utc": 1693195712,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1e9cd",
   "message": "Not that creepy in hindsight but freaked me out as a high schooler (or early college).\n\nWas playing Paper Mario on GameCube and there was a house to explore and find secrets. I check the attic and there's a secret entrance there that appears and the exact same time I find this secret, a real life and earthquake happened. It jolted my parents house (and was in the equivalent upstairs room like where I was in the game as well).\n\n Like woah wtf... I took a break from that game after that as it was a bit too much of a coincidence.",
   "created_utc": 1693188400,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1az8x",
   "message": "One day when I was like 6 I built a blanket fort in our unfinished basement. Everything was pretty secure and I was playing for at least 15 mins. All of a sudden the roof/top blanket flew off my fort and across the room. I was the only one in the basement.\n\nThen when I was 12 or so it was late at night and dark and I was walking from my parents room to my room and I swear I saw the figure of a man in my brother’s doorway. I screamed and my dad came running and searched the whole house and found no one. I stayed in my parents room for a while that night then when I felt okay I went back to my room. Once again I see the same man in my brother’s doorway. I could see he was wearing jeans and a white shirt. Screamed again and again my dad found nothing. Still have no idea to this day but I know what I saw.\n\nI would also hear footsteps upstairs when I would be home alone and in the living room watching tv. I would mute the tv and they would stop, changed the channel or turn volume back on and they would start again.\n\nMoved to college and gave my life to Christ, moved back home and haven’t had a single experience since. \n\nFully believe something was in my house somehow (brand new when we moved in) but I prayed through it once becoming a Christian and nothing since",
   "created_utc": 1693186816,
   "score": 7,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1byl2",
   "message": "Im not sure if this was either paranormal, Real or something else. It was 2:00 AM, I couldn’t sleep. With this in mind, I decided to watch some stuff on my phone. I soon began to notice it was quiet, as a matter of fact, too quiet. I tried my best to ignore it. Out of nowhere, I hear screaming. Lots of screams. The lights started flashing out of the blinds. It was most probably the cars driving by. But I wasn’t focused on that, no. I was focused on the blood curdling screams coming right from down the street. I stayed up the whole night after that.\n\nThe same thing happened a few weeks later, only this time I was suddenly awoken with screams followed by loud speeding cars, men shouting and furious barking.",
   "created_utc": 1693187289,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1g6yk",
   "message": "Staying at the Crescent Hotel in Eureka Springs Arkansas.\n\nThe ghost \"Michael\" likes to follow people back to their rooms and fuck with them.\n\nHe fucked with me and my sister all night.\n\nIt was scary.",
   "created_utc": 1693189336,
   "score": 255,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1mpud",
   "message": "Sky orbs",
   "created_utc": 1693192642,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1qdc0",
   "message": "Demonic possession.",
   "created_utc": 1693194648,
   "score": 253,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1s1yc",
   "message": "Guess you could say Elizabeth really took the meaning of 'rest in peace' seriously!",
   "created_utc": 1693195624,
   "score": 255,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1t66v",
   "message": "One time I took a poop so big it felt gay",
   "created_utc": 1693196294,
   "score": 251,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy198t8",
   "message": "Something that would make itself look like other people.",
   "created_utc": 1693185977,
   "score": 253,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1lzwc",
   "message": "I've had ghost cats. \n\nBasically, I'd be lying in bed getting ready to go to sleep, when I'd feel something jump up on the bed, take a few steps, then plop down next to me. I'd reach over to pet them, but there wouldn't be one there. It's since stopped since I stopped owning cats.",
   "created_utc": 1693192253,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1o09s",
   "message": "A couple of friends (and one hot roommate) rented a house in the next city over. One floor. Had a partially finished basement. The owner started the job but never completed it, only the outer walls and one interior room were put in. The main area was open with a single light bulb hanging from the ceiling. Scattering of old furniture around. My friends used to use the basement to host parties. Apparently, there was a standing request not to sleep down there, a request that I did not hear. We were maybe 20 or 21 at the time. \n\nWell, after one party, people started going to sleep wherever they could find space, and I picked the only open spot I could find, this old couch in that basement. I wake up after just a few hours, must have been 4 or 5am, and I hear a guy and girl whispering and giggling in that partially built next room. It sounded like someone who was at the party, so I got up to ask them to be quiet, and as soon as I got near that doorway, it stopped. Weird. But I thought maybe I was hearing people still partying upstairs, and it just sounded like whispering through the floor, no biggie. It didn't start back up, so I decided to ignore it and try to go back to sleep. \n\nI laid back down. That bright light was shining in my face, and I wasn't sure how to turn it off, so I closed my eyes and just tried to fall asleep anyways. While I'm laying on the couch with my eyes closed, I saw a shadow move across my eyelids, as if something moved between me and that light. \n\nSo at this point I sit bolt upright, and said \"nope, nope, nope, nope\" over and over again as I started walking towards the stairs. The cement floor was a bit uneven, so I'd hear a scuffing noise with some of my foot steps, but I'd hear it even when my shoe didn't scrape the floor. I stopped at the bottom of the stairs and listened, and those shuffling footsteps kept going, so I sprinted up the stairs and paused one more time at the top and looked back and saw... nothing. I don't know, I expected to see someone. I waited maybe 10 seconds, listening out, and finally I hear what sounds like a single footfall on wood and creak of that bottom stair. I shut the door behind me and backed away watching it, but nothing ever came through. \n\nI'm frantically trying to find one of my friends who rented the place without waking anyone up, and I find the roommate on an air mattress, in the living room, which is weird but whatever. I start shaking her, and I go \"C... C, wake up. Your basement is haunted!\" She just looks at me like I'm an idiot and says, \"Duh. We told everyone not to sleep down there.\" And I just went, \"Oh. So can I crash on the corner of the air mattress?\" And she said I could. \n\nSo the next day, I get all of the ghost stories from them about this house. Apparently, the main floor was haunted too, and the basement was just the worst spot for it.",
   "created_utc": 1693193342,
   "score": 5,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1okqf",
   "message": "I heard someone whisper my name while I was in an empty hospital after hours at a bank of elevators.\n\nMy ex is NA, and he once told me if I hear my name and don't recognize the voice, dont react and make it repeat itself in hopes there's an actual person calling you, and not a witch.\n\nI remembered what he said, and it didn't repeat itself. Scared the shit out of me.",
   "created_utc": 1693193655,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1ou66",
   "message": "I worked in a new metal fabrication shop which had set up the empty space in a very old building the owner bought. I was the only guy who knew anything aside from the owner. It was a skeleton crew and I was often alone. So I thought. I worked there three years and had keys to the shop very early on, many times the only one in the building at 3 a.m. running or setting up jobs.  \n\n\nI would be working and turn around to set the Turret Press to specs on the request order and turn back around to find my request order gone. I would look high and low for this paper at first in the thought that maybe there was a slight breeze or I created one when I turned .... I would have to work around this and move on to something else. It would sometime later return, very near where it had been. This, I assure you, was not a fatigue issue. I was not the only one things like this happened to.  \n\n\nIt did not happen often, but anything like that happening at all is once to many. By the time I settled upon the declarations of ghost, it had happened a third time in a year. The first time was about six month's in to my employment. There were other things like that, but it was the most frustrating, more mischievous than malicious. We all worked with that guy, you know what I mean.",
   "created_utc": 1693193797,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1qx37",
   "message": "Close to where I live, here in SC, there's a little marsh walk that leads a small secluded beach. My fiancé and I take our dog there to swim. When I'm walking down the marsh walk I can almost hear whispers speaking to me through the reeds blowing in the breeze. Little words here and there that don't really mean much, and I have to strain to listen, but on occasion it's clear as day. Sometimes my dog will stop and just stare into the reeds, not wanting to move.\n\nThis is the only place where this happens. I live right next to some wetlands, and the reeds there just sound like reeds.",
   "created_utc": 1693194962,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1sw9p",
   "message": "The house I lived in was old as hell and kind of creepy, id lived there for years with only minor bumps in the night and weird stuff, nothing too bad. One night I decided to set up a tape recorder in the kitchen and me and my friends were in the living room listening to see if we could catch some ghost talking on the tape, it's been about 25 minutes when suddenly *CRASH*. we literally heard a plate drop from the cupboard, hit the table, hit the floor and was spinning around until it went still. Of course we were scared shitless. We turned the lights on and literally nothing was in there. Nobody. I had that recording for a long time until it was finally lost during a move.",
   "created_utc": 1693196126,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1t4q7",
   "message": "\\[A bit of the full story\\] I love visiting my grandmother, But there's just something I don't love about it... My uncle. Whenever we go to sleep, the lights shut off, and my uncle just just stands there, infront of my bed, watching. and sometimes I've heard some noises coming from the other room (not my room, nor my uncles.) Like, whispering and that kind of stuff. I have called him out several times of it, He just says he doesn't know what I'm talking about, So I lock my doors every time I go to bed, He just literally tries to open the door several times, And no, It's still happening.",
   "created_utc": 1693196269,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1t51n",
   "message": "\\[A bit of the full story\\] I love visiting my grandmother, But there's just something I don't love about it... My uncle. Whenever we go to sleep, the lights shut off, and my uncle just just stands there, infront of my bed, watching. and sometimes I've heard some noises coming from the other room (not my room, nor my uncles.) Like, whispering and that kind of stuff. I have called him out several times of it, He just says he doesn't know what I'm talking about, So I lock my doors every time I go to bed, He just literally tries to open the door several times, And no, It's still happening.",
   "created_utc": 1693196274,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1uaks",
   "message": "I had a drunk ghost visit me one night.\n\nBasically, lol. I had flown to another city for a work project. I checked into my hotel earlier that day, left my suitcase there, and went to the office until I finished my work at like 1am. I came back to the hotel, got out of my work clothes, went to sleep. \n\nWhen I woke up in the morning I went to put my shoes back on and found a beer bottle cap in one of them. I don't drink that particular beer, definitely didn't during that trip, and the only time those shoes were off my feet were when I was in that room asleep. \n\nI put the door lock latch across at night, so I'm fairly confident I didn't have a night time visitor. Everything else was where I left it, including my wallet, phone, hire car keys, anything else someone could've taken had they come in. But all that changed was this bottle cap in my shoe.",
   "created_utc": 1693196978,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1uhh4",
   "message": "They say that kids before a certain age have the ability to see ghosts.. Pretty creepy once you think about it.",
   "created_utc": 1693197098,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1ump6",
   "message": "Probably not the creepiest but I forgot about this for a while. I had a friend come over to my grandparents house where I was staying a few years back, we sat on my porch and talked until it got dark, maybe 10 or 11. In the middle of talking we hear this noise that is so unbelievably loud and close and unlike any kind of noise that I’ve heard before come from right next to me right off of the porch, and I look over and I see something, in my head now it’s just some weird glob of a bunch of animals all mixed together, it was too fast for me to get a good look at it, and then it just stopped and we both looked at each other laughing a little bit and had to confirm what just happened, it still feels like it was a dream I have no clue what animal it was and I wish I did",
   "created_utc": 1693197189,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1wt8u",
   "message": "My paternal grandmother was very involved in her chuch community and would often bring me along for get-togethers, parties, funerals and other functions that involved people we knew.\n\nI was probably 7 or 8 when we visited a nice old lady and her family to deliver gifts the church had put together for them. My grandmother being herself, she quickly caught up in conversation which left me time to roam around a little. The house was large and featured a long, tall wooden staircase to the upstairs. I had never seen a staircase so tall and wanted nothing more than to make it to the top. But when I took the first step with my hand on one of the support columns for the banister, I saw a very tall man looking down at me from the top. He was leaning on the banister and with an incredibly deep voice (complete with a heavy Southern drawl) he told me, \"Boah, them stairs ain't safe. You is too little. Don't you come up them stairs or I'll give you a whippin'.\"\n\nBeing the good kid I was, I apologized and left the room though I'm pretty sure his eyes followed me. Fast forward about 15 years and I met one of the old lady's grandchildren at her funeral. I asked about the grandfather (who I presumed the tall man was) and I was told he died almost 30 years prior. Apparently, he had fallen down those steps and cracked his head. The grandkid thought I was pranking him but I was in disbelief. \"Tall man with a deep voice?\", I asked. He looked at me with shock. \"Yeah, Memaw said he had one. How do you know that?\" I casually replied, \"I met him once.\"",
   "created_utc": 1693198588,
   "score": 6,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1xf9j",
   "message": "Back in the day, before my husband and I had kids, we rented a small house in the older side of town. We usually watched TV in bed together before falling asleep. One night, while watching TV, I decided I was ready for bed and rolled onto my side, away from my husband. My husband got up to use the bathroom before settling down for bed. The remote to the TV was between us in the bed. When he came back to bed, he started looking for the remote, but couldn't find it. I got up and we tore the bed apart. It was nowhere to be found, even though it was literally right there just a moment before. We gave up and went to bed. We continued to look for it over the next few weeks without any luck. \n\nThen when my husband needed to dress a little fancier for work one day, he dug out his dress shoes from the back of the closet. As he's putting on his shoes, there he finds the remote, tucked into one of them. There was no possible way the remote could have gotten into that shoe, tucked into the back of the closet the way it was. \n\nStill a mystery to this day and still gives me goosebumps when I think about it.",
   "created_utc": 1693198991,
   "score": 3,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1uwfr",
   "message": "My dad was president of the local historical society, and they have a completely furnished old house as part of their museum. He texted me one night to knock it off (I live in town and had keys to open the museum). “Knock what off?” So he then calls. The security cameras have the sound of the piano playing- and he thought it was me pranking him. \nDad- I am in my living room watching TV.”\n“Went down to check, nothing. Still weirded out by the whole thing.",
   "created_utc": 1693197361,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1v3gb",
   "message": "A pretty tame encounter but one I'll never forget. \n\nI used to spend the night at my grandparents' quite frequently. Their basement is split in two, one side with concrete flooring, a workshop and outside access (albeit behind two dead-bolted doors due to theft in years past) while the other is carpeted, furnished and used as a downstairs gaming and entertainment area. Separating these two sections is an old, hollow wooden door next to the bottom of the stairs. In the back of the carpeted side is a bedroom of sorts with a majorly comfy bed I spent most nights in. \n\nOne night I was sleeping peacefully when I suddenly woke up for no tangible reason. Frustrated, I sat up and rubbed my eyes and that's when I heard it - a deliberate and noticeable knocking sound on the door to the concrete half of the basement. The door being old and hollow, there was no mistaking where the sound came from. I didn't dare navigate through the dark and open the door, I just closed my eyes and pretended it wasn't there. About 6 or 7 knocks later, it stopped. The next morning I checked that half of the basement and sure enough both of the exterior-access doors were shut and locked tight. I asked my grandfather about it and he simply responded, \"I hear it sometimes, too. Don't tell your grandmother.\"\n\nThat was over a decade ago. I lost my grandfather just over a year ago and haven't spent the night there since.",
   "created_utc": 1693197486,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1widm",
   "message": "I've seen a few people make weird faves that are humanly impossible. I'm not seeing shit that's not real either. And I'm not seeing them as \"uncanny valley\" shit either. I've truly seen faves morph onto what looked similar to Venom (the Mavel character). The trust guy looked like an alien, but his black skin still looked human. (I mean he was a black person. Of African descent. Not jet black like Venom.) His eyes were large, but mostly circular. Not oval. They were jet black. And head two smiles. Like, two sets of lips. One looked like a smug ass human smile. The other vrwpt upto his ears, but the skin was still.... intact. Another guy open his mouth all the up to his ears. He smiled a vicious and sadistic smile. His cheeks sagged a but by the jaw, and had two stripes running vertically down them. That made me think he was proudly homicidal as hell towards me. His eyes were normal sized and a normal brown. Not black. Amd another guy had a wrurd smile that looked like his cheeks were open like Venom's smile, but more like they were just indented. He looked like a velociraptor kinda. His ets were black too; in this instance. They're normally brown. Years before, I saw a dude with huge fucking eyes that were jet black. Looked like the epitome of evil in his eyes. He looked happy  that he was evil. \n\nAnd I've seen other shit too.\n\nBtw, I knew these guys too. I saw them daily or almost daily.",
   "created_utc": 1693198393,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1x8pw",
   "message": "In Appalachia the most frightening thing I've ever seen are the lights that don't cast a shadow..",
   "created_utc": 1693198871,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy2410x",
   "message": "Sorry for the long post but the backstory is necessary.\n\nI work overnight as an RN on a Pediatric ICU floor. Most of our patients are sedated, paralyzed, tracheostomy and ventilator dependent, etc. One side of the floor is where our acute trauma kids go (severe accidents, drownings, etc) and the other side is where our chronic kids go. These are usually the kids that are termed our “frequent flyers”. When they’re not in the hospital, they live at a facility that provides 24 hour medical care. Once they get discharged, it’s only a matter of time before they’re back (usually 2-3 weeks, usually due to respiratory failure) Most of them do not have parents that visit or call. They just lay there staring at the ceiling and get their medications and tube feedings. It’s very depressing on that side. \n\nOne of my patients was a chronic kid. She was 5 years old. Her medical history was incredibly complex. She was trach and ventilator dependent, she was delayed but she was “with it” so to speak. Every time she was re-admitted to our floor and I had her as a patient she would smile the biggest smile when I’d walk in at the start of my shift. I made it a point to spend time in her room with her whenever I could since she didn’t have parents who came. I would do silly dances or sing her songs and make her smile. Since she had a trach and was hooked to the vent, she wasn’t able to make noise. So when she would cry it was silent and you would just see the tears streaming down her face. She absolutely LOVED the movie Frozen. It always made her stop crying. If I would walk in and the movie was finished, she would tug on the sleeve of my scrub to play it again and I would. That was our thing. I didn’t mind being on the chronic side as much when she was there. I care for all of my patients but she held a special spot and I believe she knew it.\n\nShe was discharged back to the medical facility she lived at. It had been a while since she came back this time, maybe 2-3 months. But when she did.. she looked bad. Worse than ever. She required way more oxygen than her usual baseline this time. She had lost a lot of weight (she was already very small for her age), her eyes were sunken. It hurt me to see her that way. I did my dances and my songs and she didn’t smile. I would talk to her and she wouldn’t react. She wasn’t really tracking and following with her eyes. She wasn’t herself anymore, she was clearly deteriorating (this was expected due to the multiple congenital issues she was suffering from) but still, it was hard to watch. \n\nShe was there a few weeks and her prognosis was pretty poor. My last shift with her she was hardly able to raise her arm. But she did, just to tug on my sleeve so I could put frozen on. So I did. It was otherwise a regular night. I went home and slept and woke up just in time to come back for my next shift. I was expecting to get my same patient assignment and I saw I had the same room number, but the name was different. There was someone else in her room. I asked what happened and their faces all fell as they told me she had coded in the morning and they weren’t able to get her back. She passed away. I wasn’t there. I was totally devastated. I held it together and I didn’t cry, but this shift had a heaviness to it. I was really sad and it just felt like I was drifting from room to room the whole night. \n\nFast forward to 3am I needed to go into that room to start the new patients tube feed. There was nothing on the tv but the patient was awake. I put on the movie Coco so he would at least have some background noise. As I was starting the pump, I felt the hairs on the back of my neck stand up and I had goosebumps down my arms. Just as I was about to turn to leave I felt it. Two tugs on my sleeve. I froze in place, at first i felt really afraid, but then I got the most overwhelming rush of emotion all at once. I ran to the bathroom and I cried so hard. It took me a while to gather myself. I splashed water on my face and went back to my desk to chart, trying to shake off what had happened and just tell myself it was impossible. My grief was causing me to imagine things. At 4am, exactly 1 hour later the feed was done. I went to the room and I paused at the doorway. Frozen was playing. I had only put Coco on 1 hour ago, It couldn’t have been finished. I stood there in disbelief. I’ve never really had anything “paranormal” happen to me before. But in that moment I had the warmest feeling, I just knew she was trying to tell me she was okay or something. I can’t explain it, but it made me smile. \n\nI’ve been in that room plenty of times since and nothing weird has ever happened again. It only happened that one night that she passed. It’s almost like she was saying goodbye. And I’m glad. I would be sad if even in the afterlife she was confined to a hospital room. I like to think that wherever she is, she’s free to walk and laugh and watch frozen on repeat.",
   "created_utc": 1693203778,
   "score": 2,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy21atu",
   "message": "They say that kids before a certain age have the ability to see ghosts.. Pretty creepy once you think about it.",
   "created_utc": 1693201708,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1vje1",
   "message": "A guy fucking a ghost on a grave, grunting excessively. He kept yelling “I’m gonna fill you up”",
   "created_utc": 1693197767,
   "score": 255,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1zcd1",
   "message": "Keith",
   "created_utc": 1693200295,
   "score": 255,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1zjop",
   "message": "stomach growling...",
   "created_utc": 1693200441,
   "score": 255,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1v66k",
   "message": "A few times a year I house sit a largish (5k square feet) historic home that belongs to a family member. The first couple of times I watched it I did not notice anything was off with it. I didn't spend much time in the house at first. I mostly just brought mail and any packages that were delivered into the house and watered plants. The first time said family members went on a longer trip I had to actually live at the house for 5 weeks which is when creepy shit started to happen. The first time I noticed something was up was my first night staying there. I arrived there after getting off work late (10pm) and upon opening the front door and entering the foyer I immediately got a strong and unwelcome feeling and was absolutely certain that I was not alone. I decided to ignore it and go to bed as I was tired and had to be up early the next morning for work. As the days went by, the feeling of being watched would come and go randomly. It would happen at night and in the middle of the day as well. The scariest thing that happened was hearing footsteps upstairs when I was in the living room trying to read one of the coffee table books they had left out. Interestingly, the creepy shit seems to be confined to the old and original section of the house. The newer portion and 4 car garage that were added in the 1990's felt totally normal and subsequently that is where I chose to spend as much time as possible. Its the only time I have felt creeped out like this in my entire life. I am not looking forward to watching the house again next summer.",
   "created_utc": 1693197533,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1vhk6",
   "message": "  Tl-dr. Aunt has old house, see dead relative. \n\nWhen I was about 7, I visited my aunt's house during the summer in Columbus, Ohio. It's been passed down through family since it's been built. It has this old barn across the pond that's been leaning since 1930. Before the barn was being used for old boats and bass food, it was a black smith work shop built sometime around 1870-80. I was with my sister, who is just a bit older, and we ran around the lake to the old barn just ahead of my father and aunt. As I round the trees to the barn, my aunt hollers, \"Don't play in the barn. There's copperheads and spiders!\" I look up to the transom window, I see a man, looked about 30. He almost looks like he's peering out with a big smile. Without really thinking, I yelled, \"Hey! What are you doing in there! You're gonna get bit!\" I look back to tell my aunt and dad but can just barely see them rounding the corner. I looked to my sister, and we both looked back to the barn, and the man was gone. The ladder and walkway were firewood years ago anyway from what I heard, so there's no way someone could be up there.\n\n   I ran to the barn just like I was told not to and ran right just up to the door and looked in, but it was silent. Not a breeze. Every single hair stood up on my arms, neck, and back.  It had to of been around 90° and like walking through a wet blanket out there, but when I stepped one foot in that barn and I was frozen. I wasn't scared, as I didn't even know what just happened, but I was confused as was my sister. We turned back and asked my aunt, who the man in the was, and she gave my dad a concerned look. That's what scared me. We walked around and didn't see anyone, so we headed back to the house.\n\n  Just until a couple of years ago, I was doing some research on my family history, and my uncle was brought an old safe that was held by a family friend. No one in the family knew it existed. Not even the family that held it in their basement for who knows how long. They had gotten it open, and there were birth and death certificates along with photos and drawings. A blue hunkerchief is what stood out to me, though, as if it was the same withered one I saw tied around of the neck of that man I saw in the barn. Even the smell of opening that safe reminded me of that day. I looked through the small stack of old black and white Kodak photos, one of them from May 1910 with the name Emmet on the back, and has the same exact man.. standing at the barn doors with an appaloosa and thoroughbred.. wearing a light long sleeve, with a dark handkerchief around his neck. \n\n  After I told my cousin about the whole thing, I go to message my sister the picture of Emmet. She called back freaking out, saying she had forgotten all about that and always thought it was our imagination or lack of sleep, lol. The next day, I called my father, and we talked about the first trip we took out there as a family and everything he remembered, if he remembered my sister and I yelling at someone in the barn. If anyone was in our family named Emmet. He remembered every bit of it. He didn't tell us for obvious reasons, but Emmet was my great grand father. He lived on that land with his parents till he died in that barn. I looked through the death certificates, and there were Emmet's, says nothing but May 1910 black smith shop. \n\n  I tried not to ask my aunt much but as much as she heard, there was an ox yoke or something that was being lifted to store in the rafters and came back down and hit him right in the head. 34 years old. Damn shame. \n\n  Now and then, I'll go back there, I make sure I go and just give some warm energy by the old barn, sing some old songs. It's always felt more welcoming. Feels like I have a connection to him even when my elders don't. I haven't seen him since I was a child but I feel stillness whenever I visit.",
   "created_utc": 1693197733,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1viry",
   "message": "I was walking home one night from my Grandmother's house. We lived in a village in rural Ireland. Granny's house was on the outskirts of the village, so I had to walk up a narrow country lane to get to grannys house and back down the lane to get toward the village. My grandad was dieing and the priest have him the last rights. He pulled through the night and my granny told me to go home and get a bit of a rest. I reluctantly agreed and walked home. Down the country lane, I've been walking on since I was a boy. Only this time it seemed weird in some way. Almost eerie and I never get spooked.\nI pushed the feeling to the side as my mind was in shock about grandad.\n\nI was walking toward the bottom of the lane when I noticed a blur of white down the bottom of the lane beside one of the farmers gates to the field beside my grandparents house. I thought it was a lamb escaped. It happens alot. I walk toward it to investigate. When I walked toward the blur of white, it felt like electricity entered every inch of my body.\nThe hairs were standing up on my arms and what was left on the top of my head. I stood frozen in perpetual fear as the figure was an old hunched woman in a white robe and she just screamed the most merciful scream. The gutteral scream, was so frightening, I actually stopped breathing with sheer fear. I looked up into her face and saw nothing just a blur. The cry was ungodly. Like a mother finding out their child is dead. The most scariest scream I've ever witnessed.\n\nAdrenalin must have kicked in because I legged it straight back up the lane toward grannys house and legged it in the front door. I could hear my granny rushing out grandads room crying. She said \"Grandas gone\". Imagine he just passed away within the Five minutes of me leaving and encountering the woman on the lane. I remember telling my elderly aunt and a few family members about the woman, and they said that she was a friend of the family by now. She only appears when someone is going to die. I thought they were taking the piss until my father, a born skeptic and very religious man, confirmed the woman's existence. In some families in Ireland, she would be called The Banshee.\n\nI'll never forget her. Not even when I'm on my own death bed will I ever forget the howl. \nThank you. ❤️",
   "created_utc": 1693197754,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1wcnd",
   "message": "When I was 26, my mother bought a house. She took me on a tour and I saw the entire house except one bedroom. She wanted me to see it, but I couldn’t cross the threshold without the feeling of something attacking me. I told my mother somebody or something evil died a horrible death in that room and I would not enter it unless it was blessed by her priest. She laughed at me. \n\n2 weeks later, the homeowner before came over to get mail. She and my mom sat down to chat and my mom mentioned my misgivings about that room. That’s when the previous owner said “That’s where I shot and killed that evil man!” My mom pressed for details and discovered that 20 years earlier the woman was home alone when she suffered a home invasion. She was violently sa’d and as he attempted to crawl out of the window, she shot him in the back and let him bleed to death before calling 911. He was a known predator wanted for murder in 3 states. \n\nMy mom had a sage scrub and a blessing done and then I was able to enter that room.",
   "created_utc": 1693198289,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1we3w",
   "message": "Oddly enough, just today I had something really weird happen. I was sitting on the couch when I heard someone fiddling with the front door lock, which is less than five feet from the couch. I thought maybe my husband was coming home early from work, but when I turned my head to look out the window, no one was there. There’s a wide field of view out the window, so in the one or two seconds between hearing the sound and looking out the window, I would have seen someone walking or even running away. I went outside to see if someone had dropped something off or stuck a letter on the door, but there was nothing. Just lock jingle and then *poof,* gone. Middle of the day in the middle of town. I even asked the kids playing outside across the street if they saw anyone come to our door, and they said no.",
   "created_utc": 1693198315,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1wewu",
   "message": "I was working for Pier One Imports, and it was 8:30. No one in the store besides me and my associate cleaning the bathroom. I am straightening and putting items front-facing. I go to the register in the center of the store to check things off, and I see something move out of the corner of my eye. I walk over, assuming I missed a customer. No one. I looked around, and in the middle of the aisle I had just cleaned was a glass vase from the top shelf. Unbroken. It was not there before and would have broken if it fell. I had other times I felt watched in that store or heard something. This was the first one that did not sit right.",
   "created_utc": 1693198330,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1y5ld",
   "message": "As a kid, I had this toy called the \"eto?\" Etch a sketch electronic. It was like ms paint program you could plug in to your TV, and you could paint and sticker Clip art things and make pictures. I remember one time I turned it on, and all the skater guys were sideways, and the sound was playing everything at once just blaring. There were red pixels flowing and streaking from top to the bottom of the screen. That shit scared the hell out of me. I never plugged it back in after that. It sat at the bottom of my toys until it eventually got thrown away",
   "created_utc": 1693199476,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1ycvu",
   "message": "Likely an explanation but it still scarred me as a kid. I had one of those huge on-wheel TVs from the 2000s i would use my 360 to play on most of the time. Well I had unplugged my console for the night and the TV usually just idles on the blue screen and shuts off after like 15 minutes. Me being a little kid sometimes I wondered if anything would randomly turn on if I left it hanging so I usually just left it on until it decided to power off by itself. Well this time, something did pop up. As I was sitting on my couch, I heard static pop up for half a second, and the screen setting turned into some type of dune-looking area. Like a third world country sort of place, with dirt everywhere and what appeared to be houses. Thing is, I used to travel to the Philippines a lot as a kid so something in my mind thought this area was familiar, and I’ve been here before. Never mind the setting, there was a foreign man in the middle of it all looking straight into my soul. He was far away from the camera, but something felt off. I recall Michael Jackson playing in the background but I don’t remember the song unfortunately - it was a very vague one from what I remember. Then, the man just started moving closer. I was basically frozen in fear on the couch for a while, trying to figure out what the hell was even going on. He moved closer and closer, *some type of weapon* in his hand, I couldn’t tell if it was a farming tool or what but I was just terrified the TV was suddenly displaying a guy coming closer and closer to the screen lol. Right before I even let him finish his walk of horror I got the courage to turn my TV off and everything was ok. I even turned the TV back on and everything was back to normal. My guess is signals and shit but yeah, I got pretty creeped out.",
   "created_utc": 1693199611,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1ywoe",
   "message": "Idk if people will believe me but I can see ghost/ sporits. I can feel when something is watching me and I've heard them. Mostly my past away animals.\n\nMy first encounter was my first dog, I used to live in a house with a finished basement. I don't remember why I need to go down but I opened the door, I looked down and I saw her looking right at me. She didn't look dead, she looked like we forgot her down stairs. I flicked the lights on and she was gone, didn't think of it until later.\n\nThe most recent was 2 weeks I went to NY and went to an old fort, there was a basement were there used to be a hospital. To clarify there were to stairs, one to go down and up. The second stairs you can go under it, the tour guide said there's a ghost called him. They call him that since in a nutshell he's a moody kid that will hurt you if you do, I felt if I stayed down there I was going to die. It didn't feel right being down there.\n\nI have many other ghost stories but there passed friends or animals.",
   "created_utc": 1693199989,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy1z52u",
   "message": "Had a \"friend\" I would talk to in a Fisher Price phone that gave me scarily accurate details about my cousin getting splinters in their bare feet from running around on an unfinished deck. This story has been confirmed by my dad and uncle.\n\nUsed to play with a ghost in the form of a little boy dressed in overalls/shorts, orange shirt. He would hide under the master bathroom sink; one time, my dad saw him and watched him run out and into my room. Of course, when he got there, he saw only me sitting in the middle of my room playing with my toys. I would also hear my toys shift at night.\n\nPossibly met a doppelganger that wasn't mine. They took the form of a different cousin except behaving weirdly and creepily,even giving me a weird shushing motion (i.e. pressing a finger to their lips).",
   "created_utc": 1693200150,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy20fyv",
   "message": "This always feels ridiculous to write or say...\n\nMy dog had a heart issue, and in his middle-age it got the better of him. One night he collapsed, so we took him to the emergency vet.\n\nWe didn't live in the sticks or anything; but between our suburb and the next suburb over, there's a road that goes through so old farm land from decades ago that still hasn't been developed on. Anyway, the significance of that is that a) this road is poorly lit; and b) this road has no sidewalk.\n\nAs we're driving up this road, mum and dad in the front and me in the back, with Vinnie on mum's lap, we see in the car lights what looks like an old lady walking on the side of the road, dressed in a very \"cartoonish\" old lady outfit (shawl, head scarf, pushing those trolleys old ladies have). And by the way, it was *pissing* down with rain. This isn't the kind of road where you'd usually see people walking, let alone at night and in the rain. It doesn't lead to anywhere except parkland (at least in the immediate sense: eventually you'll reach suburbia), and there are no bus routes that use this road either. It's an arterial road, but effectively *looks* like a country road.\n\nWhile we didn't have to swerve to avoid her, we certainly didn't see her until she was quite close. Anyway, we didn't stop. Maybe that wasn't very charitable, but we were caught by surprise and on our way somewhere important with a sick dog. But after we drove past her (at like 80km/h, the speed limit of this road), Vinnie looked at mum, then dad, then me, and he just seemed at peace. It was odd, because usually he was the kind of Jack Russell that couldn't sit still (which is what killed him, ultimately). And because she gave us such a shock by just being where she was at that time of night, I *did* look out the back window to see if she was there - but I couldn't see her. However, that could've just as easily been because it was nighttime, the road is poorly lit, and we were driving away from her at 80km/h.\n\nFast forward and we get to the emergency vet, still a 15 minute drive from where we passed the old lady on the road. Vinnie is taken in to stay overnight to be monitored, and we decide to go home after having been at the vet for maybe an hour or 90 minutes. Five minutes after we arrive home, we get a phone call telling us Vinnie saw a cat, got excited and had a heart attack. My beautiful dog had passed away.\n\nAnyway, the odd thing that struck me was that the random old lady *probably* could've walked from where she was to the vet between the time we saw her, and the time we got the call that Vinnie had died. So in my head, I've always wondered if she was some sort of *psychopomp*, who was walking to meet Vinnie and take him to wherever dead dogs might go.\n\nI don't buy into this sort of stuff, and aren't religious either. The truth is, she was probably just an old lady who was walking on the road late at night and in the rain, for god knows what reason, but nonetheless that's the facts of it. But the acceptance of the situation that Vinnie seemed to exhibit right after we passed her weirded me out a bit. I'm sure it's just me trying to make nice stories to lessen the blow of the loss, as so many do with afterlife concepts. But even so, I'll never *truly* know until it's my own turn to die.\n\nLet's put it this way though: when my following dog Spot passed away, on the way to the vet I was on the look-out for ferrymen disguised as old ladies, come to take my treasured dog away from me and break my heart all over again. No matter how much you tell yourself that the supernatural isn't real, you just can't shake your own lived experiences of it - even if they are, probably, just figments.",
   "created_utc": 1693201079,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy21e68",
   "message": "In 2018 I left the islands to come to the U.S my first job was working in a nursing home in Peoria Arizona, it was a small home with about 10 residents. There was two other ladies working there from the islands we had a room in the back of the building where we would stay and sleep. The ladies had told me some strange things that would happen in the night but I didn’t believe it sounded unbelievable. Until one night around 3am I woke up from a nap and heard noise coming from the dining room loud chatting and laughing like a bunch of people were hanging out eating and having fun and I could hear the utensils being used. Non of the patients could not walk they all used wheelchairs , there was no tv on. The next day I told the ladies they weren’t surprised they had heard the noise many nights too. This went on for several nights between the hrs of 2am -4am once the clock touch 5 or the sun starts to rise you will not hear nothing more complete silence. Non of us was brave enough to go look I was terrified.",
   "created_utc": 1693201775,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy21mfz",
   "message": "So I’m a 4th generation medium, and I’ve lived in some pretty active homes. The best one was my grandmas house. We had a little girl ghost that’s been there since I was a toddler. She was the first spirit I connected with, and she never left. \n\nMy room was the play room with a little daybed in it. When I would be on my bed, she would be on it too and you could see the indentation of where she sat. In the middle of the night she would get bored and play with the toys, so cars and balls and anything that could roll would be sent out into the hall. She would apparently get hungry too because all the snack cabinets would be left open in the morning. \n\nThis happened almost every night, even when I wasn’t there. And it continues to this day. My grandma leaves a fire truck out for her to play with still even through me and all my cousins are adults now. What’s cute to me, is that my daughter had her fist experience with the same little girl ghost and that’s how we found out she has the sight too.",
   "created_utc": 1693201943,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy22uaj",
   "message": "I was driving home from work. I usually took the country roads to avoid traffic. As I was going down my usual route, I saw someone's taillights flashing a ways down the road, maybe a mile or so. I found it odd and hoped it wasn't any serious trouble. A minute goes by as I approach and the lights are still flashing, not moving from what I can tell. As I came closer, maybe a few hundred yards, the lights started to fade until there was nothing. At that point, I had slowed down in case it was someone who broke down. I was maybe going 30 as I came closer, but there was nothing. No car on the side of the road, and no roads going anywhere off the sides, it was a straight shot. No obvious tracks to indicate someone going off the road, corn fields on both sides so no way they drove through the field, and the road ahead was clear, no humps or dips where they could've disappeared from sight. There weren't any of those reflectors either.\n\nI'm obviously not stopping to investigate, especially since there wasn't any way of pinpointing exactly where the lights were. I continue on my way, back up to speed after a while, and see no evidence of any other vehicle both ahead and behind me. There was just a random occurrence of two flashing red lights in the middle of the night out on a country road.\n\nMy theory outside of paranormal activity is it was maybe two bikers with those lights on the back, even though it doesn't make sense why they would just disappear like that unless they were doing something shady and avoiding being seen, which doesn't make sense since they had those lights to begin with and that's the whole point of them is to be seen. Other than that, what else could those lights have been?",
   "created_utc": 1693202860,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy22wb9",
   "message": "Staying in a hotel room by myself in Pattaya, Thailand. Top floor, last room.\n Checked in mid afternoon and passed out on the bed. \n\nWithin 20 mins I woke up to the feeling of the end of the bed compressing like somebody had just sat on it, I rolled over and dozed off again. Woke up maybe 5 -10 minutes later to the same thing but on the opposite side. It unsettled me a bit, but I didn't feel any negative vibes so I just let it go, nothing else happened. \nIt's the only paranormal experience I've had while 100% sober so I know my mind wasn't playing tricks on me.",
   "created_utc": 1693202904,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy2350d",
   "message": "This was in a house I used to live in.\n\nMy wife had seen a kid looking at her from down the hallway (we don't have kids), there was a spot on the wall that the dog would constantly growl at, and one time I fell asleep on the couch while home alone and woke with the feeling of someone tussling my hair - I assumed it was my wife but nope I was still home alone.\n\nThe house wasn't even super old, it was built in the 1980s. Of course there could be simple explanations, my wife could have been tired and briefly seeing a trick of the light, the dog could have been growling at mouse activity in the walls, and my hair might have just been rubbing on a cushion or something. \n\nBut it's the only house I've genuinely felt creeped out in.",
   "created_utc": 1693203090,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy243ct",
   "message": "When I used to live in a house that was supposed to be haunted, I didn’t believe it at first and not sure I still do but I heard a noise behind me one day and turned to see a large heavy piece of furniture sliding across the floor.\n\nThis is the only time I saw anything strange but other people had told me their stories.\n\nIt moved maybe 6ft before stopping and all I could do was stare at it.\nBtw we had the place checked for gas leaks etc in case it was hallucinations as things would move around the house all the time and end up in different places.\n\nI did try and set up a camera for about 2 weeks but all it caught was a door slamming one time at about 3am (audio only).\nThe events were unpredictable and would sometimes go months without anything weird and then suddenly get a whole load of strange noises and things happening before it would all stop again.\n\nWe got up that night and checked and the kitchen door was now shut when we know we had left it open earlier but all the locks to outside the house were bolted with locked you can’t unbolt from outside.\n\nNo crawl spaces just solid walls so no way someone was getting in (also had this checked out)\n\nOver the years we lived there someone told me that they had actually seen an apparition, this happened twice to 2 different people, one of which had no prior knowledge of anything in the house and hadn’t spoken to anyone about it (they were a workman in fact)\n\nI still don’t know what to make of it.",
   "created_utc": 1693203828,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy243dl",
   "message": "When i was little, i would spend hours in my bedroom alone playing with my barbies. On one occasion, i was in my room playing while my mom \u0026amp; brother were in another room playing games on our computer. Every now \u0026amp; then i could hear them laughing \u0026amp; talking but it wasn’t loud enough for me to take serious notice of. In the middle of playing i heard a loud laugh coming from my closet. i was facing the direction of my closet \u0026amp; bedroom door which were right next to each other so i knew there wasnt any way of my brother sneaking in on me. It wasnt a quiet laugh either, i’ve always described it as sort of a witch’s cackling. i remember when i finally got the courage to stand up that i booked it out of my room, went to my brother’s room \u0026amp; being so confused why i heard someone laughing in my closet when there were only 3 of us home. After that, i could never sleep in my room by myself or go in there without a light on.\n\nFast forward a couple years \u0026amp; my family has moved to a different house. I would still get a weird vibe every now \u0026amp; then but nothing that would totally freak me out. i was still scared of sleeping alone so some nights my brother \u0026amp; i would sleep in my room together or we would sleep in his where he had a bunk bed. On one of the days where we slept in his room, he slept in the bottom bunk while i was on top. I’ve always had problems with not being able to sleep through the night \u0026amp; waking up randomly early in the morning so on this day it happened but i thought nothing of it. while i was trying to fall back asleep i vividly remember facing my brothers closet \u0026amp; barely shutting my eyes when i heard the same exact laugh i heard a few years before, except this time right behind me. there wasnt any space behind me except for my stuffed animal that was separating me from the wall so you could imagine how absolutely terrified i was. I couldnt move for what felt like forever \u0026amp; when i peeked over the edge to see if my brother was messing with me, he was knocked out snoring. \n\nIt hasn’t happened again since then but i still think about it when im home alone or waking up in the middle of the night.",
   "created_utc": 1693203828,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy24f65",
   "message": "I went to a haunted plantation with my family in Louisiana and it's pretty famous. The day was pretty cloudy without the sun in sight as it looked like it was going to rain, this is important for later. So we went in and I was just astonished by the history and the vibes were something that wasn't quite right. One of the things that bothered me the most and almost had me in tears were the fact that children had passed away due to selfish reasons as the nanny saw the mistress' kids as her own, so she poisoned them. We also saw picture of where they are mostly found at which was at the side of the house.\n\nAfter the tour was done, my family and I were exploring the house and I felt someone watching me. For whatever reason I just took a picture of the are at the side of the house since it just didn't sit right. Since this was also a famous attraction, I didn't think much of it since it was known in having paranormal activity. After we left that area I didn't feel like I was being watched anymore, just normal really. I forgot I took that picture until later.\n\nWhen I got home later that night my uncle was telling me that he has a picture of a ghost, and so I wanted to look as well. When I was scrolling through the photos I noticed something on the side of the house where I felt like someone was staring at me, in the window there was white markings. This was an old plantation house where the roof covered most of the patio as it was meant for shade back in the day, and there was no sunlight. All this to say that sunlight to be caught on the windows are near impossible just due to the time we got there (12pm), the weather, and the architecture. But there it was a white markings that made a face. A face of what looked to me was a child staring back at me.",
   "created_utc": 1693204090,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy24scr",
   "message": "My grandma had this house and in the backyard there was a little shed. My cousins and I used to play around there all the time, but never in. The house itself already had some weird things going on in it and my grandma tried many things to spiritually cleanse the place. One day, she asked my cousin and I to go to the shed and get the potatoes. When we opened the shed door there was a family of 4 hanging on a noose in there. We ran to tell our grandma and when we went back to the shed to show her, they were no longer there. \n\nThat was the last paranormal activity we went through. My grandma dropped everything and we moved into a newly built home that no one ever lived in far far away. My grandma still lives there until this day. \n\nAnother story: \n\nI have an aunt who everyone in the family thinks is crazy because she says she can talk to ghosts. Weirdest thing is it’s quit believable because she says some things that is very true. My mom always took her for a joke. During a family gathering, post funeral, my aunt called to see how everything was going. They chit chat for a little bit and then my great aunt passed the phone to my mom. My mom asked my aunt what she was doing and my aunt said she was hanging with Beth. However, Beth had passed away 10years prior. My mom started laughing and making fun of my aunt and said “oh yeah pass her the phone”. My aunt passed the phone to “Beth” and my mom says she heard Beth’s voice say her name. My mom turned white as Casper and she never made fun of my aunt again😅",
   "created_utc": 1693204380,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy24sux",
   "message": "We had already had multiple instances of haunting in the apartment.  The bathroom was the center of it.  You could pull the shower curtain shut, leave the room for a couple of seconds, and the curtain would be open a few inches.\n\nDidn't matter how long you left.  Ten minutes, an entire day, three seconds.  That fucking curtain wouldn't stay closed.  \n\nI have two friends that are lightning rods for weird shit.  They both saw the same thing.  A teen girl, pale pale except for her hair, sitting and clutching her legs, rocking back and forth in the tub.  \n\nThe apartment was situated at the bottom of a hill, so the back side of it was underground.  There was a door in the breezeway that led to what we Alabamians call a \"crawl space\" even if it's large enough to stand in.  In the crawl space, you could see the back walls of my apartment, as well as the apartment across the hall.  Both of them just smooth drywall, until you got to where that fucking bathroom would be.  There, the drywall was ripped and torn.  \n\nThe only other important thing about the crawlspace is that it was ventilated by a gap on a far wall, covered with a standard slotted vent cover. It was maybe 7 feet up the wall, from the inside.  From the outside, the vent was a few inches above the ground.\n\nWhen we decided to move the new place offered a free month.  You could take it up front or spread it out over the lease.  We took it up front, overlapping it with the end of our lease at the old place.  This gave us a nice easy month to leisurely move.\n\nI promise I'm getting to the creepy shit.\n\nSo we take our time, and toward the end of the month I was packing up our closet, which shared a wall with the haunted bathroom.  My fiance was packing up the master bathroom closet, which shared the perpendicular wall with the haunted bathroom.  It's dark and oppressive in the apartment, this is nothing new, situated semi subterranean one doesn't expect a lot of light, but it's not just dark it's pushing down on our shoulders, drawing our eyes to the floor.  A crunch, then, as something stabs into the corner of the walls, from the side of the bathroom.  It drags down, sounding like nothing so much as claws rending through plaster, scratching deeply as if trying to get to us both.  \n\nI froze.  So did she.  \n\n\"Babe?,\" she asked, meaning was that me, did I fall or scrape something.\n\n\"No.\"\n\nAnd we fled, as the sound of a kettle whistle came from nowhere, the pitch growing higher and higher.  I heard an angry shriek that wasn't Laura.  \n\nIt was a week before I went back, with one of my lightning rod friends.  We took the long way around, choosing to walk around the side of the building and down the hill instead of taking the stairs.  There, on the grass, lay the vent cover, easily eight feet away from the gap in the mortar, as if it had been blown out with great force.  \n\nWe walked into the apartment, and I swear there's more light in there than there's ever been.  My shoulders were light.  My friend looked at me, and nods.  \"There's nothing here,\" I say.  \"She's gone.\"\n\nThat's when I realized that she knew we were leaving, and she was fucking PISSED that she couldn't torment us anymore, and she left, blowing out the grate on the vent as she did so.\n\nThere's a part of me that wants to know if she's just a manifestation of the thing I saw when I was 5.  It felt the same, in my gut, and that chills me, because it means this thing is following me, and I really don't want to see her again.",
   "created_utc": 1693204391,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy25iz7",
   "message": "Feeling and waking up to pawprints of my dead cat on the duvet I was using.",
   "created_utc": 1693204960,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy27g2w",
   "message": "I was travelling with my family on Highway 666 in 2008 This road, nicknamed the Devil’s Highway, passes through Utah, Colorado, Arizona and New Mexico.\n\nsuddenly my mom saw a kid aged around 8-9 years in white standing far away beside the highway at that time my father was driving so when we reached near him we all saw him like he was smiling it was around 9 in the night so we thought some might be camping around or other possibilities could be.\n\nAfter some 3 mins driving on the road we saw him again standing on the opposite side by this time we had realized that this is not normal.\n\nand after 2-3 mins my father told us that don't look through the window as look straight and pray. but when we looked at the mirror bunch of boys all of same age all of same dress and all of same face ( which was not so visible a bit blurry) smiling, running with our car at same speed and smashing our cars with their bear hands. this creeped me soo much that I closed my eyes and started praying loudly and after 5 mins they just vanished in thin air.",
   "created_utc": 1693206489,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy27mwq",
   "message": "Oh i got one, its when my mother bring my little brother home after being born(after 2 week stays at hospital). Ive been living alone in the house for that 2 weeks and never get any weird stuff happening. That day on 5th day he was home, late at night I wasn’t sleeping yet. So i just playing with some cars while laying down next to my little brother. Suddenly the air becomes a chilly, i got up and take the blanket to cover my body and my brother’s. As i laying down, im facing the ceiling. There’s head upside down with a long hair sticking to the ceiling(not falling down like any normal thing) the eyes were  white and staring at me, few seconds feels like few hours with that thing staring at me. As i heard a footstep going through the room, the head faintly smiles and just disappears to thin air when i was blinking. Mind you i was almost peeing the bed that night without saying anything, my mom entered the room and looking at me weird. As my face pale as a deadman with sweat all over my face. I cant sleep well that day",
   "created_utc": 1693206641,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy28mqw",
   "message": "So, this one happened to me quite recently, (about a week ago) and looking back, it could have been an animal, but here goes:\n\nI don’t like being outside at night; it freaks me out. And living in a rural area, I’ve read too many Skinwalker/Wendigo/Rake stories to hang out in a field at midnight.\n\n But, I left my cat outside, and being that coyotes roam my property, I always bring him in to be safe. I went out with my phone’s flashlight, and started calling quietly for him, not wanting to wake my household up. I went toward my fence and aimed my light at the tall grass on the other side. There, I saw a pair of eyes. \n\nI know what you might be thinking; It’s my cat, right? Nope. Cats’ eyes glow green/greenish yellow under light. This eyeshine were white, almost tinted with blue. And it wasn’t a deer- it was very low to the ground. Maybe 3-4 feet. And as I was staring at them, practically frozen, they disappeared. No rustle to indicate that whatever the fuck was standing there ran away, just a silent blink-out. \n\nMy heart was pounding, and I turned around and saw my cat near a shed close to my house, looking spooked and staring at the same spot the eyes had been a moment ago. I scooped him up and ran inside, terrified. \n\nThe next day I went out with my dog, and took her to sniff the spot that I had seen the eyes. She kept circling, and whining, and the fur on the back of her neck was standing up. It’s safe to say that I’m not going back outside at night again for a long time.",
   "created_utc": 1693207450,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy294b8",
   "message": "Okay when I was like 6 or 7, I woke up in the middle of the night just to notice there is a strange creature, standing on the right side of the bed.l don't know If it was a ghost but it was all black like a shadow or something. I was really frightened and I quickly turned on the lights but it disappeared. Maybe it was hallucination but at that time it felt like it was really staring at me. To make it more scarier there was a bible on the counter of the bed and it was going back and forth touching it 🙀 . So coming back to the lights which really scared the shit out of me and I still remember it till this day, when I switched off the lights I saw it again. So I decided to sleep through out the rest of the night with the lights on.",
   "created_utc": 1693207858,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy2ap1y",
   "message": "I once saw a faceless woman sitting on at a bench in the dark at 3am. I had to walk right by her and there was nobody else out there.\n\nHer clothes were very off and strange (like a style I've never seen before ...maybe victorian but not really..just really strange clothes not from this world or time period) and her face was a fleshy material but also kind of blurry. No eyes/no nose/no mouth, just this cardboard coloured flesh that seemed off. She had a really frightening otherworldly presence about her. She was completely physical other than the slight \"blur\" in her face. \n\nI remember before it happened (weeks before) I was walking around there in the day and it was super hot out (unbearably hot). And suddenly the air became ice cold within a split second (almost winter cold). I remember it scaring me.\n\nI stopped going around there after I saw her, it was too scary.",
   "created_utc": 1693209167,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy2arqh",
   "message": "My cat died when I was a kid but I was old enough to know that she wasn't coming back and didn't join the circus or whatever lie parents tell kids.\n\nShe would always sleep on my chest when I was in bed. Being a kid and kind of scared of the dark, I'd keep my bedroom door open a crack. Enough that it was \"closed\" but also it could easily be opened.\n\nAfter she passed, I'd hear my door open and I'd feel that familiar pressure on my chest every night. Eventually I told her \"Hey, everything's okay. You can rest now\" or something similar and I never experienced that again.\n\nSometimes I miss it 20+ years later.",
   "created_utc": 1693209230,
   "score": 1,
   "submission_id": "16316r9"
  },
  {
   "comment_id": "jy2dddn",
   "message": "I saw my granny\\`s ghost in my room while i was cooking pizza for my sister and dad, but my sister punched me, ghost disappeared",
   "created_utc": 1693211395,
   "score": 1,
   "submission_id": "16316r9"
  }
 ]
}