{
 "submission_id": "1632hy4",
 "title": "what is the craziest thing you've done while being horny?",
 "selftext": "",
 "created_utc": 1693171354,
 "permalink": "/r/AskReddit/comments/1632hy4/what_is_the_craziest_thing_youve_done_while_being/",
 "score": 199,
 "url": "https://www.reddit.com/r/AskReddit/comments/1632hy4/what_is_the_craziest_thing_youve_done_while_being/",
 "comments": [
  {
   "comment_id": "jy0h18x",
   "message": "I can't be bothered setting up yet another throw-away account right now.",
   "created_utc": 1693173132,
   "score": 97,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0qe55",
   "message": "Subscribe to a month of Tinder gold",
   "created_utc": 1693177313,
   "score": 54,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0wdfs",
   "message": "Was talking to my gf at work and it got sexual, I legit made an excuse to leave work and she was like you actually left I can't leave lol",
   "created_utc": 1693180022,
   "score": 83,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0x1vb",
   "message": "Ugh, not me but a friend (legitimately).\n\nI get a call at 10 pm “hey I need your bathroom I’m gonna make a porno. I’ll be there in 5 minutes”.\n\nI thought about it, and decided arguing a demand like that was pointless. I said “fine, just make sure your out by 10:30 and clean the tub”. \n\nNeedless to say, meth was very likely involved, shower was clean as a whistle and the “porno” was done at 10:30. I didn’t hear a peep and didn’t see a face.",
   "created_utc": 1693180330,
   "score": 3,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0fbx0",
   "message": "Fucked the couch and nutted between the cushions",
   "created_utc": 1693172414,
   "score": 21,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0fmnr",
   "message": "Craziest?! Try stupidest. I was FWB with a woman a few years back. She lived 60 miles away from me and I had a shitty old van. She talked up what she was gonna do to me if I drove to her. I used the last of my money on gas, drove down to her and we fucked all day. That part was great, the drive back, not so much. I got a flat on the freeway on the drive home. I forgot my spare too. One day was wonderful, the next was terrible.\n\nNever drove that distance for sex again.",
   "created_utc": 1693172540,
   "score": 215,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0d4ad",
   "message": "Fucked my pillow while on FaceTime with my gf while she watched",
   "created_utc": 1693171495,
   "score": 51,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1j9i7",
   "message": "Got stationed in Jacksonville Fla. Not even 24 hours in town, hooked up with a local and got chlamydia. Got bore-punched at medical and the fucking corpsman said “Welcome to Florida, shipmate. Wrap that fucking thing.”",
   "created_utc": 1693190840,
   "score": 103,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0xi0n",
   "message": "Just a few.. jerked off under the covers in bootcamp because of lack of privacy..marines.. got jerked off by an old lady in japan .. left my roommate  at the club to jerk off to porn on his laptop since i didnt have one ..he walked in on me lol",
   "created_utc": 1693180535,
   "score": 188,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0evfl",
   "message": "Call my ex",
   "created_utc": 1693172220,
   "score": 156,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0dogs",
   "message": "Swap nudes on Reddit",
   "created_utc": 1693171724,
   "score": 233,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0fjkx",
   "message": "Ripped my frenulum",
   "created_utc": 1693172504,
   "score": 186,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0uwy7",
   "message": "This random lady at the lake wanted to blow me and I let her. She wasn't pretty or anything. No lie, it was one of the best blowies I ever got. She told me to come back to that spot every Friday and she would blow me every time, but I never went back. I wanted to. She complimented my penis size and even said I have good tasting nut. I've never told anyone about it. I got tested after just in case. I guess she just gets off on anonymous hook ups.",
   "created_utc": 1693179355,
   "score": 189,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0hyqc",
   "message": "I think her name was Jessica.",
   "created_utc": 1693173533,
   "score": 237,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1qtij",
   "message": "Fuck it: when I was a horny teenager, I could only really just access certain PG magazines or newspaper clippings/brochures for my ah - adult literature time.\n\nI also got a bit high one night and decided to have the **ultimate wank**. In theory, I was going to surround myself by my reading materials and be completely immersed by all my wank bank, at the same time. \n\nSo there I was - rock hard - surrounded by everything I had; now spread out across the bed, floor etc. the intention was to look at everything at least once, before finishing to complete the ultimate wank in a captured environment. \n\nIn reality, I lasted all of about 2 and a half seconds and jizzed basically all over most of my collection. This was not the desired outcome, as this meant the untimely retirement of nearly half the collection. \n\nI was so angry and disappointed I just scrunched everything up and threw it away in the outside bin. \n\nThat night however, the neighbours intelligently challenged dog decided to look through our bins - leaving my collection out on the open grass over night. \n\nA nosy elderly lady found it, but thankfully, she somehow concocted the elaborate idea that it was some incredibly sick serial pervert, who’d decided to make a ‘public shrine’ for the world to see as that was “the way this planet’s going”. \n\nQuite the roller coaster indeed.",
   "created_utc": 1693194905,
   "score": 232,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy11lpm",
   "message": "A guy I had been talking to here and there wanted to come by my job at the time to bring me Starbucks. I was really horny and wanted to skip all the getting to know you stuff so I had him come by my work one day. I was 18 and at my first MW job, I told my dad I’d be working late (not true). I was clocked out and went to his car in the parking lot, he went to the other side of the the lot of the big shopping center I worked at and we were making out, all up on each other, and I gave him head until he came. He didn’t have anything in his car for me to clean up what I didn’t sallow, since he did a big load so I had to use my Taco Bell apron to clean it up. I then had him drop me back off at my work so I could use the bathroom to finish cleaning up. One of my co workers noticed I had came back after an hour of me being clocked out and just looked confused.",
   "created_utc": 1693182420,
   "score": 164,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0hmkt",
   "message": "Did some mutual hand stuff with a close friend. She and I had never even kissed before.",
   "created_utc": 1693173388,
   "score": 157,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0sj2c",
   "message": "Spent $200 on uber ($100 there and $100 back). Idk why I did that. I was fucking stupid.",
   "created_utc": 1693178281,
   "score": 215,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0fls5",
   "message": "I got horny at the spa and jerked a guy off, and also gave him head. The thought of getting caught is what made me horny.",
   "created_utc": 1693172529,
   "score": 119,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0rkdr",
   "message": "Fingered my gf under the table at a wedding while my dad was sitting right next to me and aunt and uncle across the table",
   "created_utc": 1693177846,
   "score": 177,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0xhpw",
   "message": "*13 y/o*\n\ndug a penis size hole in the ground. filled it with packing grease\n\n\nfucked it.",
   "created_utc": 1693180531,
   "score": 245,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0uld2",
   "message": "Sex in the Weiner department store dressing room. Sex in the church balcony. Sex in another Weiner department store dressing room. Don't know how to prioritize these.",
   "created_utc": 1693179209,
   "score": 62,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0kusr",
   "message": "Strip poker with my GF + her best friend. That led to something like magic.",
   "created_utc": 1693174807,
   "score": 210,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0d4lw",
   "message": "Masturbated in a forest and in a public toilet at work",
   "created_utc": 1693171499,
   "score": 57,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0u210",
   "message": "Let a stripper pull my boobs out and suck them in front of my husband…and a bunch of other dudes.",
   "created_utc": 1693178967,
   "score": 237,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0rsng",
   "message": "Matched with a woman on Myspace(I was like 22) and proceeded to drive like two hours to meet her. She lived with her parents so we basically messed around in my truck I. The woods. I’m June. In Texas. I was covered in sweat and mosquito bites. Turns out she was a squirter so my truck smelled like poon for 2 months.",
   "created_utc": 1693177951,
   "score": 36,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0txjp",
   "message": "Got chlamydia.",
   "created_utc": 1693178910,
   "score": 97,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0gggc",
   "message": "Masturbated in my University's urinal cos my sext buddy was feeling it when I was in middle of a lecture",
   "created_utc": 1693172888,
   "score": 115,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0vh99",
   "message": "Stuck my dick in a vacuum cleaner",
   "created_utc": 1693179611,
   "score": 41,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy14p22",
   "message": "I drunk texted and flirted with my ex-supervisor that is old enough to be my grandma. We live like 3000 miles apart. I have no idea wtf I was thinking",
   "created_utc": 1693183825,
   "score": 38,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1p9dg",
   "message": "Pretty hot, but really, really, really annoying girl.\n\nIn hindsight, it was great. She finally stopped talking, and complaining, and saying mean things about every other girl. And talking, and making herself better than every other person in the world. And talking. \n\nI say this, knowing she probably felt the same! \"At least that guy I hate stopped arguing with me\". Ha! \n\nI think it happened, because she was horney too, and realized everyone hated her. I'm sure at 2am, I was the best of the bunch to settle for.\n\n\nReading farther reminded me of another questionable time I'd absolutely do again. Was sad for the girl, not me. \n\nIn 11th grade I went to an older friends fraternity party. Got really drunk, went outside to get air. Start talking to a cute college freshman nursing student. \n\nI tell her I have to walk back to the alley to puke. She insists of walking with me, reminds me she's a nursing student. So I puke, she insists oh holding me and stroking my hair. \n\nI puked, and puked, and puked. But by that age, it was a weekly thing. I knew I'd be back to drinking in 20 minutes, fresh as a daisy. \n\nI finish puking, feel OK. As I'm standing upright, she holds my face to her tits, says don't stand up and get dizzy. I'm thinking, uhh OK. This is fine! \n\nSo she's leaning against the garage, I'm standing, bent into her chest, she's stroking my hair, reminding me she's a nursing student and has seen worse than this. At that part, I'm thinking she's a serial killer, but the hair stroke while resting on her tits feels great, so lets risk it. \n\nA minute later, she lifts my head up, holds my face. And kisses me. \n\nRemember, I'd just puked my guts out. I'm thinking I gotta get away from this freak. Then, she slides her hand down. \n\nNext thing ya know, I'm getting an alley BJ. We finish. Walk back to the party. I got a fresh beer. Sat out front on the porch with her. \n\nShe kept holding to her tits, then we'd walk back for another BJ. Got 2 more afyer the first one. \n\nEnd of the party, I invite her to stay. I planned on sleeping on a couch, buy the brothers saw what was going down, and offered a room if she stayed. \n\nShe did not. A month later I ran into her at another party. She already had a guy she hugged to her tits, and she acted like we never met. \n\nPissed I showed up late! But took the win from before.",
   "created_utc": 1693194032,
   "score": 39,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0os6q",
   "message": "Fucked one of my friends back when I was like eighteen? He is now a member of my dad's band 💀 lol",
   "created_utc": 1693176578,
   "score": 68,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0s301",
   "message": "Smoked meth, watched porn and fucked for 8 hours straight, we were both raw at the end.",
   "created_utc": 1693178081,
   "score": 99,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy12yes",
   "message": "Grew up pretty poor. Family baught a cantelope for a treat.\nThey whent out for a few hours so i microwaved and molested the cantelope with my penis. Drilled a hole in the side and jammed er in.\n\nFelt amazing. Great releif.\n\ni cut it up and skin the rinds so it looked like i ate it and through all the melon guts in the woods. They never knew i humiliated a cantelope but they were some pissed thinking i ate the whole thing alone",
   "created_utc": 1693183031,
   "score": 124,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0x79e",
   "message": "Leaned over to one of the ugliest women in the bar, asker her if she wanted to have sex at my place, and we left on my motorcycle....",
   "created_utc": 1693180398,
   "score": 81,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0zyth",
   "message": "After a night out, parked my car then walked across the street to a new house under construction. Walked up the stairs and wanked on the second floor. Then went home.",
   "created_utc": 1693181666,
   "score": 28,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1k1tn",
   "message": "I’ll probably delete this later since I don’t have a throwaway. These are both early horny teen years:\n\n1) warmed up some bologna slices on the home heater vents - put some Vaseline on them and jerked it.\n\n2) Put my dick between two mattresses on my bed and f’d the bed - lol.\n\nPlease remember this is early teens and crazy hormones happening. Hahahaha",
   "created_utc": 1693191233,
   "score": 26,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0tjy5",
   "message": "I got \"stuck\" once and I don't wanna talk about it...giggity",
   "created_utc": 1693178740,
   "score": 74,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0zw01",
   "message": "I hadn't had sex in a year, and I had only done it in a relationship. I got drunk and was complaining to my friends who are a couple and said something along the lines of \"You can't just ask someone to fuck you\" to which they said yes the fuck you can. So I texted a guy who had been in my dms and long story short I took his virginity on the roof of his car in the middle of a field",
   "created_utc": 1693181631,
   "score": 89,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0ndyg",
   "message": "i have, on two different occasions, run a red light without realizing it while on the way to bone",
   "created_utc": 1693175947,
   "score": 50,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1883f",
   "message": "My gf (now wife), myself, and my friend we'll call Jim went over my gf's friend \"Sarah\"'s house.\n\nSarah was... for lack of a better word.... promiscuous. She was bi, liked spontaneous hookups, and (I soon found out lol) had the hots for her friend (my gf) for a long time.\n\nWe smoked and drank there, and about an hour after we arrived we were all in the living room and I just started messing with my gf. Took her shirt off, literally got her naked.\n\nClaudia looked over saw what was happening and just... *stripped*. The most excited I've ever seen someone.\n\nSo Jim fucked her, I fucked my gf and Sarah, and Sarah fucked everybody.\n\nIt's the first time I ever had two girls give me a bj at the same time and I have to say it is everything you think it is in your head and more.",
   "created_utc": 1693185488,
   "score": 98,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0qfpy",
   "message": "Jerked off in an outhouse in ethiopia during a missions trip.",
   "created_utc": 1693177333,
   "score": 73,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0xha8",
   "message": "Anyone here nut on the underwear models in a sears catalog only to have to try and explain the missing pages? Just curious",
   "created_utc": 1693180525,
   "score": 65,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy12y9c",
   "message": "I jerked in class in middle school once we was watching Bill Nye",
   "created_utc": 1693183029,
   "score": 20,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0tgy0",
   "message": "Wrestled my wife, she won… Or did she?",
   "created_utc": 1693178703,
   "score": 45,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0uedu",
   "message": "You wouldn't know her, she went to a different school.",
   "created_utc": 1693179122,
   "score": 73,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy13ey9",
   "message": "It was about 11 pm and I wanted to get really kinky so I picked up a enema kit, two redbulls and hit up very particular type of call girl. One of those occasions whereas it could have been really bad or really good, turned out really good!",
   "created_utc": 1693183239,
   "score": 18,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0yggj",
   "message": "Paid a woman to pretend she likes me.",
   "created_utc": 1693180977,
   "score": 18,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1n2zp",
   "message": "Drunk on a resort in the Dominican Republic, got horny so I went to my room and as I was going in I saw the maid was next door. \n\n\n\n\n\n\nWent in the bathroom and jerked off only to have the maid knock on the door 30 seconds later… this wouldn’t be a major issue except the fact the curtains were open and the bathroom had frosted glass instead of actual walls. Well, my drunk ass didn’t say anything and I just got up and left back to the bar. \n\n\n\n\n\nNever mentioned it again… until now",
   "created_utc": 1693192840,
   "score": 17,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0d9vz",
   "message": "I said \"be gone evil thoughts\" and moved on with my life",
   "created_utc": 1693171558,
   "score": 96,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0jcck",
   "message": "Friend at work... she was laughing when she looked over at my computer and saw me looking at the building plans, because she asked me where in the office we could... relax. Fortunatelly our office buildings have a lot of showers.",
   "created_utc": 1693174135,
   "score": 47,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0x3ll",
   "message": "Fucked my French tour guide in a public bathroom.",
   "created_utc": 1693180351,
   "score": 47,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1ps47",
   "message": "Got head in a church pew during a community showing of The Passion of The Christ.",
   "created_utc": 1693194321,
   "score": 16,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0uhjp",
   "message": "Is it too soon to say, “Your Mom”?",
   "created_utc": 1693179162,
   "score": 40,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy13v22",
   "message": "I fucked a snow man and now they call me Boner Champ",
   "created_utc": 1693183446,
   "score": 46,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0r8ou",
   "message": "guys, never try to fuck an angry wasps nest...",
   "created_utc": 1693177697,
   "score": 86,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1lv6t",
   "message": "Drove into a telephone pole trying to get to a womans house.",
   "created_utc": 1693192182,
   "score": 13,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0txcv",
   "message": "Took an uber at 1am from a perfectly good hotel room to a different hotel an hour away, paid double rate for a room for just a few hours, and an uber ride back in big city rush hour traffic \n\nHe was worth it",
   "created_utc": 1693178908,
   "score": 25,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0xs9o",
   "message": "flicked the bean while driving 😭",
   "created_utc": 1693180667,
   "score": 24,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy120x7",
   "message": "Threw myself at the wrong guys. I regret trying to give it myself to people who weren't worth it. I cringe thinking back.",
   "created_utc": 1693182610,
   "score": 25,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1cwab",
   "message": "I won’t admit to anything major on this account but talking to old men basically",
   "created_utc": 1693187742,
   "score": 11,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0vyjk",
   "message": "At some point y'all tiktok users should just stop reposting the same fucking questions everytime",
   "created_utc": 1693179830,
   "score": 102,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1fyad",
   "message": "Craigslist hookups with complete strangers",
   "created_utc": 1693189220,
   "score": 10,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1pxzk",
   "message": "One time I read one of these where the person sent nudes to guy fieri and he blocked them and I still laugh thinking about it",
   "created_utc": 1693194411,
   "score": 10,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0i1pe",
   "message": "My girlfriend at the time and I fucked on more than one occasion at my work office. My boss usually only pops in a couple times a day in brief increments, and there weren't any cameras, so we went for it. Never been caught.",
   "created_utc": 1693173568,
   "score": 28,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0ta2g",
   "message": "A Christian chick.",
   "created_utc": 1693178617,
   "score": 29,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0zigg",
   "message": "Got married.",
   "created_utc": 1693181457,
   "score": 25,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy11zlu",
   "message": "I dated a dummy hot bisexual stripper all through my 20's. While ultimately, we were incompatible, we enjoyed our youth.",
   "created_utc": 1693182593,
   "score": 23,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1ezpj",
   "message": "I met this girl in my grade school (8th grade) who lived kinda close to me. Driving it was a couple miles, but walking directly through the woods between both of our houses was only about a mile and half. The first time I did it I came out pretty far away from her house but by the 5th time or so I had it down pretty damn good. Eventually the bushwack turned into a herd path and when the night sky was clear I didn’t even need a flashlight. She would just sneak me in through her window and we would party down. Well after a couple close calls because of the noise she started asking me to bring her back to my place. But the thing was she would never make the trip through the woods alone. So I would walk there. Get her. Walk back to my place. Walk her back home. Then walk back home myself. These booty calls we’re making me walk about 6 miles a night. That was a wild summer. The fling ended when I kicked her dad in the face sneaking into her window on accident during the winter.",
   "created_utc": 1693188754,
   "score": 17,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy199n5",
   "message": "Fucked my ex-wife.  Mistake, she thought we were getting back together.",
   "created_utc": 1693185988,
   "score": 8,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1btxj",
   "message": "Had sex on the front lawn of the governor's house in Annapolis Maryland. Hmm, 3 somes 4 somes. Masturbated in my car while driving...maybe, and I'm female... Made out and went to third base with a bisexual guy in a wine cheese cracker joint on Dupont circle in Washington DC so sexy. I've said too much already. Another time I was tongued down and fingered by a naval officer in a coat closet at a officers banquet, and I'm somewhat of a prude now. please continue with your regular scheduled program...",
   "created_utc": 1693187226,
   "score": 17,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0lu4f",
   "message": "Jumped off a 2 story build on top of my step-bro who’s kind of a bodybuilder. He was fine, but I twisted my leg and it hurt like hell for a couple weeks. \n\nI just happened to be horny at the time, I just didn’t act on those feelings.",
   "created_utc": 1693175244,
   "score": 34,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy12ty7",
   "message": "You couldn't waterboard that out of me.",
   "created_utc": 1693182975,
   "score": 25,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy1c1wv",
   "message": "My girlfriend and I were long distance. She lived several hours away from me. As I was driving to visit her one week, I got so horny in the car. I was just too excited to see her after a long time apart.\n\nI took my dick out as I was driving down the interstate. (I covered with a hoodie in case ppl drove by.) But I just couldn't take it anymore; I had to be free from my jeans. \n\nI eventually pulled off at a rest stop and masturbated in the stall. Just stood in front of the toilet, like taking a piss, but unloaded cum instead.\n\nPretty cringe, I know. Not super proud because it sounds creepy. That was my first time doing anything sexual in public (somewhat). \n\nCome to think of it, I did a similar thing years later at my work place. I worked night crew where there were no customers and on lunch breaks the other employees would just scatter around the store for alone time, or to take a nap, etc. One night, I was by myself during lunch and just got so horny. Probably looked at some porn on my phone. Eventually took the risk of jacking it in the bathroom stall. (I knew no one else would be using that bathroom.)",
   "created_utc": 1693187334,
   "score": 7,
   "submission_id": "1632hy4"
  },
  {
   "comment_id": "jy0jzql",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1632hy4"
  }
 ]
}