{
 "submission_id": "1635qxv",
 "title": "People 40 years old or more. What is some advice for the younger people?",
 "selftext": "",
 "created_utc": 1693179039,
 "permalink": "/r/AskReddit/comments/1635qxv/people_40_years_old_or_more_what_is_some_advice/",
 "score": 63,
 "url": "https://www.reddit.com/r/AskReddit/comments/1635qxv/people_40_years_old_or_more_what_is_some_advice/",
 "comments": [
  {
   "comment_id": "jy0xtph",
   "message": "take care of your knees and back.",
   "created_utc": 1693180686,
   "score": 152,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0xiyf",
   "message": "You're not special, no one cares what you do and the sooner you can accept it, the sooner you can be at peace with yourself.",
   "created_utc": 1693180546,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0xbnl",
   "message": "Love life it is short. Be grateful for everything. The biggest burden you’ll carry are your own thoughts. Learn to live in the present, the past is just a memory and the future is just your imagination. You don’t have to accept the negative self dialogue, be the watcher of those thoughts and learn to let them go. You are braver than you believe, smarter than you think, stronger than you seem and loved more than you know.",
   "created_utc": 1693180454,
   "score": 111,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0v16s",
   "message": "Stretch everyday or at least more then never. Stay limber and flexible because once it is gone, it’s almost impossible to get it back.",
   "created_utc": 1693179408,
   "score": 56,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0xtgv",
   "message": "Don't do hard drugs.",
   "created_utc": 1693180683,
   "score": 58,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy15s6g",
   "message": "40 isn't old",
   "created_utc": 1693184327,
   "score": 44,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0vxs0",
   "message": "Save your money",
   "created_utc": 1693179821,
   "score": 43,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy110ws",
   "message": "Take care of your teeth. It's nice to have high standards, but it's even better to have a friend with you and not be alone.",
   "created_utc": 1693182154,
   "score": 31,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy13z88",
   "message": "Don’t “wait to get in shape”\n\nStart working out however is enjoyable to you so you avoid health risks later. Don’t wait to have to lose 30 lbs",
   "created_utc": 1693183499,
   "score": 27,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy10xjc",
   "message": "Don't fall into the trap of thinking everyone else your age has something that you don't and you feel hopelessly behind and like a failure.\n\nOnce you're out of school, there are no timelines anymore. You are not supposed to do anything by any particular point in your life. Everyone is different. \n\nYou are not supposed to have had X number of sexual partners, had X number of relationships, be married, have a kid, own a house, have a dream job, or figure out your calling in life at any particular point - if at all.\n\nLife is very long and you will have many chances to do things.\n\nMake your own path.",
   "created_utc": 1693182112,
   "score": 24,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1885a",
   "message": "F44. \nDon't do meth, don't do it, just don't. It's not like other drugs. If you would think twice about ingesting a chemical that would give you permanent brain damage, then don't do meth.  \n\nDo protect your brain and emotional state.  Reduce your exposure to things and people that distress you.  Life is hard enough.\n\nNothing stays or stays the same forever.  You will lose things that you feel you can't live without and you will live on.  It hurts a bit less the quicker you radically accept this. \n\nYou have been exposed to an unbelievable amount of absolute lies in your life that colour your beliefs and your expectations about how life will go.  Find ways to deprogram yourself.  You know internally what values are core and humane.  The rest need to be thoroughly examined.  What do you really think about the way people present themselves? Do you get impressed by people wearing brand advertising all over their clothes, or driving a certain brand? Does that make sense or scream sucker, really?  The things people fight about, what are the underlying reasons behind it?  What kinds of manipulations have people been exposed to before they hold their views?  Rise above it all, become aware of the dramas people live in.\n\nEven the oldest wisest people on earth don't know much.  We are all little earthling babies that exist for a blip.  \n\nFind your passions and spend your time doing them.  \n\nGoals are good but don't get it twisted, the journey is all there really is, no actualized goal is going to make you feel like you've succeeded.  And succeeding or failing, you're going to die like everyone else.  And whether you do a lot or live a very simple existence, you have as much right to be, and as much value, as everyone else.",
   "created_utc": 1693185489,
   "score": 21,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy11esz",
   "message": "Fail more.\n\nFail all the time.\n\nSet yourself up for failure.\n\nBecause what you will learn is that failure is not some horrible catastrophe, it's actually a part of a process of getting better at something or getting what you want. And going ahead into failure is often how you find yourself unexpectedly succeeding faster than you expected.\n\nAnd the more you fail, the more you immunize yourself against the fear of it so you can get more of it. Failure is something you actually *need* in your life to really get the things you want.",
   "created_utc": 1693182333,
   "score": 44,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy13zka",
   "message": "I was a raging alcoholic in my twenties and thought I would never recover from it. I never found a real job using my first degree or my masters. Part of it was because I was always drunk, part of it was the job market at the time.\n\nI went back to school in my thirties and found something I like a whole lot more. Now, I'm married, nearly ten years sober, and have a great job.\n\nMy point is, if you end up on the wrong path or don't like where you are, there's always time to turn around and change it. Too many people just assume they're stuck where they are and stuck with the issues they have.",
   "created_utc": 1693183503,
   "score": 18,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0zgzy",
   "message": "Keep at a healthy weight/fitness level, and do more now than sitting around waiting for later.",
   "created_utc": 1693181439,
   "score": 32,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy13v13",
   "message": "Save money. Invest.",
   "created_utc": 1693183445,
   "score": 16,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy12gtq",
   "message": "Show up on time for work.  Just because the job is easy or the work environment is laid back, it doesn't mean there aren't people tracking your attendance.\n\nWe've lost 2 people on our team in the last month who were pretty good, but they just couldn't show up on time.  That badge you swipe every morning when you come in?  Management tracks that shit.  \n\nAlong the same lines, it is important to be the \"adult\" in the room.  If you were working at my office, and you wanted to get off of the night shift and come to days?  I'd tell you \"show up on time, and act like a grown up.\"\n\nThat's how I got promoted. Management went down the list and asked \"who shows up, does their job, and doesn't cause drama?\" That's all there was to it.",
   "created_utc": 1693182811,
   "score": 12,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy10tas",
   "message": "Exercise. Brush your teeth.",
   "created_utc": 1693182059,
   "score": 11,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy12jhe",
   "message": "Wear what you want. Travel before you settle down. Don’t have raw sex unless you’re ok with a pregnancy. You don’t need a Hoe Period. Save more than you spend (rent and bills aside)! Maintain your vehicle. Go to the damned dentist! And don’t think that you’re invincible. I lost a lot of friends and a husband in my 20’s. Never say goodbye without feeling… it could be the last time. Also don’t get pets you can’t afford to treat like human children… they’re not accessories.",
   "created_utc": 1693182844,
   "score": 28,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1587x",
   "message": "Your dreams are not static. It's ok to decide the dream you had at 15 is no longer for you",
   "created_utc": 1693184070,
   "score": 11,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0y5ub",
   "message": "save money. work for a higher pay. value yourself. it's nice to live for today, but tomorrow is important too. absolutely do not fall into the trap of \"my retirement plan is death\" lest you be broke as a joke in old age. live within your means. delayed gratification is good. eat right. sleep right. exercise. never stop learning and using your brain. avoid hard vices. moderation is key. cherish the true friends you have. they're rare.",
   "created_utc": 1693180843,
   "score": 10,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy12bxe",
   "message": "You know that dream that seems nuts to pursue?\n\nDo it now.\n\nWhen you’re old, with a house and a mortgage and a dog, shit like “I want to make a movie” get much more complicated",
   "created_utc": 1693182751,
   "score": 9,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy17y6c",
   "message": "Roth IRA. Contribute until it hurts. By the time you make enough money that maxing it is easy, you won't be able to any more.",
   "created_utc": 1693185358,
   "score": 9,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0uynu",
   "message": "Stop. You won't ever  be the perfect image of             yourself in your head",
   "created_utc": 1693179376,
   "score": 30,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy13yku",
   "message": "Don't cheap out on a mattress, pillows or shoes. \nCut back on the sugar. \nDo NOT bring work home with you.",
   "created_utc": 1693183490,
   "score": 25,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy13jo3",
   "message": "Take care of your body.  It needs to last you a long time",
   "created_utc": 1693183300,
   "score": 7,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy15h94",
   "message": "Don't take yourself too seriously, whatever you do you'll probably look back ten years later mildly mortified at how deep you thought you were. \n\nYou're just another confused human not destined for greatness and there's no grand scheme in which you matter one bit, so just chill.\n\nIf you have issues with your self confidence and depend on the validation of others, adress that shit by whatever means are available to you. Nobody is going to do it for you and being insecure gets old fast.\n\nTake care of your health. Wear sunscreen.",
   "created_utc": 1693184185,
   "score": 7,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1455y",
   "message": "Enjoy your hairline/boobs, they aren't going to get better and you will fondly look back on where they were situated when you were younger and hotter.",
   "created_utc": 1693183574,
   "score": 11,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1bx6c",
   "message": "Take photos around where you live; streets, buildings, forests, etc. Because everything will look different in 20 years.",
   "created_utc": 1693187270,
   "score": 5,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0ynkd",
   "message": "Keep active and eat well.\n\nBasic advice can be trickier to implement than it seems. The path of least resistance is to grab the soda on the end cap at the store and to skip the gym because you're tired today. And it's really easy to rationalize *just for today* without recognizing what's become a pattern.\n\nIt always seems like there's tomorrow until the body gives out, and once that happens it can be a vicious cycle. Have seen people's knees start to go by their mid-twenties. Have seen people go through three back surgeries in their thirties. Have seen heart attacks end it before age fifty.\n\nSo two tips: \n\nFind a sport you really enjoy. Once you find the sport you love, dig into the wallet for good equipment. This isn't a frivolous expense: it's an investment in yourself.\n\nLearn to cook from scratch. You don't have to graze on \"superfoods\" from kale to purple cauliflower to whatever else is the fad this year. Instead, eat mostly healthful things and go light on the treats. This shouldn't feel blah: if something tastes like cardboard then don't eat it. Just aim for a reasonable balance and try to make the reasonable stuff tasty.",
   "created_utc": 1693181068,
   "score": 11,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy13zur",
   "message": "Don't party. Bar tabs are the dumbest way to spend your money. Don't jump from relationship to relationship. Learn how to be single and happy. Use condoms. They don't feel bad, people are just stupid. Even with a condom on, pull out anyway. Buy used cars and learn to work on them yourself. Anything you finance, pay more than your payment amount. Pay the principal balance down and save on interest. Find people that aren't surrounded by drama and be friends with them. Help little old ladies. When you start dating a girl, meet her parents. Make a good impression. Separate your colored clothes from your white clothes when you do laundry. Take your clothes out of the dryer as soon as they're dry and hang them up and you'll never have to worry about wrinkles. If something needs to be done, get up and do it right then and there. Don't procrastinate.",
   "created_utc": 1693183507,
   "score": 10,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1696q",
   "message": "Don’t put it in crazy",
   "created_utc": 1693184549,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy12p16",
   "message": "Travel!",
   "created_utc": 1693182913,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ad2w",
   "message": "\"Get off my lawn\" - me at 40",
   "created_utc": 1693186519,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0ylop",
   "message": "Don’t waste time being the person other people think you should be, and instead be the person you want to be",
   "created_utc": 1693181044,
   "score": 7,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1242q",
   "message": "Put your phone down.",
   "created_utc": 1693182650,
   "score": 6,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy14ess",
   "message": "You aren't going to get rich as an influencer or become a professional gamer. Get educated and get a job.",
   "created_utc": 1693183695,
   "score": 7,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0z6ic",
   "message": "live in the moment.",
   "created_utc": 1693181305,
   "score": 3,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy10s5g",
   "message": "Young people, you already know what is there right thing to do. Get on with it. You don't need some older person to tell you what to do.",
   "created_utc": 1693182045,
   "score": 3,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1iwun",
   "message": "Start saving for retirement now - the sooner you start the more time compound interest has to work for you.  And if your employer has a 401-K match make sure you're putting in enough to maximize their contribution - it's free money you'll need later.",
   "created_utc": 1693190666,
   "score": 3,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0yjv7",
   "message": "Dull answers, but genuine ones:\n- put more into your pension than you are now\n- avoid debt where you can\n- don't hold grudges\n- look after your health\n- learn to enjoy the now\n- be nice to your parents. They might be dicks, but you'll probably still miss them",
   "created_utc": 1693181020,
   "score": 8,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy10uxa",
   "message": "1. Upvotes and thumbsup from social media doesn't matter. Your job title on LinkedIn doesn't matter. **Like nobody cares.** Your children won't care, your loved ones won't care, your gravestone won't say anything about it.\n2. Don't think you are the be all and end all when it comes to trends and social knowledge. 20 years from now your children will look back upon you as savages. This happens every generation. Think about context before you judge others.\n3. One person already said it, **but don't think you are so special**. The trends of parents over the past 20-30 years (saying you are perfection) isn't helping you. Work hard, live a good life -- be kind to others, admit your mistakes. (Aside: I have two kids and worked really hard to make them feel loved while simultaneously making sure they take responsibility for their actions)",
   "created_utc": 1693182080,
   "score": 3,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy12efd",
   "message": "It’s okay and healthy to sit in silence. Put down your phone, leave your earphones in your pocket, and just be. It’s important to not constantly be stimulated.",
   "created_utc": 1693182781,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1eol5",
   "message": "Sunscreen - everywhere, including the backs of your hands.",
   "created_utc": 1693188603,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0uxtq",
   "message": "Dm me 35",
   "created_utc": 1693179366,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0zwuk",
   "message": "Stay in skewl... Forever.",
   "created_utc": 1693181641,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy14rlk",
   "message": "Travel!! If in the US, get to Europe. It’s an amazing experience!",
   "created_utc": 1693183857,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy15o4y",
   "message": "Social media is cancer.  Tik tok is aids.  Be very very careful what you put online.  I'm so glad I graduated college before all my dumb moments could be put online forever.  \n\nAlso, yes it just a phase, you will grow out of it and it will embarrass you in 10 years",
   "created_utc": 1693184274,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy15uxz",
   "message": "Have as much fun as possible. Try and enjoy the now and not get lost in the hope of the future.  Figure out who you really are and learn to live with that person.  Hold on to your friends for dear life.  You make your close friends up to 30 and then spend the rest of your life doing things with them.  Yes you can make friends later in life but it isn't the same.",
   "created_utc": 1693184363,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1606g",
   "message": "Any task you need to do that will only take a minute or two to accomplish, do it now. \n\nGet in the habit of not putting things off for later. \n\nIt's a lot easier to wash the 2 or 3 dishes right after you eat, than to wash a whole sink full in 2 days.",
   "created_utc": 1693184431,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy16fzf",
   "message": "Don't worry about high school. Once you are done no gives a shit other than you getting a diploma. The drama the \"permanent record\". Anything you did or didn't accomplish mean nothing after you leave.\n\nIf you hit 40 and still talk about high school like it was the best part of your life then you peaked early. Your greatest achievements and victories should be later in life when it matters.\n\nAs always there are exceptions, but seriously if your best was as a teen, what are you doing with 60 or 70 years you still have to go?",
   "created_utc": 1693184641,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy19z94",
   "message": "Take care of your teeth. Don't break your body for any employer. Life isn't as hard as you make it when you realize you don't have to care as much about other people.",
   "created_utc": 1693186331,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1awh4",
   "message": "Your mom is the only one that thinks your attractive.../s\n\nStart a fitness routine, maintain it at all costs.",
   "created_utc": 1693186778,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1iniu",
   "message": "Cut shitty people out fast with a sharp knife. There are so many fucking people on this planet, why give second chances? Also, family are friends you didn't get to decide to bring into your life, but should be held to the same expectations as non family members. So many toxic family members saying \"but were family...\"",
   "created_utc": 1693190537,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ixod",
   "message": "Stop asking for advice from random strangers on the internet. Go interact with people who care about you IRL.  Spend time with them live and in-person without distractions like your phone, video games, etc. It's better to sit with someone in person even if you're not really saying anything.",
   "created_utc": 1693190677,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1kpw3",
   "message": "Don’t listen to us, we don’t know much more than you",
   "created_utc": 1693191580,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1mgl6",
   "message": "Believe in yourself! You're gorgeous! Don't settle!",
   "created_utc": 1693192505,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1miu7",
   "message": "I'm 56. You don't have as much time as you think you do. Don't waste it, don't waste a single f****** day. Do something everyday even if it's just something for yourself. Drink plenty of water and use sunscreen. Donating blood doesn't hurt that bad. Doing something you like for a living is more rewarding than doing something that pays even exceptionally well. I've done both and the former is preferable in my opinion. I'm rambling too much coffee😳😳",
   "created_utc": 1693192538,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy17idw",
   "message": "People at work are not your friend!  Even if they're nice to you.",
   "created_utc": 1693185148,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy17vew",
   "message": "Don't have any children.",
   "created_utc": 1693185322,
   "score": 4,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy12ogj",
   "message": "When you don’t pay for social media, YOU are the product. You are worth more than that. Drop the subscriptions and stop giving corporations content for free.",
   "created_utc": 1693182906,
   "score": 2,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0w7j8",
   "message": "Short version; \nDon’t get married before 30, don’t have kids before 35. \n\nLong version:\nDon’t be in such a rush to get married. It’s not that great. Mostly it’s work, good + bad. And it’ll be there when u get back. Go hv FUN!!!  Not very many ppl ever got older and said “I wish I got married sooner.”  Most think “I wish I had more fun, went to that concert, went on that trip with the girls/guys, had that go-nowhere fling. Enjoy life. You’re beautiful.",
   "created_utc": 1693179946,
   "score": 255,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy16c4w",
   "message": "SAVE. SAVE. SAVE. \n\nNO CAR NOTES.",
   "created_utc": 1693184589,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0wftb",
   "message": "Get over yourselves",
   "created_utc": 1693180053,
   "score": 255,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0ypqd",
   "message": "Use your 20s wisely - they are not meant for “finding yourself.”",
   "created_utc": 1693181094,
   "score": 252,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0wam4",
   "message": "[removed]",
   "created_utc": 1693179986,
   "score": 253,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy101z2",
   "message": "Don’t marry a woman who works for the Dept of defense. Or a man for that matter.",
   "created_utc": 1693181706,
   "score": 0,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ayvz",
   "message": "Most of the things you get upset about in your 20’s you won’t even remember when you are 41.",
   "created_utc": 1693186811,
   "score": 0,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1kcu1",
   "message": "Stop talking so much. Shut up",
   "created_utc": 1693191391,
   "score": 0,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1m8nj",
   "message": "It's not about the face you're fucking, but the fuck you're facing.",
   "created_utc": 1693192386,
   "score": 0,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1rm79",
   "message": "I’m not quite 40, but my advice is: get the fuck off TikTok",
   "created_utc": 1693195370,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy0udg6",
   "message": "Friends are 100% ephermeral. If one of their wives gets hot for you....do it.",
   "created_utc": 1693179110,
   "score": 246,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy11cdr",
   "message": "I’m in my mid 30s but I just want to say quit social media for a whole month to reflect on yourself and compare how you felt before with social media and after without it for a whole month. I did this when I was around my 20 I never felt more free I took being bored to going to the gym for fun.",
   "created_utc": 1693182301,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy11zda",
   "message": "Once you're out of school, don't keep the friends who bring you down, You really don't need that and the benefits no longer outweigh the drawbacks.\n\nYou know what I mean, the friends who only call when they need something, the ones who make you feel bad when you fail and worse when you succeed. The friends who encourage you to do things you actually don't want to do and discourage you from growing as a person.\n\nFocus your time and effort on your high-quality friends. It's not about quantity anymore.",
   "created_utc": 1693182590,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy12cvs",
   "message": "Be kind to your back.",
   "created_utc": 1693182762,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy138zs",
   "message": "Get your kicks ASAP because baby we blowing up at any time.",
   "created_utc": 1693183163,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy140mz",
   "message": "Learn to let things go. Forgive yourself. If all that fails, drink beer and tequila. 🤣",
   "created_utc": 1693183516,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy14bl7",
   "message": "Quick to listen slow to talk.\n\nForgiveness to be forgiven \n\nDon't say \"I know you\" i.e. \" I've got you figured out\" type of stuff to a person \n\n\nDo you really know said person? Do you know what their deepest anxieties and fears are? Do you know what motivates them? Do you know the pet peeves and the things you do to anger them? Do you know the things they truly love about you and do you express it to them?. \n\nWhen I accepted Jesus in my life, a clarity came over me being a servant to others is the best thing.\n\n\nOh,! Get a freaking retirement plan or some job with a pension because this world is scary it ain't getting any better.",
   "created_utc": 1693183655,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy150eu",
   "message": "Might makes right",
   "created_utc": 1693183970,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy15md1",
   "message": "You don't need that new something when whatever it is replacing works.  Don't be cheap on things you will use daily buy things that will last.  It's better to spend $300 on something than $100 if you end up having to replace that $100 every few years and the $300 would still be going strong.",
   "created_utc": 1693184251,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy16mke",
   "message": "Get fit and stay fit!!! If you smoke, stop that shit ASAP! Find a really great friend for a partner; not a sex toy, not a boss, not an underling, a friend.",
   "created_utc": 1693184727,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy16pqs",
   "message": "Failures are the most important things in life. It's important to see them as learning opportunities, and not events to look back at negatively.",
   "created_utc": 1693184768,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy16sfi",
   "message": "Don't trust anyone over 30",
   "created_utc": 1693184803,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1787h",
   "message": "Where to start. Finish high school. That helps set your future up if you are interested in moving forward with your education. This one is really personal for me, and people will laugh. Don't drink to excess or do drugs. Had this problem with someone close to my family and it was damaging, for years. Make good money. Yes, do what you love, but make good money doing it. That's what pays for everything. Nobody who was hungry, and had not enough money to eat ever loved what they did for a living. Don't be a burden to society. Be a positive contributor. Hold a door open for someone behind you. Smile at someone walking down the sidewalk and say good morning. Treat people, especially those that might be considered in a lower class than you, like they are you. Treat them how you would truly like to be treated. Travel. Experience different countries and continents. See how people with 1/100th what you have live. It will help you have more respect for what you have. Learn from your mistakes, don't be afraid to make them, and always, always, own up to them. Lastly, find someone who when you imagine you aren't with them, your heart hurts.  Sorry. That's all I can think of in a minute.",
   "created_utc": 1693185012,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy17br5",
   "message": "Really think about what actually makes you happy and makes life worth living for you, and spend all the time you can doing that. \n\nYou'll die one day - and you'll realize one day that you're closer to the day you're going to die than the one you were born on - and it would be a shame to reach that time and regret what you spent your time on. Time is your most precious resource.",
   "created_utc": 1693185060,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy17n6m",
   "message": "Networking is a powerful skill and can make a huge difference in the professional world. When you meet or work with people you respect, do your best to stay connected with them. Check in with them at least once a year, just to say hi and wish them well, and to update their contact information. Being well connected will have a huge impact in employment opportunities and you’ll look like a rockstar at work when a problem arises and you’re the only one to say “I know just the person for this”. Someone you know now could change your life in 10 years.",
   "created_utc": 1693185211,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy17phy",
   "message": "Start putting as much as possible into your 401k. At least enough to get the match. Aim for 10 percent. If you can't do that, step it up a little each year when you get your annual raise. But start early. I wish I had.",
   "created_utc": 1693185243,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy17zpa",
   "message": "Don't settle when marrying. You've got time.",
   "created_utc": 1693185378,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy180pj",
   "message": "The future isn't looking so hot. I hope I peace out before it gets too horrible.",
   "created_utc": 1693185391,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1861g",
   "message": "Floss",
   "created_utc": 1693185461,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy18aqo",
   "message": "Forgive yourself and try being easier on yourself. Try doing what you want to do in retirement now. Because you may never reach retirement or you might not have the health to do it then. \n\nDon’t spend anymore time in a horrible situation either personally or professionally. I’ve never met an unhappily divorced person.",
   "created_utc": 1693185523,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy18i3h",
   "message": "Get a 20 year (vs 30 year) mortgage...get roommates dor a while if you have to.",
   "created_utc": 1693185622,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy18mmk",
   "message": "Employers don't care about your mental health. No one really does except your mom. Work hard and don't make stupid decisions. Stop whining about work. It is not hard to excel.",
   "created_utc": 1693185681,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy196et",
   "message": "Live within your means, budget, save, and invest.",
   "created_utc": 1693185945,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy19h6t",
   "message": "enjoy your moments",
   "created_utc": 1693186087,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy19ief",
   "message": "The older folks don't know it all \u0026amp; shouldn't be treated like we do. Many of us lose touch with the younger generations \u0026amp; their problems \u0026amp; don't consider the mess we're leaving behind as we try to handle our problems...",
   "created_utc": 1693186103,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy19ivt",
   "message": "Start saving for retirement now. 10% of every dollar that you earn, set it aside into some type of long term investment. Be diligent about it, and protect those funds like a Mama Bear with a threatened cub.",
   "created_utc": 1693186109,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy19wi1",
   "message": "Floss and brush your teeth",
   "created_utc": 1693186294,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1avpr",
   "message": "The most important points I could give them are probably what they consider boring or inconsequential. I've struggled with overcoming that for such a long time. It's basically: focus on maximizing your income. Put as much as you can in the stock market as a long term investment. Minimize your conspicuous consumption. Make time for yourself and people close to you. There are going to be some people whom you don't appreciate until it's too late.",
   "created_utc": 1693186767,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1bcmv",
   "message": "Don’t live with regrets. Do things. Take chances. Make definitive choices. Regrets only eat away at you mentally wondering, what if?",
   "created_utc": 1693186993,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1bgto",
   "message": "Start doing yoga now!!! You will thank yourself when you are in your forties. And start learning how to cook yourself healthy meals on a budget, learn to grow food. Take care of your body, mind, and soul.",
   "created_utc": 1693187049,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1bip8",
   "message": "You know everything you hear from your \"peers\" about not making money for big corporations and don't work more than 40 hours so you can live your life?  Forget it.  Separate yourself from those layabouts and set yourself up for a lifetime of fun, wealth, and a great family life by working as hard as humanly possible in your twenties. You know nothing but don't know it yet. But you will gain invaluable knowledge about how to connect the dots every day of your life.  Best advice is to start your own business at the intersection of young enough to lose everything and smart enough to win. Failing that, make your employer as much money as humanly possible (ROI from you - either revenue, efficiencies, or savings) and they will reward you handsomely. Good luck.",
   "created_utc": 1693187075,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1bq3j",
   "message": "Get on top of large language models/AI asap. AIs aren’t going to talk everyone’s jobs but people who can use AI are.",
   "created_utc": 1693187173,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1c407",
   "message": "Live your life and do the things that bring you joy now. Your body will start to be less and less resilient, you'll get more tired, and you can't get those years back. I don't really regret anything I did in my youth; the vast majority of my regrets are things I *didn't* do.",
   "created_utc": 1693187362,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1c890",
   "message": "Brush your teeth",
   "created_utc": 1693187419,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1caen",
   "message": "Floss every day",
   "created_utc": 1693187448,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ccqc",
   "message": "Always pay your bills. Never buy something if you can’t outright pay for it. My point is, don’t mess up your credit. Having a good credit score is super important.",
   "created_utc": 1693187480,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ch4u",
   "message": "Advices are shit, watch their actions",
   "created_utc": 1693187538,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1cwtw",
   "message": "Save money , this includes savings and a 401k you’re gonna need it.\nDon’t waste money either , there’s a time to have fun and spend some $ but don’t let it get out of hand.\nTake your health seriously , don’t avoid the dr if you think something isn’t right .\nWhen you drink you don’t have to get falling down , smashed drunk every time . Everyone around you gets tired of that real fast.\nWhen you get older , stretch , your joints will thank you.\nWork , work and more work the only way you’ll get what you want and achieve you’re goals is work. The world is not gonna give you a damn thing.\nNever blindly follow a political party , they work for us , not the other way around.\nAlways make time for your family no matter what and NEVER bring home what is pissing you off at work , leave it at work.\nLastly , be nice , there’s enough assholes in the world don’t add to it , but also don’t take shit . There will be a time for sticking up for yourself and a time just ignore the assholes and keep moving on.",
   "created_utc": 1693187750,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1d0h1",
   "message": "Put the phone away!!!!",
   "created_utc": 1693187798,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1d6gj",
   "message": "After he/she leaves in the morning, do you smell his/her pillow and feel both perfectly content and sad wishing they hadn’t left? If not you’re with the wrong person.",
   "created_utc": 1693187879,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1d6rv",
   "message": "I skipped \" settling down \" in its house, married, kid, commute, payments sense. I would recommend it for some others.",
   "created_utc": 1693187883,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1dpxa",
   "message": "Don't do it. Whatever it is, don't!",
   "created_utc": 1693188139,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1drds",
   "message": "There are not only other fish in the sea, there are way better catches out there. \n\nLearn to talk to people. To have pleasant, inquisitive, sympathetic, uncomfortable, fun, silly, and serious talks with people. \n\nIt is better to have just a couple of close friends that you see once in a while than just some people you know all the time. Cherish your friends, let them know it. \n\nSpend time with family, patch up bad wounds, you may not get the chance. Life happens very fast. \n\nDon’t wait, do the thing. Just go out and do the dang thing. As you age you may not be physically able to or your responsibilities will force you to reconsider.\n\nNo one has life figured out. Not a soul.",
   "created_utc": 1693188159,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1dvf4",
   "message": "Take a good hard look at social norms that are owning your life and just know that they are simply man-made crap.",
   "created_utc": 1693188214,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ea3f",
   "message": "Save.  Save save save.  And take care of your knees.",
   "created_utc": 1693188409,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ebac",
   "message": "You are awesome! You are inclusive. You care about the environment and you are tired of taking shit from abusive employers. Form labor unions. Vote like your lives depend on it, because they do!",
   "created_utc": 1693188425,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1eblr",
   "message": "Give up",
   "created_utc": 1693188429,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ed6s",
   "message": "Never believe anything a profit seeking entity claims.",
   "created_utc": 1693188450,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1efw9",
   "message": "Go to the gym. Stop drinking.",
   "created_utc": 1693188486,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1emv3",
   "message": "If you don’t already have kids, don’t get involved with someone who does.",
   "created_utc": 1693188580,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ext7",
   "message": "Spend less than you earn, invest the difference.  \nTake care of your health.  You only get one body.  \nBe really, really careful who you marry.  \nLearn to amuse yourself.  If you don't, who will?",
   "created_utc": 1693188727,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1f0pi",
   "message": "Work on your credit. \nCredit cards are dangerous BUT if you use them smart, you can reap so many benefits. \nEstablish credit history now. It greatly impacts your credit score if you have accounts open for 5+ years. The difference will be THOUSANDS of dollars saved in interest rates. \n\nI wish I had taken the time when I was younger to learn about using credit cards responsibly and taking advantage of the benefits they offer. \n\nExample: I just booked a trip to Greece from points. All I did was spend money like I normal do (bills, shopping,etc.) but funnel it through my credit card for points.",
   "created_utc": 1693188767,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1fh2p",
   "message": "Don’t live to work. Don’t make your job your whole life.  Make time for yourself whenever you can. Take your breaks at work, never work through lunch. Don’t bring work home with you. Don’t be guilted into working a 16 hour day when the work can be done in 8. No job is worth your physical and mental health and well-being. \n\nDon’t fall into the trap that you have to “hustle,” you need to make time to relax and recharge.  An employer will never appreciate you as much as your friends and family do. Make time for them, not your boss.\n\nEdit:  After writing this out, I realize this attitude is a “luxury” for few people. I’ve finally reached the point in my mid-40’s where I can afford this luxury. But I spent years of my life hustling, working late, letting employers pile it on and my physical and mental health suffered drastically for it. In an ideal world, there would be a perfect work/life balance for all workers. But what it comes down to is, don’t let people take advantage of you. Because they’ll just take and take and take.",
   "created_utc": 1693188989,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1fv9s",
   "message": "Work and save.",
   "created_utc": 1693189180,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1gcil",
   "message": "Most people undervalue money, because it's not emotional.  People tend to talk about emotional success and growth.  But money is incredibly important to almost all of the truly emotional times in your life.\n\nThere are WAY more social sciences majors who wish they could trade careers than computer engineers.  And it's not because of how fun computers are.",
   "created_utc": 1693189410,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ghmq",
   "message": "Fight and know who your fighting",
   "created_utc": 1693189480,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1gm9n",
   "message": "Always spend less than you earn.",
   "created_utc": 1693189542,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1gmv5",
   "message": "Life is short. However it can also be long, it'll feel excruciatingly long with the wrong  decisions. Do your best to make the best ones. Don't betray people, do no harm, love people. Learn how to be empathetic. Travel. Be open minded. Listen to wise advice.",
   "created_utc": 1693189550,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1gwur",
   "message": "Don't vote for republicans",
   "created_utc": 1693189685,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hg2q",
   "message": "Be kind to your lovers. There may be many, they may be few, but you will see some of them for many, many years. The ones who think of you positively will always be a joy to think about. The ones you didn’t treat well might be a lifelong regret. So, get them a glass of water, have a spare toothbrush, offer breakfast or coffee, walk or drive them home, keep the secret, be honest, be kind.",
   "created_utc": 1693189945,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hps3",
   "message": "Hey young people, you are stronger than you even know. Things that seem super important and consequential probably are not as important as you think. Do the best you can. Go easy on yourself, life is hard and life is long. Don’t hold on to stuff too tightly. Take time to breathe fresh air, look at trees and listen to birds. Time is truly the most important thing there is. Your attention is the most valuable thing you have to give and the most valuable thing you can receive from someone else. Peace.",
   "created_utc": 1693190078,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hqv4",
   "message": "Stop being mean and hard on yourself. Whatever you did or are thinking about, no one cares. You shouldn’t either.",
   "created_utc": 1693190092,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hsex",
   "message": "GET OFF MY LAWN",
   "created_utc": 1693190113,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hy96",
   "message": "Try to save as much money as you can, really. $5, $10, $20 here or there. You have to play the long game. Never touch it and just keep adding to it as much as you can. Just saving a little bit over a long period of time can really make a difference later for you. \n\nI know how hard it is to save money and wish I had started to much earlier.",
   "created_utc": 1693190191,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hyba",
   "message": "Going to night school and getting a first, second or profession degree while you’re working looks good on almost any résumé. It also helps to avoid student loan debt.",
   "created_utc": 1693190192,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hywb",
   "message": "Life is what you make it. Life is how you deal with both good times and bad. Appreciate the good and learn from the bad. Failure is ok if you learn from it. F the naysayers and lean towards the positive.",
   "created_utc": 1693190200,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1hzgy",
   "message": "Start exercising and do it every day.",
   "created_utc": 1693190208,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1i8uu",
   "message": "Strength train. Floss.",
   "created_utc": 1693190336,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1imnl",
   "message": "Index funds and compounding interest.",
   "created_utc": 1693190526,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1iooq",
   "message": "Drink plenty of water and stretch every day.  Older you will thank you.",
   "created_utc": 1693190553,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1j3w2",
   "message": "Put as much as you can into your 401k. You might not be able to retire, but maybe you can work less when you get older.",
   "created_utc": 1693190763,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1j6s7",
   "message": "Have kids early.",
   "created_utc": 1693190803,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1jf4p",
   "message": "Ensure mustard’s culinary demise since literally practically everyone in y’all’s generation hates it so much anyways.",
   "created_utc": 1693190919,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1jwq2",
   "message": "Invest your time in relationships. No matter how much you love your job, it will never love you back.",
   "created_utc": 1693191162,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1k26o",
   "message": "Only go to college if you have exceptional academic skills or can easily afford it.",
   "created_utc": 1693191238,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1k2nv",
   "message": "Floss every single day.   And if you are dating someone, their problems are not yours.",
   "created_utc": 1693191245,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1k2us",
   "message": "to quote from Gandhi, \"Live as if you will die tomorrow, learn as if you will live forever.\"",
   "created_utc": 1693191247,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1kctl",
   "message": "Save. Trust your instincts. Don't worry, you're not too old. Wait for the right one (job, SO, whatever).",
   "created_utc": 1693191391,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1kgz4",
   "message": "Take care of your physical health!\nDental care. \nHave fun without driving under any influence. \nEngage in a buddy system’, whenever you decide to party with people outside of your bubble. \nText someone who will follow up with family, authorities if you should become missing …",
   "created_utc": 1693191450,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1klup",
   "message": "Hard drinking and smoking will make you look 60 when you are 40.",
   "created_utc": 1693191521,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1km57",
   "message": "Don't let fear hold you back.",
   "created_utc": 1693191525,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1kqw3",
   "message": "Don't save your best days for tomorrow\n\n\u0026amp;#x200B;\n\nDon't use credit cards for anything\n\n\u0026amp;#x200B;\n\nLife is too short to be miserable, you are beholden to no one (unless you have kids), if you don't like someone stop talking to them, if you don't like your location, move.\n\n\u0026amp;#x200B;\n\nand yes, we had it easier then you, sorry, I'm not in control of it",
   "created_utc": 1693191594,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1ks3q",
   "message": "Start your 401k now, do not hesitate.",
   "created_utc": 1693191611,
   "score": 1,
   "submission_id": "1635qxv"
  },
  {
   "comment_id": "jy1l0eh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1635qxv"
  }
 ]
}