{
 "submission_id": "163aavk",
 "title": "What’s something men do that comes across as creepy?",
 "selftext": "",
 "created_utc": 1693191416,
 "permalink": "/r/AskReddit/comments/163aavk/whats_something_men_do_that_comes_across_as_creepy/",
 "score": 103,
 "url": "https://www.reddit.com/r/AskReddit/comments/163aavk/whats_something_men_do_that_comes_across_as_creepy/",
 "comments": [
  {
   "comment_id": "jy1tov7",
   "message": "I’m a guy but a semi-frequent bar patron. Whenever guys ask bartenders what time they get off that they’ve had little to no interaction with is incredibly creepy. Gives off “I’ll be waiting for you in the parking lot” vibes.",
   "created_utc": 1693196606,
   "score": 62,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1udxy",
   "message": "Hey where do you work? Oh which one? Yeah there's like six of them.....which one do you work at? No I won't show up at your work lol hahaha hey..... hey.... hey.... did you block me? What did I do wrong?",
   "created_utc": 1693197035,
   "score": 84,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1kpfp",
   "message": "Sit next to you when you're the only two people in a place with many, many seats.",
   "created_utc": 1693191573,
   "score": 111,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1orxf",
   "message": "Speaking as a 5'2\" (1.57) woman, guys you barely know or even total strangers lifting you up off the ground to hug you",
   "created_utc": 1693193763,
   "score": 155,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1oyl7",
   "message": "[deleted]",
   "created_utc": 1693193864,
   "score": 249,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1kim4",
   "message": "Stand an inch away from you when you're in a line",
   "created_utc": 1693191474,
   "score": 193,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy200yn",
   "message": "When men ask, \"Where's my hug?\"",
   "created_utc": 1693200784,
   "score": 178,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1np4o",
   "message": "[deleted]",
   "created_utc": 1693193170,
   "score": 250,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1uz50",
   "message": "Not backing off when a woman indicates in any way whatsoever verbally or physically she isn’t interested, yet they continue or think they can continue to harass you or change your mind",
   "created_utc": 1693197409,
   "score": 125,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1sehz",
   "message": "Telling you to smile",
   "created_utc": 1693195830,
   "score": 234,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1o65d",
   "message": "[deleted]",
   "created_utc": 1693193431,
   "score": 34,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1lmjl",
   "message": "So casually steamroll your objections to their attentions. They'll drive you home, it's right around the corner. Nah, don't waste money on the app, he's going that way anyway! Don't worry, he's not *that* kind of guy, he's married! \n\nEtc etc etc, until you hide in the restroom and call a friend or relative to pick you up instead.",
   "created_utc": 1693192054,
   "score": 33,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1oczt",
   "message": "Ask you out while you are at work or a situation in which you cannot leave.",
   "created_utc": 1693193535,
   "score": 16,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1zuej",
   "message": "Yeah so I’m gonna be honest. I’m very insecure about being creepy. I don’t really have a great grasp of social situations because I’m autistic and I don’t interact with people I don’t know very often and I don’t know how other people are going to perceive the things I say. But these comments make me feel a lot better because it wouldn’t occur to me to do any of these things and I feel visceral disgust towards most of them which actually makes me think maybe I do actually intuitively know how not to be creepy and I just completely lack self confidence",
   "created_utc": 1693200653,
   "score": 135,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1lr01",
   "message": "Mumble something quietly under their breath while you walk by, like, \"Wow you're so beautiful.\" Jesus, if you're going to compliment a stranger could you at least not try to come across as a serial killer?",
   "created_utc": 1693192119,
   "score": 109,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2fuy7",
   "message": "I have a coworker. I had never met him (officially) before we started working at the same place 2 years ago. He gave me a weird Vibe from the get-go, but I just avoided him as much as I could, which was easy cause we dont have the same job at our facility. \n\nAfter a while he starts talking about 2 brothers that I do know, and how he was friends with 1 of them - pkay fine, a little creepy you *know* I knew them too. Then he asks when I moved from X adress where I lived with my ex? \n- I shut that Down, and Straight out said that was a creepy comment that made me uncormftable. \n\nI now avoid him even more at work, but a few months pass and he starts asking how Long I lived at Y adress, and that it was then I was hanging out with ‘specific group of people’. I told him how tf he knew about 2 past adresses and whom my friends were, Since I NEVER met him before?! \n\nOh, he and that 1 brother sometimes talk about me. I have not spoken to either of those 2 brothers for 5 years. \n\nThat shit is creepy as hell",
   "created_utc": 1693213479,
   "score": 241,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1o9i9",
   "message": "[deleted]",
   "created_utc": 1693193482,
   "score": 171,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1zswa",
   "message": "Flirting with girls in school uniforms",
   "created_utc": 1693200623,
   "score": 65,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1za0q",
   "message": "Talk to me (a male) about how much they disrespect women like i'm \"in on it\"\n\nespecially if i've never met the guy",
   "created_utc": 1693200249,
   "score": 242,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy22vla",
   "message": "Men looking at women and licking their lips. JFC.. creepy,sleazy creeps.\nEdit to add. There's a difference between just licking your lips and the sleazy creepy way some men do it.",
   "created_utc": 1693202888,
   "score": 77,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1l1qz",
   "message": "Stand outside my door for hours at a time wearing a tattered dark cloak waiting for an invitation to come inside.\n\nShit really creepy.",
   "created_utc": 1693191752,
   "score": 15,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1ot7o",
   "message": "Touch my waist to move by me. I'll drop kick you. There is no reason for it, and it makes me irate every single time.",
   "created_utc": 1693193783,
   "score": 21,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1ntvl",
   "message": "Staring too long. Glance is fine but staring too long just comes off as sus.",
   "created_utc": 1693193242,
   "score": 187,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1r1v2",
   "message": "“You were so hot in high school” an ex about a photo of me on my parents mantle.",
   "created_utc": 1693195040,
   "score": 108,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2ela8",
   "message": "Dude is no one gonna say unsolicited dick pics? Like y’all be airdropping them. I had a guy tell me that women appreciate it cause they wanna know what they’re working with. Nobody gonna work that shit if that’s your opening.",
   "created_utc": 1693212421,
   "score": 143,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1ocxg",
   "message": "Flirting with/hitting on women who are at work, commenting on our breasts/ass, making any type of comment referring to a sexual act to a woman you are not imitate with, and not taking no for an answer",
   "created_utc": 1693193534,
   "score": 142,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1kzws",
   "message": "Call women they don’t know by terms of endearment",
   "created_utc": 1693191725,
   "score": 84,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1zp3r",
   "message": "Being aggressive physically or getting aroused or staring too long at family members or underaged youth. All things have witnessed and don’t know how to respond to these creeps.",
   "created_utc": 1693200548,
   "score": 226,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1nakx",
   "message": "Park beside you in an empty parking lot",
   "created_utc": 1693192953,
   "score": 132,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1le7m",
   "message": "Stand in the doorway while they hold the door open.  \n\nNo I will not brush my ass against you just because you're holding the door open.  Gtfo my way",
   "created_utc": 1693191934,
   "score": 119,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy21ki8",
   "message": "Touch my back or waist unprompted. I've had situations where I'm taking a photo with a stranger (events, tourism, etc.) and this guy I've never met before touches the small of my back, or loops around to my hip/waist. No thank you! You can touch my shoulder or arm if you're chill about it, but the waist/small of the back is sensitive and not for casual touch. Hands off, buddy!\n\nAlso, this is less creepy than it is intimidating, but guys who talk too loud or energetically in non-loud situations. Basically guys who raise their voice or give off car-salesman energy in conversation or at a not-loud party. It sets off that inner alarm of \"is this guy going to escalate?\" even though logically it's probably going to be safe. It's like having a headache, not annoying enough to go the doctor but painful enough that it makes you tired and stressed out",
   "created_utc": 1693201902,
   "score": 29,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1tzu5",
   "message": "Jerking off in public",
   "created_utc": 1693196792,
   "score": 97,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2nx34",
   "message": "Me: \"I'm married.\" *Shows ring*\n\nRandom guy: \"I don't believe you. They all say that.\"\n\nThen it just gets creepy because no matter what you say they just don't believe anything and keep pressing you to leave with them. That hyper aggressiveness is creepy.",
   "created_utc": 1693219740,
   "score": 160,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1vjqd",
   "message": "Tell you their life story. I had one guy in a liquor store recently that decided to tell me what each of his tattoos meant. When he got to his kids he told me their life stories. I finally saw my excuse to get away and he grabbed my hand and kissed it. \n\nI saw him recently and I said hello but just walked in. I heard him calling me a bitch. I try so hard to be nice, but kissing my hand I can’t take.",
   "created_utc": 1693197773,
   "score": 61,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1qw4f",
   "message": "As a guy, here's a few I noticed about other guys:\n\n- Men hitting on much younger women\n- men who bother women at the gym\n- guys who try to give women unwanted massages (mostly shoulder rubs while they are sitting)",
   "created_utc": 1693194946,
   "score": 56,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1sa5w",
   "message": "Heres a list of creepy shit men have done in the last year to me:\n\nFollowing me around the neighborhood. This has happened several times. Sometimes they will stop and talk to me which leads to the next two points.\n\nCornering me at my car to “talk” and not letting me leave\n\nDemanding sex from me \n\nInappropriate comments in general\n\nStaring for too long\n\nTouching in any capacity l unless we are close is bonafide creep behavior. \n\nShowing up at my work to “talk”\n\n\nMen just be out here creeping on women. Its not “all men” but men tend to excuse it when their friend, brother, cousin, etc out there creeping on women",
   "created_utc": 1693195759,
   "score": 157,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1o3rq",
   "message": "\"I don't see why you're being so careful. I already would have killed you if I had intended to.\n\na buddy of a friend who I was meeting said to me because it was his first time visiting a foreign nation.",
   "created_utc": 1693193397,
   "score": 99,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2fanj",
   "message": "Personally I find it creepy when men insist that only unattractive men can be creepy. Not only do they assume that women only pay attention to hot guys and immediately write off the rest, but also that there's nothing wrong with their own behaviour that being better looking wouldn't fix.",
   "created_utc": 1693213008,
   "score": 11,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1muor",
   "message": "Stare at my boobs nonstop. I have large breasts and I’m a smaller woman so a quick stare I’m not offended by but more than 1-2 seconds gets creepy.",
   "created_utc": 1693192716,
   "score": 44,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1wxg2",
   "message": "Telling young women to smile more.",
   "created_utc": 1693198666,
   "score": 83,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy28s10",
   "message": "As my wife doesn't WFH, she has to be out in the world a lot more. I'll paraphrase what she said recently:\n\n\"What the hell's with male Uber drivers and the 'You goin' to your boyfriend's house???' It's such an obvious way to open up whether I might be DTF.\"\n\nSame goes with when she opens the door for DoorDash. She says there's always fishy types of small talk that weird her out, usually around her schedule and whether they've seen her at \\[insert shop here\\]. She doesn't like when some strange dude wants to time/place her. Questions like, \"Hey, how's your day?\" are all well and good. Friendly. But the personal stuff's gotta go.\n\nAs such, I've stopped shushing the dog when she barks at Dashers. I want them to know there's a dog that only needs the word go right behind this pretty little lady who tipped you well, sir.",
   "created_utc": 1693207572,
   "score": 238,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1maqr",
   "message": "Start a conversation with “are you married ?”",
   "created_utc": 1693192417,
   "score": 71,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1vhr6",
   "message": "One bearded dude was staring at me eating a hot dog.",
   "created_utc": 1693197736,
   "score": 41,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1t6ts",
   "message": "Try to give a stranger any type of beverage at the club. (Happened to me this weekend.)\n\nNah guy, just cause we chatted in the bathroom line doesn’t mean I’m gonna accept the weird cup of “water” you got me unsolicited.\n\nETA: a beverage that they don’t see you get, and that you could have don’t anything to.",
   "created_utc": 1693196305,
   "score": 50,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1nqw1",
   "message": "[removed]",
   "created_utc": 1693193196,
   "score": 33,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy27e5x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1rxxr",
   "message": "I don't like it when men refer to \"the wife\" like she's \"the lawn mower\" or \"the tv\" or something",
   "created_utc": 1693195561,
   "score": 118,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2fljj",
   "message": "Ignoring personal boundaries and invading personal space without consent.",
   "created_utc": 1693213260,
   "score": 129,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy208at",
   "message": "Virtue Signaling on Reddit. Self-promoting themselves when, in all likelihood, there's an incongruence between their stated values and actions IRL.",
   "created_utc": 1693200927,
   "score": 43,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1kz0l",
   "message": "Insist that they tell you more about the Horus Heresy.  \n\nIf someone says that Magnus did nothing wrong, that's a HUGE red flag.",
   "created_utc": 1693191712,
   "score": 37,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy20l1r",
   "message": "I’ve been creeped out by men mostly 40+, I can’t even go to the corner store without them all stopping and staring and I’m ugly as hell and wear sweat pants and the ugliest sweater. They do not care. I was followed once by a car walking to the library once to meet up with friends. And whenever they beep or do cat calls while walking down the sidewalk in full normal clothes. Can’t even say it’s my clothes, some old men are weird asf.",
   "created_utc": 1693201182,
   "score": 18,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy1nsf5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2nv16",
   "message": "I (31, F) was walking up the stairs at a train station carrying a large suitcase the other day. A guy wanted to help and just took my suitcase from me without asking. I had to tell him 3 times I was ok and didn’t need his help. The suitcase wasn’t particularly heavy, just big. Don’t just grab other people’s stuff without asking! I know he just wanted to help but still!",
   "created_utc": 1693219702,
   "score": 46,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2pncl",
   "message": "“For the last few years, I’ve been in the habit of walking up behind women in the office, massaging their shoulders, and whispering in their ears, ‘Daddy’s home.’ Inappropriate?”\n\n-Conan O’Brien",
   "created_utc": 1693220878,
   "score": 121,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2eej6",
   "message": "Touching my lower back when they walk past me. Strangers do this if I’m in a crowded area and it’s weird. I don’t see guys doing this to other guys. \n\nWhen they sit right next to you despite having more than plenty of options. Once I was sitting on a bench at my uni and some guy sat directly next to me. Like shoulders touching and starting very quietly while eating a sandwich. Then he started asking where I lived and when I kept trying to divert it, he kept pushing so I made up a phone call and ran away.",
   "created_utc": 1693212264,
   "score": 208,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2uaun",
   "message": "When they insult you once you reject them.",
   "created_utc": 1693223673,
   "score": 72,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2lnpg",
   "message": "Let’s see, recently a dude asked me for directions. It was already late? I told him, I don’t know then walked away. He almost followed me home, I had to stop at a store. He was quiet too, I went to grab water. The minute I turned around he was behind me.",
   "created_utc": 1693218143,
   "score": 45,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy3evzo",
   "message": "When I was 19 I was a phone girl at a local pizza place. I would answer the phone and take people’s orders for carry out or delivery. One time this guy called and said he was placing an order for delivery. By the end of the order he changed his mind and said he wanted to order carry out. \n\nThe dude shows up and my coworker helps him and he says “you’re not the girl I talked to on the phone. I want to talk to that girl.” I realize he’s talking about me and I ask what’s wrong. He then tells me he thinks I have a really soothing voice and should do ASMR. I was like ok that’s weird but relatively harmless?\n\nThe guy gets his food then leaves. We can see him sitting in his car for like 15 minutes. Then he came back in the store with a map and started asking me a bunch of weird questions for directions to somewhere. I said “why can’t you just use google maps? I see you have an iPhone” and point to his phone. Then as I point I see him try to hide the screen. He had the audio recorder pulled up! This weirdo came back in the store with a thinly veiled excuse of asking for directions because he was trying to record my voice!!! It was so creepy. I told him “wait one second” and went to the back and told some coworkers what was going on. A friend of mine who worked in the kitchen, a 6’2 muscle head walked out and was like “IM GREAT WITH DIRECTIONS. MY GIRLFRIEND IS TERRIBLE AT THEM (while gesturing to me). LET ME HELP YOU!” Suddenly the guy didn’t need directions anymore.\n\nSo yeah. I’m going to say whatever that was, that was creepy.",
   "created_utc": 1693233376,
   "score": 169,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2s6mf",
   "message": "Lingering/being flirtatious when a woman is at her job. Shes smiling because she has to, she's talking to you because she has to. Yea, maybe she's into you, but the fact there's no way to really know since she's basically forced to interact with you, it comes off creepy.",
   "created_utc": 1693222455,
   "score": 75,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2my6x",
   "message": "Continue trying to get your attention when you are not engaging with them.",
   "created_utc": 1693219067,
   "score": 151,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2rm3m",
   "message": "Telling you unsolicited stories about their sex life.",
   "created_utc": 1693222111,
   "score": 133,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2gfdz",
   "message": "Tell random women they don’t know to smile.",
   "created_utc": 1693213952,
   "score": 168,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2c8s1",
   "message": "Telling me \"I can make you straight\" then getting mad when I say \"so you're gonna rape me.\"",
   "created_utc": 1693210456,
   "score": 91,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2txcp",
   "message": "Asking if I live alone. Just find this question so creepy intrusive like can’t imagine they asked another male this question.",
   "created_utc": 1693223462,
   "score": 103,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy22h04",
   "message": "Dude here, I've always hated how men who you're unfamiliar with/have 0 connection to outside of being an acquaintance like a coworker just feel comfortable *touching* you. It takes alot to get under my skin, but when my coworker comes and does that weird, shoulder grip massage thing. Another saw me sitting, absent mindedly swinging my free arm and snuck up behind me and ran his finger down my palm, thought he was being funny. Like, who the fuck does that...",
   "created_utc": 1693202583,
   "score": 80,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2ffap",
   "message": "Spending casual time with them and then them immediately thinking you're flirting with them. Not accepting \"no\" for an answer and then proceeding to stalk afterwards not knowing what they did wrong. \n\nHappened several times, stays creepy and makes me very uncomfortable",
   "created_utc": 1693213115,
   "score": 154,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2rhin",
   "message": "Guys at coffee shops that follow and make conversation with every woman that comes in the shop.",
   "created_utc": 1693222032,
   "score": 94,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2oekb",
   "message": "Every gym locker room has that one old guy who stays naked for as long as possible.",
   "created_utc": 1693220062,
   "score": 133,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy30c2f",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy2of6c",
   "message": "Where do you live? I get asked this a lot, if I'm alone I give as vage of an address as I can but my mom usually gives them the name of our street which freaks me out, I had many talks with her but she seems to not see a problem with this, fortunately we live in a big city and our street one of the main ones so they can't actually find out the exact address",
   "created_utc": 1693220073,
   "score": 39,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy34q5t",
   "message": "I am a guy and I deliver food but I have a girls name.\n\nGuys are always waiting outside even though it's a contactless delivery and says to leave at door and sometimes they call me before I get there and try to hit on me but you're very disappointed and confused when it's a guy\n\nOne guy harassed me one time and I Kept $70 of his food And ate it myself",
   "created_utc": 1693229005,
   "score": 80,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy3h0du",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163aavk"
  },
  {
   "comment_id": "jy3qrav",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163aavk"
  }
 ]
}