{
 "submission_id": "163bzoh",
 "title": "Redditors who are from the 80's- 90's, suppose you woke up a child again and 20-33 years in the past, how will you convince your parents to make smart moves assuming you know the future?",
 "selftext": "",
 "created_utc": 1693196465,
 "permalink": "/r/AskReddit/comments/163bzoh/redditors_who_are_from_the_80s_90s_suppose_you/",
 "score": 74,
 "url": "https://www.reddit.com/r/AskReddit/comments/163bzoh/redditors_who_are_from_the_80s_90s_suppose_you/",
 "comments": [
  {
   "comment_id": "jy1vvgm",
   "message": "I am trying to convince my parents of that today and am still failing, how should I be able to convince them as a child? 😭",
   "created_utc": 1693197983,
   "score": 52,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1whpi",
   "message": "I could give them the best investment advice/all the winning sports games and they'd probably just ignore me like always.",
   "created_utc": 1693198381,
   "score": 30,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1xjpd",
   "message": "Good luck with that. Back in 1983 I tried to talk Dad into investing in the Fidelity Magellan Fund. Had been reading quite a bit about economics and tried to engage him in a conversation about the reasons.\n\nHis reaction amounted to, \"You're fifteen. What do you know?\"\n\nhttps://en.wikipedia.org/wiki/Fidelity_Magellan_Fund\n\n\u0026gt; It is perhaps the world's best-known actively managed mutual fund, known particularly for its record-setting growth under the management of Peter Lynch from 1977 to 1990.",
   "created_utc": 1693199074,
   "score": 18,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1xceh",
   "message": "33 years ago would be 1990. I'm 9 years old.\n\nI'd start being really interested in the stock market and beg my parents to get me a brokerage account or some way to buy stocks. This was before online brokerages, so I guess you'd have to find a stock broker or something? I'd save every penny of birthday money, allowance, whatever I could and invest it. Hopefully in a year or two before the start of the first dotcom bubble I'd have a few thousand to invest. I'm sure once they started seeing the returns they'd be taking me seriously.\n\nI think Netscape was the first big Internet stock to go public. Yahoo was also really big for a while. AOL. Microsoft. Get Amazon at the IPO. I'd at least be able to pay for college, then when I'm 18 I can go out on my own. Sell everything before 2000. Buy Apple when it's really cheap before Jobs comes back.",
   "created_utc": 1693198938,
   "score": 8,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1xzqy",
   "message": "I'd steer them towards couples counseling, to understand their finances a little better, and suggest that children should be encouraged rather than praised.  \n\nAlso, my Dad had several cool hobbies that I was disinterested in as a kid and adolescent, but now appreciate.",
   "created_utc": 1693199367,
   "score": 7,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1y4lj",
   "message": "Mom get a hysterectomy",
   "created_utc": 1693199457,
   "score": 4,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1xc66",
   "message": "What do you mean “from the 90s”? I’m *from* 2023. I lived in the 80s and 90s, but I didn’t time-travel here, I took the long way!",
   "created_utc": 1693198933,
   "score": 9,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy21p83",
   "message": "My mom cannot be convinced even if I showed her irrefutable evidence. Speaking of which, I just finished having an arguement with her over brown rice. She said there's a brown rice plant and a white rice plant. I told her that white rice is brown rice and brown rice is white rice. When they remove the husk and bran, brown rice ends up white without the bran.",
   "created_utc": 1693202000,
   "score": 3,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1wdsn",
   "message": "Buy apple stock. Then Amazon stock",
   "created_utc": 1693198310,
   "score": 4,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1y90n",
   "message": "Honestly id convince them to make worse moves than they’d already done. Id convince my father to fight my step father and vice versa sending both of them to jail. Id break up both my parents second marriages (debatably a smart move for all parties involved since my bio father is incredibly abusive and cheats and my step father killed himself) and get my father busted for embezzlement and theft he was doing as well as exposing his abusive behavior. \n\nMy mother i would just send to rehab again and go live with her again after she got out as at that point my father would have been shown to be a danger to his children. I wouldn’t help her much besides that though, as it would’ve just been to protect myself from further abuse and honestly dont care much for her either but lesser of two evils ig.\n\nThen in my teens i wouldve had a stable enough development to at least had a shot of going to college. I would leave and never talk to either.",
   "created_utc": 1693199542,
   "score": 2,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1zgfn",
   "message": "all things being equal, I'd just make or manipulate friends \u0026amp; family to make the right decisions. WE'D ALL BE RICH, I'd get everyone buying Pokémon cards and the right comics.",
   "created_utc": 1693200376,
   "score": 2,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy21axx",
   "message": "I'd probably tell my dad to buy the vhs player and NOT the beta player. Duh.",
   "created_utc": 1693201710,
   "score": 2,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy23u74",
   "message": "I'll force them all into therapy. I was forced to start when I was 12 and it was my starting therapy that got my parents started in couples therapy too, so I'll just push that button a little earlier. Individual therapy would have benefitted everyone in my family. I'll also discourage my mom from starting the job that ultimately led to her developing C-PTSD. It paid a lot more than her old job, but at immense expense to her health and happiness.",
   "created_utc": 1693203631,
   "score": 2,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy24eve",
   "message": "My Mom read a ton of sci fi so I could probably just tell her.",
   "created_utc": 1693204083,
   "score": 2,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy29qy8",
   "message": "My parents were so fucking stupid that even if they believed me, they would still make stupid choices. Especially my mom. \n\n\"You say we can invest in this Bitcoin in a few years? Ok, we won't do that.\"",
   "created_utc": 1693208374,
   "score": 2,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1trdw",
   "message": "Me personally I would try to get my family to invest in first gen Pokemon cards as soon as they came out - and I'd try to hop onto the Youtube golden age train as soon as possible.  \n\n\nMoney strats aside - I'd really enjoy going to Oncue to compete in gym badge competitions again - I never earned more than the first two badges before the pokemon clubs closed in my area :(",
   "created_utc": 1693196648,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy20bl1",
   "message": "People die, talk it over with your parents while you still can. Get their wishes, get pictures of what they want, get who they want certain things to go to(and get it in WRITING).  \n\nFor parents planning estates and/or trusts for their children, talk with your kids about it. When a lawyer says to pick a trustee you trust but in the meantime they will put themselves in as a placeholder, don’t let it sit like that. Lawyers are paid for their trust by you and once you are dead they have no one they are required to explain themselves too. If kids are too young to talk to about it have pages of notes and references so they will have an idea of what your plans and wishes were for.",
   "created_utc": 1693200993,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1vub6",
   "message": "I'd do them and my future family a favor and jump off a bridge",
   "created_utc": 1693197962,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1wo1j",
   "message": "i would not try.\n\nbecause i did try. \n\nborn 88. they were dumb as shit. my kid's got like the best life and my wife's living in luxury and i'm *constantly suffering from imposter syndrome and highly successful with a GED that i only got because i got busted for lying about having a GED*. 😭",
   "created_utc": 1693198494,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1wbfx",
   "message": "Bitcoin in 2012. Buy it all.",
   "created_utc": 1693198267,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1yjqc",
   "message": "I assume the question is basically \"sure you can tell your parents 'buy Apple stock' but why would they take stock tips from 7 year old you?\"\n\nI'd try to predict a future world event, but the problem with e.g. trying to predict 9/11 is that in so doing, you might alter the future.  So I'd predict that news about a past event, that was until then secret, would come out.\n\nE.g. I'd predict that it would be revealed that Prince Charles had an affair with Camilla Bowles - something that wasn't public news, but had already happened so my predicting it wouldn't prevent it (and you have to figure it would come out eventually either way).",
   "created_utc": 1693199742,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy1yt32",
   "message": "\"Get some bitcoin mom, it's free!\"",
   "created_utc": 1693199920,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy209y4",
   "message": "Oh I won't ill keep my mouth shut and leave. I'll get my self sorted and start making things work well for me. The idiots that spawned me don't deserve help and are Farr too stupid to understand",
   "created_utc": 1693200959,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy20iuu",
   "message": "As a mid 90s baby? by the age of like 2 when I could start talking? I'd just predict the whole results of the 2000 presidential election straight down to the whole Florida incident and 9/11.\n\nI can't imagine any sane person ignoring their child guessing both of those.",
   "created_utc": 1693201137,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy20p90",
   "message": "whiteboard sessions",
   "created_utc": 1693201267,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy21e01",
   "message": "Only cable news could convince them.",
   "created_utc": 1693201771,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy21fy4",
   "message": "Well in boy scouts we had something with investment or something. Could just push to having allowance pushed into companies that will make it big. Not sure I could do much more than that lol.",
   "created_utc": 1693201811,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy237t3",
   "message": "I was born in the late 70s, but I would first find those world events to give scarily accurate details about as far as a prediction.  The Challenger disaster would be a good one to get them believing me.\n\nAs for what to make different, that's a tough one.  In the mid 80's my father was diagnosed with Leukemia.  I remember getting a day off school every month, so we could drive 4.5h to see a specialist.  He died in 92 from complications.  There is a chance, that knowing what I knew actually happened to him, I could make sure he was where the best care could have been given, and knowing what would kill him, have them take certain preventative measures to stop it... maybe.\n\nThat said, I also know that it could have simply drawn out his suffering, and I also know how my mother pulled herself out of it and started a new life for herself.  Pity that her second husband died of cancer about 10 years after they were married.\n\nTL;DR - Convincing them I was legit would be the easy part.  Deciding what to change, or to let happen, even the tragic events, would be the hard part.",
   "created_utc": 1693203149,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy23j8s",
   "message": "I’d be focused on improving myself and doing chores so I could invest in Amazon. I know my mom will be alright already and I’m still a child to her at 30 years old. If I can’t get her to change her mind now, it ain’t happening 20 years ago.",
   "created_utc": 1693203394,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy24q7w",
   "message": "If I knew the future, then I'd have more important things to worry about than my parent's wealth.",
   "created_utc": 1693204334,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy24xsc",
   "message": "I wouldn't try to convince them of anything. I'd just enjoy my extra time with them and then start buying bitcoin as soon as I could.",
   "created_utc": 1693204498,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy256ha",
   "message": "if they were the same parents they were 20-33 years ago, they can fuck right off.",
   "created_utc": 1693204686,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy25952",
   "message": "Wouldn’t bother. I’ll just wait till I’m 18 and invest in stuff myself lol",
   "created_utc": 1693204745,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy25u0w",
   "message": "I don’t. I just start “predicting” shit that eventually becomes true and blow everyone’s mind.",
   "created_utc": 1693205203,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2909r",
   "message": "Invent a lot of \"why didn't I think of that\" inventions. Tell them major events before they happen like Wako Texas and Oklahoma City bombing. Now that they believe me and the money we've made from those inventions invest it all into Google and then Bitcoin.",
   "created_utc": 1693207763,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2acot",
   "message": "My mum was really superstitious. I would just have to tell her I had visions, confirm it by 'predicting' world events (Princess Diana's death, Clinton affair, 9/11 etc) and she'd listen.",
   "created_utc": 1693208884,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2b43j",
   "message": "Impossible. My parents listen to no one. Never have.",
   "created_utc": 1693209517,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2c48g",
   "message": "Way too many things to list but mainly financial smarts it would have saved their marriage",
   "created_utc": 1693210352,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2d9dm",
   "message": "“Buy as much Bitcoin as you can as soon as it hits the market”",
   "created_utc": 1693211301,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2ea0p",
   "message": "I’d probably convince my parents to get divorced. They are still together now but miserable in their marriage.",
   "created_utc": 1693212156,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2eipn",
   "message": "My dad works in politics so I can always use some information on that. My mom. Hmmm. Probably some spiritual things like fortune teller or stuff like that",
   "created_utc": 1693212362,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2ficj",
   "message": "Researching for book, OP? It's a cool concept for a story.\nI think my parents would be rather thrown off by the instant change in maturity. Like, imagine your 8yo suddenly talked and acted like a 38yo. That would be suspicious of course but probably not enough to convince them I time traveled. I think my strategy would be to predict something I couldn't have known or guessed. Then, when the thing happens they know I'm not bullshitting. Repeat the process if one instance isn't enough. And after that I'd just tell them which stocks to buy. \n\n\nAlthough if this is reseach for a book, I'd consider the implications of these moves. For example, my parents are happily married for 30+ years and are one of the few couples in their age range that I know of who are in a truly equal and happy marriage with no drama or resentment. They just enjoy each other's company and love their little flaws. They laugh all the time and have a lot of humor. \nWould their relationship have turned out this way if they had become ultra rich in their late 20s/30s? Maybe it was the time when they didn't have much money and had to make ends meet that helped them become such a good team. \n\n\nI think I'd try to meddle as little as possible and just get myself in a position where I'd be able to help during tough times.",
   "created_utc": 1693213185,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2fvja",
   "message": "I'd introduce them to the world of recycling and eco-conscious choices, making them eco-warriors ahead of their time.",
   "created_utc": 1693213492,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2gvct",
   "message": "Land. I’d convince them to buy land. And a lot of it.",
   "created_utc": 1693214322,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2gwgh",
   "message": "Convince them to invest in Apple and Amazon.",
   "created_utc": 1693214347,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2hapc",
   "message": "Am I the only one who'd be sad with the thought that by changing the past, I'll never run into my wife and lose everything that I've accomplished today",
   "created_utc": 1693214678,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2hemm",
   "message": "Even if I can not convince them. I would do everything exactly the same, except...buying bitcoin right at the beginning, I think 1000 coins would do just fine.",
   "created_utc": 1693214771,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2hhe7",
   "message": "Man I'd just give up on any mission to 'change' things and just enjoy the 80's and 90's vibe without phones and the internet. Large TV's better movies, music and playing in the street, hanging out with the neighbor kids. And I swear food tasted so much better too...",
   "created_utc": 1693214836,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2hz0k",
   "message": "I'd print out a newspaper from the future with accurate predictions of major events and leave it on the kitchen table as a \"message from destiny,\" hoping they'd be convinced by this odd method.",
   "created_utc": 1693215246,
   "score": 1,
   "submission_id": "163bzoh"
  },
  {
   "comment_id": "jy2lg8r",
   "message": "Ill tell them very specific companies they should invest in, maybe eventually theyll figure out that all my predictions make bank and theyll trust me.",
   "created_utc": 1693217992,
   "score": 1,
   "submission_id": "163bzoh"
  }
 ]
}