{
 "submission_id": "163bh05",
 "title": "(Serious) What's something your parents did that made you genuinely think they were idiots?",
 "selftext": "",
 "created_utc": 1693194861,
 "permalink": "/r/AskReddit/comments/163bh05/serious_whats_something_your_parents_did_that/",
 "score": 41,
 "url": "https://www.reddit.com/r/AskReddit/comments/163bh05/serious_whats_something_your_parents_did_that/",
 "comments": [
  {
   "comment_id": "jy1qqut",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1693194862,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1rrnz",
   "message": "my mother brainwashed me into getting with a 19 year old guy when I was 14. She ended up taking the guy as her boyfriend..she got pregnant, then got an abortion when they broke up..she was 35",
   "created_utc": 1693195460,
   "score": 153,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy21naq",
   "message": "My mother used to buy clothes for me, decide they were slutty, then yell at me for being a 10-year old whore.",
   "created_utc": 1693201960,
   "score": 134,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1sopp",
   "message": "Well, when I was a little kid, my mom stopped on the train tracks at a red light when there was a train coming so I'd say that counts.  The only thing that saved us was the light turned green but that train horn was blowin like a mf",
   "created_utc": 1693195998,
   "score": 76,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1rf1r",
   "message": "Cheat on each other. Small town, population less than 3K. Repeating this for 14 years. My mom picked me up from elementary three different times with boyfriends, wipe out my Dad's bank account, and run off with me to use as a weapon. She is still the same person 20 years on",
   "created_utc": 1693195254,
   "score": 46,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy20mb0",
   "message": "My mom places dishes in the dishwasher by height, shortest in the front, tallest in the back \"so that the water can reach them all\".\n\nI tried to explain to her that it's not a movie theater.  The tall dishes don't \"block the view\" for the short dishes.  The water comes from above and below.  No use.",
   "created_utc": 1693201207,
   "score": 76,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1rd0q",
   "message": "Pop pain killers until they were drowning in their own bowl of ice cream. Then suddenly spring awake and start eating said ice cream.",
   "created_utc": 1693195221,
   "score": 37,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1r8xi",
   "message": "Marry each other.",
   "created_utc": 1693195154,
   "score": 53,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy257tx",
   "message": "For me it’s hard to differentiate their actions as being an idiot versus simply not having the necessary education or resources to correctly do things then or now.  \n\nMy grandmother drove my mother for almost 2,000 miles across the country in her emptied out sock drawer as a 1 month old.  When asked why she did that, she said it was the only box she had and she couldn’t sit up in the seat.\n\nMy mother tithed to her church in lieu of making her mortgage payment.  I actually went to the church as an adult, spoke with the preacher and asked him to return the money.  I showed him her account.  He actually returned significantly more than I asked for back.  She had been doing this for the greater part of a year and was several payments behind.  The preacher actually sat my mom down and told her that she needed to ensure she was safe before donating to the church.",
   "created_utc": 1693204716,
   "score": 28,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1xvuy",
   "message": "My mother did an early withdrawal of her entire 401k balance to pay for unnecessary home improvements. This created a huge tax bill for her. She then got laid off and retired early. I don’t know how she is staying afloat right now. She is constantly asking me for money.",
   "created_utc": 1693199295,
   "score": 21,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy23wvo",
   "message": "Male here. I was in college. In the USA. Living with 2 other male roommates in a 3 bedroom off campus apartment. \n\nMy father is an immigrant from Europe who didn't go past 6th grade. \n\nOne day, He was furiously accusing me of being gay because I lived with other men. Him and my grandmother were convinced I was gay because of this.\n\nHe's an ignorant homophobe. \n\nI couldn't believe how stupid he was. \n\nBTW, nothing wrong with being gay or anything. I'm just not gay. Almost everyone in college lives with friends of the same gender.",
   "created_utc": 1693203687,
   "score": 39,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy22xlf",
   "message": "My mom told me rhinos were mythical creatures, like unicorns. This was in response to me asking where rhinos lived in the wild. \n\nMy father did not understand that the earth rotates on its axis and thus we have night and day. He asked how we could stop the earth from rotating.",
   "created_utc": 1693202931,
   "score": 17,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy25rja",
   "message": "My dad thinks $30k a year is a good salary and insists he was only making a little more than that when he retired a decade ago. He was making twice that.",
   "created_utc": 1693205147,
   "score": 16,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1uw4h",
   "message": "They regularly send me tiktoks with scam products and pyramid schemes, fully believing they're real. Thank god I'm not boomer-brained. Yet.",
   "created_utc": 1693197355,
   "score": 25,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy21odl",
   "message": "Their racist remarks genuinely made me think they were full of shit and clueless.",
   "created_utc": 1693201983,
   "score": 19,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy23cs3",
   "message": "Tried to convince me to sign some kind of sovereign citizen paperwork nonsense.  Also, my mother had me sectioned (Massachusetts) for being an alcoholic, which I’m not.  It’s crazy that anybody can be held involuntarily for 28 days with no evidence.  Massachusetts can fuck right off.",
   "created_utc": 1693203256,
   "score": 21,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1qvw4",
   "message": "Not being able to budget money worth a damn. This mainly applies to my mom",
   "created_utc": 1693194942,
   "score": 16,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1v1zk",
   "message": "Well, I don’t want to call them idiots but they’ve done a lot of unnecessary and expensive renovations to our family home.  I’m not even sure if they’ve even paid the damn thing off yet.",
   "created_utc": 1693197460,
   "score": 8,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1x10g",
   "message": "Well, they once tried to microwave a frozen turkey for Thanksgiving – it wasn't a \"bird\"-emic success!",
   "created_utc": 1693198731,
   "score": 8,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy226hw",
   "message": "They believed someone regarding some retirement investments. They’re intelligent people, and my jaw drops when I hear what they’ve lost money doing. \n\nEspecially when they’ve historically been so stingy in so many other ways. It baffles me sometimes.",
   "created_utc": 1693202363,
   "score": 8,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy25jhb",
   "message": "My mother want me to reconcile with my cousin who did me wrongs so bad. What my cousin did isn't some petty thing, like she wanted to sleep with my long term boyfriend, and much more. When I told my mother this she kept bringing up the fact that we are family as we should not lose one another and that my messages to my cousin were ones that were seen as harsh and standoffish. My mother did not even know the context of the messages, and would not let me speak or calm down when I was going to tell her. She also tried to justify my cousin's actions saying that interns of what my cousin has said which was talking behind my back, \"I do that with your aunties all the time. Get over it.\" I will say that there is a difference in talking shit and venting, my cousin was talking shit about me and spread rumors about me. \n\nShe also believes that since my sister is still on somewhat of good terms with my cousin, I am the one in the wrong, when my sister has explicitly stated that she is neutral and doesn't want to be apart of the drama and so it polite to my cousin. When my sister has stated this my mom has told her, \"you only know your sister's side\" which is false since my sister has heard my phone calls and other conversations with my friend group, who is involved in the situation. \n\nFunny thing is she's cut off contact with my other family members before and has not made up with them or even tried to extend an olive branch to them as far as I know, which is something that she wants me to do.",
   "created_utc": 1693204971,
   "score": 7,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1r4xk",
   "message": "They raised me.",
   "created_utc": 1693195090,
   "score": 13,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1ugqq",
   "message": "Five kids before they were 25.",
   "created_utc": 1693197085,
   "score": 9,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1xers",
   "message": "Hot water went out. Dad decided he could trouble shoot it.  Two weeks later I find them boiling water to bathe.  One phone call one hour plumber repaired.",
   "created_utc": 1693198982,
   "score": 11,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy21rmr",
   "message": "My dad told me to write down my debit card transactions.",
   "created_utc": 1693202051,
   "score": 5,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2512c",
   "message": "My parents shouldn’t have married. Even if that meant we wouldn’t be born. My mom should have focused on her career. She had the potential to be someone big. My dad should have stayed single and be the Casanova that he really wanted to be.",
   "created_utc": 1693204568,
   "score": 4,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy25zg0",
   "message": "When she told my brother he doesnt care about her while, being completly supported by him (bills, food, rent, everything)",
   "created_utc": 1693205324,
   "score": 4,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1wc87",
   "message": "She currently has a \"Trump 2024\" flag affixed to her garage door.",
   "created_utc": 1693198281,
   "score": 27,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy221jl",
   "message": "Voted for Trump.\n\nI should clarify - they are poor and voted for Trump.",
   "created_utc": 1693202259,
   "score": 18,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1s0jb",
   "message": "my mom says taxing the rich is communism *how the fuck are you in as high a position as you aaaare*\n\nbut usually its stuff that is just false information they believe in/prejudices that they should just let go of already",
   "created_utc": 1693195602,
   "score": 12,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1umir",
   "message": "Code to get R tv was 0000",
   "created_utc": 1693197186,
   "score": 8,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1wvdx",
   "message": "Fought all the time.",
   "created_utc": 1693198628,
   "score": 4,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1zx5b",
   "message": "They did \"natural contraception\"",
   "created_utc": 1693200708,
   "score": 5,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1u83n",
   "message": "Told me not to lift anything heavier than a birthday cake when I was pregnant. So I guess prenant women don't ever pick up their other babies/toddlers?",
   "created_utc": 1693196935,
   "score": 7,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy22k87",
   "message": "My parents are idiots because of the circumstances of their divorce. The short version is that Dad has two daughters from previous relationships. One he was there for (#1)and one who his signed the rights over to her adoptive father. Well after about 25 years, she reached out to inquire about family health history, because she was having kids. He gave her the answers she wanted but didn't communicate further. Mom tried to contact her to try to bring her into the family, Dad said it's none of Mom's business since sister #2 already has a huge family and a good father. So mom seeks a divorce, they sell the house during the recession for half of its value from a few years earlier (and later).\n\nDad never forgave Mom for that. He had put the money he pulled from his 401K into the house and now he had neither. So he struggled to get by for years until he moved to Florida and lived with some of his Vietnam buddies and remarried. \n\nMom was always hoping they'd get back together and was heartbroken when he remarried. Also, she reached out to my half-sister and was rebuffed, so great execution there. Whole thing is so stupid. Only upside is that sister #1 and I were able to form a good bond with sister #2 and her family.",
   "created_utc": 1693202650,
   "score": 3,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy268ki",
   "message": "My wife's parents: Simple folk from a small town in Central America. They refuse to carry or use their debit card which leads to a mountain of inconveniences for everyone. They prefer to stash thousands of dollars collected from work in their closet and deposit it twice a year by taking it directly to the bank teller (also refuse to use an ATM). They refuse to learn to pay anything online or even via snail mail. So, their bills are paid in person, they take an hour long bus ride to drop off the rent money, and they constantly have me paying stuff for them preferring to pay me back with cash at a later date. They save money like you wouldn't believe! Despite working poorly paid hard labor they live a spartan life which has allowed them to save almost 200k! And yet, they've done nothing with that money. NOTHING! They have been living in the same small apartment sine the late 70s which is still furnished with items from the early 80s. They don't eat out, they don't buy luxuries, they don't have hobbies, they don't even seem to have goals for themselves. They simply exist.",
   "created_utc": 1693205521,
   "score": 3,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1ybkd",
   "message": "Voted for Trump.",
   "created_utc": 1693199587,
   "score": 11,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1r949",
   "message": "I don’t know if at the time I thought they were idiots, but I remember them and our aunts/uncles all getting shitfaced at family parties. Everyone would just stay so no one was driving, but I remember thinking if something happened we (me and the cousins) would be screwed.",
   "created_utc": 1693195157,
   "score": 4,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1rlm8",
   "message": "Love my dad, but omg he is the worst at planning, and also terrible about communicating things to the entire family.\n\nWhenever he asks for me to come over to help with something, he explains what needs to be done and it's quite detailed. So I show up expecting it to be an hour or so, only to realize that he hasn't made any plans on the task at hand, and it ends up being a whole-day ordeal.\n\nAlso man this one time he realllly dropped the ball. My grandma had passed some time ago, and so before the estate sale my dad had communicated to everyone that we can swing by to pick out stuff we wanted to take, and to help get everything out to the garage... however he texted that 30 minutes before he wanted people to be there... and forgot to even mention to my sister that she could pick out stuff of my grandma's to keep... until after everybody else had already picked out stuff they wanted. He had to do some serious apologizing for that one. Luckily everybody on that side of the family is cool, and let my sister go through stuff that they had already picked out.",
   "created_utc": 1693195361,
   "score": 4,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy20e01",
   "message": "When we got our dog they decided to have it settled in the yard because they were concerned about the puppy peeing in the house. One night a coyote came and nearly killed my puppy but to the grace of god she managed to break free from her outside leash and made her way to the door and my mother got her inside. This is one of many instances of horrible decision making but this incident would have been unforgivable if my puppy didn’t break free in time of that coyote attack.",
   "created_utc": 1693201040,
   "score": 2,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy22eh7",
   "message": "Raised my siblings and I as Mormons.",
   "created_utc": 1693202530,
   "score": 2,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy25890",
   "message": "My parents always turn off the TV completely, because they once read 20 years ago a TV on stand-by cause a fire. This was so strong that when I once put their TV on stand-by they treated it as I tried to kill them.",
   "created_utc": 1693204726,
   "score": 2,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2c6eb",
   "message": "A lot of comments disrespecting their parents I see",
   "created_utc": 1693210403,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1rbns",
   "message": "Gave my addict sister money",
   "created_utc": 1693195199,
   "score": 2,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1vsf3",
   "message": "I gave up the day my dad called me because he couldn’t find the volume button on the tv remote. \n\nIt’s one of the roku remotes with the volume on the side",
   "created_utc": 1693197928,
   "score": 251,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1rwoa",
   "message": "They didn’t abort me",
   "created_utc": 1693195541,
   "score": 251,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1wziq",
   "message": "dad kept all money in savings accounts and never invested in anything. Not even real estate! he had good sources of income but was too afraid to take risks. I even begged him to give me 100k to buy bitcoins and Tesla stock in 2018 but he refused. \n\nMom has always been too religious and never uses her rational thinking. She repeatedly gets duped of money, time and emotions believing in sky daddy’s people!!",
   "created_utc": 1693198704,
   "score": 243,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1wi69",
   "message": "Never invest money. Saving money was their jam.",
   "created_utc": 1693198389,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy1yxvg",
   "message": "Work a second job for ego (not money) and then complain she's too stressed to help my autistic self.",
   "created_utc": 1693200011,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy20czm",
   "message": "Had us kids",
   "created_utc": 1693201020,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy22ds6",
   "message": "They married each other.",
   "created_utc": 1693202515,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy22wt6",
   "message": "Fuck and procreate 😞😞",
   "created_utc": 1693202914,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy230lg",
   "message": "bought a time share",
   "created_utc": 1693202995,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy23jgd",
   "message": "Put up with me",
   "created_utc": 1693203399,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy25rs3",
   "message": "When they think they're smarter than us in everything",
   "created_utc": 1693205153,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy25t1f",
   "message": "Thought the moon was a star",
   "created_utc": 1693205181,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy264y6",
   "message": "Having a second kid.",
   "created_utc": 1693205442,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy26hrh",
   "message": "Stating that going to college was a waste because no one wanted to hire me anymore when I graduated on account of being too old. Also, they believed that if I found a job, I would never make as much as my cousin, who dropped out of school at 17, because he would have several years more of salary increases.\n\nI bought my first house at 31.",
   "created_utc": 1693205727,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy26w5k",
   "message": "My parents are Catholic. I play the pipe organ. My exposure and love for the instrument is related to their religion. Also, they’re immigrants to where I live, so finding an organist who knows that specific liturgy is easier said than done. Mostly, you get ambitious pianists. Having an actual organist in your midst is like finding a diamond in the rough. \n\nSo here I am, an organist at this church, and a fixture in the choir (accompanist and assistant musical director). \n\nThe priest pops in mid rehearsal, and on our break, he laments the lack of volunteers to act as disciples for Holy Thursday. The choir voluntold me. I went full Peter and denied it 3 times (as someone who is not Catholic, just there for the music). Eventually I capitulated. My parents were pleased. \n\nBut once the mass happened, that meant I took communion, and a priest washed my foot. Normal stuff, right? After the whole event, my mother was horrified. She asked me when I was last at confession. I told her it had been well over a decade, and she acted like I had murdered someone. She literally acted like I committed some awful crime for eating a stupid cracker and drinking some crap wine. But show them evidence about a specific priest committing a specific crime, and suddenly things aren’t what they seem.",
   "created_utc": 1693206045,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy27i0q",
   "message": "My parents always tell me to vote. And when they do they tell me to pick just one side. It makes me sick.",
   "created_utc": 1693206532,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy27rd4",
   "message": "Be Methodist",
   "created_utc": 1693206739,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy286aa",
   "message": "Smoke, drink and gamble profusely....yet not afford food",
   "created_utc": 1693207074,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2886a",
   "message": "Hit me with a ping pong paddle because thats how they were raised",
   "created_utc": 1693207117,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy28b16",
   "message": "TW: SA  \n\n\n\u0026gt;!Let my younger siblings, (ages 6-12) Stay the night at my rapist's house because they are friends with his kids/cousins. I was 10 years of age when he assulted me. !\u0026lt;",
   "created_utc": 1693207183,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy28del",
   "message": "my mom believes in everything she reads in some random books. Heres a small selection:\n\n\\-believes that electromagnetic rays are damaging (for example blamed bad sleep on a few power cables and switches off braker for her bedroom every night)\n\n\\-cancer is a choiche and you get cancer if you want to die\n\n\\-Wifi is cancerous (reason i wasnt able to acess the internet at home until about 2020)\n\n\\-believes in healing cristals\n\n\\-this list could go on for ages...",
   "created_utc": 1693207235,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy28saa",
   "message": "My parents just don't listen or bother to learn anything. They're 60-70 years old now and struggle with everything because they don't want to learn",
   "created_utc": 1693207578,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy297l6",
   "message": "Small one but not seasoning meat when cooking meat. All meat when cooking should be seasoned. I grew up not liking steak very much because my father would never season anything and would over cook it. During Covid I found guga foods on YouTube and saw all the yummy stakes he was making and I taught myself how to cook and season a good steak and I’ve been hooked ever since. Now I think back and think why the fuck didn’t they season the meat 🤣",
   "created_utc": 1693207934,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy297nt",
   "message": "They had me",
   "created_utc": 1693207935,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy29eub",
   "message": "Made we wait until I was 13 to watch PG-13 movies",
   "created_utc": 1693208100,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy29fsg",
   "message": "My mom defended Elon Musk.\n\nIm sure thats enough for some of you, but I encourage you to keep reading cause this gets funny\n\nA news story popped up about how Elon fired an employee cause they dare suggested that maybe people dont like his tweets.  I had recently talked to my mom a bit about the dumb stuff Musk had done and she flat-out ignored me, so here ya go.  I send her the news story, and she replies back with a completely unrelated tik tok *from a year ago* of an unrelated court case.  I ask \"why did you send this?\"  and she replies with, and I quote \"This is why your guy was fired. *duh*.\"\n\nSo I called her out that she very clearly didnt even read the news article I sent.  The thing she found wasnt even remotely related to a news story that happened that month.  She doesnt admit to it, but she tries to smack back like \"you think you could run twitter better?' which I just shot down.\n\nNow the best part about this is, she doesnt reply to me after that.  However, **She contacts my dad** and basically says \"Brent was being mean to me.\"  She admits to my dad that she didnt even read the article, and MY DAD calls her out for being an idiot.  It was so freaking funny",
   "created_utc": 1693208122,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy29h8d",
   "message": "It's one specific thing. It's just a cilimation of who they are as people. Stupid for different reasons but stupid none the less.\n\n\nI love them but sometimes I think the only thing between me and a death as a child was purely a matter of luck that I didn't end up in a life threatening situation until I was adult.",
   "created_utc": 1693208154,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy29kxv",
   "message": "I work for the government. Meaning I know a lot more than they do. I told them that they should go here and there to get my passport issues figured out but no they decided to get a lawyer. A few month later they did exactly what u told them to do a while back \u0026amp; THEY ARE STILL DOING IT WRONG",
   "created_utc": 1693208239,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy29nh9",
   "message": "Having children",
   "created_utc": 1693208295,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy29oqj",
   "message": "Lol, so many things. But the largest is bankruptcy by investing all their profits into a shady factory in another country.\nFrom rich to highly in debt and poor forever.",
   "created_utc": 1693208323,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy29usj",
   "message": "Man too many to count\n\nI’m so concerned I’m going to be one of these people after working in a hot warehouse for years just losing brain cells I just know I am",
   "created_utc": 1693208465,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2a2by",
   "message": "My dad sent me a text saying \"I'm disowning you. You never bring your baby round to see me\" trying to manipulate... I had been at his house 6 times in 3 months... I had a baby and a 2 year old anyone who has been through this stage of life can agree you can't just up and go out with 2 littlens there's a lot involved and after work no chance and weekends were rammed.\nBtw in the 7 years of owning my house he had visited me 5 times. \nSo yeh he just split with my mum and bought a caravan is crusing round the UK... Never gna see my kids again because his manipulation control tactics won't work anymore my kids come 1st.",
   "created_utc": 1693208643,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2a2h2",
   "message": "My mum is one of those people that thinks if she acts dumb enough other people will do it for her.",
   "created_utc": 1693208646,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2a2nz",
   "message": "My Parents were married and divorced three times....... Wait for it...... To each other",
   "created_utc": 1693208650,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2a3z9",
   "message": "Hiring PIs to follow me. I’m an introvert and a blacksmith, and the ‘private investigators’ they hired were idiots. I have to keep a huge fucking Medkit in my forge because the absolute fuckknuckles keep burning themselves. When I get off work I do not have the fucking patience to sit around bandaging some stupid cunt because they decided to try to grab the hot steel when I go inside for a drink. I cut contact for a reason and yet they violate the restraining order easily once a week because they’re worried I’ve joined the yakuza. I’m Australian, if there was a fucking yakuza here he better be paying me well for something he wants me to make, or he can fuck off. And the dumbasses in hats and gloves trying to follow me around and report back to my fucking insane mother. Excuse my language I just had one burn right through the bottom of his shoe and start screaming like a child because he stepped on a burning coal. Had to patch him up while he was screaming bloody murder, finally got the shoe off and it hadn’t even gotten through his sock. What a way to finish the day. Fucking hell. I told him if another one of my mothers dipshits comes after me I’ll give documents of every single time to the courts and she can spend the rest of her days worrying about me from a tiny concrete room.",
   "created_utc": 1693208681,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2aaqr",
   "message": "My dad has pretty severe diabetes. While in the waiting room at the doctor's, he reaches out and take a piece of candy from the complementary bowl.\n\nHe got to that point because he started eating large quantities of cheap candy as a way to quit smoking. I would literally see him buying a kilogram of those green minty things once every couple of days.",
   "created_utc": 1693208838,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2ad3b",
   "message": "My parents used to tell all my family friends when I was in high school that I had a lot of potential to become successful",
   "created_utc": 1693208893,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2af9j",
   "message": "My parents just bought a plot of land as an \"investment\". My dad is already overworked with his job as well as taking care of everything around our existing house. Now he has a plot of land, 2 hours away, that cant be built on, has very shitty road access and needs a ton of maintenence on top of what he already does. Its a horrible investment as well, since it was on the market for years before they bought it, so its not like they will be able to quickly sell it if they need the cash. It just makes zero fucking sense.",
   "created_utc": 1693208943,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2agpm",
   "message": "Stay married for 25 years when they obviously hated each other with a vengeance.",
   "created_utc": 1693208977,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2aipa",
   "message": "Didn't make me learn the language of the country we live in (post Soviet one) because they didn't like it... And just didn't make any effort to give a good education or at least try to develop useful skills.",
   "created_utc": 1693209024,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2aqp8",
   "message": "Have me. \n\nThey were low-income, having a bunch of fun partying and had fairly simple jobs that covered their very low living expenses. And they were still young. They seemed to really be enjoying life from what I can surmise.\n\nBut they came from really traditionalist families (like ones that freaked out when finding out my parents were living together before marriage) so I think there was pressure to have a child. I think my dad wanted to, but I think my mom wasn't as on-board. But...deed was done.\n\nI bet they would have been happier just enjoying the simple life they had. Both had full familial and friend groups. Adding a kid to the mix was a big disruptor.",
   "created_utc": 1693209206,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2awwz",
   "message": "They both voted for Brexit despite being in poverty.",
   "created_utc": 1693209350,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2b03t",
   "message": "They had me.",
   "created_utc": 1693209424,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2b5sp",
   "message": "They say that Jimmy Saville couldn't have done the things he did because my mum met him once and he was such a nice man.\n\nAnd before anyone says he was nice because he fancied her, no. She was over 18 so not in his preferred age range.",
   "created_utc": 1693209557,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2b7wg",
   "message": "my dad is a creationist",
   "created_utc": 1693209605,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2bbx2",
   "message": "\"Why didn't you give me the hpv and meningitis vaccines? Im older than 15 so now it's less effective and also we have to pay\"\n\n\n\"Don't talk with that tone, we had our reasons\"\n\n\n\nThen never gave a reason just serious stern looks (imo my dad was serious bc he was embarrassed about being fucking stupid not giving me a free vaccine) and my mom when told the dangers of HPV and meningitis by a nurse got extremely fucking worried as if it wasn't her decision that created this problem. Also no they are not antivaxx, these are literally the only two vaccines I didn't get",
   "created_utc": 1693209698,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2bg54",
   "message": "Never be around, become a junkie then claim \"I never raised you that way\"",
   "created_utc": 1693209795,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2bj7t",
   "message": "Not parents, sorry theyve been dead, but my uncle, \n\nHe streams, whatever he brings in extra money, can't complain, \n\nGets bored\nAsks if lawnmower tires are aired up\nBrain thinks why is he even asking\nHe wanta to mow the grass. \nIt's 2 am. On a Sunday. And everyone needs to get up for work and school. \nHis excuse \"who cares it's the weekend\" \n\nLike do I just have anger problems or is he slow?",
   "created_utc": 1693209867,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2bulc",
   "message": "Took my kids to a retail park and told them to go play while she stands in a queue at boots, they walked around the retail park alone 11 year old, 10 year old and a 3 year old.. or am i just being overdramatic?",
   "created_utc": 1693210129,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2bv00",
   "message": "My father invested in a business for me. The business looked great on the outside and but was hell broken from within. He didn’t do any serious due diligence. I ended up taking care of the business for next 8 years. Basically derailing my professional career. In the hindsight I had an experience of managing a debt ridden difficult business. But at my prime (23) till date (31) I still struggle to keep things afloat. I have to work another business to make sure everything keeps flowing. \n\nNot doing that impulsive investment would have kept me away from debt and other struggles. Only plus I got an experience.",
   "created_utc": 1693210138,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2ca96",
   "message": "They joined a cult",
   "created_utc": 1693210491,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2cmjx",
   "message": "Not my parents but my uncle.\n\nCouple of years back when I was still a little gremlin, most of my immediate family were at my grandparents house for Christmas. My uncle (at the time) was notoriously abusive to my aunt but only ever abused her behind closed doors.\n\nSince my brain was still a slice of meatloaf then (8months maybe 1yo) I don’t remember anything but what my family members relayed.\n\nIm told the party was nice and fun with a metric fuckton of cake and ice cream. Presents and candy for all, and all had a smile. Except my aunt \n\nApparently my aunt tried to tell him they needed to leave to feed their pets or something. Whereupon he proceeded to back hand her to the ground and scream at her. Naturally, it didn’t go over well with the rest of the (mostly Christian) family. All 7 of my uncles and my dad dragged him outside and told him to leave by himself. When he refused, looking like he was ready to fight. My former cement worker/semi-truck driver/preacher/dude who survived being stabbed/teddy bear of a father proceeded to say these words verbatim.\n\n“(Uncles name) you have one chance to knock me out before I clean you clock” \n\nI’m told there was a long pause of silence before my uncle just left without a word.\n\nNowadays, my uncle is also a devout Christian as well as recovering substance abuser who is nice and respectful to my aunt. he still slips up once in a while but he came a long way from what he once was.\n\nTL:DR wife abusing uncle gets threatened by a teddy bear and leaves the Christmas gathering.",
   "created_utc": 1693210772,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2cu6q",
   "message": "They never gave me water as a baby / child, I had to learn to drink water as an adult, and still don't really like it.",
   "created_utc": 1693210944,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2cx5o",
   "message": "My mom told me her flight home from a wedding she went to was amazing.\n\n“We were above the stars.”\n\nI was like yea, at night, the city lights probably look like stars, right? She said no, that they were literally above the stars, looking down on them, she could see them.\n\nI then realized that she didn’t know what a star actually was. At all. No concept of what it means.",
   "created_utc": 1693211013,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2cypj",
   "message": "My mom went to the hospital and gave birth to me while my dad was out drinking with his friends.  She gave me my first name but wanted my dad to contribute to the naming process, so he got to pick my middle name.  When he finally showed up, he was hammered. He chose a middle name that rhymes with my first name because he thought it would be “cute.”  My mother did not challenge him on this.",
   "created_utc": 1693211049,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2d43p",
   "message": "being in serious debt, yet further spending huge sums of money on (unnecessary) adaptations, new furniture, new tv set etc...",
   "created_utc": 1693211178,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2datt",
   "message": "My mother never tried a bell pepper until a couple of of years ago, she's 66",
   "created_utc": 1693211335,
   "score": 1,
   "submission_id": "163bh05"
  },
  {
   "comment_id": "jy2do4p",
   "message": "Ate canned asparagus when fresh was available and cheaper. Yuck.",
   "created_utc": 1693211648,
   "score": 1,
   "submission_id": "163bh05"
  }
 ]
}