{
 "submission_id": "163cxgz",
 "title": "What’s the longest you’ve gone without sex since you became sexually active? What caused this and was it voluntary?",
 "selftext": "",
 "created_utc": 1693199462,
 "permalink": "/r/AskReddit/comments/163cxgz/whats_the_longest_youve_gone_without_sex_since/",
 "score": 19,
 "url": "https://www.reddit.com/r/AskReddit/comments/163cxgz/whats_the_longest_youve_gone_without_sex_since/",
 "comments": [
  {
   "comment_id": "jy20jht",
   "message": "6 years. It was voluntary. I just don’t know how to date or do casual sex.",
   "created_utc": 1693201150,
   "score": 182,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy20xl8",
   "message": "1 year, living with parents again and confidence is at an all time low at the moment",
   "created_utc": 1693201436,
   "score": 166,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy20hxm",
   "message": "20 years, marriage, no.",
   "created_utc": 1693201118,
   "score": 232,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2da76",
   "message": "Entering the 3rd year…ex gave me two STI’s after cheating with a girl nearly half my age. We were married 18 years and it was my only relationship.\nI just can’t be bothered anymore 🫡",
   "created_utc": 1693211319,
   "score": 243,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy1zgj0",
   "message": "5 years. I just wanted to be alone.",
   "created_utc": 1693200378,
   "score": 150,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy27gnv",
   "message": "My wife was ill with cancer for about 5 years before she passed away. We didn't have sex during that time.",
   "created_utc": 1693206502,
   "score": 157,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy28o9n",
   "message": "5 years, last person I dated was horrible experience and I haven’t dated since. I’m mostly okay with it.",
   "created_utc": 1693207485,
   "score": 72,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy1zkmc",
   "message": "About a year. First when my wife was pregnant sexual intercourse was painful for her. Then she worked out of state while I was a STAHP. And now we’re about 50 and our libido has weakened. Fortunately sex was never a very important part of our relationship. It was something we enjoyed but not a priority. Cuddling is much more important for us.",
   "created_utc": 1693200459,
   "score": 147,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2atdr",
   "message": "4ish years\n\nI was single, don't care for dating and honestly don't care about sex enough to just have random hookups. Going on 3 years again currently and same thing. Dating apps aren't for me and trusting random men enough to sleep with them is absolutely not happening",
   "created_utc": 1693209268,
   "score": 33,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy23rva",
   "message": "I’m embarrassed but, it’s been ongoing about 5 \u0026amp; a half ish years now. It really shouldn’t matter but I beat myself up for it. The cause? I stopped casually dating \u0026amp; hooking up. I was in a really bad place and I was getting with practically anything that walked. I was active sometimes 4 times a week with different people. \n\nHow I never contracted anything is beyond me. But I just so desperately wanted to be wanted even if it meant laying with someone I half knew for a half hour. Gross I know. Not the act, but the principle of my situation at least. \n\nVoluntary? At first no. After I had kinda situated myself out of constant hookups, I sorta sat in my mental state. I knew if I wanted to, all I had to do was go through my phone and just pick someone to message, and if they were busy I had the backup. But it started to make me feel so gross, that I just decided not to have sex until someone actually wanted me for me and not just to get off. \n\nI sorta had this epiphany *that should be obvious, and unfortunately it’s not* that while it felt good, I didn’t feel good. I was essentially allowing myself to be used and training myself to be okay with it, because I wanted the counterpart to be okay. \n\nThat’s just my own personal situation, but if you have a body, you do whatever you think is best for *your* body. \u0026lt;3",
   "created_utc": 1693203583,
   "score": 187,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy1zrc4",
   "message": "6 years. First 4 years were voluntary (taking a break while I sorted my psych disorders), next 2 were due to social incompetence.",
   "created_utc": 1693200593,
   "score": 76,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy1y8k4",
   "message": "Fuck long distance relationship lol I love her n all but fuckkk. That should be enough answer of itself",
   "created_utc": 1693199533,
   "score": 109,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2qq5i",
   "message": "I love how you can tel the ages of the people answering. \n\n25 and under: “it’s been 2 months and I’m losing my mind.”\n\n30s ish: “it’s been a while but we have kids so we never have time”\n\n45 and over: “it’s been 10 years and I’m ok with that. I value peace and quiet more”",
   "created_utc": 1693221563,
   "score": 19,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy25pce",
   "message": "14 years. Fiance passed away. It was not voluntary. I could've just jumped into bed with another woman. But Zaelia set a very high standard. Haven't found a woman that matches her.",
   "created_utc": 1693205100,
   "score": 41,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy242q9",
   "message": "3.5 years. I was depressed.",
   "created_utc": 1693203815,
   "score": 18,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2am3b",
   "message": "4 months, when I moved to the middle of nowhere as part of my apprenticeship.\n\nOn my first night there, I went to a local bar and got to know the bartender.  She said this to me: \"Best advice I can give you about living here is do not sleep with anyone.  This town is too small, and there's too much fragile masculinity.  Chances are someone is gonna try to fight you if you don't take my advice on this.  Also, don't go to \\[3 other bars in the town\\], ever.\"\n\nSuffice it to say I took her advice, and I did not get my ass kicked.",
   "created_utc": 1693209100,
   "score": 30,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy21qws",
   "message": "I got cheated on in my mid 20s for the first time. It crushed my confidence. I didn’t even try to hook up with women for months. I think 9 months to be precise",
   "created_utc": 1693202035,
   "score": 39,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy24re1",
   "message": "2 years, after a sexual assault",
   "created_utc": 1693204360,
   "score": 55,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2b0ee",
   "message": "Its not like you have sex once and then unlock an infinite amount of coochie, constantly eger to please you wherever you go.\n\nI have 5 ex girlfriends and those relationships where very inconsistant and unpredictable.\n\nI haven't  had sex in about 5 or 6 years now.\n\nIt's not that special.\nIts not that much different.\n\nIts just better masturbating with the perk of company.\nSometimes very good company, sometimes psychological torture.",
   "created_utc": 1693209431,
   "score": 52,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2my9z",
   "message": "Had sex exactly one time, at the time it happened, I was with my girlfriend for 3 years, she was sexually assaulted as a young teen, so intimacy was hard, tho she loved having me close to her.\n\nWe finally did it, right when she was about to go back home, she went on a holiday to France with her parents (she lived right across the border and was visiting family), I live in Berlin and we met at a university campus (I was aiming to become a physics student at the time, she was studying Germanistik in some program that had her go from Saarbrücken to Berlin in a 3 month rythm).\n\nOn her way back home from France, she and her dad (who I had met via video chat a bunch of times at that point) were hit by a sleepy truck driver, she died, her father was trapped inside the car with his only daughter next to him and killed himself once he left the hospital.\n\n\nFucked me up so much, that I completely collapsed in school (I already had problems with attendance, but my grades were great, mostly because I was bullied in school) and hadn't had a stable, functioning relationship ever since.\n\nEdit: Forgot to say, this happened 10 years ago. But I am on the up and up!",
   "created_utc": 1693219069,
   "score": 20,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2ank6",
   "message": "4 years. Completely voluntary. I was super hung up on my ex and was scared to have sex with anyone who wasn’t him.",
   "created_utc": 1693209133,
   "score": 9,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy21fhx",
   "message": "6 years, from 19-25. Had two kids already and am a high school dropout, was not gonna risk a third from a third dad.",
   "created_utc": 1693201802,
   "score": 29,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2bpcr",
   "message": "I am almost 40 and never had sex ever. I am ace with zero libido. I dont want to have sex. I dont feel the urge to have sex. I am totally fine with never having sex ever.",
   "created_utc": 1693210008,
   "score": 28,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2dm9y",
   "message": "4 years with no PIV in a relationship. At some points we tried to bring the spark back but it didn't work out, so we abandonded before reaching PIV. So, I think I had a couple of handjobs during that period. Then we separated. 2 years later, still nothing.\n\nSo, I'm on a 6-year record and still counting.",
   "created_utc": 1693211603,
   "score": 8,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2lda4",
   "message": "10 yrs, it's alotta work tbh, yea I quit the sex",
   "created_utc": 1693217933,
   "score": 7,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2e0at",
   "message": "I'm lucky if I have sex once every three years. Not voluntary, but I lack social skills, no one is willing to give me a chance, and life today is hell for introverts.",
   "created_utc": 1693211927,
   "score": 46,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2a2s0",
   "message": "Years. Just didn’t really care about sex in my 20s. Between my first experience being sexual assault, to having two kids before I was 25…..really had no interest. \n\nI’m 39 now and it’s been maybe a month an im about to climb walls 😐",
   "created_utc": 1693208653,
   "score": 13,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy25gcb",
   "message": "9m. Post-pregnancy hormones are awful, as is post-partum depression.",
   "created_utc": 1693204903,
   "score": 7,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy224kx",
   "message": "Going on two years now, and it's because of sexual trauma",
   "created_utc": 1693202324,
   "score": 11,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2gumh",
   "message": "\"What is wrong with these people? They have no willpower. I once went 28 years without having sex. And then again for seven years\"",
   "created_utc": 1693214305,
   "score": 12,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy258mp",
   "message": "Last time was with my ex in 2015. \n\n\nI don't care for one night stands and dating fucking sucks so that's probably it for me then.",
   "created_utc": 1693204734,
   "score": 6,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy26lez",
   "message": "I lost my virginity to this one guy and broke up with him 9 months later. That was a year ago and i haven’t gotten any action like that since",
   "created_utc": 1693205808,
   "score": 5,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2aqpf",
   "message": "Most single men here arn't willingly choosing to not get laid, unfortunately.",
   "created_utc": 1693209206,
   "score": 14,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy22lxj",
   "message": "A year and a half now, im going with because I’m not good looking at all",
   "created_utc": 1693202685,
   "score": 9,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2b5gm",
   "message": "Just something over 11 yrs now, since my last breakup. Haven´t dated since so it is my own \"fault\" not having any",
   "created_utc": 1693209549,
   "score": 4,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2ladi",
   "message": "6 months while I was still married. Mind you it was the 6 months before we divorced so that tells you something.",
   "created_utc": 1693217873,
   "score": 6,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2ldun",
   "message": "2 years, voluntary, I'm a female. I was still emotionally attached to my ex and didn't want anyone else.",
   "created_utc": 1693217945,
   "score": 5,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2mbue",
   "message": "It's nearing ten years now.  It's voluntary.  I just straight up realised that I don't even like it that much!",
   "created_utc": 1693218631,
   "score": 12,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy27r55",
   "message": "About to be 3 months. Gf broke up with me and even though I’ve had the chance, it doesn’t feel fun/right as I’m still feeling the breakup.",
   "created_utc": 1693206734,
   "score": 4,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2ivn2",
   "message": "8 years, which was most of my 20's. It was, by and large, voluntary. As a survivor of an abusive family, I learned from my first relationship in my late teens that I was prone to being mentally and emotionally abusive, despite my trying hard to not be, and it scared me and made me want to change. So after that 3 year relationship ended, I spent the next 8 years unfucking myself so I could be a better partner.",
   "created_utc": 1693215989,
   "score": 4,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2ldbg",
   "message": "I’ve never been without sex for long enough to count it. Maybe a month-6 weeks when we first adopted our child and he was staying in our bedroom. It wasn’t voluntary as I’d never turn down sex but it wasn’t a priority at the time.",
   "created_utc": 1693217934,
   "score": 4,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2pkas",
   "message": "2 years. I broke up with my ex (I was extremely depressed). So it was kind of voluntary but also kind of not.\n\nI didn't look for another partner but someone expressed interest in having sex with me and now we have sex occasionally",
   "created_utc": 1693220822,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2wwfp",
   "message": "Almost 2 years. My wife and I lost 2 children and she was scared to lose another. We had a 10lb 4oz boy. Worth the wait.",
   "created_utc": 1693225111,
   "score": 4,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2ni9e",
   "message": "6 years - still going (voluntary)\nI am a 41 years old single parent! And after my split I chose to remain happily single.\nI have given so much to men throughout my life and I was repeatedly abused and controlled by them. My marriage ended up with years of intense suffering - it took a lot to escape it!\nI enjoy being alone so much - the emotional stability and freedom of every single little choice! For the first time I am really emotionally fulfilled! It’s being 6 years without even a kiss and I think that I will never kiss again. This is my choice..",
   "created_utc": 1693219458,
   "score": 6,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy245bg",
   "message": "7 years after I broke up with my last bf. Decided to be single at that time and lost interest in sex. After 7 years I decided its time to be active again and found my fubu of 4 yrs now.",
   "created_utc": 1693203870,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy291kz",
   "message": "8y. I'm 33 for reference.",
   "created_utc": 1693207795,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy29onj",
   "message": "About 3 years. Was working all the time, and wasn't over my ex.  The combo of being busy and heartbroken when I did have down time just killed my libido.. probably a good thing",
   "created_utc": 1693208321,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2boy5",
   "message": "15 months \nReason wasn’t able to court anyone In the dating scene and if I did get a date the relationship didn’t last long enough to make it to sex. \nNo was not voluntary",
   "created_utc": 1693209998,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2c47d",
   "message": "Four years. Like a lot here, I wanted to focus on me and be left alone. To be honest, I regret becoming sexually active again more than I do the 4 years. 🤷🏽‍♀️",
   "created_utc": 1693210351,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2f1h9",
   "message": "10 years, after my 2nd gf. Didn't even have any flings or kiss anyone. Not by choice. I'm currently in my 2nd year of having nothing. Again, not by choice. Shit is frustrating.",
   "created_utc": 1693212794,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2lhoy",
   "message": "3-4 years, just couldn't find anyone that I could even talk to let alone have sex with",
   "created_utc": 1693218020,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy23wr2",
   "message": "I (f) committed to celibacy until marriage in 2011, due to matters of faith, among other reasons. That puts me at 12 years without sexual contact. All very voluntary and I wouldn't change a thing.",
   "created_utc": 1693203685,
   "score": 9,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy27upp",
   "message": "7 years, how my last girlfriend made me think I never want to experience this again and I thought I never would  until my new girlfriend propositions me rather agressively.",
   "created_utc": 1693206814,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy29ob8",
   "message": "(31M) Coming up to 8 or 9 years now since I broke up with my ex (I tried to stop keeping track after 7). Can't seem to get dates despite trying (online and in person) and then being friend zoned a couple of times... \n\nAny hints and tips are most welcome 😅",
   "created_utc": 1693208314,
   "score": 4,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2519e",
   "message": "4 months and counting. The girl I’d been hooking up with moved away over the summer.",
   "created_utc": 1693204572,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy29g20",
   "message": "Almost 13 years now. Um, you do mean sex with someone else, right? \n\nThe cause is a little complicated. I've tried to have a few relationships since my divorce but between bad timing, one with an amazingly strange drug addiction that made the act weird, bad gaydar, and a couple I just wasn't desperate enough for yet I haven't done the deed since '10.",
   "created_utc": 1693208128,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy29r3n",
   "message": "Two years. I got sick of chasing women for sex",
   "created_utc": 1693208378,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy29s0v",
   "message": "12 years, no",
   "created_utc": 1693208401,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2cbod",
   "message": "It's been for years for me. I've only even been with one partner who was sexually active with me, and I am currently single and have been for a couple of years. Not a big fan of the idea of one night stands either. It is, however, not voluntary.",
   "created_utc": 1693210523,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2cufh",
   "message": "Four years, technically, but that was just one time in the middle of an ongoing nine year stretch. The first five years I was taking care of my elderly father, then mourning his death, then lockdown… Still trying to figure out how to have a life after all of that. Caring for my dad also did a number on my career so that’s been my focus since losing him. It’s so much easier to think when I’m not stressing about romance or hookups.\n\nWeirdly I do have a high sex drive but this drought hasn’t been difficult for me. I can handle things just fine myself.",
   "created_utc": 1693210949,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy3j0e7",
   "message": "I didn’t jack off for like 4-5 days after I got the clap",
   "created_utc": 1693235009,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy3tevl",
   "message": "y’all fucking ?",
   "created_utc": 1693238972,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy3u7f2",
   "message": "Currently on 8Months in a relationship. Not v. thrilled about it.",
   "created_utc": 1693239269,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy3uhon",
   "message": "About a year and a half. My wife discovered she was asexual and not really into having sex.",
   "created_utc": 1693239375,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy23mnd",
   "message": "About two months of voluntarily celibacy because I thought I had a std there was no way for me to tell who I could have gotten a std from but I didn’t want to give it someone else and refused to have sex until I knew I was clean. I luckily didn’t have a std but I tested positive for Covid -19 and needed to rethink a lot considering I thought I had a std but didn’t know who I could have gotten it from. I’ve been so much safer since then.",
   "created_utc": 1693203467,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy295jv",
   "message": "About 7 years now. Mostly voluntary as I am not looking for anyone and I'm pretty much the incarnation of a lone wolf.\n\nSometime I wish I had sex again, but then I remember how exhausting sex is and how much issues I have with finishing and I remember why sex is pretty meh. Porn is enough for me, really.",
   "created_utc": 1693207888,
   "score": 5,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2l16a",
   "message": "4 years, my partner has anxiety about it (no SA trauma, just anxiety), and no \n\n(I don't mean *just* anxiety in an invalidating or minimizing way. there's just no trauma involved)",
   "created_utc": 1693217683,
   "score": 3,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy1ym9t",
   "message": "2 months, a relationship ended and I’m not one to sleep with someone new until I’m in a relationship with them",
   "created_utc": 1693199789,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy1ymxb",
   "message": "2 years, between when I turned 14 and 16. 14 was my first time, then I got in a long term relationship and I was her first everything so we took it slow until about a year.",
   "created_utc": 1693199801,
   "score": 4,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy22o78",
   "message": "Probably about 2 weeks because my boyfriend was in a different city and we couldn’t see each other",
   "created_utc": 1693202732,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2851c",
   "message": "Pregnancy, about 5 months. I was in so much pain carrying the baby, the last thing I could think of was the horizontal mambo.",
   "created_utc": 1693207046,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2963h",
   "message": "My whole life",
   "created_utc": 1693207900,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy289q2",
   "message": "2 months. My fiance had gone to jail for reasons I won't be speaking about.",
   "created_utc": 1693207152,
   "score": 2,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2bctk",
   "message": "About a year and a half.\nI got cheated on in my last relationship, and it made me not want to see or sleep with other people for a while and honestly? It was just fine. In that time I wasn't concerned with getting or not getting sex, didn't feel like seeking it out and that surprised me!\n\nI've since mostly recovered (well, I'm fine with sleeping with other people now as long as there's no chance of a relationship) but I still don't want to date people due to the trust issues that I've developed.\n\nI found that you can just skip sex and still be happy, which is not at all what society taught me about being a man.",
   "created_utc": 1693209719,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2dqpl",
   "message": "Like a year and a half, breakup and taking time to work on me and enjoy some me time, sorta voluntary since I  simply didn’t wanna date during that time",
   "created_utc": 1693211708,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2qykp",
   "message": "Two years, and I've been trying for sex the entire time ahahaha. \n\nMy therapist gave a really good statement, she said if I truly wanted to I could have sex this weekend. But I want it with the right person so that's why it hasn't happened. \n\nTrue, but I mean man this be quite the dry spell at 27",
   "created_utc": 1693221708,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy3e49h",
   "message": "Hello there. Fortunately I think that a couple of months, 4 or 5.\n\nAs a bonus I must share one of my closest friend's story. He was almost 3 years without sex (100% involuntary) and the day after he had sex we met on a pub to celebrate. Then we sang to him a song (a version of Happy Birthday) and all the pub went along. Everybody tought it was his birthday, but they celebrated a one-night stand that broke 3 years of celibate.",
   "created_utc": 1693233062,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2b6tq",
   "message": "12 years, I'm not into casual sex and that seems to be all women want these days",
   "created_utc": 1693209581,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2birj",
   "message": "(currently) 3-4yrs. Had a body count of 38 by 22. \n\ngf and i broke up and after realizing how much of my life i had wasted with her, i no longer feel that urge to court every hot chick that shows a little interest. sex is meaningless and the whole dating game is pointless to me ‘cause i now know what i want and i’ve only met one girl that *might* qualify. \n\noh yea, forgot the part where i’ve been put in a psych ward twice in that time and my entire life has crumbled around me, so i’m not exactly a “desirable” mate anymore. \n\nstill get the occasional girl trying to hook up with me, but like, pretending to connect with someone just to have sex just seems so tedious and a waste of time and money. \n\ndon’t get me wrong tho, i prefer this. i spent my whole life being a slave to my desire for intimacy and it finally feels like the shackles are falling off.",
   "created_utc": 1693209857,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2azrn",
   "message": "[deleted]",
   "created_utc": 1693209416,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2jyry",
   "message": "One week, we were too busy and tired because of work",
   "created_utc": 1693216857,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy2lm81",
   "message": "10 years. I dislike what men have done to me in life. I refuse to be involved with a man who may hurt me again. Sad but I need to keep myself and my children my priority.",
   "created_utc": 1693218112,
   "score": 1,
   "submission_id": "163cxgz"
  },
  {
   "comment_id": "jy209gt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163cxgz"
  }
 ]
}