{
 "submission_id": "163dmf9",
 "title": "What are you thoughts on a 25 year old getting a vasectomy? Too young to make such a drastic decision?",
 "selftext": "",
 "created_utc": 1693201795,
 "permalink": "/r/AskReddit/comments/163dmf9/what_are_you_thoughts_on_a_25_year_old_getting_a/",
 "score": 108,
 "url": "https://www.reddit.com/r/AskReddit/comments/163dmf9/what_are_you_thoughts_on_a_25_year_old_getting_a/",
 "comments": [
  {
   "comment_id": "jy22gtz",
   "message": "Be 100% certain. I got one last year. I don’t regret it but I was 33 lol. We’re not all meant to be parents.",
   "created_utc": 1693202579,
   "score": 223,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy23d7l",
   "message": "I don’t think it’s necessarily too young. Really depends on you and how sure you are. My friend got a tubal at 21, and she wasn’t even the first one her doctor has done so young.",
   "created_utc": 1693203265,
   "score": 54,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy24tol",
   "message": "My friend(f25) got her tubes cut. They say they don't want kids. Their decision.",
   "created_utc": 1693204408,
   "score": 40,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21mcb",
   "message": "If you don’t want kids you don’t want kids, simple as that. That being said, my brother in law got a vasectomy at 25 and his doctor said he was the youngest he’s ever seen.",
   "created_utc": 1693201941,
   "score": 127,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21x9e",
   "message": "It depends. I was deadset against having kids until I was 30 so my stance has changed a bit. Vasectomies can be reversed but reversals are not guaranteed to work. So it's really up to you.",
   "created_utc": 1693202170,
   "score": 36,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2jxtj",
   "message": "I asked my GP at 30 and he strongly urged me to wait a while. \n\nI'm now 40 and arranging to get it done. Probably should have just got it done earlier.\n\nWhen you know, you know.",
   "created_utc": 1693216836,
   "score": 9,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy255aj",
   "message": "I wish I had mine done when I was younger, I've always known I don't want kids and it's not changed as I've grown older.",
   "created_utc": 1693204659,
   "score": 9,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2e3z9",
   "message": "My only thought is, don't treat it as reversible.",
   "created_utc": 1693212014,
   "score": 7,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ybq5",
   "message": "You are not too young! I got it done at 27, no hesitation from my urologist. Definitely a male priveledge to not be grilled by the doc if you say you don’t want kids. Another reason I got it is I don’t want any partners to feel they need to be burdened by hormonal or any other type of birth control when vasectomy is such an easy option.",
   "created_utc": 1693225876,
   "score": 8,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy23qsh",
   "message": "Worst case scenario, you end up wanting kids and you adopt. Those children would belong to you as much as any biological children.",
   "created_utc": 1693203560,
   "score": 71,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2lcjj",
   "message": "I got mine done at 22 and saved me multiple times. I’ve had 2 ex’s claiming to be prego. Oh and one actually was.",
   "created_utc": 1693217918,
   "score": 5,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21lnr",
   "message": "Some people may regret it, but it's their choice either way. If they're an adult, then that should be all that matters and no doctor should tell them \"no\". That goes for women that want to get their tubes tied, too.\n\nI really hate this stupid \"too young\" mindset that people push. Their body, their choice. Someone telling other people what they think they should do with THEIR bodies is selfish as fuck and people honestly need to learn to just shut up when it comes to it.",
   "created_utc": 1693201927,
   "score": 44,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy39uot",
   "message": "Get the snip. Too many idiots breeding anyway.",
   "created_utc": 1693231288,
   "score": 4,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy22k6b",
   "message": "Well the trick to this is to like cryogenically freeze your sperm in case you do change your mind later in life.",
   "created_utc": 1693202649,
   "score": 12,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2k58n",
   "message": "Go for it. I turned mine from a tool of procreation to a tool of recreation. No regrets. Best thing about it is if your gf gets pregnant you know it ain't yours. It's like a hidden super power.",
   "created_utc": 1693217000,
   "score": 14,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy28h4h",
   "message": "Not too young. It's good that you're taking responsibility. \n\nIt's also very clear to a potential partner that you don't want kids. \n\nThey're reversable but I'm not sure what the success rate is.",
   "created_utc": 1693207320,
   "score": 6,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy277n7",
   "message": "At 25 years you can stick babies in any number of women’s bodies to grow. Whether you would in that circumstance chose to be responsible or flake, it’s becoming increasingly difficult to obtain an abortion so one or both of you would be stuck with a kid for the rest of y’all’s lives. And if she doesn’t want to carry it, she might still pursue an abortion. In an illegal state that can mean legal penalties and even prison time. You could possibly get a vasectomy reversed but a woman you impregnate might not be so lucky. No, 25 is not to young for a vasectomy — especially not in a country where current law dictates that a 10 yo child can be forced to grow a baby.",
   "created_utc": 1693206303,
   "score": 8,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy28zw5",
   "message": "It's their body. I'd say go for it. Who am I to decide for them?",
   "created_utc": 1693207754,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2iuaq",
   "message": "A vasectomy can be reversed. Sperm can be stored on ice. I say go for it. The less unwanted babies the better.",
   "created_utc": 1693215958,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2lfru",
   "message": "I (25) was 22, no regrets since then.",
   "created_utc": 1693217983,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2poa6",
   "message": "Oh thanks for reminding me, really ought to get that sorted..!",
   "created_utc": 1693220895,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2z9c9",
   "message": "Snip snap snip snap",
   "created_utc": 1693226363,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy32j5r",
   "message": "I got mine at 22, and now 30+ years later I have no regrets",
   "created_utc": 1693227981,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3gklt",
   "message": "I did it when I was 26. I was married and had a boy and girl. Wife and I said perfect, one of each. Wife said she would get her tubes tied. I said “NO” it screws with your menstruation and hormones until menopause. I got snipped and never had any issues. We will be married 39 years in May.",
   "created_utc": 1693234047,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3igmj",
   "message": "I feel like deciding to have children is a much more drastic decision than deciding to not have children.",
   "created_utc": 1693234790,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy24u6i",
   "message": "Hard to say really, some people are so sure in their 20s and it will last them whole life and some still feel sure and yet they will change their minds later.",
   "created_utc": 1693204420,
   "score": 6,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2a57v",
   "message": "My friend Michael Scott, about 40 y.o at the time was with a woman Jan Levinson, they had an odd relationship. But they invited me and my partner over for dinner with a couple of guests, we had dinner blah blah blah getting to the point. They started arguing and he brought up about how he’s had a vasectomy done because of her not wanting children then he had it reversed because she changed her mind then had another vasectomy… etc etc you get the point. He said it takes a lot out of a man for getting a snip snap snip snap. - you do you my dude 😀 had edit it, I’m not a professional so idk if they’re actually reversible, just wanted to reference the office.",
   "created_utc": 1693208709,
   "score": 6,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy259rm",
   "message": "We let 25 year olds drink, smoke and listen to country music, so I say let them snip if they wanna.\n\nOf course, that also means the doc has a right to refuse if they don't want to snip a 25 year old.",
   "created_utc": 1693204758,
   "score": 9,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2f1yf",
   "message": "Too young, don't do it",
   "created_utc": 1693212805,
   "score": 4,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy226yh",
   "message": "I'll just say this: my current life is basically a complete 180 from how I imagined when I was younger. Early 20s me wouldn't believe the path I took if I told him. I'd give it some time, you *really* never know how you'll feel in the future.",
   "created_utc": 1693202374,
   "score": 8,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy28daf",
   "message": "I was 36 when my wife and I changed our minds about having a kid. Hold off, dude. There's no rush.",
   "created_utc": 1693207232,
   "score": 8,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2794e",
   "message": "I'm 28 and will probably have it done by the time I'm 30.",
   "created_utc": 1693206335,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2azal",
   "message": "I’ve had mine done. Best decision I ever made",
   "created_utc": 1693209405,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ccz6",
   "message": "I was 28. Worked out fine",
   "created_utc": 1693210553,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2gs35",
   "message": "Completely up to you. If you’re sure you don’t want kids and would like one then go for it.",
   "created_utc": 1693214245,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2hcjf",
   "message": "I had mine done at 34.\n\nI always knew that I never wanted kids of my own, I could have done it at 25 all the same.\n\nIf you're sure, go for it.",
   "created_utc": 1693214721,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2hhg4",
   "message": "Why? Why is it too young for that and being a parent (and many have 3+ kids) at 25 okay??? Make it make sense. Not saying you’re one of those people OP that might have double standards, I’m just saying in general. Nothing is too young, if you feel it’s right, and took time to REALLY think of it and not as an impulse, then, it’s the right choice.",
   "created_utc": 1693214837,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2s1au",
   "message": "I think my brother said it best to my mom when she was crying when she found out I got mine (I was 30 when I got it): “Mom, he’s been saying he doesn’t want kids since he was 12 years old.” \n\nIf you know, you know. This goes for both men and women. The only conversations you need to have are the ones with your doctor that explains potential risks of the surgery and the one with your partner to let them decide if they still want to be in a relationship with someone who can’t have kids.",
   "created_utc": 1693222366,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2zjy0",
   "message": "Wait until you get older and need a hernia repair. My Urologist cut me a twofer. (Pun intended).",
   "created_utc": 1693226512,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy388sj",
   "message": "My first inclination is to say yes, too young.  \nBut then again it really depends on the person.  \n\n\nWe all like to think of ourselves as mature enough to make such a decision and not regretting it, but many aren't.  \n\n\nI think it very much depends on where in your life you are and how certain you are. Any doubt, any bit of uncertainty and I'd advise against it. I find that people are sometimes a bit more on the \"Let's just do it\" side because they think of it as easily reversible. It should be thought of as permanent.  \n\n\nI'm thinking, if you are 25, you've been with your girlfriend for 8 years, you live together, you've been working since you were 19, you are completely settled and you are adamant about never wanting kids, I think you can make that decision despite being young.  \n\n\nBut I'm thinking if you are 25, you've just come out of uni, your love life has been turbulent and unstable and right now you feel like you never want kids, I feel like maybe it would be better to wrap it up for a while and reassess how you feel about it.  \n\n\nThings might change. Your life is in full change and you've probably been in a position where you couldn't fathom having kids. Maybe your views change when you are settled more, when you have more money and luxury at disposal, when you meet that special woman. Or maybe they won't. But if they didn't change during all of that change in your life, I think you can make that decision and there will be very, very little chance you're ever gonna regret it.  \n\n\nI'm 27 right now, I went through long education so my situation would be closer to the latter. And I think if I felt like I never wanted to have kids, I wouldn't be able to be 100% certain at that point in my life, so I'd go for less invasive means of protection. (It's also nicer because wrapping up protects against most STDs)",
   "created_utc": 1693230592,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3bsn3",
   "message": "Yeah they can be reversed so not the end of the world, but I don't see the point.  The idea that a 25 year old can't or won't ever change just isn't true.  They might not, but they might.  If they are with their partner and decide to not have kids then it's a good form of birth control no doubt. But for a single guy, I don't see the value in going through surgery for something that can be avoided other ways.",
   "created_utc": 1693232107,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3cbj9",
   "message": "Your body your choice but I would advise 2 things. 1 make sure you are having enough intimate time with someone to justify the cost of surgery and 2 still wear protection. The snip will not protect you from diseases. I had what is considered quite a few partners and considered it myself when I was younger, but my wife and I recently had our first child and I can say I am glad I chose not to. Choose wisely my friend.",
   "created_utc": 1693232324,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3cmbm",
   "message": "I won't lie, I'm 25 also and have considered getting one because I have zero interest in having kids of my own. Personally I'd rather adopt but even then I'm not that interested. If I find a partner who is also in the same boat and we decide to marry each other, you bet I'm getting it done",
   "created_utc": 1693232447,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3eef2",
   "message": "No....but be 100% sure and if you through with it be up front with any potential love interests.  Last thing you want is to drop the bomb on a potential spouse.",
   "created_utc": 1693233177,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21r1v",
   "message": "I mean I'd happily date a guy with a vasectomy. I'm 24 so 25 is in my age range for dating. I don't want kids though. From a dating perspective it will limit your options. Girls who want kids might not go for you. However, there are still a lot of girls our age who don't want kids or already have kids.",
   "created_utc": 1693202038,
   "score": 7,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy25z2g",
   "message": "it's your body, your choice.",
   "created_utc": 1693205317,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2841r",
   "message": "Here they're not done before 35. Too many with regrets.",
   "created_utc": 1693207025,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy28jqs",
   "message": "Here’s what I will say about this: I was in your shoes at 25 (I’m 35 now) and I wanted to do this so badly. I was very anti-kid until I was 32 and then my best friend had her daughter, and then the next year I met my other friend’s daughter for the first time. I’m still confident that I don’t want kids, but having two kids suddenly be some part of my life really made me look at it closer.\n\nUltimately, it’s your body and your choice, and finding a doctor who will do it will be potentially hard depending where you are. As far as dating goes just be upfront about it when talking to someone.",
   "created_utc": 1693207382,
   "score": 4,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy294z0",
   "message": "I got mine at 31,  but I already had two healthy kids.  I will say that in my opinion the regret of having kids you don’t want would outweigh the regret of never having any,  but at the end of the day it’s a highly personal decision.",
   "created_utc": 1693207874,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy29u79",
   "message": "I'd recommend against it at that age. For one, they aren't as reversible as people think, so if you change your mind, it might be too late. But the bigger argument is the younger you are for the procedure, the more risk you have of it reversing itself. Not a massive risk, but still significantly higher than men who get them later on.",
   "created_utc": 1693208451,
   "score": 4,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy26r5m",
   "message": "I appreciate the opinions here, but I will say as as an older person: wait. You might be right but can’t go back. Like a bad tattoo.",
   "created_utc": 1693205934,
   "score": 3,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2joki",
   "message": "If 14 year olds are considered capable of making the decision to transgender I don't see why a 25 year old shouldn't able to decide to get a vasectomy (which in some cases is even reversible).",
   "created_utc": 1693216629,
   "score": 4,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21iju",
   "message": "Vasectomies are reversible, so its not a big deal. Worst case scenario, freeze some sperm.",
   "created_utc": 1693201863,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2amxi",
   "message": "You need to treat it like a permanent operation, since reversals are not always successful.\n\nPersonally, I would not advise it. I didn't want kids at that age, but now I have a 7yr old daughter who is my whole world.  Things change, and you don't know what's going to happen.\n\nI got a vasectomy a couple years ago after considering things like \"what if something happened to my marriage/wife and I met someone else\", \"what if something happened to my daughter\". Things that seem inconceivable to happen, may well happen. Take it seriously, basically.",
   "created_utc": 1693209119,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ltcu",
   "message": "If that's too drastic a decision for a 25-year-old, how does having a child rank?",
   "created_utc": 1693218261,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy25ulq",
   "message": "If my son came to me and asked if it was a good idea I would say, no.  That doesn’t mean it shouldn’t be possible to do.  I support anyone wanting to make a medical decision though I think we all would benefit from wisdom gained through time and listening to others who’ve walked similar steps.\n\nI was anti children for 35 years.  I now have a child.  I’ve never felt like I didn’t make the right decision in having a child.  I also don’t believe I made a wrong decision in waiting and saying I didn’t want one for the first 35 years.",
   "created_utc": 1693205216,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2exoz",
   "message": "I’m almost 40… when I was 25 about 80% of the people I knew didn’t want kids with 20% definitely wanting them. About half the ones who didn’t want them changed their minds in their 30’s and had kids. \n\nSo I don’t really think it’s a particularly good idea to be sterilised forever at 25, but end of the day it’s your call.",
   "created_utc": 1693212707,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2febp",
   "message": "At 25 I wanted a vasectomy. At 30 I wanted to be a dad. At 36 my son is nearly 4 years old and the Center of my universe. Hold off just a little longer brother.",
   "created_utc": 1693213092,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2kpap",
   "message": "Depends if you’ve already had the kids you want",
   "created_utc": 1693217428,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2y6mz",
   "message": "Freezing your sperm for future use is always an option.",
   "created_utc": 1693225799,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2hkqs",
   "message": "Yep too young",
   "created_utc": 1693214912,
   "score": 2,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2gplx",
   "message": "I find it hilarious that 25 is potentially too young for a vasectomy but people are allowed to transition younger.",
   "created_utc": 1693214187,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2hzdv",
   "message": "85%+ of vasectomies can be successfully reversed if you happen to change your mind someday. Go for it.",
   "created_utc": 1693215254,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21r33",
   "message": "Yes, too young imo. You might feel someway now and later feel different. Plus you dont know what complications can occur....best to just wear a condom lol",
   "created_utc": 1693202039,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy23gpe",
   "message": "ur body ur choice, idc",
   "created_utc": 1693203340,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy24hii",
   "message": "I mean, your body = your choice\n\nIf you don't like the consequences later that's on you tbh, adoption is always an option and we don't need more bio kids considering how many need adoption as is lol \n\nGranted, I'm medically infertile anyway and I'm planning on having all that mess removed cause trans so..take my advice with a grain of salt",
   "created_utc": 1693204140,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy259u7",
   "message": "Do it, people should be adopting more anyway",
   "created_utc": 1693204759,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy25mlr",
   "message": "I mean with plenty of incels these days going around saying people are *fools* for not having kids by that age, then going onto say you have less than 5 good years to have them until you become a miserable old hag makes you think hey maybe 25 isn’t young at all to make such a decision",
   "created_utc": 1693205040,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy27hfw",
   "message": "Imo, you're never too young to decide you don't want kids. Acting on it requires being an adult, which I'm pretty sure being 25 makes you one.\n\nIt doesn't stop you having kids, it just means your ability to conceive naturally doest function, you can still conceive IVF or adopt, if you change your mind later down the line.\n\nAt the end of the day, you're an adult, and if it feels right to you, then no one really gets a say apart from you.",
   "created_utc": 1693206520,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy27slw",
   "message": "How about you explain your line of reasoning? I understand there may be some specific reason.\n\nI don't think I'll be sexually active at any point in the future but if I was, I would get a vasectomy definitely. I'm 24. The reason would be obvious if you saw some of my recent posts (trigger warning)",
   "created_utc": 1693206767,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy28dbj",
   "message": "If/when you do, you may want to start by browsing through r/childfree’s list of doctors that are willing to perform sterilization procedures without judgement. Some doctors will initially seem supportive, then ask a lot of invasive questions before the procedure.",
   "created_utc": 1693207233,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2agjm",
   "message": "Flip a coin, if you feel any single bit of regret on whatever the coin flips then you know your not ready. Honestly the fact you even asked tells you enough. Maybe wait a couple years",
   "created_utc": 1693208972,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2arjc",
   "message": "If 25 is old enough to decide you want kids, it’s old enough to decide you don’t.",
   "created_utc": 1693209225,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2eab3",
   "message": "Yes, IMO.\n\nIt will not have significant impact on your life if you don’t have it - unless you are in a very long term and monogamous relationship you will/should anyway be using condoms for a few more years.\n\nIf you do, it will close a door that’s not always reversible, and it *might* be one you will change your mind about either yourself or when you are settled in a permanent relationship. You will be closing yourself to potential life partners that actually might not want kids in the end but are currently not sure because they are young.\n\nI believe the decision is better taken when you are in a settled relationship and up until that point it seems the only motivation is because you want to rub your pee pee without a condom for a couple more years. The trade off between doing it now and doing it later seems way imbalanced when I think about it practically.",
   "created_utc": 1693212163,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ee0h",
   "message": "İf you dont want to have kids do it you are grown man",
   "created_utc": 1693212252,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2g7vl",
   "message": "Yes. The whole \"you might change your mind\" thing is bs. If you have a kid at 25, it'd be celebrated. That's an insanely bigger life altering decision. If you do change your mind, there's always reversal or adoption. You can also freeze your sperm.\n\nI knew I never wanted kids since I was a teen. Pregnancy freaked me out so much that it caused me to avoid sex in relationships. I first asked a doctor at 23. At 27, I finally had a urologist who totally got it. He never said I was too young or anything. Just gave me a quick \"Here's what happens. You sure that's cool?\" talk and booked me for later that month. One of the best decisions of my life. And all that sexual fear went away instantly.",
   "created_utc": 1693213776,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2jwdk",
   "message": "If a 25 year old guy is old enough to have kids, then he’s old enough to have a vasectomy. \n\nI got mine at 22. Couple years later and my brother still won’t stop going off about me being seeming immature for doing it. But the hypocrisy is him having his second child at 21.",
   "created_utc": 1693216804,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2k6jw",
   "message": "Wait. You don't know how you'll be in 5 or 10 years.",
   "created_utc": 1693217029,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ldn9",
   "message": "Please dont. Your too young, and you may regret it later on. No point in taking such a massive risk just because you want to rawdog your significant other.",
   "created_utc": 1693217941,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21qwy",
   "message": "Definitely too young, id ask what the reasoning is behind it before blindly agreeing. While youre old enough to make decisions on such matters, Id say think really deeply into it, and be aware of any repercussions. Its on you, no one else, so any and all repercussions, even regret will be all on you regardless of the reasoning right now.",
   "created_utc": 1693202035,
   "score": 254,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21ysk",
   "message": "Don’t do it!",
   "created_utc": 1693202203,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2azlb",
   "message": "Dude yeah it’s too young unless you have hella kids already. Just pullout bro",
   "created_utc": 1693209412,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy21gjx",
   "message": "To each their own",
   "created_utc": 1693201823,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy23f3b",
   "message": "Do it soon before you change your mind",
   "created_utc": 1693203305,
   "score": 254,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2jo4y",
   "message": "It depends.  You’re never too young for a vasectomy if you’re MAGA.",
   "created_utc": 1693216620,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy24i2o",
   "message": "Yes it's too young. You may want children at 40. Your life will be very different then, and you will be too",
   "created_utc": 1693204153,
   "score": 253,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2lyiq",
   "message": "In my opinion, too soon. It is an understatement of your ability to control yourself contraceptively.",
   "created_utc": 1693218363,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2o4je",
   "message": "Don’t. When I was 25 I was certain I never wanted kids. Life changes. Priorities change. And feelings change. Now nearing 40 I have an amazing 3 year old son.\n\n\nJust wear condoms. Make sure your partners are on birth control.",
   "created_utc": 1693219876,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2tfx6",
   "message": "Don't do it! The female pill exists.",
   "created_utc": 1693223192,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3e5iz",
   "message": "Yeah, a little young I'd say. I couldn't imagine myself as a parent at 25, yet love being one at 31 (though I coulda picked the baby momma better. THATS the thing you gotta get right).",
   "created_utc": 1693233077,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3i478",
   "message": "Don't listen to these people it's waaaaayyyy too young. My anti kids hates being around kids, and seemingly selfish best friend met his wife at 33 he is now a wonderful dad to 4 amazing kids. Just wrapp it or zap it",
   "created_utc": 1693234653,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy3n5u7",
   "message": "Way to young to make such a commitment without a medical necessity, I dont care how confident you think you are at that decision. There are plenty of ways to not have kids without taking such a permanent action. And i\"m saying that as a 41/M with no kids who doesn't want kids.",
   "created_utc": 1693236610,
   "score": 0,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy230hw",
   "message": "I had 4 kids, all after the age of 25. I got a vasectomy in my 40s. Looking back at me at age 25, I was essentially a dumb kid that knew next to nothing about where my life would take me. I think it is too young, but if you're willing to make a reckless decision like that at a young age, maybe it's best you go ahead so you don't pass on your genes!",
   "created_utc": 1693202993,
   "score": 252,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy27tof",
   "message": "We've ruined this earth. Who wants to bring a kid into this. But if you aren't positive, then yes it's pretty drastic. Nothing wrong with wearing a condom",
   "created_utc": 1693206791,
   "score": 253,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy298wp",
   "message": "FYI doctors might not do it if you’re that young",
   "created_utc": 1693207964,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2btzp",
   "message": "The sooner the better",
   "created_utc": 1693210115,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2c8sr",
   "message": "Please do it",
   "created_utc": 1693210456,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2cbf1",
   "message": "Your body, your choice.\n\nMaybe freeze some sperm *just in case*. Never hurts to have a back up.",
   "created_utc": 1693210517,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ccp4",
   "message": "Well it is 90% reversible",
   "created_utc": 1693210547,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2dk3f",
   "message": "many doctors will simply refuse based on your age",
   "created_utc": 1693211550,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2e79o",
   "message": "Have you got kids or you just don’t want them period, because 25 is a bit young to have a vasectomy and later down the line you might want kids",
   "created_utc": 1693212091,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2f1g5",
   "message": "It’s reversible…",
   "created_utc": 1693212794,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2fpim",
   "message": "It's reversible. If you have the cash and are otherwise greenlit (eg. no health conflicts, no anesthesia negatives, etc) - go for it.",
   "created_utc": 1693213353,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2gtwu",
   "message": "It's reversible. You'll be fine.",
   "created_utc": 1693214289,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2is8g",
   "message": "Yep. Too young",
   "created_utc": 1693215912,
   "score": 255,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy250kd",
   "message": "I got mine at age 37. But I had 3 kids",
   "created_utc": 1693204557,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy25ol8",
   "message": "I'm not saying people are born with paternal/maternal instincts, but if you know, then you know.",
   "created_utc": 1693205084,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy25pny",
   "message": "If they are fully informed about the possible risks and complications, including them not being 100% reversible, I think a man should have control over his fertility.",
   "created_utc": 1693205107,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy261pz",
   "message": "Not too young at all. If you don't want kids, this is the most effective way.\n\nAnd you could always have your sperm frozen for if you change your mind on kids. *And* most vasectomies are easily reversible these days.",
   "created_utc": 1693205373,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy262rb",
   "message": "I had mine done at 18. Then reversed at 25. It was painful both times. Not getting snipped a 2nd time until I am a father of 1+.\n\nDo what you want.",
   "created_utc": 1693205396,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy268n2",
   "message": "Young for sure but you are an adult at that age and have mostly finished developing from a personality perspective.\n\nAll that said I will say that when I was 25 I was dead set on no kids but ultimately decided not to go through with the snip. Essentially my mothers ‘what if you change your mind’ talk convinced me to change my mind. Lo and behold in my 30s I had a complete change of mind and I’m so glad I didn’t.",
   "created_utc": 1693205523,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy29cxd",
   "message": "Do it. I wish I had the courage to, I'd be soooo much richer and less stressed. Kids are not worth it for dudes unless they reeeally want them.",
   "created_utc": 1693208057,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy29iv2",
   "message": "My one brother has one. He and his wife don't wanna deal with human babies and are happy to be uncle and aunt.",
   "created_utc": 1693208192,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy29yf2",
   "message": "I haven't gotten one yet at 35, but I would have ages ago if I was getting laid with any frequency. I've known I don't want kids forever. \n\nIf you're sure, go for it. But be sure.",
   "created_utc": 1693208550,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2afo4",
   "message": "their body their choice.",
   "created_utc": 1693208952,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2d8vz",
   "message": "No. A vasectomy/tubectomy should be an option for any adult that is certain that they want it. Not all adults want to have children.",
   "created_utc": 1693211289,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2dpun",
   "message": "I say if you don't want kids then get the snip. Shoot blanks and have fun.",
   "created_utc": 1693211688,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2emwl",
   "message": "Fuck them Kids, but You can have a \"sample\" frozen for future use if you change your mind.",
   "created_utc": 1693212460,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ezp8",
   "message": "use a reputable office, donate sperm for about a month or so before you have the surgery done, freeze it (dont forget to pay the bill) and if you decide you want kids afterwards you can use in vitro with your own swimmers.",
   "created_utc": 1693212753,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2f736",
   "message": "Vasectomies are reversible and you still have ways of extracting sperm even after a vasectomy. So in this instance I would say go for it.",
   "created_utc": 1693212924,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2fefn",
   "message": "Stds still exist wrap it up, and you do you.  Don't get complacent. Love is temporary herpes is forever.",
   "created_utc": 1693213095,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2fnhy",
   "message": "It seems most people here don’t know, but these days you can reverse it so it’s not even permanent anymore…",
   "created_utc": 1693213305,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2fqyk",
   "message": "If you know, you know.",
   "created_utc": 1693213387,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2g0cr",
   "message": "Your body, your choice. Fairs fair",
   "created_utc": 1693213601,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2gczx",
   "message": "You can reverse it with more surgery.\n\nAfter 15 years, success rates start going down until around 60%.",
   "created_utc": 1693213897,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2ge1t",
   "message": "My husband had his at 28 after our family was complete. The surgeon was fine with it. He asked us what would happen if God forbid something should happen to one of our children and we both said that while we understood that that was a scenario that we supposed would be very instinctual to want another baby to fill the void, we knew we couldn't \"replace\" the same child that's lost so would sadly have to cope with the loss. He was happy with that answer.\n\nA friend of mine has always been adamant that he never wants children and had a vasectomy in his mid 20s. He's about 38 now and he has zero regrets at all. He just knew 100% that he had no desire to be a father and took the right measure to prevent it happening.\n\nSo is 25 too young to make a drastic decision? I'd say yes, it's very young but there are so many variables that each case is so individual. Just don't act in haste, and consider freezing sperm if you have any doubts about it but do it anyway. Only go into it with the mindset that it is permanent sterilisation because reversal is not always possible. Good  luck with it all whatever you decide.",
   "created_utc": 1693213920,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2htrt",
   "message": "Are you in a relationship? Both agree on it? Or are you single and just see it as a permanent form of birth control? Just wear a condom... you should be wearing one anyway with new partners, etc. STD's suck... I feel like i need to ask a lot more questions, so im not making assumptions!",
   "created_utc": 1693215125,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2hu1z",
   "message": "Age is only part of the story, it also depends on where you are with your life. In a long term relationship you both want to be permanent and child free, for certain? Then maybe it's an OK idea. Single and no real idea of who you might end up with where? Then I'd wait a decade - your opinions might well change if your circumstances do. My current thoughts on where I want my life to go are not remotely the same as when I was your age, and I don't presume to know how I'll feel another ten years from now.",
   "created_utc": 1693215132,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2icpp",
   "message": "Vasectomy is \"mostly\" reversible. If not, there is always IVF.\n\nThis is the best course of action to take the burden of contraception off your partner. Hormonal contraception can fuck up the health of the person taking it. Knowing you had a vasectomy will let them with more choices.",
   "created_utc": 1693215555,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2j0ln",
   "message": "In today’s world I completely understand. Like others have said be 100% sure. Live your life",
   "created_utc": 1693216101,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy2j96m",
   "message": "Freeze your sperm",
   "created_utc": 1693216290,
   "score": 1,
   "submission_id": "163dmf9"
  },
  {
   "comment_id": "jy391qg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163dmf9"
  }
 ]
}