{
 "submission_id": "163jd3q",
 "title": "What’s a common mistake people make in their 20s?",
 "selftext": "",
 "created_utc": 1693221555,
 "permalink": "/r/AskReddit/comments/163jd3q/whats_a_common_mistake_people_make_in_their_20s/",
 "score": 159,
 "url": "https://www.reddit.com/r/AskReddit/comments/163jd3q/whats_a_common_mistake_people_make_in_their_20s/",
 "comments": [
  {
   "comment_id": "jy3mlal",
   "message": "Fear. At least, that was mine. Fear of taking a leap that could open unknown opportunity. Took me a long time to build confidence.",
   "created_utc": 1693236392,
   "score": 166,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3dv3d",
   "message": "Staying with people because they’re scared of being alone instead of working on themselves and what they want for their own life.",
   "created_utc": 1693232959,
   "score": 62,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2r6h1",
   "message": "They wait for life to come to them.",
   "created_utc": 1693221844,
   "score": 144,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2rxer",
   "message": "Worry about the opinion of other people too much",
   "created_utc": 1693222301,
   "score": 218,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy32vy7",
   "message": "Not taking oral health seriously. I can’t tell you how many people I know in their late 30s and early 40s who didn’t see a dentist for years in their twenties, and now they’ve got all sorts of issues.",
   "created_utc": 1693228152,
   "score": 67,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3bgk8",
   "message": "Not understanding the value of your time. Too many jobs overwork, and underpay you taking advantage of your naivety and inexperience or pull you by the nose with imaginary promises of promotion ect.",
   "created_utc": 1693231965,
   "score": 124,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3gpsa",
   "message": "Binge drinking. \n\nVery unhealthy for the body and can have long-lasting negative effects.",
   "created_utc": 1693234104,
   "score": 57,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy428zd",
   "message": "The biggest mistake I made was pushing off life until I felt like I was ready. Dating, moving, etc. all were pushed until I had completed my masters, felt settled in my career, etc. Now I’m 30 and while I don’t necessarily regret where I’m at, I do feel behind in my personal life while maybe ahead in my professional life. I wish I had been able to balance it a little better.",
   "created_utc": 1693242259,
   "score": 69,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy32btw",
   "message": "Starting to use hard drugs",
   "created_utc": 1693227886,
   "score": 116,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3qypk",
   "message": "Not taking health and body maintenence seriously.\n\nBrush teeth, wear sunscreen, dont pull all nighters regularly, exercise some, show moderation when it comes to drug and alcohol use, give yourself time to heal when you get hurt, try to get regular sleep schedule, eat balanced servings of food.\n\nSmall things like this can help keep your body working properly well into older age. Once you turn upper 30s/40s, your body doesnt rebound from injury and illness that well anymore. And you start getting punished for skipping out on taking care of yourself, except it never gets better",
   "created_utc": 1693238049,
   "score": 32,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy381rd",
   "message": "staying home alone. get out there.",
   "created_utc": 1693230506,
   "score": 171,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy367y7",
   "message": "Financial Irresponsibility Not saving money, accumulating debt, or living beyond their means. Failing to establish good financial habits early can lead to long-term financial stress",
   "created_utc": 1693229687,
   "score": 27,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3hq8b",
   "message": "Alcoholism.",
   "created_utc": 1693234500,
   "score": 24,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2sfjr",
   "message": "Thinking they are adults/know everything and will never change from how they are in this moment.\n\nThere is so much more growing and learning to be had. \n\nAlso start saving your money right now!",
   "created_utc": 1693222602,
   "score": 51,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2s2f3",
   "message": "Giving people chances , you don't owe anyone anything.  There's plenty of people you can have in your life,  drop the ones who lie, cheat, steal and betray",
   "created_utc": 1693222385,
   "score": 86,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy34mf8",
   "message": "Getting married because of unplanned pregnancy.",
   "created_utc": 1693228958,
   "score": 46,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3ybw6",
   "message": "Co-workers = Friends \n\nThey aren't. Are there exceptions to this rule?\n\nMaybe at times.\n\nCo-workers are not your friends. Friends are friends. Work is work.",
   "created_utc": 1693240810,
   "score": 119,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy392uw",
   "message": "Thinking they should fuck as many people as possible and that they’re losers if they don’t.",
   "created_utc": 1693230957,
   "score": 55,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy32mrm",
   "message": "Stay out of debt.  \n\nYou don’t have to always have a car payment.  You can drive it past it’s warranty. Do NOT borrow to buy furniture or vacations.  If you put that money into retirement or just save for what you want, you’ll have more freedom than most.",
   "created_utc": 1693228030,
   "score": 52,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3dqhq",
   "message": "Getting married before getting happy",
   "created_utc": 1693232908,
   "score": 34,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5x3kg",
   "message": "gambling",
   "created_utc": 1693268277,
   "score": 16,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2r477",
   "message": "\r  \nNot saving enough money for the future. Many 20-somethings spend every dollar they have without thinking about their long-term goals or emergencies. This can lead to financial stress and debt later on. It is important to have a budget and a savings plan that suits your income and lifestyle.\r  \n\r  \nNot taking care of your health. Your 20s are a time when you may feel invincible, but that doesn’t mean you can neglect your physical and mental well-being. Partying too hard, eating poorly, sleeping less, and ignoring signs of stress or depression can have serious consequences for your health in the long run. You should make time for exercise, healthy eating, rest, and self-care.\r  \n\r  \nNot building your skills and network. Your 20s are a crucial period for your career development and personal growth. You should not settle for a job that doesn’t challenge you or help you achieve your dreams. You should also seek out opportunities to learn new things, meet new people, and expand your horizons. Networking with mentors, peers, and potential employers can open up doors for you in the future.\r  \n\r  \nNot being careful with your credit. Your credit score is a measure of your financial responsibility and trustworthiness. It can affect your ability to get loans, mortgages, credit cards, and even jobs. Many 20-somethings make mistakes that damage their credit, such as missing payments, maxing out cards, or applying for too many accounts. You should monitor your credit report regularly and avoid any actions that could lower your score.\r  \n\r  \nNot enjoying your life. While it is important to be responsible and ambitious in your 20s, it is also important to have fun and enjoy yourself. Your 20s are a time when you can explore the world, try new things, and discover yourself. You should not let fear, doubt, or pressure hold you back from pursuing your passions and happiness.",
   "created_utc": 1693221804,
   "score": 178,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy441of",
   "message": "Spending the years where your body works the best on a screen. You can do all the screen time when your body falls apart as you get older.",
   "created_utc": 1693242923,
   "score": 28,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3jk19",
   "message": "I regretted not learning languages while I was in my 20s. Not like it's super useful but I enjoy being connected with locals during my travels. Now in my 30s, I'm starting to learn a new language. It's never too late!",
   "created_utc": 1693235221,
   "score": 11,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3cgki",
   "message": "Giving uo on objectively good relationships because there may be better out there…. Nah its mostly shit out there dont be so quick to toss away something good\n\n\nStudent loans. Why you taking out six figure loans for a degree with little to no job market?",
   "created_utc": 1693232380,
   "score": 25,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2r44c",
   "message": "Oh, the glorious 20s, where optimism meets questionable decision-making! One common mistake? Believing that energy drinks are a suitable replacement for sleep. Another one is accumulating credit card debt like it's a collection of rare Pokémon cards. People in their 20s sometimes think they're invincible—financially, emotionally, and physically. But let's be real, even Superman had his Kryptonite, and for most of us, it's called 'Adulting.",
   "created_utc": 1693221803,
   "score": 41,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy30tcn",
   "message": "Just enjoy how quiet your joints are.  I didn’t even make it to 30 before my knees were cracking as I walked up stairs or my neck and back and jaw were making snap sounds as I did thing like reaching for the top shelf or yawning",
   "created_utc": 1693227146,
   "score": 34,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2r33q",
   "message": "Taking out credit or store cards and using them on non-essential purchases. Before they know it thry have 3 grands worth of debt.",
   "created_utc": 1693221785,
   "score": 15,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3kz4d",
   "message": "Get a shitty job and stay at it way too long.",
   "created_utc": 1693235776,
   "score": 9,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2s03m",
   "message": "Thinking that they have loads of time left",
   "created_utc": 1693222346,
   "score": 36,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3t6v8",
   "message": "buying a new car",
   "created_utc": 1693238889,
   "score": 7,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy2s5ph",
   "message": "Having kids",
   "created_utc": 1693222440,
   "score": 41,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy46kji",
   "message": "Have a kid with the wrong partner.\n\nOne of the most important decisions you will make in your life is who you have children with.  \n\nEverybody hates to hear this, but you will be JUDGED by others on how well you do this.",
   "created_utc": 1693243834,
   "score": 5,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy34uyv",
   "message": "Not planning for their 30s",
   "created_utc": 1693229067,
   "score": 19,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy33e4y",
   "message": "Not saving 20% of earnings. I did, I was able to stop working after a second stroke at 57 and doing fine financially 7 years later.",
   "created_utc": 1693228390,
   "score": 23,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3avow",
   "message": "Every $1000 you put into your 401k in your 20’s can be worth close to $10,000 in your 60’s with typical interest rates.",
   "created_utc": 1693231723,
   "score": 11,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3wlt7",
   "message": "Financial Foundation and Lifestyle inflation.\n\nYou generally have a pretty good upward career in your 20's, you'll cycle new jobs (hopefully) picking up pay raises. But you'll start to inflate your lifestyle and eat those raises. Don't do this.\n\nYou also general have the fewest liabilities early on, so it's a good time to set your foundation.\n\n* Pay Yourself First\n\nWhat I mean is when you get a raise/new job:\n\n1. Are you financially sound?\n * Not rich, not comfortable, sound.\n * Can you pay all your bills, put food on the table, and have a little bit left.\n * Basically are you not needing to take on debt to subsist. \n* Do you have an adequate emergency fund?\n * If not, throw your raise into a HYSA until you do\n* Are you maxxing your IRA?\n * If not, take your raise, and throw it into your IRA.\n* Are you maxxing your HSA? Assuming you have one.\n * If not, take your raise and throw it into your HSA.\n* Are you maxxing your 401k/403b?\n * If not, take your raise and throw it into your 401k/403b.\n* All done?\n * Cool you have options now\n * Invest in taxable accounts\n * Save for large purchases\n * Spend it up\n\nBy doing this you will be able to keep your lifestyle from inflating, and be financially sound for the future. I am 33, I have a fully funded IRA, HSA, and 401k. I have since I was 27. My retirement accounts combined are worth over a quarter of a million dollars, I own my own home, I have no debt. \n\nThis comes with sacrifices. I drive a 10 year old base model car with 200,000 miles. But it's safe, it's reliable, it's paid off. My house isn't the biggest, but it's the right size for my SO and I. I don't go to Europe or the Bahamas, or Hawaii every year, I have more modest vacations closer to home.\n\nBut I know if I lost my job, right this second, I could not work for an entire year, without changing my lifestyle, and still not touch my retirement accounts. If I went to a \"thin\" budget I could go 18 months. If I went \"austerity budget\" I could make it 2 years. There is a movement called FIRE (Financial Independence Retire Early) and I am an adherent. It sounds boring when you're 20. But I know people n their 30s who live paycheck to paycheck. Who don't save for retirement. Who are one downsizing away from losing everything. I never want to be that person.\n\nIn your 20s you need to take charge of your personal finances. And I'm here to help you.\n\n#[Praise be the chart](https://i.imgur.com/lSoUQr2.png)\n\nIf the chart is blurry, you're on mobile and \"conserving data\" try requesting desktop site. Follow that flowchart and you'll be much better off than your friend flaunting their new car, and trip to Spain, and iPhone 15 limited edition XLSPLus. Because you won't be in debt up to your eyeballs one missed paycheck away from bankruptcy.",
   "created_utc": 1693240162,
   "score": 10,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3gt4d",
   "message": "Not taking care of their body/teeth.",
   "created_utc": 1693234140,
   "score": 6,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3ibc5",
   "message": "credit card debt, trying to keep up with the joneses",
   "created_utc": 1693234732,
   "score": 6,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3lmq8",
   "message": "Having children",
   "created_utc": 1693236026,
   "score": 14,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3jl4z",
   "message": "Wasting good money on dumb shit. Don't go out and buy frivolous throw away junk, try to only buy things that are necessary, and when you do that, make sure you buy quality items so that you don't need to prematurely replace them.\n\nWith the amount of dumb stuff I wasted money on in my 20s, I could have utilized the money better and probably owned a second property which would have paid off handsomely now. Live and learn.",
   "created_utc": 1693235233,
   "score": 9,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3qpkj",
   "message": "Overpaying for cars.",
   "created_utc": 1693237954,
   "score": 4,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3x1v6",
   "message": "Thinking they need to have it all figured out. Your 20s are for exploring, learning, and embracing the messiness of life. Don't stress, it's your adventure zone! 🌟🌈",
   "created_utc": 1693240327,
   "score": 5,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3xjwf",
   "message": "A lot of people I have met in that age group seem to think that they are getting old and that th efun part of life will soon be over. That is not true at all. In your 20s you are still very young. You most likely have 70-75% of your life left to live. And the fun is not over when you turn 30. Life is only as and entertaining as you make it yourself. I am 35 now, and so far the 30s have been the time of my life. You are never too old to have fun.",
   "created_utc": 1693240518,
   "score": 4,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3zbn3",
   "message": "Valuing stuff over experiences.",
   "created_utc": 1693241179,
   "score": 4,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3zk8e",
   "message": "Buy a truck, motorcycle and a jet ski on loan before a mortgage",
   "created_utc": 1693241266,
   "score": 4,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3f6h2",
   "message": "Putting too much stock or intention into relationships. Getting married and having kids. Investing in the wrong career. Not finishing school. Not saving money. Not exploring more or experimenting more.",
   "created_utc": 1693233495,
   "score": 5,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3zh9j",
   "message": "Not travelling beyond their home country’s borders. Get out there, see other cultures and avoid becoming racist in your old age",
   "created_utc": 1693241236,
   "score": 6,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3fooj",
   "message": "Not investing",
   "created_utc": 1693233696,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3j8o6",
   "message": "Not staying in their twenties 😄",
   "created_utc": 1693235099,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3pd0d",
   "message": "In my case, not taking therapy when the signs, opportunities and support was all in place. Perhaps I wasn't ready for it or fully understood why I needed it.\n\nHowever, I can now say I have started therapy at 33.\n\nGive it a go. Take yourself seriously (the good way seriously ☺️).",
   "created_utc": 1693237446,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy41uyp",
   "message": "credit cards",
   "created_utc": 1693242114,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy48gof",
   "message": "Spending too much time “living in the moment” at the expense of setting yourself up for the future (e.g. focus on finishing school as quickly as possible, applying for scholarships, learning a trade, etc).\n\nEspecially if you grew up poor, you’re going to have to work twice as hard as your better off peers to have half of what they have. Accept that and reward yourself once the hard work is done.",
   "created_utc": 1693244520,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy65a73",
   "message": "Having children",
   "created_utc": 1693271758,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3cr9h",
   "message": "Getting black out drunk going to clubs hooking up with strangers looking for the one.",
   "created_utc": 1693232504,
   "score": 6,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3jq7u",
   "message": "\"rewarding yourself\" by taking on bad debt. I remember being in my late 20's and thinking \"I've worked hard to get my degree, working crap jobs for the last 10 years, didn't have kids, etc., I'm going to reward myself by buying a new $35k sports car. I deserve it!\" I was making around $25k/year at the time and renting. So dumb on so many levels. I wish someone would have told me how stupid it looks to have your new 2003 350z parked outside your apartment. It was a great looking car though.....",
   "created_utc": 1693235288,
   "score": 6,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy303kp",
   "message": "Getting married because they believe that’s what you have to do to be happy. Love your damn life! Get married later.",
   "created_utc": 1693226793,
   "score": 11,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3pp9z",
   "message": "You aren't going to make a shit ton of money anyway, so grow a balanced lifestyle. Too many people, guys especially, neglect their social (and emotional) development, hit their thirties, and are behind their peers.\n\nWork, but have some fun, especially the sorts your body won't tolerate as you get older. Climb that mountain, go sky diving, et cetera. \n\nAny of course, development of a rounded life and emotional base translates to more money down the line anyway.",
   "created_utc": 1693237575,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3l8tb",
   "message": "I’m still in my 20s but I think the whole process of getting married is a huge waste of money in early life. Weddings are expensive and that money could be invested instead. You can then use the money you made to comfortably have a wedding later.",
   "created_utc": 1693235879,
   "score": 5,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3g8xf",
   "message": "spend too much, save too little, and don't live a healthy lifestyle",
   "created_utc": 1693233920,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3jplz",
   "message": "Using credit cards for stuff you don't need and burying yourself in debt by 30.",
   "created_utc": 1693235282,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3kfqz",
   "message": "Not selling their personal data as a side hustle so they can have money saved up that was easy to maintain and gain.",
   "created_utc": 1693235567,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3mt1j",
   "message": "Take out massive student loans",
   "created_utc": 1693236474,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3pct9",
   "message": "Pete Davidson",
   "created_utc": 1693237444,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3v41l",
   "message": "Credit card debt and messing up their credit.",
   "created_utc": 1693239607,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3wp93",
   "message": "Party like it's 1979.",
   "created_utc": 1693240197,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3x1g2",
   "message": "Not saving money.\n\nNot proactively taking care of their health.  (I.e. when not activity sick/injured)",
   "created_utc": 1693240323,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy40uik",
   "message": "Not saving up money and worrying about what others think",
   "created_utc": 1693241739,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy41z3v",
   "message": "They think where they end up in life is heavily based on privilege anyways, so as a result they perceive the act of investing in their productive talents as being less profitable than it really is... and unfortunately this mindset occurs in precisely the period of time in their life where it could have a more profound impact in their total life. Instead of using their limited time on improving productive talents, they tend to spend this time engaging more in political endeavors like holding signs and shouting chants at the side of a road (or perhaps, right in the middle of the road).",
   "created_utc": 1693242158,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy47e3s",
   "message": "Thinking they know shit",
   "created_utc": 1693244132,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy48fxc",
   "message": "Thinking they will always be young and attractive",
   "created_utc": 1693244513,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy4hjtq",
   "message": "Staying in horrible relationships \n\nSo many young people (I was one) stick around despite abuse and control issues because “I love them” or “but I’ve been with them for 2 years already”.\n\nIt’s not worth it folks, if they’re abusive or controlling they won’t change, perhaps if they get dumped a few times they might eventually manage to come to their senses and be a decent partner but it’s not going to happen while they’re with you.",
   "created_utc": 1693247899,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy4knmx",
   "message": "Dating the same person for years thinking they have their soul mate. You truly aren't the same person at 30. Plan accordingly.",
   "created_utc": 1693249062,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy4l3vt",
   "message": "Not cooking enough at home. Delivery services and take out add up so much faster than we realize.",
   "created_utc": 1693249232,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5uew7",
   "message": "Not wearing a condom.",
   "created_utc": 1693267130,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5ureq",
   "message": "Living beyond their means.\nNot speaking up.\nNot valuing their time.",
   "created_utc": 1693267280,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5vfgr",
   "message": "Having kids",
   "created_utc": 1693267561,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5xcax",
   "message": "settling down… I don’t wanna be housebound by some dude lmao",
   "created_utc": 1693268380,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5xm8w",
   "message": "Not realizing the power of compound interest. \n\nNot taking initiative. Thinking that life is just something that happens to you and being passive about it. \n\nNot building relationships and networking.",
   "created_utc": 1693268496,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5xyfe",
   "message": "Staying at the same job missing out on better job opportunities, wasting time on bad relationships, not saving or investing money.",
   "created_utc": 1693268633,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy60n6j",
   "message": "Pregnancy",
   "created_utc": 1693269775,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy654z0",
   "message": "For me it was not saving money.",
   "created_utc": 1693271695,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy691mk",
   "message": "Not wearing a condom.",
   "created_utc": 1693273407,
   "score": 1,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3z8fc",
   "message": "Getting married. Wait for your thirties",
   "created_utc": 1693241146,
   "score": 4,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3klkb",
   "message": "Smoking and/or drinking too much.",
   "created_utc": 1693235630,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3k881",
   "message": "Get married",
   "created_utc": 1693235486,
   "score": 3,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy32gjb",
   "message": "Being alive .",
   "created_utc": 1693227947,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy37t0e",
   "message": "Student loans. Dreaming too big to take the best opportunity at hand. Not having already gotten to know themselves sooner.",
   "created_utc": 1693230397,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy420ga",
   "message": "Having kids",
   "created_utc": 1693242172,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy4ct76",
   "message": "Not maxing out their 401k",
   "created_utc": 1693246120,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy5pw06",
   "message": "Getting pregnant, going into massive amounts of debt and getting fat.",
   "created_utc": 1693265195,
   "score": 1,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy37wti",
   "message": "Thinking that because they are over 18, they are an adult. At a minimum, their brains are still developing, and their ability to drink, drive and have sex does not make them a mature human",
   "created_utc": 1693230445,
   "score": 2,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy3vjne",
   "message": "Procrastinating therapy. \n\nStop just *thinking* about going to therapy. Stop just *talking* about going to therapy; **Go. To. Therapy.** Look up therapists, arrange an appointment.\n\nI put it off for years because I just...didn't want to start the process. It wasn't even that hard to do (in the UK) £40 per hour sessions, job done.\n\nObviously if it's not financially viable that's not your fault, but if you think you need it, and you can afford it, do it!\n\nI went from *destroying* my living room cause I spilt a drink to being able to catch my negative thinking habits and be kinder to myself when I mess up.",
   "created_utc": 1693239766,
   "score": 1,
   "submission_id": "163jd3q"
  },
  {
   "comment_id": "jy486oa",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163jd3q"
  }
 ]
}