{
 "submission_id": "163ktl7",
 "title": "Who is the most insufferable asshole you’ve ever worked with?",
 "selftext": "",
 "created_utc": 1693225858,
 "permalink": "/r/AskReddit/comments/163ktl7/who_is_the_most_insufferable_asshole_youve_ever/",
 "score": 48,
 "url": "https://www.reddit.com/r/AskReddit/comments/163ktl7/who_is_the_most_insufferable_asshole_youve_ever/",
 "comments": [
  {
   "comment_id": "jy35oq1",
   "message": "[deleted]",
   "created_utc": 1693229445,
   "score": 137,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy2z7ft",
   "message": "Brian. Mother fucking Brian. Brian is an older dude -late 60’s at least. Very good ole boy mindset. Thinks his way is always right. Likes to talk about the China Virus. Tells people the equipment is just like a woman - you just have to fiddle with it to get it to work right. \n\nFuck Brian.",
   "created_utc": 1693226336,
   "score": 99,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy367if",
   "message": "Guy that I worked with on a cabinet door assembly line. One night we got done about 30min early and this guy throws a fit. How is he going to pay his bills if they send us home early ect ect. Two nights later we had to work about 45min late. This guy starts throwing a even bigger fit. No one helps us, whining we have to work overtime ect ect lol.",
   "created_utc": 1693229682,
   "score": 251,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy30ndd",
   "message": "David. When anyone went into David’s room, he would make them wait to speak to him, depending on how important they were. So his boss didn’t have to wait at all; his equals and his secretary would wait until he finished the sentence. I was the new start and sometimes I would wait ten minutes - and if I tried to leave, he would stop me and make me wait even longer. Fuck you, David",
   "created_utc": 1693227065,
   "score": 164,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy35o33",
   "message": "Craig. Bragged about how Christian him and his wife are, always doing good things through his church. Laid me off the day before my kidney biopsy ending my benefits. I was deathly ill, a single mom with a minor son at home to look after.",
   "created_utc": 1693229437,
   "score": 31,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy38gc4",
   "message": "So many Craigs in this thread but the Craig in my department is the sweetest old man I’ve ever known lol. He’s like 5’2 and 75 years old but he’s literally the friendliest person I know.",
   "created_utc": 1693230684,
   "score": 204,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy315wc",
   "message": "Colly. Boomer outside salesman who constantly threw inside sales people under the bus AND behind their back, hated by the entire office AND most customers. He didn't get fired until after I left that place, but multiple co-workers messaged me to tell me the good news.",
   "created_utc": 1693227319,
   "score": 59,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy2zbok",
   "message": "Incredible lazy guy, he had new excuses all the time be be away, relatives died, car stolen, train not moving etc. turned out all was just lies.",
   "created_utc": 1693226396,
   "score": 33,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy33w17",
   "message": "Linda. She threw a chair across the office after having an argument with another colleague as to who was working on a Saturday.",
   "created_utc": 1693228623,
   "score": 85,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy38rgm",
   "message": "Me, that fucker, always making work hard for me.",
   "created_utc": 1693230820,
   "score": 76,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy38wug",
   "message": "Well, I used to have a boss who openly stated he disliked me \"because I didn't say hi to him in Walmart when I saw him outside work\".",
   "created_utc": 1693230885,
   "score": 8,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy38yq2",
   "message": "Lady tried to get me fired and was totally harassing me - it backfired and she was escorted out by HR. I’ve been with my company for almost ten years now. See you never✌️",
   "created_utc": 1693230907,
   "score": 201,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy31dcn",
   "message": "I had a manager, who suffered from a major napoleon complex.  \n\nI know he was going to be \"special\" when before the Fantasy Football competition someone made a joke about themed team names like Quarinteam.  Of course he immediately signed up with Quarinteam as his team name, and only changed it after the pressure was put on him.  \n\nIf I ever asked anyone besides him a question (or even talked to anyone else) he would freak out.  Got upset when others (including the ceo) would ask for my opinion, and asked me to clear it with him first.  When I started bombarding him with the request I guess he sent me my job description, and asked if I fit it!  The best part is it was the wrong job description.  \n\nI also tried to transfer, and was given a lecture on how I was trying to undermine him.  I got told saying \"clear the calender\" met I didn't take him seriously.   Oh yea, and I was an onsite employee and he was remote.  As soon as I left he transferred departments, he undermined himself I guess.  I could go on for pages about this dickhead.",
   "created_utc": 1693227421,
   "score": 28,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy32hmo",
   "message": "He had pneumonia. Coughing up his lungs at his desk every day. Had over four hundred hours of sick leave but refused to use it. The woman across the cubicle wall from him was pregnant at the time and it was not something she wanted to be exposed to. Our management said they were powerless to make him stay home.",
   "created_utc": 1693227962,
   "score": 61,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy2yppz",
   "message": "Some white dude who said he was Native American almost every day for a year. He got his dna done. He wasn’t native.",
   "created_utc": 1693226082,
   "score": 36,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy37hbj",
   "message": "Chet",
   "created_utc": 1693230253,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy37jzp",
   "message": "Chef Jimmie Snede",
   "created_utc": 1693230286,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy37v0e",
   "message": "Ivan the bastard",
   "created_utc": 1693230422,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy37v48",
   "message": "I worked with the owner of the company, named Virgil.",
   "created_utc": 1693230423,
   "score": 16,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy390bh",
   "message": "Dave.\n\nDave is a guy who thinks he’s much smarter than he is. He’s been with the same company for 20 years and has worked his way up the ladder at a small company, where he now leads Operations.\n\nHe’s a control freak and micromanager and this job is pretty much all he has in life. He will do anything and everything to block progress and innovation and will ruthlessly stab anyone in the back who gets in his way. \n\nSometimes I have pity on Dave because this job is as good as it’s ever gonna get for him. I’m gonna leave this job soon and move on to better things, but Dave’s gonna be doing Dave things until a heart attack or kidney failure takes him out eventually.",
   "created_utc": 1693230926,
   "score": 25,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3b8kn",
   "message": "I work on my own a lot of the time, so I guess that would make me the insufferable asshole by default.\n\nNot that I'd disagree with that assessment.",
   "created_utc": 1693231874,
   "score": 57,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3bpqt",
   "message": "Eva\n\nShe was the person above me in the hierarchy when I was manager\n\nMy team was great; they were hard-working and loyal\n\nShe was constantly belittling me in front of them (to the point, they were ashamed for me about how she was treating me)\n\nShe was thrilled to spy on us from afar\n\nShe loved to be frightening toward my team:\n\nletting them think they were in difficulties in regard to the brand and might have to face disciplinary consequences when they were, in reality, not at all in trouble (and no, it wasn't a certain type of humour: she just loved being powerful over others and feel them tremble)\n\nand, obviously, she was the kind of person who enjoy to say no just because they could:\n\nshe spent my time there to dismiss the nice, but well-deserved, things I asked to gratify them (days off/ raises/ responsabilities)",
   "created_utc": 1693232073,
   "score": 8,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3cfkg",
   "message": "A sales manager, who was one of the brothers in a family business I worked for. He screamed at everyone all the time and had a superiority complex. Everyone walked on eggshells around him. He would dictate to me and make me write down his emails to clients word for word and then have me type it up for him to approve. He’d literally scream at me and say that what I’d written was “low class” and demand I redo it, and he’d tell me how to redo it, and this would go on and on through multiple drafts, and somehow it was always my fault that he didn’t like his own words. If I made any changes to make it better he’d yell at me because I’d made changes. I was not his administrative assistant, by the way. I finally couldn’t take it anymore and I quit after a few months. They wondered why turnover was so high there.",
   "created_utc": 1693232369,
   "score": 13,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3cs23",
   "message": "When I was starting out with steelwork my boss was a great guy and really taught me alot and while I'm not the best in the world alot of people I've met woth different crews give me alot of respect and praise for my know how and ability.\n\nMy boss learnt how to do steel work in this guys family business, they treated him and everyone else like shit, after he learnt enough he went out on his own and made a pretty good company and found great success. The owner of his old company used to bad mouth him, call him a traitor, even pull up on his jobs and just deathstare him from the road etc. Real wanker stuff.\n\nFast forward. My boss sold his company for a tidy profit and changed careers. I'm working for a company that we did work for and hired me immediately when I let them know I was looking around... and then came Joey, the son of my bosses old workplaces boss. He was older and in his 60s and I tried my best to get along with him but he was a cruel older man and every chance he got he'd badmouth me to coworkers, to my bosses, anyone who would listen. My coworkers and bosses would laugh it off and tell me about it and let me know it's not like they even listen to him but I could be on any job and if I so much as said \"let's start at this end\" he'd be on the phone to anyone that would listen and could be heard calling me a boy and an idiot etc.\n\nNow I did have some all out arguments with him but I swear I was also pretty nice to him. He couldn't read very well and I knew it so I'd help him with forms and stuff and help him not get embarrassed by admitting he couldn't read. I would teach him how to shoot heights using a laser and wouldn't gossip or try to embarrass him if he got it wrong etc. When we got along I really liked him but he would just turn really nasty at the drop of a hat and I always just suspected it's because he thinks my old boss taught me and to admit I'm good would be an affront to his family or something.\n\nOne day he misunderstood and thought we all got cartons of beer for a lift we did for some plumbers and all out accused me of being a lying sack of shit no matter how many people explained he was wrong. He quit the company.\n\nThen one day I heard he has got a cancer scare and wanted to talk to me (I had the same type of cancer before I started at the new company) and me, trying to be good called him up to talk to him. He mentioned he felt bad about the beers episode but didn't apologise. We made up and he came back but soon just started twisting the knife in me every chance he got and I just honestly gave up on him. Like I've always thought that you can typically win anyone over, but this guy was just immature, petty and mean spirited.\n\nApart from that... he used to sabotage jobs to make them last longer. Not many people could pick up on it but I could. \n\nReally just took a nice part of me and removed it forever, I feel stupid for thinking it was worth trying.",
   "created_utc": 1693232513,
   "score": 73,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3ctce",
   "message": "I worked with two of them at the same place.  And our company was only 12-14 employees at any given time.  It's like the anti-jackpot.\n\nEmployee 1:  He was an older guy.  He would make racist jokes all the time.  He also would play his country music out loud, which was very distracting.  He's also try to whistle to the music but couldn't carry a tune nor follow a melody.  He was an awful whistler.  I'd be on the phone and he would turn his music louder just to be a dick.  I don't really get offended about anything but I know what is/isn't appropriate in the workplace.  He once made a joke about Jews and I jokingly put an HR complaint form on his desk.  My other coworker knew it was a joke and laughed about it.  Well this guy got upset and called me a piece of shit.  So apparently he likes making jokes but doesn't enjoy it when others make them.\n\n\u0026amp;#x200B;\n\nEmployee 2: This guy was a year younger than me (early 30s at the time) and other coworkers would comment about how they always thought he was a lot younger because of how he acted.  He would also play his music loudly, but it was EDM.  He really liked the Baby Einstein's theme techno remix.  He'd play that often.  He would also whistle to it but he was just as bad at whistling.  He would also always comment about how manly he was and how fit he was. The guy was scrawny and didn't even do anything considered traditionally manly.  He just thought he was manly because his wife did EVERYTHING for him.  Made his breakfast, lunch, and dinner and cleaned everything.  He'd also brag about how he never would get offended by anything.  He once referred to himself as a Paki and I asked him about it since I've known Pakistani people who claimed that was a slur.  He agreed it was and told me his sister wanted him to stop saying it but he didn't think it was an issue.  I would think that using a word your own people find offensive would be an easy thing to stop doing but he thought everybody just needed to get over it.",
   "created_utc": 1693232527,
   "score": 31,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3cxaa",
   "message": "Sierra. Sierra knew the answer to every single question, had better ideas than you, had done more than you had done, tried everything that you thought of, seen more a problems than you had, and just all around was an insufferable know-it-all. Everything had to be done exactly the way she wanted it to be done even if it didn't need to be done that way, it still had to be done that way because that's the way she wanted it. She micromanaged everyone around. I was so happy when she moved to a different job.",
   "created_utc": 1693232572,
   "score": 109,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3d6xo",
   "message": "I worked for a company that paid you for the mileage for using your own car.  They found out someone was logging hundreds of hours a week unnecessarily to get paid.  I logged my time, but cheated myself out of 11 miles (.23 cents per mile) due to inverted last two digits.  The manager wrote it up, documented and sent it to the home office.  Didn’t make any attempt to reimburse me.  \n\nSame company.  I was getting bonuses for being the top sales rep. every month.  The manager fired the rest of the sales reps.  Called the home office and told them I didn’t deserve the bonus, because there was no competition.   He collected a bonus every month for keeping the hours low.",
   "created_utc": 1693232684,
   "score": 127,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dc93",
   "message": "An incompetent mid-level boomer manager who's 20 years older than me.\n\nHe performs his tasks with the simple click of a button. If there's anything requiring his approval, he approves it without even reviewing it. When someone asks a question, he forwards it to me for an answer. He's like a transparent window – everything that comes his way simply passes through. He doesn't provide any added value whatsoever, making him more of a liability than an asset to the company. \n\nUnfortunately, his own manager doesn't seem to care. Any errors or missed deadlines are always attributed to me, yet I never receive credit when tasks are completed successfully. \n\nAfter a year, I decided to resign. I tried to have him removed from the company by raising my concerns to the senior management. I refused to continue tormenting myself by doing his job.",
   "created_utc": 1693232745,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy30gvq",
   "message": "Craig.  He would fuck things up and forge my initials on the inspections so I’d get in trouble for it and no one would believe me.  Stupid Craig with his M frames and Chevy Beretta.",
   "created_utc": 1693226979,
   "score": 17,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy34qgm",
   "message": "Rich: This sales guy that got promoted to mid manager back in 1992.  I got laid off right after (coincidence?) and was actually glad to be done with that drunk, misogynistic, evil, lying prick.  \n\nGot rehired in 1999 and he came up while catching up.  Turned out he was a coke fiend at the time and got fired for blacking out at an intersection.  His wife left him and took his kid.\n\nTold the person to point out the street he's sleeping on so I can piss on him.",
   "created_utc": 1693229009,
   "score": 23,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy31prp",
   "message": "Meh gym teacher turned entitled school admin who took credit for every initiative he ever stole. Even wrote a book about it, then had it be required reading for all HS students. He'd seem to die on every wrong hill, but the Board would treat him like a god rather than have to launch a candidate search. When I quit, I suggested he collect only the best of himself and be a smaller fish in a bigger pond because he had burnt all the bridges here when it was the other way around.",
   "created_utc": 1693227588,
   "score": 2,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy32dif",
   "message": "my boss",
   "created_utc": 1693227908,
   "score": 2,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy34ux7",
   "message": "For 17 years, I worked with a guy who had spent many  years in his youth taking class A recreational drugs and so suffered from psychosis. He would be fine one minute and then fly into aggressive temper tantrums the next. He would get drunk of an evening and then send threatening and abusive text messages to friends, relatives and work colleagues . The next day he would act as though nothing had happened or pretend he knew nothing about these messages.  As an example of his mental state, one lunch time he flew into a rage because he claimed that I was eating too many crisps ( potato chips).",
   "created_utc": 1693229067,
   "score": 2,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy37b1q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy2ykms",
   "message": "Guy called Nick Black, total a-hole!",
   "created_utc": 1693226007,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy31j2l",
   "message": "my boss was a certified mandarin inspector and he always pulled up mad at me cuz i was chillin\n\nthere was this really weird bloke too who only spoke about sex he was like 60 it was very strange i hated him a lot i had 2 tell him 2 fuck off eventually\n\ni met a lot of wonderful people at work as well who i love",
   "created_utc": 1693227499,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy32tfr",
   "message": "Store manager, who turns out used to work in the veg department of one of the big stores previously. He knew nothing, did nothing. Played on Paint in the office instead of actually managing the store.",
   "created_utc": 1693228119,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy32xlf",
   "message": "Micheal lutes Kansas City MO.  he took a photo of a girl \nAt age 15 (he was 15). At age 22 he was showing off that photo. He used pull his piercing out from his balls and show it to everyone (his piercing itself not his balls.) he also was known for jacking off at work. He currently work a DAV, which his life long friend manages.",
   "created_utc": 1693228173,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy359qz",
   "message": "Jean-Marie. A really nasty man, always looking for a verbal fight. If you said black, he said white, if you then said white, he said gray... Mosogynist, lazy, would only do what he want, would try to correct his coworker/manager in front of other people, annoyed so much people trying to find one who was neutral was hard...\n\nI work for an kind of govermental office. It employs \"fonctionnaire\" who are civil servants with a non breakable contract, obtainable by competitive entrance examination. He was one of them, almost at retirement age when he became my colleague. He was tranfered from the field work he did as a disciplinary action, because he decided to change the content of a batch of wood after it was sold to a sawyer.\n\nHe couldn't get fired because of his contract, so he was transfered to the office, to work as an \"assistant to the director\". His colleagues on the field were so happy that he was transfered that they made a farewell party (without him). He was then affected to the records and to the land registry. As such, he had to work with the person in charge of the land registry. But as he was not directly under her command, he never really followed what she would say. He even tried to correct her reports...\n\nHe waited until the last minute to retire (he was 61 when he was transfered, and 66 when he retired). As he ouvertly said : \"I will stay as much as I can to be a pain in the bottom of every body\".\n\nAfter he retired, he continued to come to the office for almost a year to use the printer for an association who is anti my company, and to copy confidentials documents... It continued until we had a new director who menaced to sue him.\n\nI tried to be civil with him, but stopped even speaking to him (outside work) after he told me that numbers can be twisted to say anything, after I showed him a scientific paper that was proving something against his beliefs.",
   "created_utc": 1693229256,
   "score": 17,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy38kge",
   "message": "Walter. He was like the example of the worst human being. He was so fake at life and being a human. He treated his gf as a s\"machine and would say about her parents\"they let me fuck their daughter, they feed me, drive me to work and provide a house\" how lucky did he have to get for that? Dude was homeless before that.",
   "created_utc": 1693230734,
   "score": 24,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy38ubj",
   "message": "Dude named Clay.\n\nPronouns me, myself, and I.",
   "created_utc": 1693230854,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy39b9q",
   "message": "I sold fine wine for 20 years. Would you like a list?",
   "created_utc": 1693231059,
   "score": 124,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy39dap",
   "message": "I worked with a girl who kept telling the manager that I confided with her that I didn’t like certain colleagues. \n\nShe got me in trouble and what’s worse is I never said any of those things. \n\nI think she had problems with these people and she was trying to show the boss others didn’t like them either. I can’t tell if she was so stupid that she didn’t realise that I would get in trouble or if she was just a horrible person.",
   "created_utc": 1693231083,
   "score": 10,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy39em8",
   "message": "Retail paint store manager in New York. \n\nKept porn mags in the restroom. \n\nAsk male employees if they wanted to earn 5 dollars fast while lowering his zipper. \n\nWife divorced him over this, but upper management would address it.",
   "created_utc": 1693231098,
   "score": 5,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy39w5o",
   "message": "This guy named Luis at a package delivery company. He literally took a training guide I'd written, ripped off my cover page, and handed it in as his own.",
   "created_utc": 1693231305,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy39xlo",
   "message": "Sales manager. Lied to reps, customers, boss, and me.  Tried to get me to do his job, and got passive-aggressive when I didn't.  Cheated on his wife, married the side-piece, then ditched her for a younger woman, because of course he did.  Spent more time on his Civil War re-enacting (Confederate) and Tea Party politics than he ever did working.",
   "created_utc": 1693231322,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3ac39",
   "message": "Had to be me that’s why I quit.",
   "created_utc": 1693231495,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3agof",
   "message": "My new current 2 bosses. Both complete idiots. Both of them ask me questions that shouldn't be asked to the lowest ranking employee in the group. They ask me how to run metrics, how to respond to clients, etc. I suspect they do this because my higher ranking teammates will judge them. This alone doesn't make them assholes. What makes them assholes is they load me with a ton of work (enough for 5 people) and then complain to me that I'm not meeting metrics. I had no problems meeting metrics when I was under my old boss. If anything, I exceeded my metrics. If I get fired for this, I'm filling a wrong full termination suit. I have all the screenshots ready",
   "created_utc": 1693231547,
   "score": 109,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3amjx",
   "message": "Coworker when I went into management. Proceeded to make life hell when he thought he could preach while at work, pissing off over half my staff.",
   "created_utc": 1693231615,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3arp3",
   "message": "There's this dude in accounting that doesn't seem to know when to stop talking. And by talking I mean bragging. Loves to tell everyone how much he spends on everything. New truck, 90k. New pool, 130k, medical bills, 30k. Says it's no big deal as he just writes it all off on taxes and gets it all back. I think there's maybe 1 or 2 people in the building that generally like to hear what he has to say, most just zone out or talk to other people. I was listening to him talk about what to get his son as a first vehicle and he seemed dead set on buying a brand new sports car...",
   "created_utc": 1693231676,
   "score": 38,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3b0xe",
   "message": "Matt, the new VP of operations decided that everything about our company needed to change, including undermining my role, essentially taking over my team, and started implementing these incredibly micro managing processes that nearly halved our productivity, then blamed it all on me. He then proceeded to place our junior as the team lead and left me on my own island. It really felt like he was trying to get me to leave and well, he got what he wanted. Fuck you, Matt.",
   "created_utc": 1693231783,
   "score": 83,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3b46n",
   "message": "A gen-ed teacher who refused to acknowledge the ESL students in her second grade class. \n\nShe would pretend to not understand the ones that were pretty much fluent in English. She never translated anything for the parents despite me showing her how to copy paste in Google translate. She ignored the adjusted grading scale for new immigrant non-English speaking students. She also refused to say their names correctly, instead using anglicized versions of their names (example: Juan became John). \n\nShe never came back to work after spring break and nothing of value was lost.",
   "created_utc": 1693231822,
   "score": 243,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3b988",
   "message": "Angela.  Everything in her life must be related to the fact she has a husband.  We've seen the dude, he looks like the word \"nerd\" was condensed into a person.  \n\nIt gives \"I'm better than you because I'm married vibes.\"",
   "created_utc": 1693231881,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3be7w",
   "message": "Not really an answer but a bit of advice. You're either helping someone achieve their dreams or they're helping you achieve yours. Break the cycle and achieve your dreams peeps! Much love on madness mondays",
   "created_utc": 1693231938,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3bpjv",
   "message": "I had a boss who didn’t give a fuck about anyone but her.  She wanted to be CEO and would do *anything* to get it.  \n\nWe once worked the Saturday between Good Friday and Easter. She had young kids and DID NOT KNOW it was Easter weekend. I am not a religious guy but that’s ridiculous.",
   "created_utc": 1693232071,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3bvb5",
   "message": "Some jackass that wanted me to do his job. Apartment maintenance. Spent a lot of time fixing his mistakes.",
   "created_utc": 1693232137,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3c8qu",
   "message": "Probably myself if I'm honest 😂",
   "created_utc": 1693232291,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3can4",
   "message": "Kevin. He knows what he did.",
   "created_utc": 1693232313,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3cee7",
   "message": "There was that one morning after too much Indian food that my asshole was insufferable.",
   "created_utc": 1693232356,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3cuji",
   "message": "My previous boss.\n\nPigheaded, angry piece of shit. Cheated on his taxes, cheated on his wife, sold his first child (not sure of the credibility of that), racist, misogynistic, smoked in the office (sat 10 feet from me), constantly farted in my general direction. \n\nHe died of cancer and left his business in shambles for me to clean up without the well deserved pay. I do not have any remorse about him passing away.",
   "created_utc": 1693232541,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3cyqs",
   "message": "Elon Musk",
   "created_utc": 1693232589,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3d02q",
   "message": "another support worker at the house i currently work at, she’s mid forties and the rest of the team is young 21 and under so she speaks to us all like we’re five and has the attitude that cos she’s worked in care longer than we’ve being alive so she knows all. reality is she doesn’t know shit and can’t even cook. she constantly asks questions and says she didn’t know something even tho it’s written in the files. once she asked me what one of the service users last name was despite the fact her housemate says her full name every time",
   "created_utc": 1693232604,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dgc0",
   "message": "A guy had a crush on me and worded it weirdly to me that he was thinking of leaving his gf and kid for \"someone else\" literally describing that 'someone' with my hair color and personality traits. It was obviously me, we kind of flirted sometimes but I didn't know he had a gf or a kid. He was 19 and had literally never brought them up in 5 months of knowing him... But I told him he should stay with his gf and kid, that would be terrible to tear the family up. And he was like \"Yeah but it happened when we were so young, and we aren't in love\" etc etc. but I said no, you should stay with them. (plus I am in no way looking to get involved with someone with kids, at 18..) Shortly after a rumor started that I was trying to make him leave his family for me. The girl who worked in cosmetics was this massive goth mommy who started being mean and complained about me openly in front of our boss. Or just blatantly insulted me sometimes in group meetings. I think she came off worse than I did for that though. And generally my coworkers started all being awful. One of my coworkers who was new came up to me and told me she overheard him and he was the one spreading all the rumors and it confirmed to me it was all him. (I thought it could've been the goth girl too since she was a close family friend of theirs, hated me, and maybe saw us flirting ((which I stopped immediately after knowing he was super taken))). But yeah. Fuck that guy. Poisoned like 5 coworkers against me. Maybe even my boss too, they were chatty.\n\nMy boss was also insufferable though. One coworker would go \"I C 10\" to signal a hot girl so he could come and ogle her and flirt with her at the front... It was awful and obvious, and fucking creepy.",
   "created_utc": 1693232792,
   "score": 10,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dojy",
   "message": "My father",
   "created_utc": 1693232886,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dqur",
   "message": "Rene. Motherfucker got hired to manage IT because he was friends with the CIO. Told everyone in a meeting that he had decimated IT departments before. Micromanaged the shit out of everyone. I couldn't get out of there fast enough after he started.",
   "created_utc": 1693232913,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dr4g",
   "message": "Guy named Jake. After I left that job within a year I heard he caused a bad accident while drunk that killed one of his friends. Last I heard he was doing some time for it.",
   "created_utc": 1693232916,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dt2z",
   "message": "Anyone in HR. They are there to save the company from legal issues, not for your benefit. HR is the biggest BS scam. They tell you everything is confidential but it's not. They are trained to screw the employees over.",
   "created_utc": 1693232937,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3duku",
   "message": "The entirety of the Korean family business I worked for.",
   "created_utc": 1693232953,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dz8r",
   "message": "Worked for a franchise owner that used me like an old rag.  He ended up getting murdered in what was described as an execution style killing.  Left me with strange feelings.",
   "created_utc": 1693233006,
   "score": 13,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3dzi5",
   "message": "One of my current supervisors. She is a deeply unhappy and obnoxious person. She talks down to everyone. She yells at the older associates when they're too slow for her liking. I'm gathering evidence and I may report her if the last reprimand from management doesn't stick.",
   "created_utc": 1693233009,
   "score": 5,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3ea05",
   "message": "I never thought about it but this thread made me realize that I've never NOT gotten along with a coworker. Maybe I'm the insufferable one and never knew it.",
   "created_utc": 1693233127,
   "score": 5,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3efur",
   "message": "My old boss was convicted felony exploitation of a vulnerable adult. Turns out he was a POS outside of work as well.",
   "created_utc": 1693233194,
   "score": 1,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3pjem",
   "message": "At my old job, my boss would give me difficult projects from difficult clients. When I finished the project, she would go into the system and add her initials (whoever does the work has to initial after every step) and take off mine. \n\nThen she would go to her supervisor and be like, \"Look what I did! Hehe!\" And she would get all the credit. When I finally figured out she was doing that, I wouldn't let her know when I was done, and I would personally submit my work to her supervisor. \n\nHis mind was blown that I just \"magically picked up the work so effortlessly,\" and I got promoted lol.",
   "created_utc": 1693237513,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3euh5",
   "message": "I can think of three. \n\nLaura…insanely competitive with the nastiest attitude imaginable. She would throw anyone under the bus to get ahead. She also had no control over her emotions, often crying in the middle of the office and raising her voice to anyone who undermined her know it all personality. She still works at my company but in an unrelated department THANK GOD! \n\nAngela…perfectionist who made everyone’s life a living hell if things weren’t done to her liking. Rude, extremely critical and condescending. Acted like an angel in front of upper management but to contemporaries/lower ranking employees she was a nightmare. Insulted me and others many times…no longer work with her directly but still hate her. \n\nChristina…the worst of them all; power hungry manager I had several years back. Her demands were insane and she would belittle and scrutinize us under the guise of “elevating” our roles (needless to say this included a lot more work, stress and conveniently no more pay!). If you even sent an email she didn’t like she’d pull you into an office and berate you for “unprofessional behavior” or something to that effect. Luckily management disliked her difficult nature and several employees quit under her leadership and HR got involved due to some scathing exit interviews. She was on a work visa from another country and the company did not renew it. \n\nI work with some other difficult people but these three took the cake. Unimaginable how people could act this way.",
   "created_utc": 1693233359,
   "score": 156,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3kyvm",
   "message": "Worked for a manager for about 6 years. In that time probably was told I was doing a good job a handful of times. I worked my butt off and always took his feedback to heart and tried to improve. He had an impossible expectation of perfection and never gave me anything above a good rating on annual reviews. I liked the company and people I worked with so I toughed it out. He eventually retired and since he left all of my reviews have been above expectations without any change in my work or attitude. I work just as efficiently as I did before but the new manager that was hired actually recognizes my work contributions.",
   "created_utc": 1693235773,
   "score": 34,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3hipl",
   "message": "My wife worked with Vivek Ramaswamy. She said he was an insufferable douchebag. Does that count?",
   "created_utc": 1693234419,
   "score": 83,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3gud2",
   "message": "Sunshine - her name does not denote her. \n\nOne of the most insufferable micromanagers I've ever had. \n\nI'm in tech and eventually was placed within a client's office 5 days a week because they were big and needy. I had to be on a video call with Sunshine the entire time I was there. If one of the user's there came up to me and I needed to go to their desk, if I didn't let Sunshine know first, I'd get a \"where were you? I needed you and you weren't here\" message. Every. Time.\n\nIt got to the point where I started being very specific with where I was going. \"Sunshine, I'm going to take a piss. Hope it's ok, be back in about 2 minutes if the dryer is slow in the bathroom\". \n\nSo so so happy I quit that place",
   "created_utc": 1693234154,
   "score": 12,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3nwj9",
   "message": "My last boss. Though he did warn me before accepting the job that he was a huge asshole.",
   "created_utc": 1693236889,
   "score": 11,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3q0ec",
   "message": "I worked with an insufferable know it all that was an expert in everything, would repeat the same thing 20 times in a sentence. Would constantly say how right she was (even if she wasn’t) or a stream of “I told you so”. She couldn’t do anything wrong, always someone else’s fault. \n\nAnd she’d remind people that she never actually needed to work as her husband earned loads. Would constantly get newer items as things would “bore her”\n\n\nNobody liked her, even cleaning sites would tell her to leave because of how full of shit she is.",
   "created_utc": 1693237690,
   "score": 9,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3nqrn",
   "message": "I’m working with him now. The guy is one of those who refuses to do the most basic parts of the job and then whines like a 5 year old when he gets called out on it. He’s great when you give him a project to do but then he uses that as an excuse to not do anything else he’s supposed to do. He’s also a one-upper and so freaking obsessed with himself he probably has sex like that scene in American Psycho where he does poses in the mirror. And last but not least the guy is a misogynistic asshat and racist. Unfortunately we’re always short staffed so he’ll probably never be fired. He keeps talking about finding a new job but with his attitude I doubt he’ll ever get hired anywhere.",
   "created_utc": 1693236828,
   "score": 8,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy40b4f",
   "message": "Barry. The guy took over his father's business and ran it into the ground and ended up working for the company I was at because he owed them so much money. \n\nHe was lazy as fuck and pissed off every customer who dealt with him. \n\nHe would hide in the heated bays in winter. He would get bitchy anytime someone used the smaller forklift.\n\nIt was damn near impossible to get anyone to work with him because he pissed off co-workers so much. \n\nAFBFU became quite common  as a double-check statement on the orders he did build for our deliveries (Always fixing Barry's fuck ups)\n\nWhen anybody in the yard was let go, the first question always asked was, why wasn't it Barry.?",
   "created_utc": 1693241541,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy445ua",
   "message": "My last bosses. One would yell at me, in front of customers thus making me cry, for upwards of 20-30 mins at a time. Other boss criticized my looks and the way I dressed (I bought $250 worth of new clothes, money I didnt have btw, when I started working there but that wasn’t good enough I guess), and also made me cry. They both couldn’t figure out why I wanted to quit on the spot one day, yelled at me more, then got me to stay another week cause I’m a weak ass bitch. So long, and fare-fuckin-well!!!",
   "created_utc": 1693242965,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3phls",
   "message": "Guy I worked with at a help desk.  He was an absolute ass to all his co-workers and his management.  He literally shoved a manager once and didn't get fired.  He would bully and belittle anyone he felt was dumber than him (spoiler alert, this meant everyone).  That didn't get him fired either.   People gave him crap once because he had like 9 kids.  Went to HR and complained about that.  We got told that we were not allowed to make fun of him at all for any reason.  He continued to give us crap about everything.  People on the team finally got sick of it and just froze him out.  Refused to speak to him unless it was work related.  He went to HR and complained about it being a hostile workplace. We got griped at about that.  At least three different managers went to HR and tried to have him fired.  HR wouldn't fire him because he actually got widgets made.  They claimed that him not getting along with anyone was not a valid reason to terminate an employee.  Meanwhile he gaslit the living crap out of anyone who would listen to him and other people in the company thought our team was filled with a--holes who just tormented this guy for no reason whatsoever.  Management started doing anything they could to make the job uncomfortable for him hoping he'd quit and he went to HR every single time and got management yelled at every single time.  Eventually he finally got tired of it and quit.  Then he pretended we were all his best friends and talked about how much he missed his \"work family.\"  I hate that guy so much.",
   "created_utc": 1693237494,
   "score": 14,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3gjdx",
   "message": "My ex manager at work.\n\nWe had a company wide online class about the latest anti corruption policies and rules.\n\nShortly after my Manager asked a coworker of mine, on a hot day when few customers came in, If he would help him move a shelf from one of the garages into the managers car. If he helped Clean it beforehand, he said coworker can leave early If he wants. He happily said yes and then they left. Next week coworker was fired because the Manager reported him as a corrupt employee who failed his \"test\". That Guy worked there for like 8 years and then gets treated like that. Wtf.",
   "created_utc": 1693234033,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy43vvq",
   "message": "A loud, black, obnoxious Trump supporter in 2015. Telling everyone and their dog how he was going to win and how amazing it was going to be. Every single day.\n\nWe're both Canadians, in Canada btw.\n\nWe were contractors and when our company lost the contract, I was hired on with the new company. He was not.",
   "created_utc": 1693242864,
   "score": 11,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3fnop",
   "message": "Ex-boss. Sociopathic narcissist, everything good was due to his leadership, everything bad could be blamed on someone/something else, held grudges, very disciplinary-oriented from a “challenging him” perspective (i.e. to dare to express an opinion), tried to turn staff members against each other…. I could go on.\n\nFinally gone after six years.  (He rage-quit when he didn’t get a promotion.  Went to another job, got jack shit done and quit on them too a year in.)\n\nA genuine total piece of shit.  A bunch of us have already planned to show up at his funeral smiling and ready to party down once he’s gone.",
   "created_utc": 1693233686,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3gxkm",
   "message": "Sarah #1. After Sarah came into power, about half the employees left. She made people so miserable they retired early. If she couldn’t fire them (union) she demoted and humiliated them (they won settlements fortunately). When Sarah finally left, upper management mourned her, decided that she must have left because they didn’t give her enough vacation time, and hired someone she recommended to replace her. Apparently the new person is even worse. The few hardy employees who made it through Sarah’s reign are now fleeing.  I don’t know the new lady. I left as soon as I could. Also, Sarah is apparently creating chaos at her new workplace. Job openings have increased and a friend who works for a company that contracts with Sarah’s company says she’s still as difficult to work with and crazy as before.",
   "created_utc": 1693234189,
   "score": 5,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3ke5z",
   "message": "Everyone knows a 50-60 year old asshole named Craig it seems.",
   "created_utc": 1693235550,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3o5gh",
   "message": "I worked for a chain of restaurants called Austin Java in Texas... After many years of fun times and good food and great people the owner decided to put his nephew in charge of EVERYTHING. His name is Omar and within a few months literally every employee quit and they had to shut down. He was the most obnoxious asshole ever!!! Napoleon complex wannabe Gordon Ramsay azz..... literally screaming and cussing at employees in front of children at a family brunch spot! I hope his family is ashamed of him and I hope he lives a short miserable life. I bet he got a small dick, you can just tell.",
   "created_utc": 1693236984,
   "score": 6,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy5946c",
   "message": "The ones that never STFU. Like, ever.",
   "created_utc": 1693258190,
   "score": 5,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3eqxg",
   "message": "S. Would literally backstab you in daylight. Thought she was always right and needed to \"help\" everyone else. Condescending as fuck, but a political snake, so total ass kisser. Caught her in several outright lies and falsified work that had to be redone or just wrong. Talked over everyone in meetings and always had to have the last word. Is now a people manager.",
   "created_utc": 1693233319,
   "score": 9,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3ge7o",
   "message": "most dentists ive worked with. pretentious, chip on their shoulder about not making it into med school. power trip. always trying to show their superiority.",
   "created_utc": 1693233977,
   "score": 4,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3lkmq",
   "message": "John. Fuck John. He was my boss, never missed a day and thought nobody else should either. He was sick, came in and laid on the floor behind his desk. Huge snowstorm, walked to work though it took an hour. Then got pissed when I told him my car slid out of control going down a hill outside my subdivision but I managed to get turned around and go back home. Apparently I didn’t try hard enough.  So many ways he was a total dick and just didn’t understand why he never got promoted. I was so glad when he finally left the company.  Get fucked, John.",
   "created_utc": 1693236004,
   "score": 5,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3nlvm",
   "message": "Unfortunately no matter what the job there's always at least one",
   "created_utc": 1693236777,
   "score": 3,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3r93t",
   "message": "SSG Jon Davis, US Army, military police.\n\nGuy was the biggest prick, unparalleled.\n\nProbably the only person I despised as much as I despise Trump.",
   "created_utc": 1693238159,
   "score": 4,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3tbb5",
   "message": "Gretchen. Worked in a small office (5 people). To save money, I kept things to make a sandwich (bread, cheese, etc) in a designated drawer in the office fridge. Noticed these things would disappear, even though I didn’t need them. Finally saw the package in her trashcan and said something to her. She got really upset, went to the boss, had to have a sit down. “Gretchen was really offended you accused her of stealing your food.” Had to apologize to her directly. When sitting down with her, she said she got really upset because when she was a kid people would accuse her of stealing things all the time. That’s because you did, Gretchen!",
   "created_utc": 1693238935,
   "score": 3,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy3nkbw",
   "message": "Dude from Africa. He would not look at me or speak to me because I was female and he was apparently some sort of royalty back in Africa. Twat.",
   "created_utc": 1693236760,
   "score": 4,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy4qmou",
   "message": "Bill. Fucking *Bill*. This is a bit of a rant because I kinda got going on this guy.\n\nThis fucking guy joins the crew and the first day I worked with him he said, \"I don't talk politics at work, I don't talk shit about people that aren't around, and I don't want to be in charge\". Immediately proves it to be all lies *the same fucking day*.\n\nUltra conservative and makes it everybody elses problem. I don't give a shit about working with folks that are conservative, what matters to me is if you're a decent person. I know very staunch conservatives that are great to work with. Bill is not like that. Bill would literally start yelling at the mere *mention* of anything he viewed as liberal. I saw this guy fly into a rage, on the job site, because somebody mentioned Kamala Harris. Dude fucking got in a *shouting match with a homeowner* over politics. Ya know, the guy that fucking hired us to paint his house. He would try to start arguments with me all fucking day. Dude would just yell \"Let's go Brandon\" at least a half dozen times a day when that came out.\n\nThis guy said to me one day, \"ya know, slavery was good for black people because their descendants wound up being in America\". He thought that was some profound wisdom and I was a liberal idiot for saying it was nonsense \n\nDude would shit talk another painter so hard every day, to the boss and everybody else. I had to stand up for the guy constantly and even our boss got sick of it.\n\nBill also had 30 years experience but was one of the worst painters I've ever seen. For context, we do high end residential jobs and pride ourselves on the quality and finish. Bill did not. He would caulk and paint over it immediately and it would always fail. He *could not* cut a straight line to save his life or he just didn't give a shit. On one job, I had almost a full 4 days just recaulking these tall ass windows, 8ft step ladder required, and spot priming and repainting *finished* baseboard he clobbered with the much darker floor paint. He was also king of doing one coat and claiming it was two so he could brag about how fast he was.\n\nBill almost burned a house down one day because he was dropping the embers of his cigarette into dead dry leaves on an exterior job. We left for lunch and came back to the cedar shingles burning like a bandit,  another few minutes and it would have been beyond containing. Did he learn? Absofuckinglutely not.\n\nBildo got a young guy he knew from a poker game hired. Bill was talking a ton of shit at a game, new guy called him an idiot. 3 fucking months later Bill shows up univited, drunk, and mad to a game and crashes his truck into their porch and tries to fight the new guy. This particular stunt ended with him demanding our boss fire the new guy and getting fired himself.\n\n\nDude was just the most insufferable miserable prick I've ever had the great displeasure to work with, hands down. *Fuck* that guy so hard.",
   "created_utc": 1693251310,
   "score": 4,
   "submission_id": "163ktl7"
  },
  {
   "comment_id": "jy4fa4q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163ktl7"
  }
 ]
}