{
 "submission_id": "163lx9r",
 "title": "People who did not pursue/stopped pursuing the hookup culture, why?",
 "selftext": "",
 "created_utc": 1693228768,
 "permalink": "/r/AskReddit/comments/163lx9r/people_who_did_not_pursuestopped_pursuing_the/",
 "score": 132,
 "url": "https://www.reddit.com/r/AskReddit/comments/163lx9r/people_who_did_not_pursuestopped_pursuing_the/",
 "comments": [
  {
   "comment_id": "jy34dfb",
   "message": "That just seems like it would be empty and unfulfilling to me.",
   "created_utc": 1693228844,
   "score": 59,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy34ngv",
   "message": "In all honesty, it just never seemed that rewarding to me. I always wanted someone that would stick around.",
   "created_utc": 1693228971,
   "score": 14,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3a8h9",
   "message": "Too much work, I’m lazy",
   "created_utc": 1693231451,
   "score": 142,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3agsv",
   "message": "I’m ugly",
   "created_utc": 1693231549,
   "score": 31,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3fyc5",
   "message": "Because I don't trust people easily.",
   "created_utc": 1693233804,
   "score": 33,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy36gb5",
   "message": "The vast majority of my partners (74% - yes I did the math) were ONS. Fun but unsatisfying. Now, with my wife, the level of trust, love, companionship, just takes it to a level not possible otherwise and I couldn’t be happier.",
   "created_utc": 1693229791,
   "score": 194,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy35n97",
   "message": "Without affection, or connection, it just feels like masturbating with additional steps...",
   "created_utc": 1693229426,
   "score": 91,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy35tx9",
   "message": "I did for years and then stopped. Believe it or not, online dating was WAY, WAY, WAY better 20 years ago than today.\n\nThe Golden Age of Online Dating was 2000 to 2010, no doubt, and I was right in the thick of it.\n\nThere were no fake profiles, no scammers, no Russians looking for love from afar. Just local horny people looking to hook up.\n\nPlentyOfFish and LavaLife were the best sites ever.\n\nTinder and Hinge are absolute shit by comparison.",
   "created_utc": 1693229511,
   "score": 36,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy35p8f",
   "message": "I’m not attracted to the women who pursue the hookup culture too I guess",
   "created_utc": 1693229451,
   "score": 64,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3ggot",
   "message": "I don't feel sexual attraction to people I don't have an emotional bond to and feelings for.\n\nEven if I did, I still view sex as something very intimate, personal and private that I'd only be willing to share in a monogamous relationship with mutual love, trust and commitment.\n\nAnd even if I didn't believe that, I'm ugly as fuck and have never even had anyone hit on me, so I wouldn't have a chance anyway.",
   "created_utc": 1693234004,
   "score": 242,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy36v60",
   "message": "A crippling lack of self confidence ✌️",
   "created_utc": 1693229976,
   "score": 159,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3ixjg",
   "message": "I tried it but stopped. My perspective is that, as a woman, I don’t get much out of hook up culture. Most of my encounters in my brief phase were not satisfactory or simply adequate. It just didn’t compare to the marathon, multi-orgasm sex I’d had in relationships with men who knew my body and preferences.\n\nThat being said, flings are fun. But I’d say one-night stands really aren’t that good. It’s more like scratching an itch. I realized that I’d much rather invest in a vibrator and wait for my next relationship partner than to be continuously disappointed by one night stands",
   "created_utc": 1693234976,
   "score": 11,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy37o77",
   "message": "Because I wanted sex to be a special thing I'd share with only one person, and I didn't want STIs",
   "created_utc": 1693230337,
   "score": 146,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy369h0",
   "message": "a) I'm not nearly confident enough\n\nb) Too risky. People withhold important information until after the deed is done (i.e. undisclosed STIs, being hardcore pro-life, I'm the side piece, etc.) Not saying it's everyone, but I don't want to potentially ruin my life for someone I don't know.",
   "created_utc": 1693229705,
   "score": 8,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy34nhk",
   "message": "I started online dating a number of years ago and was very surprised to see how easy it was to find hookups. A teenage me would have died for this. \n\nI started making the rounds and was loving it. Problem is it started to loose its spark. Just wasn’t something I was enjoying doing for long periods of time. Found myself preferring to stay home and rub one out then have to actually go to the hookup. \n\nIt just didn’t feel healthy so I stopped.",
   "created_utc": 1693228972,
   "score": 67,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy39p09",
   "message": "If I'm horny I'll masturbate. Even making out with a stranger left me feeling icky, I'd prefer being in a real relationship",
   "created_utc": 1693231220,
   "score": 145,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy34mc3",
   "message": "The culture and the users age out. After 27, I felt disgusted with myself hooking up excessively. It gets awkward explaining being with excessive numbers of sexual partners. Personally, I began valuing emotional connection more with age. However was always monogamous and would ho out after a bad breakup to create emotional separation from an ex-girlfriend. It would get old after a few months.",
   "created_utc": 1693228957,
   "score": 76,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3d5v4",
   "message": "I want to have feelings for the woman in my bed.",
   "created_utc": 1693232671,
   "score": 24,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3j61t",
   "message": "Never did\n\n\nI consider sex to be a deeply intimate and inherently vulnerable act. So to do that with a stranger feels unsafe and unenjoyable for me",
   "created_utc": 1693235071,
   "score": 68,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy37c3l",
   "message": "It's prevalence was GROSSLY exaggerated IMO for an average guy.\n\nIn my twenties, I had a pretty solid group of guys \u0026amp; girls I'd go to city bars and clubs with every weekend.  Only maybe 3 of the guys could realistically approach a girl at a bar and take her home.  Two of them were foreign (Italian \u0026amp; Mexican) and we were in the Midwest... so they had an extra novelty girls were attracted to.  The one American was objectively super handsome and really personable (not an \"average\" guy at all).  The other 10+ people in our group usually just hung out, drank, had fun, but didn't bother trying to \"hookup\" with anyone.\n\nI'm years past the dating scene, but it sounds like internet dating has a similar ratio where in reality, it's only the top \\~10% of guys are the only ones actually participating in \"hookup culture\"",
   "created_utc": 1693230188,
   "score": 248,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy396c5",
   "message": "Because I don't wanna so much as touch another person I don't love, much less fuck them. Without love, the whole thing seems pointless, like wanking but using another person as a sex toy of sorts. That seems demeaning and a lot of effort for something I could just do with my own hand. The fake feeling of connectedness doesn't appeal to me.",
   "created_utc": 1693230999,
   "score": 40,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3c9kv",
   "message": "Because I realised that I HATE \"fucking\". \n\nI wanted a girlfriend to get weird with.",
   "created_utc": 1693232301,
   "score": 37,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3hubw",
   "message": "Because I value sex as something special only to be done with someone you truly and deeply love otherwise it’s kinda pointless and doesn’t mean anything so I don’t see a point.",
   "created_utc": 1693234544,
   "score": 41,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy379ft",
   "message": "Don’t like the awkwardness in the mornings. Also, when you hit a certain age it’s boring.",
   "created_utc": 1693230154,
   "score": 24,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3gb3t",
   "message": "Stopped because it wasn't fulfilling, left me honestly feeling lonelier and less desirable and I nearly got someone pregnant last year (had to go buy Plan B). The idea of possibly fathering a child with a woman I had only known for 2 weeks was not a comfortable one, so I've decided to stop hook ups altogether. Not that I had very many to begin with.",
   "created_utc": 1693233943,
   "score": 28,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy34og1",
   "message": "i was, am still in, a monogamous relationship",
   "created_utc": 1693228984,
   "score": 16,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy34zml",
   "message": "Different strokes for different folks, literally. I just don’t get sexually aroused/excited without having some level of connection or interest with someone. And that normally takes more time to build than what fits the norm of “hookup culture.”",
   "created_utc": 1693229126,
   "score": 47,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy38swo",
   "message": "Hookups don’t get you a house.",
   "created_utc": 1693230836,
   "score": 44,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3dsxw",
   "message": "Knowing myself, sex isn’t good without a connection.",
   "created_utc": 1693232936,
   "score": 15,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3gop5",
   "message": "Too many psychos",
   "created_utc": 1693234092,
   "score": 13,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3gquu",
   "message": "It just gets exhausting after a while, at least as a man.\n\nYou're constantly expected to arrange everything, you constantly have to keep a clean house on the off chance that you get lucky that day, you constantly have to pay for meals, and you constantly have to judge whether or not she's starting to get too clingy and you need to break things off.\n\nIt's like being a circus ringleader.\n\nThe sex is great, but as you get older it starts to not be worth it anymore.\n\nAlso you're always worried about STDs.",
   "created_utc": 1693234116,
   "score": 38,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3lswe",
   "message": "Im asexual.",
   "created_utc": 1693236090,
   "score": 14,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3c6xn",
   "message": "I'm demisexual, so hookups don't work for me. Hell, can't even pull off friends with benefits (tried).",
   "created_utc": 1693232270,
   "score": 43,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3irsr",
   "message": "It never seemed fun or rewarding to me really. It makes me feel good to be in a committed relationship with someone before having sex. Get to know them on more than a surface level you know? Someone I actually care for that actually cares for me. \n\nI feel that giving myself to someone who doesn’t care about me/I don’t care about them would make me feel bad about myself later",
   "created_utc": 1693234913,
   "score": 12,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3lrmo",
   "message": "After having sex with someone I actually love and they love me back, it made the whole hook up culture seem hollow and superficial. Sex is not as great as we make it out to be when one or both parties are not really into it fully. Frankly nothing against hookups, but to me it's a very hollow way to go about getting affection, I'd much rather do it myself to be honest.",
   "created_utc": 1693236077,
   "score": 8,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3b3gv",
   "message": "I could never let someone touch me that wasn't in love with my and me them... (but I'm demisexual and a germaphobe)",
   "created_utc": 1693231813,
   "score": 8,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy46wcp",
   "message": "I'm shy. Also not enough people I'd *want* to blindly fuck. And the ones i do want to sleep with probably don't wanna sleep with me. \n\nHookup culture is mainly for two kinds of people: 1) you have low standards and are looking for partners who also have low standards (ie just hunting for a nut); or 2) you're conventionally hot and are lucky enough to hang out with lots of other conventionally hot people. The odds of it working out otherwise are super low.",
   "created_utc": 1693243953,
   "score": 10,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy35o82",
   "message": "I always end up hurt. I tell myself I won't, but I always do lol. Some people aren't meant for those kind of relationships and I think im just one of them. 🤷‍♀️🤷‍♀️",
   "created_utc": 1693229438,
   "score": 16,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3904k",
   "message": "I don't want to catch your shit.",
   "created_utc": 1693230924,
   "score": 16,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3jhpa",
   "message": "I feel like it kinda kills the whole love, care, affection, etc traits inside you, in the long run, and on further pursuit you just see humans as an object.\n TL;DR it's kinda real toxic imo",
   "created_utc": 1693235196,
   "score": 17,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3hxut",
   "message": "It doesn't work without love for me.",
   "created_utc": 1693234583,
   "score": 14,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3i7kp",
   "message": "It just never appealed to me.",
   "created_utc": 1693234691,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3iqcf",
   "message": "It's cringe",
   "created_utc": 1693234896,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3j4fx",
   "message": "I got married.\n\n\n\n\nWell, to be more accurate, I started dating the man who is now my husband. We started as fuck buddies, and then decided to try the whole monogamy thing, and now we're married, have a house, and are loving life together.",
   "created_utc": 1693235053,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3joh7",
   "message": "Never got the appeal of getting intimate with a stranger, and I never got crushes for someone I didn't have a connection with\n\nThen I found out that this is demisexuality",
   "created_utc": 1693235269,
   "score": 6,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3q1qu",
   "message": "Met wrong people. Got used/taken advantage of. Scared for my own safety and health. Quit for over 5 years. Then I was in a relationship till now, married. So no hook up for a pretty long future I think.",
   "created_utc": 1693237704,
   "score": 8,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3w078",
   "message": "The fakery. The emptiness. The lack of genuinity in a person or depth.",
   "created_utc": 1693239939,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3w58y",
   "message": "I grew up. At the age of 34 it just hurts. You realize how empty it is after you orgasm.\n\nFor me, actually stopping mastrubating to porn changed my view on hookups completley. Now I want deep connection and lasting relationships, which is fascinating, because trust me, Ive had some hookups in my life for sure.",
   "created_utc": 1693239992,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy40r0u",
   "message": "Sex without a real connection (hook-up, doll, or prostitution) seem empty and potentially damaging.",
   "created_utc": 1693241704,
   "score": 8,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy34kge",
   "message": "Actually did it while in a LTR that was a dead bedroom, years ago.\n\nThe sex is just not as good as you think it'll be. It takes a while to get comfortable with a sexual partner, and hooking up is obviously hit or miss. Partners rarely wanted to stick around very long, even those advertising for a FWB.",
   "created_utc": 1693228933,
   "score": 17,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3idm1",
   "message": "Because yuck",
   "created_utc": 1693234757,
   "score": 14,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3iai8",
   "message": "Stopped after 10 years cause I got herpes, thought nobody would ever want to have sex with me again, then immediately met my dream girl and settled into a healthy, monogamous relationship.",
   "created_utc": 1693234722,
   "score": 12,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3pbxu",
   "message": "The lifestyle doesn't interest me. If I want to do the dance with no pants I want to do it with someone I genuinely love.",
   "created_utc": 1693237434,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3pp5h",
   "message": "i heard stories of people feeling empty afterwards and I already felt like shit before\n\nif I feel the urges i jerk off then sleep , i'll never understand that culture",
   "created_utc": 1693237574,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3wzb0",
   "message": "Emotional bond and feelings are very important",
   "created_utc": 1693240300,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy4199k",
   "message": "Bold of you to assume any woman would want to fuck me.",
   "created_utc": 1693241892,
   "score": 5,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy45gg9",
   "message": "Probably not how everyone is but I honestly just outgrew it. It’s great at university or when you’re constantly travelling round and on the move. Once you settle down though it just becomes more trouble than it’s worth. \n\nFor example, I ended up settling in a small commuter town outside a medium sized city. Realistically, how long am I going to be able to carry on with regular hook ups before I get a reputation, or caught in some dramatic relationship situation or accidentally sleeping with the wife of some psycho? When you’re on the move a lot you can take that chance and skip town for a bit if you need to, now everyone knows where my front door is it’s just too risky. \n\nThat and honestly around 26 years old I just finally lost the energy for it really. Being out at bars almost every night and sleeping with two to three people a fortnight sounds great, but it requires a lot of energy. All the late nights mean you don’t sleep properly, long term continuous drinking and substance use starts taking its toll too.\n\nThinking back, I think my eureka moment when I realised I was definitely past it was waking up on a beach in Newquay in the UK next to some girl I had no recollection of sleeping with next to a pile of soaking wet clothes (hers and mine). Unceremoniously pulling on boxers, trousers and a T-shirt all soaking with salt water and coated in damp sand at 5am makes you feel pretty miserable.\n\nI still carried on with it for a little while after that but my heart just wasn’t in it anymore. Now I’ve been with the same girl for almost 2 years and couldn’t be happier.",
   "created_utc": 1693243431,
   "score": 6,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3c31d",
   "message": "I'm ugly, one thing you quickly realize is that hookup culture only really exists for the top 20% who want to participate, anyone elese is not part of it by default.",
   "created_utc": 1693232226,
   "score": 39,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy39cth",
   "message": "I never even saw the entrance.",
   "created_utc": 1693231077,
   "score": 3,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3eoyi",
   "message": "I’m really into intimacy and being affectionate but unfortunately that isn’t what hookup culture is about. Random hook ups just aren’t fulfilling and left me feeling empty because I couldn’t be too affectionate or I would be deemed too emotional/wanting more.",
   "created_utc": 1693233297,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3jm27",
   "message": "I stopped because I realized there is an emotional component to sex for me, and sex without it just wasn't making me happy.",
   "created_utc": 1693235243,
   "score": 5,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3k6g8",
   "message": "It just doesn't feel right. I prefer something meaningful over this. Also it messes with your mental health. It's simply not worth it.",
   "created_utc": 1693235467,
   "score": 6,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3khr1",
   "message": "Because hookup sex is shit compared to consistent and great sex with a person you love who is really good at it.",
   "created_utc": 1693235589,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3kkw9",
   "message": "I found love.",
   "created_utc": 1693235623,
   "score": 5,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3koc9",
   "message": "It’s fun buts it’s risky and it’s only temporary fun and at the end of the day you’re still alone",
   "created_utc": 1693235661,
   "score": 5,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3kzh9",
   "message": "1. I didn’t get much attention from women for a variety of reasons\n\n2. I can’t do casual sex. I’ve tried in the past and it’s caused me no end of heartbreak.\n\n3. I’m decently happy working on myself right now. Starting a new job in a new career in a few weeks, stepping out of my comfort zones to grow as a person and cultivating my hobbies.",
   "created_utc": 1693235780,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3l7cu",
   "message": "The potential risks seemed a LOT higher than the benefits for me.",
   "created_utc": 1693235864,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3lnd4",
   "message": "Not everyone wants to have a hoe phase",
   "created_utc": 1693236033,
   "score": 8,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3mifg",
   "message": "Even when you're winning, you're losing",
   "created_utc": 1693236361,
   "score": 6,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3mxwd",
   "message": "It’s disgusting. Simply put.",
   "created_utc": 1693236526,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3olfc",
   "message": "It's gross. And yes I am being judgmental and yes I did have some hookups and yes I did find it empty and squalid.",
   "created_utc": 1693237152,
   "score": 6,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3w7lp",
   "message": "I was just using hook ups as an easy way to get validation, eventually I met someone who actually wanted to love me and gave up my hoe ways. I don't have any regrets, I had a lot of fun and it helped me through a fairly dark period in my mental health. My partner knows my (rather high tbh) body count and doesn't give a shit, just like I dont give a shit about his (also higher than the average person). That being said, if we were to break up I probably wouldn't sleep around as much as I used to. Just because it is a lot of effort both emotionally and physically, and I'm older and tired now lol",
   "created_utc": 1693240017,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3yqly",
   "message": "I don't drink as much. Hookup culture is fueled by alcohol.",
   "created_utc": 1693240961,
   "score": 5,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy40ju2",
   "message": "It's never been my thing. I've always valued intimate connections more than sex. And sex is so much better when it's with someone you genuinely care about.",
   "created_utc": 1693241631,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy45hrl",
   "message": "I came of age in the 90s and was terrified of HIV.",
   "created_utc": 1693243444,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy47imp",
   "message": "I went to therapy instead of using men to literally and figuratively fill the void inside me.",
   "created_utc": 1693244178,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy39xig",
   "message": "Simple, I was never invited to participate :(",
   "created_utc": 1693231321,
   "score": 7,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3b4jv",
   "message": "I discovered the magic that is FWB. So much safer and less exhausting since you only have to learn/teach how to make good sexy times once.",
   "created_utc": 1693231826,
   "score": 17,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy40nv6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3linz",
   "message": "I felt like I was eroding my soul and found my soul mate afterwards",
   "created_utc": 1693235983,
   "score": 5,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3n1n1",
   "message": "Rather not get an STD, even being safe with a condom it's not 100%.",
   "created_utc": 1693236565,
   "score": 4,
   "submission_id": "163lx9r"
  },
  {
   "comment_id": "jy3o8qy",
   "message": "I wanted a long term serious relationship and nothing less than that \n\nThe one time I kissed someone I pretty much had just met it felt so hollow and pointless, I can’t imagine trying to want to have sex with someone I don’t know really",
   "created_utc": 1693237018,
   "score": 4,
   "submission_id": "163lx9r"
  }
 ]
}