{
 "submission_id": "163lavg",
 "title": "What is a privilege, exclusive to the opposite sex, that you envy?",
 "selftext": "",
 "created_utc": 1693227183,
 "permalink": "/r/AskReddit/comments/163lavg/what_is_a_privilege_exclusive_to_the_opposite_sex/",
 "score": 12,
 "url": "https://www.reddit.com/r/AskReddit/comments/163lavg/what_is_a_privilege_exclusive_to_the_opposite_sex/",
 "comments": [
  {
   "comment_id": "jy4duox",
   "message": "no periods for men is wt i envy",
   "created_utc": 1693246513,
   "score": 210,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4rscr",
   "message": "Jealous of the natural born strength men have.\n\nI did heavy weight lifting for half a year, and I felt strong. I arm wrestled my average sized husband, who has never lifted weights or tried to increase his strength. He won against me in seconds…. Men’s Testosterone gives them so much potential and strength. Lol im so bitter.",
   "created_utc": 1693251735,
   "score": 37,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4ibes",
   "message": "Being taken seriously buying tools, cars, etc. I’ve been completely ignored or worse trying to buy these things. Not even looking for help, just want to give them my $.",
   "created_utc": 1693248185,
   "score": 238,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy34ug7",
   "message": "Wearing summer dresses. They're unbelievably comfortable, but look extremely silly on me :D",
   "created_utc": 1693229061,
   "score": 112,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy40aqc",
   "message": "The cost of basis hygiene items. When we got married my husband was shocked at how much money women spend on things we have to have (like tampons, pads, razors, etc.)",
   "created_utc": 1693241537,
   "score": 56,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4rm9s",
   "message": "Pants with real pockets",
   "created_utc": 1693251673,
   "score": 35,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3d7sv",
   "message": "Admiring children without people thinking you're a perv.",
   "created_utc": 1693232695,
   "score": 84,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4era7",
   "message": "I've recently been exercising more to lose weight.\n\nLast week, I was walking, and turned down a block near my home. There were three children who had just gotten off the school bus for the afternoon.  Two little boys and a little girl... Maybe 9 or 10 years old.\n\nThe two little boy peeled off to their houses.  That left the little girl.  She was maybe 40 feet ahead of me or so.  \n\nShe's little and I'm 6'3 so I gradually gain on her.  It does not even occur to me that she might be worried as I walk regularly and I see lots of other kids on bikes, adult men and women walking, etc.  I live in a beautiful country club neighborhood with parks and ponds and the golf course and a community pool.  Again... It never even occurs to me that she feels she might need to worry about the 6'3, bearded, shirtless man power walking behind her.\n\nShe hears my footsteps, turns around, is visibly terrified and begins to walk like those Olympic speedwalkers.  A few seconds later she turns around again, and as she does I put my hands up, say \"You're okay... I'll walk over here\" and point to the other side of the road.  I hustle over there and make absolutely zero eye contact with her beyond that.  When I get to the end of the street to turn around, she's gone, so I assume she made  it home.\n\nI guess I'm glad she has the presence of mind to be aware of her surroundings and be as safe as she could be, but it's almost embarrassing.  I felt like a predator for a moment. \n\nSorry little girl.",
   "created_utc": 1693246852,
   "score": 202,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3dsgl",
   "message": "Peeing outside. As a woman I always have to find a secluded area, but men can pee almost everywhere they want. And they can do it while standing too 😭",
   "created_utc": 1693232930,
   "score": 108,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3pzrp",
   "message": "The variety of clothes women can wear and it be considered normal. I think men have much less variety than women. Oh and good looking athletics clothes.",
   "created_utc": 1693237684,
   "score": 202,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3ykdo",
   "message": "Men with good skin and long lashes lol",
   "created_utc": 1693240897,
   "score": 183,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3nx7v",
   "message": "Naturally trusted around children.",
   "created_utc": 1693236896,
   "score": 190,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3rpgl",
   "message": "I just wanna be able to say “you go girl” to my boys",
   "created_utc": 1693238329,
   "score": 177,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4dmqt",
   "message": "Not having periods or having to go through childbirth or all the hormonal changes that being a woman entails would be nice",
   "created_utc": 1693246430,
   "score": 83,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3gk5p",
   "message": "Nobody's ever bought me a drink because I looked cute. I don't look cute, but nobody has ever lied to me to get in my pants either.",
   "created_utc": 1693234042,
   "score": 172,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3c8rg",
   "message": "I just want to be able to say hi and generally be nice to kids in public instead of looking away and pretending I don’t see them.\n\nEven typing that out feels weird.  But I really just want to be able to engage and not feel like I’m scaring the shit out of some poor mom who is probably very aware of her helplessness in the unlikely event that I am (in her mind) a bad guy.\n\nI understand why it is this way.  I just wish it wasn’t.",
   "created_utc": 1693232292,
   "score": 37,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy44ydg",
   "message": "Being able to compliment people, especially women. Like no, I do not want to fuck you, I just like your haircut and would like to spread some semblance of positivity. That and being able to talk to children without worry, because again, it seems that my sex/gender means I want to fuck everything I so much as look at.",
   "created_utc": 1693243251,
   "score": 153,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy53w59",
   "message": "Not having to wear a bra. \n\nBras suck. Finding good ones that fit well is hard, they’re often expensive and even if they’re comfortable at the start of the day, I can’t wait to rip them off at the end of the day. \n\nAnd when you finally have a good one that you love, even if you take excellent care of it, the wires will eventually poke through the fabric and stab you in the tit.",
   "created_utc": 1693256182,
   "score": 201,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4ax5b",
   "message": "No periods.",
   "created_utc": 1693245419,
   "score": 132,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3p0dl",
   "message": "Having more outfit options than suits/dress shirts as professional attire.",
   "created_utc": 1693237311,
   "score": 244,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4ebyc",
   "message": "Having more muscle mass and becoming strong naturally or easily.",
   "created_utc": 1693246693,
   "score": 39,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4tfnm",
   "message": "natural, inherent physical strength + metabolism. i’m 20F, work out 3-4 times week and i’m still just about as strong as a 14 year old boy. i’m working on it, but damn it would be nice to have good starter stats",
   "created_utc": 1693252335,
   "score": 176,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3lky9",
   "message": "Not being called 'hysterical' 'anxious' etc by doctors constantly. \n\nI went to my doctor for a breathing issue, he insisted it was anxiety for weeks until I went to A\u0026amp;E and got x-rayed. It was a serious infection.",
   "created_utc": 1693236007,
   "score": 2,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3jdq0",
   "message": "Comfortable interaction with children. Women interact with kids without scrutiny or suspicion, as a man it's always a nagging question am I 100% covered at all times against false allegations.",
   "created_utc": 1693235153,
   "score": 16,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3p82b",
   "message": "Ability to keep a box of tissues on my nightstand without getting a side eye.",
   "created_utc": 1693237393,
   "score": 177,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3bo3g",
   "message": "Multiple Orgasms, low refractory period lmfao",
   "created_utc": 1693232053,
   "score": 23,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4hdz1",
   "message": "Ease of urinating.\nStanding next to a car\nSneaking behind a tree\nEtc.",
   "created_utc": 1693247839,
   "score": 43,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4kff9",
   "message": "Not suffering from monthly pain or incovenience.",
   "created_utc": 1693248975,
   "score": 113,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4k6df",
   "message": "The ability to do whatever they want.  I live in a highly conservative country . I wish i could go out with my friends without having to get permission and convincing them, i wish i could travel with friends to other cities, go on long drives, spend a whole day outside till late doing nothing, study whatever i wanted without worrying that it will be a male dominated field just a lot of things",
   "created_utc": 1693248881,
   "score": 86,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4k1l8",
   "message": "Lack of breasts, its just so impractical and kind of uncomfy",
   "created_utc": 1693248831,
   "score": 70,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy55wi2",
   "message": "Im tall, black, and male. \n\nTall people are more likely to be seen as threatening and are thus punished harsher than short people. \n\nBlack people are more likely to be seen as threatening and are thus punished harsher than Asian Americans. \n\nAnd at the largest disparity, men are more likely to be seen as threatening and are thus punished harsher than women. [Like...by a huge margin. 6 times larger than the race disparity](https://repository.law.umich.edu/law_econ_current/57/)\n\nI wouldnt mind the privilege of gendered crime definitions not affecting me, being less likely to be arrested, charged, convicted, incarcerated, etc along with 63% lower sentencing for the same crime. \n\nOr...just people not assuming i'm a criminal for how I was born. Not having to worry about a false accusation or false arrests as much.  It would be so freeing.",
   "created_utc": 1693256943,
   "score": 130,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy5bucr",
   "message": "As a woman I envy in men: being admired more, the more they age",
   "created_utc": 1693259261,
   "score": 88,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4dp88",
   "message": "Taking a walk alone after dark.",
   "created_utc": 1693246457,
   "score": 250,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy5p9gd",
   "message": "Being taken seriously when they speak and not told they are crazy for expressing rational emotions and concerns. And also not having a point countered with something about how I'm ugly, no men want me. And I'll be alone with my cats forever. That's cool. I don't care and has literally nothing to do with what I said.",
   "created_utc": 1693264926,
   "score": 36,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3uno4",
   "message": "Having an easier time carrying things on your hips",
   "created_utc": 1693239436,
   "score": 179,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy356gd",
   "message": "Always knowing that your children are yours.",
   "created_utc": 1693229214,
   "score": 61,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4ljv3",
   "message": "Not having to deal with periods",
   "created_utc": 1693249403,
   "score": 91,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy5uf8l",
   "message": "Orgasms are almost always a sure thing during sex for men… I’d like that.",
   "created_utc": 1693267134,
   "score": 92,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3gdsv",
   "message": "Girls can hug others and nobody bats an eye.",
   "created_utc": 1693233972,
   "score": 72,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4gkg2",
   "message": "Considering I had to leave work because I puked four times due to my period, the fact men DONT get them.\n\nI’m fucking miserable y’all.",
   "created_utc": 1693247531,
   "score": 87,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4adqn",
   "message": "being able to go out anywhere alone without having to worry about being harassed",
   "created_utc": 1693245220,
   "score": 162,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4hyxa",
   "message": "Not having to give birth  and being the main parent. Less pressure about how good they have to be looking",
   "created_utc": 1693248056,
   "score": 206,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4k2mo",
   "message": "Not being sexually harassed or called ridiculous pet names by old pervy male customers every fucking day \n\nCupcake, baby, angel, sweet cheeks, tootsie, sissy, etc",
   "created_utc": 1693248842,
   "score": 47,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3olnn",
   "message": "International women's Day is amazing. I love how empowering some of the stuff I've seen is. \n\nInternational mens day is mostly asking us to stop raping people long enough that we don't kill ourselves",
   "created_utc": 1693237155,
   "score": 112,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4dnck",
   "message": "Being actually well-studied in the medical world...it basically revolving around their bodies.   The difference being especially extreme in areas of sexual function.\n\nSubpar medical care for women is probably the most infuriating and terrifying gender-related inequality today.",
   "created_utc": 1693246436,
   "score": 14,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy45vqi",
   "message": "Women are severely misdiagnosed/underdiagnosed compared to men.\n\nEdit: for example, I complained to my male doctor about intense fetal-position cramps for weeks. He said it was normal. I pleaded not. Days after I was in the ER for a ruptured cyst that caused syncope and got my PCOS diagnosis.",
   "created_utc": 1693243584,
   "score": 152,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4g69f",
   "message": "less expectations for physical appearance in public",
   "created_utc": 1693247384,
   "score": 155,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy52po2",
   "message": "Being taken seriously as the default.",
   "created_utc": 1693255748,
   "score": 186,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy5lk3v",
   "message": "Society is more receptive of women being emotionally vulnerable. After my suicide attempt my aunt still told me to “get over it and be a man”. I have gotten over it after therapy. \n\nBut I haven’t spoken to my aunt and other family members in years. Which was unfortunately essential to my healing. \n\nSo I envy that female vulnerability it more widely accepted and they are no ostracized to the point of isolation for their vulnerability. They are actually offered more shelter because of it.",
   "created_utc": 1693263337,
   "score": 104,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy3ehvz",
   "message": "No periods. No weight that won't leave after havung a baby. Easier to lose weight.",
   "created_utc": 1693233217,
   "score": 180,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy61d4j",
   "message": "Not having expectations for hair, makeup, removing body hair, being fashionable, and all the other things that take time out of each day. My husband wakes up, puts on whatever clothes, and no one cares if he even brushes his teeth or wore the same thing yesterday. \n\nAs a kid, I marveled at how men were just served. Like they sat on the couch and women served them whatever they wanted. I chose to not participate in this weird dynamic as an adult, and I definitely get judged and gossiped about because of it. I am the primary breadwinner for my family but people still think I should do all the domestic stuff too.\n\nFinally: not getting interrogated about why I didn't change my name when I got married!",
   "created_utc": 1693270079,
   "score": 37,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy47tjx",
   "message": "The fact that men can give zero fuck about style, clothing or makeup and this is normal, but if a woman does it, she is lazy / « letting herself go » /« not taking care of herself ».",
   "created_utc": 1693244287,
   "score": 240,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy31s8o",
   "message": "Assumed competence in leadership/management positions.",
   "created_utc": 1693227621,
   "score": 78,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy5bzvz",
   "message": "Men get to take their shirt off, summer is too hot not for us to have that privilege too 😭",
   "created_utc": 1693259323,
   "score": 73,
   "submission_id": "163lavg"
  },
  {
   "comment_id": "jy4z73z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163lavg"
  }
 ]
}