{
 "submission_id": "163qniy",
 "title": "What is something that you really wanted to do, but then regretted doing it?",
 "selftext": "",
 "created_utc": 1693239999,
 "permalink": "/r/AskReddit/comments/163qniy/what_is_something_that_you_really_wanted_to_do/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/163qniy/what_is_something_that_you_really_wanted_to_do/",
 "comments": [
  {
   "comment_id": "jy40sdd",
   "message": "Selling my house and all possessions in 2019 to Fulltime in an RV and travel the country. Yes it has been fun but now trying to get back into the housing market is a nightmare.\n\n\u0026amp;#x200B;\n\nEdit: For the record I do not regret Rv'ing across the country for 3 years, I just wish I would of kept my house and rented it out, the pandemic has made prices insane.",
   "created_utc": 1693241718,
   "score": 134,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3y5ph",
   "message": "Becoming a teacher. School started in August. By October, I knew that I wouldn't be back next year.",
   "created_utc": 1693240744,
   "score": 2,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy45fqv",
   "message": "I remember getting upset with my father when I was around 7 or 8 years old because he had given me the wrong video game, and I can still make out his dismay. still haunts me today.",
   "created_utc": 1693243424,
   "score": 181,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy40lvd",
   "message": "Stayed with my Ex after they cheated. Was desperately trying to cling on to what was left, but it didn't even take more than a week for me to realize I had made the wrong choice. Still managed to convince myself to stay and keep trying. Lots of mental gymnastics, which ultimately tired me out and I called everything off.\n\nThat was probably the darkest and most depressing period of time in my life",
   "created_utc": 1693241652,
   "score": 75,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3zfud",
   "message": "Someone find the post by they guy that had a kink for getting pooed on, but realized it should have stayed a fantasy as when he hired a sex worker to do it for him. \n\nIt will always be the best reddit answer to this question\n\nEdit: [Found it!](https://www.reddit.com/r/AskReddit/comments/3907wr/serious_redditors_whos_sexual_fantasies_became_a/crzf7j9?utm_source=share\u0026amp;utm_medium=android_app\u0026amp;utm_name=androidcss\u0026amp;utm_term=1\u0026amp;utm_content=2)\n\n\"Growing up, I was fascinated with scat sex. I used to download tonnes of scat movies and I always fantasised having a women shit on my body and in my mouth one day. After years of fantasising, I finally decided to pay for the professional escort Louise Hunter, who is well known for her scat movies. I turned up at her house and she seemed nice enough. She knew it was my first time experiencing scat, so she knew to take it slow. Louise had laid down some plastic on the floor in her living room, and lots of towels on top of that. I fucked her for a while, before laying on my back and letting her piss on my cock and stomach. Then she was about to start shitting and I asked if she could do it directly into my mouth. She happily shuffled backwards and started shitting in my mouth. As soon as the shit touched my tongue, I knew I had made a huge mistake. This was not how I imagined it would be, and at that moment I was simply a normal guy, on his back, with a women's shit in his mouth. The thing was I was too polite to tell her to stop. She had already told me she had had clients that asked her to stop and I didn't want to be one of them. So I stuck it out, and just let most of the shit fall off my lips onto the towel. I finished myself off by wanking onto her and then she let me take a shower to clean myself up before I left. \n\nI've never watched another scat movie since and I have no intention of trying it again.\"",
   "created_utc": 1693241222,
   "score": 142,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3xztm",
   "message": "Getting Married at 18. Way too young and way too stupid to make that kind of decision. Wasted about 10 years on something that wasn't healthy to begin with",
   "created_utc": 1693240682,
   "score": 114,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3zb7b",
   "message": "Ate a huge chocolate cake in one sitting ( it was meant for 4 to 6 people)",
   "created_utc": 1693241175,
   "score": 16,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy41dgj",
   "message": "In grade school I was terrified of roller coasters because I got my head/neck hurt on a wooden one and thought they were all like that. While at a theme park with a friend dad tried to convince me for 10 minutes to get on and I was too petrified, so he took them instead of me and they had a blast while I watched. I was too young to explain my feelings but I ended up crying the entire next hour or so because I felt like my dad abandoned me. Really he just wanted to not let my friend miss the experience but it still sucked. \n\nLove rollercoasters now, weirdly.",
   "created_utc": 1693241934,
   "score": 220,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy40fj6",
   "message": "Getting a third dog 😅",
   "created_utc": 1693241586,
   "score": 40,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3zxwg",
   "message": "Work in a restaurant hahah",
   "created_utc": 1693241405,
   "score": 158,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3xtfs",
   "message": "I really wanted to try bungee jumping, but after taking the leap, the rush of fear and anxiety left me regretting the decision almost instantly.",
   "created_utc": 1693240616,
   "score": 99,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy41qtb",
   "message": "When I was in 5th grade, I had beautiful longggggg flowing locks. I decided I wanted to donate it to locks for love on a whim. It was just long enough, my hair was cut up to my ears (!) as luck would have it I had just gotten asked to the movies by my long time crush, when I showed up with the shortest bob ever you tell he was shocked and probably disappointed. Hope whoever got my hair really loved it bc I instantly regretted giving it up.",
   "created_utc": 1693242072,
   "score": 71,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3w7rk",
   "message": "Skydiving.",
   "created_utc": 1693240018,
   "score": 89,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy43a9t",
   "message": "This one is kinda funny\n\nI wanted to try chicken and dumplings in a can \n\ni regretted it immedtely",
   "created_utc": 1693242641,
   "score": 125,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3zv40",
   "message": "Masters from a foreign country",
   "created_utc": 1693241377,
   "score": 89,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy40xxk",
   "message": "Getting married to the guy I started dating at 19. Worked out poorly. Two amazing kids and super happy now that it's over though, so not ALL regrets. Go live in the world on your own for a while, y'all. You're not who you'll eventually be when you're that young.",
   "created_utc": 1693241775,
   "score": 127,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4c0g6",
   "message": "Open marriage",
   "created_utc": 1693245822,
   "score": 75,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy40kcb",
   "message": "have sex with Sherry.\n\n\nshe gave me crabs",
   "created_utc": 1693241636,
   "score": 97,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4a6pz",
   "message": "Working a job that involves skills from one of my hobbies. Now it feels more like work than the hobby.",
   "created_utc": 1693245147,
   "score": 191,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4c0xr",
   "message": "Staying up late like rn and bullshitting myself that tomorrow i will sleep early like i said yesterday",
   "created_utc": 1693245827,
   "score": 185,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy44dbz",
   "message": "Military",
   "created_utc": 1693243042,
   "score": 43,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4623s",
   "message": "I'm now incredibly sorry I agreed to work this 6:30 am shift.",
   "created_utc": 1693243648,
   "score": 76,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3zz5h",
   "message": "Getting into serious relationships in my teen years. One lasted from 15 to 17 and the other one from 17 to a year ago (I'm 28 now) \n\nhonestly when you're that young you're not a complete person and you're definitely not mature enough for something serious. Lighthearted dating, fooling around, safely exploring within your age range, sure. But committing yourself fully to another person when both of you arent nearly done mentally developing yet... It rarely ends well",
   "created_utc": 1693241417,
   "score": 133,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4614h",
   "message": "LASIK. Yeah, I had perfect vision for about 8 years and it was really nice not to have to deal with glasses or contacts, but now I’m in the same boat vision-wise (worse, because my distance vision is over correcting with age) except now I have dry eye and can no longer wear contacts. Also, apparently there are issues with cataract surgery after you’ve had LASIK and I have cataracts forming so things should get real interesting in about 10 years. \n\nFor the love of all that is good and holy don’t laser your eyeballs.",
   "created_utc": 1693243638,
   "score": 124,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4gviz",
   "message": "Having a micro-wedding.\n\nI was so in my head about hating big weddings, the wedding industrial complex, and other BS that I made sure to have the smallest, cheapest wedding possible.\n\nOur wedding was lovely - nice, intimate, personal. But I still regret not making it bigger because you really don't get many opportunities in life to get a lot of people you love and care about together and have them see each other, too (other than funerals, bleh). It's really special.\n\nYeah, they have to pay to get there and stay, and you have to pay to feed and entertain them, but it seems like a fair trade.\n\nI didn't want to be a Bridezilla, but I became a Bridezero instead.",
   "created_utc": 1693247650,
   "score": 240,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4bzyb",
   "message": "Sending a picture of myself in a bra to some dickhead on the internet when I was 16.",
   "created_utc": 1693245817,
   "score": 56,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy499i8",
   "message": "Trying to face my fear of thrill rides. Thought I was going on a low-stakes indoor coaster - it was a drop ride. A big one, and famous for being particularly intense.\n\nI was traumatized in a dark room while The Jackson 5 blasted from the speakers. I still can't listen to I Want You Back without clenching.",
   "created_utc": 1693244811,
   "score": 62,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3xrp4",
   "message": "School",
   "created_utc": 1693240598,
   "score": 28,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy44pkp",
   "message": "I resigned from my job 2 hours back. have to server my notice period from tomorrow. I really need this job for survival of my family. I was facing the mental harassment from serious from last 4 months and really losing my mental health. \n\nToday, thing went over my head so I resigned. Truly cried for this action as I understand it impact on me and my family. Definitely, I will look for a new job but I know I wont be getting such high paying job.",
   "created_utc": 1693243164,
   "score": 56,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy459if",
   "message": "waiting for the ideal circumstance before acting rather than acting immediately and making the situation ideal",
   "created_utc": 1693243363,
   "score": 15,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy45cn7",
   "message": "oh that's a good question, I really wanted to date this girl, turned myself inside out for her validation and attention, went out of my way so many times, like at one point all I wanted is to date her, asked her out, we dated for couple of months, she cheated, it's been 2 years and I still can't trust anyone, worst mistake, the worst thing is her past was cheating and lying, I could've seen this coming but teenage got the better of me, anyways good question mate",
   "created_utc": 1693243394,
   "score": 5,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy48nbo",
   "message": "I'll never have to work again in my entire life!\n\nIn 2019, I became disabled.",
   "created_utc": 1693244588,
   "score": 60,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy48s2c",
   "message": "That novelty 2 pound Reese cup. I regret how good it was.",
   "created_utc": 1693244634,
   "score": 29,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy49cuv",
   "message": "becoming severely obese. I'm not anymore, but there's been some harm.\n\nExcept for this one, I believe that the majority of my other errors may be corrected or mitigated.",
   "created_utc": 1693244844,
   "score": 27,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4bxfm",
   "message": "\"Friend\" at school told me if I cut all my eyelashes off they would grow longer.\n\nThey did not.",
   "created_utc": 1693245790,
   "score": 35,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4bynl",
   "message": "Not protecting my hearing.\n\nI'm 52 and have had tinnitus for 20 years now. I should've worn earplugs when mowing the grass, going to concerts or loud movies. I shouldn't have turn my Walkman up to 11.",
   "created_utc": 1693245803,
   "score": 239,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy460my",
   "message": "Go to college for art. I love drawing and thought that I could maybe be an artist in the future. Unfortunately, after one year, the fun of drawing got kinda sucked outta me, so I have since switched over to theatre since I've always enjoyed my time in high school theatre.",
   "created_utc": 1693243633,
   "score": 34,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3zr75",
   "message": "Leaving the house.",
   "created_utc": 1693241337,
   "score": 37,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4484h",
   "message": "Attending a music festival. I'm easily overstimulated (tho I really enjoy going to clubs, and I wanted to spend a nice weekend with my friends and see some artists I really love) so I should've anticipated that three days of huge amounts of people, neverending noise and a bunch of unfamiliar situations would end in me having a breakdown. Still haven't recovered two weeks later 😶",
   "created_utc": 1693242989,
   "score": 36,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4128w",
   "message": "Smash cake in my brides face on our wedding day this weekend. /s",
   "created_utc": 1693241819,
   "score": 56,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy46ua6",
   "message": "Grad school",
   "created_utc": 1693243932,
   "score": 8,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy498mz",
   "message": "Moved from Upstate NY to NJ to be with the one that got away. We're married now and it's fine, but I really fucking hate NJ lol. It's tough to make friends in your mid 30s and even harder when you move to a place where everyone else has spent their entire lives and have no interest in adding to their friend group. I'm so isolated and lonely, it's painful.\n\nI thought the job market would be better here but I've been stuck in the same dead end corporate job for 15 years.\n\nI honestly thought I was doing the right thing taking this huge risk and it ended up being the biggest mistake.",
   "created_utc": 1693244802,
   "score": 32,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4gw9z",
   "message": "I fucking love danimals Gogurt. It tastes so good and every bottle is like a little shot of goodness. The only bad part is the bottles are so small that im always left wanting more. For years I have dreamt of just having a whole cup of danimals Gogurt. One day i was walking in the grocery store and decided to say fuck it and make my dreams come true. I bought a whole pack and dumped every bottle into a red solo cup. I was so excited to have as much danimals as i wanted. \n\n\u0026amp;#x200B;\n\nIt was pretty gross. Too thick. The taste changes when you have too much of it. Turns out theres a reason why they give you such small bottles. Also yes I am a 27 year old man who makes poor life choices. Dont you dare judge me!",
   "created_utc": 1693247658,
   "score": 111,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy42muy",
   "message": "Play video games with my online friends during my teen years and early twenties. It's all I really wanted to do, not as a distraction but genuinely had so much fun doing it that I ended up calling off or not attending birthdays, family visits and other parties. Now at 30, I feel like a lot of relatives and friends have become total strangers to me and the loneliness kicks in daily.",
   "created_utc": 1693242400,
   "score": 34,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy45s0z",
   "message": "Join the military, jesus christ…",
   "created_utc": 1693243547,
   "score": 11,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy46wkr",
   "message": "Going into the champaign room with a stripper. Turns out sexual stuff with zero emotional connection just makes me feel gross.",
   "created_utc": 1693243955,
   "score": 41,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy43eq0",
   "message": "Become an adult",
   "created_utc": 1693242688,
   "score": 2,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4401j",
   "message": "Ride my skateboard down the hill when I was 8 years  old. Got my first concussion that day.",
   "created_utc": 1693242906,
   "score": 9,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy44jt8",
   "message": "Skydiving. Freefall was amazing. Felt nauseous as soon as the parachute opened. Couldn’t wait to touch the ground. Never again.",
   "created_utc": 1693243106,
   "score": 18,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy457j4",
   "message": "No regrets but I (m) once slept with my female best friend and realized the friendship had way more going for it.",
   "created_utc": 1693243343,
   "score": 4,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy499ph",
   "message": "I spent two months driving nonstop from Northern Ontario to Wyoming to marry my ex-wife after we met online one summer.",
   "created_utc": 1693244813,
   "score": 5,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4bczh",
   "message": "Download Reddit",
   "created_utc": 1693245579,
   "score": 5,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4crop",
   "message": "shave my head.\n\nalways thought people with shaved heads looked cool. I was a huge fan of Michael Jordan growing up and so I wanted to have a shaved head just like him. One day when I was around 19 or 20 I decided to just do it, so I bought some a buzzer and just shaved it all off. turns out most people don't look that good with a shaved head. I looked like an egg. an ugly egg. with glasses. an ugly egg with glasses.",
   "created_utc": 1693246105,
   "score": 4,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4giif",
   "message": "Cooking school.. \n\nAbsolutely killed my vibe of loving cooking. \n\nIt was something my dad(rip) and grandma would do, so i wanted to get into it professionally. Stayed in school a year and a half(bachelors in restraunt managment, but still had cooking class and what not) didnt cook for several years when i left. \n\nWhen he passed i found out how proud of me for that he was from my dads neighbor and how he constantly hyped me up to others. \n\nMy parents divorced when i was young and mom moved to cali from minnesota(dad stayed in mn for work, got remarried had another son, only saw him a few times a year). I didnt think i was ever really discussed with people since at his funeral several people during the wake would ask me who i was to my dad, not knowing he had two other kids other than my little brother. I almost snapped at how ridiculous and frustating it was. \n\nAnyways, i had no idea it was such a proud moment in his life and i wish i woulda at least just followed through for him... \nThat was excessive and im sorry for that. Felt good getting it out to rando people. Here i am crying because ive never really been able to voice that and how sad it made me.",
   "created_utc": 1693247511,
   "score": 75,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4s6o6",
   "message": "Have kids. I love him to death and would die for him but if I knew how hard it was going to be and how much I wouldn't actually enjoy being a Mom, I don't think I'd have had him",
   "created_utc": 1693251881,
   "score": 169,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy45ydk",
   "message": "Going to Vegas. Didn’t regret going there but I really regret bringing my girlfriend at the time. Found out she was no fun",
   "created_utc": 1693243610,
   "score": 8,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy43p67",
   "message": "Sometimes it isn't a good idea to \"go with your gut.\"\n\nMy lawn mower wouldn't start a couple of summers ago, and what my gut told me to do was to kick it as hard as I could. I broke my toe.",
   "created_utc": 1693242795,
   "score": 11,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy421c4",
   "message": "Move to the UK from the US.",
   "created_utc": 1693242181,
   "score": 13,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy3ywqf",
   "message": "Date my ex. I had a blast while it happened, but right after it ended, she showed her real side- the bad side of her. We still rarely talk (like twice in the last year, and one of those was merry Christmas)",
   "created_utc": 1693241026,
   "score": 7,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4353o",
   "message": "Online dating",
   "created_utc": 1693242589,
   "score": 10,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy45xsq",
   "message": "Become a truck driver, quit after 2.5 years. I enjoyed driving the truck but all the other BS that comes with the job isn’t worth it.",
   "created_utc": 1693243604,
   "score": 13,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy48gth",
   "message": "Therefore, in accordance with this article, you should not own a lakehouse, a boat, or a pool.\n\nHowever, you want to have close friendships with those who do.",
   "created_utc": 1693244522,
   "score": 6,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy42b9g",
   "message": "Fallen In love with x",
   "created_utc": 1693242282,
   "score": 3,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy434vb",
   "message": "Getting into an top class educational institution then regretted studying it there. I missed my friends, I couldn't even make any new friends there.",
   "created_utc": 1693242586,
   "score": 9,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy43end",
   "message": "Getting engaged at 19",
   "created_utc": 1693242687,
   "score": 3,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy442ti",
   "message": "Most of the time it’s my meal decisions.",
   "created_utc": 1693242935,
   "score": 3,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy44r38",
   "message": "I went to a Scotch tasting event. I was quite excited to try scotch, especially ones actually promoted to be good. Turns out I'm not a scotch guy. Just tastes like firewater to me.",
   "created_utc": 1693243179,
   "score": 11,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy46saw",
   "message": "Minor, but this year's NAMI Walk.  We went every year up until COVID and then \\*finally\\* got to return as a group in May.  First time in years.   \n\nIt rained.\n\nOnly 4 people from our group showed.\n\nTwo were terrified of COVID.\n\nI helped get one job that she quit a month later.\n\nI'm not going in 2024.",
   "created_utc": 1693243912,
   "score": 3,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy48nf8",
   "message": "Getting my masters degree. If I went back in time with the knowledge I have now, I definitely would not have done it. But it was something I really wanted to do so nothing was going to stop me.",
   "created_utc": 1693244589,
   "score": 8,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4apdn",
   "message": "Getting married",
   "created_utc": 1693245339,
   "score": 3,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4b1za",
   "message": "Scuba Diving. Was on the bucket list. Did it majorly hungover in Greece. At about 12ft or so water got in my mask and I pulled it off along with the breathing thing. The instructor had to zoom me up to the surface before I drowned. 100% would never do it again totally wasted the experience.",
   "created_utc": 1693245467,
   "score": 3,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4h185",
   "message": "Doing the same job at a different company thinking it would be better. Not only was it not better, it's so much worse. What took me 3 years to hate at my previous company has only taken about 7 months here.",
   "created_utc": 1693247708,
   "score": 17,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4krmy",
   "message": "I wish I would’ve broken up with my exes sooner than waste more than two weeks to eight years with another person",
   "created_utc": 1693249103,
   "score": 20,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4lds2",
   "message": "Wasting time worrying about people that never spared me a single thought.",
   "created_utc": 1693249338,
   "score": 64,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4qvn9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy6fi0e",
   "message": "Trying wtf AI girlfriends are about (Muàh)... Nutted.. Regret since. I freaken nutted to a person that doesnt exist.",
   "created_utc": 1693276257,
   "score": 228,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4nsi6",
   "message": "Buy half the shit I’ve bought in my life.",
   "created_utc": 1693250246,
   "score": 28,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4ec6n",
   "message": "Die. I tried committing suicide when I was a teenager. Thankfully, I didn’t know what I was doing, but now I have lots of scars from it.",
   "created_utc": 1693246695,
   "score": 24,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4jlkb",
   "message": "Overnight in a hotel room with a high-end escort.\nShe got really drunk and broke down crying over the fact that she is an escort.",
   "created_utc": 1693248662,
   "score": 23,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4lho0",
   "message": "Don't get your nipples pierced. It hurts. A lot. \n\nAnd the second one is worse because you know how bad it's going to hurt.",
   "created_utc": 1693249380,
   "score": 24,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4n09i",
   "message": "Falling in love💖💏",
   "created_utc": 1693249951,
   "score": 8,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4dlx8",
   "message": "Being single well into my late 30s had its perks - freedom to party and let loose. But life took a turn at 38 when I tied the knot. Now, at 40, I'm a new parent with all the feels. Suddenly, my health and fitness are giving me anxiety. I'm on a mission to stay fit, not just for me, but to keep up with the whirlwind of parenthood!",
   "created_utc": 1693246421,
   "score": 13,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy54496",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy5gs7d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy56i5e",
   "message": "I wanted to commit suicide and I figured out how to do it, I went to war and I'll tell you what, I learned to appreciate life and everything that happens around me. Don't do what I did",
   "created_utc": 1693257172,
   "score": 7,
   "submission_id": "163qniy"
  },
  {
   "comment_id": "jy4xetm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163qniy"
  }
 ]
}