{
 "submission_id": "163rv05",
 "title": "What’s the fastest way you’ve seen someone going broke?",
 "selftext": "",
 "created_utc": 1693242784,
 "permalink": "/r/AskReddit/comments/163rv05/whats_the_fastest_way_youve_seen_someone_going/",
 "score": 80,
 "url": "https://www.reddit.com/r/AskReddit/comments/163rv05/whats_the_fastest_way_youve_seen_someone_going/",
 "comments": [
  {
   "comment_id": "jy4hkqf",
   "message": "My grandfather got taken in by scammers. They convinced him that my brother was arrested in a foreign country and wired them 25000. My grandparents were completely wiped out. They ended up having to sell their house.\n(Talk to your grandparents, y'all, or scammers will.)\n\nIt's not my brother's fault. But he never answers his phone, checks messages, or returns calls. If I need to reach him, I call his wife.",
   "created_utc": 1693247909,
   "score": 161,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy44kt0",
   "message": "My dad lost all his life savings into slots machine.",
   "created_utc": 1693243116,
   "score": 24,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4fzsp",
   "message": "Wallstreet Bets.  Making super risky investments with money they don't have.",
   "created_utc": 1693247316,
   "score": 56,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy448yl",
   "message": "Drug addiction. I’ve known a few people that thought it was a short term thing they could just move on from. Most of them very quickly ended up with nothing.",
   "created_utc": 1693242997,
   "score": 185,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4fa8m",
   "message": "I heard this 2nd hand so take it what you will, a friend of a friend, had his father die and his family divided out the inheritance of $300,000, this was divided between the son, daughter, and wife, so each got $100,000ish  the home they all lived in was almost paid off like $3,000 left on the mortgage.  All three pissed away their inheritance, and they missed the house payments and their home got foreclosed on.  The son was found dead in an abandoned Motel, died from an overdose, it was the last overdose at that building as the city condemned the building and tore it down afterwards.\n\n\u0026amp;#x200B;\n\nThe span of this entire story was less than a year.",
   "created_utc": 1693247050,
   "score": 21,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4c8ku",
   "message": "definitely gambling... when I lived in Vegas it was seriously depressing going to some of the off-strip casinos like Sam's Town and seeing elderly, on oxygen, smoking cigs, glued to the chair of the slots all day...",
   "created_utc": 1693245907,
   "score": 182,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4hdgb",
   "message": "(Young) Guy my family knew lost his parents in an automobile accident due to someone's negligence. He inherited money from his parents, enough to be comfortable in retirement if he did the smart thing. Won even more in a subsequent law suit.\n\nHe did *not* do the smart thing. Bought a large house, several sports cars, let everyone know he had money. Was apparently a non-stop party. Always had women coming through as he had a pool. Didn't invest any money in anything other than the house, which was far too big for one person, at any rate.\n\nTook him 3 years to blow through money that could have lasted 60. As soon as the money dried up so did his 'friends.' Not entirely certain where the guy is now.",
   "created_utc": 1693247834,
   "score": 194,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4jfa8",
   "message": "My daughter recieved 200K from an accident she had when she was 19, she spent every single penny in less than a year. Of course people leeched on to her and she bought relationships.  She is addicted to fentanyl now, has cut me out of her life, and is homeless.  Thats her story. I wish it was different, but its not",
   "created_utc": 1693248597,
   "score": 92,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4byos",
   "message": "I used to be a bar fly. The amount of people I saw throwing their entire paycheck away to keno machines was insanity to me.",
   "created_utc": 1693245804,
   "score": 209,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4ehbq",
   "message": "Guy at my work invested in a beanie babies store back when it was the craze.\n\nAnother co-worker fell for some internet scammer who strung him on for months. \n\nAnother co-worker dropped $80K cash on a sports car, didn't insure it properly because he couldn't afford  the insurance, then promptly totaled it.\n\nAnother co-worker bought a REAL Rolex for $6K. It wasn't real.\n\nGot lots more.",
   "created_utc": 1693246749,
   "score": 95,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy444k2",
   "message": "Scratchers and lottery. I was working in a gas station and that old man was coming mostly everyday to spend $50-$100 in these shits. He suddenly stopped to came and I’ve learned later that he went into bankruptcy.",
   "created_utc": 1693242952,
   "score": 28,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4f1w4",
   "message": "Marrying an idiot and then investing everything into a business for them.",
   "created_utc": 1693246962,
   "score": 121,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4a2a6",
   "message": "Had a buddy at Ft Gordon who spent almost his entire paycheck on a back tattoo. Every month for maybe 6 months. He couldn't afford to go out and do anything and I actually paid for him to come to my own birthday dinner. It was an absolutely epic dragon tattoo though.",
   "created_utc": 1693245103,
   "score": 201,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4ef3o",
   "message": "I have seen several young men lose all their savings to crypto. These finance bro influencers are convincing a bunch of gullible kids they can become millionaires in a second with that crap. \n\nThe way they target insecure young men and sell it to them as some weird self improvement thing the way MLMs do, sprinkling social commentary into their content and making they pay for a bs course that's gonna teach them how to \"get rich with crypto from home\" and \"become the best version of themselves\", it's just sad, man.",
   "created_utc": 1693246726,
   "score": 93,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4cy4r",
   "message": "I knew a guy many years ago who snorted his construction company up his nose in a very short time.",
   "created_utc": 1693246172,
   "score": 71,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy45uuk",
   "message": "I had a roommate who had to move out because he got drunk and blew all his money at a strip club 💀",
   "created_utc": 1693243575,
   "score": 32,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4g9xc",
   "message": "I watched a guy at a blackjack table in Atlantic City drop $50K in rather short order.  He played $1,000 max on each hand, and played each hand like he’s never played blackjack before.  Dealer showing a 5 and he has 18… hit!  Dealer has a 10 and he he had a 13, stay!  I don’t think he won a single hand.  After he dropped $50K (at that point, I was playing table minimum just to watch this shit show) he started yelling at the dealer and the pit boss.  He kept screaming at them, “how the hell am I supposed to pay my mortgage now!”  He ended up being removed by security as he was getting very aggravated.\n\n\nMoral of the story folks.  Bring cash when you go gambling, and only bring how much you are willing to spend on entertainment that day.  Stay away from the ATM.  This way, you aren’t spending your needed funds.  If you win, you leave with some extra cash.  If you lose, you spent a set number that you decided was worth the entertainment.  If you break even, you had a free day of entertainment!  Be smart at the tables, don’t be this guy!",
   "created_utc": 1693247423,
   "score": 117,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy47hl7",
   "message": "Gambling addiction is serious. My best friend lost everything",
   "created_utc": 1693244167,
   "score": 79,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4fpd4",
   "message": "We attended an award ceremony in Tahoe where they gave them their sales bonus checks.   \nI watched 30 people blow checks in excess of 25,000 within just a few hours.",
   "created_utc": 1693247206,
   "score": 59,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4j8np",
   "message": "A family member loaned almost all her money to her baking class teacher because she needed it for her mom’s emergency surgery. They did some paperwork to make sure this lady was going to pay back, but it’s been 3 years and she never did. My relative texts her every month asking her when she’ll pay back but this lady always has different excuses not to pay. It wasn’t a looooot of money, but it was all my relative had saved up by the. It pisses me off she loaned that money for a “good cause”, because it seems it was a scam all along. Lessons learned though, no matter how sad is the story, do not loan money to anyone.",
   "created_utc": 1693248529,
   "score": 109,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy47vs0",
   "message": "Crypto. I had a friend who kept telling us all how much money he was going to make on one of them (I want to say doggycoin but I don't think that's quite the name).\n\n\nShit collapsed and he lost his life savings.",
   "created_utc": 1693244310,
   "score": 147,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4drud",
   "message": "I owned an old, closed, repossessed bar in a small town in Michigan.  Bought it dirt cheap and because it had two crappy apartments above, I put it up for 140,000$. It had potential but needed a shit ton of work.  This guy bought it on a land contract with 20,000 down.  He made one payment and went bankrupt.  In essence, he gave away 20,000!  I knew something was strange because when he came to the closing and the lawyer asked for the 20k check he said he didn’t have it. The lawyer looked at me in amazement………I said can you get it and he said yea, take me to the bank.  So I hustled his ass over there and we closed the deal.  After he went bankrupt the place was mine again and I sold it a second time.  I have no idea what the guy was thinking.",
   "created_utc": 1693246484,
   "score": 41,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4ehgy",
   "message": "Giving money to one of those military romance scams and this lady had a tight income. This wasn't the first time she did it.",
   "created_utc": 1693246750,
   "score": 86,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4hrkv",
   "message": "I used to be a table games dealer at a casino. I watched a very rich woman go to a very poor woman within about a year. She had businesses in NYC and lost everything.  In the end, she stood up on the chair at my blackjack game and sobbed until security removed her. I think her brain snapped.",
   "created_utc": 1693247981,
   "score": 167,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4ashl",
   "message": "Knew somebody who opened 2 restaurants in a city they don't live in. Not only that but one of the biggest cities in the world. One was a bakery, and one was a place that specialized in dumplings. It was just the stupidest thing I've ever witnessed and he dragged a high-school friend into his sinkhole. A large part of the reason he did this was because of some sibling rivalry bs he had - his brother was contemplating opening a small sandwhich shop and it drove idiot boy insane that he may become more successful. People are stupid sometimes.",
   "created_utc": 1693245370,
   "score": 231,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4h9fu",
   "message": "We had a local businessman whose FIL died and left his wife and him $200 million following the sale of FIL’s very successful business. He pissed it away over the course of a decade with bad decisions on businesses and property purchases. He and his wife wound up insolvent and living in a 1200 square foot rental house in a tract home neighborhood. The sad part was that he sent his daughter in to court on proceedings like judgment debtor exams rather than taking personal responsibility for the bad decisions he had made.",
   "created_utc": 1693247793,
   "score": 27,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4gj70",
   "message": "Divorce. My buddy went from being in a dual income family with a nice home to living paycheck to paycheck, and sleeping on a mattress on the floor of an empty apartment. It basically crippled him financially for 15 years.",
   "created_utc": 1693247519,
   "score": 74,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4axcn",
   "message": "watched a friend turn $40 into $600 and then $600 into $0\n\n\u0026amp;#x200B;\n\nwhy don't people quit when their ahead?",
   "created_utc": 1693245421,
   "score": 64,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4uhwu",
   "message": "2 months of bone cancer was one of the faster non-gambling ones I have seen from decent middle class wealth.\n\nA lot of cancers or severe trauma injuries lead to bankruptcy.",
   "created_utc": 1693252721,
   "score": 132,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4feaj",
   "message": "Lived with a chap who sold his flat to finance going back to college at the age of 40.  He had something like £20k in the bank when he started.\n\nTurns out he wasn't very good at self control with that sort of cash in the bank.  Within a few months, he was off his head on crack cocaine and bringing prostitutes to the house - at least one of whom I swear wasn't even sixteen years old.\n\nPretty sure he was claiming benefits by the end of the year.  I hope to Christ he never completed his course, because it was in aircraft mechanics.  If he'd completed it, he could be repairing the next plane you get on.",
   "created_utc": 1693247092,
   "score": 64,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4bl4g",
   "message": "Lost 27 BTC online gambling in a weekend 💀",
   "created_utc": 1693245661,
   "score": 194,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4imay",
   "message": "A friend’s father died from cancer and his life insurance policy as well as a settlement from the Border Patrol (he patrolled a section in El Paso along the ASARCO Superfund site) paid over $400,000. His mother and brother burned the money up in less than a year. She was heavily addicted to QVC home shopping and burned nearly $300,000 there alone. The lost their home to foreclosure and ended up evicted from their new apartment a year later. Once he and his wife we able to fully break away from his mother and brother, his life finally stabilized.",
   "created_utc": 1693248299,
   "score": 92,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4icef",
   "message": "In March 1968 l was about to get out of the US Army. We had a guy in our unit re up for 6 years. Back then they had some kind of formula where they took your MOS ( military job ) your present rank and the number of years you were going to re up, and gave you a bonus. This guy had a huge chunk of money. He bought a beautiful shinny Chevy Malibu. He had it like 3-4 days and totaled it. He had no insurance on it. He had no money and owed the Army 6 more years.",
   "created_utc": 1693248195,
   "score": 131,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4ajmy",
   "message": "I know someone who way overextended themselves staking Luna for the insane yield before it blew up. He remortgaged his house to buy in even harder so he wound up in significant debt as well.\n\nHe's ok because the rest of his family is wealthy and more or less bailed him out but that was a breathtakingly quick fall.",
   "created_utc": 1693245281,
   "score": 181,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4hfqu",
   "message": "Options trading. Best to leave it for the Wall Street people. It’s basically gambling. People don’t fully understand what they are buying.",
   "created_utc": 1693247857,
   "score": 43,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4jphw",
   "message": "Saw it happen to my uncle. When I was a kid, I remember he used to be the \"rich uncle\" with the big house and nice cars. We didn't see him or my cousins for about a year and the next time we saw him, he had moved to a very small house and seemed to only have one car. Didn't really made me think much of it, but even as a kid I knew something was up. \n\nEventually when I got older my parents explained to me that he ended up getting involved in a medical tech scam and pretty much got fleeced from his entire fortune.  \n\nIt was insane to see his fall as a kid tho. I remember he would always splurge on all of us and then one day he stopped which, as a kid, was weird to see.",
   "created_utc": 1693248704,
   "score": 36,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy46sz8",
   "message": "Going out fir two hours in vegas and spending it all on hookers, drugs and expensive $30 drinks",
   "created_utc": 1693243919,
   "score": 133,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4t0kb",
   "message": "An alcoholic BIL blew the last few thousands of dollars of his inheritance money playing online slots. His parents (who were Depression-era) saved their entire adult lives to leave him and his brother an inheritance, but unfortunately it was spent on a few stints in rehab that didn’t work, and on gambling. He then tried to guilt-trip his brother (my husband) to send him HIS inheritance money. I got between them and stopped it.",
   "created_utc": 1693252184,
   "score": 35,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4bmkc",
   "message": "Wallstreetbest",
   "created_utc": 1693245676,
   "score": 135,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4capf",
   "message": "Cocaine and hookers. It's not cheap. Apparently...",
   "created_utc": 1693245929,
   "score": 25,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4cqfg",
   "message": "Using credit to climb the property ladder when the bubble burst.",
   "created_utc": 1693246092,
   "score": 30,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy43rwd",
   "message": "Old friend of mine lost 12k on a trip to vegas",
   "created_utc": 1693242823,
   "score": 75,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4w3jr",
   "message": "Dunno if he's broke, but I once saw a guy spend $44 Billion on a social media platform worth a fraction of that",
   "created_utc": 1693253306,
   "score": 116,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy489uu",
   "message": "Divorce. Seen very wealthy men go destitute in days fighting every little thing to get back at the ex while also paying for her legal counsel who also did the same. Ex paid for nothing, walked away with little, but that guy had nothing. \n\nDivorce can be the most expensive thing a person can go through.",
   "created_utc": 1693244451,
   "score": 140,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4csb2",
   "message": "My work husband and I were talking about this last night: Guy retired to Florida and sold his INSANELY successful live music venue bar that had a quirky themed bar menu and drinks. He told the people he sold it to to not change a THING because it had taken him years to figure out this successful formula.  Place had name recognition like crazy, and the food was actually good and the bouncers kept the patrons well-behaved.  \n\nThey bought it in June, the start of the busy summer bar season.  They just closed last week. \n\nThey...killed the live music, tried to turn it into a fancy sit down joint, and gave it the same menu as the three other restaurants they owned. Oh and they changed the name. \n\nDude is LIVID because he sold them a golden goose and they killed it.",
   "created_utc": 1693246111,
   "score": 145,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4ug33",
   "message": "Work at a bank- online gambling and romance scams. They’re brutal.",
   "created_utc": 1693252702,
   "score": 23,
   "submission_id": "163rv05"
  },
  {
   "comment_id": "jy4qo56",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163rv05"
  }
 ]
}