{
 "submission_id": "163swvf",
 "title": "What are horrific details of the World Wars nobody talks about?",
 "selftext": "",
 "created_utc": 1693245142,
 "permalink": "/r/AskReddit/comments/163swvf/what_are_horrific_details_of_the_world_wars/",
 "score": 97,
 "url": "https://www.reddit.com/r/AskReddit/comments/163swvf/what_are_horrific_details_of_the_world_wars/",
 "comments": [
  {
   "comment_id": "jy4kf2o",
   "message": "How much rape was used as a weapon.",
   "created_utc": 1693248972,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4eqgr",
   "message": "US government commissioned filming of the death camps after WW2 because our leaders knew there would be denialists.... There are still denialists.",
   "created_utc": 1693246843,
   "score": 162,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4de0z",
   "message": "in ww1.\n\nmost soldiers died to disease and infection rather then bullets and bombs.\n\ntrench foot, dysentery, sepsis, gangrene. just to name a few things.",
   "created_utc": 1693246338,
   "score": 57,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4wcc9",
   "message": "The amount of rape, assault and murder by solders on all sides committed against civilians will never be known.  It can be estimated, but the estimates are probably low as a lot of crimes were never known, investigated or prosecuted.",
   "created_utc": 1693253397,
   "score": 47,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4dhq3",
   "message": "Cannibalism. I’ve gotten banned on other subs for going into any more detail but let’s just say there’s graphic stories in the extended family from survivors of blockades.",
   "created_utc": 1693246377,
   "score": 200,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4ajvi",
   "message": "A lot of the soldiers were kids in their teens or early 20s.",
   "created_utc": 1693245284,
   "score": 215,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4bw45",
   "message": "WW1 was so pointless! I know war is generally pretty futile but wow it may never be topped in how pointless. Killing 10k people to move forward 100 feet only to lose it next week. Generals spent men's lives like Monopoly money. If I talk about it too long I get worked up. I'm already gritting my teeth.",
   "created_utc": 1693245776,
   "score": 17,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4xudy",
   "message": "China destroyed dam and [flooded few provinces](https://en.wikipedia.org/wiki/1938_Yellow_River_flood) killing 500000 citizens to stop Japanese offensive. It did not work.",
   "created_utc": 1693253949,
   "score": 55,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4rlp2",
   "message": "Probably city bombing from both sides. I find it ironic that people spend so much time arguing about the nukes when conventional city bombing was so much worse.\n\nEveryone knew that city bombing didn't break morale as intended, in fact, it emboldened people, but they did it anyway.",
   "created_utc": 1693251668,
   "score": 122,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4od52",
   "message": "After WWII many Holocaust survivors killed themselves",
   "created_utc": 1693250460,
   "score": 45,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5z3v4",
   "message": "There’s a lot. \n\nJews returning to their homes after the Holocaust were often victims of pogroms and lynchings by the new residents installed in their stolen properties by the Nazis and their client states. \n\nThe Jewish population has never recovered from World War II. There were more ethnic Jews in 1931 than there are today.\n\nAnyone unable to work at a death camp was murdered on arrival. Both the Germans and the Japanese forced entire civilian populations into lines, forcing each row to dig their own mass grave before murdering them and handing over the shovel to the next row.\n\nThe entire Porajmos is almost completely unknown, and Germany didn’t recognize it until the 80s. \n\nMillions of ethnic Germans were kicked out of their ancestral homes in Eastern Europe after the war and forced into Germany. \n\nThe Japanese, Germans, and Soviets are infamous for their mass rapes. \n\nThe Japanese forced sons to rape their mothers and fathers to rape their daughters. \n\n1 in every 3 western POWs held by the Japanese died of torture, disease, or starvation. \n\n80% of Soviet men born in 1923 died in the war. 25% of Belarus’s prewar population, 17% of Poland’s, and 9% of Germany’s prewar population died in the war.\n\nThe Japanese were training women and children to charge at American soldiers with sharpened sticks. The estimated American death toll for an invasion of Japan was anywhere from over 500,000 to over a million. They printed so many Medals of Honor for the campaign that they haven’t done another run since.",
   "created_utc": 1693269123,
   "score": 21,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4hfxy",
   "message": "Japanese atrocities in China.",
   "created_utc": 1693247859,
   "score": 68,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy50dtx",
   "message": "French collaboration with the Nazis, including actively fighting against the allies. French resistance to occupation was incredibly niche in comparison to collaboration. De Gaulle did an excellent job of whitewashing after the war.",
   "created_utc": 1693254891,
   "score": 51,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy60vl1",
   "message": "How the Nazis had plenty of volunteers in the countries they invaded who were incredibly eager to help them with the Holocaust. When they occupied France they were inundated with people turning in their Jewish neighbors. And even after the war was over, Jews returning to their homes were still being murdered by their neighbors.",
   "created_utc": 1693269873,
   "score": 17,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4iysa",
   "message": "So many atrocities committed in the WW2 Pacific theater. Like I listened to a description in Dan Carlin's Hardcore History podcast series Supernova in the East where he talked about how Japanese soldiers took a captured allied soldier and took turns anally raping him before they put a bayonet up his ass. I don't mean to single out the Japanese. I think Japan has a wonderful culture and we're all capable of these sorts of atrocities. It's just one that sticks out in my mind.",
   "created_utc": 1693248428,
   "score": 74,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4l5lw",
   "message": "Among many other crimes against humanity that they committed. The Japanese would also eat their prisoners as a sign of disrespect",
   "created_utc": 1693249251,
   "score": 23,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4q27i",
   "message": "I don't think there's any aspect of the World Wars the hasn't been discussed to death.\n\nThey're probably the most written-about wars in human history.",
   "created_utc": 1693251097,
   "score": 21,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4x54q",
   "message": "Fire bombing in Japan killed more people than the atomic bombs",
   "created_utc": 1693253692,
   "score": 20,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4zt52",
   "message": "The systematic rape of Germany's women by the red army after they seized control",
   "created_utc": 1693254676,
   "score": 22,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4guxv",
   "message": "The smell.",
   "created_utc": 1693247643,
   "score": 11,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5xsam",
   "message": "War gives free rein to pedophiles, rapists, psychopaths and sadists among the troops,  who get away with it because their targets are the enemy.",
   "created_utc": 1693268563,
   "score": 11,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4sxss",
   "message": "A lot of violent rape of all descriptions.  Old, young, gang, death etc.  it’s not like it’s not talked about but it’s this weird acceptance that it’s awful, it happens and let’s move on",
   "created_utc": 1693252156,
   "score": 10,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6790r",
   "message": "During WWI, the leaders of Russia, Germany, and Britain were first cousins. Their family spat escalated into the deadliest war humanity had ever seen. Most of the tension was related to colonial territory disputes. That family wanted to steal, rape, enslave, and murder innocent people so badly that they ended up fighting each other over it.",
   "created_utc": 1693272611,
   "score": 8,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4efxi",
   "message": "As part of their extermination efforts, the Nazis used [gas vans](https://en.m.wikipedia.org/wiki/Gas_van) on undesirable people. Basically vans set up to redirect exhaust to the passengers to kill them. They apparently worked but were slow and had a very bad psychological effect on drivers because they could hear the screams.",
   "created_utc": 1693246734,
   "score": 15,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4oj6c",
   "message": "In both world wars, more civilians were killed than combatants. That does not count extermination camps. \n\nIt's been true for war since...well even the ancient Greeks recorded it. Civilians die in war *a lot*. WWII saw approximately 2 civilians die for every combatant (again, still not counting extermination camps, if you count them it goes up to about 4.5 civilians per combatant), WWI saw about 1.1:1, just barely more civilians died compared to combatants. That is considered a very safe war to be a civilian in.",
   "created_utc": 1693250524,
   "score": 16,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4ydx9",
   "message": "Nanking massacre",
   "created_utc": 1693254152,
   "score": 7,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy65lhm",
   "message": "Unit 731 is pretty dark if you read into it.",
   "created_utc": 1693271893,
   "score": 7,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4lajv",
   "message": "Its definitely being talked about more nowadays which is good, but the war crimes and collaborationism with the Nazis and SS that the Wehrmacht did during WW2 was almost seen as a taboo topic to talk about post war.\n\nThe common idea around the time was that the Wehrmacht was just the German army, and wasnt complicit in the slaughter of millions of innocent people. They werent just complicit, they actively participated in the slaughter. Wehrmacht troops would help SS soldiers burn villages down on the Eastern Front and line up civilians to shoot on the Western. Luftwaffe soldiers were often camp guards later on in the war as well.\n\nIts the same with Erwin Rommel. He is almost diefied as the general who tried to assassinate Hitler, the \"honourable German\", yet he was friends with Hitler, and didnt mind committing a war crime or two in Africa.",
   "created_utc": 1693249303,
   "score": 28,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4y8gw",
   "message": "It seems like the entire pacific theatre of WWII is a horrific detail nobody talks about. But, if you want an example; read about Matsuhiro Watanabe. Or, read about Jan Ruff O'Herne.\n\nThere was a lot of nasty ugliness perpetrated by the Japanese in WWII, people who did things that would have gotten themselves hung at the Nuremberg trials were allowed to go work as insurance salesmen. There are obvious political reasons for this, firebombing Tokyo and nuking two cities might have evened the score a little bit, but the result of that political cover has been the relegation of the true horror of the pacific theatre to those who actively look for it or who were fortunate enough to take a history class in college.",
   "created_utc": 1693254097,
   "score": 6,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5ybst",
   "message": "Guys on the front lines who had no clue what they were fighting for and absolutely scared out of their minds.  From all countries.",
   "created_utc": 1693268792,
   "score": 6,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy69z4i",
   "message": "Unit 731 comes to mind.",
   "created_utc": 1693273810,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4vugq",
   "message": "Japan was just as bad, if not worse than Germany during WW2.",
   "created_utc": 1693253214,
   "score": 15,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5i3lt",
   "message": "The United States Government’s internment of Japanese-American citizens during WW2 is barely talked about anymore",
   "created_utc": 1693261856,
   "score": 9,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy585wt",
   "message": "The total death toll. Growing up in USA they taught us about the 400k Americans and Jewish death toll between. 3-8 million, and total death count somewhere between 55-80 million. Kind of blew my mind that so many countries we didn't focus on lost such a huge % of their population. Also that American pilots bombed and killed more Japanese than the atomic bombs. Every time I bring it up, phones come out and people are like \"woah\"",
   "created_utc": 1693257815,
   "score": 7,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy62hot",
   "message": "Read about 30 July 1945, United States Ship (USS) Indianapolis sinking. HORRIFIC",
   "created_utc": 1693270561,
   "score": 3,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy687fu",
   "message": "That Stalin was worse than hitler. Everyone knows but hitler lost making him the ultimate bad guy. Stalin killed more of his own people instead of others. Mao did the same in china",
   "created_utc": 1693273034,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy68gpe",
   "message": "750 troops died in the rehersal of the Normandy landings, this was then covered up.\n\n\"As a result of official embarrassment and concerns over potential leaks just prior to the real invasion, all survivors were sworn to secrecy about the events by their superiors\"\n\nhttps://en.m.wikipedia.org/wiki/Exercise_Tiger",
   "created_utc": 1693273148,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy69srs",
   "message": "Stalin refused to evacuate non-combatants from Stalin grad during the fighting",
   "created_utc": 1693273734,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy58ys2",
   "message": "In Europe:\n\n[https://en.wikipedia.org/wiki/Aktion\\_T4](https://en.wikipedia.org/wiki/Aktion_T4)\n\nWe talk about the genocides in the death camps in WWII a lot. We don't talk about how Germany treated minorities outside the death camps.\n\nThe gas chamber technology was first tested on disabled (particularly mentally disabled) people, including children. Aktion T4 later expanded to include any demographic the Nazis hated. Aktion T4 was only named after WWII, just to be clear, but it was pervasive around all health care in Germany from the mid 1930s until 1941 and was crucial in the ideology and methods that led to the Holocaust.\n\nDoctors were told to make lists of people who weren't fit to be sent to the front, and in the hopes that they'd be able to let shell-shocked people or physically injured people recover fully, they tended to be very generous with the definitions, and the Nazi officers didn't really discriminate about that and just killed them anyway. Parents were pressured into consenting to it for their children. Hitler personally ordered Aktion T4, when normally he'd get someone else to order for death programs for deniability. They hid what happened to people and blamed messed up paperwork and so on for disappearances, and pneumonia for any deaths. The last Aktion T4 death of a child happened 3 weeks after the town she was in was liberated. All German Jews who were hospitalised were killed in 1940. Deaths were decided by a panel of \"experts\" and only 3 of them had to agree to validate the killing.\n\nBy 1941, about 100k deaths happened, and while that was when it officially ended, many doctors kept it up until 1945, so there can only be estimates of total deaths, but it might be as high as 300k deaths. Prior to WWII, a further 360k people were sterilised under Aktion T4. All because the Nazis didn't want the risk of \"contaminating\" their population with poor genes, which included many things that absolutely were not even genetic. The idea was propagated thanks to the claim that the weakest men stayed behind and the \"best\" men went to die on the front in the war, so they were selecting as a society for weak genes, and... somehow that wasn't seen as an argument to *not start a world war*?\n\n\u0026amp;#x200B;\n\nIn Asia:\n\nIn Western Europe and the USA, no one really talks about the Japanese involvement in WWII. It's white washed a lot, and it's definitely political finagling. The main stand out I know of is:\n\n[https://en.wikipedia.org/wiki/Unit\\_731](https://en.wikipedia.org/wiki/Unit_731)\n\nWhen German troops (to be clear: actual literal Nazis) inspected Japanese pow camps, they told the Japanese people they were going too far and basically to chill out. Imagine how bad these places had to be for the literal Nazis to somehow be the reasonable ones in the situation. Make it worse. That's Unit 731.\n\nThey literally counted people as \"logs\" because that's how expendable their victims were to them, and because it gave them an alibi as a logging camp. While the camps in Poland run by Josef Mengele did have some scientific *point* even if they were seriously disgusting methods that no one should use and the knowledge could never be worth the cost, none of the experiments in the Japanese pow camps had any serious scientific purpose to them and seemed to solely be designed to cause as much pain as possible. I'm pretty sure the post will be deleted if I go into detail, but name an awful death; it happened.\n\nThere were no survivors. They gassed or shot any prisoners who survived until the Red Army got close. The \"scientists\" were mostly not tried, and some of them got funding to work in the USA. The story was played down, and one of the main theories is that the USA was (and is) too racist to care about how the predominantly Chinese victims were treated.",
   "created_utc": 1693258130,
   "score": 10,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4o78w",
   "message": "That even the good guys committed some truly horrific war crimes.\n\nThe Americans and British absolutely loved napalming large cities down to ash. Not to destroy weapons factories but to terrorize and kill the population. A lot of people focus on the nukes dropped on Hiroshima and Nagasaki, but far far more people were killed and cities leveled by the non stop firebombings that preceded it.\n\nThe Russians threw tens of millions of bodies at bullets until the Germans ran out of bullets (common Russian tactic to this day). And then proceeded to mass murder and/or rape absolutely every civilian still left in Berlin they could get their hands on once the city was theirs.",
   "created_utc": 1693250399,
   "score": 15,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5g4mx",
   "message": "War brings out the worst in humanity, world wars do this in a global scale and all side commit what are arguably war crimes. The best out come is to win with the fewest war crimes",
   "created_utc": 1693261020,
   "score": 3,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy65h0w",
   "message": "the human experimentation by the nazis... you may have heard of a little or assumed it was happening but knowing about even one or two of them in detail is more than horror movie junkies can handle. one case for example was a pair of twins cut up and sewn to each other.. to see if they could survive. they couldn't but they studied the effects even after one twin had died still attached to the other.",
   "created_utc": 1693271839,
   "score": 3,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy694oi",
   "message": "The documented instances of both the Nazis and Japanese tossing babies into the air and catching them with bayonets.",
   "created_utc": 1693273444,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy69kjo",
   "message": "The reason why the Nazis began using gas chambers to carry out the Final Solution was because the Einsatzgruppen troops were getting PTSD from shooting Jews point-blank. So they began to search for less personal means of murder.",
   "created_utc": 1693273634,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6cqjm",
   "message": "After WWII, the LGBTQ people in concentration camps were not counted as victims of Nazism because homosexuality continued to be illegal in the successor German states. In fact the Allied forces left LGBTQ people in the camps after liberating other groups, as holding for movement to prison",
   "created_utc": 1693275026,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5wfhf",
   "message": "Unti 731 I will not elaborate find out yourself but be warned it makes the Germans look nice",
   "created_utc": 1693267991,
   "score": 7,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5tomh",
   "message": " Check out the podcast Hardcore History by Dan Carlin",
   "created_utc": 1693266819,
   "score": 4,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4lmj5",
   "message": "British role in the 1943 Bengal famine.",
   "created_utc": 1693249431,
   "score": 9,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4t93m",
   "message": "I visited the Monte Pasubio in italy and there were a lot of info signs about the ww1. At some point there was a diary entry or note of a soldier that said they rolled down mines the hill into the attackers over hours and the limbs and body parts of their opponents were flying around continously. They even blew up a whole mountain peak to execute thousand of people. Just thinking about this is horrifying as hell.",
   "created_utc": 1693252269,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy59tu0",
   "message": "rarely talked about: japan in WW2. like unit 731 as example.",
   "created_utc": 1693258470,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5cjur",
   "message": "WW1 was fought by generals who were still fighting a 19th century war, ignoring technological advances like machine guns and artillery. That's why men would be ordered to \"go over the top\" and charge the enemy, resulting in daily massacres.",
   "created_utc": 1693259541,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy66si9",
   "message": "Try searching about the Japanese unit 731 \n\nSome of the most horrific documented experiments  carried out on human test subjects they referred to as \"logs\" \n\n\nAnything from testing grenades on live people tied to stakes to carrying out operations while still alive and no anaesthetic and purposely infecting chinese farmers with diseases just to see what happened \n\n\nThere's more but seems like alot of people don't know about this unit",
   "created_utc": 1693272410,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy686yu",
   "message": "The cannibalism on the eastern front. Of course nobody really wanted to talk about it after the war because it’s such a taboo subject.",
   "created_utc": 1693273029,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6aoc0",
   "message": "For WW1: early flamethrower were devastating to be on the receiving end of given the cramped spaces of trenches and nerve wracking to be the operator off.  Another detail that is seldom mentioned is the devastating effects of shotguns, most notably the Winchester 1897 which could be loaded with a whole mix of nasty homebrew projectiles causing devastating wounds. Peak irony is that Germany tried to get them banned despite their own introduction of flamethrower.\n\nFor WW2: I find that a lot of the horrors of the war in Asia are heavily downplayed.",
   "created_utc": 1693274117,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6crmy",
   "message": "They actually stopped fighting and played football/soccer on Christmas. The Gaul of those soldiers!",
   "created_utc": 1693275039,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6dx4l",
   "message": "How many Americans / English / German soldiers raped women throughout the war on the European fronts.",
   "created_utc": 1693275553,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6e1l1",
   "message": "Nazis threw Jews into cages with bears and eagles, which would tear them to shreds: From New York Times article, 1988: [https://archive.is/7DuXO#selection-529.0-529.338](https://archive.is/7DuXO#selection-529.0-529.338)",
   "created_utc": 1693275608,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6e1td",
   "message": "People talk about the bomb, but fire bombings at Dresden and Tokyo were much worse.\n\nEdit: and the fact I'm saying something is \"much worse\" than being hit with a nuclear weapon says a lot.",
   "created_utc": 1693275610,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4rarb",
   "message": "What the countries under the occupation of the Allies went through in parallel, from famine to feed the soldiers, to forcefully sending people to the front to fight for them",
   "created_utc": 1693251557,
   "score": 3,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy55xe8",
   "message": "FAN FACT, This is kinda gorey btw\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt; In World War 2 most of the dentures where made from Porcelain and Ivory but and when some of the soulders died some other soulders ripped off there dead comrades real teeth and sold then to the Destists to make money off of them.",
   "created_utc": 1693256953,
   "score": 4,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6234e",
   "message": "Britain is not as innocent as you may think.  That is because history is written by the victors.  They committed some serious war crimes including but not limited to trying to starve all of Germany, turning almost the entirety of the North Sea into a mine field and declaring it a \"warzone\", and, probably most famously, smuggling weapons and other war goods on civilian ships",
   "created_utc": 1693270385,
   "score": 3,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4c5mq",
   "message": "The rich didn’t die the poor did!",
   "created_utc": 1693245877,
   "score": 4,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4i87g",
   "message": "as a Canadian... they were not our proudest moments...\n\nwe might've lost our cool a lil bit, and for that we sincerely apologies to our opponents.\n\n\u0026amp;#x200B;\n\nThe war crimes were uncool, I am sorry for taking no prisoners, I am sorry for faking a truce on Christmas, I am sorry for our frequent and brutal night raids keeping entire platoons of soldiers so tired they cannot fight, then slaughtering them all while there sleep deprived and defenseless.\n\nas I said, might've lost our cool... sorry.",
   "created_utc": 1693248151,
   "score": 3,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4luza",
   "message": "I don't think there are any. You could argue there are some details that most people don't know because they're uninformed, but both World Wars have been discussed and analyzed in excruciating detail. One happened a century ago and the other one almost a century ago, they're historical events that have been studied extensively and if nobody talks about some details these days it's just because talking about the World Wars is no longer something that happens as part of everyday life for most people. That is to say, pretty much nobody talks about the World Wars anymore at all, not just about some obscure horrific details that could be argued to be mostly unknown.",
   "created_utc": 1693249520,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy66mw6",
   "message": "The silent queer victims of the Holocaust. They weren't freed  1945 instead they were seen as criminals and put in prison. https://time.com/5953047/lgbtq-holocaust-stories/",
   "created_utc": 1693272341,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4kc8l",
   "message": "Following WWII Germans were persecuted, raped, and murdered at a staggering rate.",
   "created_utc": 1693248942,
   "score": 2,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5t6p8",
   "message": "The US enlisted tons of immigrants and minorities, and often sent them to do the most difficult missions.",
   "created_utc": 1693266607,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy5vaol",
   "message": "The incredible and indescribable wave of rape of German women by the Russians after they invaded. The Russian officers would hand out ink to women and told to splash it on the rapists just so they might catch them.",
   "created_utc": 1693267507,
   "score": 1,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4wsyx",
   "message": "That hitler tried to send the jews to other countries but they refused",
   "created_utc": 1693253567,
   "score": 0,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy4dtf2",
   "message": "Maybe not so much \"not talked about\" as \"talked about in a blatantly biased way\" -- the bombings of Hiroshima and Nagasaki. Even in *Canada* I grew up \"learning\" that it was justified and America needed to do it to \"win the war.\"",
   "created_utc": 1693246500,
   "score": 245,
   "submission_id": "163swvf"
  },
  {
   "comment_id": "jy6cgz9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "163swvf"
  }
 ]
}