{
 "submission_id": "164463d",
 "title": "What should a foreigner avoid while visiting the United States?",
 "selftext": "",
 "created_utc": 1693271468,
 "permalink": "/r/AskReddit/comments/164463d/what_should_a_foreigner_avoid_while_visiting_the/",
 "score": 25,
 "url": "https://www.reddit.com/r/AskReddit/comments/164463d/what_should_a_foreigner_avoid_while_visiting_the/",
 "comments": [
  {
   "comment_id": "jy72b12",
   "message": "If you are visiting a more rural area, like Montana where I live, don't underestimate the rural-ness. You might not be able to get a hotel in a small town and there are plenty ty of places where there aren't any hotels or accommodations.  You can take highway and run out of gas because there aren't any gas stations for 70 miles. Also, if it is a dirt road, and there are a lot of them in the rural U.S., don't ever assume that you will have cell/GPS reception or that the dirt road goes anywhere besides 50 miles into the mountains where you can get stuck or break down. It's hard to conceptualize for people who live in more populated areas. Your best bet is to plan ahead and read reviews. It is absolutely worth it to visit areas where there is wilderness. That is why I live here. That being said, it's dangerous in a different way than visiting a city.",
   "created_utc": 1693289238,
   "score": 129,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6y16z",
   "message": "Don’t be bullheaded when it comes to the weather. If the locals are worried, you should be worried.",
   "created_utc": 1693286275,
   "score": 17,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7h9qw",
   "message": "If you go to the national parks, don’t attempt to take selfies with the wildlife. A full grown bison will throw you through the air like a crumpled piece of paper.",
   "created_utc": 1693300888,
   "score": 74,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6drxr",
   "message": "driving from New York to LA.",
   "created_utc": 1693275489,
   "score": 239,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7pg1v",
   "message": "Leave all your stereotypes about America home, it's a hugely diverse country and your experience in one part of the US will be very different to your experience in another.  Keep an open mind and have fun.",
   "created_utc": 1693306683,
   "score": 59,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6cbhc",
   "message": "Don't smoke in public buildings, this is illegal. \n\nDon't smoke in someone's house, apartment, or condo without asking for permission. This isn't illegal, but it's still extremely rude.",
   "created_utc": 1693274841,
   "score": 177,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6nwgh",
   "message": "Gary Indiana",
   "created_utc": 1693280341,
   "score": 98,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6u9sy",
   "message": "Avoid talking about politics and religion.\n\nTaking weed across state lines.  It’s not legal everywhere.\n\nCriticizing the US too much.  We know what’s wrong with our country.",
   "created_utc": 1693283910,
   "score": 184,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6jwsu",
   "message": "Avoid looking lost and unorganized in areas of big cities with high crime rates. Dress functionally, always keep the illusion of knowing where you are and where you're going, pay attention to your surroundings. Bad people will target folks who look lost and unorganized more often than people who appear oriented.",
   "created_utc": 1693278322,
   "score": 132,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6czjz",
   "message": "Don't go to the big chain type places. Go to the mom and pop little restaurants and coffee shops and specialty shops. You will usually find new cool things you enjoy",
   "created_utc": 1693275136,
   "score": 58,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy68xlr",
   "message": "When visiting the U.S., it's best to avoid discussing sensitive topics like politics and religion with strangers, even if they bring it up. Also, be mindful of local customs and etiquette, as they can vary widely. And of course, don't forget to tip in restaurants—it's a common practice here. Enjoy your time in the States!",
   "created_utc": 1693273357,
   "score": 86,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy68drr",
   "message": "You should avoid any sweeping generalizations about the USA. The US is effectively 50 separate countries. It’s an absolutely massive landmass with pretty much every type of terrain, climate and a huge variety of cultures. Anyone that tells you otherwise probably barely travels",
   "created_utc": 1693273112,
   "score": 90,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy65nko",
   "message": "If there is garbage on the street or on the floor of the establishment, there are other regulations being ignored. If the floor isn’t clean, the rest of the place isn’t clean either. I know that sounds very snobbish and privileged, but coming from absolute poverty and climbing my way out, it’s absolutely correct.",
   "created_utc": 1693271919,
   "score": 177,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6ol8c",
   "message": "Always ask the locals where they like to eat. They know better than any travel blog.",
   "created_utc": 1693280702,
   "score": 106,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy66oec",
   "message": "Hollywood Boulevard",
   "created_utc": 1693272360,
   "score": 88,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7647h",
   "message": "Americans tend to value their personal space much more than a lot of more crowded countries, so you might unintentionally weird people out by being too close.\n\nAs far as safety, I feel like the sense of what's \"dangerous\" is pretty universal. Can't think of anything in the U.S. that's dangerous that a foreigner wouldn't be able to pick up on.",
   "created_utc": 1693292068,
   "score": 18,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6oa8s",
   "message": "Ordering a large at a restaurant, or *especially* a movie theater. I don't care how hungry you think you are, you will not eat/drink it all in one sitting.",
   "created_utc": 1693280541,
   "score": 113,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6v67m",
   "message": "Wu Tang ain’t nothing to fuck with",
   "created_utc": 1693284466,
   "score": 56,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6c6ft",
   "message": "needing to go to the hospital",
   "created_utc": 1693274779,
   "score": 128,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6tdmk",
   "message": "I say this as a Mississippian, Jackson Mississippi.",
   "created_utc": 1693283377,
   "score": 27,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7eat8",
   "message": "In Washington DC, avoid taking pictures in front of DC District court thinking it is the Supreme Court.  The Supreme Court is 6 blocks away \n\nAlso, the White House is MUCH smaller than you think it is",
   "created_utc": 1693298545,
   "score": 20,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7qjl8",
   "message": "Avoid classic American chain restaurants (Chili’s Applebees, Olive Garden ect). Most of them suck and I don’t why so many still exist.  There is actually really good food in the US if you want to find it",
   "created_utc": 1693307357,
   "score": 20,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy707xp",
   "message": "Be careful where you stay in bigger cities. I've seen people Airbnb places in bad neighborhoods in NYC and suffer for it.",
   "created_utc": 1693287761,
   "score": 8,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy68j4o",
   "message": "Harrison, Arkansas",
   "created_utc": 1693273178,
   "score": 22,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6zt0d",
   "message": "Don't lock anything valuable in your car. This includes the trunk.",
   "created_utc": 1693287473,
   "score": 29,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy65gz5",
   "message": "Bill Cosby",
   "created_utc": 1693271838,
   "score": 37,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7j2r4",
   "message": "I find a lot of foreigners have about 2 1/2 inches of a personal space bubble, while us Americans value our space. Keep at least a 2-3 feet distance when conversing with strangers. I've had an Italian guy come so close I thought he was going to kiss me. Very uncomfortable for someone who isn't used to a lack of personal space.",
   "created_utc": 1693302279,
   "score": 5,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7jegk",
   "message": "Avoid talking about politics with the average person.",
   "created_utc": 1693302529,
   "score": 5,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7psuc",
   "message": "America is HUGE and things are a lot further apart than Europeans realize.",
   "created_utc": 1693306904,
   "score": 6,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy674or",
   "message": "That's like asking \"What should a foreigner avoid while visiting this whole other continent?\"",
   "created_utc": 1693272558,
   "score": 46,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6ijt3",
   "message": "What state/states? big difference if you are going to NY vs florida vs utah or somthing lol.",
   "created_utc": 1693277664,
   "score": 11,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6rjnv",
   "message": "Avoid a hospital visit. Whatever you think it costs, it’s more.",
   "created_utc": 1693282313,
   "score": 26,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy707cl",
   "message": "The advice's value will change depending on where in the world you're coming from, but a few valuable travel tips:\n\n- Don't expect the US to be pedestrian friendly. Some of our larger cities are, but even they pale in comparison to EU cities. You need to drive here. NYC is basically our only major city that's not true of, but even there, public transport is not as good as that found in a lot of European and east Asian nations. You should expect to have to rent a car as part of your vacation expenditure if you don't have other accommodations.\n\n- Related to the previous point, public bathrooms are VERY hit or miss, and almost unheard of after business hours. Post-COVID, a TON of businesses are no longer open 24 hours, or even keep late hours, so you cannot even really count on like fast food or gas station bathrooms. It's a huge problem.\n\n- The US is a geographically enormous place. People come here from Europe all the time thinking they're going to see NYC, the Grand Canyon, Gettysburg, and Mt. Rushmore all in 1 week. This is not technically impossible, but that's HARD traveling by plane, and more or less actually impossible by car. If you are intent on traveling while here, your best best is to pick a major region and limit your stops to say, 5-10 state blocks. Even then, that's a LOT of travel, more than you probably are going to want to do. \n\n- Stay out of Mexico. I'm sorry to have to say that, I love Mexican immigrants and I don't frankly care if they're here legally or not. But that nation has gone way downhill in the last 15 or so years. Times were, you could have a great time heading down past the border. Things keep getting more and more dangerous there, however. The cartels are essentially our hemisphere's Al Qaeda. They are _NOT APPROACHABLE_. They WILL kill just for fun. No, that's not EVERY square inch of Mexico, but a lot of it HAS moved up to the border towns that used to be perfectly safe for family holidays. \n\n- Stay out of Canada. They will try to feed you Tim Hortons' and put you to work in the pancake fields mining for maple syrup veins. Our top scientists are still trying to figure out what a \"soary\" is, but we _believe_ it's some kind of a death ray.\n\n- Tipping is compulsory here. It's super fucky, and _really_ shouldn't be. But it is. Especially if you plan on sticking to one area and eating in a place more than once, you'd best tip. Don't toy with the people who handle your food out of eye-shot...\n\n- If you get pulled over STAY IN THE FUCKING CAR. Turn off the engine. Put your hands on the wheel. Truth be told, most cops will hear you out if you're polite, but we have a long-standing problem with neuro-atypical, rabid pitbull cops who shoot at anything not day-glo white. I'm very sorry to say, it can happen to you. Drive. The. Speed. Limit. US cops are NOT there to help you. They're there to arrest you. And they can for essentially any reason. Do not voluntarily approach them. Do not try to ask them things. DO NOT TRY TO BRIBE THEM. In some nations, this is pretty much the same as our tipping culture; expected, compulsory, just an unfortunate part of doing business. Here, it will fuck your life.",
   "created_utc": 1693287750,
   "score": 37,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7qon6",
   "message": "if a stranger approaches you to sell you something so no thank you and leave the area.",
   "created_utc": 1693307444,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7rgeh",
   "message": "Avoid Applebee's.",
   "created_utc": 1693307912,
   "score": 4,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy8193c",
   "message": "If it says no trespassing don't  trespass.",
   "created_utc": 1693312966,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy65ki6",
   "message": "If you're in a big city, you're probably better off sticking to the touristy areas.",
   "created_utc": 1693271881,
   "score": 21,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6p3iq",
   "message": "Getting arrested.",
   "created_utc": 1693280971,
   "score": 9,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6il6y",
   "message": "Don't interact with police unless you absolutely need to",
   "created_utc": 1693277682,
   "score": 37,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6m2su",
   "message": "Large piles of bricks sitting on the sidewalk for no apparent reason.",
   "created_utc": 1693279403,
   "score": 9,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy726c9",
   "message": "Avoid political topics.",
   "created_utc": 1693289146,
   "score": 6,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6g41y",
   "message": "the hospital",
   "created_utc": 1693276535,
   "score": 16,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6rbh3",
   "message": "Depends on what part of the U.S. you are going. If you provide the city and state reddit can assist with details specific to that area. \n\nYou're asking something similar as \"what should a foreigner avoid when going to Europe (or asia)?",
   "created_utc": 1693282184,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7iv9c",
   "message": "Don’t try to pet the Buffalo at Yellowstone National Park, leave that to the Americans tourists….",
   "created_utc": 1693302120,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7p8zk",
   "message": "The distance between Los Angeles and New York City is similar to the distance between Lisbon, Portugal, and Moscow, Russia. When I say 'similar' I mean the two city-pairs are within about 100kms of each other in terms of the distance between them. That distance is larger than Perth - Brisbane (Australia), Mumbai - Ho Chi Minh, you get the idea.\n\nThe US is \\*really\\* big, don't expect to grab brunch in Chicago, dinner in Houston, and then do the French Quarter in New Orleans the next afternoon. Choose one or two small regions for each week you're here if you only have a couple of weeks. Alternatively, a cross-country roadtrip in a campervan is pretty awesome but only if you have at least 3+ weeks in a row.",
   "created_utc": 1693306560,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7rnze",
   "message": "Getting sick.",
   "created_utc": 1693308036,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy82yew",
   "message": "Nothing. Be respectful and enjoy.",
   "created_utc": 1693313737,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6jf94",
   "message": "Contracting a sexually transmitted disease.",
   "created_utc": 1693278081,
   "score": 8,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6oz78",
   "message": "Florida",
   "created_utc": 1693280907,
   "score": 23,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6r6r9",
   "message": "Anyone wearing a MAGA hat. 🥲",
   "created_utc": 1693282108,
   "score": 34,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6mxg6",
   "message": "Your question doesn't provide enough information. Where are you from? Are you traveling alone? What part of the country are you visiting? For how long?",
   "created_utc": 1693279835,
   "score": 6,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy65nwt",
   "message": "Depends where they’re from, honestly.",
   "created_utc": 1693271922,
   "score": 3,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7465w",
   "message": "Kensington, Philadelphia, PA",
   "created_utc": 1693290599,
   "score": 4,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7oz9e",
   "message": "The heat. If you're going to hike in the desert, bring plenty of water.\n\nAlso if you're coming from an area with good public transportation, be prepared to drive or take a taxi. USA's public transport is paltry.",
   "created_utc": 1693306389,
   "score": 4,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy76pl1",
   "message": "dont go walking around late at night by yourself ESPECIALLY if youre a woman. I have friends from korea which is a country where its safe to go walk around at 1 am. When they visit here i always have to tell them that its not like that here and a big risk to be out alone especially in cities like LA",
   "created_utc": 1693292524,
   "score": 5,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy6jcn8",
   "message": "Needing health care.",
   "created_utc": 1693278047,
   "score": 10,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy74gjn",
   "message": "Don't get out of the car during a traffic stop, you may get shot.",
   "created_utc": 1693290817,
   "score": 2,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy77zlp",
   "message": "Don’t jaywalk",
   "created_utc": 1693293507,
   "score": 2,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7977o",
   "message": "Avoid anything dangerous where you might end up in a hospital because it's too expensive.",
   "created_utc": 1693294468,
   "score": 2,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7ac4q",
   "message": "Hospitals.\n\nI fact medical services generally, it don't much matter how good your travel insurance is, the paperwork will be an utter ballache.\n\nIn network, but the doctor working in the hospital is out of network, or the anesthesiologist or the ambulance, the whole thing is bullshit.",
   "created_utc": 1693295378,
   "score": 2,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7pf2l",
   "message": "Plan out your trips and know the area beforehand. If it's a small town, be pared for nothing to be open past 6pm and only having shitty motels because the town isn't big enough to support anything better.",
   "created_utc": 1693306665,
   "score": 2,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy7s0dk",
   "message": "Avoid crackhead prostitutes at al cost",
   "created_utc": 1693308230,
   "score": 2,
   "submission_id": "164463d"
  },
  {
   "comment_id": "jy85e3i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "164463d"
  }
 ]
}