{
 "submission_id": "1644fha",
 "title": "What has a parent said to you that made you go wtf?",
 "selftext": "",
 "created_utc": 1693272154,
 "permalink": "/r/AskReddit/comments/1644fha/what_has_a_parent_said_to_you_that_made_you_go_wtf/",
 "score": 149,
 "url": "https://www.reddit.com/r/AskReddit/comments/1644fha/what_has_a_parent_said_to_you_that_made_you_go_wtf/",
 "comments": [
  {
   "comment_id": "jy6720m",
   "message": "After I told my mother that I didn't open up to her or my dad was because I didn't trust them with my emotions, she started screaming that she hated me\n\nLike, girl, this is exactly why I don't tell you things 😂",
   "created_utc": 1693272526,
   "score": 36,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy69foa",
   "message": "My mom told me that women pooped babies out of their butt. I believed this until I was 12 or 13. Boy, I got laughed at when I used this as my answer when asked in sex ed.",
   "created_utc": 1693273576,
   "score": 45,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6e9km",
   "message": "Eating all your vegetables son will make the hair grow on your chest and balls. Well WTF if I don’t want hairy balls mom!",
   "created_utc": 1693275704,
   "score": 142,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6hlsr",
   "message": "When I was in grad school a friend of mine introduced me to one of his co-workers he'd befriended who was a few years older than us. He was a cool dude and, since we hit it off, he'd often tell our mutual friend to invite me to tag along when they went out for a few beers after work and stuff like that. Since he was older, he was already married and  he'd sometimes mention his daughter, which was totally normal.\n\nAbout a year after I met him he invited my friend and me to a big BBQ at his place and I finally met his family. We had just showed up and we were still saying our hellos when I noticed that the girl I assumed was his wife, who was helping him with the cooking, looked exceedingly young but I thought nothing of it and just assumed she was one of those people who looked way younger than their actual age. Until she called him \"Dad,\" that is.\n\nHe must've noticed my look of utter confusion because he burst out laughing and called her over and introduced her to me as his actual daughter and he later explained to me that he'd had her when he was fifteen years old, and then called over this little boy and introduced him as his grandson. Still laughing he said to me, \"Yeah, she made me a grandpa at thirty years old. What was I gonna do? Be a hypocrite and get mad at her because she got pregnant at the exact same age I got her mom pregnant?\" My mind was blown. Until that moment I'd never thought I'd ever met an actual grandfather who was in his early thirties or that it was something that still happened.\n\nI gotta hand it to the guy, though, he stepped up and took care of his kid since he was a  literal teenager himself and he supported her and taught her to take care of herself and her kid when she became a very young mother herself, and they had a great relationship. He obviously doted on her and she thought there was no better man in the whole world than her dad.\n\nA couple of years later we all got new jobs and moved to different parts of the city and drifted apart though we kept in touch on social media and so on. Some time later I ran into him at some shopping mall with three kids in tow and he explained that his daughter and her BF not only were still together but had actually gotten married and these kids were his grandchildren and he loved going out with them everywhere. He got a kick out of the fact that everybody thought they were his kids and their reactions when the children corrected them and said he was their grandpa. My dude wasn't even forty yet.",
   "created_utc": 1693277223,
   "score": 131,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6uhxt",
   "message": "My father once told me that between my brother and I, I was his favorite. This caught me off guard because I thought parents weren’t supposed to have favorites.",
   "created_utc": 1693284051,
   "score": 107,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy69bz7",
   "message": "“I wish i never had kids”",
   "created_utc": 1693273531,
   "score": 69,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6zw0q",
   "message": "Years ago I worked at a daycare center for kids with special needs. I was about 19 and had my own classroom, really loved the job.\n\nOne day a sub showed up to help out in my room. She was ok, her way with the kids wasn’t my favorite but I did appreciate the extra hands. \n\nOne of the 5 year olds, a child who usually took a lot of time warming up to subs, took to this woman. While they were sitting at a table coloring, the little boy said, “ I love you Miss Michele!” This sub, a mom, said to this kid, “oh. I don’t love you. I love MY kids, but I don’t love you.” \n\nThis was years ago, but it’s always stuck with me. No, it wasn’t something a parent said to me, but it was something a parent said in my presence and I nearly said, “wtf?” Out loud. Those kids, why not just say it back? Jesus. It’s a small thing, I suppose, but it seemed pointlessly mean, careless. And I can honestly say I did love those kids I worked with the 3.5 years I was there. \n\nYears later when I had my own baby I often thought about the little boy who ventured to tell this person he saw as trustworthy and kind that he loved her  and her response to an innocent child. My hope was that someday when my own went on to school that they’d feel this safe with a teacher. And if they chose to express that affection, the response would be more positive. \n\nIt’s ok to say, “Well, I love you, too! I love all my kids in the classroom!” Even if you don’t exactly feel it. You could make or break a child’s confidence for a long time.",
   "created_utc": 1693287533,
   "score": 54,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6oi1f",
   "message": "my mom told me she wishes i'd just kill myself already once\n\nshe doesn't remember saying it but it's stuck with me as the most fucked up thing she's ever said",
   "created_utc": 1693280656,
   "score": 10,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6t7rn",
   "message": "When I told my mom I didn't want to keep contact with my ex-husband as he had been abusive she told me she knew there had been some hitting in the past but that she'd never witnessed it, and he'd always been very nice to her so she'd like to go have coffee with him. Seriously?! WTF.",
   "created_utc": 1693283281,
   "score": 251,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6su12",
   "message": "\"If you're like this now I hate to think what you'll be like on your period.\"\n\nI was huddled in a chair, running a low grade fever and suffering diarrhea. She was angry with me for trying to stay home from school. \n\nOne, it's a field trip day, I don't WANT to stay home but hello, ass pee.\n\nTwo, a period is a natural thing, and there are pads/tampons for that. Diarrhea is NOT natural and I can't exactly shove a cork in my colon. \n\nSpoiler: she made me go to school and I shat myself mid fieldtrip.",
   "created_utc": 1693283055,
   "score": 23,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6l1fr",
   "message": "I have always had terrible migraines, since I was around 13. My mom has, too. My mom is also usually a very proper \"lady\". About 15 years ago, I was going through a very rough few days of migraine where none of my meds or usual methods were working and I was really suffering. I think most people know this, but in case you don't, orgasm releases endorphins which can help pain. So, I'm on the phone with my mom and I'm near tears because of the pain I'm in and my mom goes, \"I'm just going to say this really quick because I love you. Tell Mike to go down on you and it'll help with your pain.\" Click. She immediately hung up. I just froze, like WHAT THE FUCK, MOM?! The hell did you just say to me?! I so did not need that mental image of what my parents are getting up to when she has a migraine. I think we avoided talking to each other for about a week after that. It was made worse though, when I later found out that she and my dad had DISCUSSED if she should tell me that or if that advice would be crossing a line. My dad thought it was hilarious.",
   "created_utc": 1693278885,
   "score": 128,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6cpx9",
   "message": "I live on a farm and was putting out minerals for the cows and my step dad said he \"better go outside with me so a homeless man doesnt take advantage of me.\"\n\nHe knows I was r\\*ped 3 times\n\nEdit to clarify (also to fix a couple grammar mistakes to hopefully make it clearer): He knew because I told them every time it happened. Legal action was taken against the first person.",
   "created_utc": 1693275018,
   "score": 199,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy73o6e",
   "message": "I needed to take my youngest sister with me to my appointment—as I was taking her somewhere later—and afterwards she gleefully told me how beautiful my therapist was.\n\nI thought that was super adorable, and decided to share that sentiment with my mother.\n\nHer response? “Really? I thought she was black.”\n\n🤦🏻‍♀️ I still haven’t recovered from that response. Like mom, you’re hispanic, you shouldn’t be like this.\n\nEdit: formatting",
   "created_utc": 1693290222,
   "score": 134,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6i6x6",
   "message": "Oof. I hadn’t talked to my dad in 15 years. I decided to reach out (for certain reasons and not to restart a relationship). He asked if he could ask me about my life. I let him. I told him, among other things, I was in a wonderful relationship with a terrific gal. “Is this a real relationship or like the girlfriends I had when I was  with your mother.”\n\nI was equally glad I disowned him 15 years ago, disappointed a man and a father would speak like that to his estranged son, and angry that he was the father I was born to. He is just one big joke to me.",
   "created_utc": 1693277498,
   "score": 165,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6d0zf",
   "message": "That being raped repeatedly during childhood /adolescence is part of life experience…",
   "created_utc": 1693275154,
   "score": 237,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy772k2",
   "message": "Where do I even start?! I've written alot about my mom on Reddit. She was a crazy abusive monster when I was a kid. She was controlling and completely unhinged. \n\nA few weeks ago we had the following convo-\n\nHer \" I just can't imagine hurting an animal. I could never forgive myself.\"\n\nMe \"really. I must be thinking of my other mom, but my mom killed my first pair of geckos that I saved a years worth of allowance to buy because she didn't want them in the house. My mom also killed my parrot by putting it out side in the winter where it froze to death.\"\n\nHer \" I did that? I would never do that.\" \n\nPretty sure you did, mom.",
   "created_utc": 1693292798,
   "score": 184,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy66yts",
   "message": "\"Son, what does this \"WTF\" mean?\"",
   "created_utc": 1693272486,
   "score": 121,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6j9qm",
   "message": "When I called my mother to find out a good time of year to visit her she said, \"What for?\"",
   "created_utc": 1693278009,
   "score": 168,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy73mz9",
   "message": "Wasn’t my parents but my Grandpa.\n\n“Josh can you take me to see Marge?”\nMarge was his long time girlfriend who had Alzheimer’s. My GP was in his 70s at the time and we took away his car because he was a dangerous man behind the wheel to say the least. . “Sure Papa Joe!” That or PJoe was his nickname. Drive him to the place Marge was cared for at. Stop at the front and ask “How long until I come back?” He replied with “Give me an hour. That should be long enough for us to have sex.” I start crying laughing and he leaves with a giant smirk. I could never look at him again without thinking or saying “Almost 80 and still getting after it, WTF”",
   "created_utc": 1693290197,
   "score": 162,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7a8n8",
   "message": "“You need to stop eating.” \n\nMy dad kind of underhandedly waited until he and I were alone away from my mom and brother. He glared pointedly at my belly (admittedly large from weight gain), and said that to me. Not “I’m concerned about your health” or “try to cut back and move more” - just “stop eating.” Stop doing something necessary to live. \n\nI had previously suffered for years from eating disorders and his comment worsened everything. Eight years later, I still actively think about it multiple times every day. My relationship with food and my body is awful; I’ve become a recluse because of my shame over my appearance. Fights over my insecurity have contributed significantly to my crumbling marriage. \n\nThe kicker? My dad has been morbidly obese his entire life",
   "created_utc": 1693295303,
   "score": 79,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6ur4t",
   "message": "\"I should have aborted you.\" When her dryer needed cleaning because *she* didn't check dad's pockets of laundry she was doing and a grease pen melted all over it. \n\n\"Just look at you...If I looked like you, I'd kill myself.\" To chubby 5 or 6yo old me. Like, lady, just give me a salad or some shit.",
   "created_utc": 1693284210,
   "score": 220,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6jca1",
   "message": "*TRIGGER WARNING*\n\n\n\n\nWhen my dad found out I self harmed, he said “Well, if you’re going to do that shit, you may as well finish the fucking job and do it right.” It’s been 10 years and it still fucks with me sometimes.",
   "created_utc": 1693278042,
   "score": 171,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6quom",
   "message": "My mom has told me not to date because the guy might molest my daughter.  \n\nSo I was a widow at 46 and according to her I should stay single.",
   "created_utc": 1693281919,
   "score": 138,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy67se1",
   "message": "“I’m raising my daughter to be a wife” (she’s 4)",
   "created_utc": 1693272850,
   "score": 145,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6x7xp",
   "message": "I reminded my mom that humans deserve a basic level of respect, and that the fact she considered obedience a form of respect skews her view on how to treat people, and she told me \"I don't have to respect you. You're my child.\" I was an adult at the time.",
   "created_utc": 1693285747,
   "score": 101,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy75gx6",
   "message": "\"You're a weak person. You should go kill yourself.\"\n\nAfter I opened up to my dad about my depression six months after my mom passed away.",
   "created_utc": 1693291578,
   "score": 94,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy71lbu",
   "message": "A few months ago I had gone to do a surprise visit my grandparents on my dad’s side. While I was driving up their property I saw them walking in their groceries and witnessed seeing my dad for the first time. I had never met my dad in my life but knew my grandparents.\n\nI walked up greeted my grandmother and she ushered me over go talk to my father. As I went to greet him this dude threw his hood on and jumped in his truck and locked the doors and said no words to me. Never in my life have I witnessed a grown man run away like that.",
   "created_utc": 1693288727,
   "score": 122,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6xsx5",
   "message": "As a kid I downloaded an app on my Kindle Fire tablet that was supposed to teach me how to play the ukulele. Well I ended up accidentally buying a 1 year subscription for the app that costed around $100 with my parents credit card (still don’t know how this happened as their card wasn’t connected to anything on my tablet). Well my stepdad called the apps customer service and ended up telling them that I had “down syndrome” and that’s why I accidentally bought the subscription. This was all right in front of me btw. The lady on the phone was super nice and probably would’ve given him a refund anyway but like…? Was that really necessary? The best part is, is that my Mom is a SpEd teacher so again…? Why did he think he needed to say that? Idk. I don’t have Down syndrome. Also, another time he told me to get the pizza from the delivery guy on our front doorstep but again, I was really young and got scared so the pizza guy left with our pizza. He called the pizza place and told them I had autism so they’d come back with the pizza. Also had this conversation right in front of me. He thought it was hilarious, like he was “rigging the system”. Still baffles me to this day. Oh also my mom divorced him last year.",
   "created_utc": 1693286126,
   "score": 48,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy75ajn",
   "message": "I would often visit the kitchen to watch how my mother cook. One day when my father saw me coming out of the kitchen, he said “you keep visiting kitchen, your dick and balls are gonna fall off. That’s how girls are made.” \ncontext: I was 7 when he said that to me and we are Korean family",
   "created_utc": 1693291442,
   "score": 106,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6eepa",
   "message": "Once my mom talked about how my dad was a good father despite him having a bad upbringing with his dad. She was basically using it as an excuse for him while she was talking to extended family. \n\nMe and my dad always had a complicated relationship. I was scared of him as a kid and we don't talk very much now. At one point as a kid the story goes he tried to burn me with a lighter and it was a whole thing, but I guess we all moved on. I couldn't really believe it when I heard it.",
   "created_utc": 1693275766,
   "score": 35,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy77oiu",
   "message": "Dad wasn’t around as a child. Meet dad when I am 7 years of age. Dad makes no attempt to connect. I had a hard time calling him dad cause he was a stranger.  After doing the every other weekend thing, it became more of a chore to have to see him. When I’m about 11 years of age he told me “ you know you don’t have to come here if you don’t want to”. Even as an 11 year old, I was baffled that a father would say that to his child. That was probably the first “what the fuck” I said in my head. \n\nHaven’t seen or spoke to him since that day. 15 years and still going strong.",
   "created_utc": 1693293267,
   "score": 42,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6yn26",
   "message": "\"[Temnyj] is your mothers favourite.\"\n\nSaid directly to both my younger brother and sister.\n\nMade even worse by the fact that everybody knew my sister was *his* favourite. So. An extra fuck you to my brother, i guess.\n\nThere were a lot of pretty shitty nuggets from him, but that one always stuck with me as an exceptionally unnecessary comment that serves no purpose other than fucking up your kids self worth.",
   "created_utc": 1693286679,
   "score": 65,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6s8gg",
   "message": "\"You were a mistake, and I had planned to abort you.\"\n\nYeah... that happened...",
   "created_utc": 1693282711,
   "score": 29,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74v5n",
   "message": "A few months back my mother (who is in her late 70s) simply asked the question \"Why hasn't someone just shot Valdimir Putin in the face?\"\n\nConsidering how old and very British she is I would have expected \"bumped off\" or \"eliminated\" not Shot in the face. Is Quentin Tarantino directing my mother's imagination now?",
   "created_utc": 1693291117,
   "score": 69,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy77ixn",
   "message": "Called my dad asking how to set up a retirement fund, he said “retirement is for the birds, work until you’re dead” *click*",
   "created_utc": 1693293146,
   "score": 87,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy78kkw",
   "message": "I was a bit of a chubby kid and whenever I'd order anything remotely unhealthy in a restaurant my dad would say to me 'why don't you just tape it to your stomach' or something like that.\n\nI have some food issues 30 years later lol.",
   "created_utc": 1693293964,
   "score": 24,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7cojz",
   "message": "I shaved my head at 21 and kept that hairstyle for the last 28 years.\nMy dad walked into my room when I was 26 and asked me for a comb!\nHe looked at me , thought about it for a second and laughed.\nRip dad.I miss you.",
   "created_utc": 1693297264,
   "score": 20,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6vwyk",
   "message": "The main one that gets the biggest wtf from ppl is when I tell them that during lockdown my mom kept finding my brothers baby clothes (she threw mine away) \u0026amp; kept sending me pics, telling me that she can't wait to be a grandma. I asked if my brother got his gf pregnant, she said she was talking about me, I reminded her I would never give her \u0026amp; my dad grandkids she responded with \"don't worry, I'll find someone to rape you \u0026amp; force you to have the kid\"",
   "created_utc": 1693284919,
   "score": 60,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy712o0",
   "message": "TRIGGER WARNING \n\n\nSaw a women pick her child up by the hair and yell “Don’t you hit your sister! You will be nice to your sister! I had her for YOU!” \n\nSo many layers of fucked up dysfunction. \n\nWe were in a moving vehicle they had rented for a special occasion, I was 12 \u0026amp; completely unable to do anything about it or intervene w/out risking harm to myself, \u0026amp; no way to grab kid \u0026amp; escape.",
   "created_utc": 1693288355,
   "score": 45,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74y7a",
   "message": "'Why can't you be normal\" I said  ' I don't know mum why'd you make me autistic \"",
   "created_utc": 1693291182,
   "score": 25,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy764q2",
   "message": "When I came out to my mom at 20 I did it through text (only way I could), she came home and the first thing she said was “why would you tell me that when I’m with my friends”\n\nThat hurt. \n\nShe’s slowly opening up to it, and is accepting now, but at first she wasn’t at all.",
   "created_utc": 1693292080,
   "score": 23,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy773ez",
   "message": "My dad is such a POS, I don’t even know where to begin. Almost every word I’ve ever heard that piss poor excuse of a man say has made me think ‘wtf, I can’t believe that came out of his mouth.’ Let’s just say if he died, I would not feel the need to attend his funeral.",
   "created_utc": 1693292815,
   "score": 28,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6w6w7",
   "message": "My dad called me a whore because I snuck out to go to my best friends house when her BROTHER DIED.",
   "created_utc": 1693285094,
   "score": 26,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy710gm",
   "message": "A lot of things\n\n1. My retina detached. My mom asked why I need a surgery to fix it.\n2. When she could still my bank account, she got mad and asked me why I was spending $30+/week at gas stations. Um. Gas. What else would I get from a gas station every week?\n3. Refuses to get a physical/annual exam/mammograms/bloodwork or anything that's recommended for her age. Tries to claim I'm the unhealthy one who doesn't take care of my health.\n4. She tried to forge her friend's signature for a document that needs go be notarized and acted surprised when the court wouldn't accept it",
   "created_utc": 1693288312,
   "score": 51,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy75mrj",
   "message": "I have a rare neurological condition where if I gain weight over 200 lbs, I could potentially start to go blind. My mom says I better lose weight because she’s not looking after me when I go blind. \n\nThat was one of her better ones",
   "created_utc": 1693291703,
   "score": 28,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy77zj7",
   "message": "When I was about 28 my mom broke the news to me and my siblings that our dad had passed away, and oh ya you have a half brother who is in his 40s. Has  a wife and children…still in shock and I’m in my mid 30s now. My dad bailed on us when we were toddlers.",
   "created_utc": 1693293506,
   "score": 31,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy72wdx",
   "message": "\"you're a shitty son.\" \nit was quite an experience!",
   "created_utc": 1693289661,
   "score": 14,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy73b76",
   "message": "Gave me a sleeping tablet when I was 16 for crying 'you sound like a horse, and I'm trying to sleep' after I found out my first boyfriend had cheated on and broke up with me.",
   "created_utc": 1693289958,
   "score": 9,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74zfe",
   "message": "When my grandma explained to me how you get a fussy baby to go to sleep. “Wrap them up tight, give them Benadryl, and turn up the heat!” My jaw hit the floor so hard.",
   "created_utc": 1693291208,
   "score": 17,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy77orx",
   "message": "They only wanted my twin..",
   "created_utc": 1693293272,
   "score": 24,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy78af6",
   "message": "My father told me he treated me as lesser than my sister because she is blonde like our mother but I am a brunette like him and he hates brunettes. He also told me he wouldn't save me if the house caught fire because his only priority was my mother.",
   "created_utc": 1693293738,
   "score": 16,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6zysi",
   "message": "*knocks on the shed door*\nIf you boys are gonna smoke grass, at least do it inside. Besides, you look like wierdos sneakin' out here.",
   "created_utc": 1693287586,
   "score": 34,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7766y",
   "message": "One of my stepmom’s told me that she thought I thought I was better than her. I’ve had a complex about it ever since.",
   "created_utc": 1693292874,
   "score": 18,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6ubrd",
   "message": "When I was a kid, my best friends mother was an insufferable snob,and looked down on me because my family was lower middle class. When we were about 9 years old, she took my friend and I to the library to checkout some books, and ran into a friend of hers on the way out. She introduced us to the friend. She said very loudly, that \"(insert her daughters name here) is a voracious reader and very very smart, but (insert my name here) is NOT!\". I was upset and said \"YES I AM!\" She then looked at me, then her friend, and they rolled their eyes and laughed. That was nearly 50 years ago, and I remember it as if it were yesterday, and honestly, it had a hugely negative effect on my life, it traumatized me. The only consolation for me (I know this makes me a bad person) was that 10 years later, her very wealthy husband left her for a much younger woman and she was forced to live well below her accustomed means, and was bitter the rest of her days. \nI should note I am now a very happy person, in a great relationship, running my own successful business.",
   "created_utc": 1693283944,
   "score": 49,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy68mix",
   "message": "Two things.\n\n1. \"\\[My Aunt\\] is so stupid! Couldn't even get a full scholarship!\" My aunt is going to become a doctor and is extremely good at it. She just couldn't get a scholarship that covered her fully just like so many other people who go to become doctors.\n2. \"Not to be racist but I think that if people live in America they should be required to speak English.\" A comment about my aunt's fiancée's family (the same aunt who she called stupid) simply because they didn't speak fluent english.",
   "created_utc": 1693273221,
   "score": 37,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy71kka",
   "message": "I found out the girl I was supposed to marry in a month had been cheating on me for the entire 3 years we were together. My mothers response was \"If there's a baby you won't know if it's yours or not\"\n\nWTF Mum?",
   "created_utc": 1693288712,
   "score": 21,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy735ls",
   "message": "My dad got sick this last weekend and I ended up getting it too. It felt off so I got a Covid test and it was positive. I told him he should get tested too since I got right after he did, and he said “I’m not doing anything about it unless I find out I have it” I was like wtf “how do you plan on figuring that out without getting tested?”. He’s a extremely workaholic and avid Covid denier, and he acts liking losing work hours is the end of the world. Plus he’s been sulking ever since cause his reasoning was idiotic and selfish and he probably realizes it now.",
   "created_utc": 1693289845,
   "score": 25,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74rf3",
   "message": "“Don’t be a little bitch with the ball because all those other fuckin kids are gonna be comin for your shit.”\n\n-my neighbor talking about flag football with his 6 year old son.\n\nAt least he’s playing catch with his kid lol",
   "created_utc": 1693291039,
   "score": 20,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy76ouh",
   "message": "My adopted mom regularly called me a bitch and screamed at me when I was younger. It makes me go wtf now and Im damn sure Ill never treat my kids that way when I have some.",
   "created_utc": 1693292508,
   "score": 13,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6qaqk",
   "message": "“People who date at your age are just whores” I was 17 and had my first boyfriend, had never even kissed a boy before that. He didn’t apologize to me till his wife told him I was upset the next day. I have never forgiven him for that.",
   "created_utc": 1693281613,
   "score": 19,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy693o7",
   "message": "\"Your father and I agree that we don't believe in abortion.\" My mother said this to 11-year-old me. (I've been in and out of counseling much of my adult life, and I've yet to find a way to address this.)",
   "created_utc": 1693273432,
   "score": 9,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6sz7s",
   "message": "My mom said that a celebrity should think more before signing a contract when it came out she was SAed (shame on her) and my dad said i was dressed like a prostitute when i was like 14/15 over a pair of black leggings with holes in them… stop sexualizing my clothing it’s weird \u0026amp; innapropriate, not protective/caring",
   "created_utc": 1693283142,
   "score": 15,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7011g",
   "message": "I was told “i don’t know” is not an answer. Mofo! Yes it is. You asked. I said I don’t know. Your inability to comprehend answers other than the ones you were expecting, does not give you the right to fuck with my head. I told her about as much. We got into a fight and I ended it by saying I hope she dies so I can have a better mom. She got cancer a month later. She was also finally diagnosed with manic depression and bipolar disorder. She’s been in remission for eleven years and we actually have a better relationship after she admitted to being a cunt. Her words, not mine. I love my mom, but a part of me still thinks she shouldn’t have been a parent.",
   "created_utc": 1693287629,
   "score": 21,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6z1t5",
   "message": "For context, I work with a bunch of children, and I bring them food and drinks and stuff like that as well. When I came down with a bad cold, I stayed home from work, not because I was too tired to go in or anything, but because I obviously didn't want to get like 12 kids and their parents sick. Mum blew up at me, asking why I care about the kids at all, they're not mine after all. Like jeez mum, have some empathy 😅",
   "created_utc": 1693286958,
   "score": 24,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6zssj",
   "message": "aunt was staying with my family on our vacation for a few days. One night my siblings and I all went on a short ride to the store down the road to grab some water jugs and my aunt made a comment about what i was wearing (it was sweatpants and a tank top). she then proceeded to talk to my dad ab it and tell my mom to tell me to change or put something over myself. wasn't anything super crazy to me but i was just pissed because it literally wasn't a big deal, she's not my parent so she shouldn't be so worried about it, and nobody at cvs at 10 pm going to go insane because somebody walks into the store in a tank top. i love her obviously but it's little things like that that make me go 😐",
   "created_utc": 1693287469,
   "score": 9,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy70wwa",
   "message": "Not my mom.   \n  \n\"I just ignore all bad or negative feelings, I just don't deal with them\".   \n  \nYeah, no joke you, your son, and daughter, are all so *unbelievably* fucked up. Absolutely tore me up hearing this.",
   "created_utc": 1693288243,
   "score": 18,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy70yxb",
   "message": "“I wish you would die”",
   "created_utc": 1693288282,
   "score": 6,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy72hmb",
   "message": "\"Your mom was a prostitute and I might not be your dad.\" I was age eleven when I was given this piece of information.",
   "created_utc": 1693289370,
   "score": 25,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy78x6i",
   "message": "\"Stop twitching, tapping, moving, bopping, clicking. CAN YOU JUST SIT STILL while I'm trying to watch tv and drink [yet another] glass of wine.\" Me with a private docs diagnoses for ADHD that my parents didn't tell me about because they were embarrassed of me and couldn't bare for the weird church cult they were part of to find out. They went private docs so it wouldn't be on my medical records. And if I talk to any of the GPs as an adult about possible meds, they just think I'm looking for a high and not actual help. A few years later, I got in bad trouble at school due to my ADHD and sensory problems[where a teacher actually shut me in a cupboard because he couldn't handle me.] and I got permanently expelled from that secondary school for hitting the teacher with piece of sports equipment, after he'd shut me in that dark closet for an hour. After that my parents told me \"it is your fault that we have lost faith in god, because we prayed for you to \"\"get better\"\"\". But I didn't, infact this was the start of my other sensory issues and anxiety which as an adult was diagnosed as autism. I was misunderstood, mismedicated, and everything felt wrong but I could not describe or even analyze what exactly was provoking my fight or flight. This story ends at 11yo. I have more stories of my shitty childhood. But I'm not sure anyone will read this far down anyway. But I found writing this all down actually helpful and I feel a weight lifted.",
   "created_utc": 1693294242,
   "score": 19,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7947s",
   "message": "My mother pulled me aside at a family dinner (I’m 30F, have been moved out of my parents house for 8 years, they have a terrible relationship and always have), and pulled me upstairs to “my” old bathroom. She proceeded to talk about how narcissistic my father is and she hoped I would not turn out like him. Meanwhile the whole time she was talking about how she was never appreciated for what she did here and there and for him and for me and for her volunteer work. \n\nYup. He’s the narcissistic one, mom. \n\nShe also told me 3 months before my wedding that my fiancé (now husband) and I had to find a place to move into that had a room for her for when she needed to leave my father. \n\n\nAnd one more for good measure!\nI’m having slightly minimal surgery in two days and she asked to be there in the waiting room with my husband. I said no, I was allowed one person, and it was going to be my husband. Then she told me TONIGHT “it sounds like you have a good support system, but I’m still your mother” as she was on the verge of tears. Because I’m not already stressed about being put under and cut up or anything?\n\n\nAnyways. That’s my mother and a FEW of the reasons she’s made me say WTF MOM.",
   "created_utc": 1693294401,
   "score": 15,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6xc7k",
   "message": "I don't understand why they have to make a black superhero\n\nI don't wanna play as some weak ass female",
   "created_utc": 1693285824,
   "score": 6,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6czb3",
   "message": "I have more kids",
   "created_utc": 1693275133,
   "score": 5,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6f52q",
   "message": "a song about the n word",
   "created_utc": 1693276092,
   "score": 5,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6s74p",
   "message": "She said I should take an Engineering course LOL 😂",
   "created_utc": 1693282689,
   "score": 7,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6s92k",
   "message": "Why don’t you just go away? When I asked for an explanation: you should have left/died and not your brother. Wow. Thanks.",
   "created_utc": 1693282720,
   "score": 4,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6to7y",
   "message": "Don’t get the covid vaccine, it’s been known to give people a new variation of aids.",
   "created_utc": 1693283551,
   "score": 9,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6uswp",
   "message": "Dad told me my mom was going to try and self abort with a knife and then also told me beer was more important than me",
   "created_utc": 1693284241,
   "score": 5,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6wad9",
   "message": "“I should have aborted you.”",
   "created_utc": 1693285157,
   "score": 7,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6yuu0",
   "message": "I was telling my dad who wants to spend his retirement traveling, about wanting to travel to Japan since the architecture is so cool. And samurai. Anyway, he got really mad saying he never wants to step foot on the land of the japs that attacked pearl harbor. Like bruh",
   "created_utc": 1693286825,
   "score": 15,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6z9tm",
   "message": "You're mentally ill, you need to go to a doctor",
   "created_utc": 1693287111,
   "score": 5,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6zcix",
   "message": "When I told my mom I’d finally paid off my student loans after 14 years and she replied “oh, I thought your student loans were only five or ten thousand dollars”.  (I earned two degrees including law school.)",
   "created_utc": 1693287161,
   "score": 7,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6zcnx",
   "message": "\"sorry about his behaviour. He was unexpected.\" \n\nOr\n\n\"\"If he acts up, you hit him!\"",
   "created_utc": 1693287164,
   "score": 4,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6zokt",
   "message": "“You’re the reason your mom and I are breaking up”. If 15 year old me could break up a 13 year long relationship then it wasn’t that strong to begin with.",
   "created_utc": 1693287389,
   "score": 8,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy6zrvz",
   "message": "\"Just boys being boys\"\n\nAlways used to justify some terrible behavior. \n\nIn the case that specifically came to mind from the mother of two of the three guys we had trespassed who assaulted a girl in our parking lot.",
   "created_utc": 1693287451,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy701bl",
   "message": "everytime they are wrong about something and just assume that im the one whos incorrect because they are my parent",
   "created_utc": 1693287634,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy70dz5",
   "message": "When I was little I didn’t like doing homework, my mum would cry and say\n“ imma get u a metal bowl for your bday and so u can go be a beggar”💀",
   "created_utc": 1693287880,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy70e8b",
   "message": "I was 7 when my parents told me I would grow a tree if I swallow any fruit seed. That was my earliest baby pre-anxiety experience that I'll never forget",
   "created_utc": 1693287884,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy70ucs",
   "message": "One day while driving home from the grocery store (and we were just sitting in silence listening to the radio. We weren’t fighting or had been fighting or anything) my mom turns to me and says, “I think you’re going to end up being with an asshole” and I say, “….why would you say that” and she said, “ I don’t know you just seem like someone who would end up marrying an asshole”. So that sums up our relationship😂 oh and if I were to bring this up she would of course deny it ever happened.",
   "created_utc": 1693288194,
   "score": 8,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy71wv1",
   "message": "The only compliment my late mother, who was a shrewd business woman and active in the media world from the 30s to the early 60s, ever game me was that I had a nice smile.  That would have been when I was a tween/teen in the late 60s early 70s.  With the passage of time I have come to find that really emasculating.  Talk about damning with faint praise.  \n\nShe had enough confidence in my intelligence to pay for expensive private schooling, and I did very well academically.    On the other hand, I was a sissy as a little boy and even though I outgrew that, mother knew that I was gay even though we never talked about it.   She died when I was 16.\n\nI think the comment reflected her pessimism as to how I would fare in what was then and still is a straight man's world.   No newly minted lawyer (which is what I became after her death) ever got a job because he had a nice smile.\n\nMy father, who was an old dad, wasn't much better.  All he ever said by way of praise was that I had good manners.   And that was when I was a teen and maybe even into my 20s.",
   "created_utc": 1693288959,
   "score": 4,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy724e8",
   "message": "My old boss said that she got jealous when her husband called their 4 year old daughter beautiful, so she called her daughter ugly and told him to stop inflating her ego. She proudly admitted it to all of us as if it was normal and it baffles me to this day",
   "created_utc": 1693289110,
   "score": 27,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy72djf",
   "message": "In university, I caught *something* (doctors were all \"Food..poisoning?  Maaaybe?\") and was puking my guts out all morning in between bouts of dry heaving.  I couldn't keep a sip of water down.  My parents lived about 40 mins away so the genius RAs called them instead of you know, taking me to a hospital.  My dad comes into my dorm room to see me curled up in a ball on the floor, ghost white, sweating profusely while cradling a puke bucket.  The first words out of his mouth were:\n\n\"Are you on drugs?!?\"\n\nKeep in mind I was the type of 19 year old a drug dealer would take one look at, laugh and tell me to go do my homework and my parents had grilled me multiple times during high school about being \"on drugs.\" Up until I was 20, I never smoked, drank or did anything but be depressed and work my ass off.  Pretty much lost all respect for him and his question told me all I needed to know about our relationship.  When I needed his help, all I got was an accusation.",
   "created_utc": 1693289288,
   "score": 19,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy72mpz",
   "message": "Me: I don't think I want kids\n\n\nMy dad: understandable. They really set my life downhill.\n\n\nMe: *latently offended buffering*\n\n\nAside from that he used to call me a monster whenever we argued lol",
   "created_utc": 1693289470,
   "score": 8,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy72wih",
   "message": "He said he didn't do it, and that you're lying.",
   "created_utc": 1693289664,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy72y0z",
   "message": "They decided to talk about sex education after my 18 😂",
   "created_utc": 1693289694,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7330b",
   "message": "My dad when I was 7 and my brother was 10\n\n“Hey boys, how would you feel about having a new mom and your mom not living here anymore?”",
   "created_utc": 1693289793,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy73nb5",
   "message": "Mom walked into my room years ago as a teenager out of the blue while I was just sitting there existing (Idk why I was just sitting there idling. Maybe I was tired) and said “Oh good you’re not touching yourself.” And I was like 🤨",
   "created_utc": 1693290204,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy73ozq",
   "message": "Mom while planning a new kitchen:\n\n\"I spend half my life in the bedroom and the other half in the kitchen. And since the bedroom is a let-down..\"\n\nAt the breakfast table.",
   "created_utc": 1693290239,
   "score": 10,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy73vvi",
   "message": "My (33f) mom (67f) confessed to me she’s been having an affair since I was 6. She was going to leave my dad my 3 siblings \u0026amp; I when I, the youngest, graduated highschool. But my niece was born and my mom “didn’t want to leave her grandchild” lol 👌 I also own a business with my dad who I have to look in the eye every day. I’m the only person on the planet who knows.",
   "created_utc": 1693290382,
   "score": 16,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7443b",
   "message": "Trauma time. Mother knocks on my door. Proceeded to ask why her new bf would want anal and is upset that it's what he wants. 😲 🫨 WTF",
   "created_utc": 1693290555,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy744tc",
   "message": "My mom cheated on my dad 12 times. I was visiting her and she showed me an email he sent her 13 years prior and it just said \"you're a cunt\" and tried to act like it was a big deal",
   "created_utc": 1693290571,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74aw4",
   "message": "Same. I told my mom I was getting beat up and spit on on the bus and called a loser. She said maybe you are one! That was my first wtf moment.",
   "created_utc": 1693290698,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74hk7",
   "message": "“im sorry olive but ur not smart enough to be a doctor, maybe a plumber.” like bro tf 😭",
   "created_utc": 1693290837,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74teb",
   "message": "Oh, boy, where to start…\n\nMy dad oh-so-casually admitted to my face that he only agreed to marry my mother and have kids with her so he could prove to his aunt that he wasn’t gay.\n\nThen there was that time my mother slapped me on Christmas and screamed that she wished I was never born and that she hadn’t lost two babies before me “who could’ve grown up to be decent people,” all because I was exhausted from working retail at the mall *in December* and didn’t want to be dragged to her friend’s house for a fancy dinner. I was 21-22 at the time, so it wasn’t like I was a little kid who didn’t get a say in it.",
   "created_utc": 1693291080,
   "score": 13,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy74z3q",
   "message": "When I was 3 or 4 my mom told me that when her \u0026amp; my biological father got divorced she gave him the choice between taking me or the house we lived in.\n\nI resented him for a long time for choosing the house, but at some point much later in life/when I got older I was like wait, she gave him a choice? \n\nAnyway, parents are fun.",
   "created_utc": 1693291202,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy768hz",
   "message": "\"in this household i am your god\"",
   "created_utc": 1693292160,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy76a9c",
   "message": "After graduating high school i had gotten into the college i was looking forward to attending. Required a decent score on my SAT. My mom who was just the type to shove going to college down my throat. Said \"you must be so proud to get into that university, i bet it was such an easy thing for you to just want to go away for school. You defnitely could have gone somewhere close to home or closer to family.\" This was at a restaurant to celebrate after walking on the stage. I went to the restroom and punched the walls of the stalls so hard i had bruises on my knuckles for 2 weeks. My brother was the only one that had anything positive to say to retort the shitty atmosphere that was made on a day that should have been festive. I ended up graduating from college and i also dont use my degree for what im doing. Great idea mom. Make me go into debt and then i suffer for the first few years out of college because i just wanted to be the son you wanted.",
   "created_utc": 1693292196,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy76c3d",
   "message": "My girlfriend’s dad asked her, “Why are you dating that fucking white man?” — and with such anger and conviction.\n\nThen, at his own son’s funeral (girlfriend’s brother), I attended to honour him and he said, “I’m leaving and I’m not coming back until the yute is gone.”\n\nSo yeah. That felt great.",
   "created_utc": 1693292235,
   "score": 9,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy76dxu",
   "message": "Son you can tell me, are you gay like your sister?",
   "created_utc": 1693292273,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy76hrn",
   "message": "My father told me \"You are not my daughter anymore\". That hit hard.",
   "created_utc": 1693292356,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy76jvh",
   "message": "When I told my parents that I broke up with my boyfriend my dad asked: “Why? Did his hair smell weird?”",
   "created_utc": 1693292401,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy777jf",
   "message": "I have SO many but one that comes to mind from my dad; I was texting my very loyal BOYFRIEND on the way to school one morning (dad driving) and he asked who I was talking to. I told him. He said something along the lines of “don’t think you’re the only one he’s talking to, he’s probably texting other girls right now”. He couldn’t have been farther off but I was seriously like wtf what a way to support my first relationship (that lasted TWO years).",
   "created_utc": 1693292903,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy77dcj",
   "message": "After blaming me for all of her troubles, she she she'd never change a thing if she had a chance to correct the way she treated me.",
   "created_utc": 1693293028,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy77dyu",
   "message": "“This is why your ex broke up with you.” during a heated conversation. I was going through the emotions of my first break up, it was day one and she was bombarding me questions about what happened, and in her frustration she let out those words. After that, I’ve grown very careful in what I share or open up to my mother. In fear of her just throwing it back against me. No child should ever feel this way towards their mom, and yet it happens.",
   "created_utc": 1693293041,
   "score": 11,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy77ftb",
   "message": "\"You don’t have the right to tell me if I'm wrong or right\" :\")",
   "created_utc": 1693293080,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy783te",
   "message": "One family vacation, while we were all sitting at the hotel, unprompted my mother looks at me and says “You got some fat ankles”. She still to this day doesn’t understand how that was both hurtful and hilarious - she gets mad when I bring it up. Like, you gave me those ankles…",
   "created_utc": 1693293598,
   "score": 12,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy78l1z",
   "message": "That I’m selfish for liking the Same gender…like what the fuck does that have to do with you",
   "created_utc": 1693293974,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy78ld6",
   "message": "If I didn’t go get my dad  alcohol he always threatened to ‘ off me ‘. \n\nOnce we were at the harbor , I pretended not to hear him so he pushed me , I don’t think he intended to, but I fell in the water between to parked boats. \n\nA man who’s on one of the boats saw this and jumped in to save me ,I was 10 so I wasn’t a strong swimmer yet. My dad just laughed when the man was yelling at him.",
   "created_utc": 1693293981,
   "score": 22,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy78rlw",
   "message": "My mom told me the other day, that I needed to be more like her. \n\nShe’s barely worked a day in her life and dated horrible men.",
   "created_utc": 1693294121,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79awb",
   "message": "When my mom came to see my new house and meet my new friend/roomate she commented on how beautiful my friend was (she is very beautiful) and said i better be careful having my bf around because he probably wouldnt be able to help himself. \n\nSo to summarize;\nI'm ugly\nMy bf is a cheating dog that will follow his dick to any beautiful girl\nMy friend is a disloyal slut.\n\nCan you guess that the time i spend with my mom is limited?",
   "created_utc": 1693294547,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79d39",
   "message": "When I was a teenager, my dad told me the best parts of me ran down my mom's leg.",
   "created_utc": 1693294595,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79fri",
   "message": "On busy-ass New Orleans neighborhood street: “don’t worry about my two year old, they know not to walk in the road”. Child proceeds to play and bounce ball into street and chase after it several times.",
   "created_utc": 1693294655,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79h83",
   "message": "My mom told me my dad lied about his military record and since then my heads been fucked with by both parents because I don't know what is accurate and what's not",
   "created_utc": 1693294688,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79kxd",
   "message": "\"If you're going to cheat, just make sure you don't get caught.\" I was like 12 at the time and had no idea why my dad randomly said that to me. I think he was just blowing off steam",
   "created_utc": 1693294770,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79uig",
   "message": "I still get astounded by how easily one of them, as if it's a knee-jerk reaction, goes for doubting other people's 1) observations, 2) conclusions, 3) sense and even 4) physical sensations.\n\nIt's like an unplanned, weird version of gaslighting. It's done plenty of damage along years and decades.",
   "created_utc": 1693294985,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79uy8",
   "message": "My mother told me last week that if I was late to my dog’s end of life appointment she would put them down without me. I’m rarely late to appointments and I certainly wasn’t late to that one. I’m the most reliable out of all her kids and I would do anything for my animals. The fact that she would insinuate that I would blow off my dog getting put down devastates me. I haven’t called her out on it yet since she left for vacation right after but I’m incredibly angry with her for saying something so cruel and callous on the worst weekend of my life.",
   "created_utc": 1693294995,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy79wkx",
   "message": "Mom called me \"a freak\" when drunk with her friend, while i was going thru my emo phase like 20 years ago. Never forgot it.",
   "created_utc": 1693295032,
   "score": 3,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy78dby",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy8ggc3",
   "message": "a woman at the park wanted to give popsticles to my kid, insisting again and again. Why would anyone give food to a stranger kid",
   "created_utc": 1693319337,
   "score": 6,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7izvq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1644fha"
  },
  {
   "comment_id": "jy7kirx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1644fha"
  }
 ]
}