{
 "submission_id": "164kvts",
 "title": "Men of Reddit, what is the most embarrassing thing you’ve done during sex?",
 "selftext": "",
 "created_utc": 1693321401,
 "permalink": "/r/AskReddit/comments/164kvts/men_of_reddit_what_is_the_most_embarrassing_thing/",
 "score": 114,
 "url": "https://www.reddit.com/r/AskReddit/comments/164kvts/men_of_reddit_what_is_the_most_embarrassing_thing/",
 "comments": [
  {
   "comment_id": "jy96w5k",
   "message": "First real girlfriend in high school (grade 12) was an incredibly flexible gymnast. Her dad walked in to see her feet behind her head with my hands on her hamstrings supporting my body weight. We were going at it good and very exposed. Something about the surprise caused the exact opposite reaction I would have expected.\n\nYeah, dad saw me finish. I’d like to think my memory is false but I’d swear we were making eye contact as I realized there was no pulling out or it would be worse. His  look of disappointment is still burned into my memory and I’m now an old man. \n\nThey moved to another state about 6 months later and I’m fairly confident that was the catalyst.",
   "created_utc": 1693329029,
   "score": 137,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy90lsk",
   "message": "Farted while thrusting. And not just once, like 4 times in a row, once per thrust. Never saw her again.",
   "created_utc": 1693326753,
   "score": 162,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9dumy",
   "message": "She said \"cum for me\" I heard \" comfort me\".....I stopped mid stroking and hugged her, while caressing her hair. 23 years later I still lose sleep.",
   "created_utc": 1693331538,
   "score": 1,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8z05f",
   "message": "Looked down at my own man tits and went soft.",
   "created_utc": 1693326177,
   "score": 25,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8mpx9",
   "message": "Step dad walking in on me on my first proper girlfriend and whilst balls deep I said hi, I still don't understand why I said hi",
   "created_utc": 1693321677,
   "score": 151,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy90ui7",
   "message": "Laughed at a joke on the TV I was using to distract me from cumming too fast.\n\nShe was not amused.",
   "created_utc": 1693326842,
   "score": 135,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy94s6y",
   "message": "So like I was with this girl she was pretty thick. Well I put her in doggy style and I thought I had put it in and instead I was just fucking the space between her thighs. I couldn't tell the difference back then and ended up cumming and only after she told me I wasnt even inside her 😭",
   "created_utc": 1693328266,
   "score": 217,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8nqla",
   "message": "Was having phone sex and i moaned her name and she blocked me",
   "created_utc": 1693322059,
   "score": 138,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9ao2w",
   "message": "Was going down on my gf on Thanksgiving. We were at my parents house, in the basement, on the couch, and I was under a blanket. Apparently my dad came down and slowly backed away like Homer Simpson in the bushes. I had no idea, but she noticed. During dinner, my dad commented, \"Wow, I'm surprised you're still hungry.\"",
   "created_utc": 1693330394,
   "score": 254,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy97dsd",
   "message": "One time my gf was sucking my dick. She was getting really into it and getting sloppy with it. I was holding her hair and forcing her head fairly aggressively. We’ve always enjoyed rough sex so this was very normal for us. \n\nWhen suddenly she pops my dick out her mouth and tells me “slap me!” and holds my dick next to her cheek while staring up at me. This was a bit out of my comfort zone but without hesitation I slap her across the face with an open hand. \n\nShe gets back to sucking my shlong and I get back to simply enjoying the feeling of the getting the soul sucked out of me. But I can’t help but feel like maybe I had swung a little too hard. I didn’t like that feeling. I pull my dick out of her mouth and tell her “I rather not have to slap you.” She replied “Same, I meant slap me with your dick.” \n\nWe both burst out laughing. Like uncontrollably laughing. 😂",
   "created_utc": 1693329208,
   "score": 112,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8w8f9",
   "message": "Leg cramp after I called my then girlfriend by my previous girlfriends name 😂😂😂😂",
   "created_utc": 1693325180,
   "score": 147,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9ft6n",
   "message": "My partner fanny farted and in an attempt to make it less awkward i farted and then shit myself",
   "created_utc": 1693332242,
   "score": 106,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy948ac",
   "message": "I was dating a leasing agent and we were hooking up in one of the apartments that she was showing and we heard the door open and another agent was showing an older couple the place lol we rushed to put our clothes on but they 100% knew",
   "created_utc": 1693328069,
   "score": 96,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy90wwj",
   "message": "Wasn’t having sex but gf came over and walked into my room. I was passed out with my dick in a pocket pussy because I got tired while using it and passed out.",
   "created_utc": 1693326866,
   "score": 74,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8zp2z",
   "message": "Pulled a back muscle trynna get a titty in my mouth during spoons",
   "created_utc": 1693326426,
   "score": 226,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy966dc",
   "message": "Almost died going down on a girl with a clit piercing. She was riding my face and the ball of the stud must’ve went in my mouth or nose and into my throat. Was a couple seconds from blackout when I coughed it up. She was shook from it. But I was horny and ready to keep going.",
   "created_utc": 1693328770,
   "score": 237,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy96kfi",
   "message": "I like to listen to music while having sex. Typically me and my friend who I was dating at the time throw something on my phone, but for whatever reason we used hers. Her tastes are more .. interesting. \n\nEverything is going well, can’t remember what was playing before it switched but now it’s on “What does the fox say?”. I don’t know what it was but that made me hit the climax button wayyy earlier than I thought. She ends up laughing hysterically while I’ve got the most confused orgasm face she’s ever seen. \n\nBurned into both of our minds forever.",
   "created_utc": 1693328912,
   "score": 41,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy918z2",
   "message": "My gf scooted off my penis and told me to cum in her ass. Immediately bust my load on the back of her leg.",
   "created_utc": 1693326989,
   "score": 197,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy92oys",
   "message": "She was on top. When I pulled out, my nut shot out like a rocket and over her and landed directly on my forehead.",
   "created_utc": 1693327520,
   "score": 114,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8n7d1",
   "message": "Blasting in like 5 seconds and not being able to stiffen again lmao",
   "created_utc": 1693321860,
   "score": 236,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8qxgo",
   "message": "I had a bloody nose out of nowhere, and it dripped on her face. It was like some bad anime",
   "created_utc": 1693323240,
   "score": 55,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy959wz",
   "message": "Nothing “embarrassing” but trying to find the hole in complete darkness is frustrating",
   "created_utc": 1693328444,
   "score": 187,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy98sz5",
   "message": "I broke a girls tailbone. I had a big bean bag next to my bed for awhile and it was fun to toss her onto it. Well someone removed it without telling me. And we were getting hot and heavy after a night out and without thinking i practically suplexed this poor girl onto the hardwood. We didnt hookup again after that.\n\nEdit because someone gave me a gold award (thanks):  i didnt actually know this until i overheard her explaining her recent hospital visit due to \"falling backwards out a window\". It took awhile for it to click as i had forgotten about it. But a glance at her friend in the know wearing a shit eating grin and trying to supress her laughing confirmed what had actually happened. I still feel horrible about it.",
   "created_utc": 1693329720,
   "score": 104,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9b7dw",
   "message": "Not me but a friend was putting it in his gf’s butt in the back of a car at night. Cop shows up and flashes his light in the back of the car. He freaks out and pulls out super quick. She proceeds to shit on him, and then he pukes on her. Cop didn’t stick around and said go home.",
   "created_utc": 1693330587,
   "score": 198,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy95ofv",
   "message": "Singing a chorus during an orgasm.\n\nChris Isaak. Wicked Game.\n\n\"iiiiiiiiiiiiii dont wanna fall in love...\"\n\nLuckily she was a fan.",
   "created_utc": 1693328590,
   "score": 119,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy975xo",
   "message": "I was about to climax and my dick got ticklish. I climaxed while giggling like a schoolgirl. I am a guy in his 40's. 🙄",
   "created_utc": 1693329128,
   "score": 187,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy91zti",
   "message": "Literally not getting hard and still blowing load in like 2 mins... that was pretty awesome",
   "created_utc": 1693327262,
   "score": 125,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy90lio",
   "message": "No lie, I once referred to myself as a 'Master Cocksman' DURING the act. Things were going well and I thought I was being funny, but yeah that ended it.",
   "created_utc": 1693326750,
   "score": 206,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8vxx9",
   "message": "Agonizing leg cramp (mine) that was so bad we both had to stop.\n\nAnd those later-in-life orgasm headaches are the worst, and then having to explain them…",
   "created_utc": 1693325072,
   "score": 75,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy995y6",
   "message": "Get that dude in here to tell his story of pausing a threesome to watch porno featuring a dude pissing in the assholes of two girls, grossing the other threesome participants out.",
   "created_utc": 1693329850,
   "score": 179,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy97co6",
   "message": "I came in my condom, while still being inside her. But I didn't pull out afterwards and just went for a cuddle with my dick still in there, rapidly getting soft. After a minute, she gets up and yells: \"OMG, your condom is inside me and there's cum everywhere!\" (condom crawled down from dick and got lost in her tunnel). Also didn't help that it was happening in dark, cold bunker in army training camp. And, as a cherry on top, she got pregnant from that.",
   "created_utc": 1693329197,
   "score": 173,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy95gk2",
   "message": "Ok so this is a long story, I was with my best friend of roughly 5 years and we had been hooking up from time to time (keep in mind I was relatively new to sex) and one time we was in her family's home me her and her brother who was a little bit older at the time, whilst playing Mario kart on her nintendo wii she began to grab my leg, things slowly escalated and then there was a point when her brother went to shower and we took the opportunity to you know what, which lasted longer than expected and her brother walked back in on me plowing his sister, she tried explaining what was going on and i panicked asking him if hed like to join in, we stopped having sex at her house after that and i left with a black eye rightfully so.",
   "created_utc": 1693328510,
   "score": 241,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy940tc",
   "message": "I once having a sex whiles the song “ Thunder by Imagine Dragons “ is playing. I can’t help but laugh and went soft",
   "created_utc": 1693327994,
   "score": 230,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy996t6",
   "message": "Yo my now wife, when we were younger and ended my relationship with my ex, I said my ex name out loud while I came in her. That fight lasted about 10 years, all clear for now....",
   "created_utc": 1693329858,
   "score": 62,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9d85b",
   "message": "I should create a fake account for this, but I know Reddit will never share this so...\n\n\\- I shot the dog.\n\nYeah, I know. I know. Well to be fair, the dog was on the bed and I'd warned him MANY times to get the fuck out but he didn't seem to mind all the bed shaking so me and the GF were getting pretty heated and just as I'm about to pull out and go all pornstar, the dog barks and that startles me, which causes me to turn toward the dog and...\n\nI got him.\n\nThe look he gave me, riddled with betrayal. Like the Godfather looking over his eldest son, dead and riddled with bullets. \"Look, look what they've done to my fur.\"\n\n I wiped him down and could barely even look at him. My GF was like, I knew you liked doggy but had no idea.\n\nTook me a few years for her to stop yelling \"GET DOWN MR PRESIDENT\" at the dog every time I was about to climax.\n\nI really thought I'd feel better after typing this out.",
   "created_utc": 1693331316,
   "score": 143,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy99dor",
   "message": "During a “doggystyle” sesh, I had one hand around her waist pulling her hips towards me, the other caressing her collarbone area, and while nibbling on the earlobe I burped…a long, loud, burp. Never saw them again. Thanks Panda Express! 🥹",
   "created_utc": 1693329928,
   "score": 182,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9bchf",
   "message": "I said stop I need to use the bathroom. Anal\n\n\nHe did not stop\n\n\nWhen I orgasmed, I shat violently. It was the strongest climax of my life. I screamed and shat against my will\n\n\nHe threw me off the bed\n\n\nI collapsed on the floor half conscious covered in shit\n\n\nI was not embarrassed tbh I was too busy being utterly demolished\n\n\nHe dragged me to my feet a few minutes later and put me in the bath tub\n\n\nI tbh barely remember it. I didn't even see the mess before he stripped the bed. I was *gone.* Laying on the floor half conscious just whimpering\n\n\nLess embarrassing and more \"and that's the story of the time I shat fury on a guy who didn't listen to me. That's what you get fucker. A+ tho.\"\n\n\nNgl I went a good few years like \"I came so hard I fell off the bed\" until one day it just clicked that I vaguely remembered him violently throwing me off the bed\n\n\nI still crack up over it like \"he was an asshole but he performed good\"",
   "created_utc": 1693330638,
   "score": 22,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy92t0e",
   "message": "Dislocated my knee, killed the mood a bit",
   "created_utc": 1693327559,
   "score": 160,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8wlai",
   "message": "Said I love you 😬",
   "created_utc": 1693325308,
   "score": 243,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy94ns9",
   "message": "New Year's Eve party in university. I vomited all over the girl and inside her car while getting head. \n\nNo finish and plenty of sorry and then leaving.",
   "created_utc": 1693328222,
   "score": 120,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy948i9",
   "message": "When I was in high school, a girl was giving me great head.  Not a gf, but a generous coworker. \n\nIn moment of weakness, I forgot myself and yelled, “SUCK THAT DICK!”\n\nShe stopped and slowly turned to me…”whaaaaaat?”   That, apparently, was a recipe for blue balls.",
   "created_utc": 1693328071,
   "score": 181,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy99zlk",
   "message": "The first time I had sex I had no idea how to eat out and I licked her pubes for like 10 minutes.",
   "created_utc": 1693330149,
   "score": 46,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy97bvk",
   "message": "Fondling her boob as she was going down on me. Never found the nipple because I realized it was a roll of her stomach fat. I was embarrassed, but she played it cool and is still one of the best blow jays I’ve had to this day.",
   "created_utc": 1693329189,
   "score": 166,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy98ldf",
   "message": "Used a cock ring that was too tight which I guess popped some vessel and I essentially came blood having sex with my girlfriend for the first time after not seeing her for months. More unnerving than embarrassing I guess.",
   "created_utc": 1693329645,
   "score": 96,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9adrw",
   "message": "I fell asleep while fingering my gf, I've also fallen asleep while she was riding me. Same gf. I used to stay up all night for her because she worked nights, then she'd get home at 8am and we'd bone, then sleep till 2pm. Some days I had trouble staying awake.",
   "created_utc": 1693330291,
   "score": 123,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9c07s",
   "message": "An old hook up from college texted me late one night. I was almost 30, and sex with her back in our day was incredible. We only stopped hooking up because I caught feelings. Now that we were older I thought “this is my chance to redeem myself, I’ve picked up a few tricks since then”. The conversation led to sex pretty quickly, she starts sending me nudes and she aged beautifully. I set up a night to hang out. \n\nI get to her place, we start drinking, and I make my move. We move to the bedroom and I’m impressing even myself. If I had a highlight reel of sex, this night was my career-defining performance. After various positions, we switched back to missionary and it’s getting more intense as I’m about to finish. She starts to orgasm \u0026amp; I’m almost there too, next thing I know, something heavy falls and hits her right on the face. \n\nTurns out it was a glass fishbowl she put coins in. I guess in the heat of the moment we never bothered to clear the headboard. I start apologizing over \u0026amp; over, checking if she’s ok and it looks like she’s crying. She turns her face over back to me and she’s laughing hysterically. All was clear, she was ok, but it took alot for me to finish after that",
   "created_utc": 1693330876,
   "score": 250,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy93q4h",
   "message": "Just not being able to get it up. Pretty humiliating.",
   "created_utc": 1693327890,
   "score": 89,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9co8o",
   "message": "I was a Canadian student living abroad. My new girlfriend and I were back at my place and had made it back to the bedroom. Thing escalate quickly and the pace it picking up. We’re really givin’r. I roll her underneath me, the passion is peaking….\n\n“I’m gonna cum, Eh!” I shout.\n\nSuddenly proceedings come to a halt. \n\nSilence.\n\nWe both erupt into laughter, the previous near eruption forgotten. We laugh the kind of laugh where you can’t breath. \n\nVery embarrassing, but also the funniest moment I’ve had sexually.",
   "created_utc": 1693331116,
   "score": 124,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy93x3q",
   "message": "She had a horrible smell down there and come to find out it was a condom that had been stuck inside her cooch for weeks and started to rot. After I nutted I told her she needed to get that looked at.",
   "created_utc": 1693327958,
   "score": 230,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy99tpz",
   "message": "Told her she was as moist as a swamp.",
   "created_utc": 1693330089,
   "score": 83,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9d3yj",
   "message": "Took a seroquel before bed (didnt take them regularly) and my wife came in and initiated some play time couple minutes after, everything was going great and after about 20-30 minutes she said it was like a light switch went off on my body. I guess i passed out on top of her and inside of her and started snoring. She couldnt wake me up and said it took almost 5 minutes to finally squeeze out from under me.",
   "created_utc": 1693331273,
   "score": 129,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy97zyk",
   "message": "Drunk, fell asleep during a blow job, started dreaming about hockey, woke up yelling my buddy name lol",
   "created_utc": 1693329432,
   "score": 154,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy91kpe",
   "message": "I farted during rimming",
   "created_utc": 1693327107,
   "score": 78,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy96kr9",
   "message": "Going flaccid while wearing a condom. She said \"If you can't stay hard with one on that means that you don't use them.\"",
   "created_utc": 1693328915,
   "score": 83,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy99lmx",
   "message": "performance anxiety prob cuz of masturbation, drinking the day prior, and overall subpar circulation. I got hard but delivery guy came and went down to get food so soft again. I went to get the food I came back. I couldn’t get hard enough after that. tried making out dry humping her ass rubbing it against her pussy eating her out a bit but nothing worked tried for a hour and we just called it and ate the food. What made it worse for me is that we’re in ldr and that was the last night of our vacation together I wanted to fuck one more time so bad lolllhjghjk",
   "created_utc": 1693330008,
   "score": 53,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy97q8f",
   "message": "A couple years ago, I was hanging out with this girl for the first time. One thing lead to another and we end up in bed. The lights were off and the room was very dark. At one point we moved and I had head butted her. We stopped and laughed about it, and got back to it. \n\nAfter we left the room she noticed something on my face. It was blood. Thought my nose was bleeding. I looked at her, and she also had blood on her. It was her nose bleeding. Bled over the both of us. She was more embarrassed, but it was 100% embarrassing and also my fault.",
   "created_utc": 1693329334,
   "score": 60,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy94jxb",
   "message": "I was drunk and farted while 69ing.  I don’t know what I was thinking.",
   "created_utc": 1693328183,
   "score": 17,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8xmke",
   "message": "Yawning",
   "created_utc": 1693325681,
   "score": 42,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9cv5e",
   "message": "Confessed my feelings and was then rejected",
   "created_utc": 1693331185,
   "score": 32,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9flzd",
   "message": "She was on top and I went to smack her ass, well she was going up at the same time I went to smack and smacked myself in the balls. I pushed her off of me and rolled onto the floor from the bed and I laid there in the fetal position. She thought it was hilarious so I guess there's that. Been together 7 years.",
   "created_utc": 1693332170,
   "score": 79,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9ahpo",
   "message": "I have this thing where my nose just randomly bleeds. No idea why, but it’s been like that since I was a kid. I also blush a lot. So my face gets red, First time I ever went down on a girl we were in a car, I was super hyped but also nervous so my face was super red. Pulled her pants and underwear down around her ankles and threw them over my head and dove in face first. Not three seconds later my nose exploded blood everywhere. I don’t think I’ve ever been so embarrassed.",
   "created_utc": 1693330331,
   "score": 36,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8wxnm",
   "message": "Sneezed and shot a little pee into my boyfriend's mouth.\n\nETA: Hello everyone who knows for a fact that squirt is pee. Thank you! We all appreciate you being here and telling us that quirt is pee. Keep it up! We love you telling us that over and over! \n\nRemember 20 years ago when science knew with 100% certainty the g-spot was a myth? And how then finally the anatomy of the clitoris was mapped and science realized that the g-spot is just the back of the clitoris? Remember when two years ago Swiss scientists found a previously undiscovered muscle in the jaw? And that same year a new nerve cell was discovered in the eye? And in 2019 a new pain sensing organ was found in human skin? And a bone that was supposed to have evolved out of the human knee was found to still exist? I'm sure this is nothing like that and THIS time the science is 100% correct.",
   "created_utc": 1693325432,
   "score": 210,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8nqeg",
   "message": "We are on Reddit, do you really think we have sex?",
   "created_utc": 1693322057,
   "score": 185,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy92mgu",
   "message": "Clapped, it’s always embarrassing when just one person claps I find",
   "created_utc": 1693327490,
   "score": 27,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9i6zx",
   "message": "Nr embarrassing  but funny I was joking around while eating🐱and blew raspberries on it while eating it and she came and couldn’t stop laughing afterwards.",
   "created_utc": 1693333101,
   "score": 12,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy95xdl",
   "message": "I was in the middle of a massive binge watch of “Game of Thrones.” I was trying to catch up before the season 6 premiere so that was on my brain a lot. anyway I’m fucking this girl from tinder and right as I cum I scream “Drecarys!” And she gave me a “wtf” kind of look.\n\nEither that or you know, failing to get it up a couple times 😅",
   "created_utc": 1693328681,
   "score": 57,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy8merm",
   "message": "When I was younger I will never forget I finally hooked up with a chick I have been wanting to. Well in all that excitement I finished wishing 2 minutes.",
   "created_utc": 1693321560,
   "score": 39,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy97lwo",
   "message": "Apparently women do not enjoy getting blasted with semen with no warning.  Big mad. I was young. Pro tip plan for the climax.",
   "created_utc": 1693329289,
   "score": 43,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9ifuz",
   "message": "Made some laser noise slapping my girlfriend's face with my penis and she just looks up at me and says, \"Don't make sound effects.\" I think my soul might have died in that moment.",
   "created_utc": 1693333190,
   "score": 109,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy970a5",
   "message": "My colostomy bag broke.  \"Well, I guess we can mark 'Poop Sex' of the list\"",
   "created_utc": 1693329071,
   "score": 19,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9sfz1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9kmjl",
   "message": "Not as embarrassing as some others but it was the first time me and my now wife were doing anything sexual together, we were kissing while she jerked me off. I could feel myself getting close but didn’t want it to end so I broke off the kiss to tell her to stop for a second but for some reason the only sound to come out of my mouth was a high pitch kind of squeaky sound. \n\nShe laughed and I did also but I came at the same time. She still makes that sound to me occasionally now 18 years later.",
   "created_utc": 1693333976,
   "score": 95,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9ruxt",
   "message": "I’m lying here stoned and have just read this whole thread like a book whilst absolutely laughing my head off. I’ve never done that before, read a whole massive thread. People of Reddit, thank you very much for your honesty, it was much appreciated and fucking hilarious…..",
   "created_utc": 1693336563,
   "score": 80,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9eejn",
   "message": "I was in the middle of donating blood in the morning and had skipped breakfast when I got a sexy message from a girl I was messing around with at the time. When I finished, the nurse told me to sit down for 15 minutes and have a biscuit but I skip that and pretty much ran out the door (this girl was a 10).\n\nI drove to her house and arrive to her in nothing but lacy underwear. We run upstairs and after about 30 seconds of intense action I feel myself starting to go limp, which has never happened before, which I think to myself is odd. The next thing I find myself borderline fainting. I just about manage to stop myself from headbutting her and roll over and pretty much pass out.\n\nI woke up about 5 minutes later to her standing over me with an orange juice and a biscuit. I still look back and cringe now. She was cool about it though and I made up for it later on.",
   "created_utc": 1693331733,
   "score": 37,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9wo21",
   "message": "I let out a little fart, of course I snorted out a little laugh. But snot also came out because of the snort and went into her mouth.\n\nSmooth operator.",
   "created_utc": 1693338273,
   "score": 29,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9yfr9",
   "message": "Somehow was having trouble getting inside of her, which made me upset to the point that I spread her p\\*ssy and said \"Helloooo?!\"\n\nShe ended up laughing so hard that we had to cancel the session. Later she ended up becoming my girlfriend.",
   "created_utc": 1693338895,
   "score": 34,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9fxxe",
   "message": "My ex had an asthma attack during sex. Had to go to the ER at 2am, at the time we'd just been hooking up for a few weeks. I was terrified I was gonna have to explain a dead guy in my apartment for a bit there",
   "created_utc": 1693332289,
   "score": 28,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9p47t",
   "message": "Moaned while getting my dick sucked but my voice cracked :(",
   "created_utc": 1693335577,
   "score": 25,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9wsij",
   "message": "Said “oh nooo!!” And then farted super loud right as I came. \n\nNow we’re married and have our first child together lol",
   "created_utc": 1693338318,
   "score": 29,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9oq0r",
   "message": "My first time. I was ecstatic, she’s an absolute smoke show. I mean you name it she has it going on. Hung out a few times. This time we made it back to my parents house. Had a few people over drinking and hanging out. Things were great. Nights coming to an end and she tells me she’s ready to go. I say ok I’m gonna go in but you can come if ya want. So she does. Now I’m pumped. Sneak her in do the whole making out thing pull her clothes off then mine. She starts taking care of me. I get half a chub. Go for sex. Now I’m floppy. Couldn’t get hard. I was 18 then so it wasn’t an issue any other time but this time I was nervous. I apologized and did my best to take care of her. We’ve been together ten years now. Married seven, 3 kids she’s still amazing and I thought I had ruined it",
   "created_utc": 1693335436,
   "score": 50,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9e58g",
   "message": "While I was on top I accidentally kneed the girl on her pussy (not hard, it was like a tap). For what ever reason I say “I apologize, I just kneed in the cunt”. We both burst out laughing 😂. Then we watched The Big Lebowski.",
   "created_utc": 1693331642,
   "score": 25,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9sv2m",
   "message": "She was on top and riding, for some reason I wondered what the time was and I had my watch on my wrist so I lifted my arm and took a good look to see what time it was. She was not happy.",
   "created_utc": 1693336924,
   "score": 20,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9d1fc",
   "message": "First time with a girl who I would eventually date for three years, I farted super loud when I came. A millisecond after I knew it was happening I tried to mask the sound with a loud grunt. Too loud really. The look of shock on her face was hilarious. I told her I’d never experienced an orgasm that intense before.",
   "created_utc": 1693331247,
   "score": 18,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9cx4g",
   "message": "I came so hard I farted",
   "created_utc": 1693331204,
   "score": 38,
   "submission_id": "164kvts"
  },
  {
   "comment_id": "jy9rc8n",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "164kvts"
  }
 ]
}