{
 "submission_id": "164nsds",
 "title": "What is the most f**ked up thing you saw someone do in a public place?",
 "selftext": "",
 "created_utc": 1693328107,
 "permalink": "/r/AskReddit/comments/164nsds/what_is_the_most_fked_up_thing_you_saw_someone_do/",
 "score": 129,
 "url": "https://www.reddit.com/r/AskReddit/comments/164nsds/what_is_the_most_fked_up_thing_you_saw_someone_do/",
 "comments": [
  {
   "comment_id": "jy9e5oo",
   "message": "I once saw a homeless man rinse his mouth out with water from the windshield cleaning \"bucket\" at a gas station",
   "created_utc": 1693331647,
   "score": 50,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9gusp",
   "message": "I was waiting for a bus in the ‘rough’ part of town when I heard two men having a full blown argument on the other side of the bus stop… one was being extremely aggressive whilst the other sounded confused at the verbal lashing he was receiving. It went on for a couple of minutes and the meeker one was nearly in tears, so I decided to walk around the other side of the bus stop to take a look at what was going on. When I poked my head around the corner the poor guy was crying but his aggressor was nowhere to be seen, I asked if he was ok to which he said “yeah, don’t worry about him, he’s all talk”. I nodded and turned around just as the nastier man re-emerged to berate his victim… only it wasn’t another person, it was the same guy shouting at himself with an alternate personality. Until you see these things up close you don’t realise how disturbing it must be to suffer from such mental health issues.",
   "created_utc": 1693332619,
   "score": 236,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9hvm8",
   "message": "I was working in a building under construction. One morning, we look across the street and watch a homeless lady jump from a 6-story parking garage and hit the street below.",
   "created_utc": 1693332987,
   "score": 115,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9j2qf",
   "message": "Saw a coworker take off his shoe and sock, pull up his foot, and bite his toenails DURING A WORK MEETING AT THE OFFICE.",
   "created_utc": 1693333416,
   "score": 101,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9c9ph",
   "message": "A scary ass woman was yelling at people in a store. The manager told her to leave. She screamed insults at him as security escorted her out. When I left the store, she was still screaming at him. He was blocking her from going back into the store.\n\nThen she did something I never thought I'd see in my entire life: She reached into her pants, pulled out a bloody tampon and threw it at the manager. She missed but it stuck to the glass door.\n\nShe laughed as she ran off. I wanted to vomit.\n\nGoddammitfuckingholyshit. I never want to see anything like that again.",
   "created_utc": 1693330971,
   "score": 248,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9gdgw",
   "message": "21st B-Day at a Festival in FL called Langerado. Was incredibly drunk but I'll never forget this...unfortunately \n\nSo, we're listening to a band called Umphrey's McGee and everyone is having a good time. All is well. Heaven on Earth. Until I turn around. There's a guy, late 30s or early 40s by himself and he was having quite a time. \n\nHe kept shoving his hand up his ass and licking his fingers afterwards. At some point he started chasing people and then some poor souls working security had to deal with him. Ewwww.",
   "created_utc": 1693332443,
   "score": 239,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9mzee",
   "message": "I was outside of a hospital visiting a friend. He was smoking. A homeless man asked hin for a cigarette and my friend said no so the homeless man stuck his hand in the butt tray and jammed a handful into his mouth and chewed as he walked away. \n\nWe looked at each other in silence and he finally said\n\"Well I would have given him one if I knew he was going to do that!\"",
   "created_utc": 1693334818,
   "score": 114,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9jh7i",
   "message": "Saw a young lady in line in front of me that (apparently) pre-partied for the show (it was a planetarium) and passed out on her feet, she fell to the side of the line rather than into someone behind her, and her head hit the floor first with a nauseating \"CRACK\", and then she went into convulsions....  I don't know how she fared after the ambulance loaded her onto a stretcher, but thought about that many times...",
   "created_utc": 1693333558,
   "score": 217,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9stdy",
   "message": "I used to deliver janitorial supplies to businesses. Part of my route was in the Kensington section of Philadelphia it's basically zombie land there and the whole neighborhood is filthy, idk how people can even live there. Needless to say, I've seen A LOT. But the one thing I saw that really stuck with me was seeing a naked man covered in his own excrement and eating it. He was clearly very disturbed. No one paid him any mind either. It was surreal.",
   "created_utc": 1693336907,
   "score": 238,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy954sv",
   "message": "Take a shit in the street in Paris",
   "created_utc": 1693328392,
   "score": 227,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9i3x2",
   "message": "Saw a kid follow around a toad at a state park for a bit, pick it up, and ground it against a tree, eviscerating it in an instant.  An adult immediately grabbed them and took them off yelling as the kid didn't look bothered by the interaction at all.  It was surreal and disturbing.",
   "created_utc": 1693333070,
   "score": 184,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9j6ab",
   "message": "I saw one homeless guy shit on another sleeping homeless guy, the sleeping hobo threw the shit at the first guy then they fought",
   "created_utc": 1693333451,
   "score": 30,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9bi4o",
   "message": "Dude passed out, pants down, with a needle in his arm, a kitchen knife laying next to him. Outside of a high school.",
   "created_utc": 1693330694,
   "score": 92,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9anzm",
   "message": "there was someone jacking off in my school bathroom. they were in a stall and you could hear it very clearly. You would think that they would stop just by me walking in, but no. Kept going. Could’ve sworn i heard a moan or two as well. I didn’t want to report it because at the end of the day, it’s fricking hilarious looking back. \n\nalso this next story is a story that one of my former bosses told me. it was back when i worked in fast food. he was working the graveyard shift so that’s when all the weirdos come in. There were a few people in the lobby who had begun a small arguement. But one thing led to the next and it ended in a chair being thrown at one of their heads and knocking them unconscious. the police were called and the dude got arrested, and the other guy went to the ER. My boss was pissed because this was all like 10 minutes before close.",
   "created_utc": 1693330394,
   "score": 113,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9dxoi",
   "message": "Slap their wife and punch her in front of the kids.",
   "created_utc": 1693331568,
   "score": 222,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9fisl",
   "message": "I’ve lost count of the number of times I’ve seen a homeless man yanking it in public in New York City. Most fucked up thing is probably public sex between 11-12 year olds on a train. Many people who saw that happen left a piece of their soul on the F train.",
   "created_utc": 1693332137,
   "score": 229,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9lsqx",
   "message": "Not me, but my dad saw a woman at the store say to her.. Probably 2 month old baby \"I'm gonna beat your ass if you don't stop\" because the baby was being a baby and being curious, reaching out and grabbing things -_-",
   "created_utc": 1693334401,
   "score": 228,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9pug0",
   "message": "Woman recording a mother and her two children after the mother collapsed and was unresponsive in a Costco. Asked her to stop, she looked at me and scowled, so I amplified my request which was \"Stop recording, you completely demented, bitch!\" and the immediate unfavorable attention that got her compelled her to stop. The woman who collapsed, her small children were terrified, screaming and crying, and it was awful. Can't imagine why you would want footage of such a thing. Just remembering makes me sad and hope that everything turned out alright.",
   "created_utc": 1693335839,
   "score": 45,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9ukmx",
   "message": "Roofie a girl's drink, no subtlety just dropped it right in. \n\nWhen confronted he pleaded with the line \"cmon she is really hot and would never give me a chance\" or something close to that. Only time I've ever beaten a man with no care for him at all. Hopefully he hasn't done it again.",
   "created_utc": 1693337537,
   "score": 193,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9ct0v",
   "message": "I once saw photos of some dude receiving a blowy on a water taxi in Venice. His butt crack was out and everything. Wild.",
   "created_utc": 1693331163,
   "score": 226,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9lrwb",
   "message": "A woman at my old retail job I used to work at came in dry heaving to our restroom. It sounded like she was about to give birth. Nope, much worse. She goes into our restroom and shits all over the stalls, the floor, its coated. It became a complete swamp. This woman proceeds to then take off all her clothes, and leave it there. She walks out of the store nude, screaming.",
   "created_utc": 1693334393,
   "score": 230,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9cqdd",
   "message": "Fucked up in terms of terrible? I saw a guy beating his wife one time in front of their kids. Like actually beating, not the slap here or there he was punching her, kicking her on the ground. Fucking awful.\n\nFucked up in terms of gross? Louisville, Kentucky. Saw a guy just pull his pants down in the middle of a Walmart parking lot and just start taking a dump. It was disgusting.",
   "created_utc": 1693331137,
   "score": 178,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9ekrc",
   "message": "Watched someone slice their wrists on the Atlantic City boardwalk.",
   "created_utc": 1693331797,
   "score": 218,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9mltv",
   "message": "So a guy tried to kidnap a little girl at the fair once. The mom started yelling for help. He punched her and tried to run away with the girl. She wiggled free and he tried to flee. \n\nI caught him with a clothesline that would have made Hulk Hogan proud. He never saw it coming. The police were there in minutes. We kept the guy there until they arrived.",
   "created_utc": 1693334685,
   "score": 170,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9wcxv",
   "message": "There was a suicidal guy on the roof top across from our apartment. The police were negotiating with him for 5 hours. Eventually they brought him burgers and beer and he came down but a couple times we thought for sure he was going to jump. We just sat there for five hours watching biting our nails. \n\nThis old polish couple was arguing in McDonald's right at the cashier and he yanked her back violently by her hair like nearly broke her neck.\n\nSaw a dude take a shit in the middle of a busy road and wipe his ass with a liquor store bag \n\nOne time this guy who was ripped on fuckin PCP or something came running up to the market, started coughing and spitting violently on everyone like full on slimy loogies, took his pants off entirely and started pissing all over the produce screaming \"Where is your God now?!?!\". I ran the other way. I thought he was going to start stabbing people or something. Not sure what happened to him.",
   "created_utc": 1693338164,
   "score": 22,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy960o3",
   "message": "[removed]",
   "created_utc": 1693328715,
   "score": 195,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9cp1l",
   "message": "Early January 2023. Public beach in Varadero, Cuba filled with people of all ages, including my own children.\n\nA plane of Italians arrive. Most are great and just looking to relax for a week or so. Unfortunately a youngish couple are amongst them and they appeared to be social media influencers.* They filmed everything they were doing and pushed the limits of what most people would think is acceptable behavior.\n\nThen, they crossed the line. On the beach, in full view of everyone, he pulls her bikini bottoms to the side and slides his penis in as she sits straddling him. She, of course, held the camera up filming it all.\n\nTheir fellow Italians had enough and basically swarmed them on the beach. We left a day or so later but I wouldn’t have been the least bit surprised if they were kicked out of the resort.\n\nThe best part? My teens laughed at them.\n\n* I am old enough that anyone I find irritating or obnoxious is now classified as an influencer. It’s just easier that way.",
   "created_utc": 1693331124,
   "score": 56,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9pt30",
   "message": "At a Bike Rally in Alabama in the 90's.   \nWoman. Butt Ass Nekkid. Bent over a picnic table. Getting nailed. Next to a sign that said \"Trying to get pregnant. Shoot your shot\". Line of 10 guys .... I passed right on by that one.",
   "created_utc": 1693335825,
   "score": 71,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9q01q",
   "message": "Saw a guy who I later found out was a level 3 sex offender \"fall\" from the 11th story of my building while being taken into custody by parole. Heard a big bang as the screen was knocked out, looked out the window just in time to see him splat in the parking lot, handcuffed and all. Unfortunately I can picture it like it was yesterday.\n\nOfficial story was that he was caught living in a building with kids and did a runner after being cuffed, but only those two cops will ever know how it really went down.",
   "created_utc": 1693335896,
   "score": 38,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9dhan",
   "message": "I saw a guy 'metal detecting' in a graveyard.",
   "created_utc": 1693331407,
   "score": 163,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy97hmi",
   "message": "Walking through Sheffield on a Saturday night.  Group of girls walking down the street.  Girl in the middle drops down, pulls down her underwear and takes a shit.\n\n\u0026amp;#x200B;\n\nWe are married now",
   "created_utc": 1693329246,
   "score": 211,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9klj3",
   "message": "In a van, the back was open.  Two nude women were on top of each other kissing, a guy was alternating between fucking them, switching between their vaginas.",
   "created_utc": 1693333965,
   "score": 141,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy961pm",
   "message": "Saw a man get crazy close to a young girl on the train in Tokyo, the train was not crowded, but the seats were full. No one did a damn thing, so of course I stepped in.",
   "created_utc": 1693328725,
   "score": 134,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9lvpj",
   "message": "In Hungary it was quite big news, that a random guy walked in an underpass and started giving a bj to a passed out homeless/alcoholic guy. The f*cked up thing was that someone took a video of it and everyone saw the video",
   "created_utc": 1693334430,
   "score": 113,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9pb6k",
   "message": "Saw a van pull up to an armored truck loading money into an ATM. Dudes hopped out of the van and started shooting at the guard immediately. The other guy hopped out of the armored truck and return fire. The other guard was shot and lying on the ground. The criminals hopped back in the van and started fleeing. They hit a parked car and then caused another car to drive up on the curb to avoid them. This all happened in about 30 seconds. I was laying under my work truck for a few minutes until I knew I was in the clear. I took the rest of the day off and drove home.",
   "created_utc": 1693335646,
   "score": 153,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9ug06",
   "message": "Smoke what I can only assume was crack out of a broken lightbulb, on a public bus during the day.",
   "created_utc": 1693337490,
   "score": 112,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9ewxs",
   "message": "Christ, I live in Manhattan, I don't even know where to start",
   "created_utc": 1693331918,
   "score": 26,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy97fvt",
   "message": "Saw a crackhead try to kick a little girl, literally just got off the bus and swung his foot unprovoked.",
   "created_utc": 1693329229,
   "score": 227,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy94v54",
   "message": "I saw a man wiping his face with his own piss 🤢",
   "created_utc": 1693328296,
   "score": 102,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9mp90",
   "message": "In my hometown I was using the mall food court bathroom which is usually a bad idea... but i had too.. while i was taking the worst shit of my life. people in the stall next to me were getting on the whole time. I cant image someone being that horny next to me in my worst time.",
   "created_utc": 1693334719,
   "score": 82,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9my5a",
   "message": "Earlier in the day, there was a guy walking around naked high as balls on acid, masturbating with one hand and thumb up his butt w the other.\n\nLater in the day, watched a dude sit down under a flood light, stare up into it and completely fade. He was ODing and I had to run to get help.\n\nI stopped going to EDM fests after all that.",
   "created_utc": 1693334806,
   "score": 105,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9uch0",
   "message": "Freshman year in college we were walking hime from breakfast and there was a tour of potential students walking by us. I heard a rustling in the bushes, and this guy stands up and yawns. Scratches himself, one eye open, and as he stretches he is looking around to get his bearings. Bends down, picks up his jacket, and proceeds to head off Im now assuming, to home. \n\nI laugh as three parents grab their kids and shuffle them out of the tour. Tour guide was just like “WTF”.",
   "created_utc": 1693337454,
   "score": 133,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy99p8y",
   "message": "My ex get a hand job at church. It took everything in my fiancé and i not to laugh at this dude.they were even near the front and still didn’t care.",
   "created_utc": 1693330044,
   "score": 155,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9jz40",
   "message": "I've Seen Sharia Law \"honor\" killings. One of them was a 30 year old woman, 8-9 months pregnant. She was shot in the head and left to die in the middle of the road. The baby couldn't be saved.",
   "created_utc": 1693333737,
   "score": 189,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9n4w7",
   "message": "Guy was fishing but a duck ate his hook. He reeled the duck in, grabbed it by its neck and started slamming it against a tree until it died.",
   "created_utc": 1693334872,
   "score": 94,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9o5bp",
   "message": "Walking down avenue a in the east village right before Tompkins. Bad rain storm, lady’s umbrella gets flipped inside out, she throws it, keeps walking, takes off all her clothes, diarrhea shits, then puts them all back on and carries on like nothing ever happened.",
   "created_utc": 1693335230,
   "score": 61,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9k6et",
   "message": "I missed it by a week, but I started a job in a warehouse whose loading dock was in an alley in a not super great neighborhood in San Francisco. \n\nI was told that the week before I started, two homeless dudes took turns injecting heroin into each others penises in full view of the open loading dock and everyone working inside. \n\nI never saw anything remotely as interesting as that while working there, and a few months later the company moved the warehouse across the Bay to Emeryville.",
   "created_utc": 1693333811,
   "score": 103,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9q287",
   "message": "The person ahead of me in the grocery store line was having their groceries scanned and an item wasn't scanning and then didn't comment “well I guess it's free”",
   "created_utc": 1693335918,
   "score": 109,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9cwji",
   "message": "Die by falling into a pole while drunk..",
   "created_utc": 1693331199,
   "score": 111,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9g5pf",
   "message": "I once saw two homeless men having a knock-down, drag-out drunken fistfight on the Staten Island Ferry in the middle of the night. That was pretty odd.",
   "created_utc": 1693332365,
   "score": 92,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9fkyb",
   "message": "Take shit in front of the post office. I couldn't believe it.",
   "created_utc": 1693332160,
   "score": 33,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9b2v7",
   "message": "Enormous amount of people from India pissing and shitting in the ocean on the beaches at the same time. \n\nNo wiping,  lift- squat and go.",
   "created_utc": 1693330542,
   "score": 115,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9jbrc",
   "message": "Shoot someone in the head",
   "created_utc": 1693333504,
   "score": 84,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9i9u5",
   "message": "[removed]",
   "created_utc": 1693333129,
   "score": 240,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9okis",
   "message": "Saw a homeless guy standing up, pants down, while a homeless woman polished his knob right in front of a restaurant in downtown honolulu. Everyone watched, no one did anything. Had to let him finish, you know?",
   "created_utc": 1693335381,
   "score": 82,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9g5mt",
   "message": "i was at a party with some rumspringa amish teens in florida and i saw a drunk girl getting fingered in the middle of a dance party on the beach late at night",
   "created_utc": 1693332364,
   "score": 104,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9mbqv",
   "message": "In India a man taking an explosive shit in the river. Another man not 2m *downstream* brushing his teeth using the river water.",
   "created_utc": 1693334585,
   "score": 109,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9hm61",
   "message": "I never walk on Market Street in San Francisco unless I am crossing it; but one day I am meeting a colleague just a block down, so I walk down market street. I gear up, sunglasses (I’m not looking at you) ear buds (I can’t hear you) and go. I almost make it when I see this guy leaning against a building with his d!ck out, and it’s massive, doing the slow jerk and making eye contact with people. 🤮",
   "created_utc": 1693332892,
   "score": 115,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9664a",
   "message": "There’s a lot of public donkey beatings in the Middle East. A LOT.",
   "created_utc": 1693328768,
   "score": 72,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy993qi",
   "message": "a BJ in a Mcdonald’s office",
   "created_utc": 1693329828,
   "score": 26,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jya2yyk",
   "message": "After reading some of the other comments, I have lived a tame life and have not seen shit.",
   "created_utc": 1693340483,
   "score": 59,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9j0z2",
   "message": "I once saw two homeless people doing the old sausage hiding dance in a fountain in the town square",
   "created_utc": 1693333399,
   "score": 62,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9o0gr",
   "message": "A few years ago, me and a buddy went to camp at Talladega during race weekend. More than just all the gratuitous nudity, we walked by one camp where the folks were smoking crack. This isn't a small campground either...there was probably 40,000 people in this one camp. Cops everywhere, but as long as you ain't raping or murdering, pretty much anything goes.",
   "created_utc": 1693335183,
   "score": 36,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jya4xmm",
   "message": "England. December, 1999 a few days before Christmas. I was an apprentice in a large industrial bakery. We had teams of temp workers that came in to work around Christmas due to the additional workload. One temp was a woman (late 30s) from Thailand and another was (early 20s) from Spain. For weeks there was tension between them and on the final day the temps were on shift, it exploded. Full blown fight - fists, kicks, hair pulling. It took forever to tear them apart.\n\nSince Spanish girl instigated and was always the more volatile, the boss decided to send her home right then, agreeing to pay her til the end of the day. She left. Thai lady was allowed to stay until days end, having been a solid worker, never missing a shift and even working extra during her temp period. All went quiet and work resumed until....\n\nA couple of hours later Spanish girl returned and attacked Thai lady with a tree branch. And, no, I don't mean a big stick - THE ENTIRE LIMB OF A FUCKING TREE!! Over six feet long, smaller branches and twigs extending from it. To this day I have no idea how it was possible for her to get it (did she find it on the ground? discover it hanging off a tree and snap it the rest of the way?), I still can't explain how the fuck she entered the building with it, came through the foyer, crossed the bakery floor, wasn't seen by ANYBODY - all I know is I looked up at the last moment and watched this batshit Spanish girl charging at Thai lady like some medieval knight trying to batter down the castle door.\n\nIt was carnage. Sticks and twigs flying everywhere, screaming, Spanish girl was literally fucking ROARING! The problem for her, even though her crazy mind thought she had the ultimate weapon, it was so big and cumbersome she couldn't do much with it, couldn't swing it or anything - so it just became a repeat of the earlier struggle to try and pull her away, only now there was a giant mass of wood to wrestle with too. Police were called, Spanish clown was arrested and Thai lady was yelling at me, \"See! I told you, she CRAZY!\" which, to be fair, she had done multiple times over the days before.\n\nEpilogue: About 6 months later outside a McDonald's, I bumped into wacky Spanish woman again. First time I had seen her since that day. She called my name and tried to carry on normal conversation, as if the last time we saw each other she hadn't literally tried to assault somebody with A TREE! I made excuses and got away from her real fast.\n\ntldr: I once saw a crazy lady fight another woman with a tree.",
   "created_utc": 1693341175,
   "score": 94,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9ropc",
   "message": "Seen the aftermath of a motorcyclist vs a light pole guide wire. Two halves of a body laying on the roadway.\n\nI also saw my son take his last breath after birth. He had several medical conditions that were diagnosed during pregnancy, so his prognosis was not good.",
   "created_utc": 1693336501,
   "score": 54,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9bqdl",
   "message": "get arrested for wielding a machete",
   "created_utc": 1693330777,
   "score": 17,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jyad2fn",
   "message": "I've seen worse, but this was the most F'd up. Wife and I were XMas shipping downtown. See a POS car parked at the curb. Junkie looking Mom and Dad, 2 filthy little kids. Wife had the sign asking for money. The Dad sat back watching them like a hawk. \n\nMy wife goes to give them money, I say No, we'll buy you food. Anyone hungry?\n\nThere was a Burger King right there. Kids light up, Dad says NO! We just ate, need gas money. \n\nI lean in, quietly tell him I'm feeding the kids, wife can have some too if she's not scared. But if he tells the kids No, his day gonna get worse. \n\nSo we take the kids inside, let them order everything they want. We watch these kids horrible lives melt away for a minute. \n\nKnowing the junkie parents weren't going to feed them again that day, I suggest lets get \"their parents\" two kids meals to go. \n\nFor their folks, OR if they get hungry later. \n\nKids walk out all happy and innocent, hand the bag of food to the Mom. And the junkie Dad grabs it and empties it on to the street.",
   "created_utc": 1693344066,
   "score": 104,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy99883",
   "message": "Piss on a homeless woman",
   "created_utc": 1693329873,
   "score": 38,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9i9pi",
   "message": "Saw a girl having sex with a stranger, while her two year old was sleeping in the stroller.",
   "created_utc": 1693333127,
   "score": 36,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9kmre",
   "message": "didn’t see people ‘doing it’s but when i was hiking last weekend there was a bloke stood halfway up a mountain.. completely naked.. spinning in circles 🤣",
   "created_utc": 1693333978,
   "score": 30,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9knrv",
   "message": "Saw a man beating up a small dog in our neighborhood park.",
   "created_utc": 1693333988,
   "score": 13,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9lqly",
   "message": "I was driving down Holloway Road in London, it was the middle of the day, and a woman just pulled down her trousers and squirted diarrhoea everywhere then pulled up her trousers and carried on walking 😳",
   "created_utc": 1693334380,
   "score": 12,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9ksk8",
   "message": "Murder someone with a car",
   "created_utc": 1693334037,
   "score": 14,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9h7r8",
   "message": "I think it was more disrespectful than fucked up. My wife and I were in D.C. about seven years ago. We went to the WWII memorial at night. The fountains are a beautiful sight. There are signs saying that you’re allowed to put your feet in the water. But that’s it. Obviously no playing in the water. \n\nWe were eating a late dinner and just generally enjoying the serene and tranquil night. A family thought it would be acceptable to let their two children swim and play football in the fountains. At a monument honoring the 400K fallen soldiers.",
   "created_utc": 1693332750,
   "score": 78,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jyaus7q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jyari30",
   "message": "Fifteen years ago, I was at a gas station off a very busy road in suburban Virginia.  There were 2 lanes of traffic, each way, with a median in the middle.  Cars were going around 60 MPH.\n\nWhile pumping gas, I saw a car on the  other side of the road (i.e., past 4 lanes of traffic) suddenly pull onto the shoulder and slam the brakes.  A middle-aged man comes out.  He runs to the back door, opens it, drags out a child, and starts beating the hell out the child with his fists.  I assume they were having an argument, but this was a fairly extreme assault on his minor child.\n\nI was obviously horrified.  I was locked in place.  People at the station saw this as well and we all started yelling, but we couldn't get there because there was 4 lanes of fast-moving traffic between us.  He was really beating the heck out of this kid.\n\nTHANK GOD, within 30 seconds a police car happened to pass, by total coincidence.  The cops pull over, leaped out of the car, grabbed the guy, slammed him down onto the pavement with full force, cuffed him, stood him up, and slammed him down again against the hood of his car to be like \"WTF\" and question him.  The police definitely roughed that guy far more than necessary, but I think they were emotionally charged given what they just witnessed.\n\nThat moment is still burned into my mind to this day.  Wish I could forget it.  I hope that kid is okay.",
   "created_utc": 1693349649,
   "score": 49,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jyapj7o",
   "message": "Not really a public place, but the most fucked up thing to this day that happened to me:\n\nI was on my way home from a friend and used an alleyway as a shortcut to my bus station. In there, I saw two men dumping two boxes with - get this - puppies and kittens into the trash. I was shocked and started screaming at them, and they fled to their car. I managed to get a photo of the licence, but that wasn’t my biggest worry right now.\n\nI took a look in the dumpster and my heart broke: Five kittens and six puppies were in there, all crying for help and looking at me absolutely helpless. They were all really dirty, malnourished, and some of them hurt, with scratches on them and some even bleeding. \n\nI was really overwhelmed with what I should do, so I googled and called an animal rescue number. They told me that I could bring them over and they would examine them. So, while tears ran down my face, I gently placed them back into the boxes and called an Uber to get me there. The driver was really sweet, telling me stories about how he adopted a stray cat and that he hopes those little animals get a loving family, too. \n\nAt the shelter, they examined the puppies and kittens. The vets estimated that they were all only 4-5 weeks old, barely even able to walk correctly or bark/meow. Also, if you want to adopt a cat/dog, they must be at least 8-12 weeks old, therefore these were extremely young when they got taken away by their mothers.\n\nLuckily, none of them were badly hurt or had any diseases, what made me relax a bit more. The vet asked me if I wanted to keep some of them. Even though I was a huge pet lover and would love my dog to have some friends to play with, I knew how much of a responsibility (and cost) it was to take care of a pet, yet alone this many (and also my mum would have never allowed it). So I had to decline, which broke my heart even more. But I asked the staff to stay in contact with me to watch them grow and get adopted.\n\nAfter nearly two hours I left the shelter, and instantly headed to the nearest police department to report the men. I explained what I have seen and showed them the photo of the licence. At this moment I realised that I should have rather taken photos of the men themselves, considering the car could have been rented, borrowed, fuck, even stolen. \n\nBut I was lucky, and the car belonged to these two men, who seemed to have been charged with illegal animal trading and animal abuse before. The police arrested them around three days later. They each got two years in prison plus 10,000€ fines, which in my opinion is way too little. But as long as they get their punishment, I’m happy. To be honest, I was surprised that my statements and this single photograph was “enough” evidence to get them behind bars, considering I was the only witness and didn’t even know their names. I guess they confessed their crimes, otherwise I couldn’t explain it myself.\n\nSince then, almost a year has passed, and the shelter has sent me photos of a lot of the little kittens and puppies, watching them grow and get healthier and happier. They have all been adopted by lovely people who will treat them right and shower them with unconditional love and treats!",
   "created_utc": 1693348856,
   "score": 36,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9p5xh",
   "message": "I saw a guy on drugs at the bar making a scene, and when the bouncer tried to 86 him, he started grinding and twerking on the bouncer, saying \"gotta back that ass up, gotta back that ass up\" and he was probably a 40 year old white guy",
   "created_utc": 1693335593,
   "score": 31,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9rmw3",
   "message": "I saw a guy kill himself at my old job.\n\nNo it wasn't a shot to the brain or hanging himself \n\nI worked at a pool and we told the guy do not dive in the shallow end multiple times. I went to the office as my replacement for tower took over for me and 2 mins later I hear the whistle and for people to get out I rushed out with the equipment and we tried doing cpr called for an ambulance and unfortunately the dude died in front of me.\n\nNot traumatic but made me a bit more cautious at pools now",
   "created_utc": 1693336483,
   "score": 23,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9slma",
   "message": "I was in Portland just Saturday looking for a missing person. Took us to places you never want to go. \n\n\nAnyways, fentanyl is now often mixed with Xylazine. It gives the users these horrible \"bends,\" and it basically makes them fold in half at the waist. Well, while one of these poor souls is in the throws of it, a predator comes walling by and empties the poor souls pockets of what little he has. \n\n\nPredator has a giant knife handle sticking out of his front knapsack. He has dead eyes, looks us right in the eyes, and moves onto the next poor soul.\n\n\n\nI'm pretty sure that unless you're an armed cop, he was ready to defend his ill-gotten gains.\n\n\nI wanted him un-earthed.",
   "created_utc": 1693336831,
   "score": 21,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jyaa2yd",
   "message": "There's a Sheetz (an unholy amalgamation of a gas station and fast food) in my town that I avoid at all costs because that's where the drug addicts all hang out at night. Sadly, My girlfriend and I were forced to stop there to use the bathroom. Sure enough, I come out of the stall and there's a dude at the sink doing something. Due to the layout of the bathroom, it wasn't until I got next to him to wash my hands that I noticed he was peeling the skin off his face in little chunks in the mirror. He was just standing there, muttering with his face bloodied as he kept going back to peel more skin off. \n\nI just didn't make eye contact and left after finishing washing my hands. Then waited and made sure my girlfriend got out of the bathroom alright and told an employee that there was a dude peeling the skin off his face in the bathroom.... They just kind of looked at me horrified and to be fair, wtf do you even do with that information?",
   "created_utc": 1693342987,
   "score": 21,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jy9mza7",
   "message": "Drove past the aftermath of a domestic dispute on the side of the highway that runs through my town. Two divorced parents were meeting in a parkinglot to exchange their kid and something happened that made the woman just snap. She shoved the guy holding the kid over (kid was okay, guy suffered minor injuries) and then ran across the street and began stabbing herself in the abdomen with a pocket knife. There was so much blood, it was splattered against a coffee drive-thru and all over the asphalt and I could clearly see it in the flashes of the emergency vehicles lights. She passed in the hospital from her wounds. Aside from that we have a local machete guy who walks down the street just swinging at the air and yelling, sometimes he forgets his clothes.",
   "created_utc": 1693334817,
   "score": 35,
   "submission_id": "164nsds"
  },
  {
   "comment_id": "jyb6ylc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "164nsds"
  }
 ]
}