{
 "submission_id": "164par9",
 "title": "What made you realize you were kinky?",
 "selftext": "",
 "created_utc": 1693331565,
 "permalink": "/r/AskReddit/comments/164par9/what_made_you_realize_you_were_kinky/",
 "score": 153,
 "url": "https://www.reddit.com/r/AskReddit/comments/164par9/what_made_you_realize_you_were_kinky/",
 "comments": [
  {
   "comment_id": "jy9ulfg",
   "message": "When a kink was requested. Turns out my main kink is delivering the kinks of others.\n\nWith several bodily function limits in the fine print.",
   "created_utc": 1693337545,
   "score": 59,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya231r",
   "message": "I guess when I was like 19 and me and my bf had nowhere to have sex so we did it off a trail in a park. Now I’m all about voyeurism, exhibitionism, public sex and everything related to it.",
   "created_utc": 1693340175,
   "score": 41,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9eind",
   "message": "I remember when I first felt excited watching movies where the masked slasher chases his victim and grabs her, manhandles her, making her gasp, etc. I didn't understand it until I finally looked up \"mask kink\"",
   "created_utc": 1693331775,
   "score": 54,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9fd6q",
   "message": "Happened one time by accident and I’ve been addicted ever sense lol",
   "created_utc": 1693332082,
   "score": 18,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9sv9z",
   "message": "When the creepy, old, single men at the sex club weren’t creepy anymore as they were watching me get handled by my boyfriend.",
   "created_utc": 1693336925,
   "score": 15,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9vgxb",
   "message": "The water stopped coming out of the hose.",
   "created_utc": 1693337850,
   "score": 24,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya3hil",
   "message": "Watching a lot of femdom porn 🤷‍♂️",
   "created_utc": 1693340665,
   "score": 11,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9wh6h",
   "message": "From a young age I knew I felt this weird, good feeling whenever I imagined characters in tv shows in certain scenarios, or played with my toys recreating those scenarios. It was only when I figured out masturbation was a thing that I connected that feeling to something that could be expressed sexually.",
   "created_utc": 1693338206,
   "score": 8,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9uzpy",
   "message": "When I sexed a girl in high school so good she scratched my back so hard I actually had some cuts.  Felt hella good learned I like a little pain. Funny follow up on that imagine being 15 and you forget about the cuts and you take ur shirt off at a family camping trip... Mom was not happy 🤣",
   "created_utc": 1693337684,
   "score": 20,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9tutd",
   "message": "When I was telling my girl friends from college about my experiences with some of my sexual encounters. They all just stared at me 😮 and couldn’t believe it.",
   "created_utc": 1693337279,
   "score": 7,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9v8za",
   "message": "I clicked on a picture on ph accidentally and I didn’t close the tab for a long time…",
   "created_utc": 1693337773,
   "score": 7,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya7x33",
   "message": "When my 8 grade gf (while I was also in 8 grade you sickos) took off her shoe in class",
   "created_utc": 1693342225,
   "score": 7,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya87wb",
   "message": "I had been with my girlfriend, now my wife for 3 years. About a year ago my wife and I were into a heavy make out session and things were progressing towards the promise land. Out of the blue my wife whispered in my ear, have you ever done it in the butt? Eyebrows raised I looked at her and she had this big smile on her face. Little did I know at the time my petite little wife was leading me into the world of kinky sex. Gosh, I love this woman. 🔥",
   "created_utc": 1693342332,
   "score": 6,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9li37",
   "message": "Rammstein",
   "created_utc": 1693334294,
   "score": 17,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya8jtu",
   "message": "Idk we both choked eachother and then one night we wanted to try knife play so ig from experience",
   "created_utc": 1693342446,
   "score": 5,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9lxrl",
   "message": "[deleted]",
   "created_utc": 1693334450,
   "score": 5,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya2u4k",
   "message": "Playing with fake handcuffs as a kid and being confusingly aroused",
   "created_utc": 1693340438,
   "score": 4,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya6q5k",
   "message": "Ice cubes",
   "created_utc": 1693341803,
   "score": 4,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9idsc",
   "message": "when i saw you",
   "created_utc": 1693333169,
   "score": 6,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9nuxe",
   "message": "I didn’t mind, maybe even liked the toilet paper on my tongue.",
   "created_utc": 1693335128,
   "score": 6,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9ym4i",
   "message": "She asked me to be dominant and I liked it, plain and simple. And no, not just “on top” dominant.",
   "created_utc": 1693338958,
   "score": 3,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya56im",
   "message": "When people are nervous to share with you their fetishes, they finally do. I respond with “oh, that’s it? Okay yeah totally.”",
   "created_utc": 1693341261,
   "score": 3,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya4rtm",
   "message": "My sister's friends were visiting after school one day and going through our old childhood things in boxes. Old toys, photos etc. \n\nOne was in her school uniform (with the tightest black trousers I've ever seen) and another had some of those 1990s two tone silver trousers on and I was obsessed with how good they looked.\n\nOne of the things they found was one of our old toddler and baby reins, the kind toddlers would be put in if they keep running away. They found this hilarious and took turns putting them on and trying to wiggle out or run away, daring each other and so on. I was a year or so older than them, nearly 18. \n\nAnyway they played with the reins, taking turns to be the one stuck and trying to escape. One of them passed the reins to me and said hey X's brother, Natasha is trying to escape, you can babysit her. So she spent five minutes trying to wiggle out, pointing her butt at me, then sat on my lap and said 'okay you win, I need a rest '. \n\nAnywho upon reflection that's probably where I got my kink for shiny clothing and BDSM 🤔😂",
   "created_utc": 1693341118,
   "score": 6,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9w5dg",
   "message": "I’ve always known to some degree just because I was never able to watch typical porn. It’s all fetish shit. But it hit me just *how* kinky I was when I would talk to other kinky people that I assumed had much more experience than me about my sexscapades and they would go “HOLY SHIT DUDE.”",
   "created_utc": 1693338091,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9wd6n",
   "message": "So i had some rope and started testing shit now im in love with tying up my girl",
   "created_utc": 1693338167,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya1cek",
   "message": "When me and my ex first started spitting in and on each other.",
   "created_utc": 1693339913,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya20f5",
   "message": "i don't think it was ever a realization, it just kind always was.  \\*shrug\\*",
   "created_utc": 1693340149,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya22or",
   "message": "I never really thought I was kinky but my boyfriend right now makes me rethink that. I would literally try anything for that man.",
   "created_utc": 1693340171,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya2cwb",
   "message": "Having always the will to explore, and making explore others their kinks.\n\nBtw doing kinky games at parties, asking too much details of people's experiences and liking cucking (in both ways)",
   "created_utc": 1693340270,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya463c",
   "message": "that duck.",
   "created_utc": 1693340903,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya6jfx",
   "message": "For me it all started with a finger,  and the rest is blissful history.",
   "created_utc": 1693341738,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya9gow",
   "message": "Always liked assertive guys (read: not rapey-disrespecting boundaries, not controlling or bossy in any way).  I'll say again: I am not into guys who are abusive or controlling or bossy.  Someone tries to micromanage me in my every day life, it does not work out. I am not bossy, either, I just deeply value my autonomy.  \n\n  \nHad a cute physical therapist years ago. Realized I had a but of a kink for some kinda dominance when I felt myself getting consistently and very quietly turned on, whenever he told me very clearly what to do with my body. Eyes on me the whole time. I found I do enjoy letting a trusted partner take full control over me *just* in the bedroom.   \n  \nAlso realized bondage might be fun when PT tied some resistance bands to me, and the room jumped up 10 degrees.",
   "created_utc": 1693342767,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya9ycc",
   "message": "My first masturbatory fantasies involved getting tied up and choked... I don't know where the ideas came from, but they were kind of constants.",
   "created_utc": 1693342941,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyainn6",
   "message": "I dated a Puerto Rican woman, when he had sex the first time she had a jungle between her legs. I got an instant erection and pounded her all night. To this day I’ve got this thing for hairy coochie.",
   "created_utc": 1693346146,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyajnr4",
   "message": "When I started to taste my cum",
   "created_utc": 1693346536,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyak3wk",
   "message": "When a co-worker (prolly old enough to be my mom) whispered her \"*secret*\" recipe for a totally normal cake and ALL THE HAIRS on my neck stood endwise . Her mature-lady perfume and overall mannerisms... i couldnt move from my desk for a **very solid** half hour.",
   "created_utc": 1693346710,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaob1w",
   "message": "Haha. My ex was super boring. When we broke up I discovered a new side of myself, enjoying life to the max, having s...x in places i would have never used before, etc. So it took me 32 years or so to realize!!",
   "created_utc": 1693348364,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9xnrk",
   "message": "Omg, my first sexual partner told everyone in my high school I squirt. I am so mad at him still to this day.... but....  \nI loved the attention. I made it seem like I was so embarrassed, but man.... I wanted everyone to know. I craved the attention.  \nFast forward to now, I post stuff online free of charge just for the lil dopamine boost. :)",
   "created_utc": 1693338623,
   "score": 3,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9wamj",
   "message": "Started sleeping with someone new and they called me a good girl and my eyes rolled into the back of my head. Started sleeping with people who were more sexually open and became more comfortable in feeling out my boundaries and not feeling 100% safe all the time. Learned a lot and having a lot of fun!",
   "created_utc": 1693338142,
   "score": 4,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9zy16",
   "message": "Escalating instances of me wanting my partner to tell me what to do or what I was not allowed to do in bed, like finish. Denial 😶",
   "created_utc": 1693339422,
   "score": 2,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya8wkn",
   "message": "When I got cheated on \u0026amp; wasn’t bothered except that they’d kept it a secret from me. I’m still with my partner and have definitely talked to them more than once about sharing them with other people. I’m not interested in sleeping with other people unless it’s *with* them but I really enjoy them engaging in sexual activities with other people. \n\nAt least that’s the ‘kinkiest’ thing I can think of now. Definitely enjoy a lot of other things too but that was the big thing for me.",
   "created_utc": 1693342570,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya5scg",
   "message": "Had a girl ride me so good and in the process choke me, man that made me rock hard! Like dominant women!",
   "created_utc": 1693341473,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaa497",
   "message": "I put my hand’s under hot water to feel the sting of taking them out (temperature kink)",
   "created_utc": 1693343000,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyac5yk",
   "message": "Watched a girl receive anal and wanted to know how that felt. Looked up how to start tried my finger and enjoyed it. Just been too timid to take the plung with a guy or female with a dick.",
   "created_utc": 1693343739,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya10wy",
   "message": "I saw a cute guy and thought \"I'd tap that\"",
   "created_utc": 1693339801,
   "score": 0,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9nui3",
   "message": "Taylor swift. I would do absolutely anything sexual that woman tells me to do",
   "created_utc": 1693335124,
   "score": 249,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9xcy6",
   "message": "Having a full mmff",
   "created_utc": 1693338518,
   "score": 0,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyahg13",
   "message": "When she lick my ass and used her fingers 🤌🤌",
   "created_utc": 1693345688,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya3ueh",
   "message": "Hi there kinky ladies 🥴",
   "created_utc": 1693340789,
   "score": 254,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jy9ukzv",
   "message": "I (31m) use a lot of toys with my gf. Regularly. Like at least once every other day we have sex and I use no less than 5 different toys every time just for foreplay and only on her. She gets between 20-30 orgasms every time and the shortest quickie is still at least 45 minutes total of foreplay and penetration. I’m very sexually driven and I have a few kinks: overstimulation, slapping, choking, pulling hair, spitting, being rough, being passionate, kissing, biting, leaving bruises on her thighs chest and shoulders regularly… I’m a lot, and it took me 30 years to find the perfect woman to balance my urges and take it with pleasure and pride. Never be ashamed of who you are. There’s someone for everyone. The best advice I can offer is to never monkey with another monkey’s monkey.",
   "created_utc": 1693337540,
   "score": 248,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya0zcc",
   "message": "[deleted]",
   "created_utc": 1693339786,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya8kpe",
   "message": "Hanging out with kinky and open friends made me realize that I’m more into it than they are, just wasn’t as brave\n\nMask kink, bondage, light exhibitionism, orgasm play, teasing, *kind of* cnc - I like it best when it’s multiple at the same time and there’s nothing I can do about it, like when my boyfriend stuffs my holes with toys, gags and handcuffs me, (I always wear a mask in public anyway) then parades me around while playing with my orgasms and thrusting me very close to being caught",
   "created_utc": 1693342455,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya90ml",
   "message": "Idk having extreme sexual fantasies for years. Also trying to rim my bf in our hot tub last night lol.",
   "created_utc": 1693342610,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya9eec",
   "message": "Rather Who than what. My girlfriend showed me how many things are actually possible in bed (and Basically anywhere else if you dare).\n\nBefore I was essentially vanilla ice cream, but through her I discovered a good bunch of things for myself as well which most definitely has made our private life so much more interesting",
   "created_utc": 1693342744,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya9j85",
   "message": "Just because I started looking at girls' butts while I was out walking.",
   "created_utc": 1693342791,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jya9m24",
   "message": "It is funny I have always known, even when I was really young, I feel like being a Batman fan introduces you to some eye opening things about leather, wipes and vines. Yet my kinks are not specific beyond an enjoyment of new experiences, I feel like once I have tried something I want to try the next thing with someone.",
   "created_utc": 1693342820,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaaijz",
   "message": "I have a paraphilia, and realized I was quite interested in diapers as soon as I was out of them, and in a way that wasn't normal. \n\nWhen my family got the Internet, I learned that it was a thing, and I wasn't alone. \n\nHi r/abdl",
   "created_utc": 1693343141,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaar4i",
   "message": "The first night of meeting my ex (he was much older and I was inexperienced) - he choked me, spanked me, spit on me, made me squirt, came inside of me and then called me a good little cum slut… all in the same night. It was like doing drugs, I was hooked on doing and learning kinkier things.",
   "created_utc": 1693343227,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyab4zp",
   "message": "The part where the videos I like usually are tagged with \"kink\"",
   "created_utc": 1693343367,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyabkjm",
   "message": "My gf and I where fooling around and she bites my neck and I moaned loudly and I haven't moaned like that before that's when I realized",
   "created_utc": 1693343522,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyacad9",
   "message": "Potato chips.",
   "created_utc": 1693343782,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyacy3z",
   "message": "burner acc time! Deviantart. Turns out i have a massive TF kink that i think is from me being considering if i’m trans. I keep wondering if the kink caused the consideration or vice versa.",
   "created_utc": 1693344022,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyad1qo",
   "message": "Dumpster sex.",
   "created_utc": 1693344059,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyad8t3",
   "message": "When they yelled at me for a minor inconvenience",
   "created_utc": 1693344130,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyad99g",
   "message": "Seeing my ex showing her ass every now and then, teasing me around with other people did it a bit for me…",
   "created_utc": 1693344135,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyadqwh",
   "message": "Heard Robert Erwin talk and just knew I had a thing for accents",
   "created_utc": 1693344309,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyadrf1",
   "message": "My Funny Bone",
   "created_utc": 1693344314,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaemcx",
   "message": "When I enjoyed the idea of being tied up, a bit more than normal. The other kinks followed with more experience",
   "created_utc": 1693344623,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaf4eu",
   "message": "Watching James bond 'the world is not enough' as a kid. Getting all turned on by the scene with Elektra and the chair.  I didn't really know that I was turned on, or that I was kinky. But I DID know that I wanted to be James Bond at that moment lol",
   "created_utc": 1693344812,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaf8di",
   "message": "I’m a guy",
   "created_utc": 1693344853,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyafbso",
   "message": "The catalogue of a little company called Eros Comics, division of Fantagraphics.",
   "created_utc": 1693344889,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyafjsa",
   "message": "That one time I went to the chiropractor and they really messed my shit up",
   "created_utc": 1693344974,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyafjyr",
   "message": "I need to explore to find what can make me kinky. Lol",
   "created_utc": 1693344976,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyah44r",
   "message": "My marriage",
   "created_utc": 1693345564,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyah4p9",
   "message": "When I started imagining myself in the fanfiction I was reading",
   "created_utc": 1693345570,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyailtr",
   "message": "When normal vanilla sex did nothing for me",
   "created_utc": 1693346126,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyainv5",
   "message": "My partner introduced me to a pretty big one and then all of my other little kinks just kinda clicked. The intimacy of it all made me just love being kinky in general. Now I’m pretty open to just about anything. A few things in particular hehe",
   "created_utc": 1693346148,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaiyob",
   "message": "When my bf playfully bit me xd",
   "created_utc": 1693346265,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaj43w",
   "message": "When i was 11 i was visiting some friends (similar ages) who decided they're were going to tie me and another boy to chairs with rope. I remember feeling very calm and relaxed while tied to the chair. Years later i was thinking about it and the it clicked 🙃",
   "created_utc": 1693346323,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyajfii",
   "message": "I’m so kinky, I can’t even stand up straight.\n\n(Note: this is even funnier when you understand I’m wheelchair bound.)",
   "created_utc": 1693346446,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyakh8z",
   "message": "The right partner that allowed me to feel safe.",
   "created_utc": 1693346850,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyakof1",
   "message": "It's been there my entire life and I want it to go away",
   "created_utc": 1693346927,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyalqwh",
   "message": "When I told my wife \"I'm getting the impression you'd always like me to take the lead in the bedroom\" and she replied, \"I want you to do what you want with me and not ask permission.\"\n\nIt was like a switch flipped in me.",
   "created_utc": 1693347345,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyamhdg",
   "message": "The fact that I didn't try to remove the gerbil right away.",
   "created_utc": 1693347636,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyamioi",
   "message": "I stopped sleeping with bottoms\n\nThought I was a pillow princess or sex was boring or something was wrong, but then several of my partners started exploring bottoming after we broke up. So I decided to see someone who definitely had top energy and my god what a difference. I didn't know he was dom at first, but after that first night I'm never going back. I blushed so freaking much, in a good way",
   "created_utc": 1693347650,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyamyl8",
   "message": "I somehow came across an age regression video, that particular video wasn’t too good, very very weird. But now I have a mommy kink so…",
   "created_utc": 1693347825,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyanqvz",
   "message": "When I ended up circle jerking with my friends when we were drunk",
   "created_utc": 1693348139,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyao02q",
   "message": "When I was about 16, I discovered by very painful accident that I love being kicked in the balls.",
   "created_utc": 1693348241,
   "score": 1,
   "submission_id": "164par9"
  },
  {
   "comment_id": "jyaoiel",
   "message": "The paramedic laughing while I was being resuscitated",
   "created_utc": 1693348447,
   "score": 1,
   "submission_id": "164par9"
  }
 ]
}