{
 "submission_id": "164q4uh",
 "title": "What was the worst year of your life?",
 "selftext": "",
 "created_utc": 1693333499,
 "permalink": "/r/AskReddit/comments/164q4uh/what_was_the_worst_year_of_your_life/",
 "score": 195,
 "url": "https://www.reddit.com/r/AskReddit/comments/164q4uh/what_was_the_worst_year_of_your_life/",
 "comments": [
  {
   "comment_id": "jy9jgzv",
   "message": "This year by far",
   "created_utc": 1693333556,
   "score": 129,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9jhdi",
   "message": "2019 my ex of 15years left and took my two daughters with her, not seen my girls since",
   "created_utc": 1693333560,
   "score": 31,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9nrt3",
   "message": "2023, no question.",
   "created_utc": 1693335097,
   "score": 20,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9qzk5",
   "message": "August 2022-august 2023 heres hoping things get better",
   "created_utc": 1693336250,
   "score": 20,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9kpe1",
   "message": "2019-2021 worst eating disorder period, self harm, suicidal thoughts as well as doped up on 7 ssris and shit",
   "created_utc": 1693334005,
   "score": 34,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9jktr",
   "message": "So far, 2021. But the day is still young.",
   "created_utc": 1693333594,
   "score": 14,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9la7j",
   "message": "2010. That year can go to hell.",
   "created_utc": 1693334215,
   "score": 11,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9nup7",
   "message": "2014 the year i graduated college and was looking for work and had bad acne and unrelenting pressure from my parents and a poor social life and i worked uber while studying for the CFA that i ended up failing.",
   "created_utc": 1693335126,
   "score": 10,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9m6fs",
   "message": "2020",
   "created_utc": 1693334534,
   "score": 8,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9ken6",
   "message": " 2021 after covid I’ll definitely never forget",
   "created_utc": 1693333895,
   "score": 8,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9mtz8",
   "message": "2014. My business suffered a 4 million dollar loss. Then my fiancee who I was with for 6 years left me for her boss just 3 months before our wedding.",
   "created_utc": 1693334765,
   "score": 7,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9plpa",
   "message": "2011 - Lost my job, girlfriend, friends, had to move back in with my folks where I feel into a deep depression. That went on on until 2014 when I was able to turn the ship around.",
   "created_utc": 1693335751,
   "score": 6,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9kxbd",
   "message": "2019. Last straw at my job, where the management team turned on me, resulting in me putting in my 2 weeks after my complaint against a lying supervisor was dismissed. Had no more income, so I couldn't pay rent, and thus had to move out of the shared house I had with a friend and his fiancée (wasn't on lease, had no obligation to stay, and the fiancée even told me \"you know, you don't have to live here\" during an argument). Said fiancée convinced him to turn on me and drop me as a friend, which resulted in him going off and convincing the only other friend I had to so the same. Covid hit. My cat developed a genetic illness that paralyzed her and my step-father put her down behind my back. My childhood dog developed cancer and was suffering so she was also put down, but I was able to hold her while she passed. Great aunt died of cancer, great uncle (other side of family) died of cancer.  \n\n\nThat was the lowest I've ever been, and I haven't even recovered 20% yet.",
   "created_utc": 1693334085,
   "score": 7,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9ojgd",
   "message": "2021 was the year when my menthal heath was worse than ever. Looking back I'm proud of myself that I just survived.",
   "created_utc": 1693335370,
   "score": 5,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9kscp",
   "message": "2017. Was 14 and severely suicidal. I was just a kid",
   "created_utc": 1693334035,
   "score": 3,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9yyg3",
   "message": "1978",
   "created_utc": 1693339080,
   "score": 3,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9wma1",
   "message": "2016 - 2018 - divorce, job loss, death of my dad, Trump",
   "created_utc": 1693338255,
   "score": 8,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9uzl7",
   "message": "2019-2020\n\nBest friend k\\*lled himself in front of me\n\nI got raped by my uncle and my mother told me not to tell anyone, then I got grounded for telling the police\n\nand oh yeah a pandemic happened",
   "created_utc": 1693337683,
   "score": 5,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9k9yn",
   "message": "2021. This is the year I got a severe mental illness, after which my whole life went downhill.",
   "created_utc": 1693333847,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9kzzh",
   "message": "I count years of my life from birthday to birthday (duh but you get it) so for me is the Aug 2022- Aug 2023 year. Hands down worst one on all levels, truly",
   "created_utc": 1693334113,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9p6hk",
   "message": "Every year seems to beat the previous",
   "created_utc": 1693335598,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9pf4s",
   "message": "2011  \nShe announced the divorce in March, didn't move out until June, and it was divorce in December.",
   "created_utc": 1693335685,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9ql9f",
   "message": "About ‘95-2013, a haze of intoxication. I went through the top forty list month by month, year by year to see if I could recognize music I heard in bars and other scuzzy places to try and build a map of the past.",
   "created_utc": 1693336107,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9rjrf",
   "message": "2017. But 2016 was the best year of my life.",
   "created_utc": 1693336452,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9uyng",
   "message": "2017. I lost my best friend that year.. we met during our first year of university and immediately hit it off and became close.  We were inseparable for 7 years.  I’ve never been the same since then.. I died with him.\n\nI wish I could’ve helped him..  I wish I could just take one last drive and smoke one last cigarette with him ,and tell him how much I love him and how much he means to me..\n\nPlease tell your friends that you love them whenever you get the chance.. you never know when will be the last time you hang out together.",
   "created_utc": 1693337674,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya07k1",
   "message": "1987. i was 13. my dad was killed when he was hit by a car. total accident. i think about the driver sometimes. i hope he forgave himself. took me a long time to get help for my own PTSD.",
   "created_utc": 1693339515,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya1rjo",
   "message": "1989",
   "created_utc": 1693340064,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3qs0",
   "message": "Either \\~1987/88 due to bullying or 2000 due to a horrible relationship.  Probably the relationship was worse.",
   "created_utc": 1693340755,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5luo",
   "message": "2020. Best friend killed himself ten days before my birthday. Honestly it's been shit since. Lost a few more friends to accidents or over doses. Had to get on meds to even bring myself to get out of bed. The grief has pretty much made me forget what has happened in the past three years, shit is all just a blur. Trying my best to keep pushing on. Got a wife and two kids to take care of.",
   "created_utc": 1693341410,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jyanenj",
   "message": "2022 aka \"The Year of Ten thousand Crisis'\". Fuck 2022",
   "created_utc": 1693348002,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9kfne",
   "message": "The one that began in November 2007 to date",
   "created_utc": 1693333905,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9tcjf",
   "message": "Everyday is worse than the day before it. Which means, everyday you see me, that's on the worst day of my life.",
   "created_utc": 1693337098,
   "score": 2,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9uuej",
   "message": "2021 got carpal tunnel and RSI and tendonitis, and still have them to this day. The pain and weakness sucks",
   "created_utc": 1693337632,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9ozbx",
   "message": "Every year gets worse than the one before.",
   "created_utc": 1693335529,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9jf10",
   "message": "It's always the last one",
   "created_utc": 1693333537,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9jsuw",
   "message": "This year by a longshot",
   "created_utc": 1693333675,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9k7m1",
   "message": "**EVERY LAST ONE OF THEM**",
   "created_utc": 1693333824,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9kbh6",
   "message": "The 2020s haven’t been good to me at all",
   "created_utc": 1693333863,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9kso9",
   "message": "The first half of 2019. Absolute low point in my mental health, so much self sabotaging. Never ever want to hit that low again.",
   "created_utc": 1693334039,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9l7qa",
   "message": "Hard to tell with everything going on since 2020. But I would have to say 2017. Graduated a year late, got a job and the job was fucking terrible. One of the managers would always get mad at me about bullshit and it was only me. Found out later she was related to my ex step-dad. But I was also severely depressed and had relapsed w/ self harm. I was so heavily considering suicide I went to the hospital to get admitted. They told me to go home. Only worked bc I was pissed lol I had also had a really really bad falling out with my two best friends that year. All in all really bad. \n\nLike I have a lot of issues now, but since I've worked on myself it's much easier to deal with these things. I also found out I was autistic in 2018, which explained a lot. But yeah it sucked lol",
   "created_utc": 1693334190,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9mihg",
   "message": "The year 2022.  I've posted on bits and pieces but I lost a dear friend in a very bad falling out and at the very end I lost my job, a job I worked at for over 15 years.\n\nI still haven't recovered and it's been rough",
   "created_utc": 1693334652,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9mp0w",
   "message": "so far I have to say this year",
   "created_utc": 1693334717,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9mugr",
   "message": "2017, the year my mom died unexpectedly.",
   "created_utc": 1693334770,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9o7cm",
   "message": "2022 was the worst. Dealt with health issues, lost my grandma.",
   "created_utc": 1693335250,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9otcj",
   "message": "2016 was rough for me. Was forced to move 3 times back to back, lost my best friend to leukemia, room situation was rough so I hardly got proper sleep at all, didnt have much freedom to keep or cook food at home, and the girl I was talking to whom I had feelings for decided to cut me out of her life",
   "created_utc": 1693335470,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9ovjl",
   "message": "2022 was the worst year for me lost both my grandparents and I had shitty grades",
   "created_utc": 1693335492,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9pv22",
   "message": "Either 2005 or 2008.  In 2005 my girl friend had dumped me, all of my friends were doing cool stuff and going away to college or studying abroad or just like, seemed to know exactly what they wanted out of life and my classes were really, really hard.  But it eventually got better and I realized everything was going to be okay (and, spoiler alert, they are)\n\n2008 I was a college graduate in one of the worst economies of the last 50 years and was truly lost as a person.  Thankfully the same friends who I was jealous of previously got me through it and my new girl friend (who I'd been with for about 2 years at that point) was really cool too, so everything ended up working out incredibly well again.\n\nPoint of the story, never give up.  It can get better, but it might take a whole year to happen.",
   "created_utc": 1693335845,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9rege",
   "message": "Probably the gas leak year.",
   "created_utc": 1693336399,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9s99u",
   "message": "2021- 3 miscarriages. I was trying so hard to mask the grief and forced myself to act normal during the day. Even alcohol couldn't dull the pain.",
   "created_utc": 1693336708,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9t0gz",
   "message": "This year, first, my best friend of 4 years cut off all communication, my first irl gf cheated on me, i got used by the next 2, my pc shit itself all year, my dog died, but hey, tmrs my birthday 😁",
   "created_utc": 1693336978,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9tahh",
   "message": "I don't recall the exact year, but I was having problems with a neighbor, I lost my job, and my father died.",
   "created_utc": 1693337077,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9tb22",
   "message": "2022-2023",
   "created_utc": 1693337083,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9togw",
   "message": "Still alive, so probably not seen the worst yet, but so far it's 2019, specifically oct 6th @11:27am, my aunt called to tell me my sister is dead. She took her own life. That day is burned into my memory.",
   "created_utc": 1693337216,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9u2gb",
   "message": "This year easily",
   "created_utc": 1693337355,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9u9v7",
   "message": "2020",
   "created_utc": 1693337428,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9uiip",
   "message": "2021-2022 easily. My uncle, grandfather (paternal) and grandmother (maternal) all passed away within months of each other. Was in a house fire and lost practically everything including my cat who didn’t make it out. And to round everything out, found out my gf of 8 years had been cheating on me for about a year. Definitely been struggling to want to keep going, life fucking sucks atm.",
   "created_utc": 1693337516,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9uu9v",
   "message": "this. by. far.",
   "created_utc": 1693337631,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9uupy",
   "message": "Which one?",
   "created_utc": 1693337636,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9ux3g",
   "message": "2013, Bad motorcycle accident, nearly the whole year in hospital and rehab, had to learn how to walk again step by step.",
   "created_utc": 1693337659,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9v0nt",
   "message": "I would say 2015 which is weird because that's the year I got married :) \n\n2 months later my mom died of cancer. 2015 still *wins*.",
   "created_utc": 1693337694,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9veko",
   "message": "I feel like every year after I graduated college back in 2020 has gotten progressively worse:\n\n2020 - All the COVID-related stuff adversely affected my mental health. Some family members nearly passed away because of it. I lost one of my best friends, who chose to replace me with a guy she barely knew for two weeks, which destroyed my confidence. I failed the most crucial graduate school exam of my life. Instead of actively working toward my professional goals, I decided to pick up online gaming to kill time.\n\n2021 - I lost the grandparent I was closest to within the first three weeks of this year. I tried reaching out to some friends from college, but most of them had moved on with their lives and were not sympathetic to pursuing friendship or camaraderie anymore. I temporarily stopped online gaming to focus on completing a Master's degree but still made no progress toward my professional goals.\n\n2022 - I lost contact with the remainder of my friends. I decided to take up a part-time job to gain experience but got fired due to layoffs at the end of the year. At least I finished my Master's degree.\n\n2023 - I was relentlessly doxxed by a group of malicious degenerates from the online gaming platform I used in 2020-2021. They harassed my family and made me feel horrible. I tried to prepare for the graduate exam I failed three years ago but could not make any meaningful progress. The remainder of my grandparents passed away over the summer. I am currently spending the latter part of the year reflecting on what went wrong and ensuring I complete my professional goals before the end of next year - and that starts with acing the exam I failed three years ago.",
   "created_utc": 1693337829,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9vopj",
   "message": "Take your pick post 2018",
   "created_utc": 1693337927,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9whqe",
   "message": "2001 My boss, my friends, and my spouse were gas lighting me about stupid stuff.",
   "created_utc": 1693338211,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9wost",
   "message": "This year. I had a surgery that ruined my face and my confidence, lost my girlfriend two weeks later, my job is only getting more and more stressful and chaotic. Mental health is the worst it’s ever been. Don’t want to wake up, don’t want to go out, don’t even really feel alive honestly.",
   "created_utc": 1693338281,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9wrpo",
   "message": "2021, 1997, 2004, in that order. Step-Mom died suddenly, my brain tumor fiasco, I was 16/17(bad time for getting to know my bio-mom).",
   "created_utc": 1693338309,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9wtum",
   "message": "2021",
   "created_utc": 1693338331,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9wxom",
   "message": "2019 the year my dad died.\nSeptember's are still hard to get through.",
   "created_utc": 1693338369,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9wxqh",
   "message": "2013 - Unemployment, depression, friendships blowing up, failing out of a class. It was rough.",
   "created_utc": 1693338369,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9x47k",
   "message": "2010 feb to 2011 mar.... I lost 3 relatives and my dog during that time. But i I also got married in that time period and my wife got pregnant. So it was bit of an emotional roller-coaster.",
   "created_utc": 1693338432,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9x8xr",
   "message": "2016 hands down. Damn near ended my own life a few times. I feel like in your early 20s, nothing goes according to plan, and you feel as if you're supposed to have life all figured out.",
   "created_utc": 1693338479,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9xlo0",
   "message": "2011. Had an affair, tried to leave my family, stayed but regretted it, retired from the military, horrible depression, suicide attempt, a week in the psych ward.",
   "created_utc": 1693338603,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9xnxy",
   "message": "This year. My mom dies in June.",
   "created_utc": 1693338625,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9xthb",
   "message": "This year wasted trying to get over losing best friend waiting for him to realize I cared about him everything we did together all the fun memories and cool thing we found doesnot matter he doesnot miss my friendship at all I actually thought I made him feel good sometimes",
   "created_utc": 1693338678,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9xumt",
   "message": "This year and specifically the last six months, my really good friend died of an overdose and my father who was the most loving and accepting man died from a routine procedure at the doctor. I have never experienced such loss in such a short time span. My heart is broken and I would do anything to get them back but I can’t.",
   "created_utc": 1693338689,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9xvgw",
   "message": "2020",
   "created_utc": 1693338697,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9xwmd",
   "message": "2020-2021. I was the most depressed I'd ever been and gained like 70lbs. Strained relationship with my family. Dumped for the first time. Colleague tried to get me fired after rejecting her advances.",
   "created_utc": 1693338708,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9xzql",
   "message": "October 2022 through now and counting",
   "created_utc": 1693338739,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9y3sq",
   "message": "i can’t even remember the year bc so much of my memory is gone but moving out of my parents house at 18, making $500 per paycheck and trying to learn how to manage money, keep my car and myself alive, while battling the worst depression and suicidal ideation i’ve ever had\n\nEdit: 2019, so also right before everything went to shit lmao",
   "created_utc": 1693338778,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9yc1t",
   "message": "My first year out of college. My first professional job was the worst I've ever had. The people there were just awful, to the point I can't fathom how a business could ever function with that level of terrible people. I had to live in a town that shut down for the winter and smelled like a fart because of a sulfur mine. Got fleeced by a used car dealer. Gained a lot of weight. It was just a shitty start to my adult life.",
   "created_utc": 1693338858,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9yelj",
   "message": "2020s going to compete for that",
   "created_utc": 1693338884,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9ykw3",
   "message": "2023",
   "created_utc": 1693338946,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9youx",
   "message": "2018 \u0026amp; 2023",
   "created_utc": 1693338985,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9yyfg",
   "message": "2022",
   "created_utc": 1693339080,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9z2il",
   "message": "2019... I suffered with a lot anxiety and depression due the stress associated with university. I ended up to fail the classes I needed to complete my bachelor's. By the end of the year I was able to finish. I recovered throughout the COVID years and was able to do my master's degree and I'm about to start my doctorate's... So, if you are struggling, focus on your small battles and love yourself. There's always a light at the end of the tunnel...",
   "created_utc": 1693339120,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9z6b9",
   "message": "1996 by far.",
   "created_utc": 1693339158,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9zj5b",
   "message": "Probably 2022. Cousin OD’d in ‘21 two weeks before I got my first real job. Was so focused on work the rest of that year that I didn’t fall into a depression from grief until early 2022 when I finally left that toxic job. Found another equally exploitative job a month later. Took my savings ($20,000) and invested it. Lost most of it. Just a real shitty time man.",
   "created_utc": 1693339278,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jy9zlod",
   "message": "2023, damn",
   "created_utc": 1693339302,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya03vk",
   "message": "1987",
   "created_utc": 1693339479,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya05d5",
   "message": "2022 to 2023 has been my worse so far.",
   "created_utc": 1693339494,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya0ao3",
   "message": "2004, I was 18 and got hooked on cocaine, lost a sweet girl, family trust, money and a good job. Recovered quickly enough and learnt some solid lessons, but that year was a rough one. All my fault too.",
   "created_utc": 1693339546,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya0cps",
   "message": "2014. Got dumped,  best friend disappeared until a few months later we found out he was in jail. Had developed a serious alcohol problem, was about to lose my apartment . Had to get it together because my mother was concerned as she was seeing everything fall apart for me and her as well. \nGot it together, a few years later the one that dumped me came back and then split again. Causing the downward spiral again but this time I stopped it as soon as it began. \nHowever right now i feel like I'm starting to slip again.  Had a near death experience over the weekend and instead of focusing on what i have, my mind is only on the person who isnt in my life right now. the whole month of august has been trying to saIvage a relationship. Even after the near death experience,  I should have a renewed outlook on life ,but I dont know how to feel about it. I cant go back to those dark days again but I'm not feeling to great right now.",
   "created_utc": 1693339566,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya0ctu",
   "message": "14 to 15 or 2004 and 2005. I was a teenager at the time and was getting bullied ruthlessly at school so I would skip school. Every day I skipped I spent another day in in school suspension which was like solitary confinement so my mental health was shit. No one really seemed to give a single solitary shit about what I was going through at that time on top of that most of my grandparents and some aunts and uncles died. Not a good time and made me a shittier person and a bully in the long run.",
   "created_utc": 1693339567,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya1q76",
   "message": "For me, 2009. I left college into a significant economic downturn. It was also the last time I tried to kill myself—coming off of SSRIs cold turkey will fuck your head in so many seriously bad ways. \n\nBut other bad years include 2001 (falsely accused of a bunch of crimes for which I had alibis by a girl who wanted attention), 1992-1995 (a period of prolonged and intense bullying that led me to self harm), and 2005-2006 (in which I probably should have gone to a mental hospital, because I was losing my grip on reality). \n\nAlso, fuck 2020.",
   "created_utc": 1693340051,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya1t6x",
   "message": "It's probably this one because my father died, this year is the worst by far, worse than 2020.",
   "created_utc": 1693340080,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya25it",
   "message": "2022. \n\nAttempted unaliving myself, wife (who I thought I would spend my whole life with) made the decision to pursue a divorce from me, because of the impending divorce I lost my house, dog, wife, “full-time” status with my kids, and due to my attempted unaliving I was prevented from returning to work until I could get cleared from my doctor, and it took almost a year to do that, so I lost my job in 2022.\n\n2023 is much better than 2022.",
   "created_utc": 1693340198,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya25kv",
   "message": "2019 by far.",
   "created_utc": 1693340199,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya29ld",
   "message": "2020 COVID took a toll on my mental health and college going online was just rough on my mental health and happiness. Also not being able to socialize with friends sucked and further affected my mental health.",
   "created_utc": 1693340238,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya2esf",
   "message": "2020 easily. Aside from covid, lost my job, dad passed from brain cancer, had a hard freeze that blew up my pipes and had to live without running water for 3 months while trying to home school my 2 kids alone. Had to sell a lot of stuff and hit up the food bank a couple of times. Also had a cousin stab me in the back (tried to have me thrown out of my house and have my kids taken away) and she also stole like 10 grand from my dying father.\n\nDoing much better now.",
   "created_utc": 1693340290,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya2fbn",
   "message": "I was in debt\n\nNo job\n\nStarted seeing loan ads on tv\n\nAlmost fell down that rabbit hole but saved myself with strong will power",
   "created_utc": 1693340295,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya2hx7",
   "message": "The year that my father died, Was 12.",
   "created_utc": 1693340320,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya2rda",
   "message": "Every year since 2017.",
   "created_utc": 1693340411,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya2stf",
   "message": "I've had a few but this year has been the worst!\nOther bad years I had my wife by my side through it all.\nShe has told me a few weeks ago that she thinks we should separate.  I'm going to be the most alone I've been since I was a kid.  I'm absolutely terrified!!!",
   "created_utc": 1693340425,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya2vw5",
   "message": "2019 dude...\nI did your mom but getting out was like a maze...she just has such of a great volume of mass you know?",
   "created_utc": 1693340455,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3dtn",
   "message": "2022 started a new job where I was insanely stressed out. Snapped out of it January of this year to the point where it takes much more to stress me out. It was a bittersweet experience",
   "created_utc": 1693340629,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3gsn",
   "message": "2019 - First my brother died, then my dog, then my dad.\n\nOh and then covid hit and my business went to shit.",
   "created_utc": 1693340658,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3nuz",
   "message": "I’m in it!",
   "created_utc": 1693340727,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3poi",
   "message": "The spring of 2022 to current day. My son is ill, my mother died, my dad is a Qhead, also lost two uncles and an aunt.",
   "created_utc": 1693340745,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3r3s",
   "message": "Probably the year I started 10th grade. Our family had just fell apart and everything was in turmoil, I got yelled at a lot, dad was severely mentally ill, and I was bettling depression and anorexia. The year after was just as bad now that I think of it.",
   "created_utc": 1693340758,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3t4j",
   "message": "2015 by far. Yay sudden and traumatic breakup!",
   "created_utc": 1693340777,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3uzh",
   "message": "2011 - 2017.",
   "created_utc": 1693340795,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3wcx",
   "message": "2020-2021 pretty much broke me entirely. I was trapped in a household where I was regularly abused and it felt like the only way to escape was to kill myself. \n\nDishonorable mention goes to 2014 because it took a global pandemic to dethrone that year as worst year of my life so far",
   "created_utc": 1693340808,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3xqq",
   "message": "2012. Spent part of it in a coma and then had to relearn pretty much everything.",
   "created_utc": 1693340822,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3y7d",
   "message": "December until now",
   "created_utc": 1693340826,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya3zsj",
   "message": "So far 2018-2019. I was on the edge of killing myself. Massive anxiety/depression. Wife was abusive (mental/verbal mostly). We were living in a remote area for work. Worst work situation in 20+ years. I was filling the roles of 5 people. I know that now because that is how many people they got after I was gone to do everything I was doing. Highly stressful working with leadership and getting shit on constantly. \nSo I had no support at home or at work. I had stopped drinking as my coping mechanism so everything was overwhelming. If I didn't have kids I'd probably be dead right now. \nAfter getting assigned to work in a new state, therapy, and some meds I ended up okay. \nWife and I worked stuff out and treat each other better now.",
   "created_utc": 1693340841,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya46px",
   "message": "1991-present. Each year is rough for different reasons.",
   "created_utc": 1693340909,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya4eo9",
   "message": "2009. Had a health issue that no doctor took seriously until I ended up in the ER. I got fired at the end of 2008 and the recession was in full swing so I had no money. and thus lost my car. I had a gf. But ahe was incredibly abusive and made shit even worse.\n\nMy mom killed herself that year as well. Dad couldnt handle it. So he left across the US. Had to stay at my gmas so I wasnt homeless.\n\nThings only got sliiightly better when a long time crush of mine actually started checking on me and actively wanted to be around me. And she pushed back against my now ex' BS and gaslighting. But eventually my crush found a guy she liked and immediately dropped me. Basically breaking my heart again.\n\nOh, and it was kind of a shit year for gaming too. Not that I could play what was good as i had no money.\n\nSo yeah. Fuck 2009.",
   "created_utc": 1693340988,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya4g6k",
   "message": "2012, the year my mom died. Second runner up would be 2017, My best friend was murdered and the man who called me his chosen daughter was killed in a robbery, within 6 months of each other.",
   "created_utc": 1693341003,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya4kxz",
   "message": "2020, dad died, lost my job, got sued, almost killed myself, lost my friend, my friends stopped talking to me because covid. \n\nLife goes on it’s getting better.",
   "created_utc": 1693341049,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya4p3g",
   "message": "2010.   Was laid off in the summer of 2009.  I had to take a job I knew I wouldn’t like in order to stay in the city rather than move back with my parents at 27.  Constant job hunting while at a toxic work environment.  Always\nBroke, went to payday loan places a few times to make rent on time.  Lived alone, my best friends just had a kid so really I had no support system at all.   Happy ending though:\n\nNew job in 2011\nMet my wife in 2011.  \nQuadrupled my salary by 2015.\n\nSo hang on there kids if things are tough. The long term is always longer than you think.",
   "created_utc": 1693341090,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya4rcd",
   "message": "2007. Moved for work. Lost my girlfriend, new town was a shit hole. I had to get up early and drive long distances. I fell asleep at the wheel constantly. I said fuck this, I don't want to die this way, so I put in notice. Working last 2 weeks, car gets broken into, all of my tools are stolen. I'm running late for work because I was cleaning up broken glass, and boss is yelling and cursing at me. Boss thinks I'm a criminal and stole my own tools. He was a tool. I get a speeding ticket. I move back home, economy crashes, can't find a job, end up working front desk at a gym and my boss is a crazy crackhead Christian lady who would step on cancer patients to make a buck, but that is a different story. She was a psycho, all hopped up on redbull and diet crap.\n\n\nThings began looking up again after that.",
   "created_utc": 1693341113,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya4u0h",
   "message": "2014. I was ill mentally and physically, my brother died, i ended up more sock after that because i didn't knew how to control my emotions and other small unpleasant thins happened. That year can be erased from my life if you ask me",
   "created_utc": 1693341139,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya50df",
   "message": "2012 - 2013",
   "created_utc": 1693341201,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5a1f",
   "message": "2016 sucked so bad, but it also miss 2016 the most. Girlfriend dumped me in March, I was unemployed and dropped out of school... But that summer was the best.",
   "created_utc": 1693341296,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5a6h",
   "message": "Worst year of your life, so far.",
   "created_utc": 1693341297,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5dmf",
   "message": "2020, year I was arrested and became an addict and foolishly turned away a girl who loved me. It’s all be down hilll since lmao FML",
   "created_utc": 1693341330,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5gpq",
   "message": "1999: colorectal cancer, surgery, chemo, radiation.  You learn who your friends are.  Most of mine were very supportive, as was my work.  I’m 24 years out now, but to was a very tough the last 6 months of ‘99.",
   "created_utc": 1693341360,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5hqf",
   "message": "2020. With 2019 a close second.  \nMy father died at the beginning of 2019 (I was his caregiver) and my husband diagnosed with a rare aggressive cancer in March. So 2019 was a year of chemo and torment, watching my husband waste away and suffer. He died at the beginning of 2020, and immediately thereafter, everything in my house fell apart. I call 2020 “The Year of Broken Things.”",
   "created_utc": 1693341370,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5l50",
   "message": "2007. Dad died before retirement, my best friend's wife died from cancer, father in law died from cancer as well, and my cousin died late summer that year.    \n    \nThe last two years have been coming in close. Just because it's getting increasingly harder to live. Everything just keeps going up and wages don't.",
   "created_utc": 1693341403,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5t5q",
   "message": "2021 and 2022 I don't even separate them because they were pretty similar.\nI was at my lowest mentally, and then came a long lockdown, right after it ended my grandmother got cancer and I spent the whole summer taking care of her even though she was basically a stranger to me. Nice ptsd came along with the experience. I was lonelier than ever. Year ended, next one started, I was trying to actively process what happened. In June I happened to get into a relationship, he promised to give me the best summer of my life, but it just didn't work out between us so instead of enjoying the time, i was maniacally avoiding him and trying to figure out my next move. We ended up breaking up in October. During that time I spoke to not a single person, I was only fighting with my mother, I was completely alone with him and my concerns. \nDid I mention loneliness? It is basically the normal for me, my only friend was a streetcat. He was the only reason why I kept going on.\nOn the 8th of  2022 december I had to put him down because of an incurable illness. He was just suffering.\nI drank so much on new year's eve I don't even remember how I got home",
   "created_utc": 1693341481,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5ucu",
   "message": "2011 and 2013. The years my dad passed away and the year I experienced the worst argument between my mom and her boyfriend I've ever seen/heard",
   "created_utc": 1693341494,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5wgk",
   "message": "I was sexually assaulted via date rape when I was 21. Surviving that was the worst year of my life.",
   "created_utc": 1693341514,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya5xtv",
   "message": "2012. The year started out great. I met and befriended an adult film actress on my birthday and had an active sex life for the first time ever. I was finally off the night shift at my job. I applied for grad school. I was accepted into a program for veterans at the Writer's Guild of America. I had finally arrived.\n\nBut by September it was all over. My relationship with \"Nadia\" had turned toxic and ended in a huge fight. I was rejected from grad school. The WGA program didn't pan out for me. Worst of all, I was fired from my good job. I nearly became homeless and had to go back to working the night shift guarding a gated community in Beverly Hills. By the year's end, I was alone and broke (I would declare bankruptcy early the next year) with no hope for the future.",
   "created_utc": 1693341527,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya61ao",
   "message": "couldn’t tell you because my life has been a train wreck that gets progressively worse then better then a lot worse since i was 15. i’m 23 now.",
   "created_utc": 1693341562,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya61o7",
   "message": "2018-19. My epilepsy quickly developed over a few years, seizures got worse and more often, and I felt unwell and depressed all the time. Lost an unhealthy amount of weight, I could barely eat, barely slept.",
   "created_utc": 1693341566,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya6a9t",
   "message": "Last year and this one, for sure",
   "created_utc": 1693341649,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya6l13",
   "message": "2019-now xd",
   "created_utc": 1693341754,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya71fv",
   "message": "2019",
   "created_utc": 1693341916,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya766u",
   "message": "2020 was amazing for most of the year, then I screwed everything up, so probably then",
   "created_utc": 1693341963,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya7a0d",
   "message": "2022.  A long drawn out process resulting in me getting diagnosed with Stage 4 Cancer when it was all said and done.",
   "created_utc": 1693342000,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya7cvv",
   "message": "2009 in discovered Im a high functioning schizophrenic.",
   "created_utc": 1693342029,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya7fq3",
   "message": "2007 and... this one.",
   "created_utc": 1693342057,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya80yb",
   "message": "End of 2014-early 2016. Gf of 2 years left me and got pregnant by another dude by the end of the year, best friend of 20+ years died of cancer Nov same year, dog died suddenly June 2016.",
   "created_utc": 1693342264,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya828d",
   "message": "1999 - got bullied during all my scholar year and the school did nothing to stop it\n\n2022 - my father died after cancer issues.",
   "created_utc": 1693342276,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya8qzh",
   "message": "2022 and it's not even close. 2022 was Hell.",
   "created_utc": 1693342515,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya8rob",
   "message": "2023",
   "created_utc": 1693342521,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya8rpq",
   "message": "Probably 2016 got taken from my mother by CPS and my uncle and aunt died in a car accident",
   "created_utc": 1693342522,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya8vg9",
   "message": "2000 went to 12 funerals in a year. That suuuuuucked!",
   "created_utc": 1693342559,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya8z2v",
   "message": "2018-2020, everything went to shit, lost my good job, thanks to a very passive aggressive racist coworker who was good friends with the boss, went through depression because of that, credit went to shit, savings went to shit. I sorta lost who I really was. Fast forward now I worked a shitty job last year in 2022 I believe I worked for 7-8 months and saved enough to start my business which is doing good. Credit is good, and I don't really have to worry about being fired lol. I swear what changed me was I saw someone at a target tell me work a shitty job that pay decent, even if I had to work 12hr days 5-6 days a week, keep going to get outta any major debit or at least just fix my credit, build a savings and work for yourself. I did just that and trust me it wasn't easy working a shit job but I did what I had to do.",
   "created_utc": 1693342595,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya99st",
   "message": "This year",
   "created_utc": 1693342699,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9ccr",
   "message": "2015. Severely depressed, I failed nursing school, my now ex was distant emotionally, and I was drinking a lot.. I literally don't remember anything from that year other than what was just mentioned.",
   "created_utc": 1693342724,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9cpr",
   "message": "2004",
   "created_utc": 1693342727,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9e6r",
   "message": "The year I lost my father",
   "created_utc": 1693342742,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9fn8",
   "message": "Can't decide.",
   "created_utc": 1693342757,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9k5a",
   "message": "Since 2019 every years has been worst than the last.",
   "created_utc": 1693342801,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9l1u",
   "message": "2018: \n\nOur 26 year old Daughter OD: The first day after months of inpatient rehab and months of restrictions, she went out scored fentanyl did it and died.  \n\nand\n\nThe worst network outage of my 40+ year career: The entire university, 5000+ users had no internet for a whole day, no classes, no business operation, no credit card machines, no internet at all.",
   "created_utc": 1693342810,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9lg9",
   "message": "Getting hit by a car and having to attend 6th grade in 97 at a brand new school with a broken arm and scarred face was pretty bad.\n\nGetting told to please go kill myself in 99 was also super cool.\n\nGot raped on the same night as my brother almost died in 07, got hit with recession in 08 right after graduating.\n\nGot dumped by my spouse right after graduating grad school and my mom almost died in 2017.\n\nWatched him actually die in 2020.\n\nMoved across the country for the guy I thought I was gonna marry, promptly got dumped.\n\nSo I'm just gonna go with \"all of them\" but some are just slightly less shit than others. Can't wait to see how bad the rest of my life is gonna be!",
   "created_utc": 1693342814,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9ok1",
   "message": "2020. I guess that's a obvious year but it really sucked",
   "created_utc": 1693342844,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9w9q",
   "message": "2013-2015 and the end of 2021 :/",
   "created_utc": 1693342920,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jya9x1k",
   "message": "2019. Investigated for a crime.  Somebody else caught but fuck that sucked. Also found out my son was autistic. The cherry to this shit sundae was finding out my wife of 15 years was having an affair. Fuck that year.",
   "created_utc": 1693342928,
   "score": 1,
   "submission_id": "164q4uh"
  },
  {
   "comment_id": "jyadicb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "164q4uh"
  }
 ]
}