{
 "submission_id": "164wiqj",
 "title": "Hiring managers or Reddit, why don’t you just tell us how much the job pays?",
 "selftext": "",
 "created_utc": 1693347939,
 "permalink": "/r/AskReddit/comments/164wiqj/hiring_managers_or_reddit_why_dont_you_just_tell/",
 "score": 185,
 "url": "https://www.reddit.com/r/AskReddit/comments/164wiqj/hiring_managers_or_reddit_why_dont_you_just_tell/",
 "comments": [
  {
   "comment_id": "jyan8zi",
   "message": "**Attention!** If you plan to give examples of a bad/inappropriate email address on a resume, **do not post an email address - even if it's obviously fake**, rather use something like \"[childish email here]\" or \"@example.com,\" otherwise your comment will not be seen. \n\nWe do not allow any type of personal information, even if it's supposed to be fake. See [Rule 4](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-) for more details, thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1693347940,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybn2i9",
   "message": "In Colorado USA they are now required to put a price range in a job posting. They also have to apply similar titles to jobs that are similar and both employees must be within the same listed range.\n\nSo fuck yeah for us!",
   "created_utc": 1693363020,
   "score": 182,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybpr2a",
   "message": "Washington, California Colorado and NYC all require wage or range to be listed on job postings. Hawaii law takes effect in Jan, probably others that I missed.",
   "created_utc": 1693364258,
   "score": 68,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyc1uqc",
   "message": "They *want* to pay you as little as you'll accept. The rule of haggling is always: \"whoever says a number first, loses.\"",
   "created_utc": 1693370772,
   "score": 42,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycbrws",
   "message": "As my former HR person said, \"I'm literally not allowed to say it until they accept the position.\"\n\nAnd they're so confused as to why they can't hire anyone.",
   "created_utc": 1693377453,
   "score": 23,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybew7d",
   "message": "I usually do tell them right off the bat in the interview if I don’t think it will be insulting to them. I tell them on the call to schedule the interview if I think they are overqualified to filter out people who won’t be interested.  \n\nI personally hate it when you go through a long interview only to find out the pay is garbage so I do what I can to not subject people to that.",
   "created_utc": 1693359417,
   "score": 66,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyanfqh",
   "message": "Because there’s never one price it’s usually a range depending on tbe particular employess experience? \n\nIf they won’t give you a range it’s a fucked company runnn",
   "created_utc": 1693348015,
   "score": 50,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyao4hm",
   "message": "No no no don’t worry about that brother…..just think of how much you’ll make in the future with us!! Plenty of room to grow! You can be a manager in 6 months? Come on brother where family here 😏😏😏",
   "created_utc": 1693348290,
   "score": 40,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyc11wv",
   "message": "We get so many applications at my work because we DO show the rate. I can't tell you how many time someone said they applied to our company vs. The others because of our transparent pay + benefits info listed. \n\nOn that same note, I never have and never will apply for a job without it listed. It's not worth the time.",
   "created_utc": 1693370276,
   "score": 12,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybs6qg",
   "message": "I fucking do. In the job listing.\n\nPay rate. Benefit *details*. Days off. PTO. Flex pay. All of it. It goes like this.\n\n\u0026gt;$22-$25/hour + tips ranging from $2-$10/hour, DOE  \n\u0026gt;  \n\u0026gt;Sick pay accrual of 1 hour per 30 hours worked, capped at 80 hours  \n\u0026gt;  \n\u0026gt;Vacation pay accrual of 1.54 hours per 40 hours worked, 2 weeks per year, capped at 160 hours  \n\u0026gt;  \n\u0026gt;100% employee sponsored health and dental for individuals, $500/$3000, Managed Choice PPO  \n\u0026gt;  \n\u0026gt;Benefits take effect 90 days after employment  \n\u0026gt;  \n\u0026gt;No paid holidays\n\nI've never had trouble hiring. Just be honest with people.",
   "created_utc": 1693365443,
   "score": 36,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyaop42",
   "message": "Because they’re gonna pay different people variable salaries. That’s why it’s a good idea to negotiate.  They should also be willing and able to give you an idea of the salary range when asked",
   "created_utc": 1693348521,
   "score": 14,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyaqabd",
   "message": "I give the range because as others stated it depends on experience. But one thing I’ve noticed people that have great experience generally want to negotiate above the high end of the range and we just aren’t given that option. The range stated is what it is",
   "created_utc": 1693349159,
   "score": 6,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyccw4y",
   "message": "Thankfully in California they're required to post the salary. Saved me lots of time knowing what jobs I didn't want to interview for 👍",
   "created_utc": 1693378287,
   "score": 3,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyaoi2g",
   "message": "So they can get you to name your price. If it's way too high, they know you won't be happy with what they pay. If it's really low they can get away with underpaying you or offer you more and make you really happy to get the job. If it's in their range they can try and get you to the lower end of their range.",
   "created_utc": 1693348443,
   "score": 8,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyb6qml",
   "message": "I always give a value on job postings. Usually what a established employee would make. Something a potential hire will make in 3-5 years. \n\nThen tell you exactly what it will be during the interview based off your experience. \n\nI’m in a trade so I can’t give an exact number until I know what you are capable of.",
   "created_utc": 1693355924,
   "score": 3,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyby611",
   "message": "It's a negotiation tactic in general, but still any manager that values their time won't bother with an obvious disparity in salary to skillset on any given candidate.  We aren't going to get lucky and only have to pay for 2 years experience for someone that has 10.  At best the candidate will spend a couple of months finding another job while you pay him to go looking elsewhere and half ass what he's doing for you.\n\nOur company makes it easier, we ask for salary expectations and it's a tell to us if the candidate knows their worth or not.  I use it as part of the decision making process in selecting who we interview.  So if a 1 year grad wants twice the salary, they aren't getting an initial interview.   If they have some good skills we might call them and review the salary requires on the first call.   Else it's a waste of time.",
   "created_utc": 1693368599,
   "score": 4,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyc0g40",
   "message": "For IT in Germany: we don’t know. We ask what they want and check the certificates/degrees if it matches we say ok. If it is way below our standards we say ok (and give you a junior title)",
   "created_utc": 1693369913,
   "score": 2,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyc6on2",
   "message": "I give you a full break down of how our pay works while showing you timesheets. My company’s pay can be very confusing. It’s very exhausting to do with every interview but it saves me trouble in the long run. So Eh.",
   "created_utc": 1693373823,
   "score": 2,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycf5bt",
   "message": "well, then you're going to get fucked.",
   "created_utc": 1693379978,
   "score": 2,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycwdqw",
   "message": "So they can potentially pay less to someone who doesn't know any better.",
   "created_utc": 1693393053,
   "score": 2,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycx4b0",
   "message": "This is why I don’t like putting salary in the job description. I’ll talk about it on the first call instead. Because I already have employees that are at the top end and the bottom end of that spectrum and everyone thinks they deserve the top end regardless of on the job performance or cost of living in their region. Bottom line, I don’t want 80 people coming to me to ask for a raise.",
   "created_utc": 1693393513,
   "score": 2,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyarxr6",
   "message": "Just ask in initial screenings - They'll often tell you",
   "created_utc": 1693349827,
   "score": 5,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyc1z6a",
   "message": "We usually work with a recruiter who knows the range. I assume that they’ll match me with people interested in that range. And in my experience they do.. if they send a lot of bad candidates we won’t work with them any more.",
   "created_utc": 1693370845,
   "score": 3,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyc4v03",
   "message": "We do…. In Washington, New York and California.",
   "created_utc": 1693372639,
   "score": 3,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyanot3",
   "message": "Because then you’ll leave because the pay is low. Generally, more professional or skilled jobs are more upfront with the pay if you ask because you can’t just be replaced with the person interviewing after you.",
   "created_utc": 1693348115,
   "score": 5,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybwweo",
   "message": "In big corporate world, the manager knows what it could be, but HR makes the final call with senor management. Hiring manger sometimes doesn't know the exact number.",
   "created_utc": 1693367897,
   "score": 2,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycev05",
   "message": "I don’t say because I don’t know. Salary is negotiated by HR and recruiting. I know the range which is readily available to the applicant. A secret is that there is always wiggle room in the budget if the candidate is highly qualified.",
   "created_utc": 1693379762,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybw53v",
   "message": "We’re trying to get away with paying you as little as possible.",
   "created_utc": 1693367487,
   "score": 0,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybvtn5",
   "message": "HR controls everything",
   "created_utc": 1693367318,
   "score": 0,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyb7590",
   "message": "The range is huge",
   "created_utc": 1693356096,
   "score": 255,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyc02im",
   "message": "I do.",
   "created_utc": 1693369688,
   "score": 0,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycknm6",
   "message": "I usually do tell them right off the bat in the interview if I don’t think it will be insulting to them. I tell them on the call to schedule the interview if I think they are overqualified to filter out people who won’t be interested.\r  \n\r  \nI personally hate it when you go through a long interview only to find out the pay is garbage so I do what I can to not subject people to that.",
   "created_utc": 1693384340,
   "score": 255,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyawxbv",
   "message": "$29 an hour is the highest starting wage, $19 is the lowest starting wage. Dollar raise each year with good review, full benefits, lots of opportunities for promotions and transfers. \n\nAt my level, $35 an hour is the lowest starting wage. The highest starting is $42.",
   "created_utc": 1693351868,
   "score": 245,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jybaw32",
   "message": "I mean I poop burritos do you really want to know what it pays?",
   "created_utc": 1693357678,
   "score": 244,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycf0ne",
   "message": "Historically it comes from the era when white collar jobs didn't have set pay bands. You negotiated what you were worth, and that could be radically different based on your backgrounds. An attorney who attended Yale Law was worth a much higher wage than an attorney who attended a mail-based correspondence school from a random regional college in Wyoming. A doctor who earned that title at Johns Hopkins could fetch two or three times the salary of a doctor who attended a state school, even though they work side by side in the same hospital. The value of white collar employees was often set by evaluating what the applicant brought to the table. \n\nToday, it's largely just inertia. It also avoids arguments when you have to tell people who *aren't* from fancy schools or who *don't* have some special thing or experience, the people who are *not* \"top talent\", that they only qualify for the lower half of your pay band.",
   "created_utc": 1693379881,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycfp1i",
   "message": "In California they required to post the salary range",
   "created_utc": 1693380396,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyci9v1",
   "message": "Leverage in Negotiations: Some companies feel that withholding wage information offers them more negotiating power. Candidates may be willing to take a lower offer than what the employer may have been willing to pay if they are unaware of the compensation range.\n\nFlexibility: Depending on the candidate's experience, abilities, and negotiation, employers may be willing to make certain adjustments to the pay range. They can consider more candidates because the compensation is not disclosed up front.",
   "created_utc": 1693382432,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyckmyr",
   "message": "In Colorado USA they are now required to put a price range in a job posting. They also have to apply similar titles to jobs that are similar and both employees must be within the same listed range.\r  \n\r  \nSo fuck yeah for us!",
   "created_utc": 1693384326,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycq4tr",
   "message": "Because HR has the power.\n\nEvery job has a salary range, and trying to get a new hire paid anywhere above the midpoint is an exercise in futility.\n\nHR also refuses to pay someone above the average salary of people already in that role in the company. Very frustrating when trying to move the average up!\n\nIn short, HR (or Talent Acquisition) at larger corps tie the hands of hiring managers. Not at every company, but enough to make it the norm.",
   "created_utc": 1693388632,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycqhlk",
   "message": "As an independent recruiter I highly recommend my clients to always mention the salary range in an job add. Research said that if you don’t mention it you’ll get 70% less response. \n\nAdd\u0026gt; Im a recruiter in The Netherlands",
   "created_utc": 1693388902,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycsxjq",
   "message": "Because I may or may not know the exact figure for that particular job on that particular day. I know the range, but it can be found by you on our web site.",
   "created_utc": 1693390708,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycuyce",
   "message": "The range doesn’t even make sense too list when there’s a 20 k variance. You are getting the low end every damn time. If you don’t accept low end someone else will",
   "created_utc": 1693392126,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jycz3z5",
   "message": "In a big corporation it’s because I have no idea what HR will offer until they write the offer",
   "created_utc": 1693394694,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd2arw",
   "message": "I’m probably not the first to say it, but it’s in a company’s best interest to pay as little as possible.\n\nI usually tell candidates what the starting pay generally is, but indicate that there’s room to pay more for someone with the right experience.  I stay away from discussing the high end of the range and reserve higher offers for high-potential candidates.",
   "created_utc": 1693396420,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd2rf5",
   "message": "It would never occur to me to apply for a job that didn’t spell it out in the ad",
   "created_utc": 1693396659,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd35ly",
   "message": "I don't know and I don't care. It's not my money. I know the range as much as you because when I wrote the description I saw HR fill that in, what happens on the back end isn't my deal. I am qualified to tell you how competent a person may be and if they can do the job.\n\nI hope you get as much money as you can.",
   "created_utc": 1693396866,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd3glx",
   "message": "HVAC manager here. As in most fields but especially trades, starting pay varies by current skill level. I’m open about starting range but specifics to the interviewee are dependent on the actual interview. If your current skill level is more advanced than a beginner and provable by questions/tests during interview then you will obviously start out higher in the range. \nThe “end game” earnings are the same though and I’m here to grow every tech to maximize their potential income through training and taking care of our customers the right way.",
   "created_utc": 1693397021,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd45mq",
   "message": "I was a hiring manager for 5 years before I left the company.  In many cases, you don't know what the position pays.  I was given a range of values.  If I put a candidate forward for onboarding, a separate group determined the pay rate in an offer letter.  I had little to no say in it.\n\nThis lead to all sorts of issues.  I had offer letters going out with pay rates all over the place.  One of my absolute best employees started at $28/hr.  I pushed to get him a raise to $35/hr and it was denied.  The same day, the onboarding group sent out an offer letter to a zero-experience recent college grad at $42/hr.  I questioned the pay rate and was told \"we're competitive.\"  No, you're a mess, and you're pissing off good employees.",
   "created_utc": 1693397367,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd56bm",
   "message": "When I was responsible for the hiring, it was basically to get the best talent for the lowest price. The higher ups literally told us we were trolling for desperate highly skilled people. When we asked what the interviewees expected for a salary, people who were desperate under evaluated their skill set. Candidates were sorted by expected salary. Ones that appeared desperate were offered the position, for less than it was assigned in the budget.\n\nSo glad I left that place. So much wrong with the culture. I don't need everyone to be friends and hang out after work. But you feel like shit at the end of the day when everything you do is supposed to take advantage of and basically oppress your team.",
   "created_utc": 1693397873,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd5gnd",
   "message": "You should definitely try asking. I did this during my latest job search before ever admitting what I would accept, and to my surprise a decent number of interviewers did reply with the salary range.",
   "created_utc": 1693398013,
   "score": 1,
   "submission_id": "164wiqj"
  },
  {
   "comment_id": "jyd6xgm",
   "message": "Because I don’t know. I work at a large company you have heard of. All offers are created through the compensation team. I can influence the number after it comes back but not by very much, except in exceptional cases. \n\nTypically when I asked I give the candidate a number near the low end of the range to gauge their reaction and see if we’re even in the same ballpark. But the candidates response/reaction has zero impact to their offer.",
   "created_utc": 1693398714,
   "score": 1,
   "submission_id": "164wiqj"
  }
 ]
}