{
 "submission_id": "1651lbs",
 "title": "What things do men do that are sexy that they don't realize are sexy?",
 "selftext": "",
 "created_utc": 1693360721,
 "permalink": "/r/AskReddit/comments/1651lbs/what_things_do_men_do_that_are_sexy_that_they/",
 "score": 204,
 "url": "https://www.reddit.com/r/AskReddit/comments/1651lbs/what_things_do_men_do_that_are_sexy_that_they/",
 "comments": [
  {
   "comment_id": "jybteoz",
   "message": "Carrying as many folding chairs as you can at once",
   "created_utc": 1693366049,
   "score": 186,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybs2lx",
   "message": "Something something rolled up sleeves",
   "created_utc": 1693365384,
   "score": 34,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybymzk",
   "message": "There was a study done in Japan to see what school aged ladies saw as attractive in their male counterparts and “running fast” was like number one or two for elementary and middle schoolers.",
   "created_utc": 1693368863,
   "score": 251,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybtw48",
   "message": "An ex said it was hot watching me change her car's oil",
   "created_utc": 1693366298,
   "score": 223,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybplxh",
   "message": "One time my wife and I were trying to move this big giant recliner type chair up our stairs and we were having trouble and I said “It’s okay, sweetheart, you take a break.” And I just picked the thing up and hauled it up stairs myself…she said ‘wow’",
   "created_utc": 1693364191,
   "score": 254,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybihz5",
   "message": "Getting super excited talking about a nerdy interest they care about. \n\nA lot of guys suppress ‘caring’ about things.\n\nEdit: I totally resonate with all the people sharing about their experiences trying to open up and feeling rejected. It sucks. The nerdy topic isn’t the attractive thing in and of itself-it is the openness and vulnerability. Like you are so comfortable you can be yourself with your niche things you love. Vulnerability is when you’re most open to attack, and it fully makes sense why people have learned to not put themselves out there like that. But, I still love it when it happens.",
   "created_utc": 1693360976,
   "score": 49,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybpq4m",
   "message": "[deleted]",
   "created_utc": 1693364246,
   "score": 79,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybq4cv",
   "message": "Caring for helpless things.",
   "created_utc": 1693364432,
   "score": 223,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybwuze",
   "message": "I find men that show their caring, gentle and soft side very sexy.\nLike being gentle with siblings, friends and animals.\nThey make me feel safe",
   "created_utc": 1693367876,
   "score": 139,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybv3e0",
   "message": "Pausing and thinking before reacting. It’s so hot. A physician I work with always does this and it’s very very attractive",
   "created_utc": 1693366930,
   "score": 70,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc27ug",
   "message": "Treating me like an actual person, having good conversation that isn't just sexual overture and *then* letting me know they're interested in me. \n\nWhen a random child interacts with them and they don't act like it's an annoying bother. \n\nWhen they can have an argument without even a subtle threat of violence. \n\nWhen they're industrious at something. \n\nWhen I can tell their entire self esteem isn't based off getting me into bed.",
   "created_utc": 1693370991,
   "score": 28,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybv8s0",
   "message": "Moaning during sex",
   "created_utc": 1693367011,
   "score": 63,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybhzjw",
   "message": "Being nice to me\n\nEdit: I love how everyone thinks I’m a girl. I’m very much a male lol",
   "created_utc": 1693360753,
   "score": 97,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybzkb0",
   "message": "So there was a colleague I had, I had met him at a party randomly before I started at the workplace but was never attracted to him. Well after I joined, I didn’t know a lot of stuff and got bad anxiety everyday while working. He started talking to me, like we both would be working on our own thing and he would ask me the most random questions like “ If you were an animal, what would you be?” Or my favourite colour and such stuff that people never ask anymore. And that helped because I would have to stop overthinking/obsessing and actually think about what he asked. Always calmed me down. And then if we were walking, he would insist I walk on the inner corner rather than on the side of the road (chivalry) I kid you not he went from a no one to the only one I was interested in! \n\nAlso, he never made me feel dumb if I didn’t know about something, so I could always ask him anything without feeling anxious. \n\nStill the Sexiest Man I’ve Ever Met.",
   "created_utc": 1693369388,
   "score": 16,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybljbu",
   "message": "Being a good dad\n\nEdit: by good dad I don’t mean in the general sense- that’s a given. I mean when I witness special moments and see dads being super involved and sweet with their kids. I’ve seen dads put stickers on their face to match their kid. Ive seen dads who indulge their kids when they want to “race” them 😂 I’ve seen dads wearing tiaras with terribly painted nails and “makeup” lol. I’ve seen dads bring their kid in for a big BIG hug when they’re upset, did a breathing exercise with them and tell them it’s okay and literally wipe their tears 🥹 a dad and daughter were having a tea party at a library. a dad and son came into my store dressed in ninja turtle shirts with the headbands on and everything. the other day at work I overheard this little girl tell her dad he’s her best friend and he told her the same thing and argued about who loves who the most🥹🥹🥹 just super cute stuff like that. I’m a lesbian but it melts my heart to see it and question my sexual identity for a *split* second 😂",
   "created_utc": 1693362324,
   "score": 186,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybw7u1",
   "message": "Being kind to animals",
   "created_utc": 1693367527,
   "score": 185,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybzy25",
   "message": "I love when a guy just… handles something that otherwise could have been pesky or difficult, even if it’s minor. Essentially, taking swift charge without being asked. I’m (f) super independent and even from my personal perspective where I enjoy doing things myself, I think it reads like (a) an act of service and thoughtfulness, (b) a demonstration of capability, and also (c) enthusiasm. That “oh, it’s taken care of” line is just HOT 😍",
   "created_utc": 1693369613,
   "score": 6,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybjbhn",
   "message": "You know when you're out and about and he just casually opens doors for you or walks Street side? That.",
   "created_utc": 1693361335,
   "score": 0,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybublx",
   "message": "I think it’s very sexy to see his hands. I always imagine the things he can do to me with his beautiful hands.",
   "created_utc": 1693366525,
   "score": 118,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc0dk7",
   "message": "My heart does a little flip each time my significant other, ever so slightly puts his hand on my back when we’re walking (to guide me), or if he’s trying to squeeze by behind me.. I don’t know why that gets me fired up lol",
   "created_utc": 1693369871,
   "score": 87,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybxnta",
   "message": "My wife has told me taking my shirt off with one hand is a thing… that kind of blew my mind.",
   "created_utc": 1693368311,
   "score": 93,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybuwsm",
   "message": "Moan during sex.",
   "created_utc": 1693366834,
   "score": 231,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybvda4",
   "message": "The left hand on the wheel \u0026amp; the right hand holding mine while driving.",
   "created_utc": 1693367075,
   "score": 218,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybutlz",
   "message": "My husband twists his beard (its a shorter beard) with his fingers while he reads. He ends up with this little horn sticking out. It's God damn precious! I catch myself staring at him and smiling while he does it.",
   "created_utc": 1693366789,
   "score": 97,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybxs7g",
   "message": "When we were younger and doing renovations in the house, we would always have to stop for a quickie. It must have been a turn-on for my wife, working with me. I know I enjoyed it 😆",
   "created_utc": 1693368379,
   "score": 251,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybvs8u",
   "message": "Please say watch football all Sunday long, please say watch football all Sunday long 🤞",
   "created_utc": 1693367297,
   "score": 228,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc30cc",
   "message": "The number of men posting about the things 'they personally' do that are sexy to women is doubly comical--given the second part of the question implies they don't know it's sexy.",
   "created_utc": 1693371479,
   "score": 21,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybx0jq",
   "message": "I'm 6'4 235 my wife says she thinks it's sexy when i bring in tons of bags from food shopping. I think she says that just so I bring them all in to impress her lol.",
   "created_utc": 1693367959,
   "score": 81,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyblsox",
   "message": "Helicopter penis! \n\nActually this is probably the opposite",
   "created_utc": 1693362441,
   "score": 20,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybtija",
   "message": "I remember hooking up with this one girl and when she saw my pubic area she said \"You shave, that's sexy as hell!\" I never knew that shaving your pubes was such a  turn on for women.",
   "created_utc": 1693366103,
   "score": 159,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybtmjj",
   "message": "Cook dinner for our significant others, clean the house without being asked, opening the car doors for our women",
   "created_utc": 1693366160,
   "score": 231,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc3b5x",
   "message": "So apparently \"men who read books are sexy\" was a lie? I’ve scrolled through all the comments and not one mentions reading.",
   "created_utc": 1693371662,
   "score": 214,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc00wg",
   "message": "I once changed a radiator in my house and that, without doubt, got me more attention and flattery from the women in my life than anything else I've ever done.",
   "created_utc": 1693369661,
   "score": 131,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc0xw8",
   "message": "Filling up my water bottle randomly. Putting air in my tires. Getting my favorite snack from the gas station when he comes over. Running fingers through my hair.",
   "created_utc": 1693370209,
   "score": 0,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybuz72",
   "message": "When they smile",
   "created_utc": 1693366869,
   "score": 171,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybxos3",
   "message": "Lying on the bed, on his belly, naked , showing his round butt and his strong shoulders… dam that’s sexy!",
   "created_utc": 1693368326,
   "score": 92,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybyr70",
   "message": "Capable men doing things with their hands.  Wow.",
   "created_utc": 1693368929,
   "score": 194,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc0xpt",
   "message": "Refuse to ogle women in front of their SO. The respect is noticed immediately.",
   "created_utc": 1693370206,
   "score": 60,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybzvoy",
   "message": "Well. According to my girlfriend.\n\n- When I go full pack mule mode and just grab every bag in one trip.\n\n- Whenever I work on cars. Doesn't matter if it's electrical or mechanical.\n\n- When I work on computers. Either building a new one or doing repairs.\n\n- Whenever I nerd out about anything I love. (Yes. That includes her)\n\n- Whenever I lift her up princess carry style and bring her over to the bed when she's way too tired. \n\n- Whenever I can simply shrug off breaking an arm or basically any damage done to my body. (Sure she gets mad as well that I basically ignore the wounds, so she pathes me up.)\n\n- Whenever I'm at the gym.\n\nLong story boring. I think I found a gem of a woman.",
   "created_utc": 1693369574,
   "score": 117,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybjhcj",
   "message": "When they can suck their own dick and go to town",
   "created_utc": 1693361408,
   "score": 25,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybj8cs",
   "message": "Help with house chores",
   "created_utc": 1693361296,
   "score": 110,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc36gu",
   "message": "It’s so weird to me but-\n\nWhen I work on and fire up my riding mower and then scoot around with my yard work hat backwards and have ear protection on-\n\nMy wife watches me through the window and is very happy to see me take a shower lol\n\nI swear it’s the smell of grass and gasoline and sweat \n\nIt’s like pheromone crack for some people",
   "created_utc": 1693371583,
   "score": 13,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybqw2b",
   "message": "Maybe I’m a freak but unbuttoning and slightly rolling up sleeves of a button down shirt exposing forearms/ wrists is hot. I think it’s sort of like a woman unbuttoning her top button.",
   "created_utc": 1693364801,
   "score": 237,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybygye",
   "message": "While having a casual conversation, they go: “oh, is that so?” or “it’s like that, huh!” in a tease-y manner, with a smile on their face, and I end up with butterflies in my tummy!",
   "created_utc": 1693368768,
   "score": 10,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybil1k",
   "message": "Treat me like a person and not a thing to be won",
   "created_utc": 1693361013,
   "score": 96,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybilld",
   "message": "Not asking questions here that have been asked 1290 times before",
   "created_utc": 1693361020,
   "score": 36,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybwp98",
   "message": "One time my husband and I were in a new European city and hit up a fancy cigar bar. He was wearing a nice suit jacket, and looked great. Then when he went to use the cigar cutter, I had no idea I needed that visual in my life. It was just the essence of man to me.",
   "created_utc": 1693367790,
   "score": 64,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybvana",
   "message": "Had no idea my entire existence oozed sex til I read this thread.... why am I so alone lol",
   "created_utc": 1693367037,
   "score": 246,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybwlwi",
   "message": "Apparently having a sense of direction lol. I've dated a few girls who commented on it, saying their exes would be lost forever without gps. \n\nLike, I drove there one time. I don't understand how hard it is to find your way back from a place you drove to an hour or two ago lol.",
   "created_utc": 1693367739,
   "score": 213,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc19uf",
   "message": "Rocking a well-fitted suit with confidence can really catch a woman’s attention. There’s just something about a guy who knows how to dress sharp.",
   "created_utc": 1693370410,
   "score": 8,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc33my",
   "message": "My boyfriends hair is like almost hockey player long and the way he swoops his hair away from his face makes me tingly in my pants.",
   "created_utc": 1693371535,
   "score": 8,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc3sf2",
   "message": "I heard one million power in rise of kingdoms gets you any girl you want",
   "created_utc": 1693371958,
   "score": 56,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybs8jv",
   "message": "I cook dinner everyday does that count?",
   "created_utc": 1693365468,
   "score": 41,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc4gvg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc71h9",
   "message": "It’s a trap fellas, just live in ignorant bliss. \n\nOnce you realize something is sexy, you will become a self-conscious dork about it and it will no longer be sexy.",
   "created_utc": 1693374060,
   "score": 153,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc1kih",
   "message": "Being booksmart. If I ask my boyfriend a history question and he randomly knows the answer to it or if I ask about a math problem and watching him figure it out is the hottest thing, like yea you divide those numbers baby.",
   "created_utc": 1693370594,
   "score": 157,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc5xi2",
   "message": "One time I needed a lightbulb changed and my boyfriend reached up, unscrewed it, and put in a new bulb and I about wet my pants. He could just…like…reach it with no stretching. And he just solved my problem in like 3 seconds. Also, his shirt lifted up a bit when he did it…swoon",
   "created_utc": 1693373332,
   "score": 43,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc2z19",
   "message": "An ex of mine once got turned on when I told her I put a hand on the wall when I pee.\n\nI’m not sure I fully understand that one.",
   "created_utc": 1693371456,
   "score": 233,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc1fbt",
   "message": "Eye contact",
   "created_utc": 1693370503,
   "score": 93,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc48xi",
   "message": "When he is reversing the car and puts his hand on the back of my seat\nDomt ask me why, i have no idea",
   "created_utc": 1693372244,
   "score": 134,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc2hs7",
   "message": "A girl told me that my \"sleepy voice\" was sexy?? I have no idea if this is just a her thing or!?!?!?!",
   "created_utc": 1693371161,
   "score": 102,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc914q",
   "message": "I was told by my ex that it turned her on whenever there was a problem with her laptop and I would anydesk it and solve it remotely (we were long distance)\n\nYes, I'm Indian.",
   "created_utc": 1693375444,
   "score": 56,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc92jx",
   "message": "It feels like most of these apply to men that you've already broken the friend-level with. Especially the touch-related answers.",
   "created_utc": 1693375473,
   "score": 84,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jyc97l2",
   "message": "My bf and I went to eat at this restaurant before we knew we had feelings for each other. While I would talk he would either laugh or smile and once while doing so he circled the rim of his glass with his finger. I later found out that he did it unconditionally but I short-circuited while he did it.",
   "created_utc": 1693375571,
   "score": 68,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybzqy7",
   "message": "When my boyfriend laughs hard he has this cute laugh!! Seeing him so happy and laughing is sooo sexy to me!",
   "created_utc": 1693369498,
   "score": 86,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jybx79q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jychv82",
   "message": "Forklift Certified....",
   "created_utc": 1693382106,
   "score": 93,
   "submission_id": "1651lbs"
  },
  {
   "comment_id": "jycq9gh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1651lbs"
  }
 ]
}