{
 "submission_id": "16536s6",
 "title": "Those older than 9/11/2001, where were you and what were you doing during the WTC attacks?",
 "selftext": "",
 "created_utc": 1693365055,
 "permalink": "/r/AskReddit/comments/16536s6/those_older_than_9112001_where_were_you_and_what/",
 "score": 81,
 "url": "https://www.reddit.com/r/AskReddit/comments/16536s6/those_older_than_9112001_where_were_you_and_what/",
 "comments": [
  {
   "comment_id": "jybtlf2",
   "message": "Cleaning the berthing on the USS Ross, a guided missile destroyer. We were in our pre-deployment leave period, so we had a full load of missiles and half the crew. A few hours later we were headed out of Norfolk to provide air cover for DC.",
   "created_utc": 1693366144,
   "score": 251,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybth6j",
   "message": "I was in history class in sixth grade watching the tv wondering why my teacher was escorted out by the principal as she cried. She never came back. Her dad was on the 90th floor of the north tower, he left her a message on her voicemail before it went down.",
   "created_utc": 1693366084,
   "score": 213,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybrl6j",
   "message": "I was in school, they had the televisions on in class, I believe we even let out early that day.",
   "created_utc": 1693365145,
   "score": 245,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybux87",
   "message": "At a client's office. One of the secretaries said something about a plane hitting one of the WTC buildings - I thought at the moment that it was an idiot in a Cessna or something similar. After that the day quickly unraveled.",
   "created_utc": 1693366840,
   "score": 200,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybt95m",
   "message": "There. It’s become a day of zero television or radio. Just reflection. Each year a little less of it sticks to the inside of my nose and throat.",
   "created_utc": 1693365973,
   "score": 58,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybt38b",
   "message": "I was working out at the gym. People started watching the TVs. I saw the second plane hit the towers in real time. I thought someone really fucked up at air traffic control and is going to get fired. My mind always believes in incompetence before evil.",
   "created_utc": 1693365889,
   "score": 116,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybsfx0",
   "message": "Watching in freshman science class. Saw both towers fall live. Was convinced my 18 year old brother was going to be drafted to war. Utterly confusing day.",
   "created_utc": 1693365570,
   "score": 44,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybske0",
   "message": "I was in 2nd grade. I didn’t know what was going on, but my mom and Sister were sitting in the car quietly listening to the radio. My mom didn’t put me in school that day (we are in the west coast). It was a loss of words",
   "created_utc": 1693365630,
   "score": 242,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyzac",
   "message": "I was 26 when it happened. I was on the el in Chicago going to work when the first plane hit. Watched the second one hit at the office. My boss said that we should stay at work and keep trying to call our NY clients in the financial district or else the terrorists win. I still think he's not properly credited with originating that phrase. Anyways, I left and went to the bar and soon enough everyone I cared about in the city showed up and we drank all day. It was surreal. I still remember when Bush have his speech, not the one at the WTC, but the official one. Was also at a bar and you could hear a pin drop as everyone listened to him. There were cheers, and this is in boys town in Chicago, a very liberal enclave. Cheers for GW Bush. A moment of actual national unity. And they fucking pissed it away attacking Iraq.",
   "created_utc": 1693369057,
   "score": 110,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybu1op",
   "message": "Stationed at Andrews AFB.  (Close to the Pentagon)  worked the night shift the night before.  Went home, went to sleep and woke up at about 3PM to a lot of messages on my phone.  Looked out front door and could see smoke from the Pentagon.  Went to work and watched AF1 land while being flanked by F-16s.",
   "created_utc": 1693366380,
   "score": 223,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybwg2r",
   "message": "On my way to work and I heard about on the radio.  I got to the office and was shocked by what was going on.  My roommate was in a panic because her brother worked in WTC and she couldn’t find out if he was safe.  Luckily, he got out before the collapse.",
   "created_utc": 1693367652,
   "score": 125,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyf5b",
   "message": "I was eating breakfast when the first plane hit. My family and I thought it was an accident so I went to school. Then we kids all watched thousands of people die on live TV together during class. I think a lot of people had a similar experience.\n\nI will never, ever forget watching two people jump from the burning towers holding hands. So when people make edgelord jokes about it on Reddit when they weren’t even alive on 9/11, it rubs me the wrong way.",
   "created_utc": 1693368741,
   "score": 231,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybz2br",
   "message": "I was a senior in high school. A friend ran up to me in the halls between classes and told me someone was bombing NYC. We ran to our next class, which had the tv on with tower 1 on fire. And then we watched live as the second plane hit. \n\nIt’s still one of the most surreal moments of my life, and I’ve watched both of my kids being born. I remember thinking that as long as the second tower didn’t fall down, too, that things would be okay. Like that’s what mattered. And then when it also fell, it was like you just *knew* something had shifted.",
   "created_utc": 1693369103,
   "score": 13,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybtkmi",
   "message": "I was stationed at nellis AFB.  My boss and I watched the 2nd plane hit.  With eyes glued to the TV, as more of a statement, I just said \"we getting deployed\" he just said \"yup\".  We did get deployed and it was the one time my wife didn't get fussy about me going....",
   "created_utc": 1693366133,
   "score": 28,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybwvbp",
   "message": "I was on my way to work. Overheard a conversation between the bus driver and a passenger, thought they were discussing a TV show from the night before. Got into the city, caught the bus to work. \n\nDidn't see any of the footage until *much* later. On the way home, stopped by the gym and was puzzled that they were closed. My husband told me afterwards that he'd been concerned that I'd gone into work at a large Federal facility in a major coastal city. It hadn't even occurred to me. \n\nI still think that not seeing the video footage that day affected how I processed the event.",
   "created_utc": 1693367881,
   "score": 85,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybwstb",
   "message": "I got called into work on my day off because I was a rookie first responder in northern Virginia.",
   "created_utc": 1693367843,
   "score": 105,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc0ixm",
   "message": "Couldn't tell you the exact time and what i was doing. \n\nBut my Mom walked into school and pulled me out of lunch. Was in the 4th grade.\n\nI remember a long line of cars out side honking and yelling at each other, parents pushing past each other to get into the school.\n\nParents thought WW3 started that day.",
   "created_utc": 1693369960,
   "score": 213,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc3060",
   "message": "I was there. \n\nMy apartment was across the street. When the first plane hit I swear the shockwave shifted my bed away from the wall. That was my alarm that morning. I awoke confused and with that feeling you get from falling in a dream. Unsure what had happened, I turned on the TV but nothing yet. Then I ran to my window and could see the smoke from the building.\n\nI got my clothes on ran downstairs and the door man was standing outside, looking up. I went to him and saw what he was staring at: Smoke. Fire. Papers… raining down. People rushing from the buildings. The fireman (RIP) asking us to leave. I asked what had happened and  my door man wasn’t sure. After that I ran back upstairs to grab my camera. I was a film student at NYU. Once upstairs I called my parents and by now the TV had news about a “possible accident” at the Trade Towers. My parents begged me not to go back out there and film but I didn’t listen. It wasn’t long after I returned downstairs and was filming than the second plane careened in and slammed into the building. I was in shock. \n\nI was still there watching in horror as people threw themselves out of windows to escape the flames. Luckily I left before the buildings collapsed but only by seconds.\n\n I’m still haunted by so much of that day. Honestly every year this is the worst period of time for me. I mostly ignore it as best I can. I never watch TV that week and I don’t talk about it really. My kids ask about it and I can’t discuss it. Writing it here is a huge step for me. I’m not even sure what possessed me to respond to this. I just felt like I had too.",
   "created_utc": 1693371476,
   "score": 225,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybt1br",
   "message": "Home. I called into work that day and was sick on the couch watching it all.",
   "created_utc": 1693365862,
   "score": 52,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybwywq",
   "message": "At work at my desk. A friend swung by and said “did you see a plane hit the WTC?” but I didn’t think too much of it (remembering that a plane hit the Empire State Building during WWII). Eventually I went down to the cafe to grab a snack and watch a bit of the news and saw the 2nd plane. Not good",
   "created_utc": 1693367935,
   "score": 57,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybydan",
   "message": "Was in 10th grade on the other side of the world (night time) sitting in an IRC chatroom with some people, when one of my school friends tells us the WTC got hit by a plane. I couldn't believe it at first and I said he was full of shit. Finally I turned the TV on and there it was. I chatted for a bit more then went to my room and watched everything for the next few hours.\n\nI watched the second tower get hit, and then them both fall, all in real time. I will never forget it. I didn't even go to school the next day as I was so tired and wanted to keep watching tv to see what happened. \n\nI still have the IRC chat logs and generally read over them every September 11.",
   "created_utc": 1693368712,
   "score": 90,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyoor",
   "message": "I was in 8th grade home room. A guidance counselor came in and asked if anyone’s parents worked in NYC as we were in NJ and many people commuted into the city. A couple kids raised their hand and went out into the hallway while the rest of us were told about the attack. Life was never the same after that.",
   "created_utc": 1693368891,
   "score": 108,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyi93",
   "message": "Ft. McCoy, WI. \nEntered Active Duty from Army Reserves on 9/9/01. We were on our morning break from courses and saw the first tower smoking. I grabbed a coffee from the machine, stepped outside for a cancer stick, lit it up, turned around to see the second tower hit through the window. Took two puffs then went back to the classroom. Ended up pulling p.m. guard duty as a student to help take the burden off the permanent party personnel for the 2 weeks I was there. \n\nCompletely different feel on the flight to my permanent station after.",
   "created_utc": 1693368788,
   "score": 75,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybskql",
   "message": "I was in 7th grade but I was home sick at the time. I woke up a few minutes after the first tower was hit. Turned on my bedroom tv so that I could put tv on channel 3 to load up the playstation. I was greeted by the images of the first tower. I had no idea what was going on and thought some great accident had taken place. Decided that my 7th grade mind wasn't too interested in it, no, I needed to load the game. Why? Because the game was Digimon World 2 and the Digital World needed my help.",
   "created_utc": 1693365635,
   "score": 92,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybs5cc",
   "message": "I was in 7th grade science class watching live on the TV.",
   "created_utc": 1693365423,
   "score": 28,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybxooq",
   "message": "I was in my apartment at university. I woke up late to find my roommates watching what I thought to be an action movie. I didn’t pay much attention and they didn’t say anything, so I went to campus to find out it was closed. \n\nI spent the rest of the day nestled between my roommates watching the news in disbelief.",
   "created_utc": 1693368325,
   "score": 46,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybvp14",
   "message": "I was home expecting to watch Transformers Robots in Disguise that morning only to find Fox Kids broadcasting the towers smoking.",
   "created_utc": 1693367249,
   "score": 25,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybz2tw",
   "message": "In college, on my way to a morning class. Standing in line at Manhattan Bagel and someone in line behind me was talking about a plane crashing into the World Trade Center. I am thinking private plane, single engine Cessna. Get to class, only a few people there. Professor never shows up, finally someone tells us class is canceled, go home. Trudge back all the way across campus and walk into my apartment and one of roommates is on the couch, mouth agape with the news on. \n\nWhen I was a kid I found it peculiar how people of a certain age could recount with detail what they were doing when they found out President Kennedy had been assassinated. I understood after that day.",
   "created_utc": 1693369111,
   "score": 6,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybzsz8",
   "message": "I was working at a Michaels crafts store. We watched it all unfold on the TV in the break room.. My parents were supposed to be on the plane that hit the Pentagon but my stepdad had an anxiety attack and they didn't get on the plane.  We sold out of Red white and blue beads, felt, flowers, yarn, paint, ink, material, papers.... everything within 3 days it was all on back order.",
   "created_utc": 1693369531,
   "score": 66,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybxz5d",
   "message": "I was in 5th grade at Langley AFB. I'm pretty sure jets from my base went up there to new York city. I remember my teachers being scared and not knowing what was going on.  I can't remember very well but I think they let the parents explain it when we got home.",
   "created_utc": 1693368488,
   "score": 38,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2sa8",
   "message": "I felt the heat of the second plane and I was covered in dust in battery park when tower 2 collapsed.",
   "created_utc": 1693371342,
   "score": 236,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybzog7",
   "message": "I was working from my home office. Began as a perfectly ordinary day in front of the computer. Got a call from my wife, who said  she heard on the radio, there was a strange plane crash into a building in NYC, maybe she said the twin towers. I thought, some poor fool lost control of his Cessna or whatever. Some time went by and I had an odd feeling of dread about it. I tried to keep on working but ultimately gave in, walked over to the living room TV and put CNN on. That was pretty much it for quite a while. It was one of a handful of times in my life I can say I was truly shocked.\n\nI live minutes from a major airport. For that whole week, the skies were disturbingly quiet. Almost everyone was in a daze, and most people were going out of their way to be unusually kind and understanding to one another. The stock markets closed for a few days also, and took a huge dive when they reopened.\n\nPeople in many other countries around the world were equally horrified. Many cities held silent vigils, stopping everything, all activity for a few minutes at the time of day the planes hit the towers. The outpouring of sympathy and solidarity was remarkable.\n\nI remember public appeals for blood donations, in the first day or two. Yasir Arafat had his picture taken, donating blood. It was expected that there would be thousands of injured, but it turned out, very few survived at all.\n\nThe other thing I remember was, stories emerged of hucksters and con artists taking advantage of the situation. Not many, but it was pretty disappointing.",
   "created_utc": 1693369457,
   "score": 27,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc10h8",
   "message": "Waiting anxiously for my grandma to make it home safely. She worked in the twin towers and we didn’t know if she was going to make it home or not. (She did). \n\nI was almost 5 when it happened. Even so, still a very memorable day given my personal connection to it. \n\nMy grandma used to take me to the north tower (the tower she worked in) very frequently. And even that day, I remember wanting to go to work with her but the only reason she said no was because she was running late and had to file the board book that day. I could’ve been exposed to all that dust and debris at a really young age if it weren’t for her being late and busy. So, glad that it just so happened to be board book day. She would only do that book once a month, and it just so happened to be on 9/11. But that’s like the only thing that saved me from being there on that day.",
   "created_utc": 1693370253,
   "score": 88,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybykpz",
   "message": "7th grade, in school. They pulled us into the home ec room for some reason (maybe it was the only one with a tv?). Watched the 2nd plane hit.",
   "created_utc": 1693368827,
   "score": 12,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyffl",
   "message": "Was confused as to why my morning cartoons weren't on. The TV channel was correct, the time was correct. Just no cartoons.\nWas also wondering why my mum was crying while looking at the TV.\n\nAs the time went on got more and more worried I was going to be getting in trouble for being late to school.",
   "created_utc": 1693368745,
   "score": 34,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybypyg",
   "message": "Boarding a plane. Just before I boarded, I heard a passenger say something to the gate agent about a plane hitting a building in New York. I figured it was a small plane, thought \"that sucks\", and got on the plane. We were confused when the pilot said the FAA said they had to hold at the gate, then 2 minutes later that we all had to deplane. Like really, \"The FAA\"? Then in the gate area on the TVs, we saw the reason.\n\nEveryone was leaving, but me and someone I work with were supposed to be traveling for work. We decided to wait in the concourse, because surely this was temporary. Then we saw the flight crews leaving. We went back to work when we saw that. It was totally crazy. I worked for the Army Reserve. When we got back to the unit they were putting up sandbags, as they had called the highest level of THREATCON, someone looked up what you are supposed to do for that, and basically being prepared to be assaulted by armed assailants was what it meant. It was crazy.",
   "created_utc": 1693368910,
   "score": 52,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyby041",
   "message": "I'm on the West coast of the U.S. One thing that I still remember is I was going to work, and 2001 was before smart phones; people just had regular cell phones, so you didn't see people using them constantly like now. But that morning, I hadn't yet heard what had happened, but was just trying to figure out why everyone for some reason was on their phone - walking down the street, on the bus, everywhere. And looking very serious. It was just really odd and unsettling. It wasn't until I got into my office that I found out what had happened.",
   "created_utc": 1693368503,
   "score": 33,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybsi01",
   "message": "Taking my kids to school, kindergarten and 3rd grade. Dropped them off and then went to the car and listened to the radio. Slowly got concerned then called my dad. He was pissed.",
   "created_utc": 1693365599,
   "score": 12,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybzhvk",
   "message": "Boston Airport Hilton about to give a presentation. They rolled tvs in, we watched. I walked across the street, rented a car and drove home to Los Angeles.",
   "created_utc": 1693369348,
   "score": 38,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1fat",
   "message": "Live in asia. It was 8-9pm when the attacks happened. I was 13.\n\nI was doing homework and studying with my older sister. Dad comes in and says come watch the news,  a life changing event is happening as we speak.\n\nHe was right. Didn't go to sleep till like 1pm.",
   "created_utc": 1693370503,
   "score": 91,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2my2",
   "message": "Chief news photojournalist in a Fox newsroom watching it live from our feed cameras.  Started to call all of our crews in and deciding who to send to Ground Zero.  It was an incredible experience.",
   "created_utc": 1693371250,
   "score": 35,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyece",
   "message": "I was in 6th grade, I got to school and everyone was crying and upset, had no idea what was going on. Then I was told the twin towers were hit by a plane. I was very confused, because I thought they were all talking about these twin towers located in downtown Oakland (a federal building and courthouse building, two identical buildings connected by a sky bridge). I didn’t see any smoke or destroyed buildings on my way to school. We sat in a circle and all talked about it, my teacher was crying, I was still very confused and had no idea what was happening. I finally asked someone and they told me it was the twin towers in New York that were hit. I guess I felt sadness? Really none of this had meaning to me and I had no context to understand what was happening. I was only a 11 and in California so all the way on the other side of the country. Later that year our school had its annual magazine sale, and I do remember being upset that no one would buy magazines from because they all supposedly donated all their money to 9/11 relief funds.",
   "created_utc": 1693368728,
   "score": 17,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybzpho",
   "message": "It was early on the west coast. I was asleep, my sister flung open my bedroom door and said \"They just bombed the World Trade Center.\" She had obviously just turned on the TV, and filled in the blanks. Terrible reporting on her part. Quite literally 30 seconds after I turned on my TV, the second plane hit in real time. It was a very confusing day spent glued to the TV.\n\nSide story: One of my best friends had begun his road trip on 9/10/01. Destination Canada. He had been planning/saving for it for a long while. He was in Washington state about 20 minutes from his initial destination of British Columbia when the border was closed. Not wanting to play the waiting game - he turned right so to speak, and ended up in Pennsylvania. It didn't take long for him to meet a gal(his future wife) and ended up building a life there! He remains in PA 22 years later.",
   "created_utc": 1693369474,
   "score": 41,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2seh",
   "message": "Sleeping in, took the day off and my girlfriend screamed.  She had turned on the tv and was laying next to me and just caught the shot of the second plane going in.  I sat bolt upright and looked around as she grabbed me.\n\nIt was the feeling of pure fear as she gripped me that shook me out of the sleep haze.  She was terrified and I was on the verge of panic thinking something had happened like someone was in the room or there was an earthquake.  Just absolute stomach dropping terror she was in mortal danger.\n\nAnd it stayed like that pretty much for the next week.  I still have occasional night terrors of losing her to something like that apparently…I never remember them but my now wife says I cry as I hold her close thinking I somehow lost her or she had died.",
   "created_utc": 1693371344,
   "score": 18,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc30vd",
   "message": "I was showering before school when I was in 5th grade. My mom came into the bathroom crying and said we needed to talk when I was done. My best friend had just had a botched heart surgery a couple days before that very nearly killed him, and I knew it was touch and go, so my first thought was “J died” and I was panicked. \nI got out, my mom told me what had happened, and me, being a stupid kid, was just excited that J was fine. I recognize the selfishness and naivety of that thought now.",
   "created_utc": 1693371487,
   "score": 52,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc31ss",
   "message": "4th grade, Chicagoland. My mom is a United Flight Attendant. She was flying on 9/10. I remember my teacher leaving the room then coming back and asking if anyone was going to be home alone after school, presumably after the second tower was hit.\n\nOne by one we started getting picked out of class, eventually my name was called. My mom was hysterical. I knew the situation was bad but New York seemed so far away. When we got home we watched the towers collapse live. I’ll never forget the way she screamed at the television.",
   "created_utc": 1693371504,
   "score": 16,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybw158",
   "message": "I was just around 10 to 11 years old. Back in 2001. My father was working in New York City at the time. His office was on the upper east side on 8th avenue and 32nd Street. Not far from Penn station. I was at school. Well going to school. I was living in New Jersey (still living in New Jersey to this day) I still remember the bus  was on the highway. I woke up for a brief few minutes. I looked out the window and I thought for a minute. I heard the news on the radio and the bus driver turned off. Didn't want us to know we got the school. We were on lockdown then they loaded the kids back onto their buses. Rushed us home. I still remember panicking thinking my father was going to die. I was going to be just me and my mom. My mom is panicking trying to get through to my father. She tried everything to get through to him even using her computer to send an email (yeah I know that was a long time ago. The Internet wasn't as good as it is today)  finally, when the event happened I just stood there. Scared. Couldn't believe I just witnessed on the news the attack. I just couldn't take my eyes off the TV. I was scared. Every channel was showing that the event my mom tried to put on cartoons for me to help me calm down. After a few hours my mom finally got through to my dad. He was stuck in his office. Penn station was congested with people evacuating.\n\nWhen my father got home from the city at around 11:00 at night I rushed him crying scared. I didn't want to go to school the next day. I just wanted to be with him. I didn't want to lose my father. I wanted to spend a day or two with him. \n\nThe last thing I remember was September 12th 2001 when I came to school. The kids were laughing thinking it was like a movie thinking the whole event was a fake. It made me angry. I punched one of the kids hard and I mean really hard so hard. I think I almost caused him the blackout yet. Thanks to me, the teachers understood and well forced an emergency assembly to talk about what just happened the day before. Teachers even brought in a police officer to explain what happened. Me being an 11-year-old who just punched the kid in the face. Thought that this was my end. No, the teachers are now understood and well. I was an example",
   "created_utc": 1693367429,
   "score": 51,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybrqxh",
   "message": "At the service department of Keyes Audi getting the fucking thing fixed.  Again.  (Never got fixed.  Piece of shit car.  Piece of shit dealer)",
   "created_utc": 1693365223,
   "score": 20,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc08us",
   "message": "I was a baby, my parents were in the middle of a divorce, they were swapping me that morning. Dad brought me to moms house, he walked in basically 2 seconds after it happened and my mom was like “oh my god sit down look at this” and they sat together watching it for over an hour. Meanwhile I was just chillin without a care in the world",
   "created_utc": 1693369793,
   "score": 13,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1c0d",
   "message": "I awoke to my mother slamming my bedroom door open and screaming, “Get up, we are under attack!” Over and over. \n\nI shot out of bed in much duress and started looking out my window asking, “What, wtf is happening?!”\n\nIt was a real tragedy watching it all happen on TV after the fact, and I’m certainly not trying to downplay the severity of the event, but it was a really rude awakening.",
   "created_utc": 1693370447,
   "score": 18,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1drt",
   "message": "Staring up at the sky like everyone else in lower Manhattan North of Canal St. that day.",
   "created_utc": 1693370476,
   "score": 12,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2kgi",
   "message": "I woke up, got out of the shower and first tower was hit. was in my room changing into clothes to go to school when second tower was hit. I was just a kid. I didn't know what was going on. We wondered if we were supposed to go to school after that. Eventually my mom made us go to school, probably to be alone. Only about 30% of the school showed up. We sat in class playing board games and stuff while the teacher was glued to the tv watching the news.  \n\n\nOh yeah I just remembered. We got prank called by a girl pretending to be in the towers. My oldest sister at the time was in the Air Force and the girl on the phone sounded like her. So my mom was absolutely freaked out. She called my sister and she was in Oklahoma totally fine. My younger sister taught our mom how to do the star 69 thing or whatever, to autodial the previous call. Girls mom answered the phone and she got screamed at by my mom for a good couple minutes.",
   "created_utc": 1693371206,
   "score": 20,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc4hsj",
   "message": "im on the west cost so i was just getting ready for middle school.  my mom asked me to turn the TV on to watch the morning news.  i turned it on, and thought i was watching a movie when they were actually covering the attack.  i turned the channel and found the same thing being covered, and that's when i realized this was real.  my mom and i watched the whole thing after the first tower had been attacked.  we couldn't believe what was happening.  \n\ni remember walking to school that day and i noticed the cars were stopped on the street in the local road, and saw people crying inside their cars.  so surreal.\n\ni'm muslim too, when i went to the mosque that night, there were police parked next to the mosque.  at first i thought it was to scare us, but they were deployed there to actually protect us. a lot of mosques and muslims were attacked that day.  \n\ncrazy day",
   "created_utc": 1693372401,
   "score": 28,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybt1o7",
   "message": "9th grade math class, about an hour and a half north of the city.",
   "created_utc": 1693365867,
   "score": 7,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybvp1d",
   "message": "I was in class in eighth grade. We watched the second plane in real time on the school channel, news one, or something like that.",
   "created_utc": 1693367249,
   "score": 5,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybxysv",
   "message": "I was getting dressed and ready to leave for work. I had the Today Show on and watched the 2nd plane hit live.  Went to work and turned the TV on in my classroom. 5 minutes before the start of the school day, the district cut the cable feed and instructed us to not dwell on it and go about business as usual. I was angry at the time, but it was the right call.",
   "created_utc": 1693368483,
   "score": 4,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1412",
   "message": "5th grade in the suburbs just outside NYC. a lot of kids parents worked downtown, a few passed that day. I remember a classmate crying and asking his mother if there was a war going on outside and she said yes and dragged him out the door as he completely melted down. walking home i could see the insane mushroom cloud of smoke when i looked directly down the train tracks",
   "created_utc": 1693370312,
   "score": 7,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc18i8",
   "message": "I was 19 and just finished basic training and was in Huntsville, AL waiting for my AIT class to start. I thought that I would be pulled out of that class and sent straight to Afghanistan. I was terrified. I ended up staying for the class and doing 5 years in the Army. I was in Iraq twice. Left in 2006.",
   "created_utc": 1693370388,
   "score": 8,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1wxl",
   "message": "I was unemployed, stoned, on my couch in my underwear...",
   "created_utc": 1693370808,
   "score": 7,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1x3g",
   "message": "Being a two month old, chilling",
   "created_utc": 1693370810,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1xxk",
   "message": "I was taking flying lessons and was supposed to do my first solo that day.   I was honestly afraid and unsure of myself flying without an instructor.\n\nI woke up to my cousin/roommate's girlfriend knocking on my bedroom door telling me to turn on my tv.   I didn't fly that day and gave up/ quit flight school.",
   "created_utc": 1693370825,
   "score": 12,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc21qs",
   "message": "I was in band class in 8th grade (or 7th?).  We were warming up and getting settled when one of the other band teachers came in and went straight to our instructor and whispered in his ear.  I could tell something was up.  The then put on the one TV in the room and we all crowded around it.  Watching the first tower smoking and smoldering, but watching the second plane hit was insane.  The next period the school had our class just walking around the track and I think we ended up taking a half day.  I remember one kid kept saying 'they're after our lucky charms' and (we lived in St. Louis) said they were going to hit the arch next.",
   "created_utc": 1693370889,
   "score": 9,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc24tx",
   "message": "I was graduating my A school after boot camp. A small Naval base in San Diego and we were meeting in the classrooms before graduation and someone had a tv on. Watched the second tower get hit and then collapse. After the first tower collapsed, we had a base meeting and everything was locked down. We did eventually have our very brief graduation that day but no one really cared about it. Sailors who were further along in their training were deployed early a few days later.",
   "created_utc": 1693370941,
   "score": 8,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc24xu",
   "message": "I was 1",
   "created_utc": 1693370943,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc26ng",
   "message": "I was in the Marine Corps, temporarily assigned to the 15th Marine Expeditionary Unit, on board the USS Peleliu, docked in Darwin Australia. We immediately left for Afghanistan, where I spent two months.",
   "created_utc": 1693370971,
   "score": 24,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2mip",
   "message": "\n\nI was 3 years old and my mom had jury duty in the courthouse about a block away from the twin towers, so she was taking me to my daycare, which just so happened to be in the twin towers. We were on the train heading downtown and all of a sudden the train just stopped for a while and no one really thought much of it because train delays are just part of the NYC experience. When we finally got to our stop, we came out of the train station to see the building on fire and second plane hit. My mom grabbed me and ran as fast and as far as she could and didn’t stop until she was near midtown. She ended up walking the rest of the way with me all the way back to my grandmother’s apartment in Harlem. I didn’t really know what was going on, but I do remember my mom being scared and my grandmother crying and hugging us for half an hour straight once we made it to her house. My dad was in his car on the Brooklyn Bridge (he was fixing up our house so he had my mom and I stay with my grandma and he was going to meet up with us later on that afternoon) and he saw the planes hit the twin towers and also saw them fall. Every car on the bridge was redirected back into Brooklyn and the phone lines were either down or busy (idk, I’m just recanting what my dad told me) so he couldn’t contact my mom for about 3 days and since he knew we were supposed to be right in the middle of all of the chaos, he thought we had died in the attack. I don’t remember much from that day, but I do remember seeing the plane hit the tower and seeing my mom, grandmother, and my father all cry (my dad a few days later). It’s definitely something I’ve never forgotten",
   "created_utc": 1693371242,
   "score": 70,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2skd",
   "message": "I was working in China. There is a 12 hour time difference so it was 9pm.  I was watching an episode of The Fugitive on the English language station in Hong Kong.  \n\nI was pretty tired when they interrupted it to show the picture of a building.\n\nHonestly I didn't understand what I was seeing, and it being a building in the US I figured everything would be fine.\n\nThe US felt invincible to me back then.\n\nI went to bed before the towers fell.  \n\nThe full reality didn't hit me until the next day",
   "created_utc": 1693371347,
   "score": 18,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc32sl",
   "message": "I was a freshman in a Brooklyn high school. By third period class, tvs were on and playing the news. My seat in that class was by a window that had a clear view into Manhattan right where the twin towers were. It was weird looking over there on that day. Mostly smoke and not much else. The smell was like burning rubber mixed with something else. \n\nIt was all people were talking about on the street. I remember a radio show host saying you could walk into any conversation and it would all be about the same thing. It was eerie. \n\nThere was a newsstand run by a middle eastern guy my Dad went to often by our home. It was closed the day after. Figure he was scared people would turn violent. To my knowledge that didn’t happen though. \n\nMy father was a sanitation worker up in Harlem. They called him down and some of the other crew there to do debris removal. So many of those guys have passed away now from complications from all the debris and whatever else was in the air that day. My Dad’s still kicking; he got lymphoma but it’s completely gone now. Thank god for his city worker insurance.",
   "created_utc": 1693371521,
   "score": 31,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc3hbq",
   "message": "I was a baby so i didnt remember anything",
   "created_utc": 1693371768,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc3kna",
   "message": "2nd grade.\n\nI remember that day very clearly. I remember being in class and our teacher started crying. We knew something was up but weren’t sure. When I got signed out and saw a line of parents snaking around the school I knew something was very wrong and asked my mom if bush died, she said no and told me. We played outside and my neighbor who was older snuck us into his basement and we watched flight 175 replay hitting the tower. I remember thinking I was Kurt Warner playing football at 7 years old lol that day. \n\nI remember my old man coming home and bellowing that the attack came from Saudi Arabia and to get gas. We got Chinese food later that night and my old man told me 10,000 people died that day and how to remember them\n\nThe DC Sniper was way scarier the next year though\n\nI remember getting laid off on 3/14/20 in bed with the now mrs and looking up in the sky as the world ended remembering being 7 and my dad saying I’d never see a night with no planes in the sky. I remember saying I’ve seen that now twice. I’d never thought 9/11 would be eclipsed in my lifetime",
   "created_utc": 1693371826,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc4rxo",
   "message": "Working just outside of DC near Mass Ave, watched NBC news pentagon coorespondent that was broadcasting when it was hit during the broadcast. \nCo-workers Dad who was in a position to know was called in. The narrative that they didn't know if it was a terrorist attack after the first building was hit is hogwash.",
   "created_utc": 1693372583,
   "score": 12,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyeh4",
   "message": "I had just started my second semester of college, still living at home. My dad woke me up as he was getting ready for work, it was like 6am where I live, and said “I don’t think you should go to school today. The World Trade Center? It’s no more.”\n\nHe was a nurse in an assisted living facility so he still had to go to work. I spent the entire day talking with friends online and talking to family on the phone as we all watched the news together.\n\nI found out the next day that my aunt’s husband’s sister died in the Pentagon that day.\n\nEDIT: additional context.",
   "created_utc": 1693368730,
   "score": 5,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybzca3",
   "message": "Used to live in the Bronx. It was my brother's birthday and he didn't want to go to school. He then said he wishes something as would happen so he wont have to go to school. Yea something bad did happen and to this day he still feels guilty.\n\nAs for me I was in HS and a friend of mines wanted to cut school with a group. Decided not to go and he tries to convince me but I refused and he went with some other friends. That was the last time I ever saw him. Based on one of the guys that went with him, they were about 2 blocks from the tower after it was hit. My friend decides to get a closer look and they leave him because it seems dangerous. His mom was devastated when she found out that he was gone and still blames me for the loss.",
   "created_utc": 1693369258,
   "score": 20,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybwff1",
   "message": "Was in France at a cafe. Saw it on TV they had . Everyone was saying how it looked like an American movie plot . How it didn't look or seem real. Took a bit for it to really sink in.",
   "created_utc": 1693367642,
   "score": 6,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybxuf5",
   "message": "I was at school. I didn't realize it was real at first--they brought in a TV and had us watch the news and I honestly thought it was a recording of some history thing or other.\n\nI was young enough that I don't remember much else. Just bits and pieces.",
   "created_utc": 1693368414,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybygq0",
   "message": "Walking between first and second period. Had to cut through the cafeteria and they had the tv on. The tv was NEVER on in there. Got to 2nd period algebra and the whole day changed. No more lessons. Just silence in every class, eyes glued to the tv.",
   "created_utc": 1693368764,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybypil",
   "message": "I was sleeping. Once I got up and was driving into work, I heard the news on the car radio. I’m sure like everyone, I thought of my loved ones and wanted to speak to them/connect with them after I knowing something so horrible had happened. For me, talking to my mom was my #1 priority. I also remember what a beautiful fall day it was (in Ohio where I live). It was similarly beautiful in NYC that day.",
   "created_utc": 1693368903,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyzsj",
   "message": "In school. We lived nearby a major air force base, so they went into a soft lock down. Parents could still come to the school to get their kid, but other than that, no one in and no one out. Which meant recess inside. 1st - 3rd graders. Told the 3rd graders we couldn't go outside because it was too cold. Told the 1st graders they couldn't because there were sharks outside.",
   "created_utc": 1693369064,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybz9k6",
   "message": "I was a junior in high school. Had called in sick (can’t remember if I was faking or not) and my parents made an appointment with the pediatrician. Drove myself to the appointment and as I was sitting in the waiting room they changed the channel from Nickelodeon to news to see the first tower smoking. I remember thinking what a terrible accident that must’ve been…and then watched the second plane collide in real time. \n\nI went into my appointment prior to either tower collapsing, but by the time I got home they had collapsed. I called my dad who worked in the transportation industry, he said he and every other manager had been assigned to guard duty at every vulnerable structure on his company’s system and to not expect him home at night. Ended up taking a nap knowing things would never be the same, but not the extent of how true that was.",
   "created_utc": 1693369215,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybzq5n",
   "message": "I was 5 starting school (kindergarten) who lived in NYC (Queens) and shortly right after the school year started. From what I was told from my dad, me and my brother were picked up then went to our aunt’s house. My dad was a lieutenant in NYPD (1986-2006) and I thought he was nearby but fortunately he wasn’t.🙏",
   "created_utc": 1693369485,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc0brv",
   "message": "I was in algebra class at my middle school in the Midwest. Our teacher had stepped out for a moment. At first I was happy because it meant less time spent on algebra. Then she returned and gave the news that terrorists had struck New York and DC using hijacked planes. We turned on CBS News, the only thing that the crappy classroom TV antenna could get, in time to see the north tower collapse in real time. The south tower was gone already. \n\nAt the time the roof of the school was being tarred. The teacher had the windows open because it was such a beautiful morning, and the hot tar smell wafted in. To this day that odor makes me nauseous. I flash back to being that 13 year old kid watching something terrible that I still don’t fully grasp.",
   "created_utc": 1693369841,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc0gi9",
   "message": "I was a toddler on the floor while my mom was holding my sister watching the news.",
   "created_utc": 1693369920,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc0ium",
   "message": "I was in history class and at the time of the first impact, our lesson of the day was on Afghanistan. Didn’t find out what happened until my next class.",
   "created_utc": 1693369958,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc16d3",
   "message": "On my way to work in tech support for a data protection company. Most companies in the building were customers.  I remember following up on cases we had open to see if the contacts were still alive.",
   "created_utc": 1693370350,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1mb5",
   "message": "Ordering drinks for an Ozzie, S. African and fellow American at the Bull’s Head Pub in Bkk Thailand.",
   "created_utc": 1693370626,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc1rrt",
   "message": "At home in the rainforest in the hill back of lake placid in north queensland was tripping when got a phone call to turn on the TV a crazy experience for sure",
   "created_utc": 1693370719,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2o0a",
   "message": "I was working at a news station.  We did interviews 24/7.",
   "created_utc": 1693371268,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc2uk1",
   "message": "I was at the obgyn finding out the sex of my baby.. it's a girl!!!",
   "created_utc": 1693371381,
   "score": 11,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc3231",
   "message": "I was 4 and lived in the west coast so it was only a little after 6am. I was asleep from what my mom said.",
   "created_utc": 1693371508,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc3iwl",
   "message": "Probably in a crib sleeping, maybe in a toddler bed 😅",
   "created_utc": 1693371796,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc3rgj",
   "message": "Junior kindergarten at 4 years old. We got sent home early. Had to go to the neighbours. Saw it on TV. Didn’t really understand why everyone cared about something so far away (I’m in Canada and already had a pretty negative view of the world lol). People are surprised I have any memory of it usually.",
   "created_utc": 1693371942,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc3wi8",
   "message": "I was lying naked in my bed with my girlfriend and my roommate busted in the door of my bedroom with no clothes on saying \"we're going to war\"\n\nI got rid of bed just soon enough to see the second tower come down. I was 21",
   "created_utc": 1693372029,
   "score": 7,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc7zbb",
   "message": "I was laying on the floor, discovering I had toes. (I was born March of that year)",
   "created_utc": 1693374707,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycamtm",
   "message": "I was the acting vice-president of national public radio online, I had just come into my office a few minutes earlier, and at the time we all had TVs that played CNN to stay current on whatever was happening in the world. \n\nThere’s a saying in news: “nothing ever happens in September“ obviously, that’s bullshit.\n\nOne of my colleagues came into my office and said you should turn on CNN: a small plane, apparently crashed into the world trade center. When I turned it on, it was clear to me. It was not a small plane because a small plane would have just bounced off the building.\n\nNPR had live coverage for the next two weeks. There was so much traffic to the website that we  stopped serving images so that people could get the information we were providing. The Internet came of age that day.",
   "created_utc": 1693376610,
   "score": 16,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycaxux",
   "message": "Was in secondary school ( UK ) came back home after we finished to see the news with the towers on fire. It was the first time I had heard of the WTC.",
   "created_utc": 1693376835,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycb2jg",
   "message": "I was in 3rd grade, only 8, but I can remember every detail of that day. When I arrived to school it was an ordinary day, or so I thought. Then one by one students were being picked up to leave early. No teaching going on. At first, we kept clapping when a kid was picked up thinking “they’re so lucky, they’re going home” but by the 3rd kid, I think we all knew something was up. Eventually it was my turn. Walking down the hall seeing my Mom sobbing. I didn’t know what was going on. That’s when I heard. My Mom couldn’t get ahold of my Dad who was in the carpenters union in NY working only a few blocks away from the Twin Towers. We all sat together as a family that day watching the news, waiting for our Dad to call. Eventually he did, he stayed for a few days in NY helping build stretchers.",
   "created_utc": 1693376932,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycb32k",
   "message": "I was in first grade and I remember my mom coming by and picking me up right after the second tower was hit. The TV was on showing the towers in every room in the school and when I got home my mom had the TV on and all we did for the rest of the day was watch it over and over again. I remember asking why she was crying and trying to make her feel better. People called the house phone so much just to make sure we were safe. All the neighbors came by and no one could talk except in hushed voices. I knew something really serious was happening when my dad came home around 2pm and my mom and him went in the other room to talk. I remember them both coming back into the room and trying to explain to me even as a first grader that dad was going to have to leave for a while and he might not come back. I didn't know at the time but he was a lieutenant Colonel in the Army out of fort Bragg NC, so he already knew he was going to war. I remember being really upset and confused about it and I kept asking if I/we could go with him. Two days later he left for 2.5 years on deployment.",
   "created_utc": 1693376944,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycb33c",
   "message": "I was very young, and I didn’t understand what was happening. My family was on vacation on a military base at the time. \n\nI just remember being very bored and frustrated because the adults wanted to use the TV and wouldn’t let me watch cartoons.\n\nAbout an hour after the attacks, active military came to where we were staying and stated that all non-active duty military had to evacuate the base immediately. The military was preparing to mobilize in case of an invasion or more attacks.",
   "created_utc": 1693376944,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybw1tt",
   "message": "9th grade. Teacher brought out the rolling tv and we all watched in horror. Was sent home soon after.",
   "created_utc": 1693367439,
   "score": 4,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyby68v",
   "message": "Eating cereal and watch tv before school, my dad changed to over to the new about a minute before the second plane. I remember the second plane hitting.",
   "created_utc": 1693368603,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc02nn",
   "message": "I was 15 and getting ready for school. I’d never heard of the twin towers prior to that. My initial takeaway as a dumb kid was that the pilot had really fucked up (then the second plane hit and they talked about terrorism). \n\nSchool was pretty loosey goosey all day, teachers just played the news. Some kids were really freaked out about it and shitty kids made jokes and snark to further provoke them. I rationalized we were safe in our Podunk town and struggled to understand the sadness some of my classmates felt (no one I knew knew anyone directly involved or impacted, so\nI struggled to understand that level of compassion for strangers— my empathy significantly improved when I escaped my family’s ultra conservative Christian belief set).",
   "created_utc": 1693369690,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc19w6",
   "message": "I was 6 months old. Probably sleeping or shitting my pants",
   "created_utc": 1693370411,
   "score": 2,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybtyao",
   "message": "Walking out of my geology class freshman year of college.",
   "created_utc": 1693366330,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc9993",
   "message": "I was 29, at work in a convenience store in Paso Robles, CA.  The radio was on behind the cash register and it was 6:30 in the morning.  People were coming in to get gas and coffee and head out to work.  First reports of a plane hitting the World Trade Center came over the radio and I didn't pay too much attention.  I was really busy.  The report of a second plane hitting the World Trade Center changed everything.  Everyone knew then it wasn't an accident.  I was lost in my work, doing inventory, and I started noticing more and more people coming into the store dressed in desert camouflage--probably National Guardsmen.  This was just a couple of hours after the second plane hit.  \n\n\n\nI went outside for a cigarette with my coworker and I told her it was probably Osama Bin Laden who did it.  She had never heard of him.  I told her he was a terrorist who had tried to take down The World Trade Center a couple of years earlier with a bomb in the basement.  I worked all day that day and didn't get home until 7:00 at night.  My 21-year-old sister was home in our apartment, still in her pajamas, her face white as a ghost.  She said she had been watching TV all day, and had seen the most horrifying things.  I was kind of glad I missed it, although I've seen some terrible images since then.",
   "created_utc": 1693375603,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybrjjg",
   "message": "Watching TV of sofa.",
   "created_utc": 1693365122,
   "score": 1,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybyufs",
   "message": "I was 3 so I guess I was prob pissing myself and then acting like I didn’t",
   "created_utc": 1693368980,
   "score": 255,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc4ddb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc0pws",
   "message": "I was getting a root canal, and the dentist looked up, said, \"Oh my God,\" and walked away. Then all the assistants joined him, so there I was in the seat, holding my own vacuum tube wondering what the hell was going on, so I got up and walked over, the 4 of us just stood there for what felt like maybe an hour before the dentist says \"oh shit\" and realizes he needs to finish the work and takes me back to the chair.",
   "created_utc": 1693370075,
   "score": 24,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycc9po",
   "message": "I was asleep and got a call from my dad that I should turn on the news. I went to my university class later that day and everybody was pretty shocked. The class was called Media Effects and the prof predicted that the world had changed that day. He said we'd be feeling the changes to society for years and likely decades. He was right.",
   "created_utc": 1693377821,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycec3n",
   "message": "Fuck off.\n\nNot to you specifically but for the fact that I've just realised there's a decent number of adults that can say they weren't around for something that happened when I was 17.",
   "created_utc": 1693379364,
   "score": 5,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jybx38z",
   "message": "Watching the news for my current events presentation I happened to be providing to my class that day",
   "created_utc": 1693368000,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc05bj",
   "message": "I was in college in geography class, in Indianapolis. During class, someone’s phone rang and they left the room and answered it. They came back after a minute and sat back down. A little later, at a good stopping point of the class, the student told the teacher, who then announced to the class, that the phone call told him that the World Trade Center had just been bombed. Then we went back to what we were doing in the class. \nSoon, the class ended, and instead of going to math class, I went to the school library which had computers with the internet on them, so I could look up what had happened. I spent the next 1.5 hours there reading about what was happening in shock and disbelief. Then I went home. \nAt home my mom was watching the news coverage and she made me go to the gas station with her car and fill it with gas, even though it wasn’t low on gas. This was a thing at the time, there was some belief that because of this incident, gas was going to either become incredibly expensive or very scarce (or both) and so as people were coming home that day, they were lining up in extremely long lines at the gas stations to fill up with gas just in case. I went to the gas station and listened to the news coverage on the radio as I waited on a line that wrapped around the block waiting for gas that we didn’t need.",
   "created_utc": 1693369734,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycbn4h",
   "message": "I was in north NJ, where I lived, and drove out to the turnpike and saw the smoke billowing. The day is a blur. I saw emergency vehicles from every municipality lined up to take the tunnel into the city, it felt like the entire world responded.\n\nI heard about the tower collapsing on the radio and watched in real time as a huge plume of white smoke seemingly erupted from the city. It was horrible.\n\nI returned home and tried to understand it all, to decompress, but it made no sense. I learned later that day that my friend next door’s dad, an executive at an asbestos removal company, was at a conference on a high (\u0026gt;100th) floor of one of the towers. He was never seen again. Nor was anyone in that office.\n\nThat night I and some friends went to the YMCA because we heard they needed volunteers, for what, we didn’t know. Turns out these were kids whose parents were missing. We had to do everything from feed them to help them brush their teeth to work on their homework. But for the most part, we just tried to navigate the impossible psychological situation ourselves while causing as little damage to the children as possible, and being mindful that they probably couldn’t understand the likelihood that they may never see their parents again.\n\nI couldn’t bring myself to go back the following day, I was just 19, it was too big for me…too tough. I was a smartass know it all kid from NJ and I was brought to my knees trying to answer a kid when he’d be able to go home.\n\nFuck.\n\nEdit - going to keep typing because of the catharsis.\n\nI don’t remember a ton over the next few days other than literal fear every time there was an aircraft, thinking people were making anthrax, wondering if someone was going to unleash a dirty bomb…after a few days, a friend and I went to the city to go downtown and see the reality for ourselves. The WTC site was roped off and you couldn’t get super close, but Canal St was covered in ash. Everywhere you went, there was ash. It was like freshly fallen snow. And it was _desolate_ - the city that never sleeps was empty. It was eerie. And the smoke hung in the air heavy and you could feel the ash coat your teeth like chalk. Everywhere we went, we left the first footprints in the ash with every step we took.\n\nWe made our way uptown and I was standing outside of a pizza joint smoking a cigarette and a fire truck drove by. Every miscreant and thug and scumbag, me included, gave a thumbsup or peace sign or hand salute. We knew what we’d witnessed and we know who the heroes were.\n\nI worked in a bar and it didn’t take too long before people were having it out over philosophical differences of opinion. It was either started by racist comments (unsurprisingly) or by some loudmouth claiming he didn’t give a shit about what happened and who cares blah blah blah, before someone else would shut him up. \n\nI grew fairly right wing at this time. I was a blue collar kid with no real future but suddenly I was patriotic. Soon, I joined the military. I fought in two wars, in some of the worst spots. I was in the airborne infantry, and then I was in a special operations capacity. Revenge was my watchword. It’s a tough thing to reconcile - devoting your life to seeking vengeance against people you’d probably never see. So I didn’t get revenge against the right terrorists, instead I focused my efforts on the right now terrorists.\n\nThe lovely citizens of Adhamiyah, Baghdad, took a good shot and almost snuffed the rooster in the summer of 2007. The troop surge…was interesting. Imagine being in a small unit looking for the “1% of the population which is bad” in a sector that had 1.5 million people. \n\nI spent time in Afghanistan working in an area that might be considered Pakistan, depending on which tribe you asked. I schlepped my gear up terrain that I can only describe as “sharp” looking for people that were never there. I gave my first IV in a combat scenario to a medic…who simply had heat exhaustion.\n\nI called in a medevac for a FID (foreign internal defense) partner just outside an objective while trying to push a needle through his chest to decompress so that he could breathe. As I tried my best to communicate in broken Arabic what the plan was, I ran out to pace out the HLZ for the helicopter to land in, and an ambulance showed up and took the guy away. He lived! We bought him an XBox.\n\nI walked along a gigantic stone wall we erected in Baghdad to separate warring factions (sunnis vs shiites) with my brigade commander, who was shot by a sniper and had the round go through his dick. His PSD (personal security detail) of cooks and clerks had no idea how to react so we pulled him out of the kill zone and brought him back to our team house. It was surreal and strange to see a bunch of 20 year old kids with the high mileage of a 40 year old, sitting around bullshitting about the event and in serious tones talking about how the COL’s urethra was intact and he should regain full function.\n\nOne day we got a tip that a shia warlord gave orders from his safe place in Iran to a truly diabolical scheme of rounding people up in a red crescent vehicle. I think the ruse was something along the lines of “your parents are in the hospital, they’re hurt, we need to take you to see them” - we recovered a vehicle with some kids inside that were dead and had horrific signs of torture. I’ll never forget the sight of a bloody power tool and a lifeless child next to it. True evil.\n\nI remember losing my mind and screaming at the locals on a foot patrol for stepping over a dead body and not doing fucking anything about it. How could they just let a corpse sit there? Someone was murdered and it was business as usual.\n\nOne day we were on a foot patrol and the 1SG (first sergeant), the “father figure” of the unit of young soldiers, took his pistol without warning and blew his brains out.\n\nWe had limited equipment. A vehicle was invaluable. So invaluable, in fact, that after some terrible event had happened, if the vehicle was still FMC (fully mission capable), it had to be ready to roll. My teammates and I were from a different unit on loan to these folks so we told the local command’s leadership that any time a truck came back and needed some kind of post-shit-hit-the-fan PMCS, we’d do it. This made it so 20 year old Private Joe Snuffy didn’t need to hose out the blood and brain matter of his friend and teammate, nor did he have to account for all of his sensitive items by serial number.\n\nI remember one day in Afghanistan our commander decided we needed to “pressure the network” and he sent us out on foolish missions that got men hurt and/or killed. It was foolish from my perspective, but I wasn’t a decision maker. All I know is one day we were supposed to go visit a village in southern Afghanistan after the conventional forces had left and do what I’ll call intelligence collection. The mission was useless and had zero benefit, so you can imagine how dismayed I was when our helo got hung up on some power lines on exfil and the pilots put the nose in the dirt hard, giving me a lifetime of aircraft anxiety (everyone was ok!).\n\nAnyway, I think that’s enough for now. I prefer my former teammates don’t dox me if they see this. I needed to vent for some reason. Thanks for reading.",
   "created_utc": 1693377354,
   "score": 36,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycbqx6",
   "message": "I was home alone, packing for college. Once done I switched on the TV, unbeknownst to me the attack was ongoing, smoke billowing over Manhattan, the skyline engulfed in a cloud of dust. I immediately thought NYC had been nuked…",
   "created_utc": 1693377433,
   "score": 3,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jycebfc",
   "message": "I was a civilian Corrections Officer, and a squad leader in my Army Reserve MP Unit. My then GF had flown out for a visit, and we'd just gotten up. I'd just put the coffee on and turned on the TV. I looked at the screen and tried to figure out what movie this was, when I realized this was a live broadcast... I stood there stunned. My GF came in and I pointed at the screen and sat back hard into the chair... she looked at the screen in shock, and sat down in my lap. I held her for quite awhile and then excused myself. \n\nI dug out my recall roster, contacted all my troops and told them to make sure their bags were packed and ready. Most understood right away why I had called.  I had to tell others to turn on their TVs. I informed them that we had NOT been activated, yet, but we needed to be ready. \n\nOur Unit was activated a month later.",
   "created_utc": 1693379350,
   "score": 9,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc6nv7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jyc9fxe",
   "message": "I was in third grade. They wheeled the TV in and we all got hyped for Bill Nye. We got unyped very, very fast.",
   "created_utc": 1693375737,
   "score": 7,
   "submission_id": "16536s6"
  },
  {
   "comment_id": "jychvql",
   "message": "I was heading to work in Manhattan. Going in late after a long night at the office as an associate at a law firm at Liberty Plaza, across the street from the North Tower.\n\nI usually got off the 4/5 train at John Street but the station was empty and they made an announcement that the station was closed \"because of an incident.\" That was met with a lot of eye rolling and grumbling.\n\nThe train stopped at Wall Street and lots of people got off. No one had any idea that something was seriously wrong until we hit street level and smelled the smoke. Broadway was empty except for strewn debris. I remember lots of scattered papers.\n\nThe buildings blocked the view of the towers, so I still had no idea what had happened but it must have been just after the second plane hit. \n\nI walked north and soon saw that the south tower was on fire, but from that position the south tower blocked my view of the north tower. I kept walking north and near my building I first saw that the north tower was also on fire.\n\nStill didn't know what was going on but understood it wasn't an accident. People on the street were not jumpy or panicking. They were trying to use their cell phones (the networks were already overloaded and nothing was working). And they were milling about in the middle of intersections. \n\nThe sheer size of the WTC complex made it feel like the danger was \"over there\" and we were ok. The fires were way up and there was no debris still falling.\n\nAt the base of my building I asked a security guard what happened and he barked that he had no idea but there had been two explosions in the last half hour and to get the f@#% out of there. That made a lot of sense to me.\n\nI started walking north on Broadway. There were lots of people just gathering in the street and a few cops were yelling at them to stay on the sidewalks because firetrucks would need to get through. Overall it was still pretty calm considering the situation.\n\nHowever, on Dey Street there was a long line of people in business wear covered in white ash who were visibly traumatized and were being attended by a few emergency personnel. They must have just been evacuated from the North Tower. A few were crying and being consoled by colleagues. A couple guys were walking up and down the line calling out names of a few people they got separated from. \n\nWith no medical training, I knew I was just going to get in the way if I stuck around.\n\nI kept going north on Broadway and pieced together what happened from people who were gathered around a few parked cars along the way listening to the news on the radio. I listened to a few snippets and then kept going.\n\nI got just about to Canal Street when everyone gasped suddenly and I turned to see the South Tower collapse in the distance.\n\nFirst I thought of the people in the building of course. But then I thought of all those people standing in Liberty plaza and the evacuees on Dey Street just a block north. \n\nI walked all the way back to my apartment on East 26th Street and used my desktop PC to email my family that I was ok. Phones were still useless. There was no way to get out of Manhattan so I bought cold cuts at the corner bodega and holed up for the next 24 hours watching CNN and waiting for instructions of where I was supposed to be next for work. \n\nThe next several months were a blur.",
   "created_utc": 1693382117,
   "score": 6,
   "submission_id": "16536s6"
  }
 ]
}