{
 "submission_id": "1654bw9",
 "title": "Mean people of reddit, why do you say mean things to people online?",
 "selftext": "",
 "created_utc": 1693368407,
 "permalink": "/r/AskReddit/comments/1654bw9/mean_people_of_reddit_why_do_you_say_mean_things/",
 "score": 61,
 "url": "https://www.reddit.com/r/AskReddit/comments/1654bw9/mean_people_of_reddit_why_do_you_say_mean_things/",
 "comments": [
  {
   "comment_id": "jyc2ywu",
   "message": "I try very hard to be nice to everyone, but resentment often kicks in.\n\nEspecially when dealing with these types:\n\n* Person who lives to create fanfiction to excuse and fix issues with shows. I don't care about your impressive writing project, I was just pointing out a thing that I saw.\n* Person who does not understand humor or irony, ignores that you are joking, and then reframes a question in a serious manner... \"Why would you ever do x or say y when everyone knows the smartestest people do z. Glad to help\"\n* People that don't understand what an opinion is.\n* People that don't understand what a fact or logic is.\n* People who deliberately don't understand",
   "created_utc": 1693371454,
   "score": 17,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyby06e",
   "message": "Because people keep posting to r/RoastMe and asking for it.",
   "created_utc": 1693368504,
   "score": 17,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc5i9l",
   "message": "Because I have to always pretend to be nice and agree with everyone in real life, I need a place to speak my truth",
   "created_utc": 1693373050,
   "score": 14,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc2x48",
   "message": "Most of us aren't mean, it's just sometimes we run into stupid people on here. Because it's relatively consequence free, blasting an idiot can be a fun way to blow off steam. \n\nThose malicious people are another story. Usually they are troll like dweebs, or just broken people lashing out. It's for the same reason as above but there is a line that I think most redditors agree upon and enforce.",
   "created_utc": 1693371425,
   "score": 14,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybxyop",
   "message": "Depends, sometimes I have low Blood sugar, sometimes there are too many weeds in my front yard. Either one can set me off",
   "created_utc": 1693368481,
   "score": 13,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybys66",
   "message": "because peoples inhibition against indulging in antisocial behaviour is linked to their physical proximity to the targets of that behaviour.  If you are rude or abusive in person, theres a possibility of being punched in the mouth, online there is no such consequence.",
   "created_utc": 1693368944,
   "score": 7,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc8bw7",
   "message": "I spend most of my day being nice and empathetic to people. I like to think I have a very long temper. But, if someone is being willfully ignorant or spouting some hateful nonsense, then I have no issue with being mean to them. There are lines I do not cross though. I won't harass anyone or take it to a personal level. Try to always be a good person, but we're all human at the end of the day, and sometimes those negative emotions leak out.",
   "created_utc": 1693374950,
   "score": 4,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc8ll2",
   "message": "I tend to return the energy I get. I'm mostly nice, but if someone cops an attitude, I can keep up.",
   "created_utc": 1693375140,
   "score": 4,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycd8f8",
   "message": "I don’t. It’s not my fault they take offense to what I said.",
   "created_utc": 1693378544,
   "score": 3,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc1h1v",
   "message": "There are no repercussions in a world of anonymity.",
   "created_utc": 1693370533,
   "score": 8,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc12c6",
   "message": "I don't believe they are people. I think reddit is 75% chatbots, and 25% role playing.",
   "created_utc": 1693370284,
   "score": 5,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc9pct",
   "message": "I'm coridal until: \n\nI got reported to the suicide hot line.\n\nA 2nd time, someone followed me unto someone else's post entirely different from thy original post. \u0026amp; chose to attack me there.\n\nWhy do they personally attack you about  the topic when it has nothing to do with you?",
   "created_utc": 1693375929,
   "score": 3,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycbn1m",
   "message": "It keeps me from going off the deep end myself. Makes me feel less shitty about my own fucked up life.",
   "created_utc": 1693377352,
   "score": 3,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc6k2j",
   "message": "I argue with people online a lot, but I usually don't get mean unless they do first.",
   "created_utc": 1693373740,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc7osz",
   "message": "I don't want to feel anger, hate, or fear. I love feeling unconditional love, and at every opportunity I effuse over my loved ones. But no matter what, all I feel is shitty, all the time. And I can't hurt them the way I've been hurt. If I ever say some bullshit thing to someone close to me, it kills me to turn my back on their feelings. Even if it doesn't kill them to do the same to me sometimes. So I go off on people I figure would only dislike me, or even actively hate me, but never suffer over it. Except maybe they do, sometimes, and I just don't accept it. But even if those are some self-serving reasons, it's very true that if someone says something rude to me and I go OTT with \"hey fuck you\" or something like that, that's ridiculous, but if I told my sister the same thing, or my mother, either would feel her trust in me completely shattered. Not that I could do that to her, but that energy is in there needing to come out somehow.",
   "created_utc": 1693374504,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc3ph6",
   "message": "Because we are insecure about our small pee pees.\n\nWhen we are mean to strangers anonymously, it makes us feel like we have big pee pees.\n\nIt's basically the same reason people become cops.",
   "created_utc": 1693371909,
   "score": 4,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybygfi",
   "message": "i am VERY kind op 😀",
   "created_utc": 1693368760,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybzf5k",
   "message": "Because the voices tell me to",
   "created_utc": 1693369304,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc2e9j",
   "message": "Because I'm too much of a pussy to say them in real life.",
   "created_utc": 1693371099,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc755k",
   "message": "[deleted]",
   "created_utc": 1693374129,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc197g",
   "message": "Hey OP... you suck! \n\nGot'em",
   "created_utc": 1693370400,
   "score": 3,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc3ut9",
   "message": "They had it coming.",
   "created_utc": 1693372000,
   "score": 3,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycf8gs",
   "message": "Not been on reddit long enough but from what I've seen, it's not mean but some harsh reality checks dependent on the OP content, some decent advice, as well as some sarcasm thrown in the mix.",
   "created_utc": 1693380044,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyby8ry",
   "message": "Honestly just cause I get a kick out of it sometimes",
   "created_utc": 1693368642,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybxxml",
   "message": "Why do you get upset when someone says something to you online? It's words on a screen. They can't do anything to you at all.",
   "created_utc": 1693368464,
   "score": 2,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc6f0y",
   "message": "Because we aren't your mommy and daddy and sometimes, you need to hear the awful truth or, our version of it.",
   "created_utc": 1693373649,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybywl7",
   "message": "It feels good, boots my confidence",
   "created_utc": 1693369013,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybzu01",
   "message": "I say mean things anywhere at anytime. Mostly just jokes but can be weaponized to knock down a person's unfounded hubris. Confidence is fine and healthy. The egocentric folk though, just really grab my gears so I'll pinpoint and go all in. Most of the time I get on a roll and just keep tossing them out like business cards. Other times there's someone else that will knock me down and I respect it. I have no problem when someone calls me out on my BS. There will be some back and forth but ,all in all I respect it. The insult is really just an art form. Like poetry, songwriting and prose.",
   "created_utc": 1693369548,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc1ugu",
   "message": "Because I lack self esteem and morals.",
   "created_utc": 1693370768,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc44hx",
   "message": "Everyone needs an outlet, better then on the people around you.",
   "created_utc": 1693372167,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc49mt",
   "message": "It makes me feel like a big man",
   "created_utc": 1693372256,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyca4tp",
   "message": "Wait why else do people come here?",
   "created_utc": 1693376243,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycba14",
   "message": "I can't take out frustration out irl as an introvert. So i found reddit",
   "created_utc": 1693377087,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc0y2k",
   "message": "Because someone has to tell them how bad they are at the game and that's why their parents don't love them.",
   "created_utc": 1693370212,
   "score": 0,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyby6ic",
   "message": "Because someone else was mean so I have to continue the circle of life.",
   "created_utc": 1693368607,
   "score": 254,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybyo6e",
   "message": "You just can't get over your misogyny, can you?",
   "created_utc": 1693368882,
   "score": 255,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc0j20",
   "message": "They deserve it",
   "created_utc": 1693369961,
   "score": 255,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc2lxq",
   "message": "Go to hell",
   "created_utc": 1693371232,
   "score": 255,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jybzgqj",
   "message": "I dont try to be mean,I just says what I think.\nIf people get mad about another man's opinion, it means their ego is briddle af",
   "created_utc": 1693369329,
   "score": 0,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc74ai",
   "message": "I’m PMSing and that’s my signal to take a break for a while. \nPeople are idiots.",
   "created_utc": 1693374113,
   "score": 0,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycdulz",
   "message": "People are douchebags. I don't mind being the one to let them know.",
   "created_utc": 1693379006,
   "score": 0,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycg1cx",
   "message": "The fuck you saying bitch ?",
   "created_utc": 1693380661,
   "score": 0,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycicff",
   "message": "I intensely dislike redditors and the class of people who enjoy reddit.",
   "created_utc": 1693382488,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc2ol0",
   "message": "I wouldn't say I'm mean, but when I am, It's because I haven't apologized. I'm gonna do it now! I made a severe and continuous lapse in my judgement, and I don’t expect to be forgiven. I’m simply here to apologize  \nWhat we came across in the woods that day was obviously unplanned. The reactions you saw on tape were raw, they were unfiltered. None of us knew how to react, or how to feel. I should have never posted the video. I should have put the cameras down and stopped recording what we were going through  \nThere's a lot of things I should have done differently but I didn't. And for that, from the bottom of my heart, I am sorry. I want to apologize to the internet. I want to apologize to anyone who has seen the video. I want to apologize to anyone who has been affected or touched by mental illness, or depression, or suicide. But, most importantly, I want to apologize to the victim and his family  \nFor my fans who are defending my actions, please, don't. I don’t deserve to be defended. My goal with my content is always to entertain, to push the boundaries, to be all-inclusive. In the world live in, I share almost everything I do. The intent is never to be heartless, cruel, or malicious. Like I said, I made a huge mistake. I don’t expect to be forgiven, I’m just here to apologize. I'm ashamed of myself. I’m disappointed in myself. And I promise to be better. I will be better. Thank you",
   "created_utc": 1693371278,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc5usb",
   "message": "Sometimes I’m just fucking around and it comes off harsher than it is. I’m very unserious in real life and I text the way I act in person. Unfortunately for me, that doesn’t translate well. Also I like to browse Reddit high and I’m extra annoying and goofy. I should probably stop",
   "created_utc": 1693373282,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc6p0u",
   "message": "If I don’t have my daily three eggs and two pieces of toast then that’s the reasoning",
   "created_utc": 1693373830,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc7pet",
   "message": "Cuz some crazy people will only rationalize with crazy so I fire back when they collectively spread bigotry on the internet.",
   "created_utc": 1693374515,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc8495",
   "message": "Idk but I’ll probably learn about these types of people in my psychology course in college. I actually hope I do that sounds intriguing",
   "created_utc": 1693374801,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc9ksh",
   "message": "We die for what we believe",
   "created_utc": 1693375836,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyc9n1k",
   "message": "Because nobody understands when I say median things",
   "created_utc": 1693375883,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyca11l",
   "message": "I only respond to someone else's aggression, and then rarely.",
   "created_utc": 1693376169,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycatve",
   "message": "I don’t set out to be mean. However, I’ve had rude or bigoted comments thrown at me and defended myself in response, then was accused of being “mean” for defending myself, because a lot of people can’t tell the difference between aggression and resistance.",
   "created_utc": 1693376753,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycb1j6",
   "message": "Because it makes a point sometimes. There's being polite, but then there's letting people go in criticized when they're being ridiculous. Being blunt and straight up saying \"No, you're wrong.\" isn't mean souch as blunt. \"You're stupid and wrong.\" is mean, but ... idk that's not me unless someone is acting like a know it all when they're clueless.",
   "created_utc": 1693376911,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycclku",
   "message": "Because the person is too far away for me to say it to their face",
   "created_utc": 1693378070,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyccqp2",
   "message": "I'm only mean when they are stupid.  People who think that you can catch autism, or cure diabetes with essential oils don't deserve nice.",
   "created_utc": 1693378176,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyccuur",
   "message": "I don't get enough riboflavin in my diet.",
   "created_utc": 1693378261,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycd1wl",
   "message": "Because my cats don't understand what I'm saying, nor do they care.",
   "created_utc": 1693378408,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycd6w5",
   "message": "Not excusing it but sometimes I get manic episodes and say stuff thinking it's funny but after the episode is over I realize it was actually mean. I don't think I've been too mean lately because I wanted to change that. I started drawing or listening to a podcast when I'm feeling that negative energy and it's been helping a lot.",
   "created_utc": 1693378512,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyce6i1",
   "message": "I think most people don’t understand how to separate emotion from just reading a sentence. Or they see a word that makes them mad so they go off on someone. Could completely explain something in a sentence or two but it needs to be a paragraph. \n\nDamn I made a paragraph 😩",
   "created_utc": 1693379249,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycfhwr",
   "message": "Sometimes people need to know what they said is dumb",
   "created_utc": 1693380243,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycfoe9",
   "message": "Usually i dont. Sometimes it happens on accident but it has gotten easier to just be nice over the years of trying to be less rude",
   "created_utc": 1693380382,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycfzta",
   "message": "I don’t I’m just here to see replies",
   "created_utc": 1693380628,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jycgh7t",
   "message": "I try to be as nice and uplifting as possible, but when i see that the person on the other side of the screen is there only to argue, and not for the argument itself, i let it rip",
   "created_utc": 1693381001,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyckjg7",
   "message": "Depends, sometimes I have low Blood sugar, sometimes there are too many weeds in my front yard. Either one can set me off",
   "created_utc": 1693384248,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyckjue",
   "message": "I love telling people how impressed I am at their fertile minds making up all sorts of things from one sentence I wrote.",
   "created_utc": 1693384257,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyckk7i",
   "message": "I try very hard to be nice to everyone, but resentment often kicks in.\r  \n\r  \nEspecially when dealing with these types:\r  \n\r  \nPerson who lives to create fanfiction to excuse and fix issues with shows. I don't care about your impressive writing project, I was just pointing out a thing that I saw.\r  \n\r  \nPerson who does not understand humor or irony, ignores that you are joking, and then reframes a question in a serious manner... \"Why would you ever do x or say y when everyone knows the smartestest people do z. Glad to help\"\r  \n\r  \nPeople that don't understand what an opinion is.\r  \n\r  \nPeople that don't understand what a fact or logic is.\r  \n\r  \nPeople who deliberately don't understand",
   "created_utc": 1693384265,
   "score": 1,
   "submission_id": "1654bw9"
  },
  {
   "comment_id": "jyckssu",
   "message": "Because fuck you that's why.",
   "created_utc": 1693384457,
   "score": 1,
   "submission_id": "1654bw9"
  }
 ]
}