{
 "submission_id": "16558u1",
 "title": "What is something people don’t understand when dealing with people who are addicted to drugs?",
 "selftext": "",
 "created_utc": 1693371303,
 "permalink": "/r/AskReddit/comments/16558u1/what_is_something_people_dont_understand_when/",
 "score": 88,
 "url": "https://www.reddit.com/r/AskReddit/comments/16558u1/what_is_something_people_dont_understand_when/",
 "comments": [
  {
   "comment_id": "jyc4n5x",
   "message": "They have to want to quit for themselves.",
   "created_utc": 1693372499,
   "score": 61,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc9od8",
   "message": "Nobody woke up one day and suddenly decided they were going to be homeless, addicted and stealing bicycles to support their addiction. It’s a slippery slope, and some people get to that point faster than others. \n\nAlso, relapse can and (likely) will happen.",
   "created_utc": 1693375910,
   "score": 255,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycmhve",
   "message": "People don’t understand that in many cases the chemical or psychological dependency has rewired the addict’s brain.  The person you knew before is changed, and his/her brain is now incapable of experiencing pleasure as a reward for doing healthy things like holding down a job, telling the truth, or being a functioning adult.",
   "created_utc": 1693385822,
   "score": 192,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycffo5",
   "message": "It’s always on their mind. Each time that they want to stop. Sometimes even during their trip, they wish for soberness. This is the last time they promise. They know how their family or friends see them and feel shame. \n\nAnxiety. Despair. Rock bottom. Worries over money. Grief. Fear. Pain. Sweating. Shaking. Calm..? No, that’s just numbness. \n\nMissing events or doing things that before they could handle easily. Beauty. Looking forward. How did this even happen? Trauma. Loss. Or perhaps no trauma. Nothing too bad. Others are worse off. Maybe just a lack of stimulation? Or Anger. Resentment. Disappointed. In others? Maybe. But mostly in oneself. For letting it all get so far. Hate. \n\nNumbness sets in. \n\nMemories. \n\nDarkness. \n\nPacing rock bottom some more. \nSearching for the exit. \nJust let go. \n\nIsolate. \n\nWithdraw. \n\nJust one more time to not care. \n\nThen after they will be fine. Gain back control and be able to move on and heal. But to do that you have to feel strong. Maybe it’s not so bad. Didn’t kill anyone yet. Laugh. Think. \n\nThe feeling and reminder of the drug sets in. The drugs will help “let go” get rid of that uncertainty. Make them not care so much. Feel more assured. Euphoria. Capture it once more. The cycle continues. The ache for the next hit to not feel. Or maybe to feel. Maybe they are so numb that when sober, they must at least try to feel something. Anything. And they felt it before. \n\n\nGo time. Try again. Not enough. Just a little more…. Wake up. \nDread.\nBefore their eyes even open, it rolls in like a fog…\n\n\nSome… their eyes stay closed.",
   "created_utc": 1693380195,
   "score": 79,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyccvgg",
   "message": "My dad and a good chunk of my family were meth addicts. My nephew is in prison and his brother is roaming the streets somewhere addicted to meth pretending he's Rambo. \n\nI grew up in a meth house. I can tell you one thing I've observed and talked about with recovered meth addicts is that they absolutely don't think anything is wrong, or that anyone notices their weird behavior. In fact a few people I talked to, family included, thought they were an enhanced version of themselves when in meth. Like a super hero. My sister thought she was \"super mom\" even though she lost custody of 4 out of 5 of her kids. When she was on dope, if you tried to talk to her about it, she would say she was the greatest mom ever, and it was the state who had a problem. \n\nAnd like I said about my nephew, he thinks he's some sort of action movie level bad ass- but he's homeless in the street addicted to meth. \n\nThey truly believe no one else can tell they're on one.",
   "created_utc": 1693378273,
   "score": 121,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc3xow",
   "message": "People often don't understand that addiction is a complex medical condition involving both physical and psychological components. It's not solely a matter of willpower, and recovery requires empathy, support, and often professional treatment.",
   "created_utc": 1693372050,
   "score": 45,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc9a4b",
   "message": "That it's a symptom of pain. There's something causing them such anguish that they don't want to feel like themselves.",
   "created_utc": 1693375622,
   "score": 185,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyce3m3",
   "message": "We don't use drugs because we want to. We use drugs because we feel like we have too. Coming from someone who just quit yesterday, it's fucking rough. No one understands the sadness I deal with every day. The drugs help A LOT.",
   "created_utc": 1693379189,
   "score": 47,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyctyvg",
   "message": "The number of \"ordinary\" people addicted to drugs far outweighs the number of people labelled \"junkies\".\n\nI'm 55 and I have been stuck on over the counter painkillers for 30+ years. Luckily I'm able to function normally, hold down a job, have a family, run a business etc. I have met many people like myself stuck on prescription or over the counter drugs. Based on my own personal observations I would say 1 in 5 households contains an addict. You would never know looking at them because they live ordinary normal lives.",
   "created_utc": 1693391428,
   "score": 171,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycjct4",
   "message": "In my line of work, I’ve come across addicts of all types and severity, but sadly, there’s one thing that’s common to all of them- the lies. \n\nThe lies are the hardest part of dealing with an addict. The lies they tell you, he lies they tell themselves, and looking you right in the eye when they do it. \n\nIt’s heartbreaking, infuriating, and makes helping them so, so difficult.",
   "created_utc": 1693383297,
   "score": 138,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycknva",
   "message": "That addiction is a disease. It literally changes the brain to believe it needs that susbtance (or that activity) as if you need air, water and food to survive.",
   "created_utc": 1693384346,
   "score": 110,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc7ujt",
   "message": "You can’t help someone who doesn’t want to get clean",
   "created_utc": 1693374614,
   "score": 153,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycq54r",
   "message": "That you can't just tell someone to quit and get mad when they don't. It's not that easy. You never know what the other person is going through. Be there for them but don't make it about yourself.",
   "created_utc": 1693388639,
   "score": 55,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycihy0",
   "message": "That it is not as simple as a choice to stop. Addiction is just that. You have lost your ability to choose. Physical dependence is different but the two can merge easily. \n\n\nFor many, it is rooted in early developmental trauma (poor parenting, abandonment, abuse, neglect) and the brain is wired to avoid emotion for fear of complete annihilation or even death. Emotion (usually negative ones related to trauma but it can be global) feels terrifying and must be eliminated, altered or suppressed to survive. \n\nThe worse addiction gets the more pain the person can begin to feel because they often recreate the core traumas trying to be avoided as more and more trauma occurs through their drug use and actions as a result.  So a person running from childhood sexual abuse, may end up doing sex work, or someone who was abandoned as a child may end up pushing everyone around them away for instance. This can, eventually lead to either compound drug use to try and avoid those now stronger feelings, suicide, or eventual recovery.\n\nLove and clear boundaries have shown to be effective in helping someone recover. For someone to begin to contemplate facing the pain inside them, it helps if they look up and see kind faces smiling back. Long term treatment is often required with wide reaching social support and trauma informed care is very important for most. \n\nMy experience has been that my whole family are addicted to various things. Recovery has been slow and bumpy for all involved and community support, firm boundaries and endless love has ensured all members a way home. Love is not without boundaries however. If you rob me, I will call the police. I will hold you accountable for that action. I do not stop loving you upon release.",
   "created_utc": 1693382612,
   "score": 83,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc3ks5",
   "message": "The source of addiction",
   "created_utc": 1693371828,
   "score": 50,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jychvp9",
   "message": "Two things come to mind. 1. An addiction takes a while to develop. Few addicts (none that I’ve known) use opiates and are immediately addicted. It’s gradual and insidious. \n\n2. The addict is often trying to make the decision to stop constantly. By this I mean you are exerting ALL your willpower and absolutely insisting that you not use again. But an addicted brain simply won’t let itself make that decision and stick to it. It will reinsert the overwhelming desire to use again and again. Not using (without medical help) means mustering up all your willpower on a fresh basis about a hundred times an hour. It’s absolutely exhausting and almost impossible to succeed when the insistence reasserts itself unendingly. \n\nIt’s insanely hard to beat the battle of attrition against your own brain.\n\nEdit: fixed typo (the word “most” to “few”).",
   "created_utc": 1693382117,
   "score": 74,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc52u5",
   "message": "What I see people miss the most is the motivation for escape. There's a reason a person uses a substance that alters their perception, it's a matter of helping the willing find a way to cope besides their substance of choice",
   "created_utc": 1693372776,
   "score": 66,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc7ob6",
   "message": "That they are unhappy.",
   "created_utc": 1693374494,
   "score": 46,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyci709",
   "message": "Most addicts are afraid of the withdrawal process and believe it is easier to remain an addict. From what I’ve seen, the first 4 days are the hardest.",
   "created_utc": 1693382370,
   "score": 232,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycuoq5",
   "message": "They are probably no longer doing it for a treat or a high; they are doing it just so they can feel better. Imagine you’ve got a bad flu you cannot shift but you have access to a wonder medicine that will instantly make you feel better… the temptation to take the medicine would be immense; that is what a drug addict goes through.",
   "created_utc": 1693391943,
   "score": 108,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc3j1t",
   "message": "Addiction is a disease",
   "created_utc": 1693371799,
   "score": 72,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycriqo",
   "message": "We just lost my MIL to addiction, this past Friday. Beautiful lady, gone very early. She lost two sons in her life- one as an infant, and one due to a tragic vehicle accident when he was 16. Both events happened almost 30 years ago. But she was never the same, and never recovered. It’s heartbreaking, because we were forced to keep our children (her grandchildren) from spending much time alone with her, because the situation was just so volatile and frequently kinetic. Now we look back and wonder if we could’ve made a bigger difference, but my wife is the most beautiful woman I’ve ever known, and never stopped trying to get thru. \nAddiction affects the whole family.",
   "created_utc": 1693389683,
   "score": 22,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycunof",
   "message": "A lot of people get addicted to the lifestyle in addition to the drugs. And I’m not talking about “rich celebrity cocaine lifestyle”. \n\nA lot of people get clean, kinda just miss the lifestyle, and back to it BEFORE relapsing.",
   "created_utc": 1693391922,
   "score": 16,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycmc9t",
   "message": "No matter how long you have not taken them, you will always be addicted and any trigger could come at any time years and years later and no, you can not just do it one time again and stop after again just like that.",
   "created_utc": 1693385701,
   "score": 62,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycvs5f",
   "message": "Some people that are on drugs seem ok and some do not.  I think it’s important to be aware that some addicts are still able to function.  You really can’t be 100% sure who is indulging and who is not.  I know an alcoholic school teacher.",
   "created_utc": 1693392667,
   "score": 17,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycacih",
   "message": "You cannot rationalize with them. \nThey easily lie.",
   "created_utc": 1693376400,
   "score": 60,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycgcyk",
   "message": "That a lot of people who are addicts started doing drugs to treat childhood trauma or mental health issues.",
   "created_utc": 1693380910,
   "score": 55,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc9v6y",
   "message": "No matter how much you love them, how much you sacrifice for them, how many tears you shed for them...they will ALWAYS pick drugs over you.",
   "created_utc": 1693376048,
   "score": 86,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycih5e",
   "message": "The oversimplification of addiction as a mere choice or lack of willpower.",
   "created_utc": 1693382594,
   "score": 21,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycko2d",
   "message": "They have to want to quit for themselves.",
   "created_utc": 1693384351,
   "score": 18,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycrwch",
   "message": "A lot of people don’t understand that “the drugs come first.”  Before literally anything, even their children.  Sometimes the children of addicts suffer in horrible ways because the drugs come first.",
   "created_utc": 1693389959,
   "score": 148,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycuo1t",
   "message": "They can't just quit.",
   "created_utc": 1693391930,
   "score": 7,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycvgis",
   "message": "You can't control when or where an addict will use. That's why designated user spaces can be successful. They can be monitored by paramedics in case they OD and can even have their drugs tested without fear of being arrested. It's safer there than on the streets or at home.",
   "created_utc": 1693392459,
   "score": 5,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycvmr6",
   "message": "That addiction fucks the brain up. It's not a lack of willpower. Addiction to hard drugs rewires the brain, making it extremely difficult to quit. Drug addicts can't magically stop. Do not blame the user, blame the dealer.",
   "created_utc": 1693392572,
   "score": 6,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycpoqw",
   "message": "Using drugs is a choice, being addicted is a consequence. Not everyone who uses drugs will become an addict. Addiction is best treated as a disease rather than some sort of moral failure. It typically takes multiple recover attempts for an addict to get clean, even then relapse is on the mind constantly and all it takes is one really bad day to spiral them back down.",
   "created_utc": 1693388290,
   "score": 28,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycr6k6",
   "message": "How some people can take drugs and then just walk away and not do them anymore and others fall into full dependency. \n\nAlso, how some people can do a drug responsibly and then at some conjecture in their life go off the rails (often seen with weed or alcohol).",
   "created_utc": 1693389425,
   "score": 21,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycoi9j",
   "message": "I'm reading this thread, especially focusing on comments by recovering addicts, and I'm realizing that I felt a lot of those feelings. The emptiness, the numbness, the exhaustion, the desire to feel something--anything. I felt this way most intensely between 14-18 years of age. I turned to self harm. The smell the taste the color of blood. The feeling of physical pain to distract from the emotional anguish or sometimes to distract from the profound numbness and emptiness. How blood made me *feel*. And it made me feel something other than the bleakness of reality. And now I'm wondering: is self harm an addiction?",
   "created_utc": 1693387392,
   "score": 5,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycddoq",
   "message": "Statistically, most people become homeless, THEN addicted, not the other way around.",
   "created_utc": 1693378652,
   "score": 27,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycld5z",
   "message": "I am not a drug addict, but have my own vice. I do have a very close friend who is a drug addict and they have been through several overdoses, the most recent on which put them on life support. They got out of their toxic living situation afterwards and ended up homeless. They seemed to be getting their life on track and told me they were sobers each time we chatted. Every week we would make plans to hang out and each week they would go radio silent on those days and show back up on social media the following days. Unfortunately, the past few weeks they stopped responding altogether and all I can do is hope and pray that they are well. They know that I know everything about their addiction and have stopped trying to hide it from me. I just wish they knew they could message me 24/7 and it would never be a bother or interrupt my life because they are a part of my life. \n\nSorry for not answering the question that was posed. Just really needed to get that off my chest.",
   "created_utc": 1693384909,
   "score": 21,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycl6tl",
   "message": "It's a disease, an illness. And calling it self inflicted shows a real lack of knowledge of the environmental and physiological factors at play here.",
   "created_utc": 1693384766,
   "score": 13,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycof66",
   "message": "The physical compulsion, without ever feeling that many people simply don't understand how powerful this is above everything else.",
   "created_utc": 1693387327,
   "score": 6,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyctvoj",
   "message": "There is no quiting fentynal and train spotting is just a movie. My bud will be on some version of methadone the rest of his life. (He's 5 years clean)I honestly thought a detox was all it would take.",
   "created_utc": 1693391368,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycusxi",
   "message": "That while their behavior may be shitty (lying, stealing etc), that they may not actually be a shitty person. The addiction and the need to fuel the addiction and escape reality, is driving shitty behavior quite often.",
   "created_utc": 1693392026,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycw2ea",
   "message": "From my limited experience with people who have had addictions (and some who still do) people say stuff like \"just stop.\"\n\nEven from an outsider's perspective that's just...dumb. If you could just stop it wouldn't be an addiction. For some it's a coping mechanism they use to drown some internal trauma, for others they're trying to get a lost feeling back...I know a few folks who checked into rehab a number of times and relapsed. A few went to therapy and were able to 'quit' but every single one of them says it's like an angry dog snarling at the door. Just needs one tiny little crack in their defenses for it to come bursting out again and beginning the cycle anew.\n\nI vape and I remember when I went on a trip without it. My hand kept searching for it because it's become a part of my daily life and that's just nicotine. I can only imagine what meth, heroin, cocaine etc addiction is like. I started using it to slow my brain down so I could think clearly. Brought it from a 12 down to a 3 but getting to 0...been working on that for a few years now and it's not even a *hard* drug.",
   "created_utc": 1693392850,
   "score": 13,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycwpq0",
   "message": "They didn't want to be addicted to drugs. It happened faster than they thought and it ways they never realized until it was too late. It's a prison you can walk out of yet still feel powerless to escape.",
   "created_utc": 1693393262,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycyfrk",
   "message": "They are *addicted*.",
   "created_utc": 1693394309,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd3846",
   "message": "No matter what you do, if they don’t stop, it’s not your fault. If they fail it’s on the addict. I really Hope every addict gets the courage to quit all those heavy drugs. Not everyone is capable.",
   "created_utc": 1693396902,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycnme6",
   "message": "It is usually the people and  their social network and not the drugs that are the issue. Some very high percentage of soldiers fighting in the vietnam war tried heroin and almost none of those continued after coming home.\n\nAlmost none of those continued to use at home. Not because heroin wasn't available but because they had a social network to rely on and other things to do.",
   "created_utc": 1693386711,
   "score": 4,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyctw9p",
   "message": "most addicts care about their drug of choice more than anything else in the world. they’ll lie, cheat, steal money from their kids, and sell themselves on the street before quitting, and then gaslight you that they didn’t do anything wrong. you’ll never convince them; they have to convince themselves, and not everyone wants to. there have been multiple instances where one marriage partner killed the other in arguments over the last bag in the house, most notably bassist/producer/founder member of Mountain Felix Pappalardi. let that sink in: someone shot *their own husband* so they could grab the stash. even if they’re dear to you, stay away other than letting them know you’ll be there when they’re ready to face reality.",
   "created_utc": 1693391380,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyca3kq",
   "message": "They are probably lying. Right now. To your face. Shamelessly.",
   "created_utc": 1693376219,
   "score": 13,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycy6eh",
   "message": "They can not think normally",
   "created_utc": 1693394153,
   "score": 19,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycy7bo",
   "message": "It's not as easy as just pour it out (alcohol in my case) or just flush it.\n\n1. Withdrawal is real, and in some cases dangerous. They may need Dr.'s and meds to help and many can't afford it.\n\n2. They have to WANT to quit\n\n3. There's something missing or something hurting them. That needs to be fixed. They need care, support, belief that they CAN live a better life. Social activity in a healthy way. Often counseling, therapy or group meetings.\n\nThey need help. A leg up. Sometimes you have to trust them (if it's a family member that needs food or utilities paid), if you can't and you want to help you may have to pay for their things directly and not let them have cash. But they're not necessarily degenerate thieves and liars. Many are. But many really want to quit. I never stole or lied for my alcohol, every drop was bought with money I earned somehow (online surveys during periods of unemployment). But I am still treated with suspicion sometimes.\n\nMeds help. I'm on meds to help with cravings. I've had none since I started them.",
   "created_utc": 1693394168,
   "score": 2,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd3kz4",
   "message": "Relapse is part of recovery.",
   "created_utc": 1693397081,
   "score": 6,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd40bq",
   "message": "How incredibly driven and resourceful they have to be to maintain such an expensive habit, people look down their noses at \"smackheads\" but they're probably earning significantly more than the judgemental person, serious amount of untapped talent in that particular demographic 😂 The dishonesty that can come with it is incredibly frustrating but does not necessarily make them a bad person because the lies they are telling you are the same lies they are telling themselves, they are always looking for a magic bullet but magic bullets are very rare indeed. They also probably never intended to get addicted to drugs and if given the choice to magically not be wouldn't be so it's more mistake than decision to become an addict, it doesn't make someone a terrible person. \n\nSobriety probably means giving up some or all of your friend group, is society going to forgive you for your past? Sobriety can be lonely for an ex-addict because of attitudes on both sides of the coin and the temptation of finding comfort in what's familiar along with addiction itself is a tough battle so I don't blame anyone who slips and I have full respect for anyone who wins the war, an ex-addict is a battler",
   "created_utc": 1693397293,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd5062",
   "message": "How often the emotional and mental health problems preceeded the drug use, often by multiple years.",
   "created_utc": 1693397788,
   "score": 6,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd5krj",
   "message": "Drugs aren’t most users’ problem. Drugs are the best possible solution left to their real problems (poverty, trauma). When the world has given you nothing and left you with no hope, you do what you’ve gotta do to just get through every day.",
   "created_utc": 1693398066,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyckyed",
   "message": "That we have no interest in quitting.",
   "created_utc": 1693384578,
   "score": 6,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycm9j1",
   "message": "Their behavior is not rational. People spend hours trying to figure out why their son or daughter did something crazy and so out of character. People that are using drugs do all kinds of things that are out of character because their emotions and cognitions are out of wack, they are not predictable and often times their behavior cannot be predicted nor explained other than to say he/she was high on drugs.",
   "created_utc": 1693385640,
   "score": 16,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycoth6",
   "message": "They are going to lie, don't take it personally. They think they are smarter than everyone else and will get defensive if you call them out on it.\n\n\u0026amp;#x200B;\n\nThe drug matters more to them than anything. You need to accept this. Everything else becomes collateral. Like someone severely addicted to alcohol will convince themselves that they drive fine while drunk (they don't) and you are overreacting because you refuse to get in the car while they drive.\n\n\u0026amp;#x200B;\n\nThey will make excuses that blame every problem on something other than the drug. \"I was tired\", \"the tire just popped\" Whatever. No matter what the problem is, whether they got fired from work, injured someone else, wrecked their car there is some excuse that isn't \"I was high and caused it\"\n\n\u0026amp;#x200B;\n\nLastly, at some point YOU are going to have to make a decision: 'do I want this person to be in my life' (at least until they go to rehab or whatever) their friends (other drug users) will try to convince you to stay because they are exactly the same 'it isn't a problem, we are just hanging out having fun' ...because 5 of you hanging out in a shed and passing out is real fun right?",
   "created_utc": 1693387631,
   "score": 4,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycvruf",
   "message": "Paraphrasing from a neurologist, so I might have some of the terms/concepts a little wrong, but the gist is:  \n\nIt's generally due to brain problems. Either underdeveloped parts from things like extreme stress and trauma during development, parental drug use, etc., being given drugs as a kid, physical trauma like TBI, or a learned disruption of the reward system like being punished by an adult even when you do a good thing or a good thing happens in life, so you don't form functional neural pathways. \n\nThese things can impact your ability to synthesize and receive neurotransmitters. That can lead to a whole host of health issues, not just mental ones, and not just addiction. That's why child abuse affects people in so many ways for the rest of their lives. \n\nIf you look at an addict's brain scan next to a typical brain, they have reduced bloodflow/activity in areas that control problem-solving, impulse control, emotional regulation, etc. They're just physically fucking different at that point, and it has nothing to do with willpower. They can, however, rehab some of that brain tissue and form new functional neural pathways, so there is hope for recovery.",
   "created_utc": 1693392662,
   "score": 31,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyce4fm",
   "message": "Lying is the default for an addict. They will do anything to avoid having to quit. They will break your heart over and over until they finally decide they want to get sober. Not when you tell them they need to get sober, not when they say it’s time to get sober, but when they make the decision. Until then they will have a million excuses as to why they can’t do it right now.",
   "created_utc": 1693379206,
   "score": 5,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyctzhm",
   "message": "That they just want to be left alone to enjoy the drug.",
   "created_utc": 1693391440,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycnp10",
   "message": "Almost all of them are victims to a greater degree than you want to know. They're a pain in the ass but they didn't really choose to be what they are.",
   "created_utc": 1693386768,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc6if5",
   "message": "They fail to recognize how low in life you have to be doing to want to be a zombie every second of the day.",
   "created_utc": 1693373710,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycbpbk",
   "message": "That it is a disease and should be handled like cancer or some other affliction.",
   "created_utc": 1693377399,
   "score": 3,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycqvgc",
   "message": "Addicts lie.",
   "created_utc": 1693389190,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycrji6",
   "message": "Referring to choice isn't helpful. Whilst it may seem like a choice to not continue, you can only see it that way if you've never been an addict.",
   "created_utc": 1693389698,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycua3o",
   "message": "When you talk to the addict, you are talking to the drugs inside their body, not to the person inside their body.",
   "created_utc": 1693391646,
   "score": 0,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycku5c",
   "message": "“I’m an addict” isn’t and is a valid excuse - it’s quite circumstantial",
   "created_utc": 1693384486,
   "score": 255,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycc02v",
   "message": "Caffeine addicts are all c u n T. S",
   "created_utc": 1693377622,
   "score": 251,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyc3o9s",
   "message": "That legalizing them is a stupid idea",
   "created_utc": 1693371888,
   "score": 238,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd0w6j",
   "message": "People don't seem to understand that not all heroin addicts are junkies.\n\nMy brother had a heroin addiction but he paid for his drugs with a legitimate job, he never robbed or stole things to feed his habit.\n\nYou see that I'm speaking in past tense? That's because he gave up after 14 years and the first relapse killed him.",
   "created_utc": 1693395682,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd22em",
   "message": "They are not rational, reality based and very selfish.",
   "created_utc": 1693396301,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd677a",
   "message": "You can't believe a single thing they say. They have perfected lying, even to themselves.",
   "created_utc": 1693398366,
   "score": 1,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyckoea",
   "message": "Nobody woke up one day and suddenly decided they were going to be homeless, addicted and stealing bicycles to support their addiction. It’s a slippery slope, and some people get to that point faster than others.\r  \n\r  \nAlso, relapse can and (likely) will happen.",
   "created_utc": 1693384358,
   "score": 248,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jycwn39",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd9otq",
   "message": "That all the bad behaviors don’t magically go away when they stop using.  We think all the bad stuff is the drugs/alcohol. I thought when my mom stopped drinking, everything would be okay. It was not.",
   "created_utc": 1693399988,
   "score": 49,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jydg7wy",
   "message": "[The Rat Park Study](http://utw10426.utweb.utexas.edu/quest/Q3/ratpark.html) proved that those rats desperately trying to get coke, which was the basis of the War on Drugs, stopped using drugs or would use them moderately when they were given parks, the ability to make friends and family, and create a community. It was defunded because it showed that as expert Gabor Mate often states, environments like the US breeds addicts. Blaming the 'addict' is a great way to ignore the environmental factors such as isolation, loneliness, influence, and trauma that feed addiction. Is that addiction? Or is it an ultimately unhealthy coping mechanism in the context of an unhealthy society triggered by trauma? I don't think love is enough for someone habituated to a substance to quit which I've learned quite painfully, but a healthier environment often is, which I've also seen. We are pack animals. If you have to use substances to get through your day, consider if your environment serves your best self and build that rat park. When my partner got sober we focused on building a nurturing and healthy life together, not loving him more because that did shit. You deserve a rat park. We all do.",
   "created_utc": 1693402772,
   "score": 127,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyddyis",
   "message": "That the addiction brings complete and utter chaos not just to the life of the addict but to everyone around him or her having to deal with them.  That the addict doesn't care how many lives they ruin as long as the addiction is satisfied  - and most importantly (to me anyway)- people who work with / empathize with those addicts never seem to understand that the kids who have had their lives ruined by addicts can grow up to be adults who have no sympathy or empathy for them.  These same people who empathize so much with addicts judge very harshly those of us who despise addiction. \n\nWow. That was a rant and a half. Lol. Sorry Reddit!",
   "created_utc": 1693401846,
   "score": 19,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyduirc",
   "message": "There is no such thing as \"rock bottom\". They do need to have to want to quit for themselves, but they do NOT need to hit \"rock bottom\" first, that is complete and utter garbage. For many longer term addicts, the only real rock bottom is death, and they obviously cannot get sober after they are dead.\n\nAlso, regardless of what rehabs push, complete sobriety from everything is not always necessary, which is why there are many rehabs in CA that even push patients to start using cannabis, for example. Using something less harmful that still has an effect on them can ease the ability to get off of far worse drugs that will end up killing them, or negatively effect their lives in a severe manner. (IE- you can be a functioning, long living member of society as a stoner, but not as a fent addict) Harm reduction will always work better than pure sobriety. (And if they are back to their old selves, and no longer at risk of dying, it is totally fine for them to stay on suboxone or something else for as long as they feel comfortable, I know many people that have been on it for more than a decade straight, ZERO relapses, living normal lives, all of this could be upended by stopping the drug)",
   "created_utc": 1693408284,
   "score": 17,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jydd88p",
   "message": "Anyone can get addicted. We aren't all scumbags and degenerates.",
   "created_utc": 1693401546,
   "score": 6,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jydj3q6",
   "message": "We didn't choose to addicts.\n\nI was 18 when I started having anxiety. Doc put me on zoloft and clonazipam. For a couple years I was ok. Then I slowly started needing the clonazipam more and I convinced myself it was ok to take one a little earlier than I was supposed to, just once. Then again. And again. Then I turned 21 and started drinking. I drank too much. The hangovers wrecked me and gave me so much anxiety. So took a clonazepam to deal with it. And thus began an awful, awful cycle.\n\nFor years I was convinced I needed those meds and I just had to learn how to take them \"the right way\", and how to drink \"the right way.\" My brain was so messed up from. The ups and downs. \n\nI lost jobs, damaged relationships. Then one day I woke up in the hospital. I had accidentally OD'd. I was in the hospital for 10 days while my organs recovered. Luckily, I did recover, fully. That was my rock bottom. That's what it took to realize just how much damage I was doing to myself. I genuinely hadn't realized it. \n\nThe substance abuse happened so gradually and seemed so justified in mind. \n\nNo one sets out to become an addict. No one chooses to suffer like that. Everyone has a journey that got them to that awful point.",
   "created_utc": 1693403942,
   "score": 7,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jydrijn",
   "message": "That walking away can be the best solution ever and you don’t owe any Addict SHIT",
   "created_utc": 1693407159,
   "score": 5,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jye2cin",
   "message": "It can happen to     a n y o n e",
   "created_utc": 1693411140,
   "score": 6,
   "submission_id": "16558u1"
  },
  {
   "comment_id": "jyd8gpr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16558u1"
  }
 ]
}