{
 "submission_id": "1658j7b",
 "title": "If you woke up in a field in the year 1200, what would you do?",
 "selftext": "",
 "created_utc": 1693382977,
 "permalink": "/r/AskReddit/comments/1658j7b/if_you_woke_up_in_a_field_in_the_year_1200_what/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/1658j7b/if_you_woke_up_in_a_field_in_the_year_1200_what/",
 "comments": [
  {
   "comment_id": "jycjetg",
   "message": "Honesty, probably get killed in the first few hours because I wouldn’t speak understandable English to them and would look very weird.",
   "created_utc": 1693383343,
   "score": 76,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycjjjn",
   "message": "Probably die every quickly. Either through illness or starvation. I can't speak Middle English so wouldn't have a Scooby what anyone was saying and as soon as I came into contact with someone there is a risk they would unintentionally pass on something my modern immune system has no idea how to handle because its never been exposed to it. Which without antibiotics or penicillin is a problem.",
   "created_utc": 1693383448,
   "score": 81,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyco568",
   "message": "Depends if I have my glasses or not",
   "created_utc": 1693387115,
   "score": 22,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycj543",
   "message": "Scratch my balls and go back to sleep",
   "created_utc": 1693383124,
   "score": 57,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycjfkt",
   "message": "Get to the nearest McDonald's for an Egg McMuffin and a coffee.  \nAssess the situation from the vantage point of the restaurant window.",
   "created_utc": 1693383361,
   "score": 22,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycmmlx",
   "message": "Become a blacksmith, invent everything.",
   "created_utc": 1693385925,
   "score": 32,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycjnr6",
   "message": "Mug the first guy I see and steal his clothes.",
   "created_utc": 1693383545,
   "score": 10,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycs4je",
   "message": "Enjoy my last normal poop, because my pampered G.I. tract will never be the same.",
   "created_utc": 1693390127,
   "score": 10,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyco3bn",
   "message": "Die of dysentery, probably",
   "created_utc": 1693387076,
   "score": 7,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycjlnf",
   "message": "Would kinda depend on where.  In North America, I guess hang out at the indian casino.",
   "created_utc": 1693383497,
   "score": 13,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyclaft",
   "message": "Scare the piss out of some aboriginal people and probably die",
   "created_utc": 1693384847,
   "score": 7,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycmv32",
   "message": "Hunt and gather.",
   "created_utc": 1693386115,
   "score": 6,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydgpxo",
   "message": "I love these and usually I think of how I could change the Roman Empire.\n\nBut 1200. in a cold wet field.  Well. The short answer is I'd probably die from a water-borne disease if i wasn't killed by villagers or death from exposure or hunger.\n\nSee, a modern man (because I'm male) dressed in a modern way would probably not be well received in superstitious middle ages. Heck, the way I dress isn't well received now. Add to this strength I'm almost legally blind without my glasses AND I'm color blind. \n\nI would have nothing of value on me except my phone, and Apple is great but I'm not sure how far 1 day of candy crush would get me with the nearly town leaders.  Those US dollar bills in my wallet - worthless. It's not like I carry gold doublons in my pocket, and with my luck they'd be stamped with the year \"1400\" so they look fake. \\*sigh\\*.\n\nI also have no skills that could net me a paying job. Youtube creator... nope. Reddit commentator? Again... nope. \n\nOf course I have an engineering degree. But I'm not sure using a CAD program, data tables, and spreadsheets to determine a pipe size would \\*exactly\\* transfer to the middle ages.  I'm not strong, I don't know how to butcher, weave, sew, or blacksmith. \n\nAnd let's face the simple fact, even if this cold wet field was in England (or Scotland) I couldn't speak the language! English of 1200 is nothing like English of 2023.  They'd think I was french or something evil like that.\n\nSure I understand some things like what the world looks like, the concepts of electricity, gunpowder, etc... but not exactly things that would provide some coin to buy bread. \n\nMy hope would be I could beg enough in my ununderstood language to feed myself, and then get a job with a blacksmith where I make enough to experiment and design the \"pump\" that revolutionizes mining.\n\nBetter - is if my wife was stranded with me. First - she's a Campbell. So if we were in Scotland we may be able to find refuge. Also, she's a Chemist. A bit of patience and we could do amazing things.\n\nBut mostly I think I'd end up dying lying against a tree cold and hungry.",
   "created_utc": 1693402978,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycsib4",
   "message": "Go to the nearest tavern and start singing WAP by cardi b as if it was karaoke night.",
   "created_utc": 1693390405,
   "score": 8,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycj6v2",
   "message": "Raw dog everyone because AIDS doesn’t appear for almost 800 years.",
   "created_utc": 1693383164,
   "score": 13,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycmdgu",
   "message": "Bang my way through the entire world",
   "created_utc": 1693385727,
   "score": 3,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycvbcv",
   "message": "Create Amazon for all your sword and mud hut needs",
   "created_utc": 1693392366,
   "score": 3,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycxiun",
   "message": "Die within the week as my various medical conditions go untreated. The end.",
   "created_utc": 1693393761,
   "score": 3,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydfg2o",
   "message": "I'd immediately become a farmer because I already know I'm outstanding in the field.",
   "created_utc": 1693402456,
   "score": 3,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyckw6r",
   "message": "Find a mathematician and teach them calculus.",
   "created_utc": 1693384529,
   "score": 5,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycj2hk",
   "message": "Find coffee",
   "created_utc": 1693383067,
   "score": 2,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycj3z2",
   "message": "Take the new world for myself",
   "created_utc": 1693383099,
   "score": 2,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycl5m4",
   "message": "I'd try to find a nearby castle and see if they're hiring a court jester. Hey, if I'm stuck in the Middle Ages, might as well bring some laughter to the knights and damsels!",
   "created_utc": 1693384739,
   "score": 2,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyctwok",
   "message": "Gonna go Dr. Stone and hit 'em with some mindblowing 21st century high school level science and like, the concept of reinforced concrete.",
   "created_utc": 1693391388,
   "score": 2,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyddotr",
   "message": "Probably get back to work",
   "created_utc": 1693401735,
   "score": 2,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydlvix",
   "message": "Try to find some coffee",
   "created_utc": 1693405030,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycj7t5",
   "message": "Assuming my phone doesn’t come with me, write down everything I see. \nThen contact every major historian I could find and get my hands on all the oldest historical records they have. \nThen use my knowledge of the future to gain enough influence to lead excavation teams to all the yet-undiscovered ancient sites. \n\nOh and warn people about smallpox.",
   "created_utc": 1693383185,
   "score": 5,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycmb7v",
   "message": "I think it depends heavily on where that field is.\n\nI wouldn't want to turn up anywhere near where Genghis Khan is going to be for example and I would also want to stay out of the way of the 4th crusade.\n\nIf it was anywhere near where I am now, I might be in luck, because my hometown actually must have already existed at that point. Unfortunately the documents attesting its existence mention it in the context of conflict and a siege that was going there 820 year ago.\n\nMy knowledge of modern languages would be pretty useless as they would have changed enough to make communication difficult.\n\nI had some Latin in school, but forgot most of it. It might be enough though to communicate with some locals who know Latin in much of Europe at the time.\n\nThere is a non-zero chance that I would cough on the first person I meet and start a plague.\n\nThere is also a good chance that I would die son after arrival simply from exposure to the elements and diseases.\n\nI might even die after being attacked by wildlife if I landed in the wrong place. Extinct creatures like Aurochs were still a thing in parts of the world at that time.",
   "created_utc": 1693385678,
   "score": 2,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycoc4e",
   "message": "Flee from Christian crusaders. Saving my pagan spirit. Staying the fuck away from Europe and France. Get to Scotland",
   "created_utc": 1693387262,
   "score": 5,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycpklm",
   "message": "I'll sleep again hoping that I wake up in my fuckin' bedroom. Who wants to live in a year where there's no Internet!!",
   "created_utc": 1693388202,
   "score": 2,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycrryk",
   "message": "Kill a mammoth and have a BBQ. Punch a saber tooth cat in the jaw. Wait for the showdown between me and the giant cave bear that’s about to occur.",
   "created_utc": 1693389870,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydcwl8",
   "message": "[deleted]",
   "created_utc": 1693401409,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycjd2d",
   "message": "It all depends which country I would find myself. Is it Europe? If yes, I’d stay away from churches for sure.",
   "created_utc": 1693383303,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycnxdm",
   "message": "I'd get burned at the stake for being witch. Or tar and feathered. Or drowned. Or what ever they were doing to women at the time.",
   "created_utc": 1693386948,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycj5dx",
   "message": "Start picking cotton",
   "created_utc": 1693383131,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyckwkl",
   "message": "P-put my dick in it.",
   "created_utc": 1693384537,
   "score": 253,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd2157",
   "message": "Get up, and then search out every descendant of the tRump family lineage and wipe them all from existence on this planet!",
   "created_utc": 1693396283,
   "score": 0,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycjn6e",
   "message": "I'd probably hide, people back then most likely will not sit well with my non White skin color",
   "created_utc": 1693383532,
   "score": 0,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyco329",
   "message": "in a field were? because if its in a field up in Canadá well there is not much you can do but live until you die but if its in a fild in england or france  spain then i would become rich very quick",
   "created_utc": 1693387070,
   "score": 0,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycj83x",
   "message": "I must see the castles, and study as much as i can",
   "created_utc": 1693383191,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycjjjp",
   "message": "Hide for a while and write down everything I can remember about history, so I’m somewhat prepared for the outside world.  Also, keep a weapon on me and seek out soap.",
   "created_utc": 1693383449,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycmptl",
   "message": "Eat a turkey leg and a pint of ale!",
   "created_utc": 1693385997,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycno8n",
   "message": "Like, hit a tree for timber, build a shack, start digging for iron so I can make a sword.",
   "created_utc": 1693386750,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycofqb",
   "message": "Find a wooded area to hide in. Survive in seclusion as long as I could by convincing anyone who crosses my path that I am a frightening, powerful supernatural being worth avoiding. Die a violent death, likely at the hands of a mob.",
   "created_utc": 1693387339,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycorw8",
   "message": "Go back to sleep and hope I wake up back home.",
   "created_utc": 1693387598,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycpmn3",
   "message": "whip out my iphone to make a tiktok , then get burned alive for being a witch",
   "created_utc": 1693388245,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycqen8",
   "message": "Man id look for comfy place to die because the mongols are running all over the place disease and shit",
   "created_utc": 1693388840,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycs875",
   "message": "self-inflicted expiration ASAP.",
   "created_utc": 1693390201,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyct7ui",
   "message": "Cry",
   "created_utc": 1693390906,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyctc11",
   "message": "Grab whatever i can find resembling a weapon of some sort.",
   "created_utc": 1693390986,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycvuld",
   "message": "[\"Alright you Primitive Screwheads, listen up! You see this? This.. is my BOOMSTICK! The twelve-gauge double-barreled Remington. S-Mart's top of the line. You can find this in the sporting goods department. That's right, this sweet baby was made in Grand Rapids, Michigan. Retails for about a hundred and nine, ninety five. It's got a walnut stock, cobalt blue steel, and a hair trigger. That's right. Shop smart. Shop S-Mart. You got that?\"](https://youtu.be/pFriRcIwqNU?si=0hAeXVOQWjjmPMkQ)",
   "created_utc": 1693392710,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycvwdx",
   "message": "Hide",
   "created_utc": 1693392742,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycvx1l",
   "message": "Well you would be in alot of problems! Apart from the dieseae!  Even if you speak English in England you wouldnt understand them or they you lol.  French, German etc all don’t sound the same in the year 1200.",
   "created_utc": 1693392755,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycxk7z",
   "message": "Honestly probably terrify people with how much bigger I am than them.  Then male my way to France as I feel I have a better chance than England lol.",
   "created_utc": 1693393785,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycxsb5",
   "message": "Become the church's accountant.",
   "created_utc": 1693393919,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jycyyy5",
   "message": "Start counting the seconds until I die from a disease or bacteria that I have no immunity to. I'd give it a week, but would probably be killed for being a witch because I insisted on washing my hands or amusing myself by arranging tree leaves in a shape irresistible to cats who would fight over who sat inside the leaf square next.",
   "created_utc": 1693394614,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyczczj",
   "message": "invent bitcoin and become a billionare",
   "created_utc": 1693394835,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyczqeo",
   "message": "Check my phone for signal strength.",
   "created_utc": 1693395044,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd0opg",
   "message": "Immediately contract a disease that had been eradicated by 2023.",
   "created_utc": 1693395570,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd1iaj",
   "message": "Depends, is my mind a blank slate or did I retained all of the information I know now and carry that back in time with me?! \n\nRisky though - start predicting things you know are going to happen and now all of a sudden you’re a witch and on fire or some shit 🤷🏽‍♂️",
   "created_utc": 1693396010,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd2pae",
   "message": "BC or AD?",
   "created_utc": 1693396628,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd3032",
   "message": "Off a cliff I go, not integrating into that life and I’m not sure I want to get some painful death for simply existing.",
   "created_utc": 1693396785,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd324z",
   "message": "I'll make and sell foods from the year 2023 😂",
   "created_utc": 1693396815,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd35bx",
   "message": "Be roughly one foot taller than the average peasant, prosper.",
   "created_utc": 1693396862,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd3i3b",
   "message": "Use my medical knowledge to integrate myself as a healer and hope a wealthy man takes interest. \n\nI'd take care to not get pregnant and hopefully, I'll live a long life to 60 in relative peace.",
   "created_utc": 1693397042,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd3u3d",
   "message": "First of all, fart and take a piss.",
   "created_utc": 1693397207,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd3vqh",
   "message": "I’d get sturdy and be burned for witchcraft",
   "created_utc": 1693397230,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd3wzs",
   "message": "Probably collect some filth and argue with the king about how he exploits the people.",
   "created_utc": 1693397247,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd41yo",
   "message": "I would ask where the fuck i was",
   "created_utc": 1693397317,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd44oe",
   "message": "If i woke up in a field in my hometown try to get to a nearby town asap and discover the silver and atleast be wealthy if i cant go back",
   "created_utc": 1693397355,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd48dp",
   "message": "I’d lay down to die",
   "created_utc": 1693397405,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd4b19",
   "message": "join the crusades out of boredom and then die an agonizing diarhea related death, so....same as everyone else was already doing when I got there",
   "created_utc": 1693397441,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd4rd8",
   "message": "Look for Doc",
   "created_utc": 1693397666,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd4smi",
   "message": "If I’m in the US, my best chance of survival is probably finding natives and acting as non-threatening as possible. If I’m lucky, I think I could live among them for a good few years.",
   "created_utc": 1693397684,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd51n7",
   "message": "Probably die because the spoken English would be completely unrecognizable and I wouldn’t know what anyone was saying nor they know what I was saying.",
   "created_utc": 1693397808,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd6tfk",
   "message": "Depends on the field. If it's a field lost in the wilderness, it's unlikely I'll realize I'm in 1200, so I would just assume I got drunk the night before.\n\nIf it's a field next to a city, I would probably freak out and assume everyone speaks French.",
   "created_utc": 1693398659,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd6z2c",
   "message": "Die of typhus in a week.",
   "created_utc": 1693398735,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd82sv",
   "message": "Look for the Time Machine.",
   "created_utc": 1693399254,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd8ges",
   "message": "Desperately try to remember the formula for black powder.",
   "created_utc": 1693399428,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd8uw4",
   "message": "the same thing I do every time when I first wake up,\n\nscratch my balls.",
   "created_utc": 1693399613,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd9jvd",
   "message": "Invent the lightbulb",
   "created_utc": 1693399927,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd9k36",
   "message": "How would I know what year it is?",
   "created_utc": 1693399930,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyd9nhk",
   "message": "Depends where and if anything came with me. Regardless, the outcome is probably die unless my phone is in my pocket in which case I can fuck around for a few hours and then die.",
   "created_utc": 1693399972,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyda2sf",
   "message": "That would be an interesting rust wipe prim pvp story",
   "created_utc": 1693400163,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyda7cb",
   "message": "Try to at least kidnap myself a girlfriend. Finally no social rules, no police, no cameras, no Eva AI chatbots to dsitract me, but lots of girls, quite traditionally submissive.",
   "created_utc": 1693400221,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydawfb",
   "message": "Buy Bitcoin",
   "created_utc": 1693400540,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydb8of",
   "message": "Die in around 12 hours.  \n\n\nDamn you, misfunctioning pancreas!",
   "created_utc": 1693400690,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydbknl",
   "message": "Find cow poop and start flipping it looking for white mold. Got to make penicillin as quick as I can so I don't speed run death.",
   "created_utc": 1693400835,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydc417",
   "message": "Woke",
   "created_utc": 1693401070,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydc71m",
   "message": "Roll over and go the fuck back to sleep [12:00 is way too early for me]",
   "created_utc": 1693401106,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyddfok",
   "message": "In 1200, where I live now was only inhabited by Indigenous Peoples who would have never seen a white person. I would not speak their language. I'd be dead upon first contact.\n\nSo I'd just accept my fate, hide, try to make it to nightfall, and observe the night sky without light pollution.",
   "created_utc": 1693401632,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyddldy",
   "message": "Buy Amazon stock",
   "created_utc": 1693401696,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyddy3g",
   "message": "Go back to sleep and see if I can push it back another 800 years.",
   "created_utc": 1693401841,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyde0zq",
   "message": "be extremely fucking happy.",
   "created_utc": 1693401875,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jyde9vr",
   "message": "Kind of depends on where it is, if it’s in England, meet up with my ancestors and convince them I am a descendant, live the easy life. If it’s in Scotland, do the same thing, but with haggis. \nAt that time period I had Royal English and Scottish ancestors.",
   "created_utc": 1693401976,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydeyuf",
   "message": "Hm. Gunpowder is already invented, right? Or if not I would, I know the three ingredients, just not the ratios.  I would introduce the king to rifled cannons and rifled... rifles - I am not sure how it is done, but I think with a bit of experimentation I could figure out.  Or just rocket-shaped cannon balls with unevenly spaced fins for a spin. \n\nThen maybe a hand-cranked Gatling gun.\n\nHot air ballons for war reconissaince. \n\nBody building, train the kings troops into Arnolds. \n\nGerm theory of disease, basic hygiene, midwives washing hands with soap.",
   "created_utc": 1693402260,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydf5ns",
   "message": "Staying the fuck out of China.",
   "created_utc": 1693402338,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydfqqd",
   "message": "Pick up a sword",
   "created_utc": 1693402577,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydfqsm",
   "message": "Sneeze and accidentally kill 1/3rd of the world with a super version of the common cold that I am immune to, because of 800 years of adaptation, while those around me are vulnerable.\n\nEffectively the same thing as what happened at my grandmother's old age home, when a douche turd refused to wear a mask because of his rights and killed multiple people.",
   "created_utc": 1693402577,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydfrhk",
   "message": "Buy some bitcoin",
   "created_utc": 1693402585,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydg0g4",
   "message": "Pretend to be a male.",
   "created_utc": 1693402686,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydhyu4",
   "message": "Head to Sherwood Forest and rob the rich",
   "created_utc": 1693403486,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydi3sh",
   "message": "Crank one out",
   "created_utc": 1693403541,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydiioq",
   "message": "Well it heavily depends I speak latin and Chinese so I could probably communicate albeit not well. I would then write out a bunch of specific prophecies and give them to one guy I like so his line can become rich. May also try to be friends with the kings",
   "created_utc": 1693403709,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydiurt",
   "message": "Freak the fuck out",
   "created_utc": 1693403843,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydjj7e",
   "message": "Re-establish the Byzantine empire.",
   "created_utc": 1693404113,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydjrue",
   "message": "Buy Apple stock",
   "created_utc": 1693404207,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydk2ot",
   "message": "Taller than 6 feet and over 40 years old? I’ll be burned as a witch.",
   "created_utc": 1693404328,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydk71y",
   "message": "Try to make my case that even though I don’t speak their language, I’m willing to and try and learn it. Then try to apply our modern knowledge through first principles. I’ll keep trying various disciplines until I find one that I could derive from scratch off the top of my head.\n\nI probably can’t invent most things without googling first, so I would explore and talk to the experts and intellectuals of the day until something jogs my memory and I figure some shit out.",
   "created_utc": 1693404375,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydkbyv",
   "message": "are we talking my whole life was the dream of some year 1200 farmer, or me as i am now is time transported into the  year 1200",
   "created_utc": 1693404428,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydkqju",
   "message": "Invent antibiotics really quickly.",
   "created_utc": 1693404589,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydkrwz",
   "message": "Die in a couple hours",
   "created_utc": 1693404603,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydkvl3",
   "message": "“You ain’t got Jack Shit and Jack just left town”",
   "created_utc": 1693404643,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydkxrt",
   "message": "I'm an older woman, I speak a weird language and am dressed oddly. Clearly I'm a witch.",
   "created_utc": 1693404668,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydlotk",
   "message": "My genes shall span the earth.",
   "created_utc": 1693404957,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydmao7",
   "message": "Run from either Ghengis Khan or the Aztecs.  Or probably be preparing to die from cholera.",
   "created_utc": 1693405191,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydmtvt",
   "message": "Run to my ancestors home",
   "created_utc": 1693405393,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydnmm4",
   "message": "Die of diabetes",
   "created_utc": 1693405699,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydnqln",
   "message": "Hours upon hours of playing Age of Empires finally pay off!",
   "created_utc": 1693405741,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydny3l",
   "message": "Contract cholera, dysentery, bubonic plague, every type of tick, and yellow fever within the week",
   "created_utc": 1693405820,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydo0ph",
   "message": "Probably kill a lot of people with all the contagious germs I'd have that the people then had never been exposed to before dying myself from being a modern guy in a far more primitive world.",
   "created_utc": 1693405847,
   "score": 1,
   "submission_id": "1658j7b"
  },
  {
   "comment_id": "jydol6r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1658j7b"
  }
 ]
}