{
 "submission_id": "165dmgq",
 "title": "What horrible thing happened to you as a kid and you didn’t realise the severity of it until you got older?",
 "selftext": "",
 "created_utc": 1693399247,
 "permalink": "/r/AskReddit/comments/165dmgq/what_horrible_thing_happened_to_you_as_a_kid_and/",
 "score": 58,
 "url": "https://www.reddit.com/r/AskReddit/comments/165dmgq/what_horrible_thing_happened_to_you_as_a_kid_and/",
 "comments": [
  {
   "comment_id": "jydrhjz",
   "message": "What my mum meant when she planned to drive us to heaven. She was talking about wanting to drive us into a lake.",
   "created_utc": 1693407148,
   "score": 125,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydsb6t",
   "message": "I was 4 years old and my night time routine was always telling my mom and dad how much I loved them. One night, I couldn't find my mom to tell her goodnight. I searched everywhere in the house, backyard, etc. \n\nFinally, 4 year old me goes out the front door, looks around and sees a person standing in the middle of a crowded street with cars zooming by and swerving around them. I started walking down the sidewalk to get a better look because I thought it was the weirdest thing. Turns out it was my mom, but what was weird is she wasn't answering to my calls. I started getting really scared because my mom was blind (and had only gone blind in the past several months). I ran back to the house and got dad because I was too afraid to go in the street to get her. \n\nWasn't until many years later that I realized I had witnessed my mom attempting suicide via getting hit by a car. She was severely depressed due to having gone blind at the age of 34 with two small kids. \n\nMakes me sad to think about sometimes. She's better now, but still unfortunately blind.",
   "created_utc": 1693407454,
   "score": 68,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jyddyx4",
   "message": "Mom took me along when she was buying drugs.  Took me 30 years to realize waiting at a gas station at 6 am on a Saturday wasn’t a thing, and neither was driving WAY into the ghetto and having her friend drive around the block with us.  Turns out not everyone sleeps on their laundry and goes right to bed when they get home EVERY DAY either.",
   "created_utc": 1693401851,
   "score": 30,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydox78",
   "message": "Our babysitter died while she was watching us when my twin and I were 3. We had no concept of death, and tried to wake her up. \n\nShe had spilled water when she fell, and I still remember getting a dish towel to wipe it up, thinking she would be proud of how responsible I was being. \n\nI remember going to get our little toy pots and pans to bang together to make noise to wake her up, we had no idea what a heart attack was.",
   "created_utc": 1693406191,
   "score": 117,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydlkbb",
   "message": "I lived in the countryside in a farming town. Alongside the road my family lived on was a small concrete ditch. It was visible for about half the road and then went underground the rest of the road until it flowed out into a large canal at the end. \n\nI was a really thin and small kid. When I was about 9 or so my sister and I and some of her friends were playing in the small ditch to cool off. My sister thought it would be interesting to see if I could fit into the pipe that led underground. So my 12 year old sister and her friends held me by my arms and lowered me into the pipe until my hips were in. I could feel the rushing water pulling me in. I yelled at them to bring me back out. They did and then we left. \n\nI didn’t tell anyone about it for years and when I finally did they looked horrified. So yeah if my sister had lost her grip, I would have gone underground and likely gotten stuck and drowned.",
   "created_utc": 1693404909,
   "score": 159,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jyds1p0",
   "message": "My mom used to whoop my ass really bad whenever i did the slightest thing wrong. I was genuinely afraid of doing literally anything.\n\nAs a kid i didn't like taking baths because my mom wouldn't stop telling me everytime that i stank and that i was a pig, that i was reeking of cunt and that i was completely gross and unhygienic, and also because the shower was too loud for me. I thought i would drown: the sound was too overwhelming in my ears when i had to wash my hair, so i was crying really bad, telling my mom that she was going to drown me. She slapped my mouth so i could shut up and stop moving, but she slapped me so hard that my mouth was bleeding. I couldn't do anything more besides bowing down my head, crying in silence as i was internally panicking because of the sound of water, while seeing my blood flowing through the shower drain.\n\nIt was so normal for me to be beaten up and also the typical \"wait till we get home and you'll see\" and getting beat the shit out of me for talking when i shouldn't, that it was really weird for me when i'd go to friend's houses and seeing their moms talking to them with respect and not slapping them.\n\n\"Huh? Her mom doesn't... slap her or scream at her? Why? Is it because i'm here? My mom also slaps me in secret so if If i'm not here she will definitely slap her, yeah\"\n\nMy father was more gentle but they were divorced and would visit us once every couple of weeks. I would call him and he was soo gentle and caring at washing my hair, like he was afraid of hurting me if he used more force, on contrary of my mom.",
   "created_utc": 1693407357,
   "score": 161,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydq1xc",
   "message": "Having a 'cluttered house' and needing to spend a few hours carrying everything from the living room into my bedroom to make the living room appropriate for guests. I would sob and beg for it not to go into my room because I knew it would never leave, and the living room would get filled again with TJmaxx bags and garbage we don't need. Turned out a hoarded house isn't normal and it made me a pretty awful roommate to my friends in my teen years.",
   "created_utc": 1693406618,
   "score": 237,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydbk2t",
   "message": "It took me almost 25 years to realise that alcoholic parents aren't normal and other people have it different.",
   "created_utc": 1693400828,
   "score": 176,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydq525",
   "message": "Not to me, but there was a family of kids that were being severely abused by their mother and nobody did anything. As children we obviously saw adults do nothing and thought it wasn't serious. One of them ended up drinking caustic soda when he was 12 in an attempt to kill himself. Looking back I see that nobody protected those kids. Every adult failed them.",
   "created_utc": 1693406651,
   "score": 112,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydh51x",
   "message": "The teacher not letting me use the toilets in elementary school and peeing my pants under the desk, than getting yelled at by same teacher",
   "created_utc": 1693403149,
   "score": 194,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydoud5",
   "message": "Adopted, step dad punished me by forcing me to watch them shoot my dog. I was told he was going to do it about 10 hours beforehand and he made me dig a hole out in our pasture. Evening comes and he drags her out there, absolutely oblivious as to what is going to happen. He threatened to shoot me when I refused to go out there with him, so what could I do. He I tried looking away but he told me I'd have to watch or I'd get it too. So he held his rifle up to her head and pulled the trigger once, then a second time after she hit the ground. I then spent the next hour pulling her body into the hole I had dug and buried her. She was a great dane, just over a year old. I was 11. Parents got the dog but then passed the responsibility of her onto me because they were \"too busy\" to take care of her. I'm 17 now but that shit still fucks me up. I got outta there a few years ago and was shocked that nobody else could relate to what I went through.\n\nEdit: This all occured about 6 years ago. I appreciate the kind comments I have recieved. I always thought it was my fault and that I should have done differently. I do not live with them, or near them, anymore. I live with my grandparents who are disgusted by how I was treated.",
   "created_utc": 1693406162,
   "score": 110,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydj7mg",
   "message": "Living in an environment with addicts. Having your head on a swivel and things going from zero to 100 in .5 seconds is not normal. As a teenager I turned to alcohol to cope and that was the only tool in my toolbox for most of my adulthood - did not realize the severity of how bad I had got until I was in my 30's.",
   "created_utc": 1693403985,
   "score": 225,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydokz1",
   "message": "About a year after my father was murdered, my cousin and I were sexually molested by an older relative every time she babysat us. There's pictures and videos of me and her still being circulated by pedophiles over 30 years later.\n\nI didn't realize how badly it fucked me up until I was in my 20s. It seemed so stupid to even be concerned about it after watching my dad die. I was 4 or almost 5 when she got arrested, and to me it was just another shitty week.\n\nEdit - For everyone asking how I know the pictures are still out there, I got subpoenaed to identify myself once in my early 20s. They had old physical photos and digital copies on a hard drive and in a private email server, and as anyone knows once it's on the internet, it's out there forever. I signed some paperwork and wrote a short statement so anytime photos of me show up again, I wouldn't have to testify.",
   "created_utc": 1693406062,
   "score": 170,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydk2gq",
   "message": "My father urinated on my head once. I was outside and he was on the porch 2 stories up. It was dismissed as \"he thought it was my mother.\" Like that would have somehow made it okay.",
   "created_utc": 1693404326,
   "score": 163,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydncyw",
   "message": "How much my mother used to F me up, physically and verbally. She can't physically anymore today, but boy oh boy does she still have that sword of a tongue... And will never, ever, ever admit to it. Ever. Crazy.",
   "created_utc": 1693405597,
   "score": 246,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydn65c",
   "message": "Getting almost no guidance. It felt like freedom when I was a kid, but once I left home I realized it left me very unprepared to face the real world.",
   "created_utc": 1693405524,
   "score": 22,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydsps4",
   "message": "My mum divorced her my step dad when i was around 7 and 6 weeks later she was moving into her new partners house ( up the street from our house )  we had a dog that i've had since i was tiny,  and her new partner had a dog, they didn't get on.   \nso my mum left the dog in the now abandoned house alone.   \n\n\ni remember using my pocket money and stealing money to get dog food, steal the keys and feed her.  i vividly remember the smell of the house. and how much weight and fur she'd lost.   \nthis was for about 2 weeks and i was the only one who tried to help her aged 7.   \n\n\nmy dad visited and i told him and he was horrified and we took her to a rescue that day. \n\nnow when i see anything to do with a stray or abused animal i'll have a full breakdown",
   "created_utc": 1693407605,
   "score": 44,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydiqkv",
   "message": "My mom once highlighted my report card and wrote \"this is what failure looks like\" and put it on the fridge because I got a C",
   "created_utc": 1693403798,
   "score": 42,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydo7pq",
   "message": "An assistant football coach used to bully me a lot during practice (6th grade). One day, I looked right at him and told him to \"shut up.\" He was so offended that a child said that to him that he just decked me, full force. I lost consciousness and came-to on my back staring up at the sun. I never told anyone about it and now, in my 30s, I replay this event very frequently...it causes me great anxiety.",
   "created_utc": 1693405921,
   "score": 78,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydqhks",
   "message": "I was brought up in a cult",
   "created_utc": 1693406778,
   "score": 83,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydkfdq",
   "message": "The emotional abuse my mom subjected me to. A lot of people had it worse , but it seriously fucked me me up. It affects me every day.",
   "created_utc": 1693404466,
   "score": 44,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jyddrhn",
   "message": "knew it was bad, but not how much it affected me (a short list)\n\ngetting injured by a knife from my dad (who didn't even realize he cut my hand in his delirium)\n\nstopping my dad from swallowing the 2nd pack of sleeping pills and forcing him to throw up some and the whole hospital ordeal, my mother arrived home only the day after\n\nbeing \"taught\" to be manly and never cry, and having the punches only stop once i stop crying\n\n\u0026amp;#x200B;\n\nsomething that i disliked but only after some time realized how bad it truly was: being forced to eat rotten/insect infested food bc we couldn't afford proper food (regular alcohol, drugs and $8 a pack cigarettes were affordable though)",
   "created_utc": 1693401766,
   "score": 138,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydhf59",
   "message": "My mom asked me to type up a list on the computer so she could track which doctors prescribed her which medications.\n\nDr. Smith prescribed the Xanax; Dr. Lopez prescribed the Klonopin, Dr. Johnson prescribed the Valium, Dr. Chang prescribed the Ativan, ...",
   "created_utc": 1693403265,
   "score": 215,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydqwya",
   "message": "I lost my sister to brain cancer at 7 years old. Parents shut down after and never were able to go back to healthy people.\n\nLot more to the story than that, but this situation being the majority of my childhood. I didn’t realize how fucking awful it all was until I was an adult and out of the house. \n\nKinda like a frog in boiling water, I had no idea how rough my situation was.",
   "created_utc": 1693406936,
   "score": 158,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydl4zz",
   "message": " How unreliable and emotionally neglectful my parents were, I thought it was normal to only see them on the weekends and to not trust them to show up when you needed them to. In my head, all parents did was work and be “vague authority figures” that I didn’t actually know.",
   "created_utc": 1693404744,
   "score": 191,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydm1yy",
   "message": "after reading these comments, maybe I didn't have it so bad after all.\n\nmy thoughts are with all of ya'll.",
   "created_utc": 1693405100,
   "score": 206,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydnwau",
   "message": "As a little kid learning how to swim in YMCA, didn't know it was wrong for old naked men touching/stroking their dicks, smiling and gesturing at me while showering before and after getting into the pool. My Mom would be waiting outside for me and never thought much of it until later after I learned about different types of sexual abuse.",
   "created_utc": 1693405801,
   "score": 146,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydqe5j",
   "message": "In 4th grade a bunch of 6th graders, after torturing it, threw a cat from high up and it landed right in front of me and died. I was never quite the same since then and it took until early adulthood to realize certain aspects about myself are because of that event.",
   "created_utc": 1693406744,
   "score": 190,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydif40",
   "message": "Both of my parents were too burned out from their own childhood trauma to be functional and loving parents. For the most part they did their best to provide for me and my siblings..... But there is no love in my development. I am incapable of forming meaningful human attachments.\n\nEdit. Thanks for all the interest everybody. It helps to know we're not alone in this. You've given me some great suggestions and stoked my interest in continuing therapy. Let's all be part of the solution and love our children the way we should have been. Good luck my friends!!!!!",
   "created_utc": 1693403669,
   "score": 99,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jyd9i2k",
   "message": "My mother is borderline personality. Everything was horrible. As a kid, you think it’s totally normal. When you reflect on your childhood as an adult, you realize it was child abuse.",
   "created_utc": 1693399904,
   "score": 16,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydp4gr",
   "message": "Bullying, it made me socially awkward that's a disadvantage now",
   "created_utc": 1693406269,
   "score": 241,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydov7n",
   "message": "Watched my dad try to kill himself more than once and threatened it more times than I could count. I spent countless nights believing I was going to wake up to him dead, this very much changed my perception of death.",
   "created_utc": 1693406171,
   "score": 141,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydvunf",
   "message": "In Elementary school, I won 1st place in a Halloween costume contest. Finally, all those kids who teased me for looking like a girl would see that I was awesome! My parents helped me make my Cat in the Hat costume for like a week. Just recently saw pictures - wicked cute.\n\nSchool principal called me up on stage and announced, as the first place winner, I got to choose any of the prizes from the girls' table. I had won best costume for the girls as a 7 year-old boy who was already teased for being girly. From this day forward, teasing turned to beatings. \n\nThe moment of looking out at all of the whole school, as well as the parents (mine, too), and more and thinking \"see, I'm a winner!\" as they all laughed at my confusion has caused damage I'm still undoing 40 years later.",
   "created_utc": 1693408778,
   "score": 146,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydbiny",
   "message": "Brooklyn NYC, 1981\n\nMy parents had an argument in the kitchen. My mom had been drinking and for some reason decides to open the drawer and pull out two massive knives and bangs them on the kitchen counter to prove her point. My dad reckoned she lunged at him. \n\nWhatever it was, my dad lost his shit and fucked her up. 5 year old me at the just froze in the living room chair. He went to jail, she went to hospital, I went to the neighbors.",
   "created_utc": 1693400811,
   "score": 83,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydte8r",
   "message": "When I was a toddler, we lived in rural Texas. My mom put me down for a nap in my crib one afternoon, and went to take a nap herself. Apparently she told my older brothers to keep an eye on me, and since they thought I was asleep in my crib they all put a movie on in the living room. I couldn’t sleep, and somehow got the idea in my head that I wanted to go get the mail. I walked past my brothers watching their movie and right out the front door, and then walked about a hundred yards down our gravel driveway to our mailbox on the edge of a county road. Just about everyone had outdoor dogs in the area, and let them roam freely.  Some were friendly, and many were not.  There was a particularly giant Weimaraner named Buckwheat that belonged to a neighbor who met me about halfway down my driveway to walk with me.  Apparently when I got to the county road where our mailbox was, he got on the “street” side of me and stood and blocked me to the curb as several cars/farm trucks whizzed past.  A man returning from work saw me out there by myself with a huge dog and pulled over.  He said when he got close, the dog got defensive and started pushing me away from the road again as his car approached.  The man pulled up and asked me where I lived, and offered to give me a ride home.  I didn’t know not to get in the car with strangers but thankfully in this case it was a good guy.  He knocked on the door of my house and woke my mom up from her nap.  Told her that he had found me barefoot in the road, where I had a dog guardian angel that was actively protecting me from traffic, and it was thanks to that dog that I was still alive.  Here’s to you, Buckwheat.",
   "created_utc": 1693407860,
   "score": 208,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydnx1f",
   "message": "sexual abuse , i only realised in my early 20's",
   "created_utc": 1693405809,
   "score": 93,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jyd8lks",
   "message": "I thought being raped was normal until I was 20 😕",
   "created_utc": 1693399495,
   "score": 163,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydqamz",
   "message": "I was sexually assaulted as a teenager. The experience didn’t sit right with me at the time. It wasn’t until about 6 weeks ago that I realized the gravity of what happened to me. I can’t even begin to express how hard processing it all has been.",
   "created_utc": 1693406708,
   "score": 158,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jye8sn8",
   "message": "My mom barely fed us when my dad was out of town. She only let me shower once every two weeks. She would tear my clothes off and lock me outside. She would randomly pull over, drag me out of the car by my hair and leave me to walk home, even if it was miles away and no safe way to get there. She would pull my hair until I fell on the ground and then kick me in my back until I wet my pants, when I was a teenager. I never had enough clothes and getting underwear and a bra was always difficult. \n\nI thought I was a bad kid and deserved everything she did, until I grew up and my dad got early onset Alzheimer's. I saw her do all the same awful things to him and I couldn't stop it. I reported her to adult protective services several times and asked her neighbors to report anything they saw as well. She cried and told APS her kids refused to help and she was overwhelmed, so they got free respite care several days a week. She would make the caregiver scrub the floor on her hands and knees instead of helping my dad. Finally dad fell down and hit his head, in the exact spot in the house where she always used to knock me down, and had to go to a certain hospital because it was the only level one trauma center in the area. I went in the middle of the night and told the ICU nurses about the abuse and neglect. I told the social worker at the hospital how my mom liked to withhold necessities because she liked seeing people \"offer up their suffering to the lord.\" The hospital refused to discharge him back to his house, and he spent the rest of his life in various facilities. My mom had a pattern of getting kicked out of the facility and then moving him to a different one, where she would bully the staff and interfere with my dad's meds and feeding tube until they figured her out and kicked her out.\n\nAfter my dad died, she tried to find another old person to care for, even offering to be a free caregiver. She wants to move my sibling into her house, because my sibling is severely disabled after several strokes. She insists she can get sibling walking again, if sibling can't get any food unless they walk to the kitchen.",
   "created_utc": 1693413447,
   "score": 112,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydqp20",
   "message": "Wasn't until I was 20 that I realized you're older brother forcibly touching your penis isn't OK. Neither is your mom waiting 2 hours to take you to the er for a dislocated jaw (thanks to the older brother) because she was \"enjoying the quite\" isn't normal.",
   "created_utc": 1693406856,
   "score": 231,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydp9cm",
   "message": "I once brought home a bad test result from school and my mother took a pen to write „doof“ (stupid in german) on my forehead and them made me get in the car to drive to dads office, so she could show him. I was about 8/9 years old.",
   "created_utc": 1693406320,
   "score": 39,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydn394",
   "message": "My half sister tried to drown me twice when I was little. It took me into my late teens to trust women again and still have a phobia of water deeper then 2ft. No, my parents didnt try to help. She waited till those little lapses of being watched.",
   "created_utc": 1693405493,
   "score": 194,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydpyu2",
   "message": "Raised by single mom. She emotionally dumped all her problems on me starting as far back as I can remember (5? 6? Years old). Def screwed me up as an adult.",
   "created_utc": 1693406586,
   "score": 188,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydo63v",
   "message": "I had an elementary 2nd grade teacher who wouldn’t let me use the bathroom in any circumstances. I would be in distress begging that I be allowed to go to the bathroom. Needless to say there were multiple instances where I’d pee myself in front of the entire class and I’d have to go through the rest of the day without having a pair of dry pants on. So being abused in anyway as a kid when I think about it now is obviously not ok in any situation",
   "created_utc": 1693405904,
   "score": 77,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydyodd",
   "message": "When I was 7 years old I was outside playing with my friends. An older boy who was a bully in the neighborhood walked by and started saying racist things to them. The boy and I are white and my friends are black. I didn’t understand what he was saying was racist and to be honest at the time I didn’t even fully understand the concept of race. I didn’t think of my friends as any different from me. I did know that he was making them upset so I told him to leave them alone. He called me a “wannabe” and a “n***** lover” I had never heard the n word before but I knew I was being insulted. There happened to be a big stick lying next to me on the ground so I picked it up and whacked him across the face with it. He started crying and ran to his house. I went back to playing with my friends like it was nothing. \n\nAbout 20 minutes later the boys came back with his uncle. The uncle called me over and told me I needed to be put in my place. He then made me stand there while the boy slapped me across my face. He told him to do it harder again and again. The uncle was really angry that I wasn’t crying. I really wanted to, because it did hurt but was always told to never cry in front of the person who made you cry. Anyway, I’m not sure how long this went on for. At some point the boy started asking his uncle if he could stop. The uncle said fine and told me that if I had more white friends I would become a nicer girl that knew how to act.\n\nI never told anyone and kind of felt like maybe I deserved it for hitting the boy with a stick. And it wasn’t until I was much older that I understood everything that happened.",
   "created_utc": 1693409811,
   "score": 0,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydntg6",
   "message": "My friend and I were Groomed/persuaded by an adult man on the internet to send inappropriate pictures. We were 11.",
   "created_utc": 1693405771,
   "score": 89,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydv10d",
   "message": "I was in summer camp and had made friends with the weird girl there. We were probably both around 7 or 8, both awkward kids who weren't good at making friends but we got along with each other. She had a very perverted sense of humor and was constantly talking about everyone's genitals. Didn't think much of it at the time.\n\nOnce she was sitting in a chair at a table and I snuck up behind her as a joke and grabbed the back of her chair and shook it to startle her. She was laughing and yelled at me to stop it. So I stopped it. She asked why I stopped. I told her she'd just asked me to stop so I did. She said that her dad told her that if a girl says stop it means do it harder. She wanted me to shake it harder. So I did.\n\nNow that's a memory that got lost in my brain for years collecting dust, but thinking back on summer camp one day and remembering that made me think wait... what the FUCK? I mean I hope my assumptions are wrong, but it really seems obvious what was happening to her at home. How did an adult there never notice all the signs?",
   "created_utc": 1693408473,
   "score": 75,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydks01",
   "message": "Not a horrible thing but a very near miss.\n\nIn the 3rd grade, I accidentally got off at the wrong bus stop coming home from school. I grew up in a rural area so stops were usually miles apart on this county road with long dirt driveways leading to each property. \n\nOnce I realized I was at the end of the wrong dirt road, I had no idea what to do and started crying until a stranger in a truck pulled off the road to see what was up. Me, then an 8 yo girl, blindly trusted this stranger and got into his truck with no witnesses and nobody knowing where I was. \n\nThat could've been it for me but I got lucky and he just drove me to the police station. I can't imagine what my life might be like if the wrong person had found me first that day.",
   "created_utc": 1693404604,
   "score": 1,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydpchr",
   "message": "Being lured into a man-made pond by a group of kids then abandoned when I was 7. My leg got stuck in the mud and I was chest deep in filthy water. Then there were the times I went to what turned out to be drug buys by my brother. I just waited in the car in these rural-ass areas (in the mid-‘80s) while he bought and did crank.   Lots of shit.",
   "created_utc": 1693406352,
   "score": 148,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jyehylz",
   "message": "i was having really bad depression and suicidal ideation at the age of eleven. my parents took me to see a child psychologist and they sat in the first session. i guess they didn’t like what i had to say cause my dad yelled at me on the way home and threatened to flip over the car since i wanted to die so bad. he kept saying things like “you ungrateful child” and “you made us seem like bad parents” and “why don’t i flip over the car since you’re bored and making things up” and the whole time my mom was looking back at me and laughing, like she thought of it as a joke. 24 now, and due to the economy being so bad, still staying at home. but once i move out, i’ll never speak to them again, as the problems just got worse after that. why would they say that to their eleven year old?",
   "created_utc": 1693416660,
   "score": 69,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydbnuu",
   "message": "Cops followed me home and pointed guns at me \n“Told me I looked like a criminal” showed me a photo of some random guy who looked nothing like me",
   "created_utc": 1693400874,
   "score": 25,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydq9q6",
   "message": "Molestation-but what's worse than the things he did to me imo is the way he messed with my mind. That shit still is hard to feel like it wasn't my fault",
   "created_utc": 1693406699,
   "score": 56,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydqxeo",
   "message": "Being sheltered. Literally destroys your social life, mental health, and ability to properly do things as a person. Lost all of my good friends because of it and practically have no social life/ motive as of now yet it's my fault. Even to this day, it's still a bitch to do the simplest things and I see it being like that for a long while.",
   "created_utc": 1693406941,
   "score": 27,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydpkdr",
   "message": "Mentally ill parents, narcissistic. Extremely charismatic, center of attention, creative artistic intellectual types, attracted a very interesting eclectic variety of friends, had parties and lots of social life for themselves. But us kids? We were just objects there for them to abuse. We suffered terrible abuse because of their need to put us down in every possible way, tell us we were morons, ridicule everything we did and said, ridiculed how we looked and make us extremely self-conscious of our bodies. Basically made us learn not to trust ourselves in any way, destroying our confidence. I am the only one of four who was able to have a measure of normal success in life because I was the favored one(which was just my role in the family-gotta have one kid you train to be on your side against the rest so you have one who will do what you need when you’re old.) This destroyed my siblings lives, and also ruined mine because I was trained to submit to them. We all escaped at age 18. All had to make bad decisions or rely on the help of friends to survive. I moved in with an older man who seemed like a gentle person, and years later my mother pushed us to get married. Yes, I do blame her because she never cared about me, only she wanted one of her kids to get married and have grandchildren to continue the farce that we were a normal family. And I was trained by them to not trust myself, so I married him ignoring the warning signs that I really didn’t understand at all because all I was ever taught to do was to not trust my instincts and that I am the one who must be wrong. I eventually figured out he is a life long drug addict. But I worked through it and made a nice family for my parents to enjoy. Had to leave my husband when the kids were little and do all this on my own. I did an amazing job and have 3 wonderful adult children. Dad died 9 years ago, and I finally cut my mother and sister off completely, no contact, one year ago. Best thing I ever did for myself. Just sorry I didn’t do it sooner. I finally have my life.",
   "created_utc": 1693406436,
   "score": 147,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydqgqa",
   "message": "I didn't have it easy, so here's a big TW. \n\nSA, for one thing, I was too young to understand. \n\nBeing beaten and forced to stand in one place for hours apon hours at a time. Sometimes up to 6-7 hours. \n\nHair pulling and yanking for nothing. \n\nBeing dragged out of bed and beaten. \n\nNail scars on my legs and body. \n\nWorking like a dog to just ask to simply do something fun like stay over at a friend's house, only to be beaten and made stand for hours on end AGAIN after already being degraded and yelled at. \n\nBeing insulted for any intelligence I may have while also being beaten if I mess up anything, even if it was the first time with no idea what I was doing and had absolutely no direction on how to accomplish said task. \n\nAny illness was a guaranteed beating.  It didn’t matter if you were sick with a 102 fever... suck it up butter cup. \n\nWorking until I fainted from heat exhaustion. \n\nYou know, the usual.\n\nEdit: A sentence error regarding grammar.",
   "created_utc": 1693406770,
   "score": 102,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jydntx4",
   "message": "I was molested by deacons in our church. I didn’t know until a teen that it wasn’t normal.",
   "created_utc": 1693405776,
   "score": 183,
   "submission_id": "165dmgq"
  },
  {
   "comment_id": "jyfnic1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165dmgq"
  }
 ]
}