{
 "submission_id": "165dsat",
 "title": "What is the worst excuse you've heard from someone who cheated?",
 "selftext": "",
 "created_utc": 1693399660,
 "permalink": "/r/AskReddit/comments/165dsat/what_is_the_worst_excuse_youve_heard_from_someone/",
 "score": 101,
 "url": "https://www.reddit.com/r/AskReddit/comments/165dsat/what_is_the_worst_excuse_youve_heard_from_someone/",
 "comments": [
  {
   "comment_id": "jydbstp",
   "message": "My ex was very into astrology. She cheated and later blamed the great American eclipse of August 2017.",
   "created_utc": 1693400934,
   "score": 249,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydf7s8",
   "message": "\"It was the anniversary of my cousin's death and I wasn't in my right mind. You know how upset I was. Blaming me is classic victim blaming. You should be COMFORTING me!\"\n\nThis was AFTER I offered to stay with her for the night but she said she wanted to be alone.",
   "created_utc": 1693402362,
   "score": 63,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyd96aq",
   "message": "Not me, but my cousin's bf told her \"it doesn't count if it's with another dude because you're *supposed* to experiment in college. It's not my fault you're too prudish to try it.\"",
   "created_utc": 1693399756,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyd9ev9",
   "message": "“You should’ve let me try anal. You’re holding me back.”",
   "created_utc": 1693399864,
   "score": 211,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydc4y1",
   "message": "When they get caught, they try to play the \"humans aren't meant to be monogamous\" card. I'm like \"if you don't believe in monogamy, why did you even marry in the first place only to cheat later? You could join a free love hippies commune at any time. But that's not what you did.\"",
   "created_utc": 1693401080,
   "score": 179,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydcb5i",
   "message": "“Kissing is like holding hands, so it’s not cheating, friends sometimes hold each other’s hands. Maybe if I were doing it with lots of guys everyday, but that was a two times thing! Also, it was only a blowjob, it’s not like we slept with each other, that would be cheating”",
   "created_utc": 1693401155,
   "score": 24,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydbviv",
   "message": "“I didn’t even enjoy it because I was thinking about you the whole time and I felt terrible.”",
   "created_utc": 1693400966,
   "score": 238,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydbtt3",
   "message": "\"My wife was pregnant, so I wasn't getting any.\"",
   "created_utc": 1693400946,
   "score": 183,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydevyf",
   "message": "\"It doesn't count if they're family.\"\n\nI'm in a small town in the Deep South. I wish I was making this up for internet points.",
   "created_utc": 1693402227,
   "score": 7,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydh4nt",
   "message": "My previous partner told me that he cheated because he insisted that he “thought I was going to break up with him anyways” so he started seeing other women. \n\nI believe this was just another one of his manipulation tactics to put the blame on ME for his actions. To this day I can not fathom the mental gymnastics he had to do to justify his decisions... Lol.",
   "created_utc": 1693403145,
   "score": 96,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydc183",
   "message": "“It’s not like it meant anything.” Oh good, glad we cleared that up.",
   "created_utc": 1693401036,
   "score": 127,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydlfvz",
   "message": "\"You were at the hospital for 2 weeks. A man has needs.\"",
   "created_utc": 1693404862,
   "score": 84,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydc269",
   "message": "Bestie was in the hospital having emergency surgery. Her family told her then-bf Sam, he never responded or showed. Cheated on her with a hoe from highschool, claiming “Well she didn’t answer for 2 days!!” Yeah because she was nearly dead, fuck you Sam",
   "created_utc": 1693401047,
   "score": 138,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydbwjr",
   "message": "“I’m just on tinder to confirm that there’s nothing better out there. It helps me appreciate you more.”",
   "created_utc": 1693400978,
   "score": 111,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydc403",
   "message": "\"A dick has no conscience.\"\n\nMy late brother-in-law used that one. I used to think \"Yeah, but the dick its attached to is supposed to.\"",
   "created_utc": 1693401069,
   "score": 117,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydk03v",
   "message": "My ex wife played the rape card after I found out she was meeting a dude in a hotel room. Complete bull shit, obviously and I knew this. My MIL started harassing me telling me it was my fault for being a shit husband.\n\nThe sad part is I didn't find out about her affairs until TWO WEEKS AFTER we learned we were expecting.\n\nI was clapped in family court. I have no relationship with my 8 year old daughter despite thousands of dollars spent and hundreds of attempts to see her. I even took her back to court and was clapped all over again.",
   "created_utc": 1693404299,
   "score": 132,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydbsxj",
   "message": "\"You work too much\"",
   "created_utc": 1693400935,
   "score": 74,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydf820",
   "message": "My ex brother in law cheated on my sister while she had cancer and was in the hospital…he said he wasn’t getting enough attention.",
   "created_utc": 1693402365,
   "score": 73,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydbxqq",
   "message": "College roommate would cheat on his girlfriend a few times a semester, then feel awful about it and realize how much he loved his girlfriend.\n\nHe started to rationalize that \"you need to cheat to stay faithful.\"",
   "created_utc": 1693400993,
   "score": 51,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydi836",
   "message": "“I just have a flirty personality!”",
   "created_utc": 1693403589,
   "score": 19,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydib1o",
   "message": "“I care about him a lot, and you were going out of town. He and I just click.”\n\nA secret 2-3month relationship with her coworker. She’s so obsessed with him she throws it in my face when we argue about the divorce we are seeking.",
   "created_utc": 1693403623,
   "score": 21,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydj7uz",
   "message": "\"I was bored.\" \n\nOur baby was 8 weeks old.",
   "created_utc": 1693403988,
   "score": 57,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydltja",
   "message": "Guy said someone accidentally gave him a blow job.",
   "created_utc": 1693405009,
   "score": 20,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydeqvy",
   "message": "\"We were having a great time hanging out and she brought me Skittles!\"",
   "created_utc": 1693402170,
   "score": 48,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydjybk",
   "message": "my last bf said he cheated because he thought i had already cheated. i did not cheat on him. he felt like an assface when he realized i didnt. he lowkey still thinks i did 🤦🏽‍♀️",
   "created_utc": 1693404279,
   "score": 19,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydb2bq",
   "message": "Every single one of my exes cheated on me.\n\nEvery single one of them said I was the perfect boyfriend/husband, and that I did nothing wrong and have nothing to change. (Even well after we broke up)\n\nI fucking hate this. Because if the problem is with me, then fucking tell me so that I can work on it! If the problem is with me, then there's something I can do about it.\n\n1 person cheats on me, then they're the asshole. Every single one of them? Then obviously I'm doing something wrong. Tell me what the fuck it is so I can change it and don't have to go through this bullshit again!\n\n\nSo the answer the question, the worst excuse is being told multiple times that they have no excuse.",
   "created_utc": 1693400612,
   "score": 75,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydcc94",
   "message": "I said to a woman once, I'm married and she said, \"that's ok, I'm married too\"",
   "created_utc": 1693401168,
   "score": 46,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydhcdf",
   "message": "\"You don't understand my culture very well\" via *email* no less lol.  I'm sure the US army soldier had an encyclopedic knowledge of her culture versus me who had been working extensively with locals for years.  At least say something like \"He's more attractive\" or \"makes more money\" so I can say, \"Yeah fair enough.\" instead of blaming me.",
   "created_utc": 1693403232,
   "score": 13,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydow7i",
   "message": "\" Im a man, i have needs , it's what men do \" ( while ugly crying )  \n\" Her friend died !! \" cheated on me with his ex ( he kept changing the person who supposably died \" )",
   "created_utc": 1693406181,
   "score": 13,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydl9jv",
   "message": "\"This is normal in relationships.  It's just something you have to deal with.\"\n\nNo.  No it's not.",
   "created_utc": 1693404793,
   "score": 41,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydkn7n",
   "message": "\"He reminded me of you\"",
   "created_utc": 1693404552,
   "score": 14,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyddloz",
   "message": "\"I was drunk.\"\n\n\"You were in jail.\"\n\n\"We were on a break.\"\n\n\"She took advantage of me.\"\n\n\"You already agreed to have a threesome with her.\"\n\n\"You were never around.\"\n\nThese are all excuses I've heard from friends and acquaintances and one from a partner.",
   "created_utc": 1693401699,
   "score": 30,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydj0pa",
   "message": "I didn’t think you’d find out.",
   "created_utc": 1693403909,
   "score": 28,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydlpqm",
   "message": "\"If you pay for it, it doesn't count\".\n\nI've literally heard this one from my cousin's husband.  He told her.",
   "created_utc": 1693404967,
   "score": 33,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydktje",
   "message": "After reading the rest of the entries mine doesn't even look *that* bad 😅\n\"Babe you are overreacting like she does not matter\"",
   "created_utc": 1693404621,
   "score": 13,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydmt0e",
   "message": "\"I was tired from lack of sleep, you don't know what mindset that puts you in\"\n\nNot my relationships, but I've heard variations of that excuse from 4 girls/women who've cheated on their partners",
   "created_utc": 1693405384,
   "score": 14,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydp8ha",
   "message": "An ex of mine back when I was 19 said \"I kind of maybe sort of got raped\". Turns out she just cheated on me, and a partner of a friend of hers threatened to tell me so she decided to feed me this bullshit first.",
   "created_utc": 1693406311,
   "score": 15,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydmm2f",
   "message": "Dennis Rodman when caught in the act by Carmen, “she just fell from the ceiling”.",
   "created_utc": 1693405310,
   "score": 12,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydehs8",
   "message": "\"I thought I would feel bad, but then I didn't.\"\n\nWhen she was telling me that she cheated on me with eight guys in a single month.",
   "created_utc": 1693402066,
   "score": 23,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydhbsw",
   "message": "\"You were never around\"..the fuck does that mean? I worked mornings and you worked nights. So you fucked your managers because we had conflicting schedules? They paid attention to me! Yeah, because word got out you like to fuck other guys!",
   "created_utc": 1693403226,
   "score": 28,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydlna2",
   "message": "Second ex-wife - \"My best friend dared me to do it\"",
   "created_utc": 1693404940,
   "score": 24,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydm53x",
   "message": "A friend of mine cheated on her husband (apparently only made out with the other guy) and justified it by saying that it was the same thing as me (single girl) going on a date with someone (single guy) and kissing him, *except that she’s married*.",
   "created_utc": 1693405132,
   "score": 24,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydew6q",
   "message": "He needed to know that what he had with me \"was real.\" In his opinion I should have been happy that he realized he wanted to choose me.",
   "created_utc": 1693402230,
   "score": 12,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydf1gj",
   "message": "a friend of mine.\n\n\"my wife cheated on me so I figure I can cheat on her until I feel that we're even.\"",
   "created_utc": 1693402290,
   "score": 11,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydkx8t",
   "message": "It's just sex what's your problem? these were her actual words...",
   "created_utc": 1693404662,
   "score": 11,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydeqky",
   "message": "I tripped and fell in between her skirt",
   "created_utc": 1693402167,
   "score": 10,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydlk8g",
   "message": "Because I was attractive and gave them a lot of compliments/made them feel good about themselves. This gave them the confidence to pursue other attractive women (while we were still dating).",
   "created_utc": 1693404908,
   "score": 11,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydlm39",
   "message": "It didn't mean anything and I always come back to you. \n\nDo one.",
   "created_utc": 1693404928,
   "score": 10,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydca4p",
   "message": "\"Everybody cheats.\"\n\nNo, no they don't. If they do, they are shitty.",
   "created_utc": 1693401143,
   "score": 37,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydc77p",
   "message": "I (25f) was married for 6 years and caught my husband cheating his response \"i got nothing\". That was it.",
   "created_utc": 1693401108,
   "score": 22,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyddag5",
   "message": "'pussy needs change' she litteraly told me that after I found out she was already seeing someone else for several years.",
   "created_utc": 1693401571,
   "score": 18,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydg8t9",
   "message": "One morning I went to brush my teeth and my toothbrush was wet... I found that odd, so I asked my girlfriend if she used the blue toothbrush, she said “yeah” all casual. I said that the pink toothbrush was hers and she played it off like she didn’t know. I suddenly realized that we had been using the same toothbrush for a few weeks and it kind of grossed me out. That started a very small argument. I went to work as did she, but she didn’t come home that night. The next morning I called her out and she admitted that she slept with another guy that didn’t think she was gross.",
   "created_utc": 1693402783,
   "score": 20,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydenh2",
   "message": "Did I do that?",
   "created_utc": 1693402130,
   "score": 10,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydntpt",
   "message": "I have never had two girls interested in me at the same time, I didn't know what to do! Dude was 25. That's pretty sad.",
   "created_utc": 1693405774,
   "score": 10,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydfnyk",
   "message": "\"She has nothing to do with my affairs\"\n\nCome on, she's not an Eva AI sexting chatbot, she does.",
   "created_utc": 1693402545,
   "score": 7,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydimcm",
   "message": "“I did it because I love you.” Lmfao",
   "created_utc": 1693403750,
   "score": 8,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydlr15",
   "message": "My ex apparently cheated because she \"was convinced\" I was going to shag my colleague.\n\nThis is despite the fact I've never cheated, never given her reason to think I'd cheat, and this colleague in question is more than 20 years younger than me.\n\nIt was also my fault she cheated because she wasn't happy.",
   "created_utc": 1693404981,
   "score": 9,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyds0zz",
   "message": "I had one cheat because he said my breasts were too big and another cheated because they were too small.\nCan't win.",
   "created_utc": 1693407349,
   "score": 8,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyelydw",
   "message": "\"You are always working!\"\n\n- Unemployed woman to a man working two jobs.",
   "created_utc": 1693418064,
   "score": 7,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydgkae",
   "message": "“We were in an open relationship. I’m sorry if you were confused about that.” The rest of the restaurant also heard that excuse.",
   "created_utc": 1693402913,
   "score": 22,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydj2uq",
   "message": "\"Men are wired by biology to sow their seeds broadly.\"",
   "created_utc": 1693403932,
   "score": 20,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydsid3",
   "message": "Ex did not give an excuse for having a threesome with my workmate and his gf.\n\nMy boss said it’s just sex get over it.\n\nFast forward 2 years, he flat out accused his loyal wife of cheating as she fell pregnant and he had had a vasectomy. Turns out not all vasectomy’s are equal.",
   "created_utc": 1693407528,
   "score": 7,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydc61w",
   "message": "Someone once told me, \"It doesn't count if its in a different zip code.\" And I noped right the heck out.\n\nA, S.O. I had once told me, \"Well I wouldn't have cheated if you were around.\" When I was on a two week pre planned trip. And he couldn't see why I'd break up with him over it.",
   "created_utc": 1693401094,
   "score": 13,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydd9uy",
   "message": "A friend in college cheated on his girlfriend because she told him he had to stop eating pop tarts to lose weight, and he didn't know how to break up with her. When she found out, he straight up told her to her face he couldn't give up pop tarts. I wish that was a lie, those things are high as fuck in calories.",
   "created_utc": 1693401564,
   "score": 13,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydffw0",
   "message": "Literally any excuse is the worst excuse",
   "created_utc": 1693402453,
   "score": 29,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydhq24",
   "message": "My ex cheated on me because I didn't tell him I loved him (we had been together 5 months or so at that point). Dick.",
   "created_utc": 1693403387,
   "score": 6,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydlbgy",
   "message": "“I don’t want to talk about it”. So, like, no excuse offered",
   "created_utc": 1693404814,
   "score": 17,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyd933u",
   "message": "I didn't do it on purpose/mean to.",
   "created_utc": 1693399717,
   "score": 21,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydi1m5",
   "message": "ALL excuses are the worst. You want to sleep with someone else while in a relationship? Then it’s a sign you’ve checked out. End the relationship instead of choosing to be a trash human.",
   "created_utc": 1693403516,
   "score": 19,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydi577",
   "message": "This was a pretty lame attempt at gaslighting me to start with. “How dare you insult my integrity”. Of course she couldn’t keep her pants on at work and we all know how this ended. Cheaters gonna cheat and liars ain’t got no integrity.",
   "created_utc": 1693403557,
   "score": 9,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydloq6",
   "message": "I didn't press the turbo button",
   "created_utc": 1693404956,
   "score": 6,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydm2bi",
   "message": "It's not my fault 😂",
   "created_utc": 1693405103,
   "score": 5,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydo9h8",
   "message": "\"It was an accident...\"",
   "created_utc": 1693405940,
   "score": 5,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydobfa",
   "message": "\"[The act was] a tiny little transgressive thrill.\"",
   "created_utc": 1693405960,
   "score": 5,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydr65h",
   "message": "Not sure if this had anything to do with cheating, but the funniest thing I’ve ever heard was this dude yell, “babe, the reason I can’t get a job is because you’re such a psycho” during a super white trash domestic dispute on the sidewalk outside my apartment. They were both in their underwear too for some reason.",
   "created_utc": 1693407030,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydrtff",
   "message": "I didn't mean to! is one of the worst excuses I've heard...like you literally have a choice!",
   "created_utc": 1693407270,
   "score": 5,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydbuq8",
   "message": "Ex girlfriend cheated when I fell asleep. . . said \"since I wasn't responding, she assumed I was doing the same, so she cheated.\" wack",
   "created_utc": 1693400957,
   "score": 10,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydochu",
   "message": "Slipped, fell, landed on his dick",
   "created_utc": 1693405972,
   "score": 8,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydi5pl",
   "message": "\"Didn't happen\"",
   "created_utc": 1693403563,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydrqx7",
   "message": "“I knew my heart and my heart was true. There was no conflict in my heart as to who I love.”\n\nRight, so as long as you don’t love her I should be okay with it then!",
   "created_utc": 1693407245,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydshgd",
   "message": "I tripped and it just slipped in!",
   "created_utc": 1693407519,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydteri",
   "message": "But babe, she said that she had a better body than you do. I was making sure.",
   "created_utc": 1693407865,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydx0gr",
   "message": "My fiance/wife is pregnant 🤰.",
   "created_utc": 1693409204,
   "score": 5,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jye9u84",
   "message": "I wasn’t having attention from my spouse",
   "created_utc": 1693413810,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyehdip",
   "message": "Excuse? What excuse? They were just straight denial, admittance with apology, and/or didn't find out officially til they were gone",
   "created_utc": 1693416455,
   "score": 4,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyemfy4",
   "message": "\"I'm not attracted to you anymore. But I still want to be in a relationship with you......\"",
   "created_utc": 1693418231,
   "score": 5,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydpdl1",
   "message": "my ex, when we just started dating, asked me if she could supposedly date her ex for benefits, I replied that I don’t mind, but without excessive intimacy on his part, as a result, then I find out from her that they kissed and her excuse was that he got in there himself, and what do you think, I continued to meet with her and we met for half a year. It was terrible",
   "created_utc": 1693406365,
   "score": 3,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jydslnh",
   "message": "There was a girl on here.\nThat her husband cheated because she didn't wear lingerie anymore.\n2 days after marriage.",
   "created_utc": 1693407561,
   "score": 3,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyegk6o",
   "message": "I once had an ex tell me and I quote, “I fell on her and my dick just slipped in.” 🤦🏼‍♀️ He legit saw nothing wrong with what happened.",
   "created_utc": 1693416169,
   "score": 3,
   "submission_id": "165dsat"
  },
  {
   "comment_id": "jyebs6i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165dsat"
  }
 ]
}