{
 "submission_id": "165eyz4",
 "title": "If mass shooters in the USA stopped killing in neighborhoods of the 99% and only did mass shootings in the 1% neighborhoods, how fast do you think gun reform would happen ? If you think no change would happen , why ?",
 "selftext": "",
 "created_utc": 1693402608,
 "permalink": "/r/AskReddit/comments/165eyz4/if_mass_shooters_in_the_usa_stopped_killing_in/",
 "score": 201,
 "url": "https://www.reddit.com/r/AskReddit/comments/165eyz4/if_mass_shooters_in_the_usa_stopped_killing_in/",
 "comments": [
  {
   "comment_id": "jydlk45",
   "message": "They would just hire private security",
   "created_utc": 1693404907,
   "score": 112,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydodfl",
   "message": "Realistically, the posh neighbourhoods would employ armed private guards and that would be it.\n\nThe 1 % live an undisturbed life even in high-violence countries such as Mexico and South Africa.",
   "created_utc": 1693405982,
   "score": 52,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydk7lf",
   "message": "The median household income in Sandy Hook is about 60% higher than CT as a whole and almost double that of the US.\n\nJust sayin’.",
   "created_utc": 1693404380,
   "score": 9,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydi2pj",
   "message": "No change would happen.  A mass shooter literally shot up a Congressional softball game.  Those are rich people who have the power to make laws.  Nothing changed.",
   "created_utc": 1693403528,
   "score": 211,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydt6nv",
   "message": "As we saw with the recent shooter in Jacksonville. The mere appearance of security is enough to dissuade these cowards. He chickened out of shooting up his actual target because campus PD scared him off. \n\nAny genuine attack on the one percent will only serve to loosen the regulations on private security. Instead of taking gun rights from crazys, they'll give more gun rights to the rich. \n\nPrivate security will be less accountable than police.",
   "created_utc": 1693407780,
   "score": 29,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydqf4j",
   "message": "God damn dude. Pretty much your entire profile is soapboxy reddit obsessed things. Go touch some grass.",
   "created_utc": 1693406754,
   "score": 75,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydovv5",
   "message": "OP wanted that hot topic karma , without thinking the question through",
   "created_utc": 1693406177,
   "score": 47,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyebaxl",
   "message": "Lmao - You think the armed security of the 1% isn't going to stop a shooter?",
   "created_utc": 1693414318,
   "score": 15,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jye1r0f",
   "message": "Rhetorical question.  \nThese shootings don't happen in \"poor\" places as opposed to \"rich\" places. They happen in places where the victims are unable or highly unlikely to fight back.\n\nThe rich have plenty of private security who are more than capable of fighting back.",
   "created_utc": 1693410927,
   "score": 50,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydsrr5",
   "message": "Tell me you live in an echo chamber without showing me your most active subreddits.\n\nBut seriously, has anyone else noticed how common it is for people to think that the only possible reason others might disagree with them is because the rich elite are all apathetic psychopaths conspiring to brainwash the common man?\n\nThen they turn around and mock others for believing in absurd conspiracy theories.\n\nRule of thumb, if the theory involves any of the following:\n\n1. Attributes to maliciousness what can be attributed to ignorance, or to either what can be attributed to a belief you don't understand\n\n2. Would be more advantageous in the short term to expose than to keep quiet about\n\n3. Requires people who gain nothing from keeping the secret, to keep the secret\n\n4. Would require fundamental differences in outlook, behaviour, or moral character between groups of people\n\n5. Requires any non trivial amount of logistical support and complete secrecy at the same time\n\nThen it's probably an absurd conspiracy theory.\n\n\nThere's probably more, but I can't think of any off the top of my head.",
   "created_utc": 1693407625,
   "score": 158,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydtch2",
   "message": "This might be the dumbest question I’ve seen on here",
   "created_utc": 1693407842,
   "score": 96,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydu3rh",
   "message": "I hate to break it to you, but the people who want to disarm us already have private security and their own firearms.",
   "created_utc": 1693408126,
   "score": 179,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydlwx4",
   "message": "It wouldn’t.  They would hire private security and the shooters that tried will be dead after the first two or so.  That’s my prediction anyway.",
   "created_utc": 1693405045,
   "score": 30,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydm7si",
   "message": "You want the 1% who abuse their power and take advantage of the average joe to reform gun laws for you? Lol",
   "created_utc": 1693405161,
   "score": 129,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydtjvc",
   "message": "I don't think it would happen. They would just gun up and security up and get more cops to get illegal firearms off the street. Bigger punishments for gun crimes in those neighborhoods.\n\nThe same thing was said when there were more black gun owners. \"Wait until black people own guns, then they will want gun control.\" There are more black gun owners than ever, and the people that are pro-2A are still pro-2A.",
   "created_utc": 1693407919,
   "score": 16,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydpq9j",
   "message": "what kind of stupid question is this",
   "created_utc": 1693406497,
   "score": 121,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydrgzr",
   "message": "The overwhelming majority of mass shootings are gang related and committed with illegal hand guns",
   "created_utc": 1693407142,
   "score": 170,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydxfrg",
   "message": "Rich people - even rich liberals who push for gun control - own guns.",
   "created_utc": 1693409359,
   "score": 35,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydovvk",
   "message": "Nothing would be reformed. The \"1%\" can afford armed security, some already have it. They're going to win over any mass shooters.",
   "created_utc": 1693406177,
   "score": 12,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyefati",
   "message": "Plenty of them happen in affluent neighborhoods. Downtown Las Vegas, Downtown Miami, and Sandy Hook come to mind. Sandy Hook median income is $184,184.\n\nThe vast majority of gun violence is not mass shootings, and a majority of overall gun deaths are by suicide. Mass shootings are headline-grabbing, but the real effort should (and for the most part is) go into policing and mental health help.",
   "created_utc": 1693415728,
   "score": 5,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyevrwl",
   "message": "What in the world is a 1% neighborhood?\n\nMass shootings always dominates the media coverage, however they represent only a small minority of shooting incidents. One could ban and confiscate every gun registered and nothing would change, or, one could do as the Swiss... where there are no mass shooting as they have learned to respect each other. \n\nMore people die from obesity in the US than from gun violence yet all the rich Liberals owning media encourages it all, encouraging people into accepting obesity, being obese and unhealthy, also to act hideous and disgusting beyond belief!",
   "created_utc": 1693421536,
   "score": 5,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydtr3s",
   "message": "Mass shootings remain very very rare, much like terrorist attacks you’re missing the trees for the forest.",
   "created_utc": 1693407994,
   "score": 20,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyee6lv",
   "message": "Nothing would happen, and it's just as well nothing happens.  This never really goes over very well on reddit but it's not as big an issue as it can appear.  That's not saying it's not important or those lives affected don't matter, it is important and those lives absolutely matter,  but it doesn't have a very large impact on the nation as a whole.  If you took all the violent crime offenders, their victims, the immediate family and social circles of both parties, and added them all up, annually we're looking at less than 2% of the nation's population.  Yes, that's absolutely a LOT of people, there's not denying that.  But we focus all our energy on that and completely ignore things that affect everyone.\n\nThis year the government put a lot of effort into banning pistol braces, for example, as a means of gun control.  The argument is that pistol braces actually make pistols short barrel rifles and short barrel rifles are so much more dangerous than pistols or standard rifles that just being in the same room as one can cause you to get hit with heavy financially devastating fines and prison time...unless you paid the ATF $200, then they're fine.  Tremendous energy was put into this, and also into fighting it, all on the premise that guns kill \u0026lt;40k people annually in the US.\n\nWhile at the same public schools are being gutted, infrastructure is becoming derelict, and affordable healthcare is only for the extremely wealthy or the extremely poor...we're worried about guns while the things that make people turn guns on others are neglected.",
   "created_utc": 1693415330,
   "score": 21,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydga5n",
   "message": "This isn't the argument for gun law reform that you think it is, OP. Why do the ultra wealthy never see mass shootings? It might have something to do with their highly armed and trained bodyguards and security teams, just a teenie weenie bit.",
   "created_utc": 1693402798,
   "score": 95,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydvlw3",
   "message": "[deleted]",
   "created_utc": 1693408689,
   "score": 9,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyefmlx",
   "message": "Simple fact remains grand majority of people will go through their lives never going through a mass shooting, and you'll probably find one person out there who's witnessed and survived through 7 of them.\n\nWhile change does tend to happen faster when influential people are the one pushing it, 1%ers don't live in \"neighborhoods.\" They live at estates where you couldn't even get to without checking with a security or live at top floor where the elevators don't even go up there and you need a special key to get permission to gain access to the floor.\n\nAlso people often mistake the overall count of how mass shootings is tallied as a statistics to specifically only refer to like mass shootings like Sandy Hook. But two corner gangs beefing over real estate shooting each other up with 3 bodies is also a mass shooting. And these, which are the more common type of mass shootings, aren't happening in affluent neighborhoods. They're only happening in poor neighborhoods due to NIMBY culture. And this is one of the major pillars of systemic racism.\n\nIn the past, wealthy people simply moved out which created zones of ghettos in formerly nice neighborhoods. People call it the white scare today. I'm betting the same applies here.\n\nSo I'm betting having mass shootings at affluent neighborhoods won't change gun control in the country, it'll just make the wealthy families move out and create new ghetto zones.",
   "created_utc": 1693415844,
   "score": 5,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydnsuo",
   "message": "It wouldn't. If a mass shooter tried something is a neighborhood of wealthy people, they'd be shot immediately by paid security and no one would get charged for self defense because rich people don't get charged for exercising their inalienable rights the way normal people do.",
   "created_utc": 1693405765,
   "score": 59,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydl35g",
   "message": "Not very. We will always have guns, it’s the 2nd amendment of the constitution. It’s about as set in stone as our freedom of speech.",
   "created_utc": 1693404725,
   "score": 33,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jye016b",
   "message": "I think you overestimate who the \"1%\" is.\n\n\u0026amp;#x200B;\n\nAlso fuck you.\n\n\u0026amp;#x200B;\n\nEdit: over under",
   "created_utc": 1693410308,
   "score": 23,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydzr2t",
   "message": "Generally speaking, the 1% does want gun control in pretty much any country.  One of the reasons we are allowed guns is so that the 99% can protect themselves against the 1%.",
   "created_utc": 1693410205,
   "score": 23,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydgzxd",
   "message": "America has even more knife crime than most developed countries. So it is not so much about guns but about the culture of violence.",
   "created_utc": 1693403093,
   "score": 65,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydwb25",
   "message": "It’s a moot point because crime tends to not happen in wealthy neighborhoods for other reasons",
   "created_utc": 1693408944,
   "score": 8,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydsxuq",
   "message": "If black people would stop killing each other it would reduce a majority of the murders.",
   "created_utc": 1693407688,
   "score": 27,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydvnj0",
   "message": "The 1% can afford to handle it without needing much reform. They can hire armed security guards to patrol the neighborhood. Nothing much other than massive media coverage feeling sorry for the rich guys in their mansions",
   "created_utc": 1693408705,
   "score": 4,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydy7fl",
   "message": "I don't think their armed security would let them through the perimeter.",
   "created_utc": 1693409640,
   "score": 4,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyehtii",
   "message": "Not at all.  The 1 percent are the ones pushing for gun control, the 99 percent are the reason its not passing lol.",
   "created_utc": 1693416611,
   "score": 4,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyews3g",
   "message": "Since mass shooters account for such a tiny number of shootings in the US, despite the publicity they're given, I doubt anything would change.\n\nAlso, define a 1% neighborhood. Aurora and Columbine were definitely 1% areas. The one that just happened in Nashville was in a private school. This shit happens everywhere.",
   "created_utc": 1693421892,
   "score": 5,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyfktff",
   "message": "Parkland, Sandy Hook Vegas, aren't exactly 99% neighborhoods. Which are the three most famous shootings of the past 20 years.",
   "created_utc": 1693430335,
   "score": 4,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jye0tya",
   "message": "Car crashes still happen by and to the 1% and they dont try change driving or alcohol laws. \n\nAlso, why blame the guns when its mentally challenged people who are committing the crimes? Maybe we need to focus on people instead.",
   "created_utc": 1693410598,
   "score": 12,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyechkh",
   "message": "As long as our 2nd amendment is in place, no",
   "created_utc": 1693414731,
   "score": 8,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydpoo1",
   "message": "So you’re advocating killing if it’s the “right people”?",
   "created_utc": 1693406480,
   "score": 35,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydsc1s",
   "message": "Mental health problem = shooting death problem",
   "created_utc": 1693407463,
   "score": 17,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydt97e",
   "message": "The issue is that the 1% (but more realistically - the  .01%) are convinced that they can always protect themselves with private security and private armies. \n\nA shooter wouldn’t make it into a gated community and wouldn’t make it anywhere close to the homes of the .01% \n\nThey think they are above the rabble. And functionally they are.",
   "created_utc": 1693407808,
   "score": 5,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jye1fve",
   "message": "I used to think if terrorists shot up kindergarten's instead of blowing up buildings if they could really make Americans live in fear.\n\nNow that we have had so many school shootings, I'm really not sure that would even work.\n\nIts sad that our country is growing immune from preventable tragedies.",
   "created_utc": 1693410817,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jye9q2c",
   "message": "The Mulford Act in 1967 was passed by Republicans (including Ronald Reagan) and supported by the NRA  in California because the Black Panthers started carrying firearms.",
   "created_utc": 1693413771,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyekmqf",
   "message": "Actually you wouldn't even need a shooting. When the Black Panthers peacefully portest at the CA State Capitol in 1967, Ronald Reagan was so freaked he and others made it illegal to open carry firearms. \n\nHe only flipped progun for his presidency",
   "created_utc": 1693417598,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyelfnd",
   "message": "1% neighborhoods are way less dense compared to 99% neighborhoods. More space, less people is not what mass shooters would be looking for. So, not sure this thought experiment works.",
   "created_utc": 1693417881,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyelw4k",
   "message": "Nothing happened after Sandy Hook so no. What happens is that police get bigger budgets, buy more military hardware and hire more dodgy personnel.",
   "created_utc": 1693418041,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyepleh",
   "message": "The 1% would move and/or get very mad at their local police departments whom they have paid for.",
   "created_utc": 1693419346,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyeqqtf",
   "message": "Gun reform? No. But there'd be a lot more police standing around in the 1% neighborhoods.",
   "created_utc": 1693419757,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyequup",
   "message": "None, 1% neighborhoods actually get police response",
   "created_utc": 1693419797,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyerseh",
   "message": "Eminem worded this very well a while back on Way I Am \n\n“So I point one back at 'em, but not the index or pinkie\nOr the ring or the thumb, it's the one you put up\nWhen you don't give a fuck, when you won't just put up\nWith the bullshit they pull, 'cause they full of shit too\nWhen a dude's getting bullied and shoots up his school\nAnd they blame it on Marilyn (on Marilyn)... and the heroin\nWhere were the parents at? And look where it's at\nMiddle America, now it's a tragedy\nNow it's so sad to see, an upper class city\nHaving this happening (this happening)”\n\nAlso a little bit on White America\n\n“See the problem is I speak to suburban kids\nWho otherwise would've never knew these words exist\nWhose moms probably would've never gave two squirts of piss\n'Til I created so much motherfuckin' turbulence”\n\nAlso later on in the same song \n\n“All I hear is lyrics, lyrics, constant controversy\nSponsors working 'round the clock to try to stop my concerts early\nSurely hip-hop was never a problem\nIn Harlem\nOnly in Boston\nAfter it bothered the fathers of daughters starting to blossom”",
   "created_utc": 1693420127,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyfgyg7",
   "message": "It’s crazy to me that you think the only thing needed to fix mass shootings is gun reform ? What about mental health and school security reform? It’s disgusting that people can be suffering and want to commute atrocities and they legit have no access to help. It’s also insane that anyone can just walk into some schools unannounced. At my high school if you wore a backpack you could get it the door no problem. \n\nAlso what mass shootings are happening in neighborhoods? It’s usually in large public spaces like schools, churches, concerts, etc. I’m not saying it’s never happened in a neighborhood but it certainly isn’t the number one target.\n\nI think you need to look a little deeper into this your post screams buzz words.",
   "created_utc": 1693428949,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyfiwaf",
   "message": "Criminals don’t follow laws.",
   "created_utc": 1693429640,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyfje1f",
   "message": "When the Black Panthers legally armed themselves in the late 60s/early ‘70s, laws changed. After government agents framed individuals and shut the organisation down, the laws were changed back again.",
   "created_utc": 1693429815,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyfjlma",
   "message": "The 1% might gasp for minute but imho, they aren’t gonna give much of a crap as they move to their other home in Barbados…",
   "created_utc": 1693429892,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyfkf7g",
   "message": "This is a very disrespectful question.  All lives are important in every way. \n\nFor your question you omitted:\n\n4th of July 2022 \nHighland Park, Illinois\n\nPlus conceal and carry has saved lives. \n\nFact: Criminals and those with intent to harm are already  disobeying laws.  Why would they pay attention to “gun reform”?\n\nThe better question: What can be done to help improve mental health and decrease crime?",
   "created_utc": 1693430191,
   "score": 3,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jyfo6m6",
   "message": "Mass shootings in gated communities would trigger gun reform so fast your head would spin. Doubly so if it was in a red state. Triply so if there was a notable person in the area. In no way do I want this to happen, just stating the obvious. I want mass shootings to end altogether.\n\nNow, the form that gun reform would take? Not what you think. They'd just get the government to pay for them to have armed PMCs in their hoods that pat people down, shoot at people and enforce strict no gun policies on regular folk going in and out, not on residents.",
   "created_utc": 1693431591,
   "score": 1,
   "submission_id": "165eyz4"
  },
  {
   "comment_id": "jydyv5p",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165eyz4"
  }
 ]
}