{
 "submission_id": "165jtzt",
 "title": "Citizens of the US would you ever immigrate outside of the states, where and why?",
 "selftext": "",
 "created_utc": 1693413830,
 "permalink": "/r/AskReddit/comments/165jtzt/citizens_of_the_us_would_you_ever_immigrate/",
 "score": 216,
 "url": "https://www.reddit.com/r/AskReddit/comments/165jtzt/citizens_of_the_us_would_you_ever_immigrate/",
 "comments": [
  {
   "comment_id": "jyehmc2",
   "message": "Why?  To stretch my retirement funds.  And to experience new places and culture.\n\nWhere?  Portugal,  small town in Italy, Spain.",
   "created_utc": 1693416540,
   "score": 167,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyennc5",
   "message": "Emigrate vs immigrate",
   "created_utc": 1693418656,
   "score": 95,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebn0b",
   "message": "As soon as I get a close to retirement I am heading to south/central America",
   "created_utc": 1693414435,
   "score": 162,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeg3oc",
   "message": "Dude I would move to pretty much any other developed, Western nation without any hesitation if I were offered an easy way to do it. There are a lot of things I love about America, but I'm so sick of its bullshit.",
   "created_utc": 1693416009,
   "score": 102,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeo0f5",
   "message": "Hate to be that guy (not really).... when you're leaving a place, it's emigration. A person who lives somewhere other than their place of birth has immigrated and can be referred to as an immigrant.",
   "created_utc": 1693418785,
   "score": 177,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeapna",
   "message": "Holland, it’s little USA. Western, civilized, a lot of social acceptance. A lot of  freedom and 98 percent understand the English language. Also, the government got your ass more covered when you are in trouble financially or health wise.",
   "created_utc": 1693414113,
   "score": 89,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeaaaf",
   "message": "Yes absolutely. Id go to Canada 🇨🇦.... the meanest Canadian I've met was nicer than any girl I've dated.",
   "created_utc": 1693413965,
   "score": 51,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebvw5",
   "message": "It depends on the situation. If I had to, I would. Otherwise I'm staying home 🤗 there are many places in the states I have yet to discover anyway! \n\nIf I were to relocate, I'm on my way to New Zealand baby!! It's a beautiful place with a low population. It seems to be a well organized, and peaceful place.",
   "created_utc": 1693414520,
   "score": 73,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeht99",
   "message": "I’ve worked in a number of countries for varying lengths of time (from two weeks to 5 months). \n\nI’ve learned that each country has its pros and cons but I would’ve been happy in a number of places.  \n\nWould I ever leave the US permanently?  If my SO was down with it, absolutely.  \n\nWhere would I go?   If I had a choice and a good job there, I love the Canadian Arctic region.",
   "created_utc": 1693416608,
   "score": 35,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyepckw",
   "message": "Have had my mind drift across the Canadian border every now and again, especially if things really turn bad for gay folk. My spouse who has a degree from one of their universities, and we're both professionals, so it's not as far-fetched as it might otherwise seem.",
   "created_utc": 1693419261,
   "score": 7,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebf0p",
   "message": "I'm ok here in the US. But if the stars aligned and the opportunity knocked, I would love to live in the Rhineland of Germany. Not in a city mind you, just, like, small village or town.",
   "created_utc": 1693414357,
   "score": 125,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeo97z",
   "message": "if anyone says the balkans or eastern europe, with respect, you should rather torture yourself to death",
   "created_utc": 1693418871,
   "score": 31,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf15m5",
   "message": "Nah. Whatever political leanings you may have, you can find a life in America that shields you from the politics you don't like. There are several very pro-choice states, states where you can bring guns everywhere, places where you live amongst whatever level (or lack) of diversity you find ideal. I live in Portland, OR and the far-right politics in the South don't really effect me at all.",
   "created_utc": 1693423458,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyea6qd",
   "message": "Man, fuck, I wish I was American\n\nYou guys dont know how lucky you are",
   "created_utc": 1693413931,
   "score": 126,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeh0ns",
   "message": "I love traveling and experiencing new cultures. After a week or two being away I get homesick. My home is East TN. I love where I am.",
   "created_utc": 1693416329,
   "score": 27,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeonce",
   "message": "Probably not. I've visited a lot of different regions of the world and the more I travel, the more I appreciate the overall experience of the United States. There are great aspects of every country I've visited. It's also a lot different vacationing in these countries and actually living in these countries. It's fun when you're in a little village in Italy(replace Italy with about any country) and the lights go out. \"Oh look at the stars!\". When the electricity going off 4 times a month for hours at a time and you have to go to work, it's not quite as majestic. The biggest advantage I like about the U.S. is its diversity of everything. If you don't like the way things are where you live, there is a good chance that moving a few miles away may make things totally different. Still don't like it, move to the next state instead. Hate the heat, move to Minnesota. Hate the cold, move to the south. Want a big house you can afford, we have LOTS of space with places where land is cheap. You want to live somewhere where everyone acts/looks just like you, we have that covered. You want to live somewhere that is the opposite, we have that as well.",
   "created_utc": 1693419012,
   "score": 73,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyej2dj",
   "message": "on reddit all you see is people talking bad about America. for me, since I've actually traveled outside the US and seen what other places are really like- the US is a good place to live.",
   "created_utc": 1693417050,
   "score": 72,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeavol",
   "message": "I would, but I don’t have a specific destination in mind and I’d have to return to see my family \n\nAnd I probably can’t afford it anyway",
   "created_utc": 1693414171,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyepco2",
   "message": "I'd like temps between -10 and 30C, arable land, and few biting ~~insects~~ pests... where go?",
   "created_utc": 1693419261,
   "score": 6,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyew7kf",
   "message": "We used to joke about flying off to New Zealand (around the time the Lord of the Rings movies came out). Every year the joking tone gets less and less.",
   "created_utc": 1693421690,
   "score": 12,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyefvif",
   "message": "Norway, because Norway",
   "created_utc": 1693415929,
   "score": 14,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyea5si",
   "message": "Yes. Fairly sizable list, but Ireland and Canada would be the easiest, all things considered. Having family in both helps. That being said, I am content here.",
   "created_utc": 1693413922,
   "score": 6,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeefom",
   "message": "Yes, working on that now. Montenegro, cost of living is much lower and it's gorgeous.",
   "created_utc": 1693415420,
   "score": 7,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyekbh0",
   "message": "Puerto Rico. It's beautiful and I still get US constitutional protections, they use the US dollar, and I don't have to fill out any paperwork.",
   "created_utc": 1693417489,
   "score": 7,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeq6ua",
   "message": "I probably wouldn’t move.\n\nDespite what the vocal minority on the internet wants everyone to believe, life for the strong majority of Americans is pretty great, and it is not the third world hellscape Reddit wants to paint it as.\n\nAs others have said, most everyone around for thousands of miles speaks the same language. The landscapes across the country are varied. It is relatively easier to find a job here (the severity of people not being able to find work or being passed up for nepotism is extremely exaggerated, especially on Reddit). Everyone is very open and nice to each other (another one that gets exaggerated to an extreme degree, the emotional ones are a loud minority and nobody likes them).\n\nOf course, the people pointing out the bad aren’t entirely wrong, there is a gun problem, and there are cases of people struggling to afford healthcare; but, and I’m probably going to get flack for this, again those issues have been exaggerated to an unfairly extreme degree. The country isn’t the Wild West where everyone is shooting each other (or in other words, you’re completely safe pretty much everywhere besides very specific areas of the country); and despite what the internet wants to paint the picture as, the strong majority across a wide range of income levels have zero problems affording their healthcare. Most of the “I rode 50 feet in an ambulance and they’re making me pay $50k” horror stories are flat bullshit where the person just posted their unadjusted (keyword) medical bill and called that the final total.\n\nThere’s still stuff to criticize the US for, but after traveling around in my 20’s, I’ve learned that the grass isn’t that much greener on the other side. Other countries have their issues too, and what I’ve learned is that they’re all pretty comparable.\n\nEdit: In case you plan on leaving a reply, I’m kinda just stating my piece and moving on. I’ve argued with redditors enough over the past decade, and to be honest, I don’t really care what you guys have to say anymore. Live in your bubble and I’ll live in mine I guess.",
   "created_utc": 1693419559,
   "score": 24,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyextq8",
   "message": "🇳🇴Norge🇳🇴",
   "created_utc": 1693422269,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf2beg",
   "message": "Yes and Ireland. Visited there in the year of our lord 2014, two years from the 100 year anniversary of the Irish revolution. We stayed in Dublin a few nights then rented a car from Dublin to Cork. Did the Ring of Kerry, kissed the Blarney Stone rock, went to the House of Waterford, and generally drove around to parts of Ireland just enamored with the people and the country side. \n\nWife has a lot of family from Ireland and I worked for a company that has offices there. Their economy is doing well as part of the EU, they’re progressive in their laws, and we had a lot of fun there. That may or may not be our retirement plans.",
   "created_utc": 1693423868,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf6hvt",
   "message": "Actually just had some of this discussion with my kids and their families a couple of days ago. We could all sell our houses and live like royalty in some other countries instead of struggling to feed ourselves here.",
   "created_utc": 1693425322,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyegqvu",
   "message": "Yes, and I have, to Japan. Opportunity and circumstances permitting, I’d certainly go back.",
   "created_utc": 1693416236,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyelu21",
   "message": "No, why would I?",
   "created_utc": 1693418021,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyefih8",
   "message": "No, I love my country.",
   "created_utc": 1693415802,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyealth",
   "message": "No. Can’t think of a single place I would want to live",
   "created_utc": 1693414077,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyegtl0",
   "message": "I have lived for a time outside of the US.  There were some nice aspects to it, but after having to deal with the government agencies (local and national) there, I am more than happy to live in the US and just visit elsewhere.",
   "created_utc": 1693416262,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebd82",
   "message": "Well I like my guns, so maybe Switzerland?",
   "created_utc": 1693414340,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyea82t",
   "message": "Norway. It’s a nice place to live and I’m allowed to own even cooler guns there.",
   "created_utc": 1693413945,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyewbmd",
   "message": "Absolutely without question. I did it for a while and lost weight and went off antidepressants. It was like an entirely new world opened up. \n\nIt's hard to see it when you're in the states, but the lifestyle really does rot your soul.",
   "created_utc": 1693421729,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyecawo",
   "message": "Germany sounds like a great place to live to me. If not I'd choose the Nordic countries or Ireland.",
   "created_utc": 1693414666,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyegzv9",
   "message": " Yes to England, Ireland or Scotland. Why? Because I wouldn't run out things that I want to see before I die because I love English history. I'd love to see all the places I've read about....and maybe find a door to Underhill...",
   "created_utc": 1693416322,
   "score": 25,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyek99j",
   "message": "No, never.  I've had to live my life here watching immigrants come to America and have their first-generation racist kids tell me to go back to where I came from, so no, I'll die and go to hell before any motherfucker runs me out of my home.",
   "created_utc": 1693417468,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyepp1v",
   "message": "I have dual citizenship with the US and Ireland. If I could only con my wife into it, I'd move to Ireland in a heartbeat, especially if the GOP keeps going down the path they're going down now.",
   "created_utc": 1693419383,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyej0hw",
   "message": "Oh, fuck yeah. If Shitler somehow makes it to The White House again, we're outta here. Canada's the obvious choice.",
   "created_utc": 1693417032,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeaqgt",
   "message": "No way in God’s green field of beans would I ever leave the US. It’s the best country on earth",
   "created_utc": 1693414121,
   "score": 255,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeeb1q",
   "message": "No.  Because if I left the US, I would be emigrating.",
   "created_utc": 1693415374,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyekdq0",
   "message": "Absolutely not, things are kinda screwed up right now, but America is the best.",
   "created_utc": 1693417511,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyecg4p",
   "message": "Honestly, anywhere but here. I realize everywhere has its own unique set of troubles, and that’s what I’m after, just a fresh set of troubles cause I’m tired of the ones I was born into.",
   "created_utc": 1693414717,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyelnoi",
   "message": "As someone who's super into guns, probably not. Sadly there's not really many other places in the world where I'd be free to engage in my hobby in the same way that I'm able to here.",
   "created_utc": 1693417959,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeie7o",
   "message": "Yes. Spain. Love everything about the culture and lifestyle. Especially the work to live not live to work mentality.",
   "created_utc": 1693416813,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyejdlh",
   "message": "If I had to live somewhere else permanently, I might choose Canada.  I grew up near the border.  I like the people, the emphasis on multiculturalism, low level of gun violence, cooler weather, lower prevalence of extreme right wing political/religious groups.  I know there are problems such as high home prices and high taxes, of course.\n\nI've lived in China for like 20 years.  If I were married, I would probably stay, but as a single person and non-citizen, I can't live here after retirement.  It's not a faultless fairyland, but it's great not having to worry about street harassment, gun violence, homeless encampments, etc.  I can walk alone at night without worrying up until like 1:00 am.  There's plentiful and affordable public transportation and medical care is affordable.  I get generous paid sick leave.  I'm homesick for the US, though.  I want to go back, but I'm afraid I'll regret it.  I do have more freedom of movement and freedom from danger here than I do in the US, and I'm afraid I'll miss that.",
   "created_utc": 1693417161,
   "score": 7,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyemj2s",
   "message": "Fuck no!",
   "created_utc": 1693418261,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyenkgs",
   "message": "I am a total Red White and Blue American. I love my country despite all its problems.  But I would live in Spain if I had the chance.",
   "created_utc": 1693418627,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeo4y8",
   "message": "Yes. I’d be willing to go to either Norway or Uruguay. Uruguay would be my number 1 preference.",
   "created_utc": 1693418828,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyevo9b",
   "message": "Er, emigrate.",
   "created_utc": 1693421500,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyevqkg",
   "message": "No, that’s impossible. I would consider emigrating if I could afford to, however.",
   "created_utc": 1693421523,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyejrv5",
   "message": "no fukin way.\n\nbest country in the world.\n\ndespite putin's efforts to destroy it.\n\nour democracy lives.",
   "created_utc": 1693417300,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyel76y",
   "message": "I am in the process of emigrating from the US.",
   "created_utc": 1693417798,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyezygr",
   "message": "Yes, Japan for so, so, so many reasons.",
   "created_utc": 1693423032,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf57zw",
   "message": "There's nowhere better to go.",
   "created_utc": 1693424882,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeae1i",
   "message": "Hawaii looks nice, or Australia because there are many poisonous bugs though",
   "created_utc": 1693414001,
   "score": 253,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf01w2",
   "message": "Crossed my mind ... Vancouver, BC, attractive city, great climate, Canadians are wonderfully laid back. Melbourne, AU ... son in law raised there and repeats reasons he loves it.\n\nRight now I'll settle for a small blue town in a blue county, in a blue state. Soon.\n\nWhy? I'm in TX ... self explanatory.",
   "created_utc": 1693423066,
   "score": 255,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyetbj7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfwmec",
   "message": "I lived with my German (ex) husband in Frankfurt am Main for 15 years.    It was the most marvelous time of my life.  I shot to the top of my career ladder and experienced great culture, wonderful cuisine, amazing travel experiences and incredible people.  The pinnacle was the beautiful AOK Krankenkasse (Health care)  - in the hospital for 2 weeks at death's door with viral pneumonia.   Received excellent care from top notch doctors.  The bill?  $0.\n\nCut to us divorcing and returning to the states and me being diagnosed with thyroid cancer.  $30K USD out of pocket that the insurance didn't cover.",
   "created_utc": 1693434916,
   "score": 203,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfj45v",
   "message": "Packed up and moved from silicon valley to rural Ireland about a year and a half ago.  Best decision ever.",
   "created_utc": 1693429718,
   "score": 201,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyftqvc",
   "message": "I wouldn’t emigrate to a different country just a different part of the US.",
   "created_utc": 1693433757,
   "score": 10,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfwpm4",
   "message": "I love Prague and could see myself retired there. Centrally located, wonderful people, beautiful architecture, rich history. \n\nI would feel the same way about Budapest if the current “leader” of Hungary was to be removed",
   "created_utc": 1693434952,
   "score": 15,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf90o2",
   "message": "I’m from the US, and have been living in Mexico for just under 5 years.\n\nEvery single metric of my life is better here.\n\nI recommend all US citizens consciously find a way to open their horizons (work abroad, study, backpack, volunteer, travel, WOOF, Workaway, etc).  \n\nAnything anywhere is better than nothing.",
   "created_utc": 1693426204,
   "score": 65,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyewd7v",
   "message": "Honestly no.  \nAs much as people complain about the US (and there is still lots to complain about) \nIt’s a beautiful country and everyone I love is here.",
   "created_utc": 1693421745,
   "score": 26,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfcc3f",
   "message": "Norway or Sweden or Finland.  I love the north.  I love the cold.  I'm loving the current state of the USA less and less.  Plus, have you seen pictures and video of these countries?  They're all absolutely beautiful!",
   "created_utc": 1693427350,
   "score": 30,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfw1kr",
   "message": "Japan if any place. Lived their four years, speak the language, wife is Japanese so have family there, and I find at least if you’re talking cities it’s way nicer there than in the US in terms of safety, cleanliness, and convenience. \n\nMain reason I don’t live there is because career opportunities/pay is much better in the US and at least now I generally prefer living in metro/suburbs here as I find it just feels a lot more open/less claustrophobic as well as still having family here. \n\nCould see myself living there again at some point in the future but don’t have a strong desire at this point. My ideal would be like 3 months a year there and 9 months in the US or something like that.",
   "created_utc": 1693434683,
   "score": 9,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfx803",
   "message": "I did. To New Zealand. There's less corruption, better politics (though not perfect), universal healthcare, very few guns, better pace of life, beautiful environment.",
   "created_utc": 1693435159,
   "score": 19,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfxjva",
   "message": "I'll flip it. As a non US resident I wouldn't move to the US because there appears to be a very divided country and money seems to be more important than people.",
   "created_utc": 1693435293,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfyszz",
   "message": "Yes.\n\nI would love to move to Germany, The Netherlands, Austria, or the Czech Republic.\n\nMy wife speaks fluent German and has family in Germany and The Netherlands. Austria and the Czech Republic are because I love the food that is considered \"normal\" and is easy to find.",
   "created_utc": 1693435807,
   "score": 17,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfziz1",
   "message": "YES! I would love to move to a small town in Italy near Florence. I would buy one of those $1 houses if I could get a friend to go along on my renovation journey.",
   "created_utc": 1693436104,
   "score": 6,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfzmio",
   "message": "YES!   Anywhere safe and affordable.  \n\nHusband and I are looking to retire outside the USA because it's too freakin' expensive here!",
   "created_utc": 1693436145,
   "score": 11,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyg37zc",
   "message": "Sweden. It seems like all the happiest people on earth originate there.",
   "created_utc": 1693437665,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeihm0",
   "message": "IMO your mother's idea of Europe is outdated by a few decades. It propagates stereotypes formed during the cold war when USA was relatively unscatched by WW2 compared to Europe.\n\nIt's more of a two-way street between Finland and USA these days. I do know people who've moved to USA -- especially people from the IT and entertainment industries who have attractive opportunities in the far bigger economy of USA.\n\nI also know a number of American-Finnish mixed couples -- who we can presume know anything there's to know about both present-day USA and Finland -- and have specifically chosen to settle in Finland.",
   "created_utc": 1693416846,
   "score": 10,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfvgjx",
   "message": "I already did. I yeeted out of the US October of last year. Got my residency in my country of choice last month.\n\nBetter healthcare, better food, no MAGAts, lower cost of living, better tax rate for the next 10 years, etc.\n\nIt's not all rainbows and sunshine. Inflation is everywhere. Learning a new language is HARD. \n\nNo desire to go back. Family and friends can come visit me.",
   "created_utc": 1693434447,
   "score": 16,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyecmsp",
   "message": "Wife and I have considered moving to Ecuador or some such place in retirement.  Steady warm climate, they treat expats well, usually has a low cost of living.",
   "created_utc": 1693414781,
   "score": 6,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyehtqy",
   "message": "Sure. Both parents are European and I think I might be able to get dual citizenship. Probably move to Denmark, or maybe Portugal, and if I had the money Switzerland 100%",
   "created_utc": 1693416613,
   "score": 6,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeimsk",
   "message": "Highly unlikely. There would need to be a very strong reason and a job that paid extremely well.",
   "created_utc": 1693416897,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyembu0",
   "message": "Absolutely. Cost of living here is insane, especially if you consider health care. We will almost certainly look at retiring outside the US. \n\nWhere? Any place with low cost of living, healthcare, large cities and high numbers of English or Spanish speakers.",
   "created_utc": 1693418191,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyennj1",
   "message": "I moved from the US to Spain 8 years ago. Best decision I ever made.",
   "created_utc": 1693418658,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeoepv",
   "message": "No but because my whole family is here. If I was single no family maybe but you also have to remember that the US is so big that I can go to different parts of the country and basically be in a different country. Would probably give England a shot if I wasn’t her",
   "created_utc": 1693418926,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeuwcb",
   "message": "No, but I might emigrate.",
   "created_utc": 1693421228,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyew7o9",
   "message": "Of places I’ve been, Ireland or Germany. I haven’t been to Thailand, but have heard amazing things.",
   "created_utc": 1693421691,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf471n",
   "message": "My brother is moving to Germany next year so he doesn't have to worry about his daughter being shot at school...don't blame him a bit.",
   "created_utc": 1693424528,
   "score": 17,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf4ka1",
   "message": "No one would take me as I would be a drain of resources (chronic illness)",
   "created_utc": 1693424656,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf5fsv",
   "message": "Germany - better quality of life (for my personal standards), lower cost of living (I'm in a HCOL in the US) transportation infrastructure, have friends / family / ancestry there, love the history, culture, and language.   \n\n\nI just wanna aimlessly stroll along the martkplatz eating pastries and drinking radlers, damnit.",
   "created_utc": 1693424957,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf8136",
   "message": "Probably almost any of the European countries, but I understand that the grass is always greener on the other side. Iceland is where I would want to move as it's one of the top safest countries of the world with an average of 1.5 murders per year (last I heard). They're also very LGBTQ+ friendly. Of course, the downsides are that the language is known to be really difficult to learn and the winters.\n\nI'd move just for a better quality of life and better rights as a human being. Seriously the USA voted that food was not a human right for some reason.",
   "created_utc": 1693425858,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf8hr1",
   "message": "yes,   \nthe Netherlands maybe?",
   "created_utc": 1693426021,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfljqa",
   "message": "Honestly I'd probably only move to another English speaking country, or one that I can get by in with English. But, only out of necessity. I'm hoping (and voting) that we can turn something around anything around in this country soon.",
   "created_utc": 1693430604,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfvsfp",
   "message": "Yes. Norway. I know people there",
   "created_utc": 1693434581,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfw649",
   "message": "I don’t know if they’d have me, but I’d consider living in Ireland. That’s where the majority of my family came from.",
   "created_utc": 1693434735,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfw6ah",
   "message": "Yes! And almost anywhere.",
   "created_utc": 1693434737,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfw746",
   "message": "Yes, somewhere in Europe, because the US isn't affordable and is being taken over by fascists.  The cat is out of the bag now so it's either everyone votes to keep it out but about 1/3 of the country is okay with it and actually pursuing it.",
   "created_utc": 1693434746,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfwbql",
   "message": "I could live anywhere. I lived on a 1.2 square mile island for 7 years and loved it. I don't have any plans but of recent places I have visited, Christchurch  NZ, Oaxaca Mex, Budapest Hungary, Prague CZ. I could happily live in any of those places.",
   "created_utc": 1693434798,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfx7gv",
   "message": "I'd move to Australia the first chance I got. I've got friends there. \\^\\^",
   "created_utc": 1693435153,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfxfwg",
   "message": "Yes. Finland. \nSocial safety net. \nCool architecture. \nHigh tech society. \nHappiest cities in the world. \nSaunas\nArchipelago \nVodka",
   "created_utc": 1693435248,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfxizn",
   "message": "After traveling through the French countryside maybe somewhere there. Or Germany, I’m a brewer so if I could get a similar salary and not lose a good part of my paycheck to private healthcare that would be nice.\n\nThe UK was nice to visit but some of the problems there are too similar to the US. I’d like to visit Scandinavia or southern Europe next which might influence my choice.",
   "created_utc": 1693435283,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfxjdm",
   "message": "Yes. To learn about different cultures. Southeast Asia and South America",
   "created_utc": 1693435287,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfxkab",
   "message": "I am currently in the process of immigrating to Canada. I was slated to take an offer in New Zealand (my first choice) but got a better offer in Canada. I also have looked into Holland, Spain, Portugal, Italy, Germany, and Sweden (where my family is from, I was born in the US though). It all hinged on getting a job that I wanted.\n\nI'm getting older and tired-er and want to find a place where I can at least feel confident of elder-care benefits. BC isn't cheap but I have enough equity in my current house to out-right buy land and start building a small home.",
   "created_utc": 1693435298,
   "score": 6,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfxygj",
   "message": "Yep. Either to retire or to live near family. Italy, Spain, and many Caribbean destinations have their appeal.",
   "created_utc": 1693435460,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfy86h",
   "message": "In a heartbeat.\n\nIreland, UK, Australia, NZ, some of Western Europe.\n\nSupposedly I could establish Irish citizenship based on my grandparents, but the thing I received seemed more like a money grab.",
   "created_utc": 1693435570,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfyeaz",
   "message": "I don’t feel an extreme attachment to the US. There are things I love and hate about the country. I don’t think I would dislike living elsewhere. But I also don’t think I’d ever leave simply because it would be an enormous hassle. Tons of paperwork, documentation, identification, etc. Not to mention needing to learn the ins and outs of a new culture. \n\nLong story short, the US has all walks of life, most types of climate, and cities sized enormous, small, and even off the grid. You can pretty much live any lifestyle you want here (within reason).",
   "created_utc": 1693435639,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfyj0p",
   "message": "I’ve thought about moving to Spain. I know the language fairly well, the food is awesome, the country is beautiful, the people are nice… if it weren’t for family I’d probably already be there",
   "created_utc": 1693435693,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfyqi4",
   "message": "Yes. Italy, Spain, Ireland, Germany, France. In that order. I am either familiar with or have taken classes for these languages, so I think I could become fluent quickly, particularly Italian or Spanish.\n\nHealthcare, cost of living, healthier food, better work life balance.",
   "created_utc": 1693435779,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfyubr",
   "message": "Yes.\n\nI would love to move to Germany, The Netherlands, Austria, or the Czech Republic.\n\nMy wife speaks fluent German and has family in Germany and The Netherlands. Austria and the Czech Republic are because I love the food that is considered \"normal\" and is easy to find.",
   "created_utc": 1693435822,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfz1zi",
   "message": "Tasmania.",
   "created_utc": 1693435910,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfz9w6",
   "message": "I’m not sure if there’s much out there but I’d love to retire in Nova Scotia and just never see the US again",
   "created_utc": 1693435999,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfzk78",
   "message": "Absolutely. I like several things about the US, but there’s so much more accessibility and opportunity to experience life in many other countries. \n\nThe US has a very restrictive system when it comes to job opportunities, worker protections, the finances and modes of travel within the country, the school and healthcare systems, etc…",
   "created_utc": 1693436118,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfzqkr",
   "message": "Portugal...or Denmark\n\nI would without hesitation if I could",
   "created_utc": 1693436192,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfzyfb",
   "message": "Yes. To stop funding the war machine and profitized illness. I've come closer with each attempt. Various places have come to mind, but none have met the minimum.",
   "created_utc": 1693436284,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyg0buu",
   "message": "Abso-fricken-lutely. I would do it in a heartbeat if I could.\n\nI would most likely want to go to Sweden as their quality of life is good, and they have traditions that I would like to experience (like Walpurgis).",
   "created_utc": 1693436439,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyg64lw",
   "message": "Where? Canada? Why? Broadly, I just want to live in an actual first-world country. Why Canada specifically? It's closer, relatively easy to immigrate to, and I don't have to learn another language.",
   "created_utc": 1693438905,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyg66z0",
   "message": "Yeah I’ve been thinking about it.\n\nAmerica kinda feels like it’s turning into a by the corporations for the corporations kind of country because of how much power money can give you. Also a lot of the food here is absolutely horrible for your short and long term health because of poor regulation because the company’s can use their money to keep changes from being made that effect their profits. Kinda depressing once you look into that stuff and find out how much bs goes on. But despite all that it’s still not a bad place to live atm.\n\nAnyways once I get my career and finances sorted and I’m willing I’d probably immigrate to Europe or maybe even Finland if I have time to learn the language. they seem like nice places to live but I haven’t done my research so don’t quote me on that.",
   "created_utc": 1693438931,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygao9e",
   "message": "Italy in a heartbeat… I am getting sick and tired of everything happening in my own Country and I’ve always loved Italy.",
   "created_utc": 1693440846,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygeauu",
   "message": "Hard to leave my aging parents and my friends.  Japan would be pretty great, but the work culture would worry me.  Definitely some spots in Europe I wouldn't hesitate about",
   "created_utc": 1693442375,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygi5yo",
   "message": "If Trump is ever elected again. And to live more cheaply.",
   "created_utc": 1693444004,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygir13",
   "message": "I lived abroad for years and loved it, but I think that people should add value to the culture and the economy instead of pricing locals out. Also, the TikTok shit you see about moving abroad makes things seem simple when it's not, and expat life isn't for everyone, especially people that get their panties in a twist every time something isn't like America.",
   "created_utc": 1693444246,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygix5n",
   "message": "probably not, but if I were to, it'd be the Netherlands. You rarely ever hear about anything bad going around there, and (if) I remember correctly, it's one of the safest and most peaceful countries to live in with some great schools. I might be mistaken, but I also believe that the tax is like 30% there and people are HAPPY with it because it goes right back to the citizens by improving their quality of life.",
   "created_utc": 1693444316,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygj193",
   "message": "Sweden, Germany, or Canada sound nice to me. I dislike US politics, the violence, and the traffic.",
   "created_utc": 1693444362,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygl7p2",
   "message": "I would like to live in Scotland.",
   "created_utc": 1693445264,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyewc0r",
   "message": "Would I possibly?  Yes.  Is it likely?  With climate change and the associated instability, I don't think so.  I don't really want to be the rich white immigrant when shit hits the fan.\n\nI've thought about Europe etc, but the juice isn't worth the squeeze.  I'd be coming in with no connections, no local ties, and competing against people who got masters degrees because college is free and who are multi-lingual because they grew up around people who spoke more than English.",
   "created_utc": 1693421733,
   "score": 9,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfumvg",
   "message": "Why? *gestures around at everything*\n\nWhere? Probably someplace Scandinavian. They seem happy, and they've got social programs that are apparently rather good...",
   "created_utc": 1693434114,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyekowu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygxp82",
   "message": "Anywhere on the Adriatic or Amalfi coast... I know that is a pretty big area lol but that entire coastline is just too beautiful",
   "created_utc": 1693450781,
   "score": 79,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfrj8i",
   "message": " I became a citizen as a child, first on a visa then permanent residency. I miss the island and my culture, as I’ve become very Americanized. The only thing I could do without on my homeland is the structure of religion, but other than that, while I very much love American privilege, I miss my lifestyle back in Ponta Delgada.",
   "created_utc": 1693432878,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyh0x8w",
   "message": "Yes. I live in Spain. I left a couple years after the country became an international joke. The US is going to shit. Here cost of living is affordable with 75% lower wages. There are no school shootings. And people are generally much more progressive.",
   "created_utc": 1693452380,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyh1oex",
   "message": "Yup. Already did. Ecuador. Because the first time I traveled extensively outside the US, I realized there are a lot of better places to live. There are plenty of places full of salt of the earth people who value their cultures, their families, the earth, the sky and the stars in it more than new phones and cars and other meaningless crap. So, after a year, when I ran outta money, I went home and started saving to leave permanently. I've been out for four years now. No intention of returning other than the old family visit every couple years.",
   "created_utc": 1693452768,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyh21ec",
   "message": "Yes, and in 2006 I did emigrate from the USA permanently. (FWIW, Emigrate is going out. Immigrate is coming in.) Haven't even gone back for a visit since. I now live in a safe, sane country, which takes care of its people pretty well too.\n\n* Why? Look in your nearest newspaper. Watch the evening news. Wonder if you're living in a safe enough space that you will survive tomorrow, or whether the random violence in the USA will reach out and touch you, too.\n* Why? Look at your current political parties, of any stripe. Sanity is a rare thing in USA politics these days.\n* Why? Look at your former president, currently being prosecuted for dozens of alleged crimes, including attempting to over the rightfully elected government of the United States. Watch as his political party still defends him!\n\nWhy? There are plenty more reasons to emigrate, but I'll stop there. I've already pissed off at least half of Reddit.",
   "created_utc": 1693452951,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfcx0p",
   "message": "Somewhere with socialized Healthcare. For the socialized Healthcare, so I don't need to eat away at my savings and retirement savings to pay for Healthcare. Also, somewhere with good/better labor protections. That venn diagram overlaps pretty evenly.",
   "created_utc": 1693427551,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfl5r2",
   "message": "No.  My families been here since the 1600’s and I’ll be damned if I leave because of some tin pot dictator and his cult.",
   "created_utc": 1693430460,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfjk1g",
   "message": "No, and because by my estimates, most places aren't doing so hot right now, and I'll take the evil I know over the evil I don't.",
   "created_utc": 1693429876,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfwbri",
   "message": "I could see myself retiring to Aruba. Beautiful island with the chilliest people ever. Nobody gives a fuck, cuz just look around, why would you?",
   "created_utc": 1693434798,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfz74z",
   "message": "Taiwan. I lived there 7 years with my boyfriend. Nearly everything is better except the lack of our families. Thus, here am I in Buttfuck Southern Town as opposed to Taipei. \n\nIf I don't go blind from RP, maybe we'll go back when um...the twilight years of our parents are past.",
   "created_utc": 1693435968,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyfzb72",
   "message": "European part of the Mediterranean coast or Lake Como. Also maybe Atlantic coast somewhere, very maybe.",
   "created_utc": 1693436014,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jygzeeu",
   "message": "I would love to move to Bern, Switzerland. I saw how it looks during Autumn (favorite season) and it was so damn beautiful. Autumn colors and cold grey skies? I could live like that forever.",
   "created_utc": 1693451614,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyh0kbv",
   "message": "If I was younger,I’d absolutely seriously consider leaving. The extremes of politics, capitalism and anything that actually is for people’s benefit is put down with screams of socialism. Just the hate of so called wokeness and antifa, which I think means anti Facism,who the fuck isn’t against Facism .\nThis country is full of regular people who have been changed through so called news programs and propaganda on social media. It’s a sad state of affairs when people from the same country, let alone the same family, are so set in their ways they would choose violence over finding some kind of common ground. It’s actually heartbreaking",
   "created_utc": 1693452197,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyh183q",
   "message": "I would move to Swtizerland tomorrow if I could afford it. Canada, any of half a dozen countries. I am not a fan of our racism, our lack of health care, our history, educational system. More?",
   "created_utc": 1693452536,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyhava5",
   "message": "Yes.\n\nCanada.\n\nBecause I really don't like what the US has turned into and will continue to turn into.",
   "created_utc": 1693457933,
   "score": 3,
   "submission_id": "165jtzt"
  }
 ]
}