{
 "submission_id": "165jtzt",
 "title": "Citizens of the US would you ever immigrate outside of the states, where and why?",
 "selftext": "",
 "created_utc": 1693413830,
 "permalink": "/r/AskReddit/comments/165jtzt/citizens_of_the_us_would_you_ever_immigrate/",
 "score": 83,
 "url": "https://www.reddit.com/r/AskReddit/comments/165jtzt/citizens_of_the_us_would_you_ever_immigrate/",
 "comments": [
  {
   "comment_id": "jyehmc2",
   "message": "Why?  To stretch my retirement funds.  And to experience new places and culture.\n\nWhere?  Portugal,  small town in Italy, Spain.",
   "created_utc": 1693416540,
   "score": 88,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyennc5",
   "message": "Emigrate vs immigrate",
   "created_utc": 1693418656,
   "score": 67,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebn0b",
   "message": "As soon as I get a close to retirement I am heading to south/central America",
   "created_utc": 1693414435,
   "score": 35,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeg3oc",
   "message": "Dude I would move to pretty much any other developed, Western nation without any hesitation if I were offered an easy way to do it. There are a lot of things I love about America, but I'm so sick of its bullshit.",
   "created_utc": 1693416009,
   "score": 114,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeo0f5",
   "message": "Hate to be that guy (not really).... when you're leaving a place, it's emigration. A person who lives somewhere other than their place of birth has immigrated and can be referred to as an immigrant.",
   "created_utc": 1693418785,
   "score": 55,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeapna",
   "message": "Holland, it’s little USA. Western, civilized, a lot of social acceptance. A lot of  freedom and 98 percent understand the English language. Also, the government got your ass more covered when you are in trouble financially or health wise.",
   "created_utc": 1693414113,
   "score": 45,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeaaaf",
   "message": "Yes absolutely. Id go to Canada 🇨🇦.... the meanest Canadian I've met was nicer than any girl I've dated.",
   "created_utc": 1693413965,
   "score": 36,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebvw5",
   "message": "It depends on the situation. If I had to, I would. Otherwise I'm staying home 🤗 there are many places in the states I have yet to discover anyway! \n\nIf I were to relocate, I'm on my way to New Zealand baby!! It's a beautiful place with a low population. It seems to be a well organized, and peaceful place.",
   "created_utc": 1693414520,
   "score": 17,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeht99",
   "message": "I’ve worked in a number of countries for varying lengths of time (from two weeks to 5 months). \n\nI’ve learned that each country has its pros and cons but I would’ve been happy in a number of places.  \n\nWould I ever leave the US permanently?  If my SO was down with it, absolutely.  \n\nWhere would I go?   If I had a choice and a good job there, I love the Canadian Arctic region.",
   "created_utc": 1693416608,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyepckw",
   "message": "Have had my mind drift across the Canadian border every now and again, especially if things really turn bad for gay folk. My spouse who has a degree from one of their universities, and we're both professionals, so it's not as far-fetched as it might otherwise seem.",
   "created_utc": 1693419261,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebf0p",
   "message": "I'm ok here in the US. But if the stars aligned and the opportunity knocked, I would love to live in the Rhineland of Germany. Not in a city mind you, just, like, small village or town.",
   "created_utc": 1693414357,
   "score": 12,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeo97z",
   "message": "if anyone says the balkans or eastern europe, with respect, you should rather torture yourself to death",
   "created_utc": 1693418871,
   "score": 7,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf15m5",
   "message": "Nah. Whatever political leanings you may have, you can find a life in America that shields you from the politics you don't like. There are several very pro-choice states, states where you can bring guns everywhere, places where you live amongst whatever level (or lack) of diversity you find ideal. I live in Portland, OR and the far-right politics in the South don't really effect me at all.",
   "created_utc": 1693423458,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyea6qd",
   "message": "Man, fuck, I wish I was American\n\nYou guys dont know how lucky you are",
   "created_utc": 1693413931,
   "score": 34,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeh0ns",
   "message": "I love traveling and experiencing new cultures. After a week or two being away I get homesick. My home is East TN. I love where I am.",
   "created_utc": 1693416329,
   "score": 8,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeonce",
   "message": "Probably not. I've visited a lot of different regions of the world and the more I travel, the more I appreciate the overall experience of the United States. There are great aspects of every country I've visited. It's also a lot different vacationing in these countries and actually living in these countries. It's fun when you're in a little village in Italy(replace Italy with about any country) and the lights go out. \"Oh look at the stars!\". When the electricity going off 4 times a month for hours at a time and you have to go to work, it's not quite as majestic. The biggest advantage I like about the U.S. is its diversity of everything. If you don't like the way things are where you live, there is a good chance that moving a few miles away may make things totally different. Still don't like it, move to the next state instead. Hate the heat, move to Minnesota. Hate the cold, move to the south. Want a big house you can afford, we have LOTS of space with places where land is cheap. You want to live somewhere where everyone acts/looks just like you, we have that covered. You want to live somewhere that is the opposite, we have that as well.",
   "created_utc": 1693419012,
   "score": 10,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyej2dj",
   "message": "on reddit all you see is people talking bad about America. for me, since I've actually traveled outside the US and seen what other places are really like- the US is a good place to live.",
   "created_utc": 1693417050,
   "score": 15,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeavol",
   "message": "I would, but I don’t have a specific destination in mind and I’d have to return to see my family \n\nAnd I probably can’t afford it anyway",
   "created_utc": 1693414171,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyepco2",
   "message": "I'd like temps between -10 and 30C, arable land, and few biting ~~insects~~ pests... where go?",
   "created_utc": 1693419261,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyew7kf",
   "message": "We used to joke about flying off to New Zealand (around the time the Lord of the Rings movies came out). Every year the joking tone gets less and less.",
   "created_utc": 1693421690,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyefvif",
   "message": "Norway, because Norway",
   "created_utc": 1693415929,
   "score": 7,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyea5si",
   "message": "Yes. Fairly sizable list, but Ireland and Canada would be the easiest, all things considered. Having family in both helps. That being said, I am content here.",
   "created_utc": 1693413922,
   "score": 6,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeefom",
   "message": "Yes, working on that now. Montenegro, cost of living is much lower and it's gorgeous.",
   "created_utc": 1693415420,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyekbh0",
   "message": "Puerto Rico. It's beautiful and I still get US constitutional protections, they use the US dollar, and I don't have to fill out any paperwork.",
   "created_utc": 1693417489,
   "score": 7,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeq6ua",
   "message": "I probably wouldn’t move.\n\nDespite what the vocal minority on the internet wants everyone to believe, life for the strong majority of Americans is pretty great, and it is not the third world hellscape Reddit wants to paint it as.\n\nAs others have said, most everyone around for thousands of miles speaks the same language. The landscapes across the country are varied. It is relatively easier to find a job here (the severity of people not being able to find work or being passed up for nepotism is extremely exaggerated, especially on Reddit). Everyone is very open and nice to each other (another one that gets exaggerated to an extreme degree, the emotional ones are a loud minority and nobody likes them).\n\nOf course, the people pointing out the bad aren’t entirely wrong, there is a gun problem, and there are cases of people struggling to afford healthcare; but, and I’m probably going to get flack for this, again those issues have been exaggerated to an unfairly extreme degree. The country isn’t the Wild West where everyone is shooting each other (or in other words, you’re completely safe pretty much everywhere besides very specific areas of the country); and despite what the internet wants to paint the picture as, the strong majority across a wide range of income levels have zero problems affording their healthcare. Most of the “I rode 50 feet in an ambulance and they’re making me pay $50k” horror stories are flat bullshit where the person just posted their unadjusted (keyword) medical bill and called that the final total.\n\nThere’s still stuff to criticize the US for, but after traveling around in my 20’s, I’ve learned that the grass isn’t that much greener on the other side. Other countries have their issues too, and what I’ve learned is that they’re all pretty comparable.\n\nEdit: In case you plan on leaving a reply, I’m kinda just stating my piece and moving on. I’ve argued with redditors enough over the past decade, and to be honest, I don’t really care what you guys have to say anymore. Live in your bubble and I’ll live in mine I guess.",
   "created_utc": 1693419559,
   "score": 5,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyextq8",
   "message": "🇳🇴Norge🇳🇴",
   "created_utc": 1693422269,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf2beg",
   "message": "Yes and Ireland. Visited there in the year of our lord 2014, two years from the 100 year anniversary of the Irish revolution. We stayed in Dublin a few nights then rented a car from Dublin to Cork. Did the Ring of Kerry, kissed the Blarney Stone rock, went to the House of Waterford, and generally drove around to parts of Ireland just enamored with the people and the country side. \n\nWife has a lot of family from Ireland and I worked for a company that has offices there. Their economy is doing well as part of the EU, they’re progressive in their laws, and we had a lot of fun there. That may or may not be our retirement plans.",
   "created_utc": 1693423868,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf6hvt",
   "message": "Actually just had some of this discussion with my kids and their families a couple of days ago. We could all sell our houses and live like royalty in some other countries instead of struggling to feed ourselves here.",
   "created_utc": 1693425322,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyegqvu",
   "message": "Yes, and I have, to Japan. Opportunity and circumstances permitting, I’d certainly go back.",
   "created_utc": 1693416236,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyelu21",
   "message": "No, why would I?",
   "created_utc": 1693418021,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyefih8",
   "message": "No, I love my country.",
   "created_utc": 1693415802,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyealth",
   "message": "No. Can’t think of a single place I would want to live",
   "created_utc": 1693414077,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyegtl0",
   "message": "I have lived for a time outside of the US.  There were some nice aspects to it, but after having to deal with the government agencies (local and national) there, I am more than happy to live in the US and just visit elsewhere.",
   "created_utc": 1693416262,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyebd82",
   "message": "Well I like my guns, so maybe Switzerland?",
   "created_utc": 1693414340,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyea82t",
   "message": "Norway. It’s a nice place to live and I’m allowed to own even cooler guns there.",
   "created_utc": 1693413945,
   "score": 4,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyewbmd",
   "message": "Absolutely without question. I did it for a while and lost weight and went off antidepressants. It was like an entirely new world opened up. \n\nIt's hard to see it when you're in the states, but the lifestyle really does rot your soul.",
   "created_utc": 1693421729,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyecawo",
   "message": "Germany sounds like a great place to live to me. If not I'd choose the Nordic countries or Ireland.",
   "created_utc": 1693414666,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyegzv9",
   "message": " Yes to England, Ireland or Scotland. Why? Because I wouldn't run out things that I want to see before I die because I love English history. I'd love to see all the places I've read about....and maybe find a door to Underhill...",
   "created_utc": 1693416322,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyek99j",
   "message": "No, never.  I've had to live my life here watching immigrants come to America and have their first-generation racist kids tell me to go back to where I came from, so no, I'll die and go to hell before any motherfucker runs me out of my home.",
   "created_utc": 1693417468,
   "score": 3,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyepp1v",
   "message": "I have dual citizenship with the US and Ireland. If I could only con my wife into it, I'd move to Ireland in a heartbeat, especially if the GOP keeps going down the path they're going down now.",
   "created_utc": 1693419383,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyej0hw",
   "message": "Oh, fuck yeah. If Shitler somehow makes it to The White House again, we're outta here. Canada's the obvious choice.",
   "created_utc": 1693417032,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeaqgt",
   "message": "No way in God’s green field of beans would I ever leave the US. It’s the best country on earth",
   "created_utc": 1693414121,
   "score": 255,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeeb1q",
   "message": "No.  Because if I left the US, I would be emigrating.",
   "created_utc": 1693415374,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyekdq0",
   "message": "Absolutely not, things are kinda screwed up right now, but America is the best.",
   "created_utc": 1693417511,
   "score": 2,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyecg4p",
   "message": "Honestly, anywhere but here. I realize everywhere has its own unique set of troubles, and that’s what I’m after, just a fresh set of troubles cause I’m tired of the ones I was born into.",
   "created_utc": 1693414717,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyelnoi",
   "message": "As someone who's super into guns, probably not. Sadly there's not really many other places in the world where I'd be free to engage in my hobby in the same way that I'm able to here.",
   "created_utc": 1693417959,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeie7o",
   "message": "Yes. Spain. Love everything about the culture and lifestyle. Especially the work to live not live to work mentality.",
   "created_utc": 1693416813,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyejdlh",
   "message": "If I had to live somewhere else permanently, I might choose Canada.  I grew up near the border.  I like the people, the emphasis on multiculturalism, low level of gun violence, cooler weather, lower prevalence of extreme right wing political/religious groups.  I know there are problems such as high home prices and high taxes, of course.\n\nI've lived in China for like 20 years.  If I were married, I would probably stay, but as a single person and non-citizen, I can't live here after retirement.  It's not a faultless fairyland, but it's great not having to worry about street harassment, gun violence, homeless encampments, etc.  I can walk alone at night without worrying up until like 1:00 am.  There's plentiful and affordable public transportation and medical care is affordable.  I get generous paid sick leave.  I'm homesick for the US, though.  I want to go back, but I'm afraid I'll regret it.  I do have more freedom of movement and freedom from danger here than I do in the US, and I'm afraid I'll miss that.",
   "created_utc": 1693417161,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyemj2s",
   "message": "Fuck no!",
   "created_utc": 1693418261,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyenkgs",
   "message": "I am a total Red White and Blue American. I love my country despite all its problems.  But I would live in Spain if I had the chance.",
   "created_utc": 1693418627,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeo4y8",
   "message": "Yes. I’d be willing to go to either Norway or Uruguay. Uruguay would be my number 1 preference.",
   "created_utc": 1693418828,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyevo9b",
   "message": "Er, emigrate.",
   "created_utc": 1693421500,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyevqkg",
   "message": "No, that’s impossible. I would consider emigrating if I could afford to, however.",
   "created_utc": 1693421523,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyejrv5",
   "message": "no fukin way.\n\nbest country in the world.\n\ndespite putin's efforts to destroy it.\n\nour democracy lives.",
   "created_utc": 1693417300,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyel76y",
   "message": "I am in the process of emigrating from the US.",
   "created_utc": 1693417798,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyezygr",
   "message": "Yes, Japan for so, so, so many reasons.",
   "created_utc": 1693423032,
   "score": 0,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf57zw",
   "message": "There's nowhere better to go.",
   "created_utc": 1693424882,
   "score": 1,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyeae1i",
   "message": "Hawaii looks nice, or Australia because there are many poisonous bugs though",
   "created_utc": 1693414001,
   "score": 253,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyf01w2",
   "message": "Crossed my mind ... Vancouver, BC, attractive city, great climate, Canadians are wonderfully laid back. Melbourne, AU ... son in law raised there and repeats reasons he loves it.\n\nRight now I'll settle for a small blue town in a blue county, in a blue state. Soon.\n\nWhy? I'm in TX ... self explanatory.",
   "created_utc": 1693423066,
   "score": 255,
   "submission_id": "165jtzt"
  },
  {
   "comment_id": "jyetbj7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165jtzt"
  }
 ]
}