{
 "submission_id": "165penu",
 "title": "Americans, how would you feel if the max age limit to be in government office is 70?",
 "selftext": "",
 "created_utc": 1693426544,
 "permalink": "/r/AskReddit/comments/165penu/americans_how_would_you_feel_if_the_max_age_limit/",
 "score": 67,
 "url": "https://www.reddit.com/r/AskReddit/comments/165penu/americans_how_would_you_feel_if_the_max_age_limit/",
 "comments": [
  {
   "comment_id": "jyfa9uh",
   "message": "Sounds neat.\n\nNow all we got to do is convince a bunch of octogenarians to vote for it.",
   "created_utc": 1693426635,
   "score": 49,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfahgs",
   "message": "I'd be fine with it, but I'd be happier with term limits over age limits.",
   "created_utc": 1693426710,
   "score": 139,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg09hs",
   "message": "Age cap and wealth cap! 80 year old millionaires do not have our best interests at heart.",
   "created_utc": 1693436411,
   "score": 66,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfc8id",
   "message": "If you aren't allowed to fly an airplane or perform surgery past a certain age, I think it is reasonable to extend that to members of the federal government making world altering decisions daily.\n\nAlso while we're at it Supreme Court should just be a single 12 year term and once you're done you're done.",
   "created_utc": 1693427315,
   "score": 53,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfaf0m",
   "message": "I am not in favor of it, I think it's ignoring the problem of parties picking horrible candidates.",
   "created_utc": 1693426686,
   "score": 6,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg0c7s",
   "message": "I would prefer Americans do a better job of managing our government from city level to President.\n\nThat requires getting informed and doing a fair amount of work.\n\nWe’re totally screwed, aren’t we?",
   "created_utc": 1693436443,
   "score": 6,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfr0a1",
   "message": "O'Connell froze again today. Not competent nor physically able. Feinstein too.",
   "created_utc": 1693432672,
   "score": 9,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jygboj5",
   "message": "I’d rather we get private money and lobbying out of politics. Tax funds should be allocated equally to each candidate for their campaigns and the campaigns themselves ought to be limited to two months for local offices, six for national.",
   "created_utc": 1693441269,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfspdl",
   "message": "Still too old. \n\nTerm limits would be a good idea, too.",
   "created_utc": 1693433341,
   "score": 21,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jygbd03",
   "message": "Age cap and term limits please!",
   "created_utc": 1693441134,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jygc8tw",
   "message": "it’s a start",
   "created_utc": 1693441504,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jygca0t",
   "message": "That it should be 60. Not 70.",
   "created_utc": 1693441517,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfesdz",
   "message": "I'd prefer term limits",
   "created_utc": 1693428195,
   "score": 9,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg1d1z",
   "message": "retirement age is 67. it should be the same for politicians.",
   "created_utc": 1693436873,
   "score": 9,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfxaze",
   "message": "I'm not even sure of term limits. If a Bernie or an Elizabeth Warren or someone who's been voted in time and time again because they're \\_still\\_ effective at their jobs were subjected to term limits, who would be available to take up their positioning and present the kinds of ideas that American voters, I think, need to hear? \n\nI'd be okay with a procedure for removing an elected official when they are no longer fit to serve, but I'd be wary of it being possibly abused.",
   "created_utc": 1693435192,
   "score": 7,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfc7sk",
   "message": "I’d feel that’s dumb and age discrimination and in practical terms a lot of people are just getting started with backgrounds in stuff as qualifications at 40 or 50 that makes them…um, actually qualified and everybody else is a noob. I don’t like the fact that you have some 80 year olds (or older) with significant cognitive issues, but somebody who doesn’t have life and practical experience, should not be president or a justice in SCOTUS or some other federal judge.",
   "created_utc": 1693427308,
   "score": 6,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfdkyt",
   "message": "i feel like term limits would be better.\n\ni know plenty of 70 year olds who are much smarter and wiser then most 30 year olds.",
   "created_utc": 1693427777,
   "score": 10,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfagqi",
   "message": "No. You already get to vote. All such limits do is invalidate the votes you don't agree with.",
   "created_utc": 1693426703,
   "score": 9,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfagtv",
   "message": "Yes and let's do that for all occupations so people can retire",
   "created_utc": 1693426704,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyflqs1",
   "message": "I honestly don't know how other countries handle this issue, but I'd like to know.  Do any of them have a 70 year limit?",
   "created_utc": 1693430676,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfwhg1",
   "message": "Absolutely yes. Not only are people too old to be governing but they are relying on their name recognition and history over younger, more qualified candidates.",
   "created_utc": 1693434861,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfx7mq",
   "message": "Yes. Some of you are too young to remember the movie Weekend at Bernie's but no matter what you think of the politics of some of these people, propping them up like Weekend at Bernie's and keeping them in office is disturbing and sad. \n\nPeople say it is ageism, but I say it is reality. Some people do stay sharp well into their later years - but the vast majority decline in some for eventually. Running the country is too important and there are federal jobs with maximum entry ages - usually law enforcement, etc. I do not see a problem saying you're out at a certain point. I also think it's not democratic to have these people in office, you know they aren't the one completing the work - it's a bunch of people who were not elected behind the scenes. That's wrong. What's to say they don't put one of these people on life support and just keep running the show at some point? \n\nThese people can't seem to walk away for the good of the country on their own - so they need a limit that tells them time is up.",
   "created_utc": 1693435155,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfx8uz",
   "message": "Yes, please.",
   "created_utc": 1693435168,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfy4ad",
   "message": "As someone in his 70s, I agree.",
   "created_utc": 1693435526,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfztli",
   "message": "wow, would that clean out congress..",
   "created_utc": 1693436227,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg0fbk",
   "message": "Ban insider trading for them first",
   "created_utc": 1693436479,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg0isf",
   "message": "I would prefer 65 personally",
   "created_utc": 1693436520,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg0tve",
   "message": "i’d feel better if it was 65.",
   "created_utc": 1693436649,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg10q0",
   "message": "To be honest, anyone alive during segregation shouldn’t be allowed in politics.",
   "created_utc": 1693436729,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg14qv",
   "message": "Sounds great when do we start",
   "created_utc": 1693436775,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg1den",
   "message": "The fact that the Supreme Court has no term or anything is insane",
   "created_utc": 1693436877,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg1j3h",
   "message": "Too damn high!\n\n65 max, maybe even 62",
   "created_utc": 1693436945,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg29i2",
   "message": "Sounds great. Why do all of our politicians have to be like 95?",
   "created_utc": 1693437259,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2h8y",
   "message": "Just have term limits.\n\nIt's not inconceivable that a healthy person over 70 could be good at governing, they just shouldn't be doing it for 50 years in a row.\n\nMedicine will continue to improve and people will stay healthy longer and live longer, so 70 may not even be that \"old\" at some point in the future. Hard-coding in limits like that ends up looking stupid when the world changes.",
   "created_utc": 1693437352,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2ncg",
   "message": "I'm 65 and I think it should be 70, or maybe even 65.",
   "created_utc": 1693437424,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg3mq3",
   "message": "We'd lose Bernie. The rest of them, I want gone. \n\nBut Bernie?",
   "created_utc": 1693437833,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg4du8",
   "message": "Just fine. At this point it would be awful nice of them to do it.",
   "created_utc": 1693438156,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg7369",
   "message": "How about tie it to the average life expectancy in their district? Maybe it'll give them an incentive to improve people's lives. While we're at it, tie their salary to the median and get rid of the all the bullshit ways they make millions off being politicians. Want a book deal? Fine, but you aren't selling a half million copies to some PAC to hand out at events. High paying job in an industry you spent decades in the pocket of despite having no relevant experience? Sorry, the elected position comes with a legally binding non-compete. Stocks? Gotta be held in a blind trust.",
   "created_utc": 1693439314,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfs5jr",
   "message": "Works for me",
   "created_utc": 1693433125,
   "score": 4,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg4btz",
   "message": "65 and term limits for every office.",
   "created_utc": 1693438133,
   "score": 3,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfa9kj",
   "message": "Completely unsatisfied. It should be the same as the retirement age.",
   "created_utc": 1693426633,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfxvfw",
   "message": "Don't make it based on age... that gives rise to ageism. Instead, make sure they're mentally fit and sound for office as they run for election, just as we do doctors or anyone else who has to be accountable for the wealth fare of lives. And term limits.",
   "created_utc": 1693435426,
   "score": 2,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfrjjk",
   "message": "Should be younger.\n\nMaximum is retirement age.  I’d even say 65 tops (you have to leave on your birthday too, no finishing the term)\n\nWhile I fundamentally agree on term limits, I’d have to understand how well this would work because you’d get a constant stream of political neophytes in there and they’d be at a disadvantage when dealing with other nations.\n\nAlso, much of the power would likely be distributed to the support people for politicians and then the power behind the power couldn’t be voted on or removed.",
   "created_utc": 1693432882,
   "score": 3,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg5ohq",
   "message": "Sounds kind of ageist. If a person’s cognitive faculties are still in working order, why not let them continue to run. Just offer every politician a yearly cognitive test instead.",
   "created_utc": 1693438711,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfamj9",
   "message": "Do that *and* term limits and we're golden",
   "created_utc": 1693426758,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfchm1",
   "message": "I think a limit on number of terms served would work better, but retirement age might help too.",
   "created_utc": 1693427404,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyffn98",
   "message": "Term limits would be better in my opinion.  Age limits wouldn't be necessary if people stopped voting for decrepit old people who should be retired.  Maybe some sort of cognitive requirements would be good as well since some of these super old people don't even seem to know where they are at times.  They shouldn't be making decisions that affect hundreds of millions of people - especially when they likely won't be around to see the fallout from bad decisions.",
   "created_utc": 1693428490,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfontt",
   "message": "Too low an age, to me. I have no problem with someone who is old, competent, and capable. 70 is just outright age discrimination.",
   "created_utc": 1693431774,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfz1ob",
   "message": "You can't do that because some people are still sharp into their 70s and 80s.\n\nAlso, spoiler alert: young people suck too",
   "created_utc": 1693435906,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfh7sy",
   "message": "i'd prefer 60 or 65 years old instead of 70.",
   "created_utc": 1693429039,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfu86r",
   "message": "65*",
   "created_utc": 1693433953,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfwdgc",
   "message": "Gen exer in my 50s. And YEP!",
   "created_utc": 1693434817,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfwfud",
   "message": "How about 65?",
   "created_utc": 1693434843,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfycax",
   "message": "That’s still too high. Make it 65",
   "created_utc": 1693435617,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfymcl",
   "message": "Make it 67. The same as the full retirement age in the US.\n\nWe shouldn't have Bidens and McConnells representing the country. They can barely get a word out of their mouths.",
   "created_utc": 1693435731,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfz9ex",
   "message": "Can we do 65? But sure it's a start, still want term limits.",
   "created_utc": 1693435994,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg0cke",
   "message": "Id' say why not 65. and if we can't do it like we do pilots and age, then we should set service to 2 terms max, just like the president\n\nany older and they are just placeholders. simply puppets that other people can manipulate in order to vote how THEY want.",
   "created_utc": 1693436447,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg19dk",
   "message": "Kinda short sighted to exclude and entire cohort of people with the most life experience ….probably better to have cognitive tests, or better yet, don’t vote for candidates that that you suspect aren’t all there .",
   "created_utc": 1693436830,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyftcrz",
   "message": "Push it back to 55 and I’m good.",
   "created_utc": 1693433600,
   "score": 0,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfo9am",
   "message": "I think ...\n\n...\n\n...\n\nthat's a fabulous idea! \n\nSorry - I locked up for a bit there.",
   "created_utc": 1693431619,
   "score": 0,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfc49d",
   "message": "Honestly I think it should be 60",
   "created_utc": 1693427274,
   "score": 254,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg19qk",
   "message": "Sure and only white people, too? If you're going to discriminate, you might as well go big.  \n\nand no women, fatties or ugly people",
   "created_utc": 1693436834,
   "score": 255,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfxanq",
   "message": "I would feel that age is too high. 55 should be the cutoff tbh. It’s not about waiting until they’re semi-senile, it’s about being part of the main population. \n\nOld people tend to only serve themselves.",
   "created_utc": 1693435189,
   "score": 255,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfy2va",
   "message": "I would think that's to high a number. Let's lower that about ten maybe even twenty years",
   "created_utc": 1693435510,
   "score": 0,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfycyp",
   "message": "Id say lower it to 65.",
   "created_utc": 1693435624,
   "score": 0,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg20z2",
   "message": "I think we have to be nuanced - elder statesfolk *do* have real value in their long experience (and one might hope that with limits looming they would look to build legacy in the form of mentorship rather than personal action). However I *don't* want a government run by wet-behind-the-ears amateurs delegating everything to lobbyists and support staff because they don't understand a damn thing about how governance really works or how to recognize and handle political nonsense - to say nothing of maneuvering with foreign diplomats.\n\nI would take a middle stance and propose that representatives above a cutoff age can't serve on committees - they can vote on the floor, but they can't be responsible for the craft of substance and should leave that to younger members operating with their advice and counsel, if sought. That way you get the resource of age and experience while making sure fine details are in the hands of those who will be alive for the consequences in decades time.",
   "created_utc": 1693437158,
   "score": 0,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jygcwmi",
   "message": "Pissed off. It should be lower. Cognitive decline starts well before 70 in almost all cases.",
   "created_utc": 1693441782,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfbyd3",
   "message": "Well, let's start applying age limits to everything.\nShouldn't be allowed to vote or drive a car till you are 20..\nCan't drink until you're 25.\n\nIt's not how old someone is, it's their cognitive abilities.\nIf you are able to show that you can handle the responsibility at any age range, then you will be given the right.\nIf not, then denied.",
   "created_utc": 1693427217,
   "score": 252,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfdvo0",
   "message": "That’s unconstitutional when applied to voting. No taxation without representation. You can work full time at 18, so you vote at 18. Also, if 18 year olds are old enough to serve then they’re old enough to vote.\n\nWho in your scenario is the one judging a person’s cognitive ability in regards to voting, driving, etc? With things like driving we already have written and performance tests to pass and those with severe disabilities and conditions aren’t able to drive unless medically approved. For voting, all persons regardless of mental ability should get representation thus should be able to vote.\n\nI think for elected officials running there should be an age cap of the federal retirement age as the last age you are able to run for any office. IE if the retirement age is 65, you could still run for office and be elected/serve that term, but wouldn’t be able to run again past that age. I also think we need term limits on all positions including the Supreme Court.",
   "created_utc": 1693427880,
   "score": 255,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfn4hu",
   "message": "Lower.",
   "created_utc": 1693431193,
   "score": 255,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfwpbs",
   "message": "Most 70 year olds are still cognitive. It's when they get to lofe expectancy is when there is an issue.",
   "created_utc": 1693434949,
   "score": 254,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfokf1",
   "message": "Safer",
   "created_utc": 1693431738,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyfyooq",
   "message": "In the short term it would probably be a good thing.  \n\nHowever, I'd be concerned that it sets a precedent for creating new age restrictions that an unscrupulous congress could weaponize in the future.  \n\nLike if both chambers of congress are held by one party, as well as the presidency, and there's an up and coming challenger from the other party who is 67 years old, what's to stop them from passing a law that prevents that person from running by dropping the maximum age?",
   "created_utc": 1693435758,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg0war",
   "message": "Better.",
   "created_utc": 1693436678,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg1a22",
   "message": "Should be lower tbh",
   "created_utc": 1693436838,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg1lj8",
   "message": "Should be 60",
   "created_utc": 1693436974,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg1m30",
   "message": "why so high, id be okay with 60.",
   "created_utc": 1693436980,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg23xu",
   "message": "Good",
   "created_utc": 1693437194,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2k23",
   "message": "Great",
   "created_utc": 1693437384,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2ng1",
   "message": "Include the Supreme Court.",
   "created_utc": 1693437425,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2q6f",
   "message": "Fantastic.  But also I don't think it would fly legally.\n\nI think it's far better to set some type of threshold by which if you either fail a cognitive test, or miss X amount of days of work (without proper reason), then you need to forfeit your position.",
   "created_utc": 1693437456,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2s8p",
   "message": "Grrrrreat!",
   "created_utc": 1693437481,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2wy4",
   "message": "What about a term limit instead. That would solve alot of problems.\n\n70s barely means one's life expectancy in leadership!",
   "created_utc": 1693437536,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg2y54",
   "message": "I would say there are plenty of people over 70 who are still with it enough to serve.",
   "created_utc": 1693437551,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg34nj",
   "message": "20 years too high. When a huge portion of folks die around 75, people with 5 years to live have no business making policy for people who’ll be here for a while.",
   "created_utc": 1693437628,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg3644",
   "message": "Sounds good, or at least, to be elected to office.  They can serve out their terms after their birthdays.",
   "created_utc": 1693437644,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg37bp",
   "message": "I think it should be the same as the normal age of retirement, which is currently 67. Term limits of 1 term for a senator and 3 for a house rep.",
   "created_utc": 1693437657,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jyg38xv",
   "message": "65.",
   "created_utc": 1693437675,
   "score": 1,
   "submission_id": "165penu"
  },
  {
   "comment_id": "jygd2zp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165penu"
  }
 ]
}