{
 "submission_id": "165s0lp",
 "title": "What is the most unprofessional thing a doctor has said to you?",
 "selftext": "",
 "created_utc": 1693432535,
 "permalink": "/r/AskReddit/comments/165s0lp/what_is_the_most_unprofessional_thing_a_doctor/",
 "score": 234,
 "url": "https://www.reddit.com/r/AskReddit/comments/165s0lp/what_is_the_most_unprofessional_thing_a_doctor/",
 "comments": [
  {
   "comment_id": "jyg1zrz",
   "message": "Broke a bone in my foot. Knew that I had broken a bone in my foot. Went to the doctor and he told me that I didn't break a bone in my foot but instead was suffering from gout. I'm not even in the realm of people that experience gout and had zero other signs that it could've been gout. He was going to refuse my request for an X-ray but I made him do it. An hour later, I'm in his office and he holds up the x-ray and informs me that I broke a bone in my foot.",
   "created_utc": 1693437143,
   "score": 234,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg0z4j",
   "message": "I went into urgent care with mastitis (i'd had it twice before and it's very obvious to self diagnose when part of your breast turns red, hard, and hot to the touch while breastfeeding). The guy wasn't yet a doctor, but was doing some practice at the urgent care. \n\nWhen I told him I had mastitis, he looked at me and said \"wow! That's an awfully big word! Where'd you learn that?!\"\n\nI was 30. If I hadn't been very sick at that moment, I might have kicked him in the teeth.",
   "created_utc": 1693436710,
   "score": 105,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg2gm4",
   "message": "\"You were spurting blood everywhere... like a horror movie!\" He said this with a big smile on his face and was laughing.\n\nApparently the procedure they did to resolve a mistake they made during my C-section turned into life saving open surgery, which cost me my ability to ever have kids again. Not only did they do the wrong procedure, they slipped up and punctured an organ in the process. I bled out, stopped breathing due to overmedication, and... yeah.\n\nI was in the darkest place of my life and the mo'fo who caused it all was laughing. Wasn't so funny when I sued him and won.",
   "created_utc": 1693437344,
   "score": 162,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyga693",
   "message": "Doctor: \"Many women that come to my office would kill for those\"\r  \n\r  \nMe: \"Those what?\"\r  \n\r  \nDoctor: \"You have childbearing hips\"\r  \n\r  \nMe: \"Uh...okay, but I came to you because my stomach has been hurting really bad for over a week now, and today I woke up with a really bad fever..?\"\r  \n\r  \n**Doctor proceeds to check my file and suddenly grins at me**\r  \n\r  \nDoctor: \"Oh, and you are turning 18 in four days! Are WE planning to make use of them?\"\r  \n\r  \nMe: \"...\"\r  \n\r  \nI WISH I was making this up. My Grandma thankfully tore this man a new one while my Dad sat there not even clocking what just happened until my Grandma explained it to him in the car. She was absolutely enraged for the rest of the day while my Dad was still struggling to see the problem. Ignorance really can be a wonderful thing. He genuinely tried to argue that the guy was simply \"complimenting me\" and that my Grandma was being too harsh. That argument lasted until my Nan screamed at him, \"For fuck's sake, James! Are **you** walking around complimenting **17 year old GIRLS** on their *childbearing hips?* Do you ask those same **17 year old GIRLS** if they're planning to *use them*? **DO I HAVE TO BE CONCERNED, JAMES-EDWARD** \\[insert surname here\\]?!\" Dad excused himself for the rest of the day and left. My Nana then threw her oven gloves at the door and told me to take some chocolate from her stash and to go upstairs. \n\nLoved spending my summer break at my Nan's... It's been a few years since this happened, but at least I can understand my Nan's reaction now.",
   "created_utc": 1693440632,
   "score": 41,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfvkux",
   "message": "I had severe cystic acne, and the conventionally attractive, young female doctor with perfect skin and a full face of makeup refused to prescribe me something, and instead told me that I shouldn't feel bad about having acne, because appearance didn't matter and personality is all that counts. :)\n\nIt took me several years to find a doctor who took me seriously, got my hormonal levels tested and put me on spiro, but that one woman was by far the worst. I went home and cried after.",
   "created_utc": 1693434494,
   "score": 142,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfyzyc",
   "message": "Was sent to a pain therapist to help me manage the pain I was having that my incompetent doctor at the time couldn’t diagnose (I later had to have spinal surgery and now have a titanium plate holding things together).  The pain therapist told me that I was faking my pain to get attention (really?) and that she would eventually break me and force me to tell her that my father sexually abused me (WTF!).",
   "created_utc": 1693435886,
   "score": 12,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfyg2t",
   "message": "I took my then 4 y/o daughter to a pediatric gastroenterologist.  First he said she's just being dramatic.  Then he said, well, she'll get married some day and be someone else's problem.  That was 25 years ago, and it still shocks me!  Turned out she had a partial bowel obstruction.",
   "created_utc": 1693435660,
   "score": 208,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfvkv9",
   "message": "“You have cute, soft breasts.” And then proceeded to smile at me. A male doctor said this to me. I’d gone in for a check up. Thankfully my GP took my complaint seriously and he was fired as I wasn’t the first to complain about him.",
   "created_utc": 1693434494,
   "score": 85,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfygjz",
   "message": "I was trying to get tested for ADHD and before that the doctor has to see if I'm lying or whatever so this is what happened:\n\n(I enter the room, not yet sat down)\n\nDr: Miss ninja? You're here about suspected ADHD?\n\nMe (now sat down): Yes Dr. \n\nDr: okay and why are you coming so late in life about it. People only develop ADHD as kids. It's highly unlikely you have it.\n\nMe (nervous and uncomfortable as I felt like he was wanting me to leave already despite just planting my butt on seat): My parents just thought I was a wierd kid. \n\nDr: Well give me all your symptoms\n\nMe (fidgeting with my hands and hair because I fidget a lot): I get distracted very easily, um, I struggle to keep focus, uh... (forgets everything I've researched when I know I have a lot of symptoms)\n\nDr: Well you don't have ADHD then goodbye\n\nMe: Doctor please. I know I have it, give me more than 5 seconds to think.\n\nDr: Fine. Write on paper and bring it to reception when ya can. Now goodbye Miss Ninja\n\n\nThe unprofessionalism was how he treated me almost straight off the bat. I've been doctors loads and every one gives you time to think and also type the obvious even if you seem to forget (like here the fidgeting and forgetting). Another unprofessionalism was how he wanted me out the door almost as soon as I got in. I was in 3 mins when patients are allowed up to 15 mins for their slot. \n\nI don't know if what I've read is true but I know adults can still get tested so he shouldn't have been so dismissive about it all.",
   "created_utc": 1693435665,
   "score": 58,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfyai8",
   "message": "I wasn’t educated about consent, but I knew that something in my relationship wasn’t okay. I was expressing to my therapist that I was feeling pressured into doing things I didn’t want to do and he told me “while there are some expectations that exist in a relationship, and that’s what boys want. You have to give in a relationship,”. I later learned about consent and realized I had been assaulted by my incredibly abusive and controlling partner.",
   "created_utc": 1693435596,
   "score": 105,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfxin9",
   "message": "I have Cystic Fibrosis but have also had a transplant. He was the only Adult CF Doctor for hours around me. My CF team and Transplant team are supposed to communicate and work together. He always refused to listen to me and would tell other Doctors I didn't get tests done that I had, which caused one surgery to be canceled until I managed to show them I did get the test done. When confronted for the millionth time he told me he didn't care he was the only specialist around he didn't want to deal with such a difficult case and would rather I just go ahead and die. Reported him but nothing came of it since it was my word against his.",
   "created_utc": 1693435279,
   "score": 214,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg3ppb",
   "message": "Resident doc interviewing me before regular doc came in to insert my IUD: any chance you are pregnant?\n\nMe: no\n\nDoc: how do you know?\n\nMe: I haven’t had sex since November (it was July by now)\n\nDoc (shocked): why haven’t you have sex? Don’t you live with your partner? \n\nMe: I don’t have a partner \n\nDoc: then why do you want an IUD?\n\nMe: I’m really hoping the last time wasn’t the last time!",
   "created_utc": 1693437867,
   "score": 48,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg6wmw",
   "message": "That either I cheated or my husband did because that kind of cervical pain was always chlamydia. It was an ectopic pregnancy that ruptured and resulted in emergency life-saving surgery. But thanks for listening. (My personal OB happened to be at the hospital that night and came to tell me the news herself, giving him the angriest look I’ve ever seen in a professional setting).",
   "created_utc": 1693439235,
   "score": 45,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfv1f5",
   "message": "I was in the middle of having a long time mental episode and I attempted suicide. The therapist who was admitting me to the psych ward told me he'd sue me if I ever tried what I did again.",
   "created_utc": 1693434277,
   "score": 44,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfx4di",
   "message": "Went in for knee surgery at 21 (f). Naked except for the hospital gown. I had to sit up and bend forward for the anesthesiologist, back of the gown undone and just holding it to my chest. He started stroking my back and said \"I usually have to do this to fat people or pregnant bitches, nice to do this on someone young and skinny for once\". I then went under. I woke up numb from the waist down, in a different colored gown and completely creeped out.",
   "created_utc": 1693435119,
   "score": 189,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfvwh6",
   "message": "It’s all in your head.",
   "created_utc": 1693434626,
   "score": 39,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfxde8",
   "message": "I was at the doctor for strep throat symptoms. I had just moved so I was seeing a new dr for the first time.\n\nHe walks in, is looking at my chart, doesn’t look up and tells me- you’re 7 pounds overweight. You need to lose weight.\n\nI was 112 lbs.",
   "created_utc": 1693435220,
   "score": 106,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfvpzv",
   "message": "\"That's normal in your line of work. Just ignore it, the pain will go away.\"\n\nI went in for shoulder pain, as my left shoulder would be killing me after a day loading trucks all day. This was an ongoing thing for weeks before I went to get it checked. \n\nDidn't examine my shoulder. Didn't have any x-rays done, catscans done, MRIs done, nothing. Hell, didn't even have me take my shirt off. \n\nTurns out that I had a torn rotator cuff. \n\nHad another doc tell me that the stomach pain that had me pissing myself, throwing up, and passing out was from gas. Again, without any type of examination, just listening to the symptoms. Two days later I was dying on the OR table from a necrotic appendix.",
   "created_utc": 1693434553,
   "score": 129,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg1dmw",
   "message": "I was at the doctors for yet another ear infection and he asked he to describe the pain and I said I could hear my heartbeat in my ear and it sounded like an explosion and he grabbed my belly and said “This is the only thing that’s exploding!  And this and this!” as he continued to grab and pinch my belly.  I was NINE",
   "created_utc": 1693436880,
   "score": 100,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfwla8",
   "message": "\"I don't have time to talk you about \\[health issue\\]. \" He said this  in an exasperated tone when I explained why I scheduled the appointment - and this is **after** entering the room 45 minutes after my appointment time (I was brought back and put in the room on time) and **after** he'd spent 20 minutes or so in the hallway outside the door talking football with the patient he saw just before me.",
   "created_utc": 1693434903,
   "score": 30,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfucup",
   "message": "Went to an insurance approved ON/GYN who explain my bad periods as “Well, that’s because Eve made Adam bit the apple and it’s God’s punishment for women” needless to say I went to another doctor who took the time to test me and found out I had endometriosis.",
   "created_utc": 1693434004,
   "score": 222,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfyh7p",
   "message": "He just said \" Don't worry about it, things will all work themselves out\" and did nothing. I shouldn't have paid for the appointment.",
   "created_utc": 1693435672,
   "score": 24,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg25n7",
   "message": "After he almost killed my wife (brushed off a case of Legionnaire's Disease as a cold), the doc later says \"You don't think Zebras if you hear hoofbeats.\"",
   "created_utc": 1693437213,
   "score": 28,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg3n4y",
   "message": "I was 14 and the doctor was looking at my chart and saw my weight. She asked if I had rocks in my pockets. Insinuating that I was heavy. I was average for my age/height and that comment destroyed me. She was a very petite woman that I was of course taller than and she had the audacity to make a comment like that to a young girl that was already insecure as it was. 17 years later and I still want to kick her ass.",
   "created_utc": 1693437837,
   "score": 28,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygd37q",
   "message": "Overheard the doctor tell someone else in passing that I was overreacting and being a cunt. All because I asked when the ambulance was arriving because my baby was turning blue (we were being transported to another hospital) . I fucking lost my shit on him. I made a complaint with the hospital and the state medical board. He no longer works in medicine in my state as the powers that be took my complaint seriously enough to look into other people's complaints too. Apparently he had a history of withholding pain medications from patients and had made a number of nasty comments towards parents and women in general. Fuck you former dr Prentiss, hope you rot in hell.",
   "created_utc": 1693441862,
   "score": 25,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfzzta",
   "message": "I have a genetic disease where people used to die from old age before this would kill you. In the hospital with pneumonia a bored doctor came in to talk about my kidney disease. I am 22 at this point. He looked me square in the eyes and said I should not have children. I reported him. He apologized. \n\nIn happy news, my son is 33 and did not inherit the gene. My 31 yo daughter did but had already decided with the way the world is going to not have children. She lives in Munich and is currently on holiday at her partner’s holiday house in ItalyI worked as a contributing member of society, made a ton of money, retired last year and got a perfect match from my brother and we are killing it any way you want to slice it.",
   "created_utc": 1693436300,
   "score": 72,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfwy0h",
   "message": "That i was a hysterical female who read too much on the internet.  Less than a month later, I was in surgery to open a 98% blocked coronary artery that also required the insertion of two stents.",
   "created_utc": 1693435046,
   "score": 89,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfr7yp",
   "message": "-told him I was suicidal, he told me I’m just on my period (I wasn’t) \n\n-another one refused to believe I didn’t have an eating disorder bc that’s apparently the only reason I could be thin\n\nHow do these people even make it through school",
   "created_utc": 1693432755,
   "score": 91,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg14xa",
   "message": "I had an Army Doctor tell me to get over having a TBI",
   "created_utc": 1693436778,
   "score": 23,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg2i0g",
   "message": "I had a military doctor say I had “butt aids” after I had an emergency colectomy.  It was all their fault.  They couldn’t figure out what was wrong with me and excessively prescribed steroids causing perforation of my intestines.   \n\nWhen I came out from anesthesia. Nurse told me I had a very nice healthy looking colon when they removed it.  Also told me I was in great shape.  \n\nSame doctor said I was a malingerer when I first came to him about my health problem and asked to be removed from flight status.  \n\nWhile not nearly as offensive, I had a military surgeon call me a depression child after I folded a bandage to clean my wound. \n\nI had a NHS nurse at Addenbrooke’s call me a baby because I didn’t want to walk.  They had removed my staples (US military doctors had stapled the wound, UK doctors use glue) and when I did stand up my gut opened like a zipper.  \n\nMy wife had the last three of our five kids au naturel.  The nurses did not want her to do this and were very rude about it each time.  They made fun of her.  Told her she was crazy. A few laughed at her during labor.  Every time they assumed I was forcing her to do it that way.  One time they made me leave the room so they could try to push her to get the epidural without me present.  It was her idea!\n\nI went to the ER after getting dehydrated and passing out. I hit my head on the bathtub.  The doctor told me I had COVID.  I told him I don’t have intestines and get dehydrated. I just need an IV.  He refused to treat me until I took a COVID test.  Told me he was the doctor and “we will see”.  Sat in misery for about 40 minutes for the test results.  I didn’t have COVID, I was dehydrated.",
   "created_utc": 1693437360,
   "score": 23,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg3rru",
   "message": "First pregnancy, my husband came to all my appointments with me. Twice, the doctor said,”and, if he really is the father…” \n\nJust found a new doctor after that. What a turd.",
   "created_utc": 1693437891,
   "score": 22,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfwej4",
   "message": "went in for what turned out to be a ruptured ovarian cyst the size of a baseball and couldn’t walk without crippling pain… the first doctor i saw looked at me condescendingly — without an exam — and said “ibuprofen should be enough for your womanly problems.”",
   "created_utc": 1693434829,
   "score": 41,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg2csq",
   "message": "\"You're 27. I don't know what you have to be anxious about.\"\n\n(This was in the 1990s)",
   "created_utc": 1693437299,
   "score": 16,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg2wov",
   "message": "I went in for emergency contraception and the doctor insisted that next time there was a condom failure I just “douche lightly” as that would accomplish the same thing. I just deadass looked at him incredulous and was like “Um, isn’t that NOT recommended? Because it encourages any sperm to go further up?” And he was seriously like 🤔. GPs don’t know much sometimes, especially in a town with anti abortion billboards alllllll the way in and out of town.",
   "created_utc": 1693437532,
   "score": 36,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg1n03",
   "message": "Tried to sell me MLM weight loss bars.",
   "created_utc": 1693436991,
   "score": 16,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg4y0n",
   "message": "Back in college, I went to see the doctors at Student Health about an issue.  It was a very nice, well-regarded university in the northeastern U.S.\n\nThe doctor (it was a doctor, not a NP) was going to prescribe me 5mg pills of a medication, to be taken daily.  He went to see if it was covered and was like \"Oh, sorry, our insurance only covers 14 pills per month.  Sorry, guess you can't take your medicine every day, unless you want to pay out of pocket.\"  He then shrugged.\n\nI then asked if this medication was sold in 10mg pills.  He said yes.  I then asked if the same plan would cover 14 pills per month of the 10mg pills.  He said yes.  I then asked if the pills were perforated.  He said yes.  I then asked if he could just prescribe me 14 of the 10mg pills, as that was covered, and I could use the perforation and take half a pill (i.e., 5mg) per day.\n\nThe doctor then got quiet, paused for a moment, got REALLY weird, and said \"You are suggesting insurance fraud.  I will not continue this discussion.  You need to get out of my office right now.  If you say another word to me about this, I will notify the insurance company and will notify the police and would recommend that they press criminal charges.\"\n\nI have subsequently told this story to several doctors later in my life at cocktail parties.  Nobody thinks it was insurance fraud.  Everyone tells me the doctor had no clue what he was talking about.\n\nI was a young, scared college student.  So I walked out and got no medication for my condition.\n\nThanks for nothing, doctor.",
   "created_utc": 1693438396,
   "score": 17,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg1ula",
   "message": "Had whiplash after an accident, original doctor did x-rays, saw new, slightly torn muscles in my neck. Apparently my insurance had changed and my bill was over $1700. Transferred all of my records to an in network clinic and was assigned a doctor that barely spoke English. \n\nShe kept scheduling blood tests and crap like that for me. I kept stressing that I just wanted my neck pain treated, couldn't understand what blood tests had to do with it? (Neck injury, treatment would've been covered by the person who hit me's insurance).\n\nOn my last visit, she proudly diagnosed me with subclinical hypothyroidism (which would've required specialists, medications also not covered by my HSA insurance). \n\nI asked her about my neck since I was still having pain. She smirked and said, \"you have your boyfriend give you nice neck massages!\"",
   "created_utc": 1693437081,
   "score": 14,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfzvbd",
   "message": "Had a pain in my side, my doctor ignored my plea, told me get my sugars down, 2weeks later my appendix rupture, was caught by the ER. Fucker nearly killed me.",
   "created_utc": 1693436247,
   "score": 33,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg41pc",
   "message": "Went because I worked on my feet all day on a concrete floor and my left ankle was swelling and I limped due to foot pain. The doctor looked at my ankle and said \"I hate to tell you but you just have fat ankles\". I was so upset that I cried all the way home. I never went back to him.",
   "created_utc": 1693438010,
   "score": 12,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg2vct",
   "message": "“You had a window kiddo” said to me after my epidural failed catastrophically during my c section and they just held me down and kept going.",
   "created_utc": 1693437517,
   "score": 12,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg7owo",
   "message": "Me: \"I'm showing a lot of symptoms of hypothyroidism, can we get a blood test?\"\nFemale GP: \"you're fat, so you think you must have a medical excuse? You're fat because you eat too much!\"\n\nEventually she relented, I got the bloods but she told me the tests were negative.\n10 years later at another GP I got retested. Not only was my hypothyroidism very severe they found the original test which also showed it as serious.\nShe lied to save face and ruined my life and my chosen career path (RAF).",
   "created_utc": 1693439573,
   "score": 13,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfxnm3",
   "message": "\"ADHD is only diagnosed in children. You are not a child. You do not have ADHD.\"",
   "created_utc": 1693435336,
   "score": 24,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyga7ak",
   "message": "I thought he was saying I had a nice pussy, but what he was actually saying was I have acute angina.",
   "created_utc": 1693440645,
   "score": 12,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfuczv",
   "message": "\" you should bake a potato and eat it for lunch at work. \"\n\n\nI was having hives during my period and I was suspicious my IUD was the culprit. The doctor didn't think so because, \" all the woman I've placed this in love it!\". Well I got her to take the IUD out and haven't had hives on my period since. Never went back to her though.",
   "created_utc": 1693434005,
   "score": 34,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfz4dd",
   "message": "\" come back in 2 weeks and bring your wife\"\n\nWhat the fuck are you supposed to think for 2 weeks?\n\nWhat he had to say was bad, but it turned out he was wrong.",
   "created_utc": 1693435937,
   "score": 10,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg4dh0",
   "message": "Not said to me but said about me. I found out from my friend (who went to the same doctor) that he had told her things about my last appointment. What about patient/doctor confidentiality?",
   "created_utc": 1693438151,
   "score": 11,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg7pnz",
   "message": "I got diagnosed with a Borderline Personality earlier this year. Doc told me there’s nothing to be done and I’d probably be dead within 2-3 years from suicide. Now I ain’t doing that because of spite. So, thanks doc?",
   "created_utc": 1693439582,
   "score": 9,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg1nu2",
   "message": "It wasn't what he said, but what he did.  I was having some discomfort in the liver area.  He asked me about my drinking, and I said when I was on tour with the band I was in (tours were usually only 2 weeks), I drank every night, but at home I rarely drank.  I assured him that I wasn't an alcoholic. He kinda scoffed at me and sent me for an ultrasound with a note attached saying \"possible ECHL abuse\".\n\nHe didn't tell me he thought I was an alcoholic, he just wanted the ultrasound person to know that he did, and he did it in doctor code that he thought I wouldn't understand.\n\nLiver was ok.  my problem was gallstones.  So anyway, I switched doctors after that",
   "created_utc": 1693437001,
   "score": 42,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfsz9q",
   "message": "I don't need your life story just your symptoms , that's when I went about having anxiety.",
   "created_utc": 1693433451,
   "score": 28,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg2rm8",
   "message": "Psychiatrist told me that he wasn't going to stop my father from abusing me. Because abusing me made my father happy, and he wasn't going to take away someone's happiness. Instead, he said I needed to learn to like and accept the abuse so I could be happy too. No idea how I didn't kill myself after that.",
   "created_utc": 1693437473,
   "score": 19,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfzkbi",
   "message": "My friend was diagnosed with diabetes and the doctor told them, that the only way anyone could have diabetes is that they eat to much sugar.",
   "created_utc": 1693436120,
   "score": 10,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygc6vs",
   "message": "I want to show this entire thread to my med students my god.",
   "created_utc": 1693441482,
   "score": 10,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg3sk6",
   "message": "Gynecologist was telling me that my appendix that he removed was cancerous. My husband tried to ask a question and the doctor said shut up you ask too many questions! This was his first question….wtf!",
   "created_utc": 1693437901,
   "score": 8,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygba2n",
   "message": "I assumed I was on ask women or something… but it is WILDLY telling all of these answers are from women :( \n\nI’ve been there too. And it’s fucking bullshit.",
   "created_utc": 1693441100,
   "score": 7,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygcrh6",
   "message": "When I was mentally very ill a few years back, I couldn’t work and I got on Medicare. I went to see a new gynecologist for an exam. After the exam, she said to me “well, you’re a healthy young woman…I don’t see why you don’t have a job and are using tax payer money for health insurance” I about lost it and felt shame like I never had before.",
   "created_utc": 1693441720,
   "score": 8,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfrggs",
   "message": "Went to the gyno and I kid you not the woman said \"you have a beautiful vulva\" and I noped outta there",
   "created_utc": 1693432848,
   "score": 22,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg1okg",
   "message": "Was in the stirrups and the (M) gynecologist jiggled my thighs. I forget what he said, but I didn’t like it. Found a new (F) gynecologist.",
   "created_utc": 1693437009,
   "score": 14,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfyel2",
   "message": "A Navy doctor once told me about the time he got the clap in the Philippines.\n\nFor context I was in the Marines and it was my final physical before getting out. I forget how the subject of STDs came up, maybe that was something that they tested for when taking blood. Anyhow, for whatever reason, he decided to tell me about when he got gonorrhea.",
   "created_utc": 1693435643,
   "score": 7,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg5zlf",
   "message": "When I asked for a referral for a sleep study for snoring, he said he'd do it, but if I just lost weight, that would fix it. My mom, dad, brother and sister all use C-PAPS for sleep apnea. The specialist took one look at the structure of my throat and said he'll do the test, but I more than likely have sleep apnea too.",
   "created_utc": 1693438844,
   "score": 8,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfx6ld",
   "message": "I have really bad period cramps/bleeding. Already on birth control but it literally doesn’t do what it’s suppose to do. I went to an actual specialist because my doctor was at a loss(she’s a great Dr btw) and the specialist suggested I take another form of birth control at the same time to see if anything happens. Then told me that they would have to regularly test me for cancer since birth control is carcinogenic and being on two would increase my chances of cancer 10 fold. 🙃 The fuck",
   "created_utc": 1693435143,
   "score": 13,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg0neo",
   "message": "\"Nice cock bro!\"",
   "created_utc": 1693436575,
   "score": 13,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg3i4u",
   "message": "When I peed blood and called to get results of my blood tests the woman said “are you sure you didn’t just eat beetroot?” Yes, I’m very sure the painful experience of deep red blood coming out of my penis was not beetroot.\n\nI’m also aware it was one of the office people who said this and not a doctor, but I was not impressed.",
   "created_utc": 1693437780,
   "score": 7,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg78gv",
   "message": "Had a gynaecologist comment on how difficult my cervix was to find, and he proceeded to roughly feel around for it AFTER he found it to annunciate his point. \n\nI don’t accept doctors appointments from males anymore",
   "created_utc": 1693439378,
   "score": 6,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg7oup",
   "message": "First baby was a miscarriage that showed up at my first scan, had to have a d \u0026amp;c and a week later went to my obgyn for check up. Sitting on the bed feeling all kinds of awful and the stupid nurse grabs the chart without checking the miscarriage sticker on the outside comes in and cheerily says \"so, how is baby doing?\" \nLooked her dead in the eye and said \"my baby is dead,  how do you think I feel?\" She left and I never saw her again.",
   "created_utc": 1693439572,
   "score": 5,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg2gil",
   "message": "Anxiety keeps me from the doctor.  I finally gave in an made an appointment where the doctor berated me for waiting so long.\n\nAnother was the doctor saying a joke and then putting his head on my lap while he alone laughed.",
   "created_utc": 1693437343,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg42oo",
   "message": "I went to a GI specialist after years of pain in my right side and a long family history of gallbladder problems. He didn’t even look at me, but turned to my husband and told him it was just menstrual cramps. (Turns out after several more years of suffering, I had to have my gallbladder removed.)\n\nI was seeing my OBGYN frequently while struggling with infertility. I requested for several months in a row after years of trying to conceive to be referred to a fertility specialist and she kept denying me telling me “one more month”. Eventually I became really insistent that she explain why she wouldn’t refer me and she told me I hadn’t been trying long enough, I asked for clarification because we had been trying for YEARS and she responded by rolling her eyes and saying “Ugh. There are just so many of you trying to get pregnant, I can’t keep you straight. One more month.”",
   "created_utc": 1693438022,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg4cnc",
   "message": "Tried to dismiss my daughters symptoms by saying “yes I see this often in Hispanic patients”. When we clarified we weren’t Hispanic, he said ,”oh I meant in native Americans”. My daughter is white and covered in freckles. 🤔",
   "created_utc": 1693438142,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg4ihp",
   "message": "My last doctor never looked up from his laptop during the whole visit. I switched earlier this year. Best decision I've made in a long time.",
   "created_utc": 1693438212,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg6e7n",
   "message": "My gallbladder was dying and doing so violently, ER gave me muscle relaxers. So I'm drugged out of my mind, stepfather beside me, too limp to react to the pain I'm still very much feeling. Stepfather gets up to use the bathroom, nurse unassigned to me sidles over and says \"maybe next time you'll use a condom\". Thanks.",
   "created_utc": 1693439016,
   "score": 5,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg8net",
   "message": "He told me I was to fat for my own good.  He was fatter than me.",
   "created_utc": 1693439984,
   "score": 5,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygfg5w",
   "message": "\"You gained seven pounds in a year. That's a poodle.\"\n\nAdios, asshole.",
   "created_utc": 1693442861,
   "score": 5,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyftxqm",
   "message": "\"You need to drink some Gatorade.\"  This was his \"diagnosis\" after my explaining I was just exhausted all the time, for no apparent reason, after recovering from a viral infection.  He didn't do any tests or physical exam.  Much much later, I was diagnosed with Chronic Fatigue Syndrome.  If only he had done his job, my life would be so different.",
   "created_utc": 1693433836,
   "score": 18,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg1esi",
   "message": "while in the throes of childbirth without pain relief-\"you may feel some discomfort.\"",
   "created_utc": 1693436893,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg8y46",
   "message": "my (M) physical therapist (F) joked I should switch hands to masturbate (I was there for tennis elbow.) I joked back that we could use her mouth and suddenly I have to find a new PT lol.",
   "created_utc": 1693440112,
   "score": 5,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygb13s",
   "message": "I'm an asexual, male, 30's at the time. Inform him--no, not sexually active, not going to be, not interested.   \n\n\n\"That's not OK, at your age, you should be banging as many of these hot collge girls in town as possible. That should be your only goal. Somethings broken, and you need to get it checked\"--argued against it, but in the end, i was like, fuck it--and tested for hormones and other shit i didnt care about.   \n\n\nAll of it came out totally normal. In the follow up, i just said, 'because i'm asexual'--To which he replied, \"No, that's not real. That's not a thing. Maybe for you, you can tell yourself that, but I would rather be dead.\"",
   "created_utc": 1693440995,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygcl72",
   "message": "I work in health care and cannot tell you how many stories I’ve heard of doctors dismissing/misdiagnosing symptoms. It’s terrible. Myself, I went to Mexico as an adult with a newish boyfriend and returned with wounds on my legs. I went to urgent care and they would not even enter the room fully. Told me they did not know what was wrong and backed out of the room. Ends up I had staff infections. Could have turned into sepsis. Could have died.\n\nEdit: the dude I went with told me to “pull my panties up and quit being dramatic”. Needless to say that was the beginning of the end.",
   "created_utc": 1693441646,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygeoex",
   "message": "Having a baby (at 17) might help me balance my hormones and give me something to live for 😂🙃",
   "created_utc": 1693442536,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygex6f",
   "message": "(Not me but my older sister) had unbearable GI issues for years growing up; pediatrician told our parents that “children get tummy aches” and to try peppermint altoids. She ended up having emergency surgery where they had to remove her entire large intestine because it was necrotic and had tumors. Permanent colostomy at 14",
   "created_utc": 1693442639,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygfhjf",
   "message": "Didn’t happen to me but my wife was at Ob/gyn and Dr rolled her stool up between wife’s legs and say “you smell really good”…..she meant the body spray but it was super awkward",
   "created_utc": 1693442878,
   "score": 4,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygfho2",
   "message": "I was so confused what type of surgery he was telling me I needed so I was asking several questions trying to make sense of it. \n\nHe literally looked at me and said “if you would listen you might would understand” \n\nI stood up and went and checked myself out. Because absolutely not.",
   "created_utc": 1693442879,
   "score": 5,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygbxeh",
   "message": "Doctor: \"Dave, try not to get an erection during this prostate exam\"\n\nMe: \"My name's Steve:\n\nDoctor: \"I know. I'm Dave\"",
   "created_utc": 1693441371,
   "score": 8,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfqr2o",
   "message": "“Wow you are skinny as hell.”",
   "created_utc": 1693432573,
   "score": 10,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg163g",
   "message": "While pregnant and he was doing my pap he said “it’s not mine is it.” First and last time I went to him lol.",
   "created_utc": 1693436792,
   "score": 9,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyfxin1",
   "message": "I was sick with the flu in college and went to the closest hospital to my apartment. My lips were all chapped and the doctor looked at me and he said, \"boys won't want to kiss you with lips like that\".\nMy boyfriend and I had also just broken up so that was a double whammy",
   "created_utc": 1693435279,
   "score": 5,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg41ch",
   "message": "I see why you’re acidic. It’s because of the nature of your job (call center agent). You guys like coffee, alcohol and smoke. \n\n-I don’t smoke and drink alcohol.",
   "created_utc": 1693438006,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg4n8t",
   "message": "\"You can keep doing cocaine, it won't affect Your diabetes\" I was like 🫨",
   "created_utc": 1693438270,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg6bvf",
   "message": "My first panic attack I thought I was having a heart attack. Feeling tachycardia, shortness of breath, intense chest pains and clammy. My husband takes me to the ER. The doctor looked at me up and down and said, “if you’re not dying, what are you doing in the ER?” \n\nLike really? Why so judgmental? I have had anxiety for years but never a full blown panic attack. Then she proceeds to talk about me to the nurses taking care of me in front of the hospital room door. Calling me a hypochondriac and wasting everyone’s time. She made me feel so worthless.",
   "created_utc": 1693438989,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyg6gzu",
   "message": "Not said, but noted on my chart - the doctor felt the need to document the fact that I had armpit hair. I was an adult at the time.",
   "created_utc": 1693439048,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygadte",
   "message": "I haven’t had a doctor say anything unprofessional directly to me. However when I was 12 years old I went for my yearly check up this was the first time I got to see the doctor without a parent in the room. I did have one issue that was embarrassing that I talked to him about. After my checkup he went into the appointment room that my sisters and dad were in for their check up. He told my dad in front of my sisters the issue I brought up to him. That broke and violated my patient doctor confidentiality. Then my sisters made fun of me for the private and confidential issue I talked to the doctor about.",
   "created_utc": 1693440721,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygbjv7",
   "message": "Take a walk in the sun every day.  You'll feel better.\n\n\u0026amp;#x200B;\n\nI had a doctor tell me that after I told her that my fatigue issues are so bad that I fall asleep in the middle of conversations.  Sometimes while **I** am speaking.",
   "created_utc": 1693441214,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygbvon",
   "message": "He kept me waiting for a half hour then yelled at me for being ‘late’. Then he saw that the ER had set me up with a neurologist and brain scans which got more yelling about seeing someone behind his back instead of just taking the medication he’d given me; medication that I had told him didn’t work and made me worse. He then decided that, despite being so sick I’d been in and out of the ER repeatedly, I was overdue to be pregnant and he started ranting about how I’d better have a baby within the next year.",
   "created_utc": 1693441352,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygbx3y",
   "message": "Let me count the ways. I have PTSD from Drs. I'll try to list some.\nAge 11, experiencing chronic pain and fatigue, Dr said it was attention seeking, which made my family teachers etc ignore it.  It was ankylosing spondylitis which wouldn't be dx for 25 years because of that Dr. Same Dr said that I met the criteria for chronic fatigue syndrome but that she didn't believe in it (1990 Australia) and offered no treatment.  Same Dr then said it was depression and prescribed me anti depressants without any education for my admittedly useless parents. They left me to it and within 2 weeks of starting the pills I attempted suicide having not been depressed before. I never took any anti depressants after that and neither my parents nor Dr even asked how the pills were going, never knew about the attempt, and never tried to refill my script.  Still returning to same shit Dr, age 13 she referred me to a rheumatologist.  At this point I had been in the kind of debilitating pain that adults are on fentanyl patches for, for 2 years, with no help.  Rhumy did tests and diagnosed me with something that is essentially a precursor to ankylosing spondylitis BUT didn't explain this to my parents or gp, and I felt relief and hope and grief when hearing j had a DX and teared up. Rhumy said \"I don't know why you're crying, you don't have cancer\".  He told my family there was no treatments for it and my mother took the dx to be a none dx. This all set me up for a life of hellish pain unmanaged and trauma and mistrust of people and shame. \n\nCut to age 16. Start having sex. Go to Dr for the pill. First Dr tells me women can't fall pregnant if they don't orgasm (Catholic Dr, 13 kids).  Fall pregnant, want an abortion. Second Dr won't refer for abortion until I have an u/s.  I see 8week heartbeat on screen and decide to keep. At 16 yrs old. This was Drs goal.  Third Dr, ob/gyn gets me to strip completely naked every single appt, does internals and breast exams every appt, I didn't know he was sexually assaulting me until I was pregnant with my second a decade later and nobody wanted to do these things.  Needed emergency C-section, during the operation, my obgyn and the surgeon were literally discussing how nice it was to work on a young body, it was disgusting. \n\nAll this by 16.. I'm in my 40s. I'm gonna stop because it's all triggery.  But it goes on throughout my life. But yea I have some disdain for general practitioners and some specialists tbh.",
   "created_utc": 1693441368,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jygd7xl",
   "message": "\"What do you think it is? Try googling it\"\n\nNext time i get there\n\n\"You're making yourself crazy, stop googling you'll just talk yourself sick\"",
   "created_utc": 1693441917,
   "score": 3,
   "submission_id": "165s0lp"
  },
  {
   "comment_id": "jyftubp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165s0lp"
  }
 ]
}