{
 "submission_id": "165t5ly",
 "title": "If a person that suffers Schizophrenia with hallucinations, is taken a photo in which supposedly one of this hallucinations is present, would they also \"see\" it on the photograph? Or would they create excuses as to why it can't be seen?",
 "selftext": "",
 "created_utc": 1693435255,
 "permalink": "/r/AskReddit/comments/165t5ly/if_a_person_that_suffers_schizophrenia_with/",
 "score": 114,
 "url": "https://www.reddit.com/r/AskReddit/comments/165t5ly/if_a_person_that_suffers_schizophrenia_with/",
 "comments": [
  {
   "comment_id": "jyfy5yr",
   "message": "Schizophrenia is not a one size fits all illness; so it depends.\n\nHallucinations and delusions are two different things. A lot of people that deal with hallucinations are aware that they have them; whereas a person with both delusions and hallucinations would be more inclined to fit the fact that the hallucination isn't in that hypothetical photo into the delusion.\n\nEdit to add: That goalpost moving to accommodate the delusion that I just described is assuming the hallucination isn't in the photo... It can be.",
   "created_utc": 1693435545,
   "score": 122,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfxsac",
   "message": "They do see it. My brother use to send me videos all the time he claimed were spy drones flying around his house. There was nothing in the videos. sometimes  the camera was just faced down at the grass for the whole video.",
   "created_utc": 1693435389,
   "score": 144,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfz6gf",
   "message": "I think it varies from person to person. Most of cases of schizophrenia as a whole have similarities but for the most part are very unique of one another. For example, I knew a person who was a paranoid schizophrenic who would hear voices. He’d record audio but when he played it back and it didn’t have the voices, he would say (and truly believed) that the government tampered with the recording with some secret technology. It’s such a terrible illness.",
   "created_utc": 1693435960,
   "score": 40,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyg1wt7",
   "message": "I don't have schizophrenia but I have experienced psychosis before. When my psychosis was really bad I took a video of a hallucination to show to my doctor so he would believe me. I saw the hallucination in the video as well. When my doctor said there was nothing there I thought he was lying and gaslighting me. I replayed the video afterwards and couldn't see the hallucination, so I believed he had hacked my phone and edited the video. However, when I started to get better, taking pictures and videos ended up being very helpful because I no longer saw hallucinations in them and could use it to tell if what I was seeing was real.",
   "created_utc": 1693437107,
   "score": 58,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfxzxt",
   "message": "This is the coolest question I've seen on AskReddit in weeks.",
   "created_utc": 1693435477,
   "score": 63,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfz6ox",
   "message": "I remember reading somewhere recently that sometimes schizophrenics will actually take photos of what they’re seeing in order to determine whether they’re hallucinating or not. I thought this was a great example of how useful tech could be in practical application.",
   "created_utc": 1693435962,
   "score": 14,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfyuoa",
   "message": "I met a guy who's hallucinations included touch and smell. I always thought it was only visual and verbal.",
   "created_utc": 1693435826,
   "score": 14,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfxt1g",
   "message": "Additional information (as per Rule 1 I think this is allowed, please correct me if I'm wrong), I'm thinking about a case similar to what is shown in the movie A Beautiful Mind , in which several of the characters we see don't actually exist.   \n\n\nPlease forgive me if this kind of schizophrenia doesn't actually exist, I'm not a medical professional and I'm trying to understand this as someone with no experience on the subject.",
   "created_utc": 1693435398,
   "score": 11,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyg91l6",
   "message": "Not schizophrenic, but I have experienced short term psychosis. Long story short, there are a bunch of different types of hallucinations. It’s not always like Donnie Darko or Fight Club where there’s a weird guy following you around, it’s more like there are things happening in real life that your brain perceives as ultra-threatening when in reality they’re not. \n\nIf you were to take a picture of these things, they’d still be there whether you were hallucinating or not, because they really do exist, but they’d stop being threatening to you after the episode was over.\n\nIt’s also worth pointing out that schizophrenia is very rarely a 24/7 condition, just like someone with depression doesn’t want to commit suicide 24/7. The episodes come and go.",
   "created_utc": 1693440153,
   "score": 10,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyg0kt9",
   "message": "So I've spoken with my Mum about this and also my sister. They are schizo-effective , meaning schizophrenia paired with another disorder. In their case it's schizophrenia and bipolar disorder. Funnily enough symptoms vary in intensity, depending on the individual. From my mother's experience she has had more audio hallucinations and my sister has had more visual hallucinations. What they experience is 100% real, to them. They are living it and the accompanying paranoia only facilitates the delusion, as other people can't be trusted, as they are questioning the sufferer's \"reality\".There are different types of schizophrenia, a spectrum [basically ](https://www.webmd.com/schizophrenia/schizophrenia-types)\nIt's a very complex mental illness and there is so much stigma and misinformation around those who suffer. I wonder is there a correlation with DMT (what we release when we dream).. like having sleep paralysis but you're awake and mobile but you just see and hear stuff....that's just torture .",
   "created_utc": 1693436544,
   "score": 10,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfzgfa",
   "message": "Both. Depends on the circumstances and the level of trust in the person pointing out the absence. Some might actually see the person, be confronted, look back and not see the person, and think they chose the wrong photo, change the subject, and move away from it",
   "created_utc": 1693436075,
   "score": 3,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyg11zc",
   "message": "I've worked with people who have schizophrenia, it can vary so much person to person. I don't know if there is a yes or no answer to as to whether they would or wouldn't see something in a picture. I'd say likely not, I don't know if they would make excuses necessarily. They may be very confused and upset as to why something they saw isn't in a photo.",
   "created_utc": 1693436744,
   "score": 2,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyga1ij",
   "message": "It’s a wild illness. I had a childhood from suffer from adult onset schizophrenia. Straight up “A Beautiful Mind” type delusions.\n\nAnti Psychotics really helped the guy",
   "created_utc": 1693440575,
   "score": 2,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygekn4",
   "message": "Similar conundrum as [The Three Christs of Ypsilanti](https://youtu.be/cVkeCPHoXNM?si=_QvjWIj8LRSDG5wP), where psychiatrists put three dudes in a room, together, who each earnestly thought that they were Jesus Christ.",
   "created_utc": 1693442493,
   "score": 2,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygkti4",
   "message": "I knew someone before who suffered from schizophrenia and got to ask him some questions about it. I didn’t ask this specific one but I did ask why, when he heard a voice, he couldn’t just ask someone else in the room if they heard it too. He said that his brain would lie to him and say that they said yes even when they said no. That’s when I finally understood that it isn’t a problem with your eyes or ears or anything, but with the reasoning systems that hat they’re all ultimately plugged into.",
   "created_utc": 1693445099,
   "score": 2,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygl3ru",
   "message": "we see it, at least i do. I have a video of a praying mantis that was posing like marilyn monroe and talking to me and i saw that every time i looked at that video for months, I saw strange animals on top of our barbeque grill that no one else saw in the pictures. I saw it consistently. I was hearing noises in the attic, and I made my boyfriend go take pictures up there to prove there was nothing there and it did not prove there was nothing there, because I saw the outline of bodies in the insulation. But once I came back down to reality a little, I dont see it in the pictures or videos anymore.\n\nI didnt point it out to people but I did feel they were all lying to me for whatever reason.\n\nThe praying mantis video still kind of looks like he could be talking though its a cute video.",
   "created_utc": 1693445217,
   "score": 2,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygm2zm",
   "message": "No two people with schizophrenia are the same. It’s very complex. My partner has it. He has his own system to check if what he is experiencing is real or not. He’d probably accept it but another person I knew that had it definitely wouldn’t have and would have found any reason to not believe you.",
   "created_utc": 1693445628,
   "score": 2,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyfyiiq",
   "message": "Check out a channel on YouTube called Soft White Underbelly. He does an interview with a schizophrenic man named Chris. It’s a very interesting peek into the mind of a schitzo.",
   "created_utc": 1693435687,
   "score": 4,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jyg7jpf",
   "message": "The original",
   "created_utc": 1693439512,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygadu3",
   "message": "Well I asume they would KNOW its not real.",
   "created_utc": 1693440721,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygg98f",
   "message": "Government / space aliens / magic / future agents edited the photo... Or, it's a different photo, or it's there in the photo.",
   "created_utc": 1693443203,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygml6v",
   "message": "I’ve seen schizophrenic folks using a camera to determine whether they’re seeing a real person or not. However schizophrenia is different in everyone so that may not be a one size fits all approach.",
   "created_utc": 1693445837,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygpd0r",
   "message": "I saw a guy on Youtube once talking about his schizophrenia, and he says that one of his strategies to know if he’s hallucinating or not, is to point his phone camera at it. He said it’s even awkward sometimes when people catch him randomly pointing his camera at them hahah",
   "created_utc": 1693447018,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygpf58",
   "message": "There is no one size fits all with a lot of these things. There's a few comments with anecdotes where people did see their hallucinations in photos and videos, but then SBSYK had a a person on their channel with schizophrenia who spoke about needing to use their phone to see if people were hallucinations or not, because hallucinations wouldn't show up for them.",
   "created_utc": 1693447044,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygqj40",
   "message": "Not able to exactly answer your question, but in a similar vein, I used to have auditory hallucinations quite a bit in my early 20s when I used to take hallucinogens, even days later when \"sober\". One of the most vivid ones I had was I was laying in bed with my then partner trying to sleep, but I kept hearing a motorbike doing circles around my flat. As soon as I voiced my frustration my then partner pretty said the fuck are you on about, there's no sound.  The noise completely disappeared before she even finished saying it.",
   "created_utc": 1693447515,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygrb3a",
   "message": "Actually, they typically cannot see their visual hallucinations through a camera, and it’s used in treatment",
   "created_utc": 1693447850,
   "score": 1,
   "submission_id": "165t5ly"
  },
  {
   "comment_id": "jygu7rx",
   "message": "I suffered from delirium tremens when I quit drinking. Before I went to the hospital, I could hear and see things. I didn’t realize that hallucinations could be part of detoxing, so I was constantly looking for who was talking and searching for whatever just ran out of my room. I started to record the hallucinations, and when I watched it back, nothing was there. \n\nHowever, I do think that seeing/not seeing the hallucinations in pictures and videos depends on the severity of the illness.",
   "created_utc": 1693449157,
   "score": 1,
   "submission_id": "165t5ly"
  }
 ]
}