{
 "submission_id": "165v8wu",
 "title": "What was the craziest scandal that happened at your school?",
 "selftext": "",
 "created_utc": 1693440504,
 "permalink": "/r/AskReddit/comments/165v8wu/what_was_the_craziest_scandal_that_happened_at/",
 "score": 167,
 "url": "https://www.reddit.com/r/AskReddit/comments/165v8wu/what_was_the_craziest_scandal_that_happened_at/",
 "comments": [
  {
   "comment_id": "jyga9fj",
   "message": "* Drive by in the school parking lot\n* Shooting threat inside the school\n* Teacher getting arrested for defrauding the school\n* Used syringe on campus\n* Special ed teacher insulting a disabled kid\n* Teacher forcing a kid to poop their pants in class\n* Teacher using a disabled kid to shame the class\n\ndefine craziest",
   "created_utc": 1693440671,
   "score": 36,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyga6lu",
   "message": "My teacher got married to my other teacher, I was homeschooled",
   "created_utc": 1693440637,
   "score": 124,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygchpv",
   "message": "We had two on duty cops in the school everyday. The had a small office next to the gym. One of them was caught fucking a 17 yr old in the ass while on duty, not like it would of made a difference. He ended up getting fired/arrested. She ended up being the butt of jokes for years afterwards. The sadder part is she was not even that pretty, he just used her for her body.\n\n\u0026amp;#x200B;\n\nThe second craziest scandal was when in senior year we would be interviewed by the school newspaper so they could print something, anything really about you and your future. A friend of mine posted a poem, no one new about it until a week after his body was found, hanging under a bridge, a suicide. The poem exactly described the scene as to how he would be found.",
   "created_utc": 1693441606,
   "score": 59,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygcaxl",
   "message": "High school teachers sleeping with their students.",
   "created_utc": 1693441527,
   "score": 230,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyga4tt",
   "message": "In high school, a couple was caught having sex in one of the classrooms",
   "created_utc": 1693440615,
   "score": 205,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygn34b",
   "message": "Step brother and step sister were banging each other. \n\nAlso we had a Japanese exchange student stay with a friend’s family and my friend tried relentlessly to sleep with her but she was not interested in the slightest. He eventually gave up, she finished the semester and went back home. \n\nCouple months later it was revealed that she had sex with his younger sister.",
   "created_utc": 1693446049,
   "score": 184,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygsk3x",
   "message": "Leaked sex tape of My friend and her BF. Pretty sure it is really viral on my city and lead to expulsion to both of them",
   "created_utc": 1693448414,
   "score": 148,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygaksn",
   "message": "A kid in my highschool went to sweden and became a gay pornstar",
   "created_utc": 1693440804,
   "score": 166,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygai5o",
   "message": "Two kids having sex in middle school,\nTwo kids having sex in high school,\nVape falling out of kids pocket during PE,\n8 fights in one day,\nWeed on bus,\nAnd that's all I can think of right now",
   "created_utc": 1693440773,
   "score": 196,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyggyn6",
   "message": "Looking back, how many of my high school staff were wildly inappropriate is actually kind of amazing. \n\nThere's the football coach who was *totally not* hooking up with a senior girl, then the school investigating and determining he did nothing wrong. Then, after she graduated, they got married.\n\nMy fifth grade teacher got rolled up in a kiddie porn investigation. This one was definitely the worst scandal. \n\nTwo of the teachers in the same hall were banging and each was married to someone else at the time. He would play Tim McGraw songs loud enough that she could hear in her room, and she would play Faith Hill songs back. They tried to play it off like that wasn't fucking obvious. Also married to each other. \n\nOh and the english teacher who kept wearing thongs to school, and for some reason always found an excuse to bend over. The oldest kid in that class was 16. Yikes!\n\nBunch of thirsty motherfuckers. And here I was, not getting past 2nd base until age 20 lol.",
   "created_utc": 1693443504,
   "score": 34,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyglanl",
   "message": "We had a fake student enrolled at our school, who had created this elaborate back story of being a foreign student. It was later proven he was a grown adult and a wanted criminal.",
   "created_utc": 1693445299,
   "score": 148,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygj123",
   "message": "Ohhhh man! This one time we had a girl sleep with one of the teachers, lmfaooo I was talking to my buddies about it at a music store. We were even talking to the store owner about it. We were all making jokes about it having fun and shit. After we all left the store,  I got about 10 steps away and got a cold shiver down my spine. I realized the whole time we were talking about her (by name). I didn't clue in and totally forgot it was her DAD that owned the store! \n\nI ummmm never returned to that store.",
   "created_utc": 1693444360,
   "score": 116,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygbzcw",
   "message": "Kid ran at a cop with a knife and the cop shot him in the chest.\n\nFemale teacher was dating a student secretly and they stayed together for over ten years.  They broke up and he went to the police and she is now in jail for rape.",
   "created_utc": 1693441394,
   "score": 214,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygfoe4",
   "message": "One of my classmates got caught  SUCKING  COCK FOR ONE  SMOKE  CALLED BOTH  STUDENTS  PARENTS. 6TH  GRADE",
   "created_utc": 1693442959,
   "score": 8,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygkd02",
   "message": "Girl got pregnant in Yr 8 by a Yr 11. \nOne kid stabbed a teacher.\nAnother lad got expelled for flashing  a teacher.",
   "created_utc": 1693444910,
   "score": 26,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygndf3",
   "message": "A football player made up a lie about the new young female teacher having sex with him. She was suspended for a month while an investigation occurred. He kept telling administrators and students that he had lied and he was sorry. She eventually came back and he was sent to the alternative school for it.",
   "created_utc": 1693446167,
   "score": 97,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygp6ba",
   "message": "A mom who was hurt that her daughter didn't make any of the Hall of Fame categories demanded that it be removed.   Just in case, By Hall of Fame categories, I'm referring to \"Most Likely to be a Millionaire\"  \"cutest couple\" etc...",
   "created_utc": 1693446936,
   "score": 78,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygcn5c",
   "message": "Health teacher raped a kid but got acquitted, I know for a fact that she did it but the moms in town pretend she's innocent because they like her",
   "created_utc": 1693441669,
   "score": 132,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyga97q",
   "message": "A girl in my grade got pregnant.",
   "created_utc": 1693440668,
   "score": 24,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygbnp1",
   "message": "I called out my elementary school music teacher (Mr. Testa, google his name and it’s the first article that comes up, although they redacted his name) for his odd interactions with the female students, and he just laughed it off at the time. 3 years later, my friend sends me a news article mentioning how Mr Testa was charged with child exploitation",
   "created_utc": 1693441259,
   "score": 152,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygboz3",
   "message": "Easy.  A girl got pregnant by her boyfriend, before they married.  She came to me for an abortion.  It was unheard of then for a girl to get pregnant and not marry.  Common today, though.",
   "created_utc": 1693441274,
   "score": 6,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygd69c",
   "message": "Kids got arrested (elementary)",
   "created_utc": 1693441898,
   "score": 12,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygjwcm",
   "message": "Pot growing in the lunchrooms decorative planters and the ffa greenhouse",
   "created_utc": 1693444721,
   "score": 86,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygm1br",
   "message": "At my high school, we were the Warriors! Every Friday during football season the song Warrior (yeah, the bang bang one) would play on the intercom throughout the school. Well, one Friday someone changed the song to Prince's Sexy Muther Fucker. Hilarious. It lasted good minute or so.",
   "created_utc": 1693445608,
   "score": 249,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygmvr8",
   "message": "Did you ever see that Drew Barrymore movie Never Been Kissed? It’s based on a true story where LA Weekly did an expose of a reporter at Hollywood High when I went there. Except in the real story there was extensive accounts of SA, drug dealing, and teacher student relations. Me, I was ditching everyday to go play street fighter —and they said I was the delinquent smh",
   "created_utc": 1693445963,
   "score": 41,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygcxrc",
   "message": "Some gang kids beat up this other student. They had to arrest the kids a couple weeks later. The best up kid had to go into witness protection. Pretty crazy.",
   "created_utc": 1693441796,
   "score": 15,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygksdf",
   "message": "Dead people. A lot of dead people. I went to parkland!",
   "created_utc": 1693445086,
   "score": 14,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygnjqx",
   "message": "I have another one. On the last day of school there was bouncy houses. Wind picked one up about 60ft in the air while a girl was in it. Slammed her down and she died like 3 times but she is alive and doing well now.",
   "created_utc": 1693446243,
   "score": 22,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygeeyn",
   "message": "I had such a boring school. Worst thing I can think of was the guy who cemented an old kid's swingset on the grounds (I'm talking digging holes, putting it in the ground and then pouring in quik-set) and the school threatened to not let him graduate unless he got rid of it.",
   "created_utc": 1693442425,
   "score": 187,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygfcsn",
   "message": "My teacher was caught by the local creep catchers and had the video posted on our school Facebook page.",
   "created_utc": 1693442823,
   "score": 40,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygffvs",
   "message": "2 “bomb threats” In a week I believe, part A was actually dealt with and we had to evacuate, the guy (who wears a fedora) said some joke along the lines of “you don’t know where I hid the bombs” there were no bombs.\n\nPart B, someone tweeted something like “I’m about to blow up the school” he got suspended but we didn’t have a threat, personally I think he was about to take a Big shit and “blow up” the toilet but that’s just me",
   "created_utc": 1693442858,
   "score": 88,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygg4fd",
   "message": "Our art teacher was caught with a nude drawing of one of the students 🙃\n\nEdit: We were in high school, so student was 14 at that time. A batch lower than me 🙃 And the nude was drawn from fantasizing about the student, cause obviously we didn’t have nude art classes",
   "created_utc": 1693443146,
   "score": 84,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygiu0i",
   "message": "Someone set one of those big rolls of toilet paper on fire in a bathroom stall. Pretty exciting for grade 10.",
   "created_utc": 1693444280,
   "score": 60,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygiu5o",
   "message": "Eighth grade got pregnant and the dad was one of two guys, she didn't know which.",
   "created_utc": 1693444282,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygkbpj",
   "message": "[removed]",
   "created_utc": 1693444895,
   "score": 165,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygksf9",
   "message": "someone found a dead body in the back behind the dumpster in 6th grade. it was the first day.",
   "created_utc": 1693445086,
   "score": 28,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygl5bh",
   "message": "My 3rd period highschool teacher got caught butt booty naked wanking his you know what in his class during lunch break.\n\nWhat makes it worse is that he was sitting in a chair he and everyone else knew a student frequently, if not always sat in it.",
   "created_utc": 1693445235,
   "score": 73,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyglr8v",
   "message": "The easy girl in HS slept with the assistant principal during a prom lock in in his office.. he got fired \u0026amp; went to jail, lock ins were banned after that\n\nA girl gave head under the lunch table for a few dollars \u0026amp; pack of cigarettes",
   "created_utc": 1693445493,
   "score": 173,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygm3zq",
   "message": "This was way back in the 90's, but a girl who was in the grade above mine and was the daughter of one of the school administrators killed herself because she was in love with one of our teachers, though it was never made clear whether the teacher in question had been involved with her in any way that could be considered inappropriate or it was one-sided and she simply had a unhealthy fixation with him.",
   "created_utc": 1693445639,
   "score": 29,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygmfif",
   "message": "There was a gal that got pregnant on school grounds and the starved her self till she miscarried",
   "created_utc": 1693445772,
   "score": 24,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygmg7q",
   "message": "Hidden weed business behind the school. The school was surrounded by woods",
   "created_utc": 1693445780,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygmyc9",
   "message": "2 high school seniors \n, 3 juniors, and a sophomore dude’s “running a train on ms. Milller a 26 yr old substitute science teacher at a party she had at her house after the Friday night football game”. But we didn’t have cell phones in 1990 so it was true but stayed a rumor 😉 just to keep the action going. But we had to park across the street at a Walmart and walk over so the neighbors wouldn’t think shit was going on with all the cars parked on street.",
   "created_utc": 1693445994,
   "score": 22,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygn5n7",
   "message": "Our athletic director was being touchy with the girls and always had them in his office for so long. Turns out he was having relations with him. He didn’t get fired for like 6 months even when everybody knew.",
   "created_utc": 1693446079,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygnb18",
   "message": "My good friend started sleeping with her married basketball coach. They graduated her a year early he stopped coaching, got divorced, and now they have been together for like 15 years. Classic coverup by a bunch of bureaucratic pussies who don’t want any bad press for their highly regarded school. Still pisses me off to this day.",
   "created_utc": 1693446141,
   "score": 253,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygnh2l",
   "message": "A guy in high school got severely fucked up on a variety of drugs while at school, ended up puking on a couple of students during class, then passed out.  \n\nParamedics were called.  He was out of school for a few says then came back.  \n\nThe fucked up thing about it is his only punishment was a 3-day suspension (which took place while he was recovering).  His parents were very rich and his mom headed up the school board, so yeah, go figure.  That same year there was a senior who got expelled for being drunk.  The only reason he got caught is because he smelled like alcohol.  Mind you, this guy had no prior history of being a troublemaker.  \n\nThe double standard pissed off students and parents alike, but nothing was done about it.",
   "created_utc": 1693446211,
   "score": 84,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygnjib",
   "message": "*Teacher fired for having sex with a student in the dark room.\n\n*Teacher arrested but acquitted for murdering his family.  General consensus was that he had done it, though. During the investigation it also came out that several teachers in the district had formed a swingers group.\n\n*The mother of a girl in my grade slept with three guys in our senior class. She worked with our church youth group and gave me a hug every Sunday. If I had only known how much more might have been on the table....",
   "created_utc": 1693446240,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygno2l",
   "message": "American Vandal. Watch it if you’ve never seen it.",
   "created_utc": 1693446294,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygo1ra",
   "message": "Not in school,but college.\n\nWe have 2 male cardiology teachers which are very renowned in college and in the hospital we do internship. Both are married and with kids.\n\nAnd this year both had sex with students at different times and this news spreaded like wildfire, literaly everyone knows it by now.\n\nThe student council made the huge mistake of giving a message that the rumors(not saying what it is) were not to be spreaded else it would get in legal action.\n\nSo of course it acomplished the opposite of what it intended.\n\nNow everyone knows",
   "created_utc": 1693446453,
   "score": 28,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygob0d",
   "message": "Same old story - Teacher was fired for having an inappropriate relationship with a student. The whole thing resulted from an overnight field trip in which there was supposedly one seat short on the bus (interestingly enough, there wasn't because I was sitting in the back row and there was one empty seat back there), so the student rode the 7 hour drive with the teacher. Another student reported the situation when they didn't arrive where they were supposed to be when they were supposed to be there.  The teacher was retired military and as a result of the fiasco, not only did he lose his job and license to teach, he was also stripped of his retirement benefits dut to the nature of his conviction.",
   "created_utc": 1693446561,
   "score": 75,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygoeqq",
   "message": "A teacher was found having sex with a student on a table in the lunchroom.\n\nThis was middle school. The student was 13.",
   "created_utc": 1693446605,
   "score": 216,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygoglq",
   "message": "Our elementary computer lab teacher was arrested for embezzling funds out of fund raisers that the kids participated in. One of the fundraisers was just your typical \"Hey we're raising money for your school, sell enough shit and you get a party bus and pizza\". It wouldn't be that infuriating if it stopped there.\n\nThere was a girl in my grade who was diagnosed with brain cancer and leukemia at a young age, battled her whole life. During elementary school, we raised funds to take care of her treatments. The computer teacher was best friends with her. In fact, she was the only person the computer teacher remotely liked. And guess what? Computer teacher stole money from her fundraiser too.",
   "created_utc": 1693446627,
   "score": 160,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygonxd",
   "message": "Math teacher arrested for copying and distributing child pornography.",
   "created_utc": 1693446716,
   "score": 46,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygpljz",
   "message": "When a new kid moved in from Detroit and was (allegedly) offered drugs by our local  \"gang\". He (allegedly) refused and told admin about it. The \"gang\" (allegedly) caught him one ~~not~~ night walking across the dark quad to a basketball game and stabbed him with hypodermic needles.\n\nHe didn't stay long at our school.",
   "created_utc": 1693447122,
   "score": 47,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygppht",
   "message": "Two kids got in a fight outside school about half an hour before school started. Let’s call them A and D. Their parents got involved in the fight. Suddenly, A’s father whips out a gun and D’s grandma pulls out a taser. At the end of the fight, the grandma’s wig had been tased off. D’s mom also got involved in a physical fight but she didn’t have a weapon. The police came and arrested D’s mom and grandma but A’s father ran away and was never found. The fight wasn’t planned for that day though. I don’t know why the parents just casually brought weapons to school. Also, my school (middle school) shares the same courtyard with an elementary school. All the elementary school kids saw this. I can only imagine how it traumatized the little kids.",
   "created_utc": 1693447168,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygqmzw",
   "message": "🔫  Pew Pew",
   "created_utc": 1693447561,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygqqjz",
   "message": "A journalist enrolled as a transfer student with forged paperwork in order to attend school undercover so she could write an article about high school kids as an insider. We all thought she was a narc, but the fact that an adult successfully infiltrated a school like that ruffled a lot of feathers.",
   "created_utc": 1693447603,
   "score": 12,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygqrpg",
   "message": "Principle got caught fucking a math teacher in her office",
   "created_utc": 1693447617,
   "score": 26,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygqtpj",
   "message": "Cheerleader team got suspended and canceled cause a video came out of them getting train ran on them by the football team. \n\nThe scandal was that mom's DIDNT want the girls to get suspended and the team canceled cause that would hurt the cheerleaders prospects of the other girls who did not participate in the act.",
   "created_utc": 1693447641,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygquil",
   "message": "i coached wrestling at a private school, thats the only way i can call it \"my school\"\n\nthe kids all knew this 1 female teacher who lived on campus had a student fuck boy\n\ni didnt care, it was consentual sex\n\nthat wasnt a big deal or scandal\n\nyears after i read about a headmaster that had been molesting/raping kids there for years\n\nanother employee did something similar, these 2 were the only ones who got busted, there may have been more victims",
   "created_utc": 1693447650,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygqx9w",
   "message": "There were A LOT but this one takes the cake. \nThere was a guy in my class we’ll call him Bird. Him and I were in classes together since we were in sixth grade, but we could not have had different experiences. I tried to help him with homework, organize his backpack, I did whatever nerdy tween/teen me could do for him. It didn’t matter he would still be mean to me sometimes. \n\nFast forward a few years and we’re in high school together. He had been dealing weed and Juuls nothing crazy. Eventually it turned into Oxy. He was owed money by someone for drugs. He went to get it from them and a fight ensued. He was charged with attempted murder, only got convicted of assault of battery.\n\nHe went to juvie for awhile (made sure to call me a bitch one last time before he went in, because I wouldn’t let him borrow some of my stuff). \n\nWhile he was in juvie I was at a carnival with a friend and overheard his girlfriend and her friends talking about her pregnancy. She had morning sickness, and one of her friends was assuring her it’d go away in the second trimester. \n\nI’m not a math expert but that was not Bird’s baby. Also as a side note Bird had gotten her named tattooed on him while in juvie. \n\nWhen he got out she was very pregnant, and he was happy? I guess. At this point him and I didn’t talk but it seemed as though things were going well from social media.\n\nThe baby is born and about 6 weeks later he goes missing. My friend knows that supposedly he owed money to some members of a much more serious gang than his from a city west of ours. \n\nIt’s urgent he’s found because of course he’s diabetic and doesn’t have insulin. He stays missing for months. He is only found when him, his girlfriend, and a friend got their car stuck in snow. They demanded police pull it out of the snow and refused to comply. They are behaving erratically, yadda, yadda. \n\nHim and his girlfriend are arrested, child goes into custody, at which point his cousin and best friend, steps up to claim responsibility not only for raising the child but fathering him in the first place. \n\nHim and his woes have been a rollercoaster. Sometimes I feel bad for him, I really do. But I tried so hard to be his friend and help him and it just never stuck. But I wish him all the best.",
   "created_utc": 1693447684,
   "score": 41,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygqxt4",
   "message": "The BIGGEST one was a football player (16m IIRC) killed his pregnant gf (also 16f IIRC) then dumped her body in a trash can because she wouldn’t get an abortion. This happened a few years ago though, after I had graduated.\n\nWhile I was there, though, during my 9th grade year a freshman (14f) got caught sleeping with a hall monitor in McDonald’s 2014-15. Turns out they were “talking” for a few months, and he had a fiancé too. He’s still in jail btw\n\nEdit: typo",
   "created_utc": 1693447690,
   "score": 48,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygr8q6",
   "message": "Star athlete during his high school days turned girls basketball coach gets inappropriate with students. Gets swept under the rug. \n\nMoves on to become a Women’s coach at an NAIA university and is very successful…and I can’t recall what led to his mutual parting of ways. It was a forced resignation because he was doing the same thing with the players on that team. \n\nSo then he lands a gig across the country at another small school. Supposedly the players and their families from the previous school made calls to his new school about his inappropriate behavior and they reneged on his contract offer. Haven’t heard what he’s up to these days.\n\nSad thing is he had (or has, I would hope she left his creepy ass) a beautiful wife and child. But I’m from a small town and this family was treated like royalty for what they did for athletics for our school. The aforementioned coach had cousins I that were in or within a year or two of my class and they were always given the preferential treatment regardless of ability.",
   "created_utc": 1693447821,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygrhqo",
   "message": "The principal,  William Williams, got into a fist fight with the swim coach, Richard Richards.",
   "created_utc": 1693447932,
   "score": 142,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygrlda",
   "message": "A classmate murdered a girl dumped her body up in the hills and took a bunch of people up to see it they even made a movie about it",
   "created_utc": 1693447976,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygs505",
   "message": "Had a kid in my math class brandish a loaded gun and he said he was gonna shoot up the school on fb I later learned but never committed to it",
   "created_utc": 1693448223,
   "score": 11,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygs6tx",
   "message": "bro my school was tame as fuck mostly. only things i know of are a teacher once swearing at a student, and that one time a kid knocked a teacher out",
   "created_utc": 1693448246,
   "score": 20,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygsmn5",
   "message": "We had a janitor massaging girls feet in the janitor office on the top floor",
   "created_utc": 1693448445,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygsmni",
   "message": "Some kids I knew in high school stole a teachers brand new BMW car and took it mudding and completely destroyed the car. Dude she was so fucking mad. They stole the keys out her purse while she wasn't in the classroom and no one else was in the classroom.",
   "created_utc": 1693448445,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygt0wn",
   "message": "Drivers Ed teacher got a DWI in the drivers Ed vehicle.",
   "created_utc": 1693448619,
   "score": 85,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygt5hz",
   "message": "Someone put “n*#%a, n*#%a, n***a, we don’t want your black history” signs on the black students lockers during black history month. Chaos ensued. Lots of finger pointing, tension, anger and accusations. Never found the culprit. Come one year later, same thing happens again. Absolute shit show. Administration is all over it, bring in the FBI and fingerprint everyone who was at home sick, off campus or otherwise in the hall during that period. Come to find out it was a black student who was doing it herself to try and get her parents to let her transfer. It was a predominantly white private school, so local media was all over it. Heaven knows what it would have looked like in modern social media times. Tucker would have been streaming from our football field and the view would have had a round table in the cafeteria",
   "created_utc": 1693448676,
   "score": 168,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygt6jb",
   "message": "An undercover agent posed as a high schooler and busted a bunch of suburban kids for minuscule amounts of weed after conducting a yearlong operation. Ruined most of their futures. Then Rolling Stone did a cover story on it.\n\nEdit 1: GQ, not Rolling Stone.\n\nEdit 2: Link to the story https://imgur.com/a/LLEqkBw",
   "created_utc": 1693448689,
   "score": 67,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygt8pi",
   "message": "Janitor got caught downloading CP on the principals computer. \n\nWhen caught he yelled he isn’t going down alone. \n\nNever heard of anyone else getting caught.",
   "created_utc": 1693448717,
   "score": 26,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygtder",
   "message": "Junior year we had a gay class president. Halfway through the year, rumors started going around, there was video of the class president giving a blowjob in the stall. Around that time one of my buddies in the friend group got quiet all of sudden.  He was always laughing and talking. Then he disappeared for a couple months. He came back shortly after and one of us decided to ask him what was going on. We found out he was the one receiving the bj. Totally shocking, the last person we would expect. He then would drop out and never be seen again.",
   "created_utc": 1693448776,
   "score": 26,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygtlns",
   "message": "Cafeteria worker peed in the food",
   "created_utc": 1693448880,
   "score": 26,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygtnjf",
   "message": "Tenth grade pre calculus teacher molested/sexually assaulted multiple female students and disappeared back to India after being charged and awaiting trial",
   "created_utc": 1693448903,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygtrn2",
   "message": "Ex Marine Vietnam Vet math teacher body checked a 17-year-old student into the lockers. Once we heard which student everyone was like ''oh yeah...  he fucking deserved it'' he was...  not a pleasant person to be around. Anyway, I don't recall the teacher being deciplined, this was late 90's, and I don't think he hit him technically speaking, just slammed him into lockers and held him there for a second. Also, I didn't see it, and we had an overcapacity school, so most shit was wildly telephoned by the time anyone heard about it.",
   "created_utc": 1693448955,
   "score": 13,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygts9v",
   "message": "A pipe bomb in a locker",
   "created_utc": 1693448963,
   "score": 12,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygtwmr",
   "message": "Rugby coach was fucking a tenth grader",
   "created_utc": 1693449018,
   "score": 17,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygtxae",
   "message": "A girl had a train ran on her by 4 football players in the computer lab in high school. That has cameras... School found out and parents had to view the video. Safe to say she never came back and the guys were in alternative school for the rest of the year.",
   "created_utc": 1693449026,
   "score": 96,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygu2o1",
   "message": "Not mine but a friend of mines son said that his teacher was giving all the boy students her onlyfans account information.",
   "created_utc": 1693449094,
   "score": 36,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygu9e7",
   "message": "Joe Paterno arrived in limo to meet a football player he was interested in.  Kid got busted for pot that morning.  Paterno got back in limo and left",
   "created_utc": 1693449177,
   "score": 74,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygud0m",
   "message": "A girl supposedly penetrated herself with an item not meant for penetration. It was supposedly at a party in front of others. She was a legend. I dated the sister. She was less adventurous.",
   "created_utc": 1693449223,
   "score": 1,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygudjl",
   "message": "TW for sexual assault, suicide and murder: \n\n1. \u0026gt;!At my primary school, a 12 year old girl commit suicide in the bathrooms at school. It turned out that her stepdad was sexually abusing her and her mother was filming it. She had already gone to the police but they didn’t believe her. A post-mortem medical assessment confirmed that she was telling the truth.!\u0026lt;\n\n2. \u0026gt;!Teacher stabbed to death by a student at my high school.!\u0026lt;",
   "created_utc": 1693449229,
   "score": 49,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygugos",
   "message": "Staff Developer promised that Lady Gaga would make an appearance to cheer us on for an upcoming state test. She actually paid a look alike to Skype with the students!",
   "created_utc": 1693449270,
   "score": 44,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygw4xn",
   "message": "Within the first 3 years of its opening, it broke the district record for the largest cocaine bust in a high school for the whole county.\n\nWe were officially the druggie school for years until our rival school broke a record with...\n\nHEROIN!",
   "created_utc": 1693450040,
   "score": 249,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygznkq",
   "message": "Not really a scandal per se, but I’ll never forget this. When I was a freshman in high school in the late 80s, we had a pay phone in our cafeteria. Now remember, at that time, we didn’t have any sort of caller ID or anything. A sophomore thought it would be funny to call the White House and threaten to kill President Reagan. Two periods later (about 90 minutes), the FBI (might have been Secret Service) was at my school arresting him. I’m not sure how they figured out who called and from where, but they definitely did not find the humor in his “joke.”",
   "created_utc": 1693451741,
   "score": 75,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygupse",
   "message": "A bunch of asshole wrestlers forced some kids down and raped them with pop bottles and a broomstick.  Kid had to have emergency rectal surgery.  Antagonist is married with wife and kids like nothing happened….",
   "created_utc": 1693449383,
   "score": 206,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh1gvy",
   "message": "This didn’t happen at my school but at my nephew’s, this is the summary he wrote out:\n\n#The Banana Man Market\n\nI love this story!\n\nSo at my highschool there was this kid who dressed up in a banana costume and ran across the football field during the homecoming game. He was chased, by teachers, coaches, tackled, the whole nine yards. After the stunt he was suspended for the rest of the year and was going to be expelled. Enter the #FreeBananaMan Movement!\n\nStudents began running a black market that sold #FreeBananaMan t-shirts and it became a crazier as the principal of the school banned the t-shirts. You’d think this would just kinda fizzle out after that right? WRONG!! The ban didn’t just stop at the t-shirts. The absolutely BATSHIT crazy principal extended the ban to the phrase “Banana Man”, THE ACTUAL FRUIT ITSELF, and, oh yea, THE COLOR YELLOW!! No shit. She literally banned a whole ass color!!\n\nThis of course just made the student body declare all out war on the ban and kids began to chant “FREE BANANA MAN” during lunch blocks, which consisted of HUNDREDS of students at a time (it was a big highschool), dudes would come to school with only a yellow shirt on, get told to take it off, and then proceed to walk around shirtless, and kids with potassium shortages were forced to go to the nurse because they couldn’t eat their bananas.\n\nThis last item is what broke the banana’s stem as it were because the parents of those pour, banana-less kids threatened lawsuits against the school. Within a week the principal was “politely asked” to resign by the school board, Banana Man was freed with an official apology from the Superintendent, the yellow market was legalized, and the student body enjoyed bananas for lunch as a show of solidarity with our hero.\n\nIt. Was.\n\n#AWESOME!!!",
   "created_utc": 1693452661,
   "score": 2,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygxefj",
   "message": "the principal and my fourth grade teacher were making babies in a closet and I saw one of the babies and the baby looked at me.",
   "created_utc": 1693450637,
   "score": 164,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygwjky",
   "message": "There was a scandalous news story about how an art teacher allegedly made a girl pee in a bucket in the classroom's storage room. But what the news story failed to mention was that the school had recently implemented a new rule where during certain hours of the day, students in certain classes were not allowed to take bathroom breaks. This was one of those occasions and I felt so bad for the teacher because she didn't want the girl to pee her pants in front of her classmates.",
   "created_utc": 1693450229,
   "score": 174,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh5stw",
   "message": "Girl got raped and it was on video of dude dragging this girl into a hidden stairwell and then the principal waiting a few days to report it at that. People defending the guy by saying ole girl was a “hoe”. Also dude has multiple charges now against him for rape and sexual assault including state and federal charges. Last I heard he was out of jail. And yes if you know the story Fuck DK and fuck you if you defend him.",
   "created_utc": 1693454968,
   "score": 120,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygwdld",
   "message": "Okay hear me out, in my town they had banned dancing...",
   "created_utc": 1693450152,
   "score": 59,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygwmbt",
   "message": "my elementary school, a catholic school in a small town in the mid eighties.  A very troubled eighth grader who lived adjacent to the school convinced two young siblings to enter the school after hours through a way he had used before, and proceeded to gruesomely murder them both.  In our town it was notoriously referred to as the dungeons and dragons murders. I always thought that that was just some more bull crap from the 80s trying to convince kids that whatever they were into had something to do with the devil.  I was in high school one day where a local police office came to our class to do some safety talk, but afterwards stayed for a good hour just to answer questions any kid had.  somehow someone asked about the murder they heard of in town and the officer told a chilling tale- having been one of the officers on scene back when it happened.  he said after being caught the murderer was put into a mental hospital of sorts being a kid and was still locked up thankfully.  but sure enough he told how the murderer had been delusional and was obsessed with dnd.  He had believed to ascend himself/character in the game or perhaps real life, he needed to sacrifice two small children.  the small town has had a few random murders but that one is the saddest and most well known.",
   "created_utc": 1693450265,
   "score": 53,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygy23i",
   "message": "A kid in school told everyone that he walked in on the guidance councillor banging the secretary on the copy machine, the guidance councillor later confessed to the whole situation before a congregation at his church, members included his wife and kids, and her husband and kids. \n\nShe wasn’t expecting the confession and both of their marriages ended and they were terminated from their positions. Sadly, the secretary passed from cancer 2 years later, I never learned what happened to the guidance councillor.",
   "created_utc": 1693450955,
   "score": 47,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh49l8",
   "message": "M Teacher had affair with underage F student, shortly after his wife gave birth to baby. Teacher and student ran away together. Manhunt began. FBI’s most wanted list etc. Teacher serves time. Gets out of jail. Married now legal former student.",
   "created_utc": 1693454134,
   "score": 31,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh5wtp",
   "message": "We were doing punnet squares for blood test. A girl in my class asked if she was doing it wrong and our biology teacher looked at it and said “no you did it right, they aren’t your real parents “. Understandably she was a emotional wreck and she found out she was adopted as a baby from Africa. Because of that they stopped doing that project",
   "created_utc": 1693455031,
   "score": 106,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygz6f9",
   "message": "There was a teacher who was fresh out of college and she wound up getting caught hooking up with a 16 year old student of hers after a concert and promptly ruined her career. She had to pick him up because he didn't have his license yet.",
   "created_utc": 1693451506,
   "score": 38,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh2syg",
   "message": "Russian hackers posted leaked emails of White House staffers, some of which contained info proving that hazing was actively going on within one of our frats (because one of the staffers was an alum). So....Russian hackers were the reason one of our frats got kicked off campus permanently lol. DC school scandals are wild.",
   "created_utc": 1693453354,
   "score": 29,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh6m8m",
   "message": "Three girls stole the car keys of a girl they were bullying, took the car out on a joy ride during lunch even though none of them even had a permit. On their way back from lunch, they ran a stop sign going double the speed limit and hit a motorcyclist. The motorcyclist lived but was paralyzed from the waist down. The passengers were only suspended for 3 days. The driver's family had to pay out in a civil suit to both the motorcyclist and the girl she stole the car from but she was spared jail time because her family had money. She also became ineligible to apply for a driver's license until she was 31.",
   "created_utc": 1693455424,
   "score": 60,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygyq4z",
   "message": "Went to an all male Catholic school. We had an annual walkathon/fundraiser. We got sponsors for the walkathon while teachers brought in food to sell in class (doughnuts, slices of pizza, etc). One teacher got the bright idea to photoshop other teachers faces onto porn pics, then charge students to view them. Another teacher found out, did the same to the first teacher onto gay porn pics. Needless to say both of those teachers got fired.",
   "created_utc": 1693451283,
   "score": 60,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygwonf",
   "message": "Senior prank gone too far, they took all the dead cats/rabbits meant for dissection and hung them from ropes around the school and traumatized a bunch of kids. I think PETA or some other organization heard about it and was trying to get our school to switch to a computerized dissection program. \n\nAlso found out after I graduated HS my old math teacher threatened to bomb the school and was arrested.\n\nOH and one of the kids I knew got hit by a train after school when he was crossing the tracks just across from\nThe school. He had headphones in and decided to stop right on the tracks while he was texting and his friends couldn’t get his attention in time.",
   "created_utc": 1693450296,
   "score": 28,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh3k2k",
   "message": "Committed by me; $5 a month to automate signing up for a free period class, since our school used to run a system that would force you to sign up for a class every day or else you'd get no electronic devices study hall; me and a couple of buds wrote a program that would sign you up for a class automatically every day so you'd ever get the study hall, pretty simple\n\nIt got a fair bit of business to say at the least\n\nAnyways, one of my friends started abusing the datasets. we had a mini security breach, he leaked the password of some kid he didn't like. Should have made it more anonymous.",
   "created_utc": 1693453757,
   "score": 58,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygyva6",
   "message": "Highschool football coach (allegedly) bit (with his teeth) a shirtless freshman on his shoulder while he was taking a drink from the water fountain. It left visible marks. Coach also (allegedly) made lewd remarks following it.\n\nCoach was fired, the district tried to sweep it under the rug, and then he was elected to be a city councilman within a year or two.",
   "created_utc": 1693451353,
   "score": 30,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh0mr5",
   "message": "A boy convinced a girl to commit suicide, so they drove together up the mountain and he filmed her hang herself",
   "created_utc": 1693452231,
   "score": 45,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyguqff",
   "message": "Photo teacher had negatives of her nudes found by a student. She was cut free with a quickness.",
   "created_utc": 1693449391,
   "score": 8,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygvisa",
   "message": "My high school had a really prestigious football team for the area. Pretty sure a lot of people made it their whole personality. \n\nThe head football coach got caught using funds allocated for the team for his own personal expenses. So he got hella fired and lost his licence. It was a long protracted process and people were losing their minds. He managed to avoid any criminal charges tho. \n\nAlso, the football team was totally using steroids, but it never got proven.",
   "created_utc": 1693449758,
   "score": 19,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygzaad",
   "message": "I was a crossing guard in the 7th grade, which means we got to go to Washington DC during Spring Break. Our sponsors were the special ed teach and a PE coach. On the train ride up, she sat with the girls while he sat with the boys.\n\nDuring the week we noticed them getting chummier, but nobody really picked up on what was going on. The second night around nine pm, the coach walked into the room where the boys stayed and told us to not leave our room for any circumstance while he and Mrs. Ringland grabbed a quick bite. Oh, and to not tell anyone\n\nThat was the every night routine. My guess as a grownup? They were getting a room of their own and making the beast with two backs. \n\nOn the overnight train trip home, they sat together. That summer, they both left their spouses and moved to, rumor has it, El Paso.",
   "created_utc": 1693451559,
   "score": 38,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh20gu",
   "message": "Rumors went around that I did anal with my first gf… but I never got to 😭",
   "created_utc": 1693452938,
   "score": 5,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygvlrr",
   "message": "A freshman was running the mile in PE.  She was having trouble breathing and asked the instructor for permission to go to her locker and get her inhaler.  Instructor said to finish running the mile first, then go get it.  Instead she died.  Student was the daughter of my computer science teacher.",
   "created_utc": 1693449796,
   "score": 38,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyguy6v",
   "message": "I feel like Americans are gonna have a bit of an edge answering this question.",
   "created_utc": 1693449492,
   "score": 15,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygxoxs",
   "message": "My high-school counselor, who was married at the time, hooked up with one of the senior guys regularly in her office and outside of school. She was fired, but the kid was 18, so no legal action was taken, which is awful. Anyway, she ended up leaving her 2 kids and husband for the high-school dude once he graduated.... Crazy!",
   "created_utc": 1693450777,
   "score": 8,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh3phj",
   "message": "Guy shit in another kids back pack. Kid opened it and found a huge steaming turd on his books",
   "created_utc": 1693453837,
   "score": 13,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh3nt6",
   "message": "I am currently suspended for making bomb threats AMA",
   "created_utc": 1693453813,
   "score": 6,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh91yk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh3fky",
   "message": "Long after I graduated..........but one day , while reading the papers, was shocked to discover that my  5th grade teacher,  Mr. Neilson,  had been arrested by the FBI.  after they broke down his door, and discovered he was running an international  child pornography ring.\n\nThey removed 3 TRUCKLOADS  of materials from the basement of his New Jersey home.....and he was running an operation from his basement,  mailing this filth all over the world. .....some of which involved children and donkeys.\n\nThe wife claimed total innocence..........swearing she had not the slightest clue.....that he always kept the basement door locked.....but remembered  he hired a donkey once,  , supposedly for their daughters  birthday party......and thought it odd, that when she then left for a few days to visit relatives, the donkey was still there when she got back.    He swore in court, that he never used children  from his schools where he taught............which begged the question, where the hell did he GET the children from then, to make all this garbage. ?  He got 25 years to life for the seriousness of the crime.",
   "created_utc": 1693453692,
   "score": 27,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh9lcq",
   "message": "A women who was traumatized by the queen bee of the school stabbed her to death.  Think Mean Girls but with a stabbing murder at the end.   It was made in a movie starting Torri Spelling.  You can watch it on YouTube - “Death of a Cheerleader” or “A Friend to Die For”.",
   "created_utc": 1693457180,
   "score": 17,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygxk80",
   "message": "A kid i sat next to in science class ended up kidnapping a young girl and dismembering her after he graduated.\n\nAnother kid drank bleach, doused himself in gasoline and set himself on fire in the cafeteria. He didn't survive.",
   "created_utc": 1693450714,
   "score": 14,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygvne7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh7an7",
   "message": "Biology teacher, who had been reported many times by girls for his inappropriate behavior over the years, raped a girl who stayed after school to make up a test. Mr Fallowfield, I hope you die slowly, in great pain. Lawrence administrators who told us just to avoid him: hope you do, too!",
   "created_utc": 1693455813,
   "score": 19,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyhcim8",
   "message": "I took a shit in the urinal, school went crazy over it - held an assembly to try and out the perpetrator. I started freaking out that they will find out it was me, so to cover my tracks, i took a sharpie and went to the bathroom and did it again, but this time I tagged the walls of the urinal with a distinct graffiti tag that this bully I knew used to tag everywhere. It was similar to those S graffiti tags. I practised the tag for days before to master it before I did the second dump. So basically, when the principal went to investigate my second urinal shit, he saw the taggs around the cubicle doors and then held an assembly with my year level showing a photo of the tag and asking who did this. When everyone looked at the bully because they knew it was his, he stood up and got escorted out. They ended up pinning the urinal shits on him and my plan worked perfectly",
   "created_utc": 1693458948,
   "score": 13,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jygw8c4",
   "message": "Not exactly within school but related to my classmate. My female classmate's older sister (like 16 y.o.) had a bf (like 18 y.o. guy). He was visiting her occasionally at home. Aaaaaand her Mother seduced him and then he started frequently cheating (full power, nothing romantic). The Mother was divorced and lived with two young daughters and a little baby in a small flat. Her daughters had to look after the baby and they actually were spending a lot of time on that task. After the older daughter learned about the situation, the Mother didn't stop and the guy continued visiting them. I don't know all the details but I assume that fucked up the poor girl too much. After school she became a web cam model, despite the fact that she was pretty shy and modest. The younger daughter also lived quite a frivolous and destructive life. Don't know what's with them know",
   "created_utc": 1693450084,
   "score": 13,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyh5zy5",
   "message": "\nA high school teacher got caught by the police in the bushes of a local park engaging in homosexual activities. This was small town Midwest in the 1990s. He got fired.\n\nA junior high gym teacher likes to watch the boys shower. He would grab the towels from around their waist and snap them at the boys genitals. He also held the towels in the air to make the boys jump up and down trying to get them back. Everyone knew he was a pervert but it took years before he finally got fired.\n\nA student was Masturbating during class and showing off to his small group. The only girl reported him. The vice principal called her to the conference room to retell what happened. The boy was sitting right next to him while the girl was on the far side of the table. The vice principal was the football coach and the boy was on the team. Tried to get her to recant. Nope. Boys mother arrived and immediately believes the girl and insisted he apologize and face the consequences. He got suspended. The school never contacted the girl’s parents.",
   "created_utc": 1693455080,
   "score": 11,
   "submission_id": "165v8wu"
  },
  {
   "comment_id": "jyj3kui",
   "message": "A teacher had sex with 2 students",
   "created_utc": 1693494884,
   "score": 10,
   "submission_id": "165v8wu"
  }
 ]
}