{
 "submission_id": "166avpp",
 "title": "what's the worst failure you've ever had during a date ?",
 "selftext": "",
 "created_utc": 1693487718,
 "permalink": "/r/AskReddit/comments/166avpp/whats_the_worst_failure_youve_ever_had_during_a/",
 "score": 88,
 "url": "https://www.reddit.com/r/AskReddit/comments/166avpp/whats_the_worst_failure_youve_ever_had_during_a/",
 "comments": [
  {
   "comment_id": "jyip9ng",
   "message": "One time I was visiting a different city for work and decided to open up Tinder and see what was happening. I match a girl, she seems cute and funny and we're messaging for a bit. She then, very forwardly, asks if I'd like to go to a local concert with her that night. I said sure, but I asked if we could maybe meet at a bar first and she agreed.\n\nWe meet at the bar, and she seems very nice, albeit a little nervous or anxious. We have a nice conversation and seemed to have a few things in common and were hitting it off. However, she keeps insisting like - \"let's just have one drink and then go\" which at the time, I didn't think much of and thought sure, let's go that show.\n\nSo we Uber to the show, and it is in the middle of fucking nowhere. I'm in a new city and it's just in some far-off neighborhood like boonies type shit. It's a house-show. So she runs into some friends there. All of them are eyeing me suspiciously, which I found very odd. Like she introduced me, and they all kinda gave me a weird, sort of dirty look. But I was like - whatever, okay. Maybe her friends are weirdos. I tell the girl, \"hey, I'm gonna go get us a drink, want anything?\" and she says sure, and asks me to get a vodka-soda (or something).\n\nI come back and give the girl her drink and she goes \"hey so um, my boyfriend is here.\" And I'm just kind of aghast like...what? And all I can muster out is like \"Uh...is that a problem?\" Like maybe they're in some open-relationship or something? I'm grasping at straws here. And she goes \"Yeah, it's actually his band playing. I think you should go\" so I'm like **\"did you just fucking drag me here to make him jealous...and then change your mind?\"** and she's like \"no it's not like that okay, we're just in this weird place like-\" and she's about to start fucking *complaining* about their relationship to me and I'm like \"no, okay, I'm going, goodbye.\"\n\nI noped the fuck out of there, hop in a fucking *$80 Uber* back to my hotel and she has the  audacity to then text me like \"I'm so sorry, are you free another day this week?\" Instant block. Never blocked a number so fast in my life.",
   "created_utc": 1693489525,
   "score": 143,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiqj5g",
   "message": "Wasn’t told of an allergy, almost killed date. Well she should of voiced her issues to the server, and Me beforehand,was too busy instagramming her meal. Tree nuts.",
   "created_utc": 1693490023,
   "score": 5,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyisq5j",
   "message": "I had a supercharged muscle car when I was 19.  I worked up the guts to ask a girl out on a date.  At the time, she was far out of my league.  FAR.  She made 2006 Megan Fox look like boiled garbage.  But she agreed to a dinner and movie date, somehow.  \n\nI drove that car daily, rain or shine.  I never had an issue until I went to fire it up to go pick up my date.  It didn't want to start at first, then felt like it wasn't firing on all cylinders.  I didn't have time to diagnose it, so I limped it along hoping it would shake out whatever the issue was.  Maybe a plug got fouled?  I pulled into her driveway and the engine was struggling to idle.  She got in, didn't notice the engine wheezing, gave me this alluring smile and said \"oh, you better take it easy!\"  My mind was 100% on \"what the hell is wrong with my car\" mode and I misinterpreted what she said.\n\nThe next 35 minutes were awkward as hell.  I was speeding up, slowing down, contorting my neck to listen to the engine, and talking my way through diagnosing the issue.  She became disinterested after about 11.2 seconds, which also happened to be its 1/4mi time if it had been running right.  \n\nWe got dinner, watched the movie, and drove back in almost total silence (except for the exhaust which sounded like a pack of dying Harley Davidsons).  She got out of the car, said \"ok thanks bye\" and just left.  Meanwhile I'm looking at gauges, and visualizing everything going on in the engine.  The next day I changed out the spark plugs, coil, wires, and distributor components.  Ran fine.  \n\nI told my wife this story a few years ago and she said \"did you pull and check any plugs?  Could have flooded it and fouled one or two.\"  I was like damn, where were you back then??",
   "created_utc": 1693490875,
   "score": 230,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiqpww",
   "message": "She told me there were too many Malays in Malaysia, which is a type of racism I didn't know existed. At the end of the date she announced that she would see me again, but by the time I got home she had unmatched me.\n\nShe was odd.",
   "created_utc": 1693490095,
   "score": 56,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyirha0",
   "message": "I took her to a movie and the movie was so boring I fell asleep.",
   "created_utc": 1693490391,
   "score": 6,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiu93b",
   "message": "She turned up absolutely hammered to the date, proceeded to start crying and talking about her ex non-stop while drinking more and more. So I told her this isn’t going to work and left.",
   "created_utc": 1693491459,
   "score": 23,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyitdod",
   "message": "Went on a date with a girl from tinder. We met at a popular bridge, walked along the river on one side, came back up the other side and we said goodbye to eachother. She talked the entire time, barely got my name out.",
   "created_utc": 1693491125,
   "score": 182,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyir9lc",
   "message": "I mean it wasn't during a date but I was supposed to meet a guy at my place and as I opened the door his words were \"You're not what I expected, I'm going to pass\" \n\nLiterally no catfishing was had here but for some reason he felt the need to come to my door and be a little insensitive. At least he was honest though right?",
   "created_utc": 1693490307,
   "score": 54,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiu3wf",
   "message": "On the first date, my car stopped on the road due to an engine fault and we were stuck there for more than 6-7 hours.",
   "created_utc": 1693491403,
   "score": 123,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiv683",
   "message": "I went to a similarly named restaurant on the other side of the city, so I arrived almost an hour late. My bad, so I was ready to put effort into saving the evening.\n\nShe was the most boring person I have ever met. A tax advisor, and getting anything out of her was like pulling teeth. \n\nWhen I asked her what she liked to do for fun, she said \"travel\". Oh great, a topic where she will finally have something interesting to say. I ask her where she's been lately, she says \"lots of places, I normally go on cruises.\" I ask her what stands out, and she says \"nothing, really\". \n\nI paid for dinner, because I was late after all, and she asks whether she can keep the receipt so that she can use it to save tax for a client.",
   "created_utc": 1693491802,
   "score": 185,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiskl7",
   "message": "Date 1: we were enjoying each other at first, I asked her to homecoming and she said yes, by the end of the date we both realized we weren't very compatible but oh well.\n\nDate 2 (homecoming, something like a month later): picked her up, we were both faking enthusiasm, and I promptly got my dad's car totaled by pulling out into traffic like an idiot.\n\nWe were taken to the hospital as a precaution, but we were both okay. I called it a day; she went to the dance and reportedly had a good time.",
   "created_utc": 1693490817,
   "score": 206,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiuru5",
   "message": "Ordering a bottle of Blue Nun Liebfraumilch in a restaurant because I was so pissed after a daytime works Xmas party that I couldn’t read anything on the wine list but saw a bottle on another table. \nFortunately my companion forgave me and we are still married 44 years later.",
   "created_utc": 1693491653,
   "score": 27,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiut04",
   "message": "Does it count as a failure if they don't even show up?\n\nAfter the 5 or so time I just gave up and accepted the fact that I will die alone.",
   "created_utc": 1693491664,
   "score": 46,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyivcn2",
   "message": "They took me to a thrift store. I was fine with walking around and checking out stuff, kind of an odd date but hey thought it was something new. He literally filled his cart and was heading towards the check out. When it came for time to pay he told me that he had forgotten his wallet. So I ended up paying for him… I didn’t get a thank you or a please, or money paid back. After the date it was just awkward and I’ve blocked him lol",
   "created_utc": 1693491868,
   "score": 56,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyirx37",
   "message": "I 31F didn’t even make it to the first date because he 31M msged me first to TELL me I would be paying for what I wanted as that’s how he thought it should be.. I couldn’t believe it. Haha never in my dating years had I had a man tell me before the first date I would be paying for dinner. So yeah we both decided we wouldn’t meet up after that conversation. \n\nPs. I have no issues paying my bit (I always offer), but the way he said it to me rubbed me up the wrong way. He said he didn’t want to give off vibes that he would pay for everything in future etc.. not really giving me protector or provider energy at all haha.",
   "created_utc": 1693490564,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyipeov",
   "message": "The man asked me if we could split the bill.  \nAnd I agreed.",
   "created_utc": 1693489581,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyis21d",
   "message": "Back in college I had minor surgery one morning and then had a second date with a girl that night. The first date had gone really well. I was in a lot of pain on the second date and was bleeding under my bandage. For some reason I didn’t tell her and instead just stayed pretty silent the whole date trying to deal with the pain. She was definitely confused and we didn’t have a third date. No clue what I was thinking!",
   "created_utc": 1693490618,
   "score": 16,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyitihd",
   "message": "had to play another round in R6",
   "created_utc": 1693491176,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyitm7s",
   "message": "I and my ex ,we where on a date in a restaurant his wallet fell off his pocket and he didn't notice on till we where done at the restaurant , only for we to find out he got no money on him , so i had no option than to pay for the bills.",
   "created_utc": 1693491216,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiw2vs",
   "message": "Held her hair while she was vomiting",
   "created_utc": 1693492138,
   "score": 68,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiw4hd",
   "message": "she photoshopped at least 200 lbs off her picture",
   "created_utc": 1693492155,
   "score": 123,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiwiwr",
   "message": "Met a girl who was super nice, but the waiting staff kept  scaring the shit out of her. First date we went to get Tai food and the girls up front kept cooing about how we look so good together and how it looked like we had been together a long time. She got weird, and I fully understood it was a first date, and that's a lot of pressure for someone you don't even know if you like yet. \n\nThe second date was at a decent steakhouse, and they confused our table with a dude trying to surprise his girl with an anniversary dinner. They brought us a big slice of cake, and the gm came over to \"personally wish us a happy 5th anniversary.\" I had to explain the situation, and he turned bright red and comped our meal. I tipped the server the entire cost of the food, took her home, and she never called me back. \n\nEverything else went great. If everyone wasn't scaring her to death with prospects of the rest of her life in front of her, it might have been that way.",
   "created_utc": 1693492304,
   "score": 37,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiwl8e",
   "message": "My truck died right as I was going to pick her up so she had to drive. It was a terrible date, and then she had to drive me 45 minutes back to my house.",
   "created_utc": 1693492327,
   "score": 19,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiwmqd",
   "message": "“Mechanical failure” because I was fresh off a breakup and clearly wasn’t ready to be out dating or hooking up yet. The girl was very attractive and mortified that I “wasn’t attracted to her.”\n\nI did get another shot though which went much better 🙌🍆",
   "created_utc": 1693492343,
   "score": 25,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj4mga",
   "message": " I managed to 3rd wheel my own date one time.\n\nI went out to a restaurant with this one girl and while we were having conversation and eating, this guy came in to pick up an order. My date happened to know him. She got so excited and ran up and hugged him. Apparently they were childhood friends and she didn't know that he was back in town visiting family.\n\n She invited him to our table. I was being civil and polite and I introduced myself and he did the same but then they got lost in conversation catching up and I felt awkward just sitting there. She wasn't that animated before he showed up. She was acting like a gitty little school girl with him. \n\nThey were both so focused on each other that she completely forgot that I was there so I made an excuse to go use the bathroom but I just went ahead to the front and pay my portion of the bill and left.  They didn't even notice I left.",
   "created_utc": 1693495268,
   "score": 126,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjdzfz",
   "message": "Second date... we were going to check out a new bar/restaurant.  Mom asked if I wanted to go out to dinner Saturday,  \"I can't.  I have plans.\"\n\nShow up at the restaurant, my whole family is there.\n\n\"OH YOU DECIDED TO COME! AND YOU BROUGHT A DATE, WE HAVE SO MUCH TO ASK!\"\n\n...No. no you don't. I sat as far away as geographically possible in the restaurant. I was mortified, begging her to believe me that I didn't plan it. She thought it was funny, but I was so embarrassed.",
   "created_utc": 1693498632,
   "score": 13,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj75hi",
   "message": "Trying to be funny on a date, I grabbed the rolled up napkin and went to fan it out super dramatically so it would make that \"flap\" sound.  Didn't know there was silverware rolled up in the napkin, silverware flew across the room.  My date wanted to laugh at me so bad and he was trying not to, which somehow made it worse 🫠",
   "created_utc": 1693496186,
   "score": 134,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj8vfy",
   "message": "First date with my wife, take her to fancy ass restaurant on the upper west side, and I give the waitress my card to pay, she comes back and says it's been declined. How could that be? I literally got paid that morning, so I give her my other debit card, something, now I'm MORTIFIED, I know in my heart of hearts that I have enough to cover the bill in either accounts, but I don't want to be that guy causing a scene and asking her to try it again, luckily I had cash on me and paid with that. \nI get home and check my account, turns out the bank froze all my accounts because two days prior I was in Boston and used my card there which they deemed suspicious. Completely humiliating experience",
   "created_utc": 1693496805,
   "score": 231,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj9ypt",
   "message": "Had a coffee date with a guy in the middle of the day. He’s coming on strong and every single conversation he turns back to sex, like some weird carnival trick. I could have told this man I clubbed baby seals and he would have found some way to pivot the conversation back to sex. I’m completely put off by this and he is picking up on that. So instead backing off like a normal person, he does some bizarre Hail Mary. He leans back in his chair and he has pulled his dick out, then he sort of…waved it at me.",
   "created_utc": 1693497191,
   "score": 205,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjgsc1",
   "message": "Long story short, I'm a long time ex cheated on me. I broke up with him and then a few months later we started talking again to see if we could be friends. He made it very clear that he was still in love with me.\n\nI decided to go on a date with a friend of my sisters. This was 2011 so I had one of those phones that you have to slide up to answer. I decided to wear a cute little purse so I only had my phone and wallet. The guy and I are walking around, and then we go to a restaurant, and then we drive around and sightsee. Sightsee. My ex had called me and somehow my damn phone slid open in my purse. He heard everything we said. I got another call while we were driving around from my sister. Laughing her ass off and telling me that my ex called her crying. He called her, he called his parents, and then he came to my house and sat on my steps to wait for me to come home. Luckily My sister convinced him to go home.",
   "created_utc": 1693499631,
   "score": 77,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj11se",
   "message": "Went on a date with a tinder match. She was in college for vocals and wanted to try a new Thai place then go to a concert. I met her for dinner and we ordered. The place screwed up my meal (sent it out with a large carry out and it would take too long to remake so I just had them take it off my bill and I paid for the two of us and left a tip. We went to the concert and while taking, I asked her if she killed it a karaoke and if she had a go to song. She said she would never risk her voice for something that dumb. The concert then started. After it she said she knew we had agreed to go out for drinks afterward but she thought I was immature for not demanding our whole meal was free at dinner and not realizing how a musician would never do something dumb like karaoke.",
   "created_utc": 1693493965,
   "score": 210,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj6vii",
   "message": "We went on an easy hike. I slipped and fell on my butt, but didn’t notice I had dislocated my ankle. I proceeded to stand up and break both bones in my leg. He was a complete gentleman while waiting for the ambulance and stayed at the hospital until I went into surgery. There was no second date, but he was a 10/10 awesome person",
   "created_utc": 1693496085,
   "score": 130,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj3brg",
   "message": "First date with a guy. He had to pull over like eight times so I could vomit on the side of the road/highway. And no, I wasn’t drunk. \n\nThe amazing thing is that we had a second date. \n\nWe did not have a third date because I failed to pick up that his talk about knots was not because he was a sailor and Boy Scout, but because he wanted to be tied up and humiliated.",
   "created_utc": 1693494792,
   "score": 244,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj0ria",
   "message": "First date, leaving the restaurant he got pulled over for taillight out.  He said, “Shit, I’m going to jail!  Will you take my car to your place and I’ll get it when I get out?”  I was too stunned to answer.  Sure enough, he got arrested for failing to appear on numerous tickets he hadn’t paid.  The cop took me aside and said, “This isn’t his first time and it won’t be his last.  Would you like a ride home?”  It made me so angry that he knew this could happen and had the gall to have me in his car anyway.  I accepted the police ride home, his car got towed \u0026amp; impounded and I blocked him.",
   "created_utc": 1693493861,
   "score": 158,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj9sx4",
   "message": "Not me but a colleague.\n\nThe girl drove for 1h30 to go to a cat café after speaking with the guy for like 2-3 weeks. Mind you they spoke when he was on his computer because he doesn't have a smartphone. So they decided to see each other, planned a date etc. The girl arrived at the café, they talked for 5min then the guy went to pet the cats for 2h without speaking to her ever again... She left and never bothered to send a message. He was devastated.\n\nOh and my colleague is the guy.",
   "created_utc": 1693497134,
   "score": 54,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjf2h5",
   "message": "Did shrooms together. It was my first time and he was quite experienced. He wanted sex and I was as dry as drought. I never done psychedelics before and felt a lot of things at once but sex was the furthest thing from my mind. Bit his dick and was kicked out of his house. Right before then, I was crying super hard cause on one hand, I felt everything was beautiful, and then on the second, I couldn’t believe perverted and disgusting things could exist in such a beautiful world and spoiled the beauty. Unsure if trip was bad because we weren’t on the same page or if I was having a psychotic episode.",
   "created_utc": 1693499020,
   "score": 87,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiyqv3",
   "message": "Lonnnng time ago.  I had a female best friend who I was seriously crushing for, I finally asked her over for a dinner date.\n\nI don't cook.\n\nBut come Hell and high water, I was going to impress her with my cooking, table manners, everything. I bought lobster, some misc sides, and red wine for the date.\n\nShe looked stunning, in a long flowing white dress.\n\nI didn't have a clue how to open the wine, I struggled with it.  I drink Jack or beer.  As i struggled with it, the pressure of my strength and inside the bottle threw the liquid out forcefully. \n\nAll over the front of her pretty white dress.  Stain was about the circumference of a large basketball.\n\nThe rest of the evening just went totally down hill from there.",
   "created_utc": 1693493126,
   "score": 105,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjaqsp",
   "message": "Second date I think? I got super sick while we were riding bikes, and I spent 30 minutes in a random Pizza Hut bathroom with diarrhea while she sat outside on the sidewalk waiting for me.\n\nWe're married!\n\nReally thought I blew it though.",
   "created_utc": 1693497473,
   "score": 97,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj2l5w",
   "message": "We went to see a double screening of Nymphomaniac 1\u0026amp;2 by Lars von Trier.",
   "created_utc": 1693494524,
   "score": 32,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjv38a",
   "message": "There’s been so many. The highlights:\n\nMet a guy through work when I was in my early 30s. I thought he was also in his early 30s, but quickly learn he’s ten years younger. I decline a date bc I’m worried about a maturity gap, he convinces me that he’ll prove me wrong. Go out twice, everything’s fine. \n\nThird date I step it up with my look a little and wear more makeup than usual (I thought it still looked cute). We meet up at a restaurant and after getting our waters, he takes a big mouthful and shoots it in my face like a cherub on a fountain. I’m obviously upset, he’s laughing hysterically and people are staring. Apparently my makeup looked “dumb” and like it took a long time, so he wanted to wash it off.\n\n\nMet up with a guy who I was a little unsure about, especially because he wanted to drive way out of his way to go to “his” bar, an old Irish spot, when there are a bajillion great bars in his neighborhood. Beginning red flags:  he’d want me to dye my hair bc it looks like his exes, used “my body my choice” when talking about riding motorcycles w/out a helmet, ranted about married women keeping their name, hates kids so much he won’t eat in dining rooms, only at the bar.  \n\nThe thing that got me to leave was when he said he’s really into a car restoration guy and I asked “you mean the Nazi?” and he shrugged and said “he’s really talented, I guess I can see past that.” \n\nThere was also the guy who tried to get me to wear his exes shoes and cried when I ran out of his place after he showed me his many assault rifles.\n\nAnd the one who flipped out on me, loudly, in my neighborhood bar calling me a monster, sociopath, “ugly ugly person” for not wanting to spend my volunteer voter outreach hours with Trump supporters. His Tinder profile said he’s always positive and lives to make other people happy (red flag). \n\nThe woman who just wanted to talk about the dudes she was into. \n\nAnd the last date I had before deciding the dating part of my life is done: a guy who was only into me because of the last person I’d dated. He idolized that guy and wanted to be able to say they’d kissed the same person (completely ignoring that it would essentially be dumpster diving bc his idol was extremely not into me and tossed me out hard).",
   "created_utc": 1693504747,
   "score": 39,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyixiac",
   "message": "My car broke down on Valentine’s Day in 2022; I was crying on the side of the freeway, like 25 minutes away. Called her to say it probably wasn’t gonna work that night, which was a horrible conversation, she was bummed.\n\nMy dad ended up picking me up after an hour in the cold and we got dinner at a dinky restaurant. I saw the girl like one more time until…\n\nRecently we reconnected at a party I threw. Went to a club once and had her over another night. She said she totally thought I wasn’t interested, and I promised it wasn’t like that at all. Idk if it’s gonna lead to anything more than fwb which is fine but I’m just shocked I recovered from that.",
   "created_utc": 1693492670,
   "score": 91,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiypxg",
   "message": "I went to the wrong movie theater and missed my date.",
   "created_utc": 1693493116,
   "score": 24,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj6e76",
   "message": "Went out with a guy from MM. We had been talking for months. We go on the date. Very expensive restaurant. We were talking and joking around. Drinking. It was great but the food was disgusting. So we went to another restaurant. Very small but still fancy. Food was amazing. The date came to a end we are walking back to our cars and he asked to kiss me. That was very sweet so I said yes. All of that gentleman behavior above was him putting on a show. He tried to follow me. He thought he deserved to get laid for paying for the date and his great behavior. I say no maybe when we get to know each other better. He catches a hissy fit. Saying he earned it so he should have it. Or he’s gonna report my account on the website. I say go ahead and went in the store to wait for him to leave. Blocked him. He added me on Telegram pretending like nothing happened. So I asked him for $10. Yes $10. He blocked me because I’m a gold digger lol.",
   "created_utc": 1693495911,
   "score": 48,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjdr9y",
   "message": "One girl believed in the wildest conspiracy theories. To name a few\n\nJeffrey Epstein is still alive\n\nAdam Lanza was an FBI agent\n\nTimothy McVeigh was a radical feminist\n\nBarack Obama killed his chief because he looked and Michelle funny\n\nHillary Clinton intentionally lost the 2016 election because she secretly didn't want to be president\n\nDonald Trump is controlled opposition for the Democrats.\n\nEdit: another one is that Jan 6th attacks didn't happen. Like, she wasn't saying it was a false flag. She was saying the riots just didn't take place",
   "created_utc": 1693498551,
   "score": 20,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjwyfg",
   "message": "I met the most attractive guy I’ve ever seen on Tinder. Our first date was great. We talked for over 5 hours, had a ton in common, and overall had a great time. We agreed on a second date, and he came to pick me up from my college apartment. I was outside with my dog in the dog park with my friend. Date picked up my dog and held her against his white T-shirt. \n\nShe was apparently in heat for the first time ever and bled on his shirt. I was whisper-screaming to my friend about how I’d never see this guy again. \n\nWe’re married now.",
   "created_utc": 1693505425,
   "score": 19,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjqrga",
   "message": "I was 17, I started dating my absolute dream girl at the time after making out with her at a party. We went biking and she invited me to her empty house and well, sex was *kinda* implied. I got so stressed that I blurted out that I have to go home to give medicine to my dog and left (that was true… but could have waited an hour or two). I’m 26 now, every time I think about it I go red and feel embarrassed for the rest of the day.\n\nAnd fuck you for making me remember that…",
   "created_utc": 1693503207,
   "score": 18,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjd8m8",
   "message": "Not as bad as some but way back in the 90s I took a girl out on a first date. I borrowed my Dads car. I didn't have one as I'd not long passed my driving test. We went down the pub. All was going well. So driving back home we thought 'Lets stop off at the chippy get some food'.  So I pull into the Chip shop car park. \n\nAs I'm parking I miss judge the length of the car and bang into the Chip shop wall. I jump out in a panic to assess the damage. Luckily seemed to only be a minor scratch. As we walk up to the entrance I realized the chip shop is closed. Great, may as well go home. We go back to the car and in my haste to check the front for damage I had locked the keys in the car! \n\nSo we now have to walk back to my parents house. I introduce my date to them and promptly abandon her with them to go and fetch the car with the spare key.",
   "created_utc": 1693498363,
   "score": 15,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjhjt4",
   "message": "Went on a date with the same girl/woman 6-7 years later and we both realized it 10 minutes into the conversation at the coffee shop. Didn’t click in our online messages, but did in person real fast.",
   "created_utc": 1693499907,
   "score": 15,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjv7fx",
   "message": "I tumbled down a flight of stairs.  But in my defense I never wore high heeled dress shoes before.  This was the first time ever I was working the maid cafe at an anime convention.  The good news is didn't break a bone, or the shoes.  And we kept dating, so it worked out.",
   "created_utc": 1693504789,
   "score": 13,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjd0i6",
   "message": "I shat my pants saying goodbye to my gf on or 2 year aniversary. We had eaten a lot of shit and my stomach wasn't feeling so good. I held in a lot of farts at the end of the night because i was afraid i would shit my pants.\n\nSaying goodbye to her she made such a funny joke that when i laughed i felt the wet shit on my ass. I immediatly said \"I just shit my pants\" she said: \"Really? Let me check\" (I will marry her i promise). \n\nI didn't let her check cause i knew i had just shit my pants. But anyway it was just very funny afterall and something i will tell my kids when they grow up.",
   "created_utc": 1693498283,
   "score": 28,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjgtyk",
   "message": "I got super sick after eating bad fish while I was in Thailand...   \nI had to leave in the middle of the date, and almost s...t myself.",
   "created_utc": 1693499647,
   "score": 29,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjglmo",
   "message": "I was in college and was going on a double date. When my date approached the table and saw his friend, he did a n\\*zi salute and yelled \"S\\*eg Heil\" to be \"funny\" (???) and they both laughed. \n\nHe didn't know I was Jewish. Rest of the date was super uncomfortable for me.",
   "created_utc": 1693499564,
   "score": 13,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiyqk7",
   "message": "Me then (34M) and him (38M) after texting and talking on the phone decide to meet up at his place for the date. I live in a city about 1.5 hours away but I have a car so I drove there. \nHe cooked, we chat. I think things are going well. Then he tells me that I’m much fatter than he expected. This after seeing each others pictures and discussing etchings about weights and stuff too. Like there was no catfishing. \n\nThe kicker: YEARS later I see him on the street when I’m visiting his city (with my then bf). He is all flirty and hitting on me. I’m like “this is my bf, so I think this is inappropriate, besides you said I was too fat for you when we went on a date. Don’t you remember?”\n\nWhen I was talking to a friend about this, we came to the conclusion that he must be someone that uses his good looks to manipulate guys in a relationship. Like a “I’m so hot and you’re not so you should be grateful I’m with you” kind of thing. Nope!",
   "created_utc": 1693493123,
   "score": 44,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj24u0",
   "message": "Tried my first rollie (hand rolled cigarette using pouch tobacco) and vomited all over both our shoes.",
   "created_utc": 1693494357,
   "score": 24,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjhjdq",
   "message": "For our first date, ( we were both 16)they mentioned a restaurant they wanted to go to, which is a seafood place. I'm allergic to shellfish.  Anaphylaxis, carrying an epi-pen allergic. Which I stated when they brought up going to this place. \n\nWe went instead to a restaurant that had shrimp and crab on the menu, which is fine. I told our server of my allergy and asked if they could keep my food away from these items. No problem, the server said. \n\nFood comes, I'm eating my salad and boom, my mouth is starting to itch. I grab my bag and use my epi pen.  I told my date they needed to have the restaurant call 911 because the injection was just taking the edge off, and I needed emergency care. \n\nWhen the ambulance gets there, as they give me 3 more injections and start to take me to the hospital when my date  tells an EMT they chopped up a shrimp and put it in my salad because  they thought, \"I was just being dramatic and was lying about being allergic.\" \n\nYes, police were called by the hospital, EMT's told the cops about my date putting the shrimp in my food. The cops went to talk with them and their parents. \n\n The cops reported back that my dates parents told them that I put the shrimp in my own salad to get attention. Even though my date admitted to the EMT that they put it in there. \n\nMy parents told the cops that if they paid the portion of my medical bills that insurance didn't cover, they would let it go. \n\nWhere is this person now? \n\nJail. They had been arrested for white collar crimes on 3 separate occasions. 1st stealing money from a social club that they were the treasurer. 2nd time, tax evasion. This 3rd time, they were  siphoning  money from real-estate deals cheating first-time home buyers. \n\nTotal narcissist.\n\n\nEdit for \" color\" of crime",
   "created_utc": 1693499903,
   "score": 27,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjq7ah",
   "message": "Went on a first date, had a nice dinner.  She wanted to go a different place for dessert, and on the way there we hit a drunk homeless guy with our car.",
   "created_utc": 1693503005,
   "score": 10,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj3a3t",
   "message": "They said, \"hey can you pay?\" i asked why, and they said, \"oh, because i had to use my remaining money to get my son out of jail....oof.",
   "created_utc": 1693494775,
   "score": 20,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj9nx1",
   "message": "Invited a girl from a college class to a party. She showed up drunk with another guy: she was making out with him when I walked up to the car to greet her. She then drunkenly gave me this weird \"reassurance\" that she was only sleeping with him because he was a bad guy. She sleeps with bad guys to punish him, but I'm a good guy...whatever. Then she ended up ignoring the guy she came with to obsess over how she wanted to kill the host's pet gerbil.\n\nI guess it fits that the class we had together was intro to psychology.",
   "created_utc": 1693497086,
   "score": 19,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj91ty",
   "message": "I thought he had a cat hair on his face. After attempting to remove it, I realised that it was, in fact, a part of his eyebrow and very much attached. It was a freakishly long eyebrow hair lol",
   "created_utc": 1693496869,
   "score": 16,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjv9p7",
   "message": "My dental crown fell out. Front tooth.",
   "created_utc": 1693504812,
   "score": 10,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyj15c5",
   "message": "The time I didn’t know that the guy thought we were on a date (I think this has happened a few times in my life tbh).  But he tried to kiss me and kept trying to get me to sit next to him and when I wouldn’t he tried to stand really close to me.\n\nSomehow I got us to the nearby music store and he started bashing the female artists and it was such a weird experience.  He was calling them all sorts of misogynistic names and hardcore judging what they were wearing lol.  \n\nI’ll always remember you, Tony.  Just not for the reasons you may think.",
   "created_utc": 1693494001,
   "score": 24,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjwx67",
   "message": "Went on a date last weekend that was probably the worst date I’ve had in a long time. \n\nWe met to have our 1st date at mini golf. Great, that’s fun and can be a great ice breaker! We show up on time and she is an absolute 10/10 stunner. 100% my type. I’m hype. We hug and start playing mini golf. This is where is goes downhill. Talking to this girl is like talking to a standardized test. She’s super boring and getting her to talk/ expand on anything is like pulling teeth. \n\nMe:” What are some of your favorite hobbies?”\n“I like the gym” she said pretty flatly. No expansion on why or anything. So I try to expand the conversation on that short answer which just leads to more short answers. Rinse and repeat over various topics and 18 holes. \n\nAt least I had fun playing (albeit sucking) at mini golf 😂.  \n\nI proposed we meet up for another date. Figured maybe first date jitters were present, but my text was ghosted for 4 days before she finally responded. I’d already moved on at that point.",
   "created_utc": 1693505412,
   "score": 7,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjfbn0",
   "message": "My first time with another girl. She was riding my face. I was trying to push her off because she was literally suffocating me. She pinned my hands down and kept going. And squirted on my face. I was basically suffocated and water boarded by this girl’s pussy. \n\nIt was amazing.",
   "created_utc": 1693499109,
   "score": 33,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjiyf4",
   "message": "She asked me a question as I was eating and I got nervous and took a breath at an i opportune time. I choked on a scallion pancake and went to the bathroom to get it down with water. I got past that and still had a good time and we went out again. It was just a big bruise to my ego. The couple seconds we looked at each other and I couldn’t swallow or say anything felt like an eternity as I saw the shock/concern appear in her eyes",
   "created_utc": 1693500415,
   "score": 6,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjykfo",
   "message": "About 8 years ago I asked a friend out after we had randomly kissed after a friendly dinner one night. We had known each other for years, but really only as acquaintances. She was super hot and seemed fun so I was stoked to hang out again. My failure was asking her out to begin with.\n\nSo second date, we got dinner somewhere in Hollywood and then went to go see her friend's band play The Viper Room. On the way there in the car, I moved my foot and accidentally ripped the aux cable out of her iPod, destroying the input jack. She was chill about it but i was mortified. As the night progressed she was getting more and more wasted. Outside the venue, we ended up in a group discussion with some of her buddies about social politics where she decided to just drop the n-bomb in one of her statements. This caught me completely by surprise and was a very dark turn of events. My jaw hit the sidewalk and my eyes turned to saucers. She clocked my reaction, so she doubled down and said the n-word again a few sentences later, looking me right in the eye and emphasizing it when she said it. This was my cue to dip out, but I foolishly went along to the next spot. \n\nShe was in no state to drive, so I took the wheel and drove us to a gas station to fill up. Her windows looked as though someone had smeared them with grease, so while the pump was running I took a squeegee and cleaned the outside windshield. Then I brought it inside the car and tried to address the hazy film on the interior glass. She had a complete meltdown and started lecturing me about bringing bug juice inside her car and that \"the outside should never come inside\" while nearly hyperventilating with anxiety. I apologized and we moved on.\n\nFrom there we met up with a few of her girl friends at a bar. My date rode a motorcycle and was tapped into a few moto groups in the city. She ordered more whisky and then very indelicately brought up to the group how too many people had been getting into fatal accidents recently. It was a total non-sequitur. This prompted one of her friends to get really upset, as she had evidently recently lost her boyfriend to a fatal moto crash. It was awkward af, and I wondered why my date would knowingly pick her friend's scab like that in front of everyone. We booked out to call it a night soon after. \n\nHeading back to my place, she went on about how she thought she was being subtle by deliberately bringing up the moto fatalities subject to get this poor girl to talk about her recent loss like she was doing her a favor getting it out in the open. I was dumbfounded at my date's insensitivity. We arrived at my place and she was still in pretty bad shape.\n\nIt was like 2 AM and I brought her inside to feed her water and any starches I had to try and sober her up. She had an 11 y.o. daughter at home she was taking to Disneyland the following morning. I was scheduled to help a buddy move an apartment into storage.\n\nThe girl kept going on about how she was good to drive, and if she just covered one eye she'd see straight enough to make it home fine. I thought letting her go would be grossly irresponsible of me, so I just sat on the couch talking to her and trying to wait it out while plying her with more glasses of water. Although she was still kissing on me, any attraction I had to her had shriveled at the beginning of the evening after the n-bombs, so at this point I was just trying to be decent and not get her or someone else hurt by letting her drive home drunk. \n\nShe then spent the worse part of 2+ hours going on a completely unprovoked tirade about US immigration policy and so-called \"anchor children\" that would have made Ann Coulter proud. Although she was the child of Filipino immigrants, she sucked all the air out of the room with this monologue about bootstrapping and 'Murica and \"these fuckin illegals\". I tried to counter her stupid arguments, but it was pointless. Each minute that passed I just wanted her to leave and for this hellride nightmare to end. It was draining.\n\nAround 4 or 5 in the morning I escorted her to her car. She was still not in great shape, but I had had enough. I sent her on her way and asked her to message me when she got home safely. She miraculously did. I slept like four hours and then met my buddy to help him move an entire loft apartment in DTLA down a flight or three of stairs, including a piano.\n\nI texted her that morning about how half dead I felt, having hardly slept and she concurred, offering absolutely zero in the way of acknowledging my caretaking nor apology for her ghastly behavior. Later, I tried to to fix her iPod but broke it worse, so I just bought her another one off Craigslist. There was no third date. And in a final twist, turns out she was dating another dude at the same time anyway, who she later married. Good luck, fella. She sometimes still hits me up when I'm in town to hang out. Nope. Aaaand scene.",
   "created_utc": 1693506012,
   "score": 11,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjyavn",
   "message": "I went on a date once where the guy got endlessly lost trying to find the venue that he’d suggested, then finally showed up sweating, red-faced, extremely flustered and out of breath, and then proceeded to slip on an actual banana skin, like in a cartoon, and full-on crash to the ground in a heap.",
   "created_utc": 1693505917,
   "score": 6,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jykz161",
   "message": "Matched with a girl on Tinder shortly after moving into a small town. Eventually she says she's down to meet so I pick her up and bring her back to my apartment. We have a few drinks watching Netflix on the couch and she starts flirting more and getting touchy. In my mind things are going great.\n\nAs things are progressing, her phone starts ringing. She says it's her boyfriend and answers it. WTF? I'm done at this point because everyone knows what goes down on Tinder and she never mentioned she had a boyfriend. I'm sitting on the couch waiting for this \"date\" to end when the girl says she has to use the bathroom and gives me her phone. As if things couldn't get worse, I am now on a Facetime call with the guy whose girlfriend I was planning on hooking up with.\n\nThe guy knows what's going on, so he starts saying \"yo bro I trust you\" and I'm trying to reassure him that I don't want to hook up with his girlfriend. In hindsight I should have just hung up. This goes on for a while, and the girl hasn't come back from the bathroom yet, so I tell the guy I am going to go check on her.\n\nWhen I get to my bathroom the door is open and the girl is face in the toilet puking. I don't really remember what happened next as this was several years ago, but I remember she had puke in her hair too. Eventually I just take her home because the night is shot. To make matters worse I later found out that I work with her brother-in-law. He knew that I had met her but I just hope she didn't say how.",
   "created_utc": 1693519410,
   "score": 4,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjkokm",
   "message": "Jammed a drinking straw up my nose by accident.\n\nThe tabletop was black, the drinking straw was black, the drink was very dark, and the bar lighting was dim. Totally forgot there was a drinking straw in the glass when I lifted it to my mouth with the proper trajectory and speed to sip. The forgotten drinking straw jammed straight up my nose and stuck there as I yelped and hastily put the drink back down. \n\nThere was no second date.",
   "created_utc": 1693501017,
   "score": 5,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjzfzs",
   "message": "Got terrified faked an accent",
   "created_utc": 1693506330,
   "score": 4,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyjq6nw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166avpp"
  }
 ]
}