{
 "submission_id": "166avpp",
 "title": "what's the worst failure you've ever had during a date ?",
 "selftext": "",
 "created_utc": 1693487718,
 "permalink": "/r/AskReddit/comments/166avpp/whats_the_worst_failure_youve_ever_had_during_a/",
 "score": 32,
 "url": "https://www.reddit.com/r/AskReddit/comments/166avpp/whats_the_worst_failure_youve_ever_had_during_a/",
 "comments": [
  {
   "comment_id": "jyip9ng",
   "message": "One time I was visiting a different city for work and decided to open up Tinder and see what was happening. I match a girl, she seems cute and funny and we're messaging for a bit. She then, very forwardly, asks if I'd like to go to a local concert with her that night. I said sure, but I asked if we could maybe meet at a bar first and she agreed.\n\nWe meet at the bar, and she seems very nice, albeit a little nervous or anxious. We have a nice conversation and seemed to have a few things in common and were hitting it off. However, she keeps insisting like - \"let's just have one drink and then go\" which at the time, I didn't think much of and thought sure, let's go that show.\n\nSo we Uber to the show, and it is in the middle of fucking nowhere. I'm in a new city and it's just in some far-off neighborhood like boonies type shit. It's a house-show. So she runs into some friends there. All of them are eyeing me suspiciously, which I found very odd. Like she introduced me, and they all kinda gave me a weird, sort of dirty look. But I was like - whatever, okay. Maybe her friends are weirdos. I tell the girl, \"hey, I'm gonna go get us a drink, want anything?\" and she says sure, and asks me to get a vodka-soda (or something).\n\nI come back and give the girl her drink and she goes \"hey so um, my boyfriend is here.\" And I'm just kind of aghast like...what? And all I can muster out is like \"Uh...is that a problem?\" Like maybe they're in some open-relationship or something? I'm grasping at straws here. And she goes \"Yeah, it's actually his band playing. I think you should go\" so I'm like **\"did you just fucking drag me here to make him jealous...and then change your mind?\"** and she's like \"no it's not like that okay, we're just in this weird place like-\" and she's about to start fucking *complaining* about their relationship to me and I'm like \"no, okay, I'm going, goodbye.\"\n\nI noped the fuck out of there, hop in a fucking *$80 Uber* back to my hotel and she has the  audacity to then text me like \"I'm so sorry, are you free another day this week?\" Instant block. Never blocked a number so fast in my life.",
   "created_utc": 1693489525,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiqj5g",
   "message": "Wasn’t told of an allergy, almost killed date. Well she should of voice her issues, was too busy instagramming her meal. Tree nuts.",
   "created_utc": 1693490023,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyisq5j",
   "message": "I had a supercharged muscle car when I was 19.  I worked up the guts to ask a girl out on a date.  At the time, she was far out of my league.  FAR.  She made 2006 Megan Fox look like boiled garbage.  But she agreed to a dinner and movie date, somehow.  \n\nI drove that car daily, rain or shine.  I never had an issue until I went to fire it up to go pick up my date.  It didn't want to start at first, then felt like it wasn't firing on all cylinders.  I didn't have time to diagnose it, so I limped it along hoping it would shake out whatever the issue was.  Maybe a plug got fouled?  I pulled into her driveway and the engine was struggling to idle.  She got in, didn't notice the engine wheezing, gave me this alluring smile and said \"oh, you better take it easy!\"  My mind was 100% on \"what the hell is wrong with my car\" mode and I misinterpreted what she said.\n\nThe next 35 minutes were awkward as hell.  I was speeding up, slowing down, contorting my neck to listen to the engine, and talking my way through diagnosing the issue.  She became disinterested after about 11.2 seconds, which also happened to be its 1/4mi time if it had been running right.  \n\nWe got dinner, watched the movie, and drove back in almost total silence (except for the exhaust which sounded like a pack of dying Harley Davidsons).  She got out of the car, said \"ok thanks bye\" and just left.  Meanwhile I'm looking at gauges, and visualizing everything going on in the engine.  The next day I changed out the spark plugs, coil, wires, and distributor components.  Ran fine.  \n\nI told my wife this story a few years ago and she said \"did you pull and check any plugs?  Could have flooded it and fouled one or two.\"  I was like damn, where were you back then??",
   "created_utc": 1693490875,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiqpww",
   "message": "She told me there were too many Malays in Malaysia, which is a type of racism I didn't know existed. At the end of the date she announced that she would see me again, but by the time I got home she had unmatched me.\n\nShe was odd.",
   "created_utc": 1693490095,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyirha0",
   "message": "I took her to a movie and the movie was so boring I fell asleep.",
   "created_utc": 1693490391,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiu93b",
   "message": "She turned up absolutely hammered to the date, proceeded to start crying and talking about her ex non-stop while drinking more and more. So I told her this isn’t going to work and left.",
   "created_utc": 1693491459,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyitdod",
   "message": "Went on a date with a girl from tinder. We met at a popular bridge, walked along the river on one side, came back up the other side and we said goodbye to eachother. She talked the entire time, barely got my name out.",
   "created_utc": 1693491125,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyir9lc",
   "message": "I mean it wasn't during a date but I was supposed to meet a guy at my place and as I opened the door his words were \"You're not what I expected, I'm going to pass\" \n\nLiterally no catfishing was had here but for some reason he felt the need to come to my door and be a little insensitive. At least he was honest though right?",
   "created_utc": 1693490307,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiu3wf",
   "message": "On the first date, my car stopped on the road due to an engine fault and we were stuck there for more than 6-7 hours.",
   "created_utc": 1693491403,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiv683",
   "message": "I went to a similarly named restaurant on the other side of the city, so I arrived almost an hour late. My bad, so I was ready to put effort into saving the evening.\n\nShe was the most boring person I have ever met. A tax advisor, and getting anything out of her was like pulling teeth. \n\nWhen I asked her what she liked to do for fun, she said \"travel\". Oh great, a topic where she will finally have something interesting to say. I ask her where she's been lately, she says \"lots of places, I normally go on cruises.\" I ask her what stands out, and she says \"nothing, really\". \n\nI paid for dinner, because I was late after all, and she asks whether she can keep the receipt so that she can use it to save tax for a client.",
   "created_utc": 1693491802,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiskl7",
   "message": "Date 1: we were enjoying each other at first, I asked her to homecoming and she said yes, by the end of the date we both realized we weren't very compatible but oh well.\n\nDate 2 (homecoming, something like a month later): picked her up, we were both faking enthusiasm, and I promptly got my dad's car totaled by pulling out into traffic like an idiot.\n\nWe were taken to the hospital as a precaution, but we were both okay. I called it a day; she went to the dance and reportedly had a good time.",
   "created_utc": 1693490817,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiuru5",
   "message": "Ordering a bottle of Blue Nun Liebfraumilch in a restaurant because I was so pissed after a daytime works Xmas party that I couldn’t read anything on the wine list but saw a bottle on another table. \nFortunately my companion forgave me and we are still married 44 years later.",
   "created_utc": 1693491653,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiut04",
   "message": "Does it count as a failure if they don't even show up?\n\nAfter the 5 or so time I just gave up and accepted the fact that I will die alone.",
   "created_utc": 1693491664,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyivcn2",
   "message": "They took me to a thrift store. I was fine with walking around and checking out stuff, kind of an odd date but hey thought it was something new. He literally filled his cart and was heading towards the check out. When it came for time to pay he told me that he had forgotten his wallet. So I ended up paying for him… I didn’t get a thank you or a please, or money paid back. After the date it was just awkward and I’ve blocked him lol",
   "created_utc": 1693491868,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyirx37",
   "message": "I 31F didn’t even make it to the first date because he 31M msged me first to TELL me I would be paying for what I wanted as that’s how he thought it should be.. I couldn’t believe it. Haha never in my dating years had I had a man tell me before the first date I would be paying for dinner. So yeah we both decided we wouldn’t meet up after that conversation. \n\nPs. I have no issues paying my bit (I always offer), but the way he said it to me rubbed me up the wrong way. He said he didn’t want to give off vibes that he would pay for everything in future etc.. not really giving me protector or provider energy at all haha.",
   "created_utc": 1693490564,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyipeov",
   "message": "The man asked me if we could split the bill.  \nAnd I agreed.",
   "created_utc": 1693489581,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyis21d",
   "message": "Back in college I had minor surgery one morning and then had a second date with a girl that night. The first date had gone really well. I was in a lot of pain on the second date and was bleeding under my bandage. For some reason I didn’t tell her and instead just stayed pretty silent the whole date trying to deal with the pain. She was definitely confused and we didn’t have a third date. No clue what I was thinking!",
   "created_utc": 1693490618,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyitihd",
   "message": "had to play another round in R6",
   "created_utc": 1693491176,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyitm7s",
   "message": "I and my ex ,we where on a date in a restaurant his wallet fell off his pocket and he didn't notice on till we where done at the restaurant , only for we to find out he got no money on him , so i had no option than to pay for the bills.",
   "created_utc": 1693491216,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiw2vs",
   "message": "Held her hair while she was vomiting",
   "created_utc": 1693492138,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiw4hd",
   "message": "she photoshopped at least 200 lbs off her picture",
   "created_utc": 1693492155,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiwiwr",
   "message": "Met a girl who was super nice, but the waiting staff kept  scaring the shit out of her. First date we went to get Tai food and the girls up front kept cooing about how we look so good together and how it looked like we had been together a long time. She got weird, and I fully understood it was a first date, and that's a lot of pressure for someone you don't even know if you like yet. \n\nThe second date was at a decent steakhouse, and they confused our table with a dude trying to surprise his girl with an anniversary dinner. They brought us a big slice of cake, and the gm came over to \"personally wish us a happy 5th anniversary.\" I had to explain the situation, and he turned bright red and comped our meal. I tipped the server the entire cost of the food, took her home, and she never called me back. \n\nEverything else went great. If everyone wasn't scaring her to death with prospects of the rest of her life in front of her, it might have been that way.",
   "created_utc": 1693492304,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiwl8e",
   "message": "My truck died right as I was going to pick her up so she had to drive. It was a terrible date, and then she had to drive me 45 minutes back to my house.",
   "created_utc": 1693492327,
   "score": 1,
   "submission_id": "166avpp"
  },
  {
   "comment_id": "jyiwmqd",
   "message": "“Mechanical failure” because I was fresh off a breakup and clearly wasn’t ready to be out dating or hooking up yet. The girl was very attractive and mortified that I “wasn’t attracted to her.”\n\nI did get another shot though which went much better 🙌🍆",
   "created_utc": 1693492343,
   "score": 1,
   "submission_id": "166avpp"
  }
 ]
}