{
 "submission_id": "166a8no",
 "title": "Which unsolved mystery do you find most interesting?",
 "selftext": "",
 "created_utc": 1693486071,
 "permalink": "/r/AskReddit/comments/166a8no/which_unsolved_mystery_do_you_find_most/",
 "score": 21,
 "url": "https://www.reddit.com/r/AskReddit/comments/166a8no/which_unsolved_mystery_do_you_find_most/",
 "comments": [
  {
   "comment_id": "jyihbcl",
   "message": "I suppose I'd like to know what happened to D.B. Cooper.",
   "created_utc": 1693486133,
   "score": 23,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyipvqy",
   "message": "Malaysia Airlines Flight 370",
   "created_utc": 1693489769,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyii4k5",
   "message": "Jack the Ripper's identity",
   "created_utc": 1693486496,
   "score": 13,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyimfy7",
   "message": "Jon Benet Ramsey",
   "created_utc": 1693488368,
   "score": 9,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijrfq",
   "message": "Why is it always the left sock that goes missing?",
   "created_utc": 1693487217,
   "score": 7,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyirchx",
   "message": "Madeleine McCann",
   "created_utc": 1693490339,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyip4ry",
   "message": "Not famous like all the other answers, but a personal mystery for me. Who was Santa?\n\nWhen I was a kid, one day near Christmas a pickup truck pulled into our driveway and Santa Claus got out. He exchanged pleasantries with my mother, gave my sister and I each a present (that we both wanted), and then he left. \n\nIt became a big deal because my mom had no idea who it was and figured my dad set it up. My dad also claimed to have no idea who is was. The guy knew our family details and knew what we wanted for Christmas. He also didn't stop at any other houses on the street with children. So someone in the family arranged for this, but no one has ever owned up to it. Or some creep somehow spied very well on us in a small town and that's the only appearance he ever made in our lives. If my parents did do it to trick us as children, they've kept up the ruse as adults willing to take it to the grave leaving us thinking they were a bit creeped out by the whole thing.",
   "created_utc": 1693489471,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyitd3g",
   "message": "Dyatlov Pass incident. 9 people disappeared while hiking in dyatlov pass russia, all 9 were found dead in different locations, few of them were found with barely any clothes in freezing conditions and few had physical injuries on them and fractured skulls as if something attacked them. The case remains unsolved.",
   "created_utc": 1693491119,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiu0jt",
   "message": "Not really in the same line as the other answers, but: The Riemann Hypothesis.\n\nIt's an open question in mathematics (some argue that it's the biggest open question in mathematics) and it's about the values for which a certain function (the Riemann Zeta function) has 0 as output. The hypothesis states that these values that result in a 0 are all similar in a key way (more technically stated: They're all on the same line in the complex plane).\n\nSo far, searches for these zeroes, aided by computers, have not found any deviations from the pattern. But just because we haven't seen a counterexample, doesn't mean it doesn't exist.\n\nThe Riemann Zeta function is linked to some other aspects of mathematics, such as the distribution of prime numbers. Confirming or disproving the Riemann Hypothesis would immediately confirm or disprove theorems about prime numbers. And there are a considerable number of other theorems that rely on the RH. They've been completely proven except for the assumption that the RH is true. So they're just waiting for that final piece of the puzzle.\n\nFinally, the outcome that I hope for is not that the RH is proven true or false, but a proof that the RH is independent of our normal system of mathematics. That means that we can assume it's true and our math still works fine. Or we can assume it's false and it still works fine. And that within our normal system of mathematics we can never prove either outcome. Such \"independent\" statements exist, but finding that the RH is one of them would be a profound discovery.",
   "created_utc": 1693491368,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijtme",
   "message": "Who put Bella in the wytch elm?",
   "created_utc": 1693487243,
   "score": 6,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijrta",
   "message": "An obscure one but the 1987 Arkansas murders of Don Henry and Kevin Ives, AKA \"The Boys on the Tracks.\"",
   "created_utc": 1693487222,
   "score": 3,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyirzx6",
   "message": "Was there ever anything hidden on oak island? And if so, what, who put it there, and who found and took it? I am certain the history Channel show will never find anything treasure wise",
   "created_utc": 1693490595,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijlvo",
   "message": "The Bermuda Triangle has always been a personal favorite\n\nEdit: sorry I didn’t know it was solved.",
   "created_utc": 1693487150,
   "score": 2,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyimrsh",
   "message": "what happened to Jimmy Hoffa?",
   "created_utc": 1693488507,
   "score": 2,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiontg",
   "message": "I have my own theory for what happened but, for me, the Maura Murray case is the one.",
   "created_utc": 1693489282,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiph05",
   "message": "Who is behind hundreds of military incursions since 2014 referred to as “range foulers”",
   "created_utc": 1693489605,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyipo3s",
   "message": "Amelia Earhart. She probably just went into the sea but no trace of her plane has ever been found. And none of the conspiracy theories seem very likely.",
   "created_utc": 1693489685,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiqfsz",
   "message": "There's several, but I would like to know how they built the gigantic pyramids.",
   "created_utc": 1693489986,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiu6s8",
   "message": "Big foot or lock Ness monster.",
   "created_utc": 1693491434,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiultn",
   "message": "Pyramids",
   "created_utc": 1693491592,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyivlg9",
   "message": "The Sea People is a good one.",
   "created_utc": 1693491959,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiju84",
   "message": "All or most of the missing 411 cases are mindblosing to me.",
   "created_utc": 1693487250,
   "score": 3,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijtok",
   "message": "The Elisa Lam Cecil Hotel disappearance.",
   "created_utc": 1693487244,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyil39n",
   "message": "This question again?",
   "created_utc": 1693487794,
   "score": 252,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiuppi",
   "message": "This question gets asked and answered on a daily basis.",
   "created_utc": 1693491631,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyik0ds",
   "message": "Taman Shud was always a good on but it's likely been solved (still waiting on 100% confirmation?).",
   "created_utc": 1693487324,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyir1by",
   "message": "Jack the Ripoer, who he or they were.",
   "created_utc": 1693490219,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiruy9",
   "message": "The Devils hoof prints that stretched for miles around Devon.",
   "created_utc": 1693490541,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiull9",
   "message": "What really happened to M.Jackson",
   "created_utc": 1693491589,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiv8ey",
   "message": "Travel in a plane",
   "created_utc": 1693491825,
   "score": 1,
   "submission_id": "166a8no"
  }
 ]
}