{
 "submission_id": "166a8no",
 "title": "Which unsolved mystery do you find most interesting?",
 "selftext": "",
 "created_utc": 1693486071,
 "permalink": "/r/AskReddit/comments/166a8no/which_unsolved_mystery_do_you_find_most/",
 "score": 202,
 "url": "https://www.reddit.com/r/AskReddit/comments/166a8no/which_unsolved_mystery_do_you_find_most/",
 "comments": [
  {
   "comment_id": "jyihbcl",
   "message": "I suppose I'd like to know what happened to D.B. Cooper.",
   "created_utc": 1693486133,
   "score": 206,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyipvqy",
   "message": "Malaysia Airlines Flight 370",
   "created_utc": 1693489769,
   "score": 149,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyii4k5",
   "message": "Jack the Ripper's identity",
   "created_utc": 1693486496,
   "score": 33,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyimfy7",
   "message": "Jon Benet Ramsey",
   "created_utc": 1693488368,
   "score": 188,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijrfq",
   "message": "Why is it always the left sock that goes missing?",
   "created_utc": 1693487217,
   "score": 48,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyirchx",
   "message": "Madeleine McCann",
   "created_utc": 1693490339,
   "score": 114,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyip4ry",
   "message": "[deleted]",
   "created_utc": 1693489471,
   "score": 66,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyitd3g",
   "message": "Dyatlov Pass incident. 9 people disappeared while hiking in dyatlov pass russia, all 9 were found dead in different locations, few of them were found with barely any clothes in freezing conditions and few had physical injuries on them and fractured skulls as if something attacked them. The case remains unsolved.",
   "created_utc": 1693491119,
   "score": 85,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiu0jt",
   "message": "Not really in the same line as the other answers, but: The Riemann Hypothesis.\n\nIt's an open question in mathematics (some argue that it's the biggest open question in mathematics) and it's about the values for which a certain function (the Riemann Zeta function) has 0 as output. The hypothesis states that these values that result in a 0 are all similar in a key way (more technically stated: They're all on the same line in the complex plane).\n\nSo far, searches for these zeroes, aided by computers, have not found any deviations from the pattern. But just because we haven't seen a counterexample, doesn't mean it doesn't exist.\n\nThe Riemann Zeta function is linked to some other aspects of mathematics, such as the distribution of prime numbers. Confirming or disproving the Riemann Hypothesis would immediately confirm or disprove theorems about prime numbers. And there are a considerable number of other theorems that rely on the RH. They've been completely proven except for the assumption that the RH is true. So they're just waiting for that final piece of the puzzle.\n\nFinally, the outcome that I hope for is not that the RH is proven true or false, but a proof that the RH is independent of our normal system of mathematics. That means that we can assume it's true and our math still works fine. Or we can assume it's false and it still works fine. And that within our normal system of mathematics we can never prove either outcome. Such \"independent\" statements exist, but finding that the RH is one of them would be a profound discovery.",
   "created_utc": 1693491368,
   "score": 105,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijtme",
   "message": "Who put Bella in the wytch elm?",
   "created_utc": 1693487243,
   "score": 83,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijrta",
   "message": "An obscure one but the 1987 Arkansas murders of Don Henry and Kevin Ives, AKA \"The Boys on the Tracks.\"",
   "created_utc": 1693487222,
   "score": 77,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyirzx6",
   "message": "Was there ever anything hidden on oak island? And if so, what, who put it there, and who found and took it? I am certain the history Channel show will never find anything treasure wise",
   "created_utc": 1693490595,
   "score": 106,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijlvo",
   "message": "The Bermuda Triangle has always been a personal favorite\n\nEdit: sorry I didn’t know it was solved.",
   "created_utc": 1693487150,
   "score": 2,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyimrsh",
   "message": "what happened to Jimmy Hoffa?",
   "created_utc": 1693488507,
   "score": 25,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiontg",
   "message": "I have my own theory for what happened but, for me, the Maura Murray case is the one.",
   "created_utc": 1693489282,
   "score": 15,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiph05",
   "message": "Who is behind hundreds of military incursions since 2014 referred to as “range foulers”",
   "created_utc": 1693489605,
   "score": 23,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyipo3s",
   "message": "Amelia Earhart. She probably just went into the sea but no trace of her plane has ever been found. And none of the conspiracy theories seem very likely.",
   "created_utc": 1693489685,
   "score": 189,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiqfsz",
   "message": "There's several, but I would like to know how they built the gigantic pyramids.",
   "created_utc": 1693489986,
   "score": 17,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiu6s8",
   "message": "Big foot or lock Ness monster.",
   "created_utc": 1693491434,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiultn",
   "message": "Pyramids",
   "created_utc": 1693491592,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyivlg9",
   "message": "The Sea People is a good one.",
   "created_utc": 1693491959,
   "score": 66,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiju84",
   "message": "All or most of the missing 411 cases are mindblosing to me.",
   "created_utc": 1693487250,
   "score": 3,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyijtok",
   "message": "The Elisa Lam Cecil Hotel disappearance.",
   "created_utc": 1693487244,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyil39n",
   "message": "This question again?",
   "created_utc": 1693487794,
   "score": 252,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiuppi",
   "message": "This question gets asked and answered on a daily basis.",
   "created_utc": 1693491631,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyik0ds",
   "message": "Taman Shud was always a good on but it's likely been solved (still waiting on 100% confirmation?).",
   "created_utc": 1693487324,
   "score": 38,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyir1by",
   "message": "Jack the Ripoer, who he or they were.",
   "created_utc": 1693490219,
   "score": 17,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiruy9",
   "message": "The Devils hoof prints that stretched for miles around Devon.",
   "created_utc": 1693490541,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiull9",
   "message": "What really happened to M.Jackson",
   "created_utc": 1693491589,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiv8ey",
   "message": "Travel in a plane",
   "created_utc": 1693491825,
   "score": 1,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiyv8j",
   "message": "Who the hell wrote the Voynich manuscript. It's an advanced troll.",
   "created_utc": 1693493171,
   "score": 215,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyj2hvr",
   "message": "Disappearance of Andrew Gosden, he went and got a train to London 1 day, no 1 knew why and to this day he still hasn't come back, there's no evidence to go on so this mystery really intrigued me",
   "created_utc": 1693494490,
   "score": 131,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjfn1i",
   "message": "Who betrayed The Frank Family to the Germans.",
   "created_utc": 1693499223,
   "score": 61,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjor62",
   "message": "The Zodiac killer, prolly because I lived and played in the area where all the attacks took place.  I could literally see the area of the first known attack from my bedroom window.",
   "created_utc": 1693502487,
   "score": 118,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyj44ze",
   "message": "The disappearance of the Roanoke colony. I'm sure that they relocated to another fort or assimilated into native tribes but I don't think we ever got a true answer.",
   "created_utc": 1693495090,
   "score": 118,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyj0xtk",
   "message": "The mystery of why Casey Anthony isn’t rotting in a Florida prison for killing her daughter with Xanax and throwing her body in the garbage\n\nWe know what she did and how, and that she lied the ENTIRE time with nobody to corroborate her story, I just dunno how she’s living her best life to this day",
   "created_utc": 1693493925,
   "score": 168,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjjhfl",
   "message": "Consciousness.",
   "created_utc": 1693500600,
   "score": 48,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjceqk",
   "message": "Where is Bryce Laspisa? \n\nWhere is Maura Murrey? \n\nWhere is Summer Wells?\n\nWhere are Orsin and Orrin West?",
   "created_utc": 1693498067,
   "score": 25,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyj515c",
   "message": "The isdal woman.",
   "created_utc": 1693495417,
   "score": 59,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiyik3",
   "message": "[Ireland's Vanishing Triangle](https://en.wikipedia.org/wiki/Ireland%27s_Vanishing_Triangle)\n\nI would love closure for all the families.",
   "created_utc": 1693493043,
   "score": 50,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjghri",
   "message": "1. Who murdered Amy Mihaljevic?\n\nHow did the killer know the details of her mother being promoted at work?  How did they know to contact her at her house?  And, assuming they contacted the other girls in the area, how did they get all the girls' numbers?  \n\n\n2. What happened to Beverly Potts?  \n\nWas she murdered?  Kidnapped, but left alive?  Were the Plain Dealer Letters actually written by someone who knows what happened, or was it really a hoax?",
   "created_utc": 1693499525,
   "score": 32,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjmrq8",
   "message": "Its got to be the yuba county five. A group of five young men with mild intellectual disabilities disappeared on their way back from a basketball game. Their car was found abandoned on a high mountain road and there's a lot of mystery surrounding the whole incident: 4/5 bodies were found near a trailer over 20 miles from their car, which was abandoned in a snowpack that it could have easily been maneuvered out of, and a spooky eyewitness testimony from Joseph Schons describing headlights, a group of men and a woman holding a baby who stopped talking and turned off their flashlights when he called out for help (his car broke down in the snow). He said another group with flashlights roved past in the distance and also went quiet and shut off their lights when Schons called out for help. Mind you this is all way off course in plumas national forest in snowy february, the whole thing is extremely suspicious, not to mention the bodies were found starved to death in a trailer packed with comestible food. \n\nNo trace of the fifth man, Gary Mathias, has ever been found. I'd love to know what exactly went down that night.",
   "created_utc": 1693501767,
   "score": 45,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjl6wr",
   "message": "The Black Dahlia case",
   "created_utc": 1693501200,
   "score": 43,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyixt1f",
   "message": "I love unsolved mysteries but one I’m in interested in right now is where the bodies that have “gone missing” immediately vanish too and why the people never make a noise when they drown in Lake Lanier. Like whole ass cars can be searched for practically immediately and not be found till decades later. Bodies will go missing, looked for literally a few minutes after going missing and rarely ever found until weeks, months and even years later in an area so far down that it makes no sense they’d be found there at that time. The people surviving and telling how something just pulled their leg down and they woke up on the beach or the entity just disappears finding something else to attack. The place is obviously haunted, makes sense… but the biggest thing for me is— if they have people who are used to searching these depths for bodies and they can’t find the body/car/boat— where the fuck did they go. They can’t just get stuck and not be seen by professional divers who do this in the lake for a living.",
   "created_utc": 1693492782,
   "score": 46,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjgw22",
   "message": "Currently it's the Lady Bird Lake serial killer.\n\nThere have been something like 9 suspicious deaths over the last two years here in Austin.  Bodies are found floating in the town lake, \"Lady Bird Lake\".\n\nThe police just keep blowing it off -- nothing to see here, move along.\n\nThe prevailing conspiracy theory is someone is preying on young gay men at nearby gay bars.\n\nIn all cases the finding is just another drunk who stumbled, fell in the lake, and drowned.  No trauma signs, nothing shows up in toxicology reports.\n\nBut c'mon...nine?  In the same vicinity?  At night?  \n\nCould be coincidence of course, but....?  Sure doesn't feel like it",
   "created_utc": 1693499667,
   "score": 36,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjmcdz",
   "message": "personally i would like to know what happens after death. the age old question",
   "created_utc": 1693501613,
   "score": 24,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjrrx5",
   "message": "What happened to Asha Degree\n\nhttps://en.wikipedia.org/wiki/Disappearance_of_Asha_Degree?wprov=sfla1",
   "created_utc": 1693503565,
   "score": 29,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjqzjn",
   "message": "Hinterkaifeck murders would be neat to have answers for.",
   "created_utc": 1693503286,
   "score": 26,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjdvlq",
   "message": "West Memphis 3",
   "created_utc": 1693498594,
   "score": 12,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjmtzg",
   "message": "I'm an Indian. There's a case of murder of Arushi Talwar and Hemraj from 2008 that boggles me. I really wanna know what happened.",
   "created_utc": 1693501791,
   "score": 15,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjoerr",
   "message": "The Waubonsee stone is something that I've found fascinating since I learned about it. A very old stone with a face carved into it that stood where the Chicago river flowed into Lake Michigan. \n\nSome say a soldier carved it in the likeness of Chief Waubonsee but other sources state that the natives in the area had said that the stone and the face carved into it had been there longer than anyone living could remember.\n\nThe fact that there's a bowl like indentation carved into the top of it makes it seems ceremonial. Some far flung theories have been that The Pheonicians had found their way into the Great Lakes systems and it was put there by them to make a sacrifice to bless their voyage before moving forward. \n\nThe city of Chicago used it as a drinking fountain for a while and then put it in storage.",
   "created_utc": 1693502363,
   "score": 16,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjrxrf",
   "message": "Benjamin Bathurst was a British diplomat during the Napoleonic wars. While traveling, he was at an inn, stepped  out of sight, and apparently just disappeared. There is a superb 1940s  SF short story by H. Beam Piper based on this, called \"He walked around the horses\", in which it's explained by him slipping into a parallel universe where the French Revolution never happened (that was a much less familiar idea then). They are bewildered by all his authentic documents about non-existent things...\n\nBut the thing about these mysteries is that if we did find the real answer it would probably be something fairly boring. While it's unsolved we can have interesting theories.  I love the Piper theory in this case.",
   "created_utc": 1693503622,
   "score": 17,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjh78k",
   "message": "The staircase (original one)",
   "created_utc": 1693499780,
   "score": 14,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjr2s7",
   "message": "Yuba county five. Such a weird and tragic case.",
   "created_utc": 1693503317,
   "score": 5,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjwvlv",
   "message": "I would love to know how members of the Al- Hilli family and cyclist Sylvain Mollier came to meet their deaths in Annecy in the French Alps on the 5th September 2012. The case has had me gripped and puzzled from day one.",
   "created_utc": 1693505396,
   "score": 23,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyje45u",
   "message": "Kris Kremers and Lisanne Froon.",
   "created_utc": 1693498680,
   "score": 8,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyj9bq4",
   "message": "I would like a firsthand account of the Franklin Expedition after contact was lost.",
   "created_utc": 1693496967,
   "score": 18,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjlqno",
   "message": "I scrolled for so long and not one mention of the Bronze Age Collapse\n\nWhat happened to all of those civilizations?!",
   "created_utc": 1693501399,
   "score": 21,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyj9ldc",
   "message": "I feel like for me it'll always be Jon Benet Ramsey.",
   "created_utc": 1693497060,
   "score": 13,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjl1k5",
   "message": "The Magé incident two years ago in Brazil.",
   "created_utc": 1693501147,
   "score": 7,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjw2rs",
   "message": "I know it's almost certainly a hoax, but I'm fascinated by the Beale Ciphers. \n\nI mocked up an excel doc to set it up and every few months I'll throw another public-domain text in there to see if it decrypts it. It's probably impossible given how inconsistent most of the works can be, but it's fun to tinker around with.",
   "created_utc": 1693505106,
   "score": 8,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyiy52i",
   "message": "How do they get the figs into the fig rolls?",
   "created_utc": 1693492906,
   "score": 14,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjmxyr",
   "message": "Where the hell my tv remote went",
   "created_utc": 1693501831,
   "score": 23,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjtd7w",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjyls0",
   "message": "What the hell happened to Brian Shaffer?  Homedude walked into a busy bar, on camera, no other exits existed in the building, but he never came back out.",
   "created_utc": 1693506026,
   "score": 31,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjuziq",
   "message": "Where did the VHS tapes go from sinbad's movie Shazam???",
   "created_utc": 1693504710,
   "score": 28,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jykf02p",
   "message": "The murder of William Desmond Taylor. It's a real-life whodunnit murder mystery, set in the Golden Age of Hollywood. With movies like *Knives Out* doing well, I feel like it's ripe for a movie adaptation.\n\nSo many twists and turns that rival fictional mystery stories:\n\n* The keys in the victim's pockets didn't match any of the locks in his house.\n\n* His real name wasn't William Desmond Taylor.\n\n* His valet Edward Sands had a secret identity. \n\n* The doctor who pronounced him dead at the scene disappeared and was never found again.",
   "created_utc": 1693511986,
   "score": 24,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjj321",
   "message": "Did Mallory get to the peak of Everest before Hillary? Possibly a moot point since he certainly didn't get down...",
   "created_utc": 1693500459,
   "score": 14,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjplau",
   "message": "Edgar Allan Poe's death. Most people think he just got drunk and died but the dude was at least a month sober at the time. I think there's a lot to it.",
   "created_utc": 1693502789,
   "score": 12,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjwfwd",
   "message": "What actually happened to the Springfield 3?",
   "created_utc": 1693505237,
   "score": 10,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjs9xe",
   "message": "The arushi hemeraj double murder case  ? Countless speculation later we still dont know who killed them  (Since the case is mostly popular in the Indian subcontinent I urge you to please read about the same. )",
   "created_utc": 1693503745,
   "score": 8,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jykjw48",
   "message": "The disappearance of [Jodi Huisentruit](https://en.m.wikipedia.org/wiki/Jodi_Huisentruit). A local TV news anchor spoke to her coworker on the phone and said she overslept for work, but would be there soon. She was never seen or heard from again.",
   "created_utc": 1693513754,
   "score": 10,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjytvi",
   "message": "the escape from Alcatraz.. plausible that the escape was successful because no bodies or anything ever showed up in the bay. But we'll never 100% know",
   "created_utc": 1693506105,
   "score": 8,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyk0t7n",
   "message": "Isdal Woman, a woman found dead in 1970 in Norway.  The BBC did an entire podcast on it called Death in Ice Valley.\n\nhttps://en.wikipedia.org/wiki/Isdal_Woman\n\nhttps://www.bbc.co.uk/programmes/p060ms2h",
   "created_utc": 1693506828,
   "score": 8,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jykxb66",
   "message": "What were on Lewis Carroll's lost journal pages. Some of them were ripped out by Carroll by some were removed by his relatives. I wonder what was on those pages that was so damning that it needed to be removed.",
   "created_utc": 1693518745,
   "score": 5,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jykp4yn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyjenhg",
   "message": "How natalie wood died",
   "created_utc": 1693498872,
   "score": 6,
   "submission_id": "166a8no"
  },
  {
   "comment_id": "jyipu0j",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166a8no"
  }
 ]
}