{
 "submission_id": "166f0l5",
 "title": "Whats the best \"burning the bridge on the last work day\" story you've heard?",
 "selftext": "",
 "created_utc": 1693497484,
 "permalink": "/r/AskReddit/comments/166f0l5/whats_the_best_burning_the_bridge_on_the_last/",
 "score": 172,
 "url": "https://www.reddit.com/r/AskReddit/comments/166f0l5/whats_the_best_burning_the_bridge_on_the_last/",
 "comments": [
  {
   "comment_id": "jyjrbcw",
   "message": "There was a large datacenter in my city where one of the NOC employees reached his limit with his manager constantly being on his case. He loudly quit on the spot, told the manager to go to hell, and walked away. On his way out, he flipped the protective cover and punched the big red emergency button on the wall that deactivates all the electricity to the floor. It's meant to kill power if someone is actively being electrocuted. With one button he forcefully downed every server on the ground level - several hundred computers owned by about a hundred colocated clients went dark. He had scarcely made it out to the parking lot before the phones went nuts from customers calling to ask why their sites were down.\n\nBringing things back online wasn't a simple process either. They easily turned the main power back on, but having hundreds of servers immediately going into startup sequence generates an abnormally high power load which popped the smaller breaker panels on each row. It took every available tech to painstakingly power up small groups of servers at a time until everything was online.\n\nPretty sure that guy wasn't getting a recommendation from that job.",
   "created_utc": 1693503401,
   "score": 40,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjis16",
   "message": "I worked at a call center for 6 years and 3 days. On my last day I did the exit interview, it normally took people 5 minutes to do the exit interview. It took me just over an hour.\nI spilled the tea on everything! Every dirty deed, every affair, every illegal act, ALL the sexual harassment that went on..............EVERYTHING!!!\nA few days later word got back to me from friends that corporate came in and was doing an investigation into everything I had talked about. In the end a couple people lost their jobs, a few were demoted and A LOT of shit changed.",
   "created_utc": 1693500349,
   "score": 46,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjcfhy",
   "message": "I used to work for the company that was responsible for the distribution of electricity and gas in my city.\n\nOne of our tasks was to schedule the opening, closing, installation and removal of gas and electric installations.\n\nI had a co-worker who had been dumped by her fiancé, approximately 1 week before their wedding, becaus he had an affair with their neighbour. My college had been extremely sad about this, but on her last day of work (approximately 4 months later), she seemed to be doing better.\n\nHer shift ended at 6 PM that day, we wished her well and all that. It was a Friday.\n\nCue to Monday, when we receive non-stop calls from her ex, who was absolutely furious because that Friday someone had come to remove the electric installation. \n\nThe electricity contract was still on her name so she was legally allowed to ask for the removal of her electric installation.\n\nIt took 2 weeks before he had electricity again and she had to pay a fine.",
   "created_utc": 1693498074,
   "score": 153,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjfkf5",
   "message": "I worked at a supermarket for 10 years. I just got another job and was ready to give my notice. One night I was running the store and got paged to the front counter. It took me a few minutes to get up there, as I had to deal with other customers first. When I get there, the guy waiting for me said “Took you long enough!” \n\nHe had an issue with the new kid at the seafood case not knowing where something was in the back freezer. As I am walking back to seafood with him, he is bitching about the kid. He was being a real douche the whole time. I go to the freezer, find the shrimp he needs, then go to the counter to weigh it up. \n\nHe sees the bag of shrimp and bitches about there being too much ice in the bag, and isn’t paying for ice. Residual ice is factored out of the per pound price. I explain this to him, but he doesn’t believe me.  \n\nI am done at this point. I take the shrimp, slam it on the counter, and say to him “I am done with this crap, and dealing with a holes like you! I have another job and don’t need this sh*t anymore.  I’m leaving.”\n\nBest part: As I walk away from the seafood counter, I point to him and say “Oh, and one more thing: F YOU!”\n\nYou only get one chance in a lifetime to say something like this to a customer, I made sure I took advantage of it.",
   "created_utc": 1693499196,
   "score": 222,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk17tm",
   "message": "It was me. I burned the bridge, gleefully. \n\nFor context, this was pre-COVID. I was a cashier at a pet supply store and had turned in my two-week notice the week prior. Then, I came down with a nasty cold and lost my voice. I was coughing quite a bit too, and they could hear it over the phone when I tried to call in sick. But they gave the classic, “if you call out during your two-week notice, we’ll blacklist you”. They insisted I come in. \n\nFine. \n\nI was young, and this was my first job so I took the threat seriously. But I had some malicious compliance in mind. As a cashier, I had to go over the store intercom whenever I needed backup at the register. So whenever I had to call for backup, I put on my worst, most gravelly, nasally voice I could and blasted it all over the store. But hey, I was just doing my job, right? Sometimes I even put in a cough for good measure. I could see that quite a few customers were getting disturbed. I’m guessing someone complained, because I was finally ushered off the register and told to go home and that I didn’t need to finish out my remaining shifts. \n\nStill might’ve been blacklisted.",
   "created_utc": 1693506972,
   "score": 148,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjbwlg",
   "message": "When I worked for Radio Shack it was pretty common place for store managers as their last act to lock the doors and then throw their keys of the roof of the store. Most would also make sure their 2nd key wasn't scheduled to open the next day.",
   "created_utc": 1693497887,
   "score": 98,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjch9e",
   "message": "Guy I worked with was supposed to close that night at sams in the meat department. He didnt clean, stock out product nor finish the truck. The next morning we had double the truck, and we had to clean.",
   "created_utc": 1693498092,
   "score": 21,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjdeib",
   "message": "Karen acted like a dick to everyone but especially to her supervisor, saying some mean things and how she'd do better in a higher-paying position elsewhere. Fast-forward some months and the supervisor was appointed as the manager in Karen's new company, she was out and looking for a job later that same week. I like to think he applied for the position out of pettiness.",
   "created_utc": 1693498423,
   "score": 36,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjidkj",
   "message": "I don't know about best, but damn funny.  A former coworker (retail) used to but heads with our manager like CRAZY.  Manager was an ass, but for whatever reason he and this coworker were just at each others throats most of the time.\n\nCoworkers last day he's all smiles and he surprised all of us by actually fulfilling his two weeks rather than quitting on the spot.  But later that evening we realized why he was all smiles...\n\nSaid manager coworker had problems with comes back in the store after his shift was up and he's FUMING!  Turns out my coworker decided to zip-tie the managers doors shut on his car and used industrial strength glue on the handles as well.\n\nThe store had no facing cameras in the area of the lot where the manager was parked, so there wasn't any direct evidence of him doing it , but everyone knew he did it.\n\nLast I heard the manager attempted to take him to small claims court, but I never heard what came of it.",
   "created_utc": 1693500205,
   "score": 63,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyji066",
   "message": "I think of this one from Youtuber Doug Walker.  He quit his job as a janitor at a factory, but honestly it comes across as more cringe than anything else:\n\nhttps://www.youtube.com/watch?v=pZ-Sy11mvZU",
   "created_utc": 1693500071,
   "score": 17,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjygp5",
   "message": "A guy knew he was being let go so he pooped in his desk trash can.",
   "created_utc": 1693505975,
   "score": 28,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk701d",
   "message": "I spent five years running the regional-level delivery arm of a retailer. I literally wrote the book on how to do that job, designed the processes and procedures from scratch and built a whole host of programs, tools and databases to make it easier. In my first year, delivery accuracy went from 60% to 99% and we were making just shy of £1M a year from online orders alone.\n\nManagement walked someone brand new to the company into my office and insisted that I train her to be my immediate superior (a job I had been covering the whole time and had been promised on multiple occasions). They got my resignation instead and I wiped the hard drive and USBs containing the only copies and backups of everything I had built.\n\nSometimes I feel sorry for the new hire for being dropped into that mess but it felt good burning the entire operation to the ground.",
   "created_utc": 1693509071,
   "score": 106,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjbqeu",
   "message": "Probably *Bridge of the River Kwai*",
   "created_utc": 1693497825,
   "score": 31,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk8lqd",
   "message": "Had a company who used a key FOB system for all their locks. Working with tons of techno tards made it so I was usually in charge of managing/issuing new FOBS. When I put my 2 weeks in because they denied me a raise \"because it wasn't in the budget\" I found a better paying job. During the last week they posted my job and I saw they were offering more for someone brand new to start vs just giving me the raise. I took this as a fuck you and I took their key fob system and fucked it up.\n\nEvery key fob that's issued has its own unique 5 digit code, and there was over 100 key fobs issued. I went into the system and just changed 1 digit on every code on my last day there but didnt update the system. so when the next person went behind me to issue a new key they had to hit update to send the new code to all the locks. In doing so it invalidating all the key fobs and no one could get into any doors to lock or unlock rooms.\n\nThey had to spend close to $10,000 reissuing new fobs and replacing the system because they didn't know what was wrong or caused it and they thought the system was faulty.\n\nI found this out through a friend who still worked there 2 months after I quit. Made me smile knowing I costed them the money and it would have just been cheaper to give me the raise I asked for",
   "created_utc": 1693509657,
   "score": 101,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykc1rs",
   "message": "I handed all my keys back to security and not my boss. Those keys were coveted because most of them were skeleton keys and the rest were likely the only ones that could open some doors. And no one was supposed to have them anymore so security was never going to let them go.\n\nOops. Lolololol",
   "created_utc": 1693510913,
   "score": 64,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk0pbm",
   "message": "The place I work at was having people poached left and right by this other company.  So management was on edge about that.\n\nOne guy I was working with, a young guy, got an offer from that company, a few thousand more a year, but only a 1-year contract (vs perm where he was).  It was....dubious, but he took the other job.  And then he asked the rest of us how to handle the situation.\n\nI told him once he has the offer letter in-hand, put in your 2 weeks notice.  And then during that time, just kinda keep it quiet where he's going and just keep doing his job here until he's done here, he doesn't want to burn any bridges just in case.\n\nSo what does he do?  Well, he was one of the first guys in the office every day.  So he gives his notice, then the next day, he comes in, doesn't see if there's anything that needs to be done first thing in the morning (there was, it was important), and instead walks around for the next hour telling everyone where he was going and how much more money he was making there.  And he did all this while his boss' boss' boss was sitting in his office just watching this happen.\n\nThe big boss told my boss to get him the hell out of here, now.  So he's gone, and everyone's kinda pissed at him.  The way he was bragging about how much he was about to make was annoying most people, and the way it looked like he was trying to get others to go to this other company was pissing off the higher-ups.\n\nFast-forward a year, his contract ends, he's out of a job.  He reaches out to my boss again and asks if he can come back.  She ignored that e-mail.\n\nedit:\n\nOh, story #2: We had a bunch of space where IT people sat at the data center.  Of course that space had tons of cameras.  A dude walked into a conference room there, picked up a computer, and walked out the front door, with the mouse still attached to the computer, dangling behind him.  I can't say for sure if that was him TRYING to burn a bridge, but it certainly did.  The extra insane part of that is we had a bunch of old machines we were about to throw away, and he knew if he just asked for one, he would have been given one to take home, for free, no questions asked.",
   "created_utc": 1693506789,
   "score": 21,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk00g5",
   "message": "Either #1, #4, or #7 from [here](https://www.askamanager.org/2017/10/resigning-via-cod-a-glorious-out-of-office-message-and-other-quitting-stories.html).",
   "created_utc": 1693506536,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk2yzf",
   "message": "I read elsewhere on reddit someone took a dump on their boss desk",
   "created_utc": 1693507604,
   "score": 7,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykbbcd",
   "message": "This is my story. \n\nI worked at a grocery store in the deli section (this will be important); we were allowed two bathroom breaks and one longer break to do our shopping. Well, one time, I unexpectedly got my period. Wadding up paper will not do the trick in my case. So, I took a bathroom break, QUICKLY bought some tampons, went to the bathroom and then returned to work. I wasn't gone any longer than a regular bathroom break. Someone from my section must have seen me and ratted me out to the manager (with whom I had already had multiple issues and we went head to head many times) and so he confronted me about it. I told him what the case was but he was not having it. So, I go out on the floor, in front of my coworkers and customers alike, and yell at the top of my lungs: \"I BOUGHT TAMPONS BECAUSE I'M ON MY **PERIOD**\" then ripped off my apron, hair net, and deli shoes, and threw them in a nearby trashcan. Then I gave everyone the \"dueces\" sign saying, \"PEACE I'M OUT!\"\n\nThe look on everyone's faces, with their jaws on the floor was 🤌🏻",
   "created_utc": 1693510644,
   "score": 39,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykeqnk",
   "message": "This actually happened in the UK.\n\nA person won the lottery on scratch cards. He climbed the desk in an open office. Dropped his trousers and underpants to knees, showed his back side to his boss. Shouted “ stick this job up your ass “ . Drove to claim the lottery and realised HE HAD MISREAD ONE NUMBER SO HAD ONLY WON FEW HUNDREDS AND NOT THOUSANDS WHICH THE FIRST PRIZE WAS.",
   "created_utc": 1693511893,
   "score": 37,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjji8x",
   "message": "That's one way to leave an unforgettable impression! 😂🔑",
   "created_utc": 1693500608,
   "score": 5,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykackd",
   "message": "I was working at staples when I was like 20 or something. Already had my 2 week notice in, was moving out of state. I had 3 days left and a customer starts asking about chairs and so I'm helping him. He asks for one so I go in the back and carry this 100 pound box off the top shelf and bring it down. He says he changed his mind. Okay so I go grab the next one. Says he changed his mind again. Go grab another. He's like yeah that's the one. \n\nSo I offer to bring him up and he's like \"grab your manager, I want a discount\" and I told him that's not how this works. We already had a sale going so he was already getting a discount. So I said this. It's also to note that we just had a meeting that as employees we can offer what the managers do to free up time but I was a little pissed at bringing all those down which wasn't an easy task. So I said, sorry sir I'm not gonna do that. \n\nAnd he snapped out. He said \"I TOLD YOU TO GET THE FUCKING MANAGER\"\n\nWelp that was all I needed. So I got in his face and was like \"what the fuck did you just say to me you fucking bitch? I'll beat your ass right in front of your fatass girlfriend.\" And he backed off. I told him to get the fucking manager himself. \n\nSo he did, I got pulled into the office where they have the one sided mirror so I can see the manager dealing with him. My other 2 managers  who were really nice ladies were like why did you do that and so I told them. I realized my manager was probably gonna give him the discount so I walked out and told them all in front of anyone \"you can give them the discount I already gave them, or they can leave. If you give him a further discount I'm going to clock out and go in the parking lot and beat his ass. So he can either take it as is or leave\". \n\nGuy bought the chair and left. And to my surprise. Didn't get fired. I could work all the departments so I guess they needed me for that extra 2 days. \n\nSeriously I'm not a super tough guy and don't act like that, he just caught the wrong one on the wrong day.",
   "created_utc": 1693510293,
   "score": 41,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjcts9",
   "message": "Story of my life in this one.\n\n[https://www.youtube.com/watch?v=qXIjE\\_gDw94](https://www.youtube.com/watch?v=qXIjE_gDw94)\n\nNever Go Back and Never Forgive.\n\nN. S",
   "created_utc": 1693498215,
   "score": 0,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykg0ta",
   "message": "Dude walked in, sat at his computer, ran a PDWipe, and walked out without saying a word and leaving a letter of resignation on the manager’s desk for in the morning.",
   "created_utc": 1693512354,
   "score": 20,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykg10l",
   "message": "I took a week of vacation and then didn't come back except to drop off company property. Essentially gave -1 week notice.",
   "created_utc": 1693512356,
   "score": 9,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykhso4",
   "message": "This is one from my dad's old work. A guy is pretty sure he's about to be laid off. The company's been laying lots of people off and he's fairly sure he's next to bite the bullet.\n\nSo just before he's called into his manager's office to be given his marching orders he writes a bit of code that will fuck up the company's databases. Sets it to go off in a few minutes. And into the office he goes.\n\nHe's staying.\n\nAs soon as he hears that he dashes out of the office and manages to stop the code before it runs.",
   "created_utc": 1693512996,
   "score": 90,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyki2ys",
   "message": "Not sure it’s the best story but disgruntled co-worker took a shit on the bosses desk.",
   "created_utc": 1693513100,
   "score": 3,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykzy62",
   "message": "This entire post is the reason a lot of companies will escort you out the door and pay you out the second you give your notice.",
   "created_utc": 1693519775,
   "score": 29,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyl65eg",
   "message": "A trainer at the gym was fired in front of everyone and he literally jumped in the air as high as he could in joy, ripped off his name tag, threw it on the ground, then calmly but loudly said Thank you so much for firing me. The manager looked so confused but I heard they treated their trainers like garbage",
   "created_utc": 1693522317,
   "score": 20,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykl5vg",
   "message": "A guy who repeatedly sped through a photo radar speed trap while driving the company van.",
   "created_utc": 1693514217,
   "score": 16,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykzcdb",
   "message": "I was running the grill at a little local place in my teens. Big flattop. Like a 5 footer. The night manager was a bitch and just constantly gave me shit but there were only a few people that could handle the grill during a rush and I was one of them. So one night I had just had enough. This lady would just follow me around and berate me about every little aspect of my job. I was going to pull a fuck you I quit that night. I was just waiting for the steam to build up and that one comment she was going to make so I could just fuck you and leave. It happened, but in the moment, I had a more devious plan. I just gave her the \"ok Bobbi, I'll do better\" and turned back to my grill. Waited til she hit the corner, then filled the grill up with burgers. Like wall to wall. There wasn't a gap of 1cm between the patties. I cranked the burners up to high and just waltzed out of the kitchen and the back door. This was right after a rush, so I was the only one in the kitchen while everyone else was restocking and such. No one saw it happen. Later that night, one of my friends, who was also a coworker, called me up and was like what happened to you tonight man? Bobbi is after you. I'm like so what fuck her. I guess it was maybe at least 10 minutes before anyone realized I was gone but by that time they had to shut the grill down completely because the kitchen was full of smoke and the grill was so hot that they couldn't use it for like an hour. Wrecked their dinner rush. I never even tried to pick up my last check because I was banned and I sure as shit wasn't paying for the waste I had caused. Well I guess I did because I didn't get my check. They never mailed it and I never asked. That was almost 30 years ago and that bitch is still a manager there so I still can't go back.",
   "created_utc": 1693519534,
   "score": 26,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykpc5z",
   "message": "This guy who jumped out of a plane:\n\nhttps://en.wikipedia.org/wiki/JetBlue_flight_attendant_incident",
   "created_utc": 1693515740,
   "score": 8,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykvmfh",
   "message": "Ex-flight attendant Steven Slater\n\n[https://www.dailymail.co.uk/travel/article-1302116/JetBlue-attendant-Steven-Slaters-exit-sparks-Facebook-campaign.html](https://www.dailymail.co.uk/travel/article-1302116/JetBlue-attendant-Steven-Slaters-exit-sparks-Facebook-campaign.html)\n\nHe snapped and quit in style! He even got arrested.",
   "created_utc": 1693518103,
   "score": 5,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykt5ya",
   "message": "Beating the copier machine with a sledgehammer.",
   "created_utc": 1693517173,
   "score": 4,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykz9ue",
   "message": "Bit of a reverse to this - Head of the IT Department left after a difficult couple of years and was only just on speaking terms with his senior management team. \n\nDirector’s PA organises his leaving party. Not one member of staff from his department of around 30 turn up to it, and instead have their own party elsewhere.",
   "created_utc": 1693519506,
   "score": 5,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyl5zjz",
   "message": "Back in ‘06 I was an EMT and worked for a private transport ambulance/wheelchair van company.  Mostly it was bringing older people to doctor appointments from nursing homes, or hospital discharges to rehabs facilities or nursing homes but we are fully licensed ambulances and have contacts with the larger municipalities to provide additional EMS service when they need it, but that means we can’t close due to bad weather. We had 4 different stations each with their own catchment areas. The problem was the schedules would just look at how many trucks were available on a given day and wouldn’t really pay attention to the number of trucks in a particular area, and the dispatchers wouldn’t care.  So it wasn’t uncommon for a truck in zone 1 to get told to drive 45 min to zone 2 to help, but then they’d have to send a zone 2 truck back to zone 1 because we’d now be on a different run.\n\nI had already been planning on leavening as I was in the Army National Guard and my unit already had orders for a June mobilization for deployment (Iraq) so I was just not wanting to deal with trying to find a job for such a short period.\n\n\nSo it’s late January in the middle of a snow/ice storm and my partner and I get told to drive to zone 2 because they are busy and we’re not. Maybe 10 min down the road as we’re passing about 4 cars off the road in a 100 ft stretch and we hit a patch and off we go, but an ambulance is slightly heavier so we get stuck pretty deeper in the snow bank. Dispatch is pissed when we call saying we can’t go to zone 2 because we’re stuck and need a tow truck.\n\nNow comes the bridge burning. Maybe 2 weeks later it’s storming again about as bad as last time and we get a call again to head to zone 2 **to stage just incase**. Now I’m arguing about the roads and what happened last time as the main route between is not the best maintained. I’m told “We don’t care, just do what your told”.  So we start driving and before we even get to where we slid off last time we hit a patch and fishtail ending up facing the wrong was. I look at my partner, say “NOPE”, turn off the radio, drive back to the station, drop my uniform, and leave. I was told later that this set off quite the shit storm as there had already been a call out and they we’re pulling my truck as they had not been able to get anybody in to replace them. So they now had no other real backup plans and the cascade of trying to “rob Peter to pay Paul” trucks from the other zones to cover everything throughly pissed people off and I’m told started a string of people quitting.  I had to deal with working through a temp agency at a few shitty gigs for a couple of months till I deployed but it was worth it. I ended up reenlisting active duty afterwards so I didn’t care about any burned bridges anyway.",
   "created_utc": 1693522247,
   "score": 7,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyl7cc2",
   "message": "This guy I knew got fired from a haudralic hose Vendor. He got fired in the morning but was required to work all day. He spent the day red locktiting all their most expensive fittings together. He was a cunt and deserved to get fired.",
   "created_utc": 1693522837,
   "score": 3,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylk678",
   "message": "I worked for a major healthcare company in the U.S., and had been performing my manager's job, in addition to my own, for 6 months after the previous one left the company.  They then hired someone from outside the company to be the manager.  Someone that had no inkling of how to do what we did (highly technical position).\n\nHis boss (my 2-up boss), then asked me to write out a description of my daily, weekly, and monthly duties above and beyond my current position.  He intended to create a new position based on those duties and then hire me for it, with a \"big raise\".  When HR balked at the pay increase, he then hired his GF who worked there (he was married as well) for the position.  She was not technical, and would call/email me constantly to assist her with her duties.  I explained to her that I was busy doing my ACTUAL job, and couldn't help with the new duties she was asked to perform.\n\nOn top of all this, I was tasked with running multiple monthly reports in COBOL (I was the only person in the company that knew how to run them and attempts to teach others were total failures).  These reports generated tens of millions of dollars every month for the company, as they indicated how much we were reimbursed for Medicare and Medicaid from the federal government each month.  Tens of millions, remember?  And the boss just hired his GF over me for the job I was already doing.  I found another job easily, with a 20k a year raise, and told them I was leaving.  They panicked, begged me to stay, but wouldn't match my offer, so I just left.  \n\nI found out later that after a few months, they just closed my division (which makes sense as I did 80 percent of the work as well as administering the ticketing system).  Oh well, screw them.  They say you don't leave companies, you leave managers, and that manager was totally the reason I left!  Bye Michael, you lying POS!",
   "created_utc": 1693528296,
   "score": 3,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylc30w",
   "message": "Had a coworker who had been getting a lot of unnecessary shit from our boss. She requests that she works basically 8 days in a row but quit on the first day of those shifts. The thing about this, is that the people who could come in were all on PTO and the place was strapped for money (private sleep lab), so they could not afford to not have patients on those days. The manager ended up having to come in and do those nights for the full 8 days.",
   "created_utc": 1693524899,
   "score": 4,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyl6ylg",
   "message": "I don't know if this will count. This actually happened at an old job years ago. We had a single teller desk. The teller would often leave the desk without letting anyone know. A relationship manager (RM) walks in after going out to buy his lunch, but no teller. So he walks past the front area and sees teller. RM says, \"Teller there's a customer waiting.\" RM is a super chill guy. It takes a lot to make him upset. He just has a very monotone voice.  Next thing we know teller goes to the lunch room. Teller opens the door and screams, \"You have to respect me.\" RM tries to defuse the situation, because obviously teller took the heads up the wrong way. Then teller screams out, \"Fuck you!\" RM told teller to go home. Then went to the CFO to report the what happened. CFO promptly fired teller. RM for his part didn't want teller fired, but CFO said the decision was final.",
   "created_utc": 1693522671,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyllc9z",
   "message": "NYC- small company.\n\nThe international sales manager was owed something like 100k from the owners. \n\nHe has worked on and off with them for a decade. They attempted to give him the runaround and have him sign a contract for less commission. \n\nLike a madman, he threw the company’s server out of the 4th story window. \n\nHe was a king among children.",
   "created_utc": 1693528793,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylo7gd",
   "message": "I dream of pooping on my bosses desk and dropping my keys in it..",
   "created_utc": 1693530022,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylodc1",
   "message": "Not as exciting as some of these stories. Worked in a shoe shop. I had a boss who was crazy. She threatened to shoot us and was hot and cold. You never knew what would set her off. I got drunk at my goodbye lunch and got back to work and thought I was gently taping all of the shoe racks on my way to put my purse in my locker. I was not. I knocked down all the displays. Shoes all over the place. She told me to leave and that was that.",
   "created_utc": 1693530094,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylr7ug",
   "message": "This wasn't me, but I worked there, it was a long time ago.  \n\nIt was a plastic injection-molding factory, and they decided to pack up and move to Mexico. One guy had an office, and Friday was his last day.  \n\nBefore he left, he took his phone, dialed one of those expensive pay-per-minute sex lines, and put the phone in the bottom drawer of his desk, with the handset off the hook. The cleaning staff found it....almost a week later.",
   "created_utc": 1693531270,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jym0fcs",
   "message": "We poured a large concrete slab for a petrol station forecourt on a Friday. The new guy - he had been with us three weeks and was obviously not cut out for manual labour and it was probably only a matter of time until he got the sack - was tasked with cleaning all our concrete covered tools and locking them away while we all floated the new slab up to smooth and level finish. We finished this up about 7:30pm and all headed home after a really big day. When the boss picked me up on Monday morning he told me that the new guy had quit via text message over the weekend and also added that he thought we were all a bunch of macho assholes for working such long hours without taking rest breaks; this is just the nature of working against the clock with a product (concrete) that once it has set is pretty permanent. When we got to work to start prepping for the next section of the concrete work at this petrol station we opened up the shipping container that we move from job to job and keep our tools in. Inside of it were our five large wheel barrows completely full of set concrete. Semi-submerged in this hard concrete were our coffeemaker, spare pairs of boots, the spare keys to the company truck, hard hats, cell phone chargers and the three George Foreman grills we toast sandwiches at lunch on. What a wanker.",
   "created_utc": 1693535063,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jym0tlx",
   "message": "I was going through psychosis and I said a lot of deranged things before leaving.",
   "created_utc": 1693535236,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylu7ni",
   "message": "A buddy who worked on air at a small town radio station had taken a job at another station 8 hours away. On his last on air shift..he signed off by trashing the town…his coworkers and the station management. This was on a Friday. Monday morning he showed at his new job all ready and excited. The station manager pulled him into his office and hit the play button on his answering machine. Buddies face drops. It his sign off from Friday. The previous manager forwarded the comments to the new boss on the Saturday. Station Manager fires him right there says by they don’t want a guy like that on the team. \n\nHe couldn’t get another job in radio for 2 years after that. Word spread fast about the dumbest radio jock in Ontario.",
   "created_utc": 1693532486,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylq58l",
   "message": "He’s in prison now, but I worked at a fast food restaurant and this older guy always hated working there, and he always said if they fired him that he would *”take a sh-t in the drive-thru”*\n\nWell he may’ve been a psycho but he was honest.",
   "created_utc": 1693530839,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylqblr",
   "message": "A friend of mine worked for a guy who kept photos of his kids on his desk. On his last day working for him, my mate swapped out the photos for photos of him naked. Took the guy about 3 weeks to realise.",
   "created_utc": 1693530913,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylvkv1",
   "message": "Person I worked with wrote a letter about our managers and sent it to one of the higher up administrators on their last day. I was actually able to read it. It was about 5 pages long and gave so many examples of how they treated the entire staff on a daily basis. \n\nWithin a month, one manager was transferred to another office. The other got a different job a couple of months after that and is banned from being a manager in our organization again.",
   "created_utc": 1693533049,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylyhnm",
   "message": "An old arsehole workshop supervisor was giving a young guy a hard time constantly so said young guy sneaked up behind him and zip tied his neck and walked out of the building. This was where I work, we had to quickly get cutters and free the old guy as he was suffocating. Pretty sweet vengeance. Everyone agreed he deserved it. Young guy was fired and police involved.",
   "created_utc": 1693534246,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jylzhj2",
   "message": "The best \"burning the bridge on the last work day\" story i have heard is when a good mate of mine named Tom worked as a chef at a chinese restaurant called \"The Hong Kong Dragon\" and on his last shift he got really drunk and decided to go in the freezer and pee on the wontons before the Chinese new year celebrations. It was quite funny, they didn't fire him as well, they even paid him and said \"Thank you for your service, Tom, simple as!\".",
   "created_utc": 1693534669,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jym0sox",
   "message": "I like Doug Walker's video",
   "created_utc": 1693535224,
   "score": 1,
   "submission_id": "166f0l5"
  }
 ]
}