{
 "submission_id": "166f5yw",
 "title": "People who have adult children that don’t talk to you. Why do you think that is?",
 "selftext": "",
 "created_utc": 1693497810,
 "permalink": "/r/AskReddit/comments/166f5yw/people_who_have_adult_children_that_dont_talk_to/",
 "score": 244,
 "url": "https://www.reddit.com/r/AskReddit/comments/166f5yw/people_who_have_adult_children_that_dont_talk_to/",
 "comments": [
  {
   "comment_id": "jyk59ry",
   "message": "Parent. It’s because I fucked up and neglected the relationship. I wasn’t the father she deserved. It’s that simple.",
   "created_utc": 1693508435,
   "score": 98,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk2t2g",
   "message": "From the other parent perspective. my adult children (25 and 23) do not communicate with their father at all.\n\nLong story short, he remarried about a week after our divorce was final and he and his new wife went on to have children of their own. Over time, his visits with the children because more infrequent and stressful due to his wife's distaste for me and my children. He has had no contact with the kids in over 3 years and his previous attempt was 4 years before that.\n\nMy youngest says he will never forgive his father for replacing us all with a new family and forgetting us. The oldest says it's just not worth chasing someone who has no interest. Personally, I'm sad and angry on their behalf. He divorced me, not them.\n\nEDIT: I can't reply to every one, but I want to say, the amount of people who say they've experienced this same issue astounds me, and breaks my heart. I just do not understand a parent who can walk away from their child(ren). Even when it's been hard and I've had to be both Mom and Dad, I wouldn't trade my kids for anything.",
   "created_utc": 1693507544,
   "score": 200,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjt385",
   "message": "My daughter went through a traumatic event when she found out her Mom was having an affair with a junkie. Daughter was furious at her Mom for destroying the family. Mom flipped out, threatened suicide to our daughter’s face, blaming her. At that moment, everything shifted and daughter became the nurturer to her Mom, who regressed into childhood - a complete switching of roles when my daughter really needed a Mom. Mom wasn’t safe to be angry at (for fear she’d kill herself), so I became the target. \n\nWe talk, but it’s so terse and superficial that it’s close to non-communication.  I’d like to talk through what happened, even in a therapeutic setting, but daughter says that’s off the table.",
   "created_utc": 1693504033,
   "score": 169,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyka2l0",
   "message": "Mom here. My 23 year old hasn't spoken to me in four years. It was completely my fault. I've struggled with addiction (alcohol) and for most of her childhood I was bad. I hope to be able to apologize to her someday. But, I completely understand and respect her decision.",
   "created_utc": 1693510192,
   "score": 236,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjjzk8",
   "message": "their dad gave an ultimatum- if they want to have a relationship with him, they had to go NC (edit: no contact) with me. my middle child agreed to those terms.",
   "created_utc": 1693500776,
   "score": 38,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjrkh9",
   "message": "My mother told me, three weeks after I lost my father/best friend at fourteen, that he has told her on his deathbed that \"Adopting me was his greatest mistake.\"\n\nIt stuck with me my whole life. I'm 38 now, and know it wasn't true. But that narcissistic bitch can rot in hell.",
   "created_utc": 1693503490,
   "score": 99,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk74zn",
   "message": "My step daughter is an addict and mentally ill. Her son was placed in our custody by the state three years ago at 13 months old and she has never made the effort to regain custody. Her rights were terminated last year and we adopted him last month when the state gave us the choice. She has hated us ever since he was placed here and has convinced herself that we stole her child. She only contacted my husband if she wanted money, which he won't give her so that makes her hate us more.",
   "created_utc": 1693509121,
   "score": 253,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk2tpf",
   "message": "I am a parent of a child who does still talk to me but rarely and I fully accept that it is my fault . I was an immature parent and made some bad decisions in addition to being inconsistent with my parenting due to immaturity. I am also on the spectrum but that’s something I didn’t find out until a few years ago when my son was diagnosed.  I know I wasn’t great and I understand my daughter and I try to give her space.",
   "created_utc": 1693507550,
   "score": 117,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykj3dl",
   "message": "I was very deep in resolving my own trauma when my kids were growing up. I was often distant and emotionally unavailable. I wasn’t the parent they deserved. It is the greatest sorrow of my life; I did to my kids what my mom did to me. I can’t be sorry enough.",
   "created_utc": 1693513467,
   "score": 87,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjqppr",
   "message": "My father would say that my mother lied and manipulated us into taking her side during the divorce.\n\nThe truth is that he boasted to me about pulling a gun on her to \"teach her a lesson\", and then didn't understand why I thought that was unacceptable. I haven't spoken to him in a decade since that discussion. To this day, I believe he was contemplating murder-suicide or family annihilation.",
   "created_utc": 1693503189,
   "score": 131,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjvmfq",
   "message": "I grew up in a retirement community. What I’ve noticed was it’s due to a few things. The parent is intolerant of their child’s life choices. That can be everything from drugs, religion, politics, racist ideology(parents), who their kids married etc. Sometimes it’s the parents unpleasant personality from either some personality disorder or just plain being an asshole. \n\nSome kids usually stay away cause they feel they’ve disappointed their parents and are hiding their life from them.\n\nThe majority of the issue is usually do to an unpleasant parent.",
   "created_utc": 1693504940,
   "score": 242,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjmt1f",
   "message": "It's very telling that none of the answers are from parents, all from children who know perfectly well why they went no contact.",
   "created_utc": 1693501781,
   "score": 14,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjm6f4",
   "message": "I know this wasn’t the point of this post, but I am the grown child.\nFive years ago, on Thanksgiving no less, my mother told me my wife and I are bad parents because our daughter is an only child. Then followed it up by saying my wife graduated from a terrible high school. Not sure where that came from. \nShe then topped it off with an ugly racist remark about my (white) sister in law being married to a black man.  Lastly, she said I was not allowed to tell my wife any of this. That lasted about 45 seconds.\nAnd that was the end of that.",
   "created_utc": 1693501552,
   "score": 45,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjkhhb",
   "message": "I am very careful with \"advice\" that I give to my adult son for fear that he's going to stop taking to me.  IMO the kid (?) is making some decisions in his personal and work life that I don't agree with or have concerns about, decisions that I would not make based on experience or my personal views.  I am biting my tongue to not say anything.  I don't want to be a nagging parent because he is an adult and needs to make his own way.  I will give advice when asked but I've stopped giving out-of-the-blue opinions.\n\nI save that for my high school teens still at home.  :\\^)",
   "created_utc": 1693500948,
   "score": 179,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjy717",
   "message": "[deleted]",
   "created_utc": 1693505878,
   "score": 96,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyka04t",
   "message": "I had ptsd and didn't deal with it. In short I was a shitty dad.",
   "created_utc": 1693510167,
   "score": 218,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk40v4",
   "message": "I have 4 kids.  My two oldest aren't living with me.  My oldest daughter talks to me some.  My oldest son wishes me dead.    \n\n\nI made many many mistakes when my kids came back to live with me. (ex wife lost custody)  My eldest hated my LTR girlfriend.  My daughter was right.  She was terrible and consequently so was I.  My daughter left to go back with her mother as she was not doing well here.  I understand, now, why.  My LTR made eldest sons life miserable too.  During that time I broke up with the LTR.  It was too late.  My eldest son left to go be with his mother and sister.    \n\n\nI am sure that my ex wife is not helping this matter but he is mad at me and I know I made some pretty bad decisions.  I have accepted the fact I may never have a relationship with him ever again.",
   "created_utc": 1693507981,
   "score": 10,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk3u9x",
   "message": "My son hasn’t spoken to me in over 10 years. He had behavioral issues as a teen. I took him to doctor after doctor to get him help. He ended up in a partial hospitalization program. He had them fooled for weeks that there was nothing wrong with him, but one day it all came crashing down. After that, he deteriorated quickly in that program. We had come to the point where he was either going to full hospitalization, a boys school for troubled teens, or he was going to be arrested for assault. His father, whom he only saw maybe twice a year, didn’t want that and said he wanted to take custody of him. The program would only let that happen if my son was enrolled in a comparable program with his father. Father said “of course”.  Didn’t happen. My son grew up and was a terror to his father and had little to no contact with me. He got arrested a few times. After one particularly bad fight with his father, he got kicked out. After a few months, my son contacted me, on Mother’s Day. He told me he was in the Marines and was done with basic training and was going to be given an assignment soon. I’ll never forget how proud I felt of my son then. Shortly after, I get contacted by the Marines, asking if I knew where my son was. He went AWOL the day after Mother’s Day. After a few years without contact, he contacted me again. Said he was doing much better and wanted to visit me. I said yes. I should’ve known when I had to pay for his bus ticket that he wasn’t better. He stayed with me for a few days and I thought all was well. Not so much. Two days after he left, I got a call from my credit card company. He stole my card and put $1600 of AIR SOFT PISTOLS on it. I was given the choice to pay it, or call it fraud in which case the credit card company would press charges. I called it fraud. I haven’t seen him since. I’m still his friend on Facebook and have seen that he poses as a wounded Iraq vet. That is disgusting and shows me he hasn’t changed at all.  That’s why I don’t talk to him.",
   "created_utc": 1693507915,
   "score": 85,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjig3y",
   "message": "I don't talk to my parents because they don't make an effort to talk to me. Why should I give them the time?",
   "created_utc": 1693500230,
   "score": 40,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjhf6d",
   "message": "They're gonna blame the kids instead of their own shitty parenting",
   "created_utc": 1693499861,
   "score": 199,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykhdqk",
   "message": "I wasn't there for them like I should have been.  I had a stillborn and began having mental health issues with depression and eventually dx bipolar and ended up leaving the girls with their dad.  I don't blame them.",
   "created_utc": 1693512847,
   "score": 188,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjsqwt",
   "message": "Mine doesn't because I won't give him any money because it just enables his addiction issues.",
   "created_utc": 1693503912,
   "score": 218,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk5d90",
   "message": "I’m a stepmother (technically) to two adult children who went no contact years ago. I see why. I don’t blame them at all. They’re about to be my ex-stepkids. I genuinely wish them well and I’m sorry they have a shitty dad.",
   "created_utc": 1693508471,
   "score": 203,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjnelj",
   "message": "Abusive parents deserve no contact unless they can admit their faults and heal the wounds usually it’s too late when we are adults. My mother on the other hand after years of no contact came around and made peace. I’m still healing from her bs",
   "created_utc": 1693501999,
   "score": 166,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk0zn2",
   "message": "I had a patient (she has since passed RIP) who didn’t talk to her youngest daughter. We were very close (saw her 3x a week) so I asked her why she thought her daughter distanced herself away from her. She simply said that they were too alike and they butted heads, even over little things. She did admit that since they distanced themselves from each other, she has had more peace and she thinks her daughter does too. \n\nNot sure if her daughter went to her funeral, although in my head I’m hoping she did. She died from COVID.",
   "created_utc": 1693506892,
   "score": 210,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjhbfh",
   "message": "He died",
   "created_utc": 1693499823,
   "score": 85,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk9m76",
   "message": "So, I have one grown child I'm one to, and one I am not.\n\nMy wife and I divorced when they were young. My ex was in a relationship with a child abuser - not hyperbole. He went to prison when my kids were in their late teens.\n\nMy ex was/is very narcissistic. She and her new hubby had no problems with alimentation between me and them. My weekend to pick them up? Whoops, they had a road trip. I get them over the summer? Sure! Hell, take some extra time, no rush. Plans for the summer while the kids are with me. Then threatening to call the feds if I don't have them back immediately. \n\nSo, that was their mom's side of things. I wound up in a relationship with another toxic woman. She would be good to the kids in front of me and shit when my back was turned. When I finally saw what she was doing, we split. Still, damage was done.\n\nDuring the initial divorce, I was in a bad place. My kids were my world, and they were just gone. Broke me, and made me not the best father to be around. I wasn't there even when I was present. \n\nMy ex decided she was moving, and the kids couldn't come with her. I loved in another state by then. I had 2 days to find a truck and go get them. During this time, the child abuse allegations came out about their step dad. Their mom made it all about her. \n\nWhile my relationship with my kids improved after leaving crazy woman 2, it never fully recovered. My oldest and I are closer, and I appreciate it. He is no contact with either his sister and his mother. My youngest and I are at peace. We aren't as close as I would like, which is a shame. But, I understand. There's no way to make up for not being there.\n\nI'm now married to a lovely woman. The kids (grown) love her. Her daughter considers my son her brother, though he was grown by the time this dynamic started. \n\nI won't say it was all the doing of my ex. I wasn't present. Life takes you places you don't want to go.l, like it or not. So, now, I just take those relationships as they come and try not to push myself too hard into their lives.",
   "created_utc": 1693510025,
   "score": 66,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk1wci",
   "message": "I'm not going to get into detailed specifics but my wife's son refuses contact with her (us). He was a very troubled kid the entirety of his childhood. We found out way way too late that his father had been sexually abusing him since he was very young. There were signs, and my wife was aware of some physical abuse, but as she was being abused as well she never saw the full extent of it. He (the father) was very good at hiding the sexual abuse and any questioning of situations or behavior was met with violence. She got away and eventually we were married when her son was just starting his teens. He was in therapy but issues continued, stealing, lying, vandalism, violent outburst, etc and it became worse when his father was murdered in a drug incident. Everything finally came to a head when he was caught showing my daughter (8 at the time, he was 15) porn and masturbating in front of her. We removed him from our home and with the help of his therapist had him placed in a home for kids with issues like his. His problems still continued until he was removed from that home to an institution after a sexual incident that involved another resident. He spent months in that facility and when it came time for him to be released we arranged for him to live with some of my family that could provide a safe space for him to continue his treatment and finish high school. This was when he finally came forward with the sexual abuse he had endured under his father. It practically broke my wife and she still blames herself for not seeing it and not getting him out sooner.\n\nThings seemed to be going well for him and we started to include him in functions with the rest of the family (my daughter doesn't remember the incident but has received counseling regardless). Finally he graduates high school and his very next move is to pack up his stuff and move out of my families house where he had been living and into some family of his late fathers. Over the course of the next few months he gets more and more distant, stops therapy, stops calling or texting and stops responding to our calls and texts. He changed his number, didn't reach out to his mother on her birthday or mothers day and pretty much went no contact then. A last ditch effort by us was to just show up where he was living and try to connect with him. He and my wife spent hours crying and talking and we thought things could move forward but we were wrong as he gave my wife a fake number and blocked her on any social media he had. Over the past few years I've found his contact info, usually emails attached to socials, and reached out to him begging him to just text his mother and let her know he was ok and I would get an unhinged reply that I was invading his space and that he would decide when the time was right to contact her. My wife has felt defeated but over time she has resolved herself to this new normal with her son. \n\nA couple of months ago he sent her a long FB message basically renouncing everything he had admitted about his father, as well as abuses he had perpetuated that we knew about, blaming my wife for her failed marriage with his abusive father and then marriage to me (a person he evidently hates), making his father a martyr that was murdered in cold blood, and essentially telling her that until she begs his forgiveness for all the wrongs she caused him and divorces me(?) he will never talk to her again and hope she rots in hell.\n\nShe was very hurt of course but she didn't respond. He obviously still needs loads of mental help but we don't have the strength to go through all of that again nor put our other children through all of that again. He's an adult now and he's going to have to figure it out on his own. We'll still be here for him when he gets it together and comes around. Such is life.",
   "created_utc": 1693507216,
   "score": 115,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjz7id",
   "message": "I made some really hard and possibly fucked up choices while my older two were teens and I would understand if they didn't want anything to do with me but they do. I'm so blessed to have them in my life still and the youngest gets the benefits of me seeing where I went wrong and trying not to make the same mistakes again.",
   "created_utc": 1693506245,
   "score": 147,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjjnh1",
   "message": "It’s been probably the biggest struggle of my life cutting my parents out of my life but I left home 12 years ago and haven’t seen them since. They still make it so hard to talk to them. Asking the parents about their perspective to maybe find some answers",
   "created_utc": 1693500658,
   "score": 184,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk7lkm",
   "message": "Because I failed them as a father.",
   "created_utc": 1693509290,
   "score": 121,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk3elb",
   "message": "My sister doesn't speak to one of her kids. They have gone through spurts of not talking to her. She expects too much of people. She's very entitled. She doesn't follow through on commitments. (She still owes me a wedding quilt she started - married 43 years now) She's always the person who is hard done by. Nothing works out for her. She wants to be taken care of, that's all. She thinks she should get to spend her money as she pleases and someone else should subsidize her lifestyle because that's what she wants. She has burned through all her options and is on the verge of homeless. She's manipulative and a taker. She doesn't do anything terrible - no drugs, booze or gambling - and appears to be very sweet and caring. But she really believes she's owed much more and she shouldn't have to do anything to have it. She apparently abused her son who took her in. I have no clue what she did or didn't do but it was enough that he booted her out. I'm sure there were conditions set in place when he took her in and I'm sure she ignored the conditions and did as she pleased. Why do I think that? Because that's what she did to me. She always has her \"reasons\" and everyone else is unreasonable. It's that old nut about doing the same thing over and over but expecting a different result. I feel bad for her but man, she just keeps throwing herself off cliffs.",
   "created_utc": 1693507760,
   "score": 231,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyjio70",
   "message": "I'm 39 and rarely talk with my mother anymore. Anytime I do she has to bring it around to Republican talking points and no matter how often I change the subject or just express that I hate hearing that shit, she won't fucking stop doing it. I don't think she fully appreciates how completely impossible it would be for me to ever believe in any of that bullshit. She thinks I'm like almost there but just have yet to see the light. She's also just wildly paranoid in general and always has this ridiculous theories about her neighbors plotting against her that are just depressing to listen to. I really tried to be a good adult son with her. I used to call her once a week. I flew out to her city and visited twice per year despite the fact that she has literally never come to visit me in the 20 years I've been out of the house except the one time when she needed a place to stay for her sister's funeral. She's just completely lost in a world delusion, paranoia and narcissism.",
   "created_utc": 1693500311,
   "score": 231,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk45n8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykgtu1",
   "message": "There's a woman at church and every week she asks for prayers during prayer requests. At first I thought it was kinda cute but it's over a year later and she always asks for prayers that her children will speak with her again. She claims to have been the best mother and, one-by-one, all three of her adult children and thus her grandchildren stopped speaking with her. But she did everything right - she fed them, she clothed them, she put them through school. Which to me sounds like the bare minimum that you're supposed to do as a parent and not \"everything\", but ok.\n\nI gave her the benefit of the doubt but then, every week, another piece of the puzzle would come out. She tried calling but her numbers blocked. She tried to find them on social media but she's blocked. How strange, she says she was such an excellent mother, why would they block her? She tried reaching out again and received a handwritten letter on why she should never contact them again, but we never heard the contents of the letter. We were just supposed to pity her and have sympathy and assume that these entire separate groups of people were evil and were doing her emotional harm.\n\nI got to know her and she is an abusive narcissist and nothing short of pure evil. All the red flags you'd expect are there. But, every week it's pray to Jesus for me everybody, my evil ungrateful children, blah blah blah. I'd like to hope she is just clueless but I understand she is sick and probably doesn't know how horrible she really is. I feel very, very bad for her kids but very happy they were strong enough to break away from that hot mess. It almost brings me physical pain now when she asks for prayers that her kids will talk to her again, because I know all she wants to do is resume hurting them.",
   "created_utc": 1693512647,
   "score": 113,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyksink",
   "message": "Oooh I'ma read through these comments and see if my dad is a redditor.\n\nEdit: Shit this kinda blew up.",
   "created_utc": 1693516929,
   "score": 157,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykccun",
   "message": "My children are low contact.  I feel it's fair.  Their mother has BPD.  She was violent and abusive.  She has gotten help but she still hurt them.  I did not protect them.  Them not being around me is justified.  They should be angry.  We fucked up.  They didn't do anything wrong and they need to heal as they see fit.  Kids not being around their parents have valid reasons.  Most people just can't accept it.",
   "created_utc": 1693511025,
   "score": 150,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykxieh",
   "message": "I am an asshole",
   "created_utc": 1693518822,
   "score": 32,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykgm6z",
   "message": "Kind of off the main point here. I had a child I gave up for adoption at birth, primarily because I was a single mother w a 4 yr old.  I worked. I was always tired.  It was the right thing.  Fast forward 12 years, I'm surprised by a,knock at the door: it was his adopted parents.  And wham back came,all the trauma and pain and confusion, as they felt he would benefit from knowing me.   He didn't.  I became anxious about the relationship, and he eventually quit coming around.  I think I was a disappointment to him, and I'm sorry.  He has not stayed in touch, in spite of now distant attempts.  I haven't tried in 3 years.  He's happier and so am i.",
   "created_utc": 1693512571,
   "score": 198,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykphx6",
   "message": "I think my Uncle would say it's because his sons were brainwashed by their wives. \n\nThe truth is, I think my cousins didn't see that my Uncle's (diagnosed) narcissism wasn't normal, because they were raised by him. Their wives, as outsiders, pointed this out to them for the first time and they made their decision from there.",
   "created_utc": 1693515800,
   "score": 86,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykpkqe",
   "message": "I wonder how many of these stories have a very different side to them.",
   "created_utc": 1693515828,
   "score": 25,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykyi7m",
   "message": "I wasn’t the best father. Even though my kids wanted for nothing all through their time before leaving home I had my own issues when they were young and was distant and emotionally abusive. When I realized what I had been doing it was too late. As they grew up we had no common interests even as I supported them in theirs, they avoided me unless absolutely necessary for things they needed for projects or school. Counseling helped, but emotionally they have no connection to me at all. I don’t hold anything against them. I know it’s on me. I hope they can have healthier relationships with their kids if they have any.",
   "created_utc": 1693519202,
   "score": 28,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyls5si",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jymgvun",
   "message": "I read this entire thread and was so confused as to why so many people left their parents and moved to North Carolina…. Then I saw one comment that explained NC is “No Contact”…. I kept reading stuff like “My dad slapped me so I went NC” as if North Carolina was some safe haven…",
   "created_utc": 1693542933,
   "score": 200,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyk3rol",
   "message": "I know of a distant family cousin whose parents fired him from their very successful family business because he refused to take his wife and children to their church and worship the way they did.  In retaliation he and his wife refused to allow his parents to see the grandchildren.  They sued.  They lost.  They never were able to see their grandchildren and eventually died.  He ended up with the business anyway by default, not by the will.  They lost decades of grandchildren just by being stubborn.  Nobody in the family had anything to do with them the last 35 years of their lives and they were miserable.  Fuck them.\n\nParents, if you fuck over your children don't expect to every have your grandchildren.",
   "created_utc": 1693507889,
   "score": 185,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykqkys",
   "message": "Child of parents I didn't talk to *and* parent of a child who doesn't speak to me. It's a lot of mental health issues. Didn't break the cycle. That shit is on me. I'm better now, although my parents have both passed. There may be a reconciliation with my child, but I doubt it.",
   "created_utc": 1693516203,
   "score": 248,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jyl9ekz",
   "message": "Mom of a 23 year old who went no contact a few years ago. If I’m really honest with myself, after years of reflection, I failed to provide the amounts and types of guidance he needed as he was growing up. I have “reasons” to explain why I failed to provide enough attention or did the wrong thing… but at the end of the day, the reasons why I failed don’t matter a bit from his perspective. Because the result was still that he was hurt as a consequence of my choices. \nI hope he is healing and self reflecting himself. I miss him terribly but respect his boundaries.",
   "created_utc": 1693523730,
   "score": 157,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jykcljy",
   "message": "My father is a convicted sex offender. He still blames the victim (family member) saying it's her fault.",
   "created_utc": 1693511113,
   "score": 175,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jynuc7y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jymww6d",
   "message": "When my parents died, we found a chalkboard in their attic where my mom had written: \"Why do my children hate me?\"  She never knew.    \n*for the record, killing \u0026amp; cooking my pet didn't help her cause.*",
   "created_utc": 1693553265,
   "score": 36,
   "submission_id": "166f5yw"
  },
  {
   "comment_id": "jynn10c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166f5yw"
  }
 ]
}