{
 "submission_id": "166f0l5",
 "title": "Whats the best \"burning the bridge on the last work day\" story you've heard?",
 "selftext": "",
 "created_utc": 1693497484,
 "permalink": "/r/AskReddit/comments/166f0l5/whats_the_best_burning_the_bridge_on_the_last/",
 "score": 44,
 "url": "https://www.reddit.com/r/AskReddit/comments/166f0l5/whats_the_best_burning_the_bridge_on_the_last/",
 "comments": [
  {
   "comment_id": "jyjrbcw",
   "message": "There was a large datacenter in my city where one of the NOC employees reached his limit with his manager constantly being on his case. He loudly quit on the spot, told the manager to go to hell, and walked away. On his way out, he flipped the protective cover and punched the big red emergency button on the wall that deactivates all the electricity to the floor. It's meant to kill power if someone is actively being electrocuted. With one button he forcefully downed every server on the ground level - several hundred computers owned by about a hundred colocated clients went dark. He had scarcely made it out to the parking lot before the phones went nuts from customers calling to ask why their sites were down.\n\nBringing things back online wasn't a simple process either. They easily turned the main power back on, but having hundreds of servers immediately going into startup sequence generates an abnormally high power load which popped the smaller breaker panels on each row. It took every available tech to painstakingly power up small groups of servers at a time until everything was online.\n\nPretty sure that guy wasn't getting a recommendation from that job.",
   "created_utc": 1693503401,
   "score": 44,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjis16",
   "message": "I worked at a call center for 6 years and 3 days. On my last day I did the exit interview, it normally took people 5 minutes to do the exit interview. It took me just over an hour.\nI spilled the tea on everything! Every dirty deed, every affair, every illegal act, ALL the sexual harassment that went on..............EVERYTHING!!!\nA few days later word got back to me from friends that corporate came in and was doing an investigation into everything I had talked about. In the end a couple people lost their jobs, a few were demoted and A LOT of shit changed.",
   "created_utc": 1693500349,
   "score": 94,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjcfhy",
   "message": "I used to work for the company that was responsible for the distribution of electricity and gas in my city.\n\nOne of our tasks was to schedule the opening, closing, installation and removal of gas and electric installations.\n\nI had a co-worker who had been dumped by her fiancé, approximately 1 week before their wedding, becaus he had an affair with their neighbour. My college had been extremely sad about this, but on her last day of work (approximately 4 months later), she seemed to be doing better.\n\nHer shift ended at 6 PM that day, we wished her well and all that. It was a Friday.\n\nCue to Monday, when we receive non-stop calls from her ex, who was absolutely furious because that Friday someone had come to remove the electric installation. \n\nThe electricity contract was still on her name so she was legally allowed to ask for the removal of her electric installation.\n\nIt took 2 weeks before he had electricity again and she had to pay a fine.",
   "created_utc": 1693498074,
   "score": 50,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjfkf5",
   "message": "I worked at a supermarket for 10 years. I just got another job and was ready to give my notice. One night I was running the store and got paged to the front counter. It took me a few minutes to get up there, as I had to deal with other customers first. When I get there, the guy waiting for me said “Took you long enough!” \n\nHe had an issue with the new kid at the seafood case not knowing where something was in the back freezer. As I am walking back to seafood with him, he is bitching about the kid. He was being a real douche the whole time. I go to the freezer, find the shrimp he needs, then go to the counter to weigh it up. \n\nHe sees the bag of shrimp and bitches about there being too much ice in the bag, and isn’t paying for ice. Residual ice is factored out of the per pound price. I explain this to him, but he doesn’t believe me.  \n\nI am done at this point. I take the shrimp, slam it on the counter, and say to him “I am done with this crap, and dealing with a holes like you! I have another job and don’t need this sh*t anymore.  I’m leaving.”\n\nBest part: As I walk away from the seafood counter, I point to him and say “Oh, and one more thing: F YOU!”\n\nYou only get one chance in a lifetime to say something like this to a customer, I made sure I took advantage of it.",
   "created_utc": 1693499196,
   "score": 107,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk17tm",
   "message": "It was me. I burned the bridge, gleefully. \n\nFor context, this was pre-COVID. I was a cashier at a pet supply store and had turned in my two-week notice the week prior. Then, I came down with a nasty cold and lost my voice. I was coughing quite a bit too, and they could hear it over the phone when I tried to call in sick. But they gave the classic, “if you call out during your two-week notice, we’ll blacklist you”. They insisted I come in. \n\nFine. \n\nI was young, and this was my first job so I took the threat seriously. But I had some malicious compliance in mind. As a cashier, I had to go over the store intercom whenever I needed backup at the register. So whenever I had to call for backup, I put on my worst, most gravelly, nasally voice I could and blasted it all over the store. But hey, I was just doing my job, right? Sometimes I even put in a cough for good measure. I could see that quite a few customers were getting disturbed. I’m guessing someone complained, because I was finally ushered off the register and told to go home and that I didn’t need to finish out my remaining shifts. \n\nStill might’ve been blacklisted.",
   "created_utc": 1693506972,
   "score": 14,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjbwlg",
   "message": "When I worked for Radio Shack it was pretty common place for store managers as their last act to lock the doors and then throw their keys of the roof of the store. Most would also make sure their 2nd key wasn't scheduled to open the next day.",
   "created_utc": 1693497887,
   "score": 31,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjch9e",
   "message": "Guy I worked with was supposed to close that night at sams in the meat department. He didnt clean, stock out product nor finish the truck. The next morning we had double the truck, and we had to clean.",
   "created_utc": 1693498092,
   "score": 14,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjdeib",
   "message": "Karen acted like a dick to everyone but especially to her supervisor, saying some mean things and how she'd do better in a higher-paying position elsewhere. Fast-forward some months and the supervisor was appointed as the manager in Karen's new company, she was out and looking for a job later that same week. I like to think he applied for the position out of pettiness.",
   "created_utc": 1693498423,
   "score": 22,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjidkj",
   "message": "I don't know about best, but damn funny.  A former coworker (retail) used to but heads with our manager like CRAZY.  Manager was an ass, but for whatever reason he and this coworker were just at each others throats most of the time.\n\nCoworkers last day he's all smiles and he surprised all of us by actually fulfilling his two weeks rather than quitting on the spot.  But later that evening we realized why he was all smiles...\n\nSaid manager coworker had problems with comes back in the store after his shift was up and he's FUMING!  Turns out my coworker decided to zip-tie the managers doors shut on his car and used industrial strength glue on the handles as well.\n\nThe store had no facing cameras in the area of the lot where the manager was parked, so there wasn't any direct evidence of him doing it , but everyone knew he did it.\n\nLast I heard the manager attempted to take him to small claims court, but I never heard what came of it.",
   "created_utc": 1693500205,
   "score": 20,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyji066",
   "message": "I think of this one from Youtuber Doug Walker.  He quit his job as a janitor at a factory, but honestly it comes across as more cringe than anything else:\n\nhttps://www.youtube.com/watch?v=pZ-Sy11mvZU",
   "created_utc": 1693500071,
   "score": 9,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjygp5",
   "message": "A guy knew he was being let go so he pooped in his desk trash can.",
   "created_utc": 1693505975,
   "score": 9,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk701d",
   "message": "I spent five years running the regional-level delivery arm of a retailer. I literally wrote the book on how to do that job, designed the processes and procedures from scratch and built a whole host of programs, tools and databases to make it easier. In my first year, delivery accuracy went from 60% to 99% and we were making just shy of £1M a year from online orders alone.\n\nManagement walked someone brand new to the company into my office and insisted that I train her to be my immediate superior (a job I had been covering the whole time and had been promised on multiple occasions). They got my resignation instead and I wiped the hard drive and USBs containing the only copies and backups of everything I had built.\n\nSometimes I feel sorry for the new hire for being dropped into that mess but it felt good burning the entire operation to the ground.",
   "created_utc": 1693509071,
   "score": 10,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjbqeu",
   "message": "Probably *Bridge of the River Kwai*",
   "created_utc": 1693497825,
   "score": 17,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk8lqd",
   "message": "Had a company who used a key FOB system for all their locks. Working with tons of techno tards made it so I was usually in charge of managing/issuing new FOBS. When I put my 2 weeks in because they denied me a raise \"because it wasn't in the budget\" I found a better paying job. During the last week they posted my job and I saw they were offering more for someone brand new to start vs just giving me the raise. I took this as a fuck you and I took their key fob system and fucked it up.\n\nEvery key fob that's issued has its own unique 5 digit code, and there was over 100 key fobs issued. I went into the system and just changed 1 digit on every code on my last day there but didnt update the system. so when the next person went behind me to issue a new key they had to hit update to send the new code to all the locks. In doing so it invalidating all the key fobs and no one could get into any doors to lock or unlock rooms.\n\nThey had to spend close to $10,000 reissuing new fobs and replacing the system because they didn't know what was wrong or caused it and they thought the system was faulty.\n\nI found this out through a friend who still worked there 2 months after I quit. Made me smile knowing I costed them the money and it would have just been cheaper to give me the raise I asked for",
   "created_utc": 1693509657,
   "score": 11,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykc1rs",
   "message": "I handed all my keys back to security and not my boss. Those keys were coveted because most of them were skeleton keys and the rest were likely the only ones that could open some doors. And no one was supposed to have them anymore so security was never going to let them go.\n\nOops. Lolololol",
   "created_utc": 1693510913,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk0pbm",
   "message": "The place I work at was having people poached left and right by this other company.  So management was on edge about that.\n\nOne guy I was working with, a young guy, got an offer from that company, a few thousand more a year, but only a 1-year contract (vs perm where he was).  It was....dubious, but he took the other job.  And then he asked the rest of us how to handle the situation.\n\nI told him once he has the offer letter in-hand, put in your 2 weeks notice.  And then during that time, just kinda keep it quiet where he's going and just keep doing his job here until he's done here, he doesn't want to burn any bridges just in case.\n\nSo what does he do?  Well, he was one of the first guys in the office every day.  So he gives his notice, then the next day, he comes in, doesn't see if there's anything that needs to be done first thing in the morning (there was, it was important), and instead walks around for the next hour telling everyone where he was going and how much more money he was making there.  And he did all this while his boss' boss' boss was sitting in his office just watching this happen.\n\nThe big boss told my boss to get him the hell out of here, now.  So he's gone, and everyone's kinda pissed at him.  The way he was bragging about how much he was about to make was annoying most people, and the way it looked like he was trying to get others to go to this other company was pissing off the higher-ups.\n\nFast-forward a year, his contract ends, he's out of a job.  He reaches out to my boss again and asks if he can come back.  She ignored that e-mail.\n\nedit:\n\nOh, story #2: We had a bunch of space where IT people sat at the data center.  Of course that space had tons of cameras.  A dude walked into a conference room there, picked up a computer, and walked out the front door, with the mouse still attached to the computer, dangling behind him.  I can't say for sure if that was him TRYING to burn a bridge, but it certainly did.  The extra insane part of that is we had a bunch of old machines we were about to throw away, and he knew if he just asked for one, he would have been given one to take home, for free, no questions asked.",
   "created_utc": 1693506789,
   "score": 6,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk00g5",
   "message": "Either #1, #4, or #7 from [here](https://www.askamanager.org/2017/10/resigning-via-cod-a-glorious-out-of-office-message-and-other-quitting-stories.html).",
   "created_utc": 1693506536,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyk2yzf",
   "message": "I read elsewhere on reddit someone took a dump on their boss desk",
   "created_utc": 1693507604,
   "score": 2,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykbbcd",
   "message": "This is my story. \n\nI worked at a grocery store in the deli section (this will be important); we were allowed two bathroom breaks and one longer break to do our shopping. Well, one time, I unexpectedly got my period. Wadding up paper will not do the trick in my case. So, I took a bathroom break, QUICKLY bought some tampons, went to the bathroom and then returned to work. I wasn't gone any longer than a regular bathroom break. Someone from my section must have seen me and ratted me out to the manager (with whom I had already had multiple issues and we went head to head many times) and so he confronted me about it. I told him what the case was but he was not having it. So, I go out on the floor, in front of my coworkers and customers alike, and yell at the top of my lungs: \"I BOUGHT TAMPONS BECAUSE I'M ON MY **PERIOD**\" then ripped off my apron, hair net, and deli shoes, and threw them in a nearby trashcan. Then I gave everyone the \"dueces\" sign saying, \"PEACE I'M OUT!\"\n\nThe look on everyone's faces, with their jaws on the floor was 🤌🏻",
   "created_utc": 1693510644,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykeqnk",
   "message": "This actually happened in the UK.\n\nA person won the lottery on scratch cards. He climbed the desk in an open office. Dropped his trousers and underpants to knees, showed his back side to his boss. Shouted “ stick this job up your ass “ . Drove to claim the lottery and realised HE HAD MISREAD ONE NUMBER SO HAD ONLY WON FEW HUNDREDS AND NOT THOUSANDS WHICH THE FIRST PRIZE WAS.",
   "created_utc": 1693511893,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjji8x",
   "message": "That's one way to leave an unforgettable impression! 😂🔑",
   "created_utc": 1693500608,
   "score": 4,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykackd",
   "message": "I was working at staples when I was like 20 or something. Already had my 2 week notice in, was moving out of state. I had 3 days left and a customer starts asking about chairs and so I'm helping him. He asks for one so I go in the back and carry this 100 pound box off the top shelf and bring it down. He says he changed his mind. Okay so I go grab the next one. Says he changed his mind again. Go grab another. He's like yeah that's the one. \n\nSo I offer to bring him up and he's like \"grab your manager, I want a discount\" and I told him that's not how this works. We already had a sale going so he was already getting a discount. So I said this. It's also to note that we just had a meeting that as employees we can offer what the managers do to free up time but I was a little pissed at bringing all those down which wasn't an easy task. So I said, sorry sir I'm not gonna do that. \n\nAnd he snapped out. He said \"I TOLD YOU TO GET THE FUCKING MANAGER\"\n\nWelp that was all I needed. So I got in his face and was like \"what the fuck did you just say to me you fucking bitch? I'll beat your ass right in front of your fatass girlfriend.\" And he backed off. I told him to get the fucking manager himself. \n\nSo he did, I got pulled into the office where they have the one sided mirror so I can see the manager dealing with him. My other 2 managers  who were really nice ladies were like why did you do that and so I told them. I realized my manager was probably gonna give him the discount so I walked out and told them all in front of anyone \"you can give them the discount I already gave them, or they can leave. If you give him a further discount I'm going to clock out and go in the parking lot and beat his ass. So he can either take it as is or leave\". \n\nGuy bought the chair and left. And to my surprise. Didn't get fired. I could work all the departments so I guess they needed me for that extra 2 days. \n\nSeriously I'm not a super tough guy and don't act like that, he just caught the wrong one on the wrong day.",
   "created_utc": 1693510293,
   "score": 3,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyjcts9",
   "message": "Story of my life in this one.\n\n[https://www.youtube.com/watch?v=qXIjE\\_gDw94](https://www.youtube.com/watch?v=qXIjE_gDw94)\n\nNever Go Back and Never Forgive.\n\nN. S",
   "created_utc": 1693498215,
   "score": 0,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykg0ta",
   "message": "Dude walked in, sat at his computer, ran a PDWipe, and walked out without saying a word and leaving a letter of resignation on the manager’s desk for in the morning.",
   "created_utc": 1693512354,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykg10l",
   "message": "I took a week of vacation and then didn't come back except to drop off company property. Essentially gave -1 week notice.",
   "created_utc": 1693512356,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jykhso4",
   "message": "This is one from my dad's old work. A guy is pretty sure he's about to be laid off. The company's been laying lots of people off and he's fairly sure he's next to bite the bullet.\n\nSo just before he's called I to his manager's office to be given his marching orders he writes a bit of code that will fuck up the company's databases. Sets it to go off in a few minutes. And I to the office he goes.\n\nHe's staying.\n\nAs soon as he hears that he dashes out if the office and manages to stop the code before it runs.",
   "created_utc": 1693512996,
   "score": 1,
   "submission_id": "166f0l5"
  },
  {
   "comment_id": "jyki2ys",
   "message": "Not sure it’s the best story but disgruntled co-worker took a shit on the bosses desk.",
   "created_utc": 1693513100,
   "score": 1,
   "submission_id": "166f0l5"
  }
 ]
}