{
 "submission_id": "166f9h3",
 "title": "Gamers of Reddit at what age do you think you’ll stop gaming?",
 "selftext": "",
 "created_utc": 1693498031,
 "permalink": "/r/AskReddit/comments/166f9h3/gamers_of_reddit_at_what_age_do_you_think_youll/",
 "score": 120,
 "url": "https://www.reddit.com/r/AskReddit/comments/166f9h3/gamers_of_reddit_at_what_age_do_you_think_youll/",
 "comments": [
  {
   "comment_id": "jyjcg19",
   "message": "When I'm dead",
   "created_utc": 1693498079,
   "score": 103,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjodpl",
   "message": "I’m 52 and I’m still on Xbox daily.\n\nI like to message my grown kids’ gamertags to tell them I banged their mom last nite.",
   "created_utc": 1693502351,
   "score": 42,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjperl",
   "message": "Why would someone stop \"gaming\". Games have always been part of life. Old people playing chess or cards is still gaming and nobody asks when grandma will outgrow her bridge group. It's just a generational misunderstanding that computer games are somehow just toys for kids.",
   "created_utc": 1693502723,
   "score": 159,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjdp6d",
   "message": "Never. I fully intend to be in the future version of a senior living community that has a LAN video game club room where we can play whatever the version of a game is the classic one. \n\nCan you imagine a bunch of 60 year olds all yelling at each other playing something like Among us? Or super sexy modded version of BG3? Wouldn't that be enjoyable? \n\nI also think the older we (the very digitally connected generations) get the less lonely and isolated we will be as we are pretty familiar with ways to find new community or friends if so desired. \n\nCan you imagine a streamer house full of 70yo gamer ladies who stream together and do crafts together? I'd watch the hell outta that now honestly.",
   "created_utc": 1693498530,
   "score": 90,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjcgbu",
   "message": "[deleted]",
   "created_utc": 1693498082,
   "score": 66,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjlupc",
   "message": "At NG+ .",
   "created_utc": 1693501439,
   "score": 99,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjceaq",
   "message": "Can't stop. Won't stop.",
   "created_utc": 1693498062,
   "score": 5,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjlnwi",
   "message": "Well I'm 56 now and I've been gaming since I was probably 7 or 8, so I'm thinking never.",
   "created_utc": 1693501371,
   "score": 70,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjddpv",
   "message": "Until my body can’t game anymore.",
   "created_utc": 1693498415,
   "score": 195,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjnabq",
   "message": "62 and still gaming",
   "created_utc": 1693501956,
   "score": 57,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjcgo5",
   "message": "No.  Pretty sure never.",
   "created_utc": 1693498086,
   "score": 41,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjeyjo",
   "message": "Probably when arthritis takes my damn fingers unless a new mode of play is available.",
   "created_utc": 1693498981,
   "score": 45,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjlvic",
   "message": "My grandfather got me into gaming. He died at 87. I'll probably follow the path of until death.",
   "created_utc": 1693501447,
   "score": 36,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjenyt",
   "message": "I doubt I ever will stop completely.\n\nMy wife and I are talking about having kids soon. That's definitely going to make it harder to game, but, at the same time, gaming is a a pretty accessible hobby for someone with limited/inconsistent free time, so I expect I'll keep playing as a dad, just not as often. \n\nAt the same time, gaming is an *incredible* hobby as you get older - it's mentally stimulating, requires minimal physical movement, and is a great way to socialize with friends from all over. I fully expect my eventual nursing home to host LAN parties where we play Mario Kart and joke about how nice it used to be when the Earth had a breathable atmosphere.",
   "created_utc": 1693498877,
   "score": 127,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjnitb",
   "message": "Probably won't ever completely stop, but at 25 I almost never play games anymore. Always got other things to do.",
   "created_utc": 1693502042,
   "score": 22,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjdi10",
   "message": "Considering the studies going around showing that gaming helps with mental diseases etc.... Imma keep going.",
   "created_utc": 1693498457,
   "score": 56,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjkcia",
   "message": "When will readers stop reading?\n\nOr movie watchers stop watching?\n\nI assume whenever they can't anymore.  Maybe having children, lack of time, or physical ailments prevent them from enjoying their old hobby at some point.\n\nI don't think gaming is any different except in the requirements it has - the physical input.  Other than that, yeah, I'll quit when I need to quit, and I'll enjoy it while I can.  Gaming is diverse, and there's many ways to enjoy it!",
   "created_utc": 1693500900,
   "score": 48,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjigz2",
   "message": "Idk probably when I have a kid, that will be more fun probs until they are old enough.  But even then I can condition them with all kinds of cute Pokémon stuff and whatnot :) \nI always imagined it will be fun to finally let my kid beat me in Pokémon one day… and chess haha",
   "created_utc": 1693500239,
   "score": 9,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykjcbj",
   "message": "My dude.. I’m about to turn 40. I’m a senior finance executive, I’ve got a great wife, house and a car like a “real” grown up.\n\nMy mum still asks me that question every Christmas.",
   "created_utc": 1693513556,
   "score": 9,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjm5ru",
   "message": "I thought around 35. But then I picked back up at 40 and I don't think I'll ever stop now. Steam Deck likely being the reason I was able to get back into it.",
   "created_utc": 1693501546,
   "score": 10,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjsmv0",
   "message": "When you pry the controller from my cold dead hands.",
   "created_utc": 1693503873,
   "score": 7,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjwwm7",
   "message": "Nobody would ever ask \"Voracious readers of Reddit at what age do you think you'll stop reading\"\n\nWhy stop doing a thing you enjoy?",
   "created_utc": 1693505406,
   "score": 6,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjctjq",
   "message": "Ill never stop. Even after im dead ill find a way to game. Lol",
   "created_utc": 1693498213,
   "score": 15,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjoh8h",
   "message": "Slowed way down at 27 with my first career level job. Signs are I'll never totally stop while I draw breath.",
   "created_utc": 1693502387,
   "score": 6,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjnht2",
   "message": "my story:\n\ngot back into gaming during pandemic. overwatch ... here i am playing and getting into it and watching youtube tutorials and doing some aim practice with some apps to get better.\n\ni am a fairly accomplished person in my life at this point as a software person working with some high level organizations doing cool stuff. not humble bragging, it took years and it is a natural outcome for any worker probably.\n\nwhen you have people playing that are being disrespectful and combine that with the game not really rewarding your play with good matching/ranking — it kind of just kills the fun.\n\nit becomes 'work' and thusly i stopped playing. anyone with similar experiences?",
   "created_utc": 1693502032,
   "score": 6,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjmwks",
   "message": "93?\n\nI figure after 92 I'm not supposed to have a Merry Christmas anymore so might as well assume that's when any remaining joy will be lost?",
   "created_utc": 1693501817,
   "score": 6,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjpg43",
   "message": "Never lmao",
   "created_utc": 1693502737,
   "score": 7,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjykvl",
   "message": "Well, it’s not 55.",
   "created_utc": 1693506017,
   "score": 5,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjmskk",
   "message": "Well you see I have a 5 year plan to ween myself off starting at 37.42, reducing my gameplay time each week by 1/100th of a Google hour",
   "created_utc": 1693501776,
   "score": 4,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjni07",
   "message": "Jokes on you! I will increase it!",
   "created_utc": 1693502034,
   "score": 4,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjwxe6",
   "message": "When they stop making final fantasy",
   "created_utc": 1693505414,
   "score": 4,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk3pp1",
   "message": "Until I physically can’t. My dad doesn’t game as much now that he’s nearly 70, but every now and then he still plays some Diablo.",
   "created_utc": 1693507869,
   "score": 4,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk4lx4",
   "message": "I stopped when I was around 29. There's not enough time to dedicate to things that don't matter when you have real responsibilities (physical health, relationships, work, etc.).",
   "created_utc": 1693508192,
   "score": 5,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk4lz4",
   "message": "Never.\n\nShit my 96 year old Grandma still games....ya she plays lame shit like Solitare, Cribbage, Hearts, Euchre, and Chess....but she does it on a PC and even plays on Chess.com and also plays Cribbage, Hearts, and Euchre online with her friends on some Card Game io site my cousin set her up with.\n\nHell I think she is even on discord now, or some chat program like it where all her Boys and Girls Club friends are on. The seniors league is bumping.\n\nShe got into it because Covid shut down their seniors meet ups, and they never restarted after, so now she is an Online Gamer.",
   "created_utc": 1693508193,
   "score": 5,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykd2zf",
   "message": "I'll stop gaming the same my way my grandmother did: When I'm no longer physically capable of gaming.  In her case, her hands degraded to where she could barely hold a controller...but she still loved gaming vicariously, watching along and solving puzzles and etc until her deathbed.",
   "created_utc": 1693511291,
   "score": 5,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjq46j",
   "message": "Maybe 50?\n\nI'm 45 and I've been playing a lot of the new releases and finding them too hard, annoying, time consuming, or frustrating.\n\nI have less and less patience for re-fighting tough bosses, dealing with ever-faster enemies that fly all over the screen. Inventory systems and icons and \"rpg mechanics\" in non-rpg's, and lame things like fishing mini-games and grinding in order to level up or whatever. 60 hour story campaigns that stack waves of enemies or time wasting nonsensical \"get three more keys\" type objectives to pad playing time.\n\nI started Armored Core 6, beat the Balteus, and uninstalled the game. Sure I *can* beat it, but I don't want to any more, it's just more frustrating than fun. I platinumed all Souslborne-iro games so it's not just that the games got harder, but I just am tired of it.\n\nI was gonna play Baldur's Gate 3 but then... ugh, \"I've played 60 hours and I'm still in Act 1\" like wtf, how is this something I'd wanna do? \n\nSure there's the occasional indy, retro, etc, but I been playing games on and off since the 90's, I don't need to go back to that stuff. I also can't play games with realistic guns any more because every day there's a horific mass shooting in this stupid country and I can't not think about that when pretend-shooting people in games.\n\nI still play what I want when I want- just started a replay of Ghost of Tsushima and enjoying it, of course. But it's a *replay*, not one of the new games. This is supposed to be one of the best years of games of all time! And it is- my goodness, look at all these great games! But.. not so much for me, I guess.\n\nThese days when it's time to chill on the couch I'm more likely to put on some music and read a book than pick my controller. If this trend continues, the Playstation will just continue to collect dust and stay off and when the PS6 comes out I just won't care.",
   "created_utc": 1693502974,
   "score": 8,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjpx9a",
   "message": "Did you really think dieing was enough to get me to stop playing video games?",
   "created_utc": 1693502906,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjq24a",
   "message": "probably after I'm dead",
   "created_utc": 1693502954,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk42u4",
   "message": "At what age do you stop breathing? Somewhere around that age.",
   "created_utc": 1693508000,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk44sj",
   "message": "Your supposed to stop?",
   "created_utc": 1693508020,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk4fwv",
   "message": "When I'm dead. I'm 47 now. Started with Atari and have played every console to date. Big PC gamer too.",
   "created_utc": 1693508131,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk4rkn",
   "message": "Never ever never evernever.",
   "created_utc": 1693508250,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk6nl9",
   "message": "I mean my dad's in his 70s and still games basically daily. So why should we be any different :)",
   "created_utc": 1693508943,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykcann",
   "message": "Stopped at 21, Have a job now, Happy but i do occasionally miss gaming.",
   "created_utc": 1693511002,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykjbe7",
   "message": "My dad is 54 and still an avid gamer. I plan to do the same.",
   "created_utc": 1693513547,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyknmek",
   "message": "Coming up on 49....and I took tomorrow off for starfield.",
   "created_utc": 1693515109,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykopte",
   "message": "My dream is to die as an old man who got a heart attack because he got some epic loot.",
   "created_utc": 1693515508,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykw0zg",
   "message": "66 and still playing daily. Retirement = game time!",
   "created_utc": 1693518257,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykw3sl",
   "message": "When I’m dead",
   "created_utc": 1693518287,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykxshv",
   "message": "When I'm old enough to rival Yoda.\n\n\"After 900 years, play well, you will not!\"",
   "created_utc": 1693518929,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jykzpcf",
   "message": "I'm 77 and have 226 Steam, Epic, Ea, Ubisoft. . .game collection. I just preloaded Starfield and am replaying Borderlands 2 till Starfield's release.",
   "created_utc": 1693519678,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyl15jw",
   "message": "I’m 65 and have no plans to stop until I stop breathing.",
   "created_utc": 1693520248,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyl19h7",
   "message": "Dead. Whatever age that is.",
   "created_utc": 1693520293,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jylcoro",
   "message": "Bout two days after I die.",
   "created_utc": 1693525162,
   "score": 3,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjeoi5",
   "message": "When they stop making good games.",
   "created_utc": 1693498883,
   "score": 5,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjowfn",
   "message": "My stepdad turns 41 in October and earlier this year he got himself a new prebuilt with a 3080 in it to play warhammer darktide with his brother. I see no reason I won't be buying the 99080 or whatever is out when I'm that age",
   "created_utc": 1693502541,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjp7lv",
   "message": "Shortly before my ashes get spread onto mountain winds. . .",
   "created_utc": 1693502653,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjp8ob",
   "message": "Gaming since ‘72 so not any time soon. Although, I absolutely despise what gaming has become and cannot touch certain titles due to the amount of cheaters and developers who support cheating and give streaming cheaters the ability to ban innocent players who play weekends.",
   "created_utc": 1693502663,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjr2os",
   "message": "When I am physically incapable of doing so or unable to for other reasons (Like the cost of games, consoles etc).",
   "created_utc": 1693503317,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjvjds",
   "message": "I'm 54 and will never stop.  I do need to pony up the 1000+ bucks to get a newer rig though.",
   "created_utc": 1693504909,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjwcxi",
   "message": "I will not",
   "created_utc": 1693505208,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjwdds",
   "message": "This deserves the same respect as “tv watchers of Reddit when are you going to stop watching tv”.\n\nNamely none.",
   "created_utc": 1693505212,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjwr54",
   "message": "When the arthritis is unbearable.",
   "created_utc": 1693505351,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjwvpr",
   "message": "When my doctor says my body can’t take it anymore",
   "created_utc": 1693505397,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjww68",
   "message": "Never surrender!",
   "created_utc": 1693505402,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjxdct",
   "message": "I do not understand you....",
   "created_utc": 1693505576,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyjxuhe",
   "message": "If it entertains you, then why stop?",
   "created_utc": 1693505751,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk2zt9",
   "message": "When the arthritis gets so bad that I can't hold a controller or when I stop breathing. Whatever comes first.",
   "created_utc": 1693507613,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk3iko",
   "message": "Never. I'm 36 and have been gaming since Sega Genesis Era, and I still game.",
   "created_utc": 1693507799,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jyk3l9l",
   "message": "Probably when I die.  I've taken a year off here and there but I don't see myself quitting entirely.  It's my favorite thing to do.",
   "created_utc": 1693507825,
   "score": 2,
   "submission_id": "166f9h3"
  },
  {
   "comment_id": "jylwd2u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166f9h3"
  }
 ]
}