{
 "submission_id": "166hvta",
 "title": "What has been the most embarrassing thing that happened in school?",
 "selftext": "",
 "created_utc": 1693504217,
 "permalink": "/r/AskReddit/comments/166hvta/what_has_been_the_most_embarrassing_thing_that/",
 "score": 109,
 "url": "https://www.reddit.com/r/AskReddit/comments/166hvta/what_has_been_the_most_embarrassing_thing_that/",
 "comments": [
  {
   "comment_id": "jyk58in",
   "message": "Had a senior my freshman year let a cow lick his pecker on a dare (country ass school, country dumbass dares), anyway he was an amazing baseball player and word spread from our school to other schools in the area. Folks would come to baseball games dressed as cows, bring cowbells, and moo at him when he went up to bat.",
   "created_utc": 1693508421,
   "score": 109,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjvgwq",
   "message": "I was the last in our class to go through puberty. I didn't start until I was 16 (I've since read this could have been caused by my asthma inhalers). We had communal showers after P.E and our teacher was a nonce who insisted none of us wear shorts and showered completely naked. He also liked to wander in and have a good look. \n\n\nI was the only kid who still had a child's dick and balls and one time the teacher walked in and said \"Be sure to thoroughly wash all areas, microscopes are available from the chemistry department for crinklyandballs.\"",
   "created_utc": 1693504884,
   "score": 225,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjyyp6",
   "message": "One time a fart, was more than a fart. I was walking to my next class, and it happened, and I just walked out the exit, and went home. Byyyyyeee.",
   "created_utc": 1693506154,
   "score": 117,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk57e4",
   "message": "2nd grade.  Teacher wouldn't let me go to the bathroom during her lesson, but I really had to go.  Ended up peeing myself in the middle of class.  Had to go to the nurse's office and wait for my gramps to bring me a change of clothes and then I had to shamefully march myself back to class after that.\n\nSomehow I was not made fun of after that and was allowed to still be part of the cool kids that made fun of the not cool kids.  But I still get red-faced about this and I'm nearly 40 years old.\n\nGramps told me after that, that he doesn't care what the teacher says.  If I'm about to go in my pants then leave and go to the bathroom and he'll make sure the teacher is taken care of.",
   "created_utc": 1693508410,
   "score": 187,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyju45l",
   "message": "A boy had his pants pulled down, now the whole school knows how his penis is, the worst thing was that when they did it I was in front of it so I had a front page view of his dick",
   "created_utc": 1693504399,
   "score": 244,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk2dno",
   "message": "I went to a 7-12 and we had our class photos taken a few days before school. It was a huge thing and pretty much all of the kids in the school gets lined up at once for this. \n\nOne of the girls going into 7th grade got her first period and had blood going down her legs in front of pretty much everyone. It was absolutely horrible.",
   "created_utc": 1693507389,
   "score": 118,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjxpnw",
   "message": "During math class in high school there was a knock on the door. The teacher opened the door to be faced with a cop with a German shepherd. The cop asked if he could talk with one of my classmates and left with him. Turns out the guy had weed in his locker and the police were doing a sweep of the whole school",
   "created_utc": 1693505701,
   "score": 57,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjx6ok",
   "message": "I'm actually not sure this counts but the memory is seared into my brain. I called a teacher \"dad\" in high school but the reason it doesn't count is that from what I can tell not a single person noticed. NO ONE. Not even the teacher who was talking directly to me and asking for my response. I looked around 360 degrees afterwards. NOTHING.....",
   "created_utc": 1693505509,
   "score": 221,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk0m0k",
   "message": "When I was in 8th grade English in 1999, we started talking about Kid Rock. He was fairly new at the time, maybe had a couple songs out. I had no interest in him other than sitting through his videos on TRL waiting for NSYNC.\n\nIt's important to know that I was on my period at the time, and just started developing big hormonal swings. Anyway, while we were talking about Kid Rock, someone said he was gross and white trash. For reasons known only by my hormones, I started crying and defending him  to the class, sobbing that he was a good father and they don't even know him. In my head, I'm thinking \"What the hell are you doing? You don't even like Kid Rock? You're going to marry Justin Timberlake.\" But I couldn't stop. Everyone was just quiet and looking around at each other as I sobbed about what a great man Kid Rock was.\n\nAnd that was why I had to spend the rest of the year pretending to be Kid Rock's number one fan, rather than admit that it was a crazy hormonal, period-induced tantrum I couldn't control.",
   "created_utc": 1693506755,
   "score": 124,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk8sf5",
   "message": "We were on an NJROTC trip to Washington DC. We were in dress uniform visiting Arlington National Cemetery. A kid thought he had to fart. Turned out it wasn't a fart. Had to inform the instructor that he shit his pants\n\nAt Arlington National Cemetery",
   "created_utc": 1693509723,
   "score": 96,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjylll",
   "message": "Kid got caught taking creep shots. He had a whole collection",
   "created_utc": 1693506024,
   "score": 17,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk1z71",
   "message": " A kid had a crush on a girl and he sent her a video of himself masturbating, he showed he's face in the video and all.\nThe last thing I remember from that was that the kid had to change schools from the embarrassment.",
   "created_utc": 1693507245,
   "score": 185,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk8ehx",
   "message": "Not to me, but I was in the class when this happened. The teacher said to get our calculators out of our bags. I don't know how exactly, but one girl set the rape alarm off that was on her keys. It was very loud and kept ringing for a long time. A minute later, the class next door walked past on the fire escape. They thought it was the fire alarm.",
   "created_utc": 1693509584,
   "score": 89,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjtz9p",
   "message": "Someone beat their meat during gym class\n\nIdk if that really happened but that’s the story that went around that day when it supposedly happened",
   "created_utc": 1693504351,
   "score": 242,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk2bd5",
   "message": "Kid shat himself after getting powerbombed. Made such a mess of the bathrooms that a whole section of the school got blocked off. He then had to sit in reception in lost and found clothes while everyone coming through the door talked about how much it smelt of shit down the hall. \n\nThe balls on that cunt to show up the next day made him a fucking legend to us though",
   "created_utc": 1693507367,
   "score": 166,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykgkw7",
   "message": "I tried to wear heels for the first time at a school dance. Had a skirt, heels, and fishnets on. I was running after my friends IN HEELS and ended up falling backward, I caught myself on my hands and my legs were spread wide open RIGHT IN FRONT of some random guy. We made extremely awkward eye contact after he probably saw everything and I tried to avoid him until I graduated. \n\nIt felt like it was straight out of some raunchy show, porn, or anime. Turns out I’m not a fan of heels and refuse to wear them..\n\nEdit- oh and I blew a snot bubble in front of the guy I liked",
   "created_utc": 1693512558,
   "score": 79,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk998f",
   "message": "The special Ed kid whipped his meat out of his sweatpants and started reciting lines from Toy Story and tenderizing it like it owed him a bag of diamonds. I tried to stop him before anyone noticed but he just got aggressive and faced towards me while growling so I put my head down. Teacher was like, \"hey, no sleeping in my class!\" Which made me laugh uncontrollably so I had to sit out in the hallway.",
   "created_utc": 1693509894,
   "score": 146,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk5fia",
   "message": "When I was in 7th grade, I only wore normal boxers under my gym shorts for P.E. One day when we were doing some crunches, my shorts and boxers somehow slid up to my waist and my whole dick was exposed. Got a boner from it oddly enough. Now I only wear boxer briefs",
   "created_utc": 1693508494,
   "score": 74,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykcgib",
   "message": "I passed out in the hallway outside the gym because i hadn't eaten that morning. Fell on my face. Broke my nose. While i was out ALL the kids formed a circle around me. One of my teachers was holding my head up and checking vitals. When i came back to i couldn't open my eyes because they hurt. So i just said \"Mom?\" after a few seconds of disorientation i was able to open my eyes and the entire school just started laughing at me. At which point i blacked out again. And that's how i developed severe anxiety.\n\n\\- Fin",
   "created_utc": 1693511061,
   "score": 136,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk16zf",
   "message": "Year 8, I was climbing up onto an umpires tennis chair (the tall one at the net) It was not secured down and as I was pulling myself up, myself and the chair fell backwards onto the handle that you wind to make the net taut. As I landed, the handle went into, and tore my anus. My whole class thought it was quite funny until they all saw the blood everywhere.",
   "created_utc": 1693506964,
   "score": 180,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk4o27",
   "message": "I let a massive one rip halfway through a lesson from one of my least favourite teachers in like year 5 (9-10). Everyone turned around and looked at me like I was some sort of creature.",
   "created_utc": 1693508214,
   "score": 63,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jynneme",
   "message": "The most embarrassing thing was my farting. My friend and I agreed that I would fart and he would apologize to everyone as if he had done it. But when I farted, he got up from his chair and told the whole class that I was a fartingman.",
   "created_utc": 1693570474,
   "score": 64,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyju0d1",
   "message": "A dorky underclassmen bragged about getting a chick pregnant. My asshole friend took the time to do the detective work and prove he made the whole thing up, the kid was ridiculed to the point of having to change schools.\n\n\nAsshole friend encountered the same kid at a debate team event the following year and told his new classmates what had happened.",
   "created_utc": 1693504363,
   "score": 30,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk1fcz",
   "message": "Not me but a boy from another school came to play trombone at our anzac day assembly, now my school was an all girls high school so the fact there was a boy there had many girls whispering already. \n\nThis poor kid starts playing, and the trombone wasnt the only bone on stage. Whispers turned into fits of giggles and hushed voices pointing out the offending body part, very obvious in the pants he was wearing. \n\nProps to the kid, he kept playing albeit with a very red face and he left almost immediately afterwards but i still think of how embarrassed he must have been even 15 yrs later",
   "created_utc": 1693507046,
   "score": 106,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk0dlp",
   "message": "Someone thrown up all over himself and floor at the only corridor where you cloud go to rest of the school",
   "created_utc": 1693506670,
   "score": 53,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk8hcc",
   "message": "Simultaneously sneeze farted in class when it was dead quiet during a test. Still think about it 20+ years later",
   "created_utc": 1693509612,
   "score": 51,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykdmrs",
   "message": "In grade 6 I said \"vagina\" instead of \"Virginia\" when reading out loud.\n\nI still hate myself about it and I'm 31 😭😭😂",
   "created_utc": 1693511490,
   "score": 53,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykfopm",
   "message": "A kid one year younger than me was jerking off in the bathroom stall while another kid recorded him from the top ( the dude who was recording literally climbed on top of the stall to get the perfect shot). The problem was that the kid who was jerking off noticed that he was being recorded, but didn’t stop. He just smiled at the camera and continued to do his deed.  For the rest of the school year everyone called the kid “ wanker”. Most people didn’t even know his real name. Some still call him by his nickname.",
   "created_utc": 1693512233,
   "score": 51,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk1wce",
   "message": "Someone chugged a whole 2 liter bottle of sprite and then belched all 2 liters in front of the principal’s office unexpectedly. The fucker was in 6th grade",
   "created_utc": 1693507216,
   "score": 80,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk3nv6",
   "message": "I was privately embarrassed because no one saw it, but in grade 6, I got my period in the middle of the day, and left blood on a chair in my last class of the day. 🫣\n\n\nSorry teacher, whoever you were.",
   "created_utc": 1693507851,
   "score": 34,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykizxe",
   "message": "I had no friends in secondary school, I was looking at pictures of school trips on a bulletin board all people together laughing, having friends etc, and I just burst out crying, everyone from my year and several teachers came to me and asked what was wrong, I don’t even remember what I told them I think I said a family member passed away or a pet died or something, but the reality is I was crying cause I had no friends, one of the saddest and most embarrassing times of my life. I was about 13/14 years old in case people are wondering.",
   "created_utc": 1693513430,
   "score": 33,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykp7qd",
   "message": "A dude in middle school filled up a condom with white milk. Like FILLED it. Could have been used as advertisement saying nobody is too big for a condom. He then walked over to another guy and slapped him with it so it would explode. You'd think he smelled like milk the rest of the day. Nah. He smelled like condom.",
   "created_utc": 1693515693,
   "score": 36,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjtxz2",
   "message": " Well, let me tell you folks, there was this one time in high school when I accidentally launched my pencil into the air, thinking it was a stealthy ninja attack. It landed right on top of the principal's head. Smooth move, right?",
   "created_utc": 1693504339,
   "score": 130,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykj0hh",
   "message": "I was in chemistry class, the last class of the day, in eighth grade. It was the age of Nokia cell phones, when you would send songs via Bluetooth to your friends. I would always put my phone on silent and keep it in my bag. \n\nEvery end of the day, my dad would call me or text me to let me know he's on the way to pick me up. Three major things happened in the buildup to that fateful class:\n\n1) I forgot to put my phone on silent\n2) My dad decided to text me he was gonna be here earlier than usual \n3) I decided that my SMS ringtone of the day would be \"I wanna Make Love in this Club\" by Usher\n\nMy teacher is in the middle of a lecture talking about whatever it is chemistry teachers talk about when I start hearing Usher's faint whispers coming from my bag. It gets progressively louder. More and more students start picking up on the song as it becomes apparent that the song is about to hit full blast.\n\nMy teacher looks at me.\n\n\"Turn it off\"\n\nI'm already scrambling to my find my phone, in the midst of my social anxiety, I completely fumble everything out of my bag and I'm not closer to finding the phone. The beat is about to drop, it's inevitable.\n\n\"I WANNA MAKE LOOOOVE IN THIIIIS CLUB\"\n\nTeacher starts shrieking my name, over and over, I'm fighting tears while a class of 14 year olds are howling. Usher, meanwhile, continues serenading the class.\n\nIt took two whole minutes before I found the phone. \n\nThe class clapped and whistled at what they thought was an elaborate prank. I cried on the way home. Thanks dad. Fuck you Usher.",
   "created_utc": 1693513436,
   "score": 74,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk8cl4",
   "message": "This baseball player used viagra during one of his games and looked at his girlfriend while touching himself. He no longer has a girlfriend.",
   "created_utc": 1693509564,
   "score": 29,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykce1v",
   "message": "When I was in 7th grade. We were doing a little game where the teacher would ask a question. Whoever answered correctly first got candy. The question was \"what is the national dog race called in Alaska?\" I confidently raised my hand and he called on me. I knew the answer but my stupid ass said \"I did a dog!\" Everyone laughed and the teacher said \"we don't need to know that.\" luckily class ended soon after. I got my candy though!",
   "created_utc": 1693511037,
   "score": 29,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykje7v",
   "message": "When I was in Jr. High (middle school), I was a nervous wreck for the first year. My stomach was in a constant state of being upset. Along with that, I would have diarrhea. \n\nI was afraid to use the bathroom in school because back in the day, the toilet stalls had no doors so you were just out there with everyone coming in and going out. \n\nThis one particular day, I had to go really bad, but was determined to hold off until I went home. I was in study hall fighting the urge when I had to sneeze. \n\nNot only did I sneeze, I also emptied my bowels. As if this wasn’t bad enough, I was wearing really faded (nearly white) jeans. I cannot explain to anyone the fear and thoughts that ran through my body at that moment, there aren’t words to express that type of fear. \n\nSo I took my book bag put it behind me with both hands and proceeded to the bathroom. Of course by this time, the damage was done and no amount of clean up was going to help. \n\nI went to the office reluctantly and quietly explained the scenario and was told to call home. I must have called a thousand times with no answer. \n\nI was sent into the gym bathroom and told to try and clean myself and clothes up as best I could. I took my stuff off, leaving myself buck naked, when the female gym teacher decides to come in and have a look around. \n\nHer eyes were as big a saucers and I explained the scenario yet again. Long story short, my assistant principal had to drive me home (I would not have done it, but he was apparently a very good man) due to the residual mess. \n\nI would put this story up against any out there. I was traumatized.",
   "created_utc": 1693513575,
   "score": 33,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyl6zo4",
   "message": "A guy in our 8th grade class took a girls computer home and took a picture of his dick and made it her desktop wallpaper. Next day she comes in and turns it on and says “why is there a thumb on my screen”\n\nHe got expelled",
   "created_utc": 1693522684,
   "score": 30,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykcit8",
   "message": "My school went on lockdown because my biological mother drove from another state to try and take me.",
   "created_utc": 1693511085,
   "score": 56,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjwmhe",
   "message": "A professor got a buttplug/dildo way way up his butt and was feeling so sick he had to be taken to the hospital. Everyone knew.",
   "created_utc": 1693505304,
   "score": 113,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk7oji",
   "message": "Somebody gave me a condom. I decided to open it up and chew it like bubble gum and blow bubbles with it. I didn't live that one down for a long time cuz gay and I was told the spermicide would make me infertile",
   "created_utc": 1693509321,
   "score": 27,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykcc76",
   "message": "It had just stopped raining and I was stupidly swinging my bag around outside while walking to my next lesson. Accidentally let go of my bag and flung it into a puddle just as a large group of older kids were walking by. They all laughed. I went straight to the toilet and attempted to dry my bag under the hand dryer.",
   "created_utc": 1693511018,
   "score": 27,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykbwqc",
   "message": "Not to me.\n\nWas in grade 8. Someone in my class had found a large tampon somewhere, and they took it upon themselves to color in red and then tape it to the chalkboard. Writing the name of a girl in my class and stating that she had dropped it and needed to do a better job at cleaning herself up.\n\nYeah the tears that followed and suspension for said kids was wild.",
   "created_utc": 1693510862,
   "score": 24,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykcufh",
   "message": "First day of 7th grade junior high a pigeon took a shit in my hair. I had to wipe it out with a wet paper towel in the bathroom.",
   "created_utc": 1693511205,
   "score": 23,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykkspc",
   "message": "7th grade Spanish class in like 2001. I had a little gold chain I wore because that's what all the kids did in my school. Anyways the teacher was trying to teach us vocabulary and teach us the difference between the color gold and the metal gold or something like that, and she came up and gestured at it and said \"what is this?\" and some kid yelled out \"fake!\" and everyone laughed at me. Looking back that shit was hilarious and perfectly timed but man at the time it was devastating.",
   "created_utc": 1693514084,
   "score": 25,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykpjrm",
   "message": "I was on the wrestling team all through high school, but I started the weightlifting team my junior year to get stronger for wrestling. One day I decided to start drinking protein shakes to help gain some muscle, and I drank a whole shake for breakfast that morning. Little did I know that whey protein powder would give me the hottest, stinkiest, rotten-eggiest farts known to man that day.\n\nI was sitting there in 4th period (American history class) and felt the bubbles building stronger in my gut. I had to release some of the pressure or I was sure my stomach would explode. So I did the lean technique and whooshed out a silent, but fucking NUCLEAR fart. I knew how bad it was because I smelled it the split-second it exited my ass. It filled the classroom and a girl I was crushing on at the time just goes “Ewwww!!!” with a horrified expression on her face. I tried to play it off, but the embarrassed look on my face outed me as the culprit right away. The smell stuck around for a few very long minutes before finally dying, along with my entire soul. Still think about this moment at least once a year.",
   "created_utc": 1693515818,
   "score": 21,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjzzng",
   "message": "Won a bet due to flare pants.\n\nI think now that this chick was always on me, but I was either too dork or not into it to care. We were chatting and I mentioned I had flare pants (like, the ones with wide ankles, 70's style). And I kid you not, she said \"I bet my bra you don't use these. If you do, I'll take it off and give it to you.\" Needless to say, I went with said jeans. She saw me and was prompt to get her hands behind her back, but I didn't forced her to it, said it was just for the sake of a joke, and we left it at that.",
   "created_utc": 1693506528,
   "score": 36,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykamr6",
   "message": "Back in middle school we had to do quarterly pull ups to see if we could improve as the year went on and it was part of our grade iirc, kid goes up to do pull-ups facing the rest of the class with a full hard on in front of everyone, I got insane second hand embarrassment from that.",
   "created_utc": 1693510396,
   "score": 15,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykja5o",
   "message": "I pooped my pants in first grade during morning recess and walked around with the load all day.  We're all friends here, right?  Judgement free zone then between us friends okay?  It was over 45 years ago so I can finally admit it was me that stunk.",
   "created_utc": 1693513535,
   "score": 14,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykewfd",
   "message": "Accidentally walked into the girls bathroom on my first week of 3rd grade at a new school. \n\nA girl walked out just as I was going in and that's when I realized. She immediately ran off to tell my teacher, who lectured me about trying to get a peek at girls in the bathroom being inappropriate. \n\nLittle did they know, it was a genuine accident because I'm gay as hell and even knew I had crushes on the same sex back then. It was still super embarrassing.",
   "created_utc": 1693511950,
   "score": 33,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykc35p",
   "message": "[deleted]",
   "created_utc": 1693510926,
   "score": 14,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykgmrr",
   "message": "Diarrhea I thought I could hold until between periods. I asked to leave with a few minutes left in class and couldn't make it all the way to the bathroom. This I could have gotten over, but as I was taking a while, the teacher sent a student to check on me just as I was throwing away my shitty drawers. This was sixth grade",
   "created_utc": 1693512577,
   "score": 14,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjzaep",
   "message": "I scratched my balls at a internet café that my class was visiting, they never touched that Xbox controller ever again",
   "created_utc": 1693506274,
   "score": 35,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk10mj",
   "message": "I was doing my English speaking exam in front of my class, and afterwards the examiner asked me to stand up. Then she gestured to me and said \"this ladies and gentlemen, is an example of faking it until you make it\" then made me sit back down and she left",
   "created_utc": 1693506902,
   "score": 38,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjw2xg",
   "message": "When I was a kid, I had this problem, And it's not even a big deal, something like 8% of kids have it.....",
   "created_utc": 1693505107,
   "score": 45,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykbzzz",
   "message": "Probably when I got suspended in 5th grade for marijuana\n\nBut the one time that really sticks out for me was in art class. They had one of those pedestals for clay pots that spins around one time the teacher left the classroom and I hopped up on it. Some guys started spinning me around so fast I could barely hold on. The entire classroom was busting up laughing cheering the guys to spin me faster and faster. I held on for dear life and couldn't see anything it was just a big blur. Then I heard commotion and could feel me slowing down. It took about 2 minutes to come to a stop and the teacher was standing in front of me.",
   "created_utc": 1693510895,
   "score": 24,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykivz3",
   "message": "In 8th grade. The stereotypical mean girl had her first period. Her friend gave her a tampon with a plastic applicator and she didn't know she had to remove the applicator.\n\nIt slides from her vagina to her legs and then on the floor. In the middle of the sport field the day we had an event. About 150 kids saw it. Most girls were laughing because, well, we almost all had our period and because that girl was so mean we had no pity at that moment for her.\n\nThey were 5 male only PE teachers. All of them were trying (and failing) to hide their smile or disgust, and one asked a boy to use 2 sticks from a tree to remove it and throw it in the wood nearby while the girl run away.",
   "created_utc": 1693513391,
   "score": 23,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyke4om",
   "message": "My ex showing my nudes around. I didn’t get physically embarrassed by it, but just the fact\nThat someone told me he was got me heated. I hate him sm",
   "created_utc": 1693511673,
   "score": 10,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyki12a",
   "message": "Two things,\n\nIn middle school, i called my science teacher a virgin without fully understand what it meant and the whole class just stared at me in shock, luckly she understood i was just a dumb kid and shut down the conversation.\n\nSecond was my sophomore year of High School, like a god damn looney toon episode, i came back into class from the bathroom with toilet paper in my waistband. Was a generally quiet class so I dont know how many ppl noticed but my teacher definitely did.",
   "created_utc": 1693513081,
   "score": 11,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykeo9h",
   "message": "A dude in our french class called the teacher \"maman\" (mom).",
   "created_utc": 1693511870,
   "score": 11,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykf3xa",
   "message": "Laughed too hard, shit myself. \n\nI was 17. I was in college.",
   "created_utc": 1693512026,
   "score": 11,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk30fh",
   "message": "Middle school, had a teacher who was a dick about the bathroom pass. Several people about wet themselves having to hold it in her class. Halfway through the year, a young lady asked to use the bathroom halfway through class. The teacher told her she would have to wait. She said she couldn't. The teacher told her to sit down or she would go to the office. She pulled down her stockings, squatted, and shit right next to the teachers desk. Pandelerium ensued. Class ended early. The teacher was reprimanded. Bathroom breaks were easier. That girl was transferred out of the school. I never got to tell her thank you for her protest. She got the laws rewritten. True hero. \n\nLegend has it she changed her name to Amber.....",
   "created_utc": 1693507619,
   "score": 50,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk4am4",
   "message": "A new guy came to our school, who got in trouble constantly. During a gym class, he was put on a team with one of the other popular guys who had been in the school since 1st grade, and the new guy thought it would be a good idea to pants the other popular guy. The new guy accidentally pulled down the other popular guys underwear, too, so the people on the opposing team got full view of the non-new popular guys dick. Pretty embarrassing\n\nThere was also this thing where somebody in the grade below mine, who was known for doing stupid shit, was caught both watching porn and jerking off in science class. He was suspended",
   "created_utc": 1693508078,
   "score": 20,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykbe7w",
   "message": "My Digimon watch went off in the middle of class and everyone started singing the theme song.",
   "created_utc": 1693510674,
   "score": 19,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykfqnk",
   "message": "Well it didn't technically happen in a real school, but it was a dream from when I was in school that was so embarrassing. When I was in 2nd grade I had a nightmare that for some reason I had a giant rock like structure growing out of my asshole and no clothes, and everyone was making fun of me. Fuck those imaginary kids man. 😢",
   "created_utc": 1693512252,
   "score": 19,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykkb4a",
   "message": "A guy in my class has a side hustle of selling scented oils. He came in one day with a pussy scented oil that we all took turns smelling in homeroom. Sure enough, it smelled just like the real thing despite people that obviously didn't know what the real thing smelled like objecting. One guy that always boasted about having a high body count said it didn't and we all started clowning him he said he wanted to smell it again to be sure. But the guy selling oils was trying to put it away. They got to fighting and the oil spilled into the wall heater and didn't take long for the room to smell like hot sex. The guy selling oil dipped out because that wasn't his homeroom, he was just there selling.\n\nThe teacher came in to see what all the noise was and started smelling the air. She left out, came back with another male teacher who smelled around the room too. They left, the original teacher came back to keep an eye on us and then the vice principal came in. He started looking at all the girls and pacing around the room with his hands in his pockets. He kept pacing around the girls for a minute and finally left.",
   "created_utc": 1693513907,
   "score": 18,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykzpm8",
   "message": "Didn’t happen to me but to a classmate, he was trying to jump over a shovel that was stuck into the grass and ended up landing on the handle and it went up his ass which resulted in having to goto the hospital, cruel as they are, all the kids started calling him “shovel ass” and he had to switch schools :(",
   "created_utc": 1693519681,
   "score": 9,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjywem",
   "message": "It was the day of school talent show and i was outside at breaktime bully dared me to do a hip thrust on stage, come the evening and its my turn to go on i sung breaking free from HSM that was popular at the time i was told because i couldn’t dance just walk up and down the stage, i did that but the wire on the microphone got stuck so i turned round and did a hip thrust  all the people in the auidence laughed",
   "created_utc": 1693506131,
   "score": 17,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykilqy",
   "message": "There was a guy in my graduating year that was called 3 hump because when he and his girlfriend at the time finally had sex, it took him 3 humps to finish. No one found out about it until they broke up a while later for reasons I am not aware of. He knew about being called 3 hump, but people wouldn't call him 3 hump to his face because it was well known that he would get angry easily and was pure rage when it did happen.",
   "created_utc": 1693513286,
   "score": 7,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyka7ec",
   "message": "I was a little boy and I sharted.",
   "created_utc": 1693510240,
   "score": 12,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk79qs",
   "message": "Kindergarten. Shit my pants. Whole class found out. My mom came to school with a change of clothes and a hazmat bag for me to change with. Never lived it down.",
   "created_utc": 1693509171,
   "score": 6,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk7vl1",
   "message": "My most embarrassing moment was throwing up in the middle of a french lesson.",
   "created_utc": 1693509391,
   "score": 6,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyjxdww",
   "message": "too many moments to pick from. got to the point where i would just intentionally embarrass myself. i have since seized this behavior",
   "created_utc": 1693505581,
   "score": 17,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk30ca",
   "message": "A drunk girl at a party thought it was funny to finger herself with a hotdog in front of everyone, and it broke, getting part of it lodged inside of her. Had to go to the doctor to get it removed. She got so much shit for it back at school, she ended up transferring to school in another city because there was only two high schools in our city and everyone knew about it at both schools.",
   "created_utc": 1693507618,
   "score": 20,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykcoft",
   "message": "Farted while reading a passage from the book in front of the whole class 💨",
   "created_utc": 1693511142,
   "score": 5,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykf9xs",
   "message": "Tried to let out a fart and shat my pants 💀",
   "created_utc": 1693512085,
   "score": 5,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykhsuz",
   "message": "I wrote an Amy Rose dirty poem for a school mate who said he liked her, just to embarrass him. He gave it to the teacher and I was exposed.",
   "created_utc": 1693512998,
   "score": 5,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykmfkp",
   "message": "I farted so loud while taking an english test, whole class started laughing. 3 mins later i slipped another one and everyone was disgusted and i felt emberassed. I wanted those farts to be silent.",
   "created_utc": 1693514677,
   "score": 5,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyl5jxo",
   "message": "4 guys in my grade freshman year ripped my skirt off while walking into school just to see if I was \"hairy like a Jew\" down there. My parents pulled me out of high school after that final incident. There were many more. Being anything else but Christian in the Bible belt is a permanent sentence to be bullied forever in some places.",
   "created_utc": 1693522059,
   "score": 6,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jykk6gw",
   "message": "Are we counting University? Because if so, I've got a tale to tell. This was my Sophmore year. It was the end of the semester and though I had no other campus business that day I HAD to go to campus to drop off a video-editing project due by 10am, that was 50% of my grade, and the class wouldn't be offered again until the FOLLOWING Academic year - so just retaking the class was not an option. (Sue me, I've ALWAYS been a procrastinator who turns in shit last minute. Oh well)  \n\n\nAt this particular juncture of my academic career I was a commuter. I ALSO suffer MASSIVE IBS issues. Unfortunately, while I left in time to be there nice and early by 8:30am, there was some sort of bullshit accident on the connector from Reston to Fairfax (Northern Virginia, School was George Mason University - I lived in Reston)...so I was stuck in traffic for an INORDINATE amount of time, and was just getting to campus at around 9:30. No problem, half-hour to park and run my project up to the A/V lab was still plenty of time...until DISASTER STRUCK.  \n\n\nI was pulling into campus when my bowels began to clinch and my stomach began to churn. Breakfast I had was starting to catch-up to me. I was sweating. I was in PAIN. I parked, and started running. I was about four minutes away from the Johnson Center, I had planned on QUICKLY dunking into the Performing Arts building to relieve myself when MY ASSHOLE DECIDED TO EXPLODE...FUCK! I HAD NO TIME LEFT! LIQUID FILTH HAD FILLED UP MY PANTS, AND WAS BEGINNING TO CREEP OUT THE CRACKS OF MY UNDERWEAR. And not just a turtle-head, like a MASSIVE FLOW of excrement! Even IF I were able to get back to my car and drive home for pants, NO WAY would my project be turned in in time. (No, this was one of those professors who would EVER give someone spare time...arrogant PRICK)   \n\n\nI literally FUNNELED THE FILTH down one leg, and into some bushes near Mason Pond - I mean this was BAD...VERY BAD. My SOCKS WERE STAINED, MY ASS WAS STAINED. IT WAS DIRE. I WAS PANICKING. So...I did the only sensible thing, ran into the woods to a pedestrian trail and slid down a muddy path so it LOOKED like had a tumble....and proceeding into the Johnson Center, through the LEAST-TRAFFICKED ROUTE I could think of.   \n\n\nAS THE ELEVATOR DOORS WERE BEGINNING TO CLOSE, ONE OF THE MOST BEAUTIFUL GIRLS I HAD EVER SEEN STUCK HER HAND IN...and she was with a group of about SIX OTHER STUDENTS...me...covered in filth, shitty pants...smelling like SHIT....  \n\n\nI noped out first on the level to the A/V lab, grinning sheepishly, leaving a horrified group of students in dead silence in the elevator. Dropped my project into the shoebox (It was on a VHS tape...we were still doing linear-editing then) and sprinted back to the Performing Arts bathroom (This was literally the least-trafficked bathroom this time of day and semester) I had to call my MOM on the phone, explaining the situation. Thank GOD, she was understanding enough to drive alllll the way to campus to deliver me a trashbag and a set of new clothes.   \n\n\nI had NEVER been more embarassed IN MY LIFE. Thank GOD, none of my friends saw me...or anyone I knew really. I was just the SHIT-COVERED weirdo, a bunch of randos saw in the Elevator, final day of the Fall Semester 2003.",
   "created_utc": 1693513860,
   "score": 9,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jyk5bqi",
   "message": "I was in residency taking call overnight at the VA hospital covering code blue.  My co resident was a small cute blonde, really pretty and really ummm well endowed.  \nOne night code blue was called.  I went to the head of the bed to intubate the patient.  She went to do chest compressions.  After I intubated I looked up and realized that my co resident had taken off her bra to sleep at night.  As she was leaning forward and bouncing on top of the patients chest, I was being treated with a front row seat of her sweater puppies bouncing along…. I realized I was staring in shock and slowly looked up.  Only to meet her eyes.  She realized what was happening and couldn’t stop.  I realized I was caught but couldn’t look away.  \nAfter that I had a lot of trouble looking her in the eyes ever again.",
   "created_utc": 1693508455,
   "score": 14,
   "submission_id": "166hvta"
  },
  {
   "comment_id": "jynt0dg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166hvta"
  }
 ]
}