{
 "submission_id": "166i78y",
 "title": "What’s a subtle sign that someone isn’t ok deep down?",
 "selftext": "",
 "created_utc": 1693504938,
 "permalink": "/r/AskReddit/comments/166i78y/whats_a_subtle_sign_that_someone_isnt_ok_deep_down/",
 "score": 92,
 "url": "https://www.reddit.com/r/AskReddit/comments/166i78y/whats_a_subtle_sign_that_someone_isnt_ok_deep_down/",
 "comments": [
  {
   "comment_id": "jykhhxt",
   "message": "When they start distancing themselves from others for no apparent reason.",
   "created_utc": 1693512890,
   "score": 202,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyk1rui",
   "message": "They suddenly start canceling plans or withdrawing from social interactions they used to enjoy.",
   "created_utc": 1693507171,
   "score": 208,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl1tcl",
   "message": "From my experience, unexplained or unwarranted anger, you drop a tiny rock in the ocean and you get a tsunami reaction - usually a sign of deep distress.",
   "created_utc": 1693520510,
   "score": 115,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyld5uo",
   "message": "If you read every single comment on here",
   "created_utc": 1693525368,
   "score": 44,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykzcmz",
   "message": "From personal experience (me) when someone starts reaching out to people they haven't spoken to for a long time.\n\nI went through a deeply dark place in my time after my father's death only to realize most of the people I considered close friends at the time couldn't be bothered to engage in a serious conversation with me. So I began reaching out to friends of mine from the past, just to feel like I wasn't alone.",
   "created_utc": 1693519536,
   "score": 237,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl1rq8",
   "message": "When they have lost their fight and just tolerate things that are wrong because they have given up.",
   "created_utc": 1693520492,
   "score": 145,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyk2qcy",
   "message": "When they get emotional over simple kindness.",
   "created_utc": 1693507517,
   "score": 209,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyk8m30",
   "message": "You can’t really know. That’s why you should treat people with compassion and care.",
   "created_utc": 1693509660,
   "score": 179,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl2832",
   "message": "Always check on the ones who check on you. They're probably the ones who understand most what it's like to be forgotten and are following the Golden Rule.",
   "created_utc": 1693520677,
   "score": 155,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl6ymx",
   "message": "Poor hygiene. Nobody likes being unhygienic. Most people are depressed at their smelliest.",
   "created_utc": 1693522672,
   "score": 96,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyke599",
   "message": "apologizing constantly",
   "created_utc": 1693511679,
   "score": 41,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykr7fw",
   "message": "Looks tired, forced smile, flinches subtle and doesn't seem happy when you talk of things you know they love",
   "created_utc": 1693516438,
   "score": 74,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyk0rto",
   "message": "If someone quietly, calmly and emotionlessly tells you that you need to stop, leave, etc -- like they are dead inside -- there is a good chance they are about to snap",
   "created_utc": 1693506813,
   "score": 74,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyknfdk",
   "message": "I’m thinking about the person who never has weekend plans and doesn’t have much to contribute to the conversation.\n\nThey could be very lonely.",
   "created_utc": 1693515039,
   "score": 158,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyksts3",
   "message": "They sleep all the time and still have no energy/ambition.",
   "created_utc": 1693517043,
   "score": 137,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykova3",
   "message": "When they start giving away possessions and suddenly reaching out to people they may have pushed away previously. This is what my best friend went through before she sadly departed.",
   "created_utc": 1693515564,
   "score": 222,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl7850",
   "message": "Short term forgetfulness. They can't keep up with a conversation because they \"forgot\" what they last said. Especially when texting.",
   "created_utc": 1693522786,
   "score": 105,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl59rk",
   "message": "When they actively avoid seeing themselves. Either in a mirror, a reflection of some kind, pictures, etc.",
   "created_utc": 1693521936,
   "score": 75,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyjvt53",
   "message": "When they don’t ask for favors or help. Ever.\n\nLack of trust. No trust falls, no matter the person.\n\nThey don’t like it when people get them something, or they don’t like being the center of attention.\n\nTheir heart may be racing, but their face stays calm.\n\nWhen they’re not disappointed when something bad happens. They accept it and keep moving.\n\nThey hate threats.",
   "created_utc": 1693505008,
   "score": 147,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl9uhx",
   "message": "They're quick to tear up at a number of different things that typically would not elicit that response.",
   "created_utc": 1693523925,
   "score": 153,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl7qpo",
   "message": "They're out of work more. This might not just be because they're calling out for mental health stuff. As we get more stressed, we have a harder time fighting off illness. If someone is getting sick biweekly and they weren't before, it's probably not just them being \"sick\". They're probably genuinely being battered as a result of being too stressed to be healthy.",
   "created_utc": 1693523009,
   "score": 154,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyke280",
   "message": "Guy I work with seems just angry all the time, and has rather a hot temper about him. Seriously this guy is in his mid 40s (old enough to be my dad) and can throw meltdowns about the smallest of things, even stuff that turns out to be fairly insignificant, then he tries to claim he's OK when he's really not. Unfortunately he still believes that mental health issues are not real and is in denial mostly. Sadly he uses alcohol to self medicate.\n\nTurns out he has a pretty miserable life outside of work (he's divorced, has no friends apparently and doesn't have much money), so work is kind of his escape. At first I thought he was a bit of an asshole, but I actually feel a bit sorry for him now.",
   "created_utc": 1693511648,
   "score": 185,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl3lh5",
   "message": "In the military if someone asks \"hows it going?\" And you say \"aha, livin' the dream\" that's code for \"If death came for me I would do nothing to avoid it.\"",
   "created_utc": 1693521240,
   "score": 39,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyk1v7g",
   "message": "They just look very tired and it's not obvious why. They tend to sit down when most people would normally stay standing.\n\nA semi-obvious way to ask if someone's depressed is to ask if they sit down in the shower...",
   "created_utc": 1693507204,
   "score": 204,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykjcog",
   "message": "A smile that doesn't make it to their eyes. From the nose down, looks happy. From the nose up, it's like looking at a doll.",
   "created_utc": 1693513560,
   "score": 187,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyktz9h",
   "message": "Honestly I always worry about people who always seem chipper no matter what. I always imagine them having an absolute meltdown in private every day. Part of that is definitely projection though, I'm kind of a sad sack.",
   "created_utc": 1693517481,
   "score": 241,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykxmbk",
   "message": "When the loud and noisy ones go quiet. It’s one of the most easy to tell, but also one of the most overlooked. Most people just joke and say ‘thank god you finally shut up’. We’re not okay when we are quiet",
   "created_utc": 1693518864,
   "score": 220,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykymvz",
   "message": "If you touch them (like put a hand on their arm or something similarly innocuous) and they jump a mile",
   "created_utc": 1693519252,
   "score": 217,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl4jpr",
   "message": "Although it’s obviously not always the only indicator, but people pleasers often have a default to put themselves second. These are the people I worry about",
   "created_utc": 1693521631,
   "score": 116,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyjwdou",
   "message": "When the person seems almost too okay, like they have given up hope.",
   "created_utc": 1693505215,
   "score": 179,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl77xn",
   "message": "Staring unresponsive for thirty seconds.",
   "created_utc": 1693522783,
   "score": 92,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykwvji",
   "message": "They overshare traumatic events like it's not a big deal",
   "created_utc": 1693518579,
   "score": 135,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylqazh",
   "message": "Over explaining themselves for no reason = trauma response",
   "created_utc": 1693530905,
   "score": 94,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylapl0",
   "message": "-When they randomly space out multiple times. Could also be a sign of physical tiredness/lack of sleep, but I always do this when I'm not okay\n-Self-deprecating jokes. Putting yourself down often means low self-confidence, which might lead to destructive behavior\n-Suicide jokes. I feel like these are the most obvious and serious signs",
   "created_utc": 1693524299,
   "score": 81,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykr6fz",
   "message": "Oh! I can comment on this because I’m im that position. It’s not subtle to me, but may be to others.\n\nI left a day early. I just had to go.\n\nI called off sick for a mental health day. I never give a reason because it’s no one’s business. \n\nI’m less responsive and “on” because I’m trying to pull back from doing literally everything and everyone’s accountable presence.\n\nI’m tired literally all the time. I’m just exhausted. So probably not as talkative? I’m talkative period so probably a good sign for most.\n\nI’m making minor errors because I’m overwhelmed. Not just the work now - it has bled to my life.\n\nStuff like that.",
   "created_utc": 1693516427,
   "score": 5,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyljw18",
   "message": "That you realize you’re a lot worse than you realized while reading this thread.",
   "created_utc": 1693528174,
   "score": 163,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyksnt6",
   "message": "Indifference",
   "created_utc": 1693516982,
   "score": 76,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym02jz",
   "message": "From what I've been told about myself by others:\n\nAlways looking tired/sad/angry\n\nConstantly being negative\n\nSelf isolating\n\nCan't handle conflict and/or compliments\n\nGoes out of the way to help others, but never asks for or accepts help themselves\n\nDoesn't have any goals or aspirations, and hates talking about the future\n\nGetting overly angry or even violent over the smallest things",
   "created_utc": 1693534910,
   "score": 82,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylh7u8",
   "message": "I wish I hadn’t come across this thread. I have done most of these things all my life and I’m not okay. I’ve tried different methods to improve my mental health since childhood but nothing works. I want to have friends, be independent, take care of myself, sleep less, have a life. But at this point I don’t see it happening.",
   "created_utc": 1693527087,
   "score": 75,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylocon",
   "message": "They are funny.  It isn't 100% but the somewhat accurate joke is \"think of the three funniest people you know, now guess which 2 have depression.\"",
   "created_utc": 1693530085,
   "score": 73,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylowv1",
   "message": "You ever seen somebody drop something and then just stop and stare at it for a solid minute before they pick it up? Sometimes it’s the littlest things that can break what little hold you have.",
   "created_utc": 1693530329,
   "score": 64,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl0rs7",
   "message": "Hating their birthday",
   "created_utc": 1693520098,
   "score": 236,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyktdca",
   "message": "Making really rash decisions to fix a hopeless problem and having unreasonably positive expectations about it (like if your friend is stressed about having a medical condition they can’t cope with and is gushing about their increasingly wacky and even risky supplements for it).",
   "created_utc": 1693517250,
   "score": 56,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyk2oyy",
   "message": "That look in the mirror.",
   "created_utc": 1693507504,
   "score": 151,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykr96s",
   "message": "The more down or anxious I feel the more I attempt to mask it. Eventually I reach breaking point and retreat, sometimes I disappear for stretches trying to heal. The sad part is that is when I need people the most and that is when it is the hardest to reach out... c'est la vie",
   "created_utc": 1693516456,
   "score": 97,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylhyzx",
   "message": "This isn't subtle, but if you saw me about 3 hours ago you would have seen me wander into my bedroom (which I haven't slept in in the past few days), sit on the bed, and ugly cry while talking to the spirit of my dead dog.\n\n(Death 11 in 14 months, on top of a missing daughter... I am not ok.  I feel like I am on the verge of a breakdown.)",
   "created_utc": 1693527385,
   "score": 101,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylf7ro",
   "message": "Short, brief answers to your questions about them, and then quickly changing it to rapid fire questions about you. Overall, they are doing their best to avoid talking about themselves, and that’s easily done by making the focus of the conversation about you.",
   "created_utc": 1693526256,
   "score": 57,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jymajcr",
   "message": "Bonus post. \n\nI wish it were possible to meet every single one of you and throw a big ass dad hug on you. Just c'mere, you. *squish*\nAwkward, I know. But it's how I feel.",
   "created_utc": 1693539617,
   "score": 62,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyjyk08",
   "message": "Self deprecating jokes",
   "created_utc": 1693506008,
   "score": 241,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykdiup",
   "message": "Chronic illness \u0026lt;— can be internalized trauma from childhood abuse",
   "created_utc": 1693511450,
   "score": 159,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylgzsv",
   "message": "If their bedroom is a mess. The rest of their home could be immaculate, but if the bedroom is chaos, you know they’re going through it.",
   "created_utc": 1693526996,
   "score": 83,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyljeqh",
   "message": "The scariest sign is when they suddenly seem like a 1000 times better. This might be because they've sorted out a plan to end it all.\n\nI've seen it a couple of times. It doesn't seem like much in the moment, but in hindsight I wish I knew better and could have done more to help.",
   "created_utc": 1693527972,
   "score": 83,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyjz1iu",
   "message": "Alcohol and/or drug abuse. It's an attempt to self medicate but that ultimately doesn't work and just causes more problems.",
   "created_utc": 1693506183,
   "score": 140,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykqejh",
   "message": "Sometimes when people seem overly happy and always making jokes seems like they're hiding something inside.",
   "created_utc": 1693516136,
   "score": 35,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl081e",
   "message": "They don't smile with their eyes. Iykyk.",
   "created_utc": 1693519883,
   "score": 35,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykvniw",
   "message": "If u dont socialise , u cant be hurt and feel pain. I dont socialise so i am fine.",
   "created_utc": 1693518114,
   "score": 73,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykqxy2",
   "message": "Often times, when they make drastic changes to their physical appearance. It's not a foolproof ways but I've found 9/10 times, even with myself, that new spontaneous tattoo, piercing, or haircut is followed up by some kind of breakdown. \n\nThat's not to say everyone who gets a tattoo or dyes their hair isn't ok - I've just found that at least with the people in my life.",
   "created_utc": 1693516340,
   "score": 94,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl8ic0",
   "message": "When you ask “how’s it going?” And they respond with “it’s going.”",
   "created_utc": 1693523340,
   "score": 100,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykoz8t",
   "message": "You can see it in their eyes",
   "created_utc": 1693515605,
   "score": 66,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyloe1w",
   "message": "Dark, edgy humour.\n\nBad hygiene.\n\nUnable to perform tasks, often simple tasks.\n\nHigh number of sick days.\n\nNo friends or partner.\n\nHighly sensitive and highly empathetic.\n\nHard on themselves.\n\nLooking unwell or older for their age.",
   "created_utc": 1693530102,
   "score": 73,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl28gb",
   "message": "Not initiating social interactions/messages anymore when they previously used to, a lot. The things that go amiss are harder to notice than the things that appear though.",
   "created_utc": 1693520681,
   "score": 35,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl6ody",
   "message": "It’s always the person who comes running when you’re struggling",
   "created_utc": 1693522547,
   "score": 31,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylo2h9",
   "message": "The amount of pleasing someone will do.\n\nIf they go all out than trust me they are not rich they are just trying to treat everyone the way they want to be treated.\n\nBut no matter how many times they try it's never good enough for the ones we please and in fact either they want more or they disappear.",
   "created_utc": 1693529964,
   "score": 37,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylqpog",
   "message": "When they push everyone away, isolate, quit participating in their favorite activites, constant apologies, always tired but never sleeps, over eats or barely eats, forgets self care (showering, brushing hair, brushing teeth), I’m sure there’s many more but these are my signs (where I’m all currently at)",
   "created_utc": 1693531069,
   "score": 39,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym2wei",
   "message": "The deep breath after being asked \"how are you?\" Followed by a \"I'm ok\"",
   "created_utc": 1693536131,
   "score": 35,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl5omu",
   "message": "It's hard to really know but when someone goes from talkative to recluse very quickly I usually ask if there's anything wrong",
   "created_utc": 1693522117,
   "score": 27,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl9eb2",
   "message": "The thousand yard stare.",
   "created_utc": 1693523727,
   "score": 30,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyla0cb",
   "message": "If they don’t want to talk about themselves. Someone who isn’t doing anything but drugging themselves with a screen or laying in bed can’t tell you how their weekend was, but they try to hide it. They will always redirect the conversation back to you. “Weren’t you doing [thing] this weekend?”",
   "created_utc": 1693523995,
   "score": 29,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym88vx",
   "message": "They put other people FIRST, they always dodge things or questions about them, words of affirmation do not work on them even though they try really hard to trust..",
   "created_utc": 1693538533,
   "score": 33,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jynmkrr",
   "message": "When a person begins to change, not for the better. Becomes closed to the world and changes his behavior",
   "created_utc": 1693570069,
   "score": 27,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyjymia",
   "message": "when someone appears overly happy and enthusiastic, all of the time",
   "created_utc": 1693506033,
   "score": 131,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykek94",
   "message": "\"It has been hard but Im fine.. really\"  \nIts all in the tone",
   "created_utc": 1693511830,
   "score": 45,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykosxj",
   "message": "[deleted]",
   "created_utc": 1693515540,
   "score": 142,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykb43z",
   "message": "Not being able to look you in the eye when you ask how they are\nStaring into the distance, lost in thought too often.\nShort attention span.\nLack of motivation for work / life\nWithdrawn from social occasions.",
   "created_utc": 1693510571,
   "score": 62,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyk4ue1",
   "message": "avoiding eye contact",
   "created_utc": 1693508277,
   "score": 95,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykwqrb",
   "message": "Their eyes",
   "created_utc": 1693518529,
   "score": 23,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyljn8j",
   "message": "They talk too much about nothing to hope no one catches on that they don’t really have anything positive about them selves to share. \n\nOr they just don’t talk at all. \n\nI avoid talking to anyone because I feel like I don’t have any good to say \u0026amp; I don’t want to risk making someone else feel bad like I do.",
   "created_utc": 1693528071,
   "score": 22,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylz0xz",
   "message": "I feel like isolating and withdrawing are good indicators and easy to recognize as signs that someone isn’t doing well (if people are paying any attention). But someone becoming more social than usual can also mean they’re going through it. Like it’s too hard for them to be alone with their thoughts. When I’m at my lowest, I am the most active in the group chats, I’m hitting people up a lot, spending time on Reddit lol.. even if my work is social, I’m married, i see my friends and family regularly, I’m still kind of desperate for connection/distraction.",
   "created_utc": 1693534475,
   "score": 24,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym25rp",
   "message": "They often cancel plans. I often have the best of intentions to socialize, but often my anxiety and or pain is just so high I panic at the last minute and back out.",
   "created_utc": 1693535816,
   "score": 20,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyjwjxv",
   "message": "They say they would rather not see humanity",
   "created_utc": 1693505278,
   "score": 18,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym15ka",
   "message": "When they constantly make jokes about how miserable they are. When they’re tired all the time or frequently ill. They have a hard time getting excited about things. They stop doing things that used to make them happy. Spending too much time on their phone for the instant dopamine..",
   "created_utc": 1693535373,
   "score": 19,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym4bbm",
   "message": "Sleeping more often. With not eating or eating to much. Not being able to take care of themself, like not showering.",
   "created_utc": 1693536736,
   "score": 20,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jyl3kj9",
   "message": "Once I read about a wonderful quote, \"Be a star in someone's dark sky.\". When you see someone depressed try to set with him and talk to him to vint out his anger or stress. This will ease his pain and frustration.",
   "created_utc": 1693521229,
   "score": 92,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jymaey1",
   "message": "When someone is not comfortable alone.",
   "created_utc": 1693539558,
   "score": 17,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jylqb5g",
   "message": "Their username is unlawfulretainer",
   "created_utc": 1693530907,
   "score": 18,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym3g8h",
   "message": "If I notice someone not really taking care of themselves, like haven’t bathed, brushed their hair, same clothes for a couple days, they’re more quiet than normal, I’m definitely gonna try to give them a boost or kind ear, whatever they want.",
   "created_utc": 1693536367,
   "score": 16,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jym1jqs",
   "message": "Empty eyes. Just blank stares. Behavior that doesn’t match the situation.",
   "created_utc": 1693535547,
   "score": 13,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jymgsft",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jymls98",
   "message": "When you push everyone in your life away. Like intentionally ruin perfectly good friendships that mean a lot or you. Distance yourself from your family that you love dearly and use to be very close to and maybe talk to them once a week now in text form with one word replies. You stop being intimate with your partner because you disgust yourself for no reason. You never want to leave your house. The thought of leaving just gives you this crippling anxiety that shakes your soul and makes you almost paralyzed. You can't get out of bed (for basically the same reason along with being physically and emotionally exhausted). Everything that usually brings you happiness, or anything that you love doing is just exhausting and you dred doing because it is too much to put on your already suffering mind. Eating? You either forget about it completely or over do it. Cleaning? Not a chance unless it's at 2am and you are deep cleaning everything and can't stop. You don't sleep. You will want to. You will try. You will lay in bed with your eyes closed (after taking sleeping pills because you haven't slept in two days) and every sound is overwhelming and too loud. You ignore people. You see the text messages and missed phone calls. You are rude, snappy and irritated. And if you aren't you are putting on a fake smile and pretending to be nice. You tell everyone what they want to hear. And at night when everyone is asleep or nobody is around (if you aren't too numb) you are  sobbing. \n\nIn short the subtle ways to tell \n- they are distancing themselves from people for no good reason\n- they are irritable\n- they are quiet\n- they ignore everyone\n- they have a messy house \n- they have dark circles under their eyes from the lack of sleep\n- they are not eating or over eating\n- they people please\n- the don't leave the house \n \nOr maybe that is just me.",
   "created_utc": 1693545714,
   "score": 18,
   "submission_id": "166i78y"
  },
  {
   "comment_id": "jykizvc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166i78y"
  }
 ]
}