{
 "submission_id": "166qk1f",
 "title": "What’s something that’s happened to you that sounds fake but (unfortunately) isn’t?",
 "selftext": "",
 "created_utc": 1693524216,
 "permalink": "/r/AskReddit/comments/166qk1f/whats_something_thats_happened_to_you_that_sounds/",
 "score": 132,
 "url": "https://www.reddit.com/r/AskReddit/comments/166qk1f/whats_something_thats_happened_to_you_that_sounds/",
 "comments": [
  {
   "comment_id": "jylpwvl",
   "message": "A huge tree branch fell through the roof in my bedroom during a storm and about a minute after that a couple raccoons fell into my room.",
   "created_utc": 1693530744,
   "score": 16,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyllz7n",
   "message": "Years ago, I broke my right foot. After 6 weeks in a boot, I was leaving the orthopedist office boot-free. Just me and my own two feet, raw dogging the ground. I was so excited to drive home, now that I was out of that damn boot. \n\nAnd then on the way to the car, I stepped off the curb, rolled my left ankle, and broke it.",
   "created_utc": 1693529065,
   "score": 68,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyljyzs",
   "message": "I got hit by lightning while driving my car down the interstate. Completely killed the computer system and totaled the car out.",
   "created_utc": 1693528210,
   "score": 129,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jym05xk",
   "message": "Not me but my uncle. He was in Jamaica when his wife who was doing fitness classes, died due to a perforated bowel from a meal at the resort and the authorities drove him to an ATM and told him he's going to be suspect #1 if he doesn't pay them and he'll never have his wife repatriated to the US.\n\nHe complied and they took him back to the resort, unbeknownst to him, T-Pain was also there and caught wind of the situation and worked magic with his connections to keep my uncle safe and bring my aunt home for a funeral, as well as providing his bodyguard protection to my uncle.\n\nTo this day, almost two decades later, they will video chat on holidays like Easter to talk and in my view that man is a saint to our family. Anytime he's in town they'll meet backstage before one of his concerts and they'll have a big hug. One time he met his family. I will never forget the kindness this man has shown over DECADES, it's insane\n\nEdit: sharing a pic of T-Pain hugging my uncle https://i.imgur.com/4wFcqda.jpg",
   "created_utc": 1693534949,
   "score": 222,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylm50a",
   "message": "I was hit in the head by a bowling ball on a trampoline. 911 hung up on my cousin because they thought it was a prank.",
   "created_utc": 1693529133,
   "score": 195,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylvrti",
   "message": "I was dragged out of a tent in my sleep by a pack of dingos on Fraser Island in Australia. \n\nI woke up to a weird feeling at my feet and saw that they were chewing on my toes through the sleeping bag. One of them was standing on my hips/stomach, staring me in the face. Now, I'm not a fighter, but I hit him such a punch on the side of the head....like, a perfect right cross to his cute lil face. He went flying sideways which spooked all the others (about 4 or 5 of them) and, with a few kicks from my bagged up legs, they scuttled away. I went back into the tent to find my then gf still asleep and snoring away.\n\nThe next morning, I went over to our tour guide fella, massive Aussie dude named Tony, and told him what happened, and he asked \"Didja see which one it was?\"\n\nAnd funnily enough I did. He had a yellow and blue tag in his ear (they're all tagged on the island) and I remembered because they're the Wicklow colours, where I'm from. And Tony just said \n\"Aw yeah, that cunt\"\n\nI ended up punching quite a bit of wildlife in my year there, but Australia definitely started it",
   "created_utc": 1693533129,
   "score": 130,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylzoz2",
   "message": "In 2012 I lifeguarded at a beach in Delaware. I was talking with a lady who was drinking a glass of wine on the beach. While telling her she was not allowed to do that, Dave Grohl walked behind me. I was/am a massive fan and knew he would vacation at this beach, but never assumed I would run into him. In the moment of being absolutely star struck the lady goes “oh you’re a fan of Dave I see?” Barely able to talk I said “yes, he is a reason I got into drumming.” She then said “oh he’s my son, you should go say hi!” \n\nI let her drink the wine and I was able to talk to my music idol for a solid 20 minutes. One of the best days of my life.",
   "created_utc": 1693534751,
   "score": 238,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylnq66",
   "message": "I have a misdemeanor on my adult record for skiing out of bounds.",
   "created_utc": 1693529817,
   "score": 227,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylu9bv",
   "message": "Slept with a boyfriend for over a year (unprotected) and found out he had hiv. Been tested for twenty years straight and I’m still negative.",
   "created_utc": 1693532505,
   "score": 235,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylv9dr",
   "message": "My grandmother prevented the neighbor boy from kidnapping our next door neighbor. \n\nOur house was the bus stop. I woke up sick that morning and didn’t go to school. Grandma was the neighborhood grandma and kept an eye on the kids that were at the stop every morning. She was watching the girl at the corner (she was the only one riding that morning), looked back and she was gone. He was dragging her accross our backyard with a knife to her throat. My grandma ran at him screaming and throwing rocks at him while i called the cops. She won citizen of the year in our city.",
   "created_utc": 1693532919,
   "score": 26,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylh6hi",
   "message": "I broke my humerus while sitting stock still at my computer desk. Bone cancer had eaten through it and it chose that moment to just snap in half. 0/10 do not recommend",
   "created_utc": 1693527073,
   "score": 217,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylpcgy",
   "message": "I got hit by the McGruff the Crime Dog house boat while sitting in my car at a red light.",
   "created_utc": 1693530511,
   "score": 91,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyllnrm",
   "message": "My childhood best friend's mom passed away by drowning. My best friend then died a couple of months later by being hit by an 18 wheeler on the side of the road, her father then died a few months later from throat cancer. Lost my entire second family in under a year due to unrelated incidents. It's been 7 years and I'm still not over it.",
   "created_utc": 1693528929,
   "score": 74,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylkhos",
   "message": "I have randomly came across not one but two people attempting, or about to attempt suicide. Didn’t know either of them, both it totally different locations. Both times I was just living my normal life and then suddenly I’m trying to stop a suicide. Ambulance came and got the one. The other one after a very long talk down ended up taking off upon realizing I had dialled 911 so the operator could hear what was going on.",
   "created_utc": 1693528432,
   "score": 15,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylmzsh",
   "message": "When I was in elementary school we went on a class trip to one of those old colonial towns to see how life was back then for settlers.\n\nDuring lunch break I went to the bathroom and a man paid me to take pictures of me in the bathroom.  I was really excited to get money.\n\nNext thing I knew I was in a police car scared out of my mind that I was in trouble.  I kept apologizing to the cop while my mom tried to calm me down.  I remember crying all night that my principal would hate me because I made the cops come.\n\nWhat an odd memory.",
   "created_utc": 1693529503,
   "score": 55,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylj6b0",
   "message": "I was working and felt like I broke a rib. It went away but I off handedly mentioned it to my doctor. She was super concerned and ordered a bone scan. It was stage 4 cancer.",
   "created_utc": 1693527875,
   "score": 120,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyljsbs",
   "message": "My cousin beat my aunt to death then put a towel over her face and sat down and ate dinner. My other cousin had a welfare check and they found him watching tv with her body in the kitchen.\nEdit: this happened about 10 years ago in Florida. My cousin is mentally unstable. Due to a car accident that happens to him when he was in his teens and has been on medication his whole life and I guess the older he got the worse he got. He was in his late 40’s when he killed my aunt. I guess they got into an argument and he snapped and beat her to death. Then cleaned up and put all the evidence in the attic but left her lying on the kitchen floor with the towel over her face. He’s been in a mental institution ever since.",
   "created_utc": 1693528131,
   "score": 225,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyld2ey",
   "message": "Brother was murdered by his wife who then killed herself a few months later. No answers. No investigation. Just chaos in our lives.",
   "created_utc": 1693525327,
   "score": 202,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylkpe5",
   "message": "I was cuffed and thrown in the back of a cop car after being accused of stealing cars, while walking through a bowling alley parking lot. \n\nI was 12.",
   "created_utc": 1693528522,
   "score": 99,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyln3fv",
   "message": "I was almost killed by a bug?\nI was bitten by a flea or a tick, unsure of which. A couple weeks later I passed out in a Walmart, and woke up after emergency surgery with a hole bigger than my fist in my abdomen under my left ribs. MRSA man, I do not recommend.",
   "created_utc": 1693529546,
   "score": 31,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyls8gc",
   "message": "I was thrown off a motorcycle on the interstate when I was 22 months old. Yes, MONTHS. My parents thought I was dead because my head was ripped open (skull too) but took me to the hospital anyway.",
   "created_utc": 1693531681,
   "score": 37,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylpkzv",
   "message": "I rescued my father from the Sinaloa Cartel outside Guadalajara in 2007. He was there on business launching a broadcast satellite and had a major heart attack. Was taken to a small clinic and held for ransom by the cartel. Machine guns, private jets, pockets full of cash…got him back and he lived another 10 years to see his grandsons born!",
   "created_utc": 1693530609,
   "score": 211,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylr2hx",
   "message": "Not mine but a friend’s story\n\nWhen she was about 5 or so she was at CVS with her dad when someone robbed the store. While the robber is pointing a gun and yelling at everyone to get on the ground, her dad, being an Asian man born in Asia, says “Happy Halloween” because he thought it was a costume. This happened in November.",
   "created_utc": 1693531210,
   "score": 6,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylk2p6",
   "message": "I got punched in the face by a kangaroo when I was 13.",
   "created_utc": 1693528254,
   "score": 25,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylmaa6",
   "message": "Survived two plane crashes (both were DeHavillands)",
   "created_utc": 1693529196,
   "score": 125,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylbh1t",
   "message": "Nearly almost certainly died in a parasailing accident when I was young. Was up there with my mum. There was others out doing the same thing and our ropes nearly got tangled. I vividly remember my mum panicking before being a total badass and steering us out of a disaster.",
   "created_utc": 1693524634,
   "score": 249,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylpr2g",
   "message": "there’s a lamb that hates me and goes out of its way to kick only me when i visit my fathers farm.",
   "created_utc": 1693530677,
   "score": 254,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyloicq",
   "message": "I was gassed and robbed on a train going through Serbia in the winter of 1996 when we were at war with them. All they got was a 20£ note.",
   "created_utc": 1693530154,
   "score": 95,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jym2wmg",
   "message": "I lived in a small quiet town and my house was in a cul-de-sac so all the neighbors knew each other and we all got along well. \n\nOne night when I was about 12 years old, I was babysitting my baby brothers (twins). It was bedtime so we were laying in my mom’s bed watching a movie to wind down. Suddenly they both start whining that they want chocolate milk. I was super annoyed because I just wanted them to go to sleep so I could be off the clock, so to speak. \n\nJust as we walked through the doorway and out of the bedroom, I heard what sounded like firecrackers going off in the bedroom we just left. I peeked my head back in the doorway and heard a couple more. It sounded like it was coming from the closet which was about a foot away from me at this point. I called my mom and told her what happened and that I was scared. We didn’t go back in the room until she got home. \n\nOnce she was home, we discovered several bullet holes throughout the bedroom- in the walls, in the closet door, and one in the corner of the tv- so we called the cops. They figured out that our neighbor had been doing some target practice in his garage (and drinking) and his garage wall faced our house. So the bullets entered my mom’s bedroom through the wall, just a few inches above her bed, which had no headboard. Right where our heads had been while we were lying there watching the movie. \n\nIf those little buttheads hadn’t bothered me for chocolate milk at that exact moment, things could have been very different.",
   "created_utc": 1693536134,
   "score": 14,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylkbaq",
   "message": "my 16 year old brother put a cocked and loaded gun to my head when i was 11. the cops came and found an airsoft gun with an orange tip and claimed that was the weapon, despite me denying it all night. i found the real gun a couple months later in a coat closet wrapped up in a scarf. those cops sucked at their job.",
   "created_utc": 1693528355,
   "score": 101,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylrvgf",
   "message": "I got bitten by a penguin… On my neck. No, I wasn’t doing anything stupid at the time. The penguin was standing on a table for photo ops (as an animal ambassador for a zoo) and it went for my wine glass as I stood next to it. Moved my wine glass out of the way, and got nipped on my neck for my troubles.",
   "created_utc": 1693531537,
   "score": 40,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylstj8",
   "message": "My dad forcing me to eat my pet squirrel. I grew up lonely in a rural area. I made friends with a squirrel and the little guy got tame around me. Like I could sit in the bench swing and he would climb down and I would pass him a granola bar. He actually begged with his hands asking for the food.\n\nWell one day my dad was cooking fish and drinking beer with his friends. Well the see me in the bench drawing and the squirrel comes down. They shout what am I doing. I said just chilling with my little bud (I was 10m). They make a joke about my dad raising a Disney princess. He gets angry and goes inside. He comes back outside and next thing I know is the bench I was in is being knocked over the squirrel bails and then boom. Little bud is shot with bird shot. His friends were laughing til this.  He then tells me to wait by the fryer will he proceeds to clean the squirrel and then deep fries it in front of me and makes me watch. I see the eyes of what was my friend exploding in the oil. He cooks it til it was done. He then Infront of his friends demands that I eat it. I say know but he grabbed me by the collar and pops me three times. He then tells me the squirrel got off easy. He could do a lot worse to me. I eat my friend that literally had just been feeding and laughing with thirty mins ago. His friends alot lost their composure. Many left and a few threw up at this sight. It was not a good day.\n\n\nSo yeah again being made to eat a pet",
   "created_utc": 1693531919,
   "score": 30,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylp6op",
   "message": "They didn't catch my son at birth.",
   "created_utc": 1693530445,
   "score": 78,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyldvdx",
   "message": "My DoD whistleblower story.\n\n[https://www.reddit.com/r/Whistleblowers/comments/14rrefv/an\\_update\\_to\\_my\\_dod\\_hotline\\_saga/](https://www.reddit.com/r/Whistleblowers/comments/14rrefv/an_update_to_my_dod_hotline_saga/)",
   "created_utc": 1693525680,
   "score": 197,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylinlz",
   "message": "I met Pearl Bailey on a dirt road in Oklahoma and she asked me for directions. Apparently had an old friend in the area",
   "created_utc": 1693527661,
   "score": 159,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyltoky",
   "message": "2 weeks ago I dropped a grill propane tank on my foot. Yesterday I had my whole big toe amputated .",
   "created_utc": 1693532270,
   "score": 28,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylaru9",
   "message": "A 30-year-old pedophile woman wanted to have sex with me when I was 10 years old.",
   "created_utc": 1693524326,
   "score": 160,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylowt7",
   "message": "Not me directly, but a family member was killed by a hired hit man via a car bomb.",
   "created_utc": 1693530328,
   "score": 87,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylro9z",
   "message": "I cut myself open (by accident) with a spoon.",
   "created_utc": 1693531457,
   "score": 253,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylslpy",
   "message": "I was almost in a shooting at a target. Was with my mom and dad about to go shopping for Christmas gifts (I think for my sister she was at gymnastics when this happened). My parents park the car and as we get out this guy lighting a cigarette stops us and says “hey there’s two people over there with guns drawn I would get back in your car and shop somewhere else”. We left, got dinner and saw lots of emergency vehicles that night. The next morning there was an article about the parking lot shooting at the target we were at I can’t remember but a few people died. When this happened I was sad I couldn’t go to target but now that I really understand the situation I feel so bad for the people and families who are affected by it. I can try and find the article of the event if anyone is interested in reading about it. I’m hoping the guy who warned us that there was guns is doing ok and living a great life and I hope the families affected are doing well and I’m hoping they know how much this even that injured or took away a loved one of theirs is still something pulls at the heart of others.",
   "created_utc": 1693531830,
   "score": 86,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylbxcf",
   "message": "I was briefly kidnapped in Malaysia",
   "created_utc": 1693524830,
   "score": 142,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylfcn1",
   "message": "When I was 3-5 my mom married my little brothers dad. She was working basically all the time, and also trying to balance out school. After she had my little brother, his dad started getting... hostile towards me.\n\nFor context, I was living with my mom, twin sister, little brother, step brother, step sister, and stepfather (now he's an ex stepfather). His daughter was awesome. His son was a completely different story.\n\nSo, my ex stepfather abused me, just about every day for 2 years. I didn't know what to think about it because I was so young. He used to beat me with his belt, lock me in the attic, make me drink beer. He left me in the woods. But, he was smart enough to hit me where the marks wouldn't be seen by my mom. He did give me a black eye once by punching me in the face. He always screamed at me. He scared me. Every time his kids did something wrong he blamed me for it and he beat me for it. \n\nI hate him. And every time I go down to my bio dad's house I'm scared I'll see him again. I'm scared he will try to do it again.\n\nHis son, who was around 10-12 at the time used to groom me. He and I shared a room, and he made me touch him at night. And every time I said \"I don't want to\" he'd break something, or say I hit him, or lock me in the closet. All of those getting me beaten by his dad.\n\nI'm 16 now and I'm still trying to get over it. I'm hurting. I wish I could go back and change it. I had my childhood stripped away from me because my mom had bad taste in men, and that's unforgivable. She doesn't believe the scars he left. She negates what i say and feel, just so that she can feel better about herself.\n\nI have panic attacks whenever I smell a certain type of alcohol now, and I have panic attacks whenever I smell weed. I'm claustrophobic too, and I hate being alone in the dark. \n\nThank you for listening. I had to get it out there in a way that I'm comfortable with.\n\n\nTldr; my ex step-dad abused me and his son groomed me when I was 3-5 years old, and my mom still doesn't care.\n\nUpdate: I've been going to therapy for a few weeks now. The only reason for that being I have pnes (ptsd related non epileptic seizures. Basically if I have a panic attack it could cause a seizure.) My therapy is tbcbt, or, trauma based cognitive behavioral therapy. The only reason my mother is allowing me to do this is because A. I almost died because of a seizure (caused by my current stepfather because he hit me and held me in a headlock after screaming at me) and B. So that I could stop pissing her off by not wanting to be around her. Both my mother and current step-dad are abusive. I can't do anything about it. As a 16 year old, I can't legally move out unless I get emancipated in the state of PA.",
   "created_utc": 1693526315,
   "score": 33,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylkqiv",
   "message": "A member of KISS cyber stalked me for almost a year.",
   "created_utc": 1693528535,
   "score": 140,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylryih",
   "message": "When I was about 6 years old I was at Dairy Queen with my Mom and brothers, Mom needed to change the baby’s diaper so she asked this guy sitting at a table near us on the patio to watch my 4 yr old bro and I. She had seen him around before and thought of him as a friendly neighbour…\n\nA few weeks later he was on the news, it was [Clifford Robert Olson](https://en.wikipedia.org/wiki/Clifford_Olson)\n\nI imagine he must have been smirking and thinking “Jesus Lady, you’re lucky they’re a bit young for my taste”",
   "created_utc": 1693531572,
   "score": 172,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyltzph",
   "message": "I won an art competition with my painting judged while hanging upside down.\n\nWhen I told them, they tried telling me I was wrong till they realised I had painted it. TBH, it was a school competition.",
   "created_utc": 1693532395,
   "score": 100,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylvl4j",
   "message": "When I was 10 years old, several people in my neighborhood were attacked by a deranged squirrel that was missing part of its tail. One day, my dad was at work and my mom was running errands, so myself and my two other brothers (aged 14 and 7) were left home alone. I was in the kitchen and my 7 year old brother was playing on the back porch. \n\nSuddenly, a squirrel that was missing the tip of its tail started attacking the kitchen window, about 10 feet from where my brother was playing. I ran outside to caution my younger brother but it was too late. The squirrel had already bitten a chunk out of his finger, which was squirting blood, and was running up and down his arm while my brother screamed his head off. I grabbed this insane, bloodthirsty creature with my BARE HANDS and chucked it into a tree. \n\nBy now my older brother had come to see what was going on. I told him what had happened, and because this took place in small town Mississippi, he of course had full access to the family gun cabinet. He got a gun, went outside, and shot some random squirrel that was NOT missing the tip of its tail. I told everyone that it was not the same squirrel, but no one listened to me.\n\nThe story of my brother’s heroic actions went around town and he was even written about in the town newspaper for saving the day. Absolutely no mention of me or my heroism at all.",
   "created_utc": 1693533052,
   "score": 88,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylooiu",
   "message": "I got made redundant from an extremely busy job where I was desperately needed, and moved into a non existent job in another department. I spent around 3 weeks doing absolutely nothing on a daily basis and had zero work to do, ever. I would fill my days by walking round the building talking to people, sitting for hours on end in the staff canteen looking at other jobs, and sitting in my car, before eventually getting myself fired on purpose so I could escape it",
   "created_utc": 1693530229,
   "score": 88,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylma8w",
   "message": "I got stranded at 18000 feet on a 20,000+ mountain due to weather. Nobody except the person with me knew where I was and had no emergency beacon or communication device. No other people on the mountain. Had to wait it out until next morning to hike back down to safety. That's the short story.  Do not recommend.",
   "created_utc": 1693529196,
   "score": 170,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyllkas",
   "message": "Because an adult didn't believe me that something was wrong I almost had my leg amputated at the age of 14.",
   "created_utc": 1693528888,
   "score": 64,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylfe2g",
   "message": "I got third degree burns from French fries as a baby🤦🏻‍♀️ \n\nThey got dropped on my arm and my dumb baby brain panicked and pancaked them to my upper arm.",
   "created_utc": 1693526332,
   "score": 27,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylk9pe",
   "message": "I shat my pants in a carnival ride (the bullet) whilst wearing cargo shorts and diarrhea was slung out of the leg of my shorts and rained down on the unsuspecting patrons below. Shut down the entire area. Nobody got funnel cakes. My dad made me ride in the back of the truck home without bottoms on and I don’t like wearing undies.\n\nEdit:\nTo add more context, I was 14 at the time and was raised in rural Alabama. The carnival coming to town was a whole city wide ordeal in my 1A high school. Less than 50 in my graduating class for reference. I was the “shit slinger” for years, and some people in my friend group still bring it up. I’m 31 now. \n\nSimilar shitty situation while hunting and wearing coveralls while leaning back against a tree in the “invisible chair” position doing my business. It partially landed in my coverall bibb on the back, and smeared up my back as I put them on. Had to ride in the back in 20 degree weather. Not fun either.",
   "created_utc": 1693528336,
   "score": 230,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylo722",
   "message": "a friend introduced me to his best friend back in high school. I married his friend. He committed suicide less than a year after we married. 5 years later i’m married to the original friend and pregnant with our first.",
   "created_utc": 1693530018,
   "score": 126,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylfke9",
   "message": "When I was 9 I tripped over a log playing tag in the dark and fell into the middle of a small bonfire we had goin in the yard after grandmas funeral. I had both my knees and hands directly in the coals and it took me a few seconds to realize where I had fallen. Felt a sharp pain in one of my hands and got up and walked out. Only my left hand got burnt black the rest of me was totally fine. Healed up good, now I just have a tiny scar with a little black dot embedded in it. Luckily my nerves were seared so it wasn't even very painful and the subsequent blisters that covered my hand after all the black was scraped off just kept reforming until the skin healed\nWe were poor so my parents didn't take me to the doctor or even bandage it or nothing so it was a small miracle it healed so well",
   "created_utc": 1693526407,
   "score": 23,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylmqku",
   "message": "A stripper once told me I reminded her of her son.",
   "created_utc": 1693529394,
   "score": 244,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylvzue",
   "message": "I won a bicycle out of honeycomb cereal when I was a kid.  My dad's response when I showed him the little piece of paper with the word 'Karate' on it:  \"You little shit.\".  Handlebars broke off while I was in the air on a jump, wiped out when I landed, but luckily no scars.\n\nI woke up once when I was a kid, went into the bathroom, and had an alligator in there.  No, it wasn't Florida.  My dad had got a couple caiman's the day before and one got out.  He was (for a while) a herpetologist and we traveled around Texas fairs with a 40' logging trailer filled with snakes and lizards.  He was outside dressed like Steve Irwin (this was years before the legendary Mr. Irwin) getting people to go inside, while I gave tours.  Fun stuff.   I also had to help pull a 23' reticulated python off him at one point, and help him recapture an 18' king cobra we had.  I guess most of the cool stories in my life revolve around my dad, who was just an epic man, who did everything every little kid wants to be when they grow up, and died a broken man due to alcohol and lost love :(",
   "created_utc": 1693533221,
   "score": 7,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylvwtq",
   "message": "My dad delivered divorce papers to my mom on her first day of chemo. In the papers his lawyer said she was in perfect health. She had stage 3 breast cancer. Yes he knew. Yes he cheated, which is why they were separated.\n\nShe did not sign. He denies it to this day. She's been cancer and idiot free for a while now. \n\nPeople are shocked I still communicate with him.",
   "created_utc": 1693533187,
   "score": 153,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylo1wg",
   "message": "I was in a movie with Halle Berry.",
   "created_utc": 1693529958,
   "score": 151,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylmc8p",
   "message": "I was sitting on a sidewalk, heard some little pop noises like a squirrel was dropping nuts from a tree or something. Then a huge tree branch fell on top of my friends and I. I was basically stuck under it, my friends were able to get out and had to lift it off of me",
   "created_utc": 1693529219,
   "score": 189,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylb3bg",
   "message": "My manager told me not to hire my best candidate for a job because she was female.",
   "created_utc": 1693524466,
   "score": 8,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyltnnz",
   "message": "I wrecked my bike in the summer after 7th grade and had to be mercy flighted, broken bones, quite severe concussion…. I forgot 90% of seventh grade and struggled in 8th, but a weird side effect was that I could music.  Before I couldn’t carry a tune in a bucket, couldn’t hear when notes were the same or different, completely tone-deaf, and after the accident I could.  I sang in my college choir for four years.",
   "created_utc": 1693532260,
   "score": 218,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jym34tm",
   "message": "In 1986 my parents planned a trip to Disney in FL, a random man tried to kidnap my half brother by snatching him and running. He was tackled, my brother was safely returned to us and nothing happened to the guy as he disappeared into the crowd. Fast forward to 1989, in Ohio at a pop up circus in a field, I was given change to go get a popcorn. A man dressed as a clown approached me and after several long minutes of small talk grabbed me. Bystanders saw the ordeal and a random man with exquisite side burns chased down this man who had thrown me into his pickup truck and gunned it. Mr sideburns and another man were able to pull him from the vehicle and stop the truck as it rolled into a parking lot and hit several parked vehicles. I was fine other than some forehead scrapes from hitting the dash. The clown was not a circus performer or associated with the circus. He was an opportunistic predator. \n\nI can’t even say either of these events were the worst part of my childhood. Also, fuck clowns.",
   "created_utc": 1693536233,
   "score": 249,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jyll24r",
   "message": "I got banned from Canada for a year.",
   "created_utc": 1693528673,
   "score": 166,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylg587",
   "message": "I was chased down the street by an angry chicken.",
   "created_utc": 1693526652,
   "score": 118,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylq8xs",
   "message": "My wife had a miscarriage right after our wedding. Spent wedding night in the ER.",
   "created_utc": 1693530882,
   "score": 240,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylvfsc",
   "message": "That on Valentine’s Day 2008, my boyfriend cheated on me, but I couldn’t confirm it.  Two days later, on the 16th, I came home and he was high AF.  Long story short, I caught him in a lie and he admitted to cheating on me.  We had been together for 4 years.  The next day, on the 17th, his dad was over our house (we lived together) building a fire pit.  We rented a house from his dad, and his dad was fixing it up trying to “flip it,” for a quick profit.  I was inside packing my shit because uh, well, he got caught/admitted to cheating on me and I was out.  While packing, someone banged on the bedroom window.  I ignored it (some friends had spent the night so I thought they were all in the backyard goofing around).  A few minutes later another knock and then pounding.  I walk through the house to the back door to say to them to stop banging on the door, and I see my boyfriend/soon-to-be ex-boyfriend on the phone, pacing, screaming “Dad!”  I look at his Dad, and he laid out on the floor, snoring and unconscious and the people who had stayed over are just standing there in shock.  I ask what happened, and he said his dad was sweating a lot, sat down, his arms locked up straight out in front of him, and then he fell back.  I monitored him closely, waiting for the ambulance.  Then he stopped breathing.  I ended up doing CPR on him for over 10 minutes which was literally exhausting. It was working for a while, but then, before the ambulance got there, he exhaled into my mouth and I just remember tasing cigarettes and then he went really limp, his eyes were still open but there was no life behind them.  I kept doing CPR because everyone else was there watching and I didn’t want to be the one to announce what I knew had just happened.  The ambulance FINALLY arrived, they did the shock paddles on him several times.  Nothing.  He was pronounced DOA at the hospital, and I did not leave my ex that day.  Stayed three more years (wish I hadn’t, but how do you dump someone the day their dad has a heart attack and dies right in front of them).",
   "created_utc": 1693532992,
   "score": 32,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylrkd4",
   "message": "My mom found out my dad filed for divorce five minutes before my birthday dinner started when I was turning eighteen. Mans waited last second because he didn’t want to pay child support 😂\n\nMy mom was cooking my birthday dinner and I was down the road at a friends house celebrating before I went home. Mom went to get the mail and found a letter from an attorney saying he found out my dad filed and wanted to be her lawyer.\n\nMom peeled down the block in the minivan and pulled over to the side of the road where my friends and I were outside and announced it to me. \n\nDad came home five minutes later to just me and no mom. He was like hey time to celebrate! With a bunch of presents and stuff. It was so awkward",
   "created_utc": 1693531413,
   "score": 116,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylsi9k",
   "message": "It’s not about me but about my dad lol.  When he was probably 11 he saw an empty steamroller and he drove it and knocked down an entire house just for funsies.",
   "created_utc": 1693531790,
   "score": 26,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylvs2e",
   "message": "Was in a relatively mild car accident. EMS recommended xrays just to be safe. I argued a bit but ended up relenting. Xrays lead to a CT and a kidney cancer diagnosis.\n\nDoctor said I would've been dead inside a year if it hadn't been found.",
   "created_utc": 1693533132,
   "score": 77,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jym0cus",
   "message": "I was sitting outside on my friend's patio gazing up at the stars. My friend says \"ya know, I've never seen a shooting star before.\" Almost immediately, a shootong star gleams across the sky as if she commanded it to happen. \n\nIS THIS REALITY WTF",
   "created_utc": 1693535033,
   "score": 111,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jymdrml",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jym8sb9",
   "message": "I was riding my bike around my apartment building as a kid. Ran into some bullies from school.\n\nNow as a kid I had a problem with shutting up, I had no idea how, so I pissed them off.\n\nSo I was riding my bike as fast as possible to get away from them (They were also on bikes) when I got something on the ground and went flying.\n\nA few things to note\n\n1) I was a tiny little girl like 70 pounds tops.\n\n2) I was poor, so my bike was used, a bit rusty and most importantly, missing handle bar grips\n\n3) the combination of speed, my weight, and whatever I hit, launched me more up than forward.\n\nSo I hit something, the bike fell on its side, and then I fell on the bike.\n\nFelt like it knocked the wind out of me and I knew it had to be bad because one of the bullied pedaled away as fast as possible, the other one helped me home and saying that this doesn't make us friends on the way. Left our bikes where they were. I didn't care, my mid section hurt where I landed.\n\nGot home and my mom turned to greet me and practically screamed that I was bleeding. \n\nI looked down and realized that I was bleeding a lot from my stomach and fainted.\n\nI woke up at the hospital later to find out that I had landed on to a bike handle which has impaled me through my mid section about halfway through me\n\nMissed my organs just barely and left me with a neat scar and a story no one believes until they see the scar.",
   "created_utc": 1693538785,
   "score": 237,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jymicoh",
   "message": "I have a tech company, and we are not in the best financial situation. We had a very big contract awaiting signature, well it won't get signed because the person responsible for the project was one of the 5 casualties from the Titan submarine ....",
   "created_utc": 1693543743,
   "score": 161,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylznq4",
   "message": "You know those big Fun Slides you ride down on the rug/carpet thing? When i was 8 the worker giving the push accidentally stood on my carpet and I went flying down all three parts and bumps of the slide on my back and arms. Ended up blistering and bubbling all over my hands and arms. Worst skin burns of my life and almost passed out. Next day on boardwalk, seagull crapped on my head.",
   "created_utc": 1693534738,
   "score": 137,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylyqh1",
   "message": "My epidural failed during the emergency c-section (I likely had listeria, my temp was 103+ and then the monitor for baby’s heartbeat went quiet type emergency) \n\nI had the epidural in place for awhile before, when we thought vaginal birth was still an option. No one in the OR believed me when I started telling them, then YELLING at them that I was numb anymore. It happened after they had gotten through all of the parts of me to get to baby, so I asked my husband if baby was out.  He said yes and the tiny control I had left departed and I was screaming at everyone that I could fucking feel them and their metal paddles in my body! RN by my head reassured me it was “just pressure” so my dumb self decided I was gonna gtfo. I planted my feet on the table and tried to lift myself to scoot away from the ppl who in my mind were now torturing me. Husband says it looked like a seance or a magic trick where the person covered by a sheet levitates off the table/bed. I made a huge mess, too, since I did it kinda fast. Sent a bowl full of bloody gauze flying up to hit the ground, tools clattered….I remember the poor anesthetist got yelled at while trying to give me propofol, then lights out finally.",
   "created_utc": 1693534350,
   "score": 2,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jym2n9c",
   "message": "I was born in the early 80s, and during that time they took newborns away to the nursery to be cared for away from the parents. When it was time for my mother to leave the hospital, they returned her baby to her and before my parents left the hospital, they needed to change the baby’s diaper. Well, when they removed the diaper they saw that the baby that they had was a girl when my mother had given birth to a boy. The hospital tracked down the parents who had me and got the babies back to their rightful parents. Some crazy shit.",
   "created_utc": 1693536023,
   "score": 250,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylz210",
   "message": "I (15 at the time) was traveling in a foreign country with my sister (26). We stayed at a local hotel. My period came and I got a little bit on the sheets the first night. Housekeeping came and cleaned as usual, nothing mentioned. \n\nA few days passed and when we were checking out, they asked to see our passports again. I guess we thought they just needed to double check their guest registry to update it. Once the passports were in his hand the front desk person (male) got really angry with us and began yelling at us for \"making mess\" in the hotel. At first we had no idea what he was talking about because we are very tidy travelers. He just kept yelling that we \"made trouble\" for him. He then proceeded to ask housekeeping to bring out the evidence and guess what, they proceeded TO BRING OUT THE UNWASHED SHEETS (wtf?). No idea where they had stored it. \n\nA nice young Australian couple witnessed the whole thing. The lady muttered \"it's just a few spots, can't you just wash it?\" He yelled at them to stay out of it and they fell silent. He even asked who made the mess (my sister said she did).\n\n15 year old me felt like I had done something criminally wrong. My sister \"paid him for the sheets\" and got our passports back so we could leave.",
   "created_utc": 1693534487,
   "score": 98,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylxhm7",
   "message": "Many years ago, I was walking my pug early in the morning.  Sun wasn’t quite up yet.  I was walking him along a main road.  Across the busy road was a junkyard with rotties in it guarding it.  All of the sudden I hear heavy breathing and look and a rottie got loose somehow and was full on galloping toward us across the busy road.  Just as I was going into “I’m protecting my pug, I’m taking this hit mode”….  a car comes along and full force hits the dog.  Maybe 40 mph because the driver most likely didn’t see him since it was mostly dark out still.  The dog flew 3/4 of the way down the block.  Cops came, driver stopped.  Dog wasn’t dead but I’m assuming it died eventually.  \n\nIt’s such a wild story to me when I’m telling people, but I’m so thankful that car accidentally stopped us from being attacked.",
   "created_utc": 1693533830,
   "score": 69,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylygfj",
   "message": "One time when I was a kid, I was laying in a sunbeam on the floor on a lazy Sunday.\n\nSo my dog came up and peed on my face.",
   "created_utc": 1693534232,
   "score": 68,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jylwhc3",
   "message": "Right after getting my tumor removed and my tonsils taken out, a couple days later I notice I’m swallowing a lot more than normal, go to the bathroom and just start spitting blood. And not like little drops, I mean I help my mouth open over the sink and it was just a constant stream.\n\n\nWent to urgent care, coughed up a blood clot about the size of a baseball, blood in my stomach-\n\nThe scabs from surgery opened. So now I’m terrified of eating or drinking red foods that would show up when I spit or such.\n\nI’m not normally queasy about blood, but I think the fact it was my own and it was a lot was concerning",
   "created_utc": 1693533420,
   "score": 65,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jym22c9",
   "message": "I was lying on the beach in the sand when I heard a soft thud next to me. I sat up and saw a half eaten peanut butter sandwich lying next to me in the sand. Wondering where it came from, I looked up and saw, to my surprise and horror, a flock of seagulls descending upon me and the sandwich one of them had just dropped. It was a mad frenzy of them fighting me and each other for the sandwich and me fighting them to get away. The whole thing was over in five seconds.",
   "created_utc": 1693535774,
   "score": 65,
   "submission_id": "166qk1f"
  },
  {
   "comment_id": "jymq2rp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166qk1f"
  }
 ]
}