{
 "submission_id": "166rx3e",
 "title": "What’s a dark family secret you learned when you got older? NSFW",
 "selftext": "",
 "created_utc": 1693527558,
 "permalink": "/r/AskReddit/comments/166rx3e/whats_a_dark_family_secret_you_learned_when_you/",
 "score": 198,
 "url": "https://www.reddit.com/r/AskReddit/comments/166rx3e/whats_a_dark_family_secret_you_learned_when_you/",
 "comments": [
  {
   "comment_id": "jylutss",
   "message": "I have a cousin. Well, he's not my cousin. My aunt had a life long friend who one day wanted do go on a trip somewhere with her husband and asked my aunt to babysit their 2 year old for a week. They didn't show up after a week. They wouldn't pick up the phone. The cops couldn't find them. They pretty much vanished. My aunt kept the kid and raised him",
   "created_utc": 1693532741,
   "score": 135,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyly43u",
   "message": "That my great grandma was raped repeatedly by her sister’s husband and that my grandpa might not have been my great grandpa’s son. She was only 15 when she got pregnant with him.  I can’t even imagine being a wife and mother at 15.  \n\nMy great grandmother was an amazing, kind, compassionate and loving woman.  I feel so blessed to have had her in my life until I was 16.  She taught me so much about strength, courage and perseverance.  My great grandfather was killed when my grandfather and his brother were very young (both under 5) and she picked up the pieces, opened her own restaurant and raised them alone which was unheard of and scandalized back then.  A woman owning a business really had people in that small town talking and not in a good way for a long time.  It’s so funny now because every time I go back there now people that knew her call her an angel on earth, her funeral was so packed the crowds were out in the parking lot, she touched so many lives.  She believed in second chances and hired a lot of ex cons to work in her restaurant.  She showed them love when so many treated them poorly because of their past.  \n\nShe lived every day by doing small things with great love.  If she knew a family was struggling financially she would tell them come on down to the diner for breakfast or supper or both.  She would have them order off the menu as anyone else and just not write them a ticket.  She hired a lot of single moms, she helped them get on their feet, if you were down she was going to be the one to lift you up whether you needed work, food, a hug or a good old fashioned kick in the ass.  The best compliment I have ever received was from that small town mayor over the summer (who’s wife was one of those single moms my great granny hired and now owns the diner) who said she would be so proud of you and the woman you’ve become.  You are just like her.  All I could say through my tears is I can never be like her, I can only hope to be 10% of the woman she was.  If I can do that then my life is a success.  I miss her so much.",
   "created_utc": 1693534091,
   "score": 239,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylva4u",
   "message": "I still haven't quite learned the secret but I was 12 and at my cousin's wedding when my great uncle so and so I had never heard of came up and introduced himself to me. My father who is very mild mannered rushed across the room and told him to back the fuck away if he wanted to keep his teeth. We've never talked about it again",
   "created_utc": 1693532927,
   "score": 212,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylwqv5",
   "message": "My mom used jar sauce once. We're Italian.",
   "created_utc": 1693533523,
   "score": 198,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylkcu4",
   "message": "I learned that my favourite uncle was a child-molesting monster after he died.  \n\nThanks for leaving me alone with him, mom!",
   "created_utc": 1693528373,
   "score": 234,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyljntf",
   "message": "I had a grandparent that got arrested for stealing A LOT of stuff from the retailer where they worked. Often the merchandise was given as gifts to various family members and everyone thought it was just a really good employee discount.",
   "created_utc": 1693528078,
   "score": 95,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylizmy",
   "message": "I discovered my father had a secret second family.",
   "created_utc": 1693527798,
   "score": 187,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylspuw",
   "message": "My grandfather who knew he had dementia confessed to the family that the man who everyone thought his father was in fact not his real father. His mother had been having an affair with another man while her husband was in a TB hospital. \n\nShe did end up going on to marry this other man when she was 80. Grandpa wanted us to know before he was too far gone with the dementia.",
   "created_utc": 1693531878,
   "score": 89,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylwir3",
   "message": "While my great grandmother was pregnant with my grandmother, my great grandfather fucked his wife's sister and got her pregnant as well.\n\nMy grandmother was born a few months before her half sister / cousin.\n\nWhen the second kid was born, they have her the SAME NAME as my grandmother.",
   "created_utc": 1693533435,
   "score": 92,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym01wc",
   "message": "My uncle is a sheriff. My aunt caught him cheating on her, literally, fucking a woman in their bed. She took his gun and shot him targeting his dick. He lost his balls and told everybody it was an accident so my aunt forgave him.",
   "created_utc": 1693534903,
   "score": 84,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylj4h3",
   "message": "My parents got married because they were pregnant with me, my mother had an affair with one of my high school teachers, my father was not the ogre my mother told us he was.",
   "created_utc": 1693527855,
   "score": 166,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylqdgh",
   "message": "My grandfather did hard time for moonshining.",
   "created_utc": 1693530934,
   "score": 64,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyltnp1",
   "message": "That everybody knew the family pedophile was a pedophile, that he assaulted most females in our family, and that knowing all of this I was still let around him (and then abused by him, and then nobody, including aforementioned assaulted women, believed me because who would molest a fat girl?)",
   "created_utc": 1693532261,
   "score": 155,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylvsk7",
   "message": "Grandma worked as a prostitute in a logging camp.",
   "created_utc": 1693533138,
   "score": 83,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylm7p0",
   "message": "My grandfather had severe bipolar disorder and alcoholism. He was horrifically abusive to my grandma and she’s still traumatized even in her near 90s",
   "created_utc": 1693529166,
   "score": 40,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylysjz",
   "message": "A few years ago, I was contacted by the friend of a woman who stated she was the daughter of my grandmother’s secret love child whom she had at 16 and gave up for adoption. I investigated and everything checked out.",
   "created_utc": 1693534375,
   "score": 45,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym36jl",
   "message": "Two that were clarified with time.\n\n1) My aunt married the dad of her daughter's boyfriend. Aka the ONE MAN OFF LIMITS. Making her daughter and her daughter's boyfriend step siblings. Then got furious when her daughter got pregnant and forced her to get an abortion. Now everyone wonders why I don't trust her or, really, any of my family.\n\n2) My dad and stepmom tried to raise my half brother as a second cousin. My dad slept with my baby sitter when I was less than a year old. Got her pregnant. Gave her money for an abortion. She showed back up with a baby boy when I was a year and a half and said \"have fun\" and disappeared \"for good\". My dad refused to raise his son and was going to adopt him to a family friend, but my great aunt didn't want him to leave the family, so she adopted him. Making my half brother also my second cousin by adoption. My dad and stepmom tried to pull the \"he's your cousin\" on me[along with \"it's extremely illegal to marry your cousins\", to avoid any severe \"accidents\"]. But surprise surprise I'm not a fucking idiot and knew he was my brother. He knew he was my brother too. And he knew that his own father rebuffed him. He was blamed for EVERYTHING that went wrong whenever he was around, even though he was a good but messed up kid[surprise surprise]. My brother and I were the black sheep of the family, neither of us were my stepmom's kids after all. He's still my favourite brother and I have 3 younger ones in total[I'm the oldest sibling] \n\nAnd to rub it in my family's fucking face. BOTH him and I graduated high school, something that neither of the precious younger brothers did. We fucking did it, in a family ran riot with teen pregnancy and high school drop outs. I even went to college for a bit before I dropped out[I plan to go back now that I know what I want to do]. My little brother is more of a man than my dad will ever be, no matter what my dad's small ego thinks. My brother even graduated after our great grandma, who adored us two black sheep the most, died. She died a few days after my graduation. I'm the oldest great grand baby. I'm so fucking proud of my brother and he deserves the world. He deserves better than the family he was given.\n\nAlso, he found and met his bio-mom. That went badly. Her entire family accused him of stealing stuff and causing problems, basically exactly what my dad and stepmom did to him. When he told me, my heart broke. He didn't deserve to be rejected by both his parents like that.",
   "created_utc": 1693536252,
   "score": 44,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylx7ia",
   "message": "My uncle’s two kids are actually his wife’s from her first marriage. I had NO idea. He passed on the business to these kids, they look like him, and he adores them.",
   "created_utc": 1693533713,
   "score": 34,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylkehe",
   "message": "Not my family but in high school we had a group of friends that were all different ethnicities, and we joked with this one guy that was almost 100% German that he was a nazi, until his grandfather died and he told us that his grandfather was an actual nazi that was hiding.",
   "created_utc": 1693528393,
   "score": 107,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym0nlu",
   "message": "My grandparents were likely a part of operation paperclip.\n\nThey've never confirmed it and I cut ties with them over a decade ago, but there were a lot of clues- like moving to America from Germany in the forties and immediately working in the aerospace sector. There was also some obvious racial prejudice.",
   "created_utc": 1693535163,
   "score": 54,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylivm6",
   "message": "Our aunt strangling us was not disaplin",
   "created_utc": 1693527752,
   "score": 48,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylk44y",
   "message": "There are actually a few cases of incest in my family.",
   "created_utc": 1693528271,
   "score": 67,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylq9jd",
   "message": "I guess it's finally time to talk about some stuff I stumbled upon in my families while getting older.\n\n\\- My biological grandmother lost half of one index finger due to an accident at home. For the time I was living with my biological mum, I've always been told that my granny got her finger caught in a metal door which got slammed because of a storm. Years later, I brought up the topic while enjoying time with my dad. He bursted out in laughter and told me that my granny actually lost the finger due to my grandpa making her hold wooden logs while he was splitting them with an axe. Turns out, he didn't only split the wood.\n\n\\- My dad once took my aunt under his wing after she was kicked out by her parents. This was apparently years before my parents started dating. Fast forward to like 2020, my dad tells me about all of this. He started talking about the few weeks he spent with my aunt together and that she had a huge crush on him and they eventually slept together a couple times. Some weeks later, I visited my aunt while my uncle was on a business trip. While having a bit too much wine, I brought up the topic nonchalantly. To my surprise, she confessed to me that she slept with my dad although I would've never asked her about it. I guess I'm the only one in the family who knows what happened between them.\n\n\\- My granddad-in-law who's married to my other grandma had a ONS on new year's eve while in a car with a female friend in the middle of a snow storm. I was told that their intercourse resulted in her becoming pregnant with a girl. My granddad kept all of this a secret over the following years while raising a daughter with my grandma. 18 years later, the girl showed up at his doorstep, with my grandma opening the door. Idk the details, but according to my dad, it was a shitshow. Funny enough, my aunt from that side and her half-sister seem to get along pretty well, although I've never met her myself.\n\nI have more fucked up stuff that happened, but I don't think it'd fit this question.",
   "created_utc": 1693530889,
   "score": 47,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyltgg6",
   "message": "Was told at 18 that my sister is only my half sister because my mom cheated and Dad stayed. Sister told me, never talked to parents about it",
   "created_utc": 1693532180,
   "score": 20,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylzrb4",
   "message": "My dad had a secret son that he never told us about till he reached out to me and he couldn’t deny it anymore. He never payed child support and avoided him and his mom his entire life. Poor guy never met his dad. But our dad was a very bad man so I don’t believe he missed out on too much besides a lot of childhood trauma.",
   "created_utc": 1693534778,
   "score": 18,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyluwti",
   "message": "I had always viewed my maternal grandmother as the kindest, most wonderful person growing up, and I saw her every weekend. I learned very recently that she physically abused my grandfather throughout their 60 years of marriage.",
   "created_utc": 1693532775,
   "score": 18,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym5ub8",
   "message": "My grandmother killed a man who was trying to rape her when she was young stuck a knife in just above his groin and pulled up i learned this way to young",
   "created_utc": 1693537426,
   "score": 18,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylneqi",
   "message": "My cousin was an \"accident\" from an affair my aunt had...",
   "created_utc": 1693529682,
   "score": 15,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylzom2",
   "message": "My mother had an affair and caused the divorce that she blamed on my father for 25 years. It explains why she would get so mad when my brother and i would go visit him after we got drivers license and cars. She was afraid he would tell us the truth, he never did, my grandmother spilled the beans.",
   "created_utc": 1693534748,
   "score": 16,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylzl0i",
   "message": "Found out great grandparents didn’t die young, they actually got divorced and left their children with family members.\n\nGreat grandpa went and had another family. Great grandma moved to the west coast (family is in Midwest).",
   "created_utc": 1693534708,
   "score": 15,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylvw1p",
   "message": "I found evidence of my mom’s affair at 15. That’s a fun secret to keep. I wasn’t grown up before that, but the ensuing divorce did the trick.",
   "created_utc": 1693533178,
   "score": 14,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylwdwh",
   "message": "My grandfather had committed suicide :(. He had disappeared and they found him after some days in his car.\n\nI also was an accident and my parents married when my mom got pregnant. I do not consider the last one a dark secret, found it amusing. It helps that I feel loved by my parents.",
   "created_utc": 1693533380,
   "score": 13,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym0dss",
   "message": "My mom was selling herself when/before she got pregnant with me, so my paternity is up for debate. My sibling told me this a couple years ago and had learned the information years prior from a longtime family friend.\n\nThere's a lot about my mom/family in general but this was definitely one of the bigger things to find out.",
   "created_utc": 1693535045,
   "score": 13,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylqohq",
   "message": "My grandfather had two families at the same time back in the 40s/50s. 6 kids total - he was busy.  With my grandmother he had 4 and with his mistress/neighbor he had 2. He was very grumpy in his later years.  We only learned it after his death so could never ask him about it.",
   "created_utc": 1693531056,
   "score": 13,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym2sfb",
   "message": "How my grandpa and the majority of the male members of my mom’s side of the family were involved in the Mafia.\n\nEdit: And when I found out just how many Nazis there were in my other Grandpa’s family",
   "created_utc": 1693536085,
   "score": 11,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylzdgf",
   "message": "That my mom used to get raped by her brother. He would forced her to blow him every day after school.",
   "created_utc": 1693534621,
   "score": 11,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylx98f",
   "message": "My grandfather liked to touch young girls.  They caught him in his golden years.  Spent three days in jail.  Family never talked about it, gave him his last days.  Was let out to die at home for some reason with terminal lung cancer.  Saw him on one of his last days on earth before he passed.",
   "created_utc": 1693533732,
   "score": 10,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym1by3",
   "message": "My great uncle was almost murdered by his wife that he met at a massage parlor. About a month after they were married, she left for good in the middle of the night and turned on the stove gas on the way out. Fortunately he woke up before it killed him. Yet he tried reconciling with her later on, but she wouldn't come back.",
   "created_utc": 1693535451,
   "score": 10,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyly0by",
   "message": "I am my own grandfather\n\nEdit:\n\nIts a Futurama reference",
   "created_utc": 1693534047,
   "score": 18,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylwymc",
   "message": "Found out my dad had another kid via an affair in his younger days with my mum.\n\nSo there's me, my half sister and one other child of his out there somewhere.\n\nGranted this happened in the 80s sometime based on my half sisters information,  I've concluded this child is either long gone, well hidden or chose not to come looking like my half sister did",
   "created_utc": 1693533610,
   "score": 9,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyly5fx",
   "message": "Grew up thinking my step dad was real dad. Then at 16 real dad somewhat got in picture.\nI always blamed him for not trying or being there.\n\nAt 25 mom passed away suddenly at 25 and was told from that side of the family that my mom “ignored” my bio father and family when I was born.\n\nTook it with a grain of salt that’s when they chose to tell me but none the leas",
   "created_utc": 1693534107,
   "score": 10,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylpp25",
   "message": "[deleted]",
   "created_utc": 1693530655,
   "score": 17,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylz7ty",
   "message": "Aunt and uncle both adopted at at young age ending up dating later in life for almost a year before they found out.",
   "created_utc": 1693534554,
   "score": 8,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym01ek",
   "message": "My dad was adopted. It was a sealed adoption. Nobody remaining alive knows what happened or why. My dad has a brother, though now we know not blood related. Nothing changed between the two and they’re closer than ever as they age.",
   "created_utc": 1693534898,
   "score": 9,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym0so6",
   "message": "My grandfather spent his first few months of life in an orphanage. No one knew that his mom was pregnant until the day she delivered, at which time she refused to acknowledge his existence, let alone hold him (hence the orphanage). She was forced by her parents to marry the father, and at just shy of 3 months, they retrieved him from the orphanage. Bio dad promptly ran off, a quickie divorce was completed, and his mom became engaged to a new guy. Then 3 days before the wedding, that guy found out she was pregnant again by a different guy. He still married her and claimed the baby as his own (something that the baby, my great-aunt, was never told - she still thinks he was her dad), but told her he was only going to raise one of her kids. So my grandfather was left to be raised by his grandparents and aunt, while his mom lived 8 miles away with her new family. It was all kept really quiet - at age 2, he was listed on census records as “border’s nephew”. His grandmother then passed away when he was 4, after which time he was primarily raised by his aunt while living in his grandfather’s home. \n\nHe was left with a completely warped sense of family and blatantly favored his firstborn, my mom - he showered her with all the love and attention he never got, while ignoring his younger 3 daughters. The minute my mom turned 18, he divorced my grandmother in order to marry his high school sweetheart, who he’d been cheating with for years. He rarely saw his daughters and refused to help my mom with college because “he had a new family now”, his 3 stepchildren. Totally warped.",
   "created_utc": 1693535224,
   "score": 8,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym2hvg",
   "message": "my great aunts swapped husbands around. my grandmother was a swinger. my cousin slept with my other cousin 🙃\n\nsometimes the southern jokes about incest are real 🙃",
   "created_utc": 1693535958,
   "score": 8,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyljj8p",
   "message": "My father cheated on her  23 years of marriage.  No in the family knew.  My uncle told me later",
   "created_utc": 1693528025,
   "score": 15,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym0fui",
   "message": "When I was 5 my dad wanted full custody of me. Even though he ran a business and was a workaholic. My mom said only if he pays for her to get implants. He paid it.  And died a year later at 33 and I went back with my mom. Bitch.",
   "created_utc": 1693535069,
   "score": 14,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylxt2m",
   "message": "My grandma spent the 80's strung out on benzos.\n\nShe straight up told me the last time I saw her--we both *knew* this was the last time I'd see her, but we hoped for another visit the next year (because given her condition, surviving a year was a long, but possible shot that she unfortunately did not make).",
   "created_utc": 1693533963,
   "score": 8,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym5wox",
   "message": "My step grandfather had four children from his first marriage, but his only daughter died when she was a teenager. There were pictures of her all over the house he shared with my grandmother, but he never talked about her, and my grandmother would only say that she died in a car accident. After his death, I was told the whole story. His then wife wanted her sent to a hospital in a larger city after the accident, but he insisted the small town hospital was perfectly fine. The small hospital didn’t have the resources to care for her and she died. He spent the last 35 years believing he was responsible for her death.",
   "created_utc": 1693537457,
   "score": 7,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylj9j8",
   "message": "My dad and mom had sex to create me.",
   "created_utc": 1693527912,
   "score": 38,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylyuj1",
   "message": "After my paternal grandmother died my parents started talking about a third daughter my uncle had that they’d never ever mentioned before. Around the same time I learned from my cousin that a mother and daughter on the other side of her family disappeared one day and have never returned and were likely murdered by the husband.",
   "created_utc": 1693534398,
   "score": 6,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym0i4r",
   "message": "My great grandfather committed suicide during an economic crash around 1908. He rented a hotel room and put towels in the bathtub before he sat in it and shot himself and he left a note apologizing to the maid. I found out when my mom told me a few years before she died. It really explained my grandma and how steely she was, wish I would be known. I would have understood how her attitude could be construed as cold but she was a survivor. Graduated in 3 yrs and became a teacher, as her sister did, so that they could support their mother, my great grandmother the widow.",
   "created_utc": 1693535097,
   "score": 6,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym1t1v",
   "message": "The real reason why I was never allowed to be alone with one of my uncles. He raped and abused his adopted daughter and spent 7 years in prison for it.",
   "created_utc": 1693535660,
   "score": 6,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym31va",
   "message": "Pretty sure grandpa had kids with other women than grandma, that he didn't acknowledge or take care of.  he's long dead now, but I'm scared to take a dna test lest half cousins pop up.",
   "created_utc": 1693536197,
   "score": 5,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym3kai",
   "message": "I only learned about it a few years ago, but it's alleged that my one aunt had an affair. She brought around this guy that none of us had ever met before. No introductions, no name, nothing. Just off in the corner with him, being all flirty, while her husband and kids are with the rest of us, grieving. This all played out at her sister's funeral.\n\nNot exactly dark, but definitely the most messed up thing I've heard about my family.",
   "created_utc": 1693536414,
   "score": 6,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylzyi1",
   "message": "My grandmother confessed to killing dozens of patients as a nurse in the 70's by overdosing them with morphine, including her own father. I also found out recently that there's another serial killer on her side of the family, don't remember the details but I think he strung his victims up and disemboweled them or something. Neither were ever caught.",
   "created_utc": 1693534863,
   "score": 20,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylto0r",
   "message": "that my stepfather fucked his sister..",
   "created_utc": 1693532264,
   "score": 5,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym0xik",
   "message": "My grandpa and a neighbor abused my aunt.",
   "created_utc": 1693535282,
   "score": 5,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym102l",
   "message": "Mu mom tricked my dad into havinga second child. That child was me.",
   "created_utc": 1693535311,
   "score": 5,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym7gmw",
   "message": "My great grandmother tried to kill a man. \n\nIn her town there was a peeping tom who would whistle a single note after he watched someone undress.  They called him \"The Whistler.\"\n\nOne night she was home alone and heard a whistle come from an open window. There was a bush outside the window. \n\nGranny set down the laundry she was carrying, calmly got her husband's pistol, and emptied the magazine into the bush. No blood trail, no body, but the town never heard from \"The Whistler\" again!",
   "created_utc": 1693538168,
   "score": 5,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyluz5t",
   "message": "One of my aunts is a product of my grandfather raping my grandmother, after she’d tried to leave him. She still left him, a few years later.",
   "created_utc": 1693532802,
   "score": 7,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylx6d9",
   "message": "I have a great aunt that ‘had a black boyfriend!!!’ when she was younger (40’s). \nI hate being white trash.",
   "created_utc": 1693533699,
   "score": 8,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym0hzn",
   "message": "my grandma and mom were both abused sexually and physically by their step fathers as children",
   "created_utc": 1693535096,
   "score": 4,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym35j0",
   "message": "I found 2 illegitimate child family members when I signed up for 23\u0026amp;me",
   "created_utc": 1693536240,
   "score": 5,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym6jq4",
   "message": "Not necessarily dark, but my old maid aunt, who was very pretty in her day, was engaged at some point in time when she was younger. Like engagement ring and planning stages and everything. \n\nI really wonder what happened.",
   "created_utc": 1693537747,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym6obt",
   "message": "My parents burnt down my family home when I was 5 years old to get the insurance money to move to a better neighborhood.",
   "created_utc": 1693537804,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylwl8q",
   "message": "There is mafia history in the family… ☹️",
   "created_utc": 1693533462,
   "score": 7,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym1amw",
   "message": "My grandpa wasn’t my biological grandpa. Bio grandfather hung himself in the barn before I was born.",
   "created_utc": 1693535435,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym41lg",
   "message": "That my father always had a mistress.",
   "created_utc": 1693536616,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym4k2f",
   "message": "Dad murdered someone and never got arrested.",
   "created_utc": 1693536845,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym5mrm",
   "message": "I had serious medical issues when I was very young. Apparently my aunt used this as an alibi when she cheated on her husband (my former uncle). She would say she was visiting me in the hospital when she was seeing her boyfriend aka my now uncle.",
   "created_utc": 1693537329,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym67hr",
   "message": "I learned that my grandfather murdered a man over a shared love interest in a Taiwanese stripper. It was a whole thing.",
   "created_utc": 1693537595,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym6dua",
   "message": "I have an \"illegitimate\" uncle. I found out doing Find a Grave online and went down a rabbit hole and saw my g-pa had a son from another woman. I asked my aunt about it and she just said \"they don't talk about it .\" I Googled him and he lives really close but I don't think I should bother him.",
   "created_utc": 1693537673,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym7swc",
   "message": "Apparently my Dad dated my Aunt first, despite my Mom having the biggest crush on him. When my Aunt told my Dad she was going to college and would not be his housewife, they broke up. The cousin who shared this with me also mentioned that my Dad is probably my Aunt's first time. I don't know any dates, so therefore have no clue when he moved onto my Mom, but my family has always held a strained perspective of him and I wonder if this is why.",
   "created_utc": 1693538326,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym7vzr",
   "message": "I had an aunt that nobody knew existed because she was put into an asylum once they realised she was autistic.\n\nNone of her later siblings knew about her.\n\nFirst known autistic in my family and being autistic myself my heart broke for her.",
   "created_utc": 1693538365,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym80ig",
   "message": "23andMe exposed all our grandparents secrets",
   "created_utc": 1693538422,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym82bk",
   "message": "I was raised in a cult. I believe my great (x2) grandfather trafficked my great (x2) grandmother. The wagon party left in the middle of the night and took her with them. She was 16.",
   "created_utc": 1693538445,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym8grr",
   "message": "My Great uncle Han. Family says he shot first 😔",
   "created_utc": 1693538633,
   "score": 3,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jymaftz",
   "message": "My mom was pregnant when she married my dad. And it wasn’t his. This was later WW II. The baby’s father was a soldier who was ( allegedly) killed in a motorcycle accident on his way back to his base. Dad was a widower with two pre teens who badly needed a mother. He promised to raise the baby as his own. They were married, and the baby was “premature” but only lived for a couple of months. They went on to have four children, of which I am one.",
   "created_utc": 1693539569,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jymc2tp",
   "message": "The priest in our family was one of *those* priests. He’s dead now, and if there’s a hell, he’s in it.",
   "created_utc": 1693540388,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jylur48",
   "message": "My cousin ate her twin in the womb and then they later had a second kid so I can’t imagine what that dynamic does (if the kids even know about it!)",
   "created_utc": 1693532710,
   "score": 5,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym11pn",
   "message": "Grandma was a whore.",
   "created_utc": 1693535330,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym2gzv",
   "message": "My brother had a different father. Originally told my grandfather raped my mother,  then told it was this guy that kept passing through.",
   "created_utc": 1693535947,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym2pmn",
   "message": "1.I *think* my cousins experienced sexual abuse between siblings. \n2. My great grandpa was a bastard of the church, don’t know who his dad is and his mom was anonymous on the birth certificate (this was 1800s in Italy). \n3. My grandpa thinks he’s royal because of the shade around who his grandma is. \n4. My grandma was illegal immigrant and literally ran away from immigration as a child and went by a surname for a while.",
   "created_utc": 1693536052,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym3nzo",
   "message": "My eldest cousin is technically a bastard child. Not sure how many of the family knows but Noone says anything to anyone about it",
   "created_utc": 1693536457,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym44sk",
   "message": "My mom and each of her 3 siblings have different dads….. they were raised to believe they were from the same 2 parents. Both had passed away by the time we discovered this using 23 \u0026amp; me. Lots of questions \u0026amp; no answers.",
   "created_utc": 1693536656,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym4b5e",
   "message": "My brother had a weird foot fetish thing and tried to masturbate on my younger cousins feet…",
   "created_utc": 1693536734,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym4x82",
   "message": "Heterosexual, upstanding, male family member was a “flasher,” who got arrested for it (with records expunged), and was also secretly a “transvestite”. Had this been made publicly known it would have definitely cost the man his career.\n\nNowadays, I wonder whether if he had been born, say, 60 years later, would he have felt such a need to be secretive about the cross dressing? Would he still have felt any strong compulsion to be an exhibitionist? \n\n🤷🏻‍♀️",
   "created_utc": 1693537011,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym5hzq",
   "message": "I have a cousin who my aunt gave up for adoption a few weeks after he was born, whom I’ve never met. My mom didn’t tell us kids until we were in our 20s. My aunt died before I was born, and I was named after her.",
   "created_utc": 1693537269,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym6ann",
   "message": "My great grandfather was murdered because he was German.",
   "created_utc": 1693537634,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym6bmx",
   "message": "That my favorite uncle who was found dead on the floor in his early 40’s due to a “heart attack” in 1994 had a spilt bottle of bleach next to him and bleach possibly coming out of his mouth when he was found.  That detail was spared my whole childhood and we were always told it was a tragic heart attack.  I was 4 when he died.  A couple years back in my 30’s, my mom casually mentioned to my wife and me that it maybe wasn’t really a heart attack and said my grandad told her about the bleach. She’s the type of person that thinks it’s indecent to even talk about or especially gossip about suicide, so I know she wouldn’t make that up about her brother.",
   "created_utc": 1693537645,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym703o",
   "message": "I already knew my mum was sexually assaulted as a teenager, but later learned that in a separate incident, she was gang-raped, still as a teenager.",
   "created_utc": 1693537959,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym73yi",
   "message": "My grandma's long term boyfriend was killed by a camel at the zoo. It grabbed the back of his head and shook him to death.",
   "created_utc": 1693538007,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym754b",
   "message": "I learned when I grew older that my grandfather and my father, who was an extremely devout Christian, was a closeted homosexual during this time in the 1950s. They had to hide their relationship from everyone, but they were always very close. I always wondered why when i was younger, but now i understand.",
   "created_utc": 1693538023,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym77cg",
   "message": "My dad had a kid with someone that wasn’t my mom.  Grandparents paid the family to leave.  Everyone on my dads side knew but none of my siblings or mom knew until my dad died.  So I have a half sister out there somewhere that’s probably 15 years older than me",
   "created_utc": 1693538052,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym7jfa",
   "message": "My uncle SA’d his wife’s sister. Wife and kid don’t know. He’s soon to be on his deathbed. The sisters have a strained relationship and one will never know why.",
   "created_utc": 1693538204,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym7qnp",
   "message": "Cousin whatshisface didn’t really kill himself.  He’s just kinda weird and my mom wanted me to stop asking about him to my aunt.  I just wanted to say hi to him, I didn’t really understand that he was the black sheep of the family as they say and I needed to learn their ways of ostracizing him.  I just was wondering why everyone was so mean to him bc of his looks like he was just pudgier than his brother and not an athlete but don’t hate the kid for it ya know?  He turned out to be kind of a creep as an adult, but I was still shocked to find him on Facebook .. a picture of him as a GROWN MAN when I thought he had been dead for over a decade!  I always thought maybe if he wasn’t treated so poorly as a child he might not have turned out a creep(he asked my sister to take professional naked photos of her for his “portfolio” when we reconnected) \n\nI asked them so many questions about what made him bad why can’t I just ask about him.. until I guess my Kim got sick of me bringing it up and came up with the false suicide solution.  He would go stay with his dad during family gatherings bc they obv treated him poorly.  The only reasons my mom could tell me that made him bad were that he was a teenager working at price club and his mother caught him shoplifting items like kleptomaniac behavior.  Nonsensical items like million count box of toothpicks or package of socks in the wrong size and style.  Clearly he just needed a therapist.  \n\nSorry this was all over I’m writing this late at night lol",
   "created_utc": 1693538297,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym83ff",
   "message": "My mom fucked a 20 something bag boy from our local grocery store when she was married to my dad. In my mind he helped her with the groceries and she just shoved him in the trunk. 🤷🏻‍♀️",
   "created_utc": 1693538460,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym8rng",
   "message": "My mom's brother raped my mom and her sister throughout their childhood. Then, had the audacity to write my mom a letter shaming her for cheating on my dad and getting a divorce because they were \"ultimate sins\".",
   "created_utc": 1693538777,
   "score": 2,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym9yet",
   "message": "That my maternal great grandmother was kidnapped at 14 but her husband, they had something like 16 kids. They were so poor they lived in a one room tent for years with most meals being snake, squirrel, and fish they caught. No one talks about it in the family.",
   "created_utc": 1693539338,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jym9zds",
   "message": "My grandmother was a church going lady of impeccable character.  Two decades after she had passed, her daughter, my mother, had a DNA test done and we found out grandma had cheated.  Grandpa was not grandpa.  He had died 4 decades ago and never liked his daughter.  It suddenly became obvious why.",
   "created_utc": 1693539351,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyma329",
   "message": "That my mother, through NO fault of her own, is a narcissist.  Which does not absolve her of guilt, she’s still in an awful person.   But because of her FATHER, who was an absolutely garbage bag of a human being on so many levels *that I can’t even comprehend the entirety of what I am AWARE OF*, plus her mother (rest her soul), who was spineless and helpless and neglectful, but I do think WISHED or hoped to be better (despite achieving it).  Who fucked their children up so bad that I realized not having any was better than passing THAT on.   And my little sister is one as well, through OUR fault (for cumulatively feeding the monster) as a family, as a whole, because she was innocent and the baby.  Who would literally light me (her own sister) on fire if for only that she felt a chilly breeze.   \n\nAnd I have my first actual psychiatric appointment next week to deal with the absolute dumpster fire that is all of this, because it’s gotten to the point that I can’t cope.   \n\nSometimes the dark family secrets aren’t NSFW; sometimes the simplest of dark family secrets are worse:  systemic psychological/emotional neglect that spans generations, and/or… indifference.  \n\nIndifference is my Achilles heel.",
   "created_utc": 1693539400,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyma3ku",
   "message": "When my grandmother was 14 her mom died of cancer and the night she died her father shot himself leaving her alone. Didn't know until my late 20's.",
   "created_utc": 1693539407,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jymajjd",
   "message": "That my male cousin (~20 years older than me) that came to live with us when I was about 11 was a child molester.  When my mom told me when I was in my young 20’s she said it was fine because he liked little boys not girls.  Later, adult me, becomes a probation officer with an adult sex offender case load and had to explain to my mom that she made a really bad decision and put her kids in jeopardy.  Still pisses me off!",
   "created_utc": 1693539620,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jyman86",
   "message": "It wasn't a secret so much but my uncle had 2 sons called Shane. It took me a few years to realize the kid from his second marriage was his second wife's first child to someone else and obviously named such well before my uncle showed up. \nBut a real one is that I have a nefew/half brother. Yep that's right my father's a mutt and should be hunted on an island. There's a few other stories and I'm not gonna get into things",
   "created_utc": 1693539670,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jymczbk",
   "message": "I’m not entirely sure of the relation (he was, like, my grandmother’s cousin), but apparently one of my relatives murdered his family, got away with it, then married his pregnant secretary, who, shortly after, gave birth to a son who looked exactly like him and who was named after him, but whom they always insisted wasn’t actually his biological son.",
   "created_utc": 1693540847,
   "score": 1,
   "submission_id": "166rx3e"
  },
  {
   "comment_id": "jymfo5m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "166rx3e"
  }
 ]
}