{
 "submission_id": "1674arj",
 "title": "What product was so poorly designed that you suspect the team that made it, never used the product?",
 "selftext": "",
 "created_utc": 1693567027,
 "permalink": "/r/AskReddit/comments/1674arj/what_product_was_so_poorly_designed_that_you/",
 "score": 254,
 "url": "https://www.reddit.com/r/AskReddit/comments/1674arj/what_product_was_so_poorly_designed_that_you/",
 "comments": [
  {
   "comment_id": "jynsfis",
   "message": "My refrigerator has a water filter that cannot be changed without turning off the supply... Which is behind the refrigerator. So you have to pull the multi hundred pound fridge (with all the food and such) out to turn the water off before you can change the water filter.. The old Maytag it replaced had no such requirement.",
   "created_utc": 1693572794,
   "score": 27,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqw0d",
   "message": "My new iron. Has a restart if you tip it over after it’s timed out. So if you accidentally leave it plugged it and it gets knocked over by accident (pet or child bumps the board, wind knocks something over knocking the iron over) it starts up while face down.",
   "created_utc": 1693572104,
   "score": 245,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhuzw",
   "message": "Those sliding shower doors with an overlapping section that is impossible to clean without taking the whole door off.",
   "created_utc": 1693567653,
   "score": 130,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynt3so",
   "message": "Software drivers for basically any HP printer made in the last three decades",
   "created_utc": 1693573083,
   "score": 131,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynlbb2",
   "message": "The perforated corner of a Kraft Mac \u0026amp; cheese box",
   "created_utc": 1693569444,
   "score": 74,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynl6ta",
   "message": "The Bluetooth app connectivity for my washing machine (Didn't really want that feature, but it was a last minute substitution).  \n\n\nIf the wash cycle takes longer than the initial estimate the start time changes rather than the time remaining estimate.    \n\n\nI just don't bother with the app.",
   "created_utc": 1693569381,
   "score": 117,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhnwm",
   "message": "Most of todays can openers.",
   "created_utc": 1693567547,
   "score": 92,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynrkph",
   "message": "I remember a couple years back there was a push for “smart diapers”. It was basically a diaper with a little tab on it that would tell when it was soiled. I have 3 kids, 2 of which are still in diapers, and one wears them for nighttime. I probably change 20+ diapers a day.\n\nI don’t know any Mom who would want to pay more for smart diapers, to tell them what they already know. \n\nMy thought when they came out. They are definitely not changing a lot of diapers. Probably not even a parent.",
   "created_utc": 1693572425,
   "score": 203,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynmj0x",
   "message": "Cling Wrap.  It clings to everything except what you want it to...",
   "created_utc": 1693570045,
   "score": 37,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynh51l",
   "message": "My new £1000 washing machine. Does a great job washing clothes and is all singing and all dancing. But all this additional stuff adds complexity and is an absolute bastard to clean. The detergent draw has all this fancy stuff my old didn’t and I just get so much mold growing. Have to take it all apart and clean it so often. It’s so annoying.",
   "created_utc": 1693567252,
   "score": 189,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynpaju",
   "message": "The web site for the library in our city. Definitely made or customized by consultants that don't use our city's library.",
   "created_utc": 1693571370,
   "score": 86,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynspeb",
   "message": "All iterations of Skype after Microsoft bought it.",
   "created_utc": 1693572912,
   "score": 128,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynjex4",
   "message": "Remember that juicer meant to be used to squeeze out those bags? It was like $400, plus the cost of the bags, but you could just squeeze them out by hand.",
   "created_utc": 1693568479,
   "score": 222,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynjbnd",
   "message": "I bought a hair trimmer from Philips that has the size guide comb built in. It has a ring in the handle to change the length settings with no lock - absolutely impossible to use normally without changing the cutting length half way through.",
   "created_utc": 1693568433,
   "score": 86,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzvtd",
   "message": "Baby wipes.\n\nHey, you know when a good time to struggle with opening a package that says it has perforations but really doesn't? \n\nYou want one? Here's a chunk of 20. \n\nYou want a bunch? Here's a tiny ripped corner.\n\nYou have 10 left on a trip and need to conserve? Too bad mother fucker, here's the rest of the pack. Get your tired ass to CVS.",
   "created_utc": 1693575852,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynx2tl",
   "message": "way too many carrying products (luggage, boxes, bags, laundry baskets) have put more emphasis on comfort/softness the top of the handle, rather than the underside, which is th side that is forced into your hand with the weight of whatever is in your box/bag/basket.",
   "created_utc": 1693574728,
   "score": 42,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqoqr",
   "message": "New Reddit",
   "created_utc": 1693572011,
   "score": 154,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyny9z4",
   "message": "Okay, bear with me here... all these grocery items in plastic that have a ziploc closer as well.\n\nThe idea is great! Open, use, reseal.\n\nBut in my experience (and I'm not exactly old and weak) these don't work as planned. Frequently they have the perforated section you can rip off, supposedly to allow access to the ziploc portion. Many times there's glue holding pieces together and the perforated section never seems to extend past that.\n\nEven when not glued, the ziploc is apparently held together by the weak nuclear force and will NOT come apart. There's never enough plastic to pull on, and when there is it's approximately as strong as wet tissue paper. So it just rips.\n\nIMHO the worst offenders are deli meats, but it's been tortillas and more that have flummoxed me. Far too often I just take scissors to the package and then 'seal' it later with a clothes pin.",
   "created_utc": 1693575206,
   "score": 127,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqjs8",
   "message": "monistat. in the year 2023 how in the lawds name,\nis this the method of treating yeast infections. women deserve better",
   "created_utc": 1693571948,
   "score": 61,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyntkk6",
   "message": "Single ply toilet paper",
   "created_utc": 1693573280,
   "score": 64,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynpsp4",
   "message": "An app: Duolingo. The people who made it claimed they wanted to make an app that can get you to B2 CEFR level in your target language.\n\nOne of the creators used it AFTER the app  was made (which is a bit sketchy) to learn Spanish. After he finished the course, a reporter asked him ¿Hablas español? (Do you speak Spanish?). \n\nHe couldn't understand what he was being asked and asked the reporter to repeat.\n\nB2 level. Suuureee, Duo.",
   "created_utc": 1693571603,
   "score": 161,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynxrzn",
   "message": "My mom's had three wheelchairs.\n\nThey all suck.  The brake lever mechanism invariably interferes with the footrests.  On her current one, the brake lever mechanism is curved, so it's pretty good.  I think it could still be better.\n\nI'm surprised they're not better.  I definitely feel like given my experience I could design a much better wheelchair than anything on the market under $1,000.00.",
   "created_utc": 1693575005,
   "score": 20,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvwve",
   "message": "The mouse for a Mac where the charger is on the bottom…",
   "created_utc": 1693574261,
   "score": 78,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynx8d9",
   "message": "All of the «tear here» markings on coffee packs, juice cartons, etc., mark the strongest/most tear resistant part of the package.",
   "created_utc": 1693574791,
   "score": 34,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynprqy",
   "message": "Youtubes UI on their website",
   "created_utc": 1693571590,
   "score": 41,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynrxtc",
   "message": "Some of the laws politicians make.",
   "created_utc": 1693572585,
   "score": 30,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynuil0",
   "message": "That weird watermelon slicer tool. Broke the first time I used it.",
   "created_utc": 1693573682,
   "score": 14,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynxmtl",
   "message": "Blister packaging.",
   "created_utc": 1693574948,
   "score": 12,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyntter",
   "message": "Baby and toddler clothing",
   "created_utc": 1693573387,
   "score": 23,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynwhle",
   "message": "the toilets whose tanks that are wider at the top than the bottom, making it impossible for the toilet seat to be lifted and lean against it",
   "created_utc": 1693574486,
   "score": 32,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo2p42",
   "message": "Cereal bags - why are they not zip lock yet?!?!",
   "created_utc": 1693576955,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhjs1",
   "message": "New Coke.",
   "created_utc": 1693567482,
   "score": 49,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqzbk",
   "message": "Nintendo Power Glove",
   "created_utc": 1693572148,
   "score": 31,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynrxc3",
   "message": "Line 6 Spider amps.\n\nNobody that has functioning ears can enjoy the nightmarish sounds that come from those horrid little amps",
   "created_utc": 1693572579,
   "score": 27,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynt1hr",
   "message": "Nba2k.\n\nThere's no way.",
   "created_utc": 1693573056,
   "score": 9,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynw6o8",
   "message": "McDonald's ordering screen thing.",
   "created_utc": 1693574365,
   "score": 21,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhxrc",
   "message": "Reddit mobile app",
   "created_utc": 1693567696,
   "score": 45,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvvdo",
   "message": "The shift on a Nissan Pathfinder. Trying to get it into neutral is like a carnival game. Almost destroyed it trying to enter a car wash.",
   "created_utc": 1693574245,
   "score": 7,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvxnf",
   "message": "The current NHS system. I bet all the ones in charge have private health care.",
   "created_utc": 1693574270,
   "score": 8,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvwih",
   "message": "The Apple Mac chargeable cordless mouse. Cos you can't use it while it's charging. Dumbasses",
   "created_utc": 1693574257,
   "score": 28,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzemn",
   "message": "I’ll add a comment as someone said something that made me think.\n\nStreaming services search engines?  You can literally have 10k to 50k things to watch, but there is absolutely no way to do an in depth search.\n\nDoesn’t have to be through a mobile app, maybe an online connection through a web site.  But if I want to find a show that was running in the late 90s and I know it was science fiction, why can’t I do that?\n\nSo much content I might want to watch but can’t find it.",
   "created_utc": 1693575659,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynxpiu",
   "message": "I just bought a waterproof cargo bag for the roof of my car that was fairly expensive \n\nThe Velcro that keeps the zipper protected was just GLUED ON, not stitched\n\nThe very first time I opened the bag all the Velcro came off because the attraction to itself was stronger than the adhesive bond to the vinyl bag\n\nIt’s like there was absolutely zero product testing, but I’m sure it was 5 cents cheaper to make it glued rather than stitched. How could something like this have ever been allowed to leave the factory?",
   "created_utc": 1693574977,
   "score": 6,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyny5ah",
   "message": "I wager that every coffin maker has never used one.",
   "created_utc": 1693575155,
   "score": 6,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzoit",
   "message": "My kitchen trash can. It is one sold by Glad specifically for their bigger, extra strong 13 gallon trash bags. It is not particularly cheap.\n\nIt looks good, but the design of it is what you might expect if you told aliens what a trash can is and they designed one without ever seeing it. How it holds the bag basically causes you to lose 4 gallons of capacity and have to risk tearing the bag or spilling its contents every time you go to remove it. It also has a trash bag holder that is so narrow, you have to feed it trash bags one at a time, completely defeating the point. And if you try to compact the trash a bit, you're almost guaranteed to tear the \"tear resistant\" bag.\n\nSuch a poor design.",
   "created_utc": 1693575770,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzlna",
   "message": "Womens underwear.  \n\n\nThe part that is supposed to get dirty is never far enough forward to catch what its supposed to catch.",
   "created_utc": 1693575737,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynufbr",
   "message": "Destiny 2",
   "created_utc": 1693573644,
   "score": 4,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo1en5",
   "message": "Healthcare.",
   "created_utc": 1693576455,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynr0hy",
   "message": "Neck ties",
   "created_utc": 1693572163,
   "score": 13,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynt59r",
   "message": "Every lawn mower I’ve ever used.",
   "created_utc": 1693573102,
   "score": 12,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyngxxv",
   "message": "Sometimes reddit.",
   "created_utc": 1693567146,
   "score": 8,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynyxjt",
   "message": "Modern fans. \n\nI remember as a kid they were all solid AF, mostly metal, moved tons of air, and they were quiet or at least made a consistent and constant steady sound. \n\nNow they are all shitty plastic, crap at moving volumes of air, weak, with cheap feet and handles that break, vibrate all over the place, make high-pitched wines, irregular noise, and otherwise just suck. And you can't even pay to win there are no high-end models they are all trash.",
   "created_utc": 1693575469,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzhky",
   "message": "Every single asshole lighting manufacturer that makes the terminals on the light fittings they designed too small for the standard Fucking cabling that the country the lights are sold in uses by regulation. \n\nEvery single fitting requires a junction before they are terminated into the junction in the light fitting \n\nEvery single manufacturer, and the more expensive the fitting the worse the install. I’m half convinced it’s a conspiracy to justify the cost like oh look how long it takes the electrician to install very complex.\n\nFucking cunts.",
   "created_utc": 1693575693,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzii2",
   "message": "Most garden hoses - wouldn’t you think that the first design requirement would be that it work without kinking?",
   "created_utc": 1693575703,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzrde",
   "message": "*Clippy* in MS Office.",
   "created_utc": 1693575802,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo0wu1",
   "message": "The door knobs my wife just bought, actual knob is wider diameter than bit that screws to door so you cant get the screws in unless they're well on the piss, knob not removable..... Idjidts..",
   "created_utc": 1693576259,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo1x95",
   "message": "Some road intersections make me wonder if the engineers have actually ever driven a vehicle.",
   "created_utc": 1693576659,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo3mqt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1674arj"
  }
 ]
}