{
 "submission_id": "1674arj",
 "title": "What product was so poorly designed that you suspect the team that made it, never used the product?",
 "selftext": "",
 "created_utc": 1693567027,
 "permalink": "/r/AskReddit/comments/1674arj/what_product_was_so_poorly_designed_that_you/",
 "score": 93,
 "url": "https://www.reddit.com/r/AskReddit/comments/1674arj/what_product_was_so_poorly_designed_that_you/",
 "comments": [
  {
   "comment_id": "jynsfis",
   "message": "My refrigerator has a water filter that cannot be changed without turning off the supply... Which is behind the refrigerator. So you have to pull the multi hundred pound fridge (with all the food and such) out to turn the water off before you can change the water filter.. The old Maytag it replaced had no such requirement.",
   "created_utc": 1693572794,
   "score": 42,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqw0d",
   "message": "My new iron. Has a restart if you tip it over after it’s timed out. So if you accidentally leave it plugged it and it gets knocked over by accident (pet or child bumps the board, wind knocks something over knocking the iron over) it starts up while face down.",
   "created_utc": 1693572104,
   "score": 224,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhuzw",
   "message": "Those sliding shower doors with an overlapping section that is impossible to clean without taking the whole door off.",
   "created_utc": 1693567653,
   "score": 170,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynt3so",
   "message": "Software drivers for basically any HP printer made in the last three decades",
   "created_utc": 1693573083,
   "score": 213,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynlbb2",
   "message": "The perforated corner of a Kraft Mac \u0026amp; cheese box",
   "created_utc": 1693569444,
   "score": 148,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynl6ta",
   "message": "The Bluetooth app connectivity for my washing machine (Didn't really want that feature, but it was a last minute substitution).  \n\n\nIf the wash cycle takes longer than the initial estimate the start time changes rather than the time remaining estimate.    \n\n\nI just don't bother with the app.",
   "created_utc": 1693569381,
   "score": 22,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhnwm",
   "message": "Most of todays can openers.",
   "created_utc": 1693567547,
   "score": 205,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynrkph",
   "message": "I remember a couple years back there was a push for “smart diapers”. It was basically a diaper with a little tab on it that would tell when it was soiled. I have 3 kids, 2 of which are still in diapers, and one wears them for nighttime. I probably change 20+ diapers a day.\n\nI don’t know any Mom who would want to pay more for smart diapers, to tell them what they already know. \n\nMy thought when they came out. They are definitely not changing a lot of diapers. Probably not even a parent.\n\nEdit: What I mean is an electronic tab on the diaper that notifies you when it’s soiled. Not the wetness indicator.",
   "created_utc": 1693572425,
   "score": 114,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynmj0x",
   "message": "Cling Wrap.  It clings to everything except what you want it to...",
   "created_utc": 1693570045,
   "score": 172,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynh51l",
   "message": "My new £1000 washing machine. Does a great job washing clothes and is all singing and all dancing. But all this additional stuff adds complexity and is an absolute bastard to clean. The detergent draw has all this fancy stuff my old didn’t and I just get so much mold growing. Have to take it all apart and clean it so often. It’s so annoying.\n\nEdit: everyone telling me to ‘leave the drawer and door open’….yeah I get that. But that’s why I answered the original question. Stupid design that I have to leave the doors open when not in use. It’s dangerous (with kids and cats!) and it gets in the way. Stupid design",
   "created_utc": 1693567252,
   "score": 117,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynpaju",
   "message": "The web site for the library in our city. Definitely made or customized by consultants that don't use our city's library.",
   "created_utc": 1693571370,
   "score": 179,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynspeb",
   "message": "All iterations of Skype after Microsoft bought it.",
   "created_utc": 1693572912,
   "score": 42,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynjex4",
   "message": "Remember that juicer meant to be used to squeeze out those bags? It was like $400, plus the cost of the bags, but you could just squeeze them out by hand.",
   "created_utc": 1693568479,
   "score": 49,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynjbnd",
   "message": "I bought a hair trimmer from Philips that has the size guide comb built in. It has a ring in the handle to change the length settings with no lock - absolutely impossible to use normally without changing the cutting length half way through.",
   "created_utc": 1693568433,
   "score": 96,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzvtd",
   "message": "Baby wipes.\n\nHey, you know when a good time to struggle with opening a package that says it has perforations but really doesn't? \n\nYou want one? Here's a chunk of 20. \n\nYou want a bunch? Here's a tiny ripped corner.\n\nYou have 10 left on a trip and need to conserve? Too bad mother fucker, here's the rest of the pack. Get your tired ass to CVS.",
   "created_utc": 1693575852,
   "score": 21,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynx2tl",
   "message": "way too many carrying products (luggage, boxes, bags, laundry baskets) have put more emphasis on comfort/softness the top of the handle, rather than the underside, which is th side that is forced into your hand with the weight of whatever is in your box/bag/basket.",
   "created_utc": 1693574728,
   "score": 197,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqoqr",
   "message": "New Reddit",
   "created_utc": 1693572011,
   "score": 155,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyny9z4",
   "message": "Okay, bear with me here... all these grocery items in plastic that have a ziploc closer as well.\n\nThe idea is great! Open, use, reseal.\n\nBut in my experience (and I'm not exactly old and weak) these don't work as planned. Frequently they have the perforated section you can rip off, supposedly to allow access to the ziploc portion. Many times there's glue holding pieces together and the perforated section never seems to extend past that.\n\nEven when not glued, the ziploc is apparently held together by the weak nuclear force and will NOT come apart. There's never enough plastic to pull on, and when there is it's approximately as strong as wet tissue paper. So it just rips.\n\nIMHO the worst offenders are deli meats, but it's been tortillas and more that have flummoxed me. Far too often I just take scissors to the package and then 'seal' it later with a clothes pin.",
   "created_utc": 1693575206,
   "score": 185,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqjs8",
   "message": "monistat. in the year 2023 how in the lawds name,\nis this the method of treating yeast infections. women deserve better",
   "created_utc": 1693571948,
   "score": 61,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyntkk6",
   "message": "Single ply toilet paper",
   "created_utc": 1693573280,
   "score": 64,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynpsp4",
   "message": "An app: Duolingo. The people who made it claimed they wanted to make an app that can get you to B2 CEFR level in your target language.\n\nOne of the creators used it AFTER the app  was made (which is a bit sketchy) to learn Spanish. After he finished the course, a reporter asked him ¿Hablas español? (Do you speak Spanish?). \n\nHe couldn't understand what he was being asked and asked the reporter to repeat.\n\nB2 level. Suuureee, Duo.",
   "created_utc": 1693571603,
   "score": 161,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynxrzn",
   "message": "My mom's had three wheelchairs.\n\nThey all suck.  The brake lever mechanism invariably interferes with the footrests.  On her current one, the brake lever mechanism is curved, so it's pretty good.  I think it could still be better.\n\nI'm surprised they're not better.  I definitely feel like given my experience I could design a much better wheelchair than anything on the market under $1,000.00.",
   "created_utc": 1693575005,
   "score": 124,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvwve",
   "message": "The mouse for a Mac where the charger is on the bottom…",
   "created_utc": 1693574261,
   "score": 87,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynx8d9",
   "message": "All of the «tear here» markings on coffee packs, juice cartons, etc., mark the strongest/most tear resistant part of the package.",
   "created_utc": 1693574791,
   "score": 60,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynprqy",
   "message": "Youtubes UI on their website",
   "created_utc": 1693571590,
   "score": 15,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynrxtc",
   "message": "Some of the laws politicians make.",
   "created_utc": 1693572585,
   "score": 30,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynuil0",
   "message": "That weird watermelon slicer tool. Broke the first time I used it.",
   "created_utc": 1693573682,
   "score": 183,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynxmtl",
   "message": "Blister packaging.",
   "created_utc": 1693574948,
   "score": 15,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyntter",
   "message": "Baby and toddler clothing",
   "created_utc": 1693573387,
   "score": 23,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynwhle",
   "message": "the toilets whose tanks that are wider at the top than the bottom, making it impossible for the toilet seat to be lifted and lean against it",
   "created_utc": 1693574486,
   "score": 126,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo2p42",
   "message": "Cereal bags - why are they not zip lock yet?!?!",
   "created_utc": 1693576955,
   "score": 164,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhjs1",
   "message": "New Coke.",
   "created_utc": 1693567482,
   "score": 49,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynqzbk",
   "message": "Nintendo Power Glove",
   "created_utc": 1693572148,
   "score": 31,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynrxc3",
   "message": "Line 6 Spider amps.\n\nNobody that has functioning ears can enjoy the nightmarish sounds that come from those horrid little amps",
   "created_utc": 1693572579,
   "score": 27,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynt1hr",
   "message": "Nba2k.\n\nThere's no way.",
   "created_utc": 1693573056,
   "score": 9,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynw6o8",
   "message": "McDonald's ordering screen thing.",
   "created_utc": 1693574365,
   "score": 21,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynhxrc",
   "message": "Reddit mobile app",
   "created_utc": 1693567696,
   "score": 45,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvvdo",
   "message": "The shift on a Nissan Pathfinder. Trying to get it into neutral is like a carnival game. Almost destroyed it trying to enter a car wash.",
   "created_utc": 1693574245,
   "score": 235,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvxnf",
   "message": "The current NHS system. I bet all the ones in charge have private health care.",
   "created_utc": 1693574270,
   "score": 8,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynvwih",
   "message": "The Apple Mac chargeable cordless mouse. Cos you can't use it while it's charging. Dumbasses",
   "created_utc": 1693574257,
   "score": 28,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzemn",
   "message": "I’ll add a comment as someone said something that made me think.\n\nStreaming services search engines?  You can literally have 10k to 50k things to watch, but there is absolutely no way to do an in depth search.\n\nDoesn’t have to be through a mobile app, maybe an online connection through a web site.  But if I want to find a show that was running in the late 90s and I know it was science fiction, why can’t I do that?\n\nSo much content I might want to watch but can’t find it.",
   "created_utc": 1693575659,
   "score": 169,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynxpiu",
   "message": "I just bought a waterproof cargo bag for the roof of my car that was fairly expensive \n\nThe Velcro that keeps the zipper protected was just GLUED ON, not stitched\n\nThe very first time I opened the bag all the Velcro came off because the attraction to itself was stronger than the adhesive bond to the vinyl bag\n\nIt’s like there was absolutely zero product testing, but I’m sure it was 5 cents cheaper to make it glued rather than stitched. How could something like this have ever been allowed to leave the factory?",
   "created_utc": 1693574977,
   "score": 174,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyny5ah",
   "message": "I wager that every coffin maker has never used one.",
   "created_utc": 1693575155,
   "score": 6,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzoit",
   "message": "My kitchen trash can. It is one sold by Glad specifically for their bigger, extra strong 13 gallon trash bags. It is not particularly cheap.\n\nIt looks good, but the design of it is what you might expect if you told aliens what a trash can is and they designed one without ever seeing it. How it holds the bag basically causes you to lose 4 gallons of capacity and have to risk tearing the bag or spilling its contents every time you go to remove it. It also has a trash bag holder that is so narrow, you have to feed it trash bags one at a time, completely defeating the point. And if you try to compact the trash a bit, you're almost guaranteed to tear the \"tear resistant\" bag.\n\nSuch a poor design.\n\nEdit: For everyone who keeps commenting about how I should recycle and compost... I do. That has nothing to do with my trashcan...",
   "created_utc": 1693575770,
   "score": 159,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzlna",
   "message": "Womens underwear.  \n\n\nThe part that is supposed to get dirty is never far enough forward to catch what its supposed to catch.",
   "created_utc": 1693575737,
   "score": 163,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynufbr",
   "message": "Destiny 2",
   "created_utc": 1693573644,
   "score": 4,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo1en5",
   "message": "Healthcare.",
   "created_utc": 1693576455,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynr0hy",
   "message": "Neck ties",
   "created_utc": 1693572163,
   "score": 13,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynt59r",
   "message": "Every lawn mower I’ve ever used.",
   "created_utc": 1693573102,
   "score": 12,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyngxxv",
   "message": "Sometimes reddit.",
   "created_utc": 1693567146,
   "score": 8,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynyxjt",
   "message": "Modern fans.\n\nI remember as a kid they were all solid AF, mostly metal, moved tons of air, and they were quiet or at least made a consistent and constant steady sound.\n\nNow they are all shitty plastic, crap at moving volumes of air, weak motors, with cheap feet and handles that break or fall off, vibrate all over the place, wobble, fall over, make high-pitched w**h**ines, irregular noise, and otherwise just suck. And you can't even pay to win there are no high-end models they are all trash.\n\nETA: Thanks everyone. I was shopping for fans in the wrong place. Seems like I'd have much better luck at hardware/commercial/industrial/farm stores and second-hand shops. I will be upgrading both my fans this year and I now have a battle plan. Really appreciate all the advice.",
   "created_utc": 1693575469,
   "score": 87,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzhky",
   "message": "Every single asshole lighting manufacturer that makes the terminals on the light fittings they designed too small for the standard Fucking cabling that the country the lights are sold in uses by regulation. \n\nEvery single fitting requires a junction before they are terminated into the junction in the light fitting \n\nEvery single manufacturer, and the more expensive the fitting the worse the install. I’m half convinced it’s a conspiracy to justify the cost like oh look how long it takes the electrician to install very complex.\n\nFucking cunts.",
   "created_utc": 1693575693,
   "score": 224,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzii2",
   "message": "Most garden hoses - wouldn’t you think that the first design requirement would be that it work without kinking?",
   "created_utc": 1693575703,
   "score": 205,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jynzrde",
   "message": "*Clippy* in MS Office.",
   "created_utc": 1693575802,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo0wu1",
   "message": "The door knobs my wife just bought, actual knob is wider diameter than bit that screws to door so you cant get the screws in unless they're well on the piss, knob not removable..... Idjidts..",
   "created_utc": 1693576259,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo1x95",
   "message": "Some road intersections make me wonder if the engineers have actually ever driven a vehicle.",
   "created_utc": 1693576659,
   "score": 95,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo3mqt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo734e",
   "message": "I have an inkjet printer that prints misaligned (makes slightly wavy text).\n\nI can’t fix it because when you run the alignment diagnostic stuff, either manual or automatic it prints a paper for you to scan so the printer can fix itself.\n\nHowever the printer can’t read the paper it scans because it’s misaligned so it can’t get fixed.\n\nStupidest thing I’ve ever seen",
   "created_utc": 1693578640,
   "score": 139,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo4hul",
   "message": "Any stove or car with touch screens instead of knobs and buttons.",
   "created_utc": 1693577654,
   "score": 138,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo47oo",
   "message": "The damn Outlook search function",
   "created_utc": 1693577545,
   "score": 119,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo3e8j",
   "message": "Bacon packaging",
   "created_utc": 1693577230,
   "score": 26,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo95c2",
   "message": "Toys that only have one volume: EXTREMELY LOUD!!!! \n\nWhoever makes these does not have kids of their own.",
   "created_utc": 1693579411,
   "score": 136,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo0dkn",
   "message": "I’m reminded of a book I once read by a former tech reporter who claims most of the industry is bullshit. \n\nIn one of the chapters he talked about going to the Google headquarters for an event shortly after Google Glass came out. The event was centered around the product and lots of attendees were wearing their pair, but the author noted that not a single Google employee who were hosting the event were wearing Google Glass. \n\nThat’s when he said he knew the product was doomed.",
   "created_utc": 1693576052,
   "score": 129,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyoa63n",
   "message": "The trunk wont open on some Chevrolet cars if the battery is dead. There is no key hole, or physical release cable.\n\nThe battery is in the trunk.\n\nYou can jump it from contacts under the hood, sure, but that’s such an odd design choice to me.",
   "created_utc": 1693579788,
   "score": 1,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo2kiq",
   "message": "My clothes dryer. It has touch controls that are designed in such a way that you pretty much have to guess what you're supposed to touch (nothing visibly looks like a button), and when turned on has an inexplicable 10+ sec delay before the touch controls work so you basically poke it all over the place without even knowing if it's the right place to poke or if you simply need to wait for nothing to happen. I mean, that's what I think, at least, but can't be sure since there seriously is no visual indication of anything.\n\nThere's also a numerical display which I assumed was related to the time left until it's done, but I've been using it for almost 2 years now and I still have no clue what those numbers are meant to indicate. They certainly don't correlate with any time units I'm aware of.",
   "created_utc": 1693576906,
   "score": 195,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyoizvu",
   "message": "The ribbed condoms don't even taste like ribs.",
   "created_utc": 1693583046,
   "score": 44,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo161m",
   "message": "Any sites with lots of text and ads in between. Scroll down, start reading, then the ad loads and your article shifts down a few inches. Go to click a link but suddenly the ad loads and you click that. \n\nOne of the biggest reasons I switched from iPhone to Android was so that I could use ad blockers on Firefox.",
   "created_utc": 1693576360,
   "score": 54,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo4fak",
   "message": "And another candidate, my microwave interface was designed by idiots.\n\nRight below the start/stop button is the \"Connect\" button that connects the microwave to the house network.\n\nThis is a function that you use at most ***once*** in the lifetime of the microwave and they place it in the most prominent location on the interface.\n\nThen not only do they hide the power level button off to the side, but you have to press another button to show the hidden options. I use power level probably 75% of the time I use my microwave and I have to hit two buttons just to get to it, while the completely useless connect button sits there occasionally getting hit when someone's finger slips.",
   "created_utc": 1693577627,
   "score": 158,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo3mor",
   "message": "Most of industrial machines I have worked on, newer models get worse. So unergonomic, dangerous and makes your work harder. I can especially point out label inspection slitter-rewinder - Omega SRI by ABG. Compared to my old machine with the same function: \n\n\\- cutting tables were higher: unergonomic for women who mainly worked on it  \n\\- requires more data to operate: had to enter roll diameter, old machine calculated it automatically  \n\\- more difficult to place blades: on old machine could do that above the job, no measuring required. On Omega SRI had to measure the spaces, pull the blade rack out and measure the space between blades. It took multiple tries to get right.  \n\\- slow. I guess for safety reasons its rewinding was so slow, machanic changed the setting to make it faster but it was still so slow for the first and last 20 m. It was really bad for rewinding small rolls, bye-bye bonus. Didn't feel endangered by greater speeds just kept distance.  \n\\- too many tension rolls. Old one worked just fine with 12, this one had twice as much. It made maintainance much harder because labels stick to tension rolls. Also impossible to put back material by memory.  \n\\- touch screen... makes me scream. Yeah, cool and modern but not in industrial setting. Knobs are faster and more intuitive.  \n\\- all important work points far away from each other. On old machine I could adjust the settings, see the blades, donor roll and final product, use the main cutting table all standing near the center of the machine. Omega SRI: machine too long, most things in centre but final product rolled in one end, so I couldn't see all the important things standing at one point.\n\nSorry, if too specific rant, but I basically quit my job because of this machine made it so much worse. Obviously these machines have to appealt to bosses not workers. It had some visual quality control features that were bullshit, my bare eye could catch more stuff.",
   "created_utc": 1693577319,
   "score": 74,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo7owp",
   "message": "Anything related to gynecological instruments, including speculum, clamp etc.",
   "created_utc": 1693578870,
   "score": 205,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo16ni",
   "message": "Made it and don't use it?   The metaverse",
   "created_utc": 1693576367,
   "score": 69,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo5dnd",
   "message": "Bacon packages. Can I get a ziplock for it? I don’t want to eat 30 pieces of bacon in one sitting.",
   "created_utc": 1693577991,
   "score": 68,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyoivyf",
   "message": "My dishwasher beeps several times loudly when the cycle is done. Loudly enough that you can hear it outside the house. If you don't open the door, it will beep again 45 minutes later, and every 45 minutes forever until you do so. There is no way to silence this feature or reduce the volume.\n\nApparently there's no such thing as starting the dishwasher at night and then going to bed in these designer's minds...",
   "created_utc": 1693583008,
   "score": 68,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyohthn",
   "message": "I design and build fountains, install all across the county.  Reading all this reminds why I go through a lot of effort to revisit my previous installs, so I can see how things hold up after many years in public environments.  It's easier to make something look nice temporarily, but the real test is when its out in the wild.  I've gone back to service or refurbish fountains up to 15 years old and it's a tremendous learning experience seeing which parts and methods are reliable, and what needs the most improvement. This also helps me continuously design things better.",
   "created_utc": 1693582622,
   "score": 123,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo5fdp",
   "message": "Windows Vista had much higher system requirements than the previous Windows.  When it released, a lot of vendors made laptops with Vista preinstalled that could run Vista...but not anything else.  The OS's requirements were so out of sync with the laptop's guts that something as simple as a web browser would move at a snail's pace and send all the fans into high gear.\n\nI'm certain that this is one of the reasons that Vista is looked back on so poorly.  Most people who ran it on everyday machines got terrible performance because vendors slapped into hardware that could barely run it.  When Microsoft replaced it with Windows 7, they specifically offered a new, lightweight edition for lower end machines to mitigate that problem.",
   "created_utc": 1693578009,
   "score": 53,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo446c",
   "message": "The newly-built ladies toilets in our office building which had no space for the sanitary products bins.  The bins ended up awkwardly shoved into the too-small gap with the net result of making the actual toilets too narrow to sit on.  Fully expect those dimensions were drawn and approved by someone who had no use for the bins or didn’t even know they were present in every toilet.",
   "created_utc": 1693577506,
   "score": 100,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo4cs5",
   "message": "Cardboard tampon applicator",
   "created_utc": 1693577600,
   "score": 90,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo3yf2",
   "message": "Pots with handles which get burning hot when you heat the pot.",
   "created_utc": 1693577444,
   "score": 134,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyoq1io",
   "message": "Any pair of women’s underwear that puts the seam of the two panels in between your legs/through your crotch rather than at the sides over your hips was designed by someone without a vulva. No woman in her right mind would design it like that unless she enjoyed having her flaps flossed.",
   "created_utc": 1693585537,
   "score": 44,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyo4oca",
   "message": "The little foil seals on the tops of bottles of liquid with the flap in the middle that you're meant to pull on to remove. They work maybe 1 time out of 20.",
   "created_utc": 1693577724,
   "score": 81,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyob1hz",
   "message": "Sanitary pads\n\nEspecially ones advertised as \"zero bunching\" - they most certainly do bunch. They will go straight up your bum crack. They can only have been designed by someone who doesn't use them to have made that claim",
   "created_utc": 1693580111,
   "score": 38,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyobkgx",
   "message": "Virtually every single website is so riddled with ads it's unusable. Sometimes I'll try to read an article and find horizontal and vertical ads taking up the entire page. How does that get by the writers/editors? Something really has to be done about how abundant they are.",
   "created_utc": 1693580305,
   "score": 40,
   "submission_id": "1674arj"
  },
  {
   "comment_id": "jyovwlw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1674arj"
  }
 ]
}