{
 "submission_id": "1675sxb",
 "title": "do you drink tap water? why or why not?",
 "selftext": "",
 "created_utc": 1693571386,
 "permalink": "/r/AskReddit/comments/1675sxb/do_you_drink_tap_water_why_or_why_not/",
 "score": 170,
 "url": "https://www.reddit.com/r/AskReddit/comments/1675sxb/do_you_drink_tap_water_why_or_why_not/",
 "comments": [
  {
   "comment_id": "jynsfua",
   "message": "Yes, bc I live in Europe and the tap water is better quality than the cheapest bottled one. Especially now after moving to Sweden, the water is unbelievably tasty and soft",
   "created_utc": 1693572798,
   "score": 141,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynwbgy",
   "message": "No cause on the island we live we use purified sea water. It tastes like getting a mouth full in the indoor swimming pool.",
   "created_utc": 1693574418,
   "score": 131,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo3nyn",
   "message": "Yep. It's safe to drink here and bottled water is a waste of money.",
   "created_utc": 1693577331,
   "score": 90,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynrkkn",
   "message": "You should always drink tap water.  \nUnless you shouldn't. In that case, you absolutely shouldn't drink tap water.  \nI hope this is clear. Clear?",
   "created_utc": 1693572424,
   "score": 86,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynxl2y",
   "message": "I'm from Manchester,  England. Our tap water is not only safe but lovely to drink. \n\nI simply don't understand how people can justify buying water here. \n\nWhen I was a kid the thought of buying a bottle of water would be seen as akin to buying a can of fresh air. An utterly ludicrous proposal.",
   "created_utc": 1693574929,
   "score": 241,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynqeh8",
   "message": "I do and that's because, for the most part, public drinking water **is** safe. And I can always check the [Consumer Confidence Report](https://ordspub.epa.gov/ords/safewater/f?p=136:102::::::) [either via the linked email **or** by contacting the utility] for my utility if I have doubts.\n\nAs a kid, I grew up drinking unfiltered rain, well, spring water. Our rainwater tank was so badly maintained that there were *literal frogs* in it during the summer. That water was not, at all, safe to drink and I have no idea how none of us got sick. Truth be told, we probably did but none of us knew enough to realize it was the *water* that was doing it.\n\nDrinking water *is* safe these days. And if its its not, **usually** a notice is put out pretty damn quick to notify people of that fact.",
   "created_utc": 1693571880,
   "score": 211,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynqhel",
   "message": "NYC tap water is just about as good as bottled water---sometimes better.",
   "created_utc": 1693571918,
   "score": 237,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyon3ok",
   "message": "I live in the Swiss Alps. The tap water is better than Évian. No bs.",
   "created_utc": 1693584502,
   "score": 77,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo771l",
   "message": "Yes. Bottled water is a scam and single use plastic is a scourge. Public water supplies for the most part are safe to drink — and in fact many bottled water companies just bottle public drinking water.",
   "created_utc": 1693578682,
   "score": 177,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo5dd7",
   "message": "Yeah, because I live in sweden",
   "created_utc": 1693577988,
   "score": 49,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo1j3e",
   "message": "I've got one of those plastic refillable bottles with the straw in the lid on my bedside cabinet and one on my works desk, both filled with tap water, I love it and am always guzzling it!",
   "created_utc": 1693576503,
   "score": 21,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo6t5j",
   "message": "I drank tap water my whole life before I bought a 100-year-old house that \"may have lead pipes\" according to the city. Currently waiting on the results of my free lead test to see if I can go back to drinking the tap water or if I'll have to wait a year or two for the city's lead pipe replacement program to reach my house.",
   "created_utc": 1693578538,
   "score": 30,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynur7p",
   "message": "Yes it’s delicious and more regulated than bottled water. Filter through the Brita and into a 2.5 gallon container to stay ice cold in the fridge. I used to have a water cooler with the 5 gallon jugs and I’d do the same thing and buy the caps online and keep refilling the jug when it was empty.",
   "created_utc": 1693573784,
   "score": 11,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp853d",
   "message": "Yes, but filtered.",
   "created_utc": 1693592091,
   "score": 11,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynu61v",
   "message": "Yes. I come from a number 1 country in water quality according to [https://worldpopulationreview.com/country-rankings/water-quality-by-country](https://worldpopulationreview.com/country-rankings/water-quality-by-country) . Our tap water is often considered better quality than bottled water.",
   "created_utc": 1693573536,
   "score": 24,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyobc7f",
   "message": "I drink nothing but water (and coffee) anyways.\n\nWhere I live, tap water is super clean and it's cheaper than bottled water.\nPlus you don't have the hassle buying and carrying it.\n\nNever understood people who drink bottled water in areas where drinkable tap water is obtainable.",
   "created_utc": 1693580222,
   "score": 8,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo2pjd",
   "message": "Fun fact: NYC tap water is better than most bottled water.  \n\nMy friend worked for Bloomberg back when he was mayor.  She told me that one pet peeve he had was when people would visit him and have a plastic throwaway water bottle.  He wouldn't say anything to the guest, but after he left he would complain about the guest to his aides.\n\nHe would say \"You know how much work we did to make this water what it is?\" stuff like that.",
   "created_utc": 1693576960,
   "score": 22,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyogp1k",
   "message": "Everyone drinks tap water and even willingly pays for it.  If you believe that the bottled water you're buying is melted from some 1000 year old glacier in the Arctic, then you're going to love the Rolex's I have for sale.",
   "created_utc": 1693582205,
   "score": 21,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyon0nh",
   "message": "Absolutely not. Too much crap in it. Buy an under the sink reverse osmosis system. You’ll never look back.",
   "created_utc": 1693584472,
   "score": 20,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyookyr",
   "message": "Nah, WV (at least where I’m at) tap water tastes like shit and smells even worse",
   "created_utc": 1693585023,
   "score": 14,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyns7nk",
   "message": "Yes I do,  because I m feelin thirsty.",
   "created_utc": 1693572700,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo5r2w",
   "message": "Oregon water is delicious. Some of the best I’ve had",
   "created_utc": 1693578134,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyog9ip",
   "message": "Because it's literally the same as bottled water, but cheaper and with less pollution of the environment...",
   "created_utc": 1693582046,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoia2l",
   "message": "Yes. I live in a community that has award-winning water provided by our water utility.",
   "created_utc": 1693582791,
   "score": 6,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyolgxy",
   "message": "Yes I do because it's quite normal in the Netherlands. Our tap water is good. In some parts of the country it's harder or softer.",
   "created_utc": 1693583916,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyolzne",
   "message": "Hell no. The water where I live is poison.",
   "created_utc": 1693584102,
   "score": 16,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoi4w3",
   "message": "Tap water is a modern miracle within itself, never ashamed or afraid to drink it. It’s truly a blessing to walk over to a faucet and get water at will that is treated and generally safe for consumption. It’s one of those small elements of modern life that I often take for granted !",
   "created_utc": 1693582740,
   "score": 12,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynve2y",
   "message": "Yep. Where I live we have wonderful tap water, tastes better than the bottled stuff.",
   "created_utc": 1693574051,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo6bdj",
   "message": "Yeah, my tap water tastes really good (Louisville KY), since the Ohio River is so goddamned polluted the water company has to work like crazy to clean it. When I go out of town I'm more inclined to buy bottled water. Florida tap water always tastes a little like smoke for some reason.\n\nI always order water to drink at a restaurant too, fountain soda markup is crazy high and I'd rather eat my calories, not drink them.",
   "created_utc": 1693578351,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo6ncf",
   "message": "Yes, it's free (a well) and delicious",
   "created_utc": 1693578478,
   "score": 6,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyobwny",
   "message": "yes because it's perfectly fine (both in terms of health and taste) where I live and it's tens of times less expensive than bottled water. Also less plastic, so better for the planet.",
   "created_utc": 1693580425,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyohj80",
   "message": "At home, we got an RO system installed and I use it every day. Out and about, I'll almost always use a water fountain or tap unless something's tasting really bad.\n\nBottled water is a massive scam for the vast, vast majority of people in the US with safe drinking water.",
   "created_utc": 1693582516,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynqlai",
   "message": "Yeah, we have good quality water.",
   "created_utc": 1693571968,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynu10w",
   "message": "yea\n\nwater treatment standards are decently high here",
   "created_utc": 1693573479,
   "score": 4,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo9s41",
   "message": "Yes, because who the hell has the money for bottled water?",
   "created_utc": 1693579648,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoadki",
   "message": "I do. I've never considered why or why not. That's just where the water comes from in my house.",
   "created_utc": 1693579864,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyobrsk",
   "message": "Yeah…we’re on a well and it’s better than bottled.",
   "created_utc": 1693580377,
   "score": 4,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyog8on",
   "message": "Yes, but it’s only because I’m lucky to live where it’s safe to drink it.",
   "created_utc": 1693582037,
   "score": 4,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyohukl",
   "message": "Yes , why would I waste money on bottled water?",
   "created_utc": 1693582634,
   "score": 4,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoikpg",
   "message": "Why wouldn't I?\n\nIt's cheap, it's clean, and I'm thirsty.",
   "created_utc": 1693582896,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyojnzx",
   "message": "Vancouver’s tap water is the best in the world. Always tap water baby",
   "created_utc": 1693583283,
   "score": 5,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyolfaj",
   "message": "No, not safe in my country. I still think it's weird when I see some character in a show taking medication with bathroom tap water.\n\nI got curious and just found out only North America, western Europe, Australia and a few other countries have safe tap water [https://awol.com.au/tap-water-countries-map/71118](https://awol.com.au/tap-water-countries-map/71118)",
   "created_utc": 1693583901,
   "score": 4,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyq6wwi",
   "message": "Yes. I live in Canada our tap water is pretty good 👍 plus if I'm being honest I don't really care. Water is water.",
   "created_utc": 1693605201,
   "score": 1,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo9nz4",
   "message": "Yes, because it is safe, clean, and cheap.",
   "created_utc": 1693579605,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyogbqq",
   "message": "Yes because its safe to drink in Australia and tbh tastes pretty good",
   "created_utc": 1693582070,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyol9kk",
   "message": "I travel a lot for work. It depends on which region I'm in, but I do when I'm Japan, the US, or Europe. I don't when I'm anyplace else, like Vietnam, China, Mexico. (Although there are a few other countries I would, like Korea and Singapore.)",
   "created_utc": 1693583844,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyola54",
   "message": "All the time. The water where I live is spectacular.",
   "created_utc": 1693583849,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyolbap",
   "message": "Yes. It's very cheap and safe here in Sweden.",
   "created_utc": 1693583862,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyolu13",
   "message": "Yes, im from the Netherlands",
   "created_utc": 1693584043,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyomca8",
   "message": "I am in the EU. Tap water is excellent.",
   "created_utc": 1693584232,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoxryk",
   "message": "Yes, unless I travel somewhere it's not safe. Because I can't see any benefit to having to pay for and carry around bottles of water, bottles that have been shipped around who knows how far, bottles that contain functionally the same stuff as what comes out my tap but with a bit more microplastic goodness.",
   "created_utc": 1693588334,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypc8kp",
   "message": "Bitch I drink right outta the hose lmao that shit tasty",
   "created_utc": 1693593662,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypdhhh",
   "message": "I live in the UK, our tap water is perfectly fine ... Why would I waste money on plastic bottles when the tap giveth.",
   "created_utc": 1693594118,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypqhzi",
   "message": "yes because I live in Norway",
   "created_utc": 1693598919,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypr0zz",
   "message": "Yes. I'm Dutch, nothing more to say",
   "created_utc": 1693599116,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypr83b",
   "message": "In the UK all the tap water is potable, some places it can taste a little harsh due to the hardness, but in most places it's delicious.\n\nIt costs pennies (it's cheap enough that we use it to flush away our turds in the toilet) so why would I spend money on bottled water?",
   "created_utc": 1693599190,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyproyr",
   "message": "I was in a small mountain town in southern germany last week and they had insane tap water. I think i was drinking like 3-4 litres tap water per day 😍 The drinking water there is taken from a depth of up to 120m from the developed aquifers and distributed completely without additives and without chlorination. But in my home in northern germany the tab water smells too much like chlorin and i only drink bottled water.",
   "created_utc": 1693599368,
   "score": 3,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jynz34b",
   "message": "Yeah \n\nIt’s free(ish)",
   "created_utc": 1693575532,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyo6nc6",
   "message": "I always drank tap water in NH, which is well (ground) water, and still do. With the contamination by PFAS in recent years, though, I don’t recommend it for young people. The risks of long term exposure are too high.\n\nMany places have PFAS contamination now… test your water!",
   "created_utc": 1693578478,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyodhky",
   "message": "Not after a storm or heavey rain. The sewage floods into rivers and overwhelms waste management facilities in the city I live.",
   "created_utc": 1693581008,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoidby",
   "message": "Yes. I live in Saint Louis, the water actually tastes good here.",
   "created_utc": 1693582823,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoiq5n",
   "message": "I live in Ottawa, we have some of the best rap water in the world. So yes.",
   "created_utc": 1693582950,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyok0g2",
   "message": "In Canada? Yes. When i go to any other country (including the USA) it's a no from me.",
   "created_utc": 1693583402,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyol7g8",
   "message": "Depends.\n\nI've lived a lot of places that varied in taste/quality of tap water.\n\nCurrent Home:  \nYES I drink it, it's well water in New England that I have my own personal filtration system on and have had tested.\n\nPrevious Home a town over from Current while we house hunted:  \nYES I drank it, town tap water, tasted great, I love New England water in general\n\nWest Palm Beach FL:  \nYES I drank it, town tap water, Florida water tastes a bit more processed then New England water, but so does bottled water. People complained about its taste but I really think they were complaining that it wasn't cold (it's Florida guys). I personally liked it.\n\nLos Angeles/Encino CA:  \nYES I drank it, town tap water, was perfectly fine. Didn't stay there long enough to form any real opinion.\n\nJuno Beach, FL:  \nSORT OF I drank it BUT didn't like it, well water near the beach, had a very salty taste. I wouldn't buy bottled water, but if a different water source was available I preferred it and horded it.\n\nAcreage, FL:  \nNO I did NOT drink it, well water that came out of the tap with an orange tinge to it and smelled of rotten eggs. I'd go to friends houses who insisted they had state of the art, top of the line, filtration systems and it STILL tasted like farts and made your hair feel like you spent the day at the beach. All the grocery stores in the town over had water fill stations with town water that you could fill up a gallon jug for 25c or refill a gallon jug for 10c. This is predominantly what I'd drink... so technically tap water, but not the well water where I was actually living.\n\nAlso there was rumors that Pratt \u0026amp; Whitney nearby was dumping chemicals into the ground water that could cause cancer. Years later a study was done and found huge cancer clusters through out Acreage/Loxahatchee. I know many people who got cancer out there.\n\nRPB, FL:  \nYES I drank it, tap water, was the town water from which I purchased when living in Acreage.\n\nYakima, WA:  \nYES I drank it, no idea what the source was, when you're smoking meth behind the laundromat you witnessed your first murder at and huffing gasoline for fun I don't think the source of water was all that concerning to you.\n\nBack in New England:  \nYES I drank it, I was a young kid, it was the early 90s and 80s, tap or well (depending whose house), the idea of bottled water was in its infancy in the zeitgeist and the idea of a welfare recipient like my mother BUYING bottled water would never have even come to mind. I don't recall ever seeing bottled water, but if we had... it best be some fancy ass french bottled water and we'd go \"ooo la la, rich people and their french water\". My mother MAY have purchased a glass bottle of mineral water and some brie and fruits on a rare occasion, take us all to the park, lay out the nicest linen, and we'd all pretend we were fancy for the day.",
   "created_utc": 1693583823,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyolccj",
   "message": "Yes, I drink tap water. My superpower is saving the planet, one plastic bottle at a time.",
   "created_utc": 1693583873,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyomzg0",
   "message": "\u0026gt; do you drink tap water?\n\nDepends where I am / what the circumstances are.\n\n\u0026gt; why or why not?\n\nBecause different circumstances can call for different behavior.",
   "created_utc": 1693584459,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyon9vz",
   "message": "Yes because Scotland.",
   "created_utc": 1693584560,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyonahp",
   "message": "Yes\nBecause, Sweden",
   "created_utc": 1693584566,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoocj3",
   "message": "No because Phoenix tap water is fucking gross",
   "created_utc": 1693584939,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyopyia",
   "message": "Yes. In Sri lanka, tap water's fine most of the time.",
   "created_utc": 1693585507,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyotb8a",
   "message": "I'll drink it out of a garden hose if I need to",
   "created_utc": 1693586720,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyouaqb",
   "message": "Other than a cup of tea every morning, it's all I ever drink as the tap water quality is pretty good over here.",
   "created_utc": 1693587071,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyouoy9",
   "message": "Yes cause I live in the uk and it’s good",
   "created_utc": 1693587213,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyouxbm",
   "message": "Excellent quality and totally safe in my country, so yep!",
   "created_utc": 1693587297,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyouyty",
   "message": "I sure do!\n\nFor me, bottled water just always tastes bleh. Not nasty but there's always a strong aftertaste.\n\nTap water just tastes more refreshing to me.",
   "created_utc": 1693587312,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyoypus",
   "message": "I'm from the west coast of Canada and our tap water is better than bottled water. It always boggled my mind traveling and seeing the bottled water culture. As I grew older though and got more educated I found out we have one of, if not the highest concentrations of fresh water sources in the world. So we are actually quite privileged when it comes to this issue. I still think people should try and drink tap water when they can, bottles are so waistful. I empathize more now though.\n\nEdit: spelling",
   "created_utc": 1693588674,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp2a3p",
   "message": "Depends where you live and what kind of water is supplied to your tap. I live in place where water from tap is clean and safe so I drink it for very long now without boiling (except for tea ofcourse) I drink it without addons but also with small amount of syrup.  \nStay healthy people.",
   "created_utc": 1693589960,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp2tqr",
   "message": "Yes. Where I live (Canada, BC specifically) it's super safe and why would I pay 1$ for a bottle of fucking water when its free from the tap and bottles last for ages?",
   "created_utc": 1693590159,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp3rpe",
   "message": "Canada. Yes. Entirely safe to drink, unless you live on a reserve then unfortunately not (depending on which one)!",
   "created_utc": 1693590496,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp591z",
   "message": "Yes. I live in a large city in Canada. It’s really good.",
   "created_utc": 1693591030,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp65rb",
   "message": "Yes. Why? I’m in Canada and it’s delicious. \n\nNote (because someone will mention it if I don’t ): There are definitely parts of Canada where access to fresh water is a problem; for example, access to fresh water in some of our First Nation communities. In most places however clean water is readily available and tastes awesome.",
   "created_utc": 1693591365,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp66gt",
   "message": "Yep! I live in Canada, and the tap water where I’m at is fantastic.",
   "created_utc": 1693591373,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyp7wov",
   "message": "I use a Brita water pitcher but yeah, almost exclusively tap water",
   "created_utc": 1693592007,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypa6jb",
   "message": "I drink tap water, just not MY tap water. I have well water and I don’t like the taste. I fill my water bottle at work and drink that.",
   "created_utc": 1693592901,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypabh7",
   "message": "Yes I do. I like the chlorine taste. In America we all should be able to safely drink tap water. Sadly this is not the case. Ever since Flint water crisis I have been angry about the gov not making sure every home has safe water. This is a big thing for me. I still my local politicians. I feel horrible about places with water not safe to drink . This is my cause.",
   "created_utc": 1693592960,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypan1n",
   "message": "Bottled water is just tap water bottled somewhere else.",
   "created_utc": 1693593086,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypc3uw",
   "message": "Nope!  I live in Florida and there’s either rust or silt in it.  Sometimes both!",
   "created_utc": 1693593614,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypd3gm",
   "message": "My wife and I drink tap water all the time. Refillable bottles. Always keep a dozen in the fridge. \nSoda is bad for people.  Paying for bottled water is an unnecessary expense.",
   "created_utc": 1693593976,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypdh7l",
   "message": "I have a Brita pitcher filter, and the water is decent to start with.",
   "created_utc": 1693594115,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypf4u8",
   "message": "If you drink bottled water you are drinking tap water. It’s just tap water that’s gone for a truck ride.",
   "created_utc": 1693594712,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypfuyq",
   "message": "The tap water in the city I live in in Canada is worse than that of Flint, Michigan in terms of the amount of lead in the water (which is a result of lead pipes). I drink the tap water, but it is filtered through a filter provided by the city.",
   "created_utc": 1693594977,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyphzuy",
   "message": "Tap water is my favorite. Single use plastic bottles are atrocious, that shit comes out of the sink!",
   "created_utc": 1693595768,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypj1fl",
   "message": "Canada has super high tap water quality, better than some bottle water.  So yes from time to time.",
   "created_utc": 1693596153,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypjmag",
   "message": "I live near a chalk river and some people pay for water like that. Hard water is delicious and I love it. Water just isn’t the same anywhere else but I will always drink tap water.",
   "created_utc": 1693596368,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypkoz1",
   "message": "Yes, I live in Michigan so we have tons of fresh water to drink and it’s really good.",
   "created_utc": 1693596773,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyppydu",
   "message": "I went out the other day and wanted a complimentary water from subway so I asked for a cup but then the person said that it would cost 25 cents, which is not a lot of money but on the other hand its supposed to be FREE.",
   "created_utc": 1693598716,
   "score": 1,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypq0me",
   "message": "Yes.\n\n1. I work for a water company so I see how the bread gets made\n2. Tap water is less than 24 hours old, bottled water can sit in a warehouse for months\n3. Microplastics can leech into bottled water\n4. Water quality in the UK is unbelievable quality in a well regulated environment \n5. Tap water is in the magnitude of few pence for 1000s of litres, bottled water is in the region of £1 for 1 litre\n6. Bottled water is not from the mountains (despite what the advertising will have you believe) its likely from a municipal source. Its tap water that is several weeks old.\n7. Tap water is much better for the environment",
   "created_utc": 1693598739,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypq0mu",
   "message": "Yes, we live in a safe country to drink, but... some old buildings still have lead piping and the city is still replacing them, slowly. In the meantime they gave us filters to use. We already had filters installed under our sink anyways, because I had a baby and wanted to take extra measures to be safe.",
   "created_utc": 1693598739,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypq0o6",
   "message": "Only after filtering it because Duke Energy poisoned our water source years ago",
   "created_utc": 1693598740,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypq10z",
   "message": "Yes. I live in Canada.",
   "created_utc": 1693598743,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypq25n",
   "message": "I drink tap water because I can’t explain it any other way other than bottle water to me tastes like how tap water tastes to people who only drink bottled water",
   "created_utc": 1693598754,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypq2cw",
   "message": "Yes, because I live in Greece and we have the best quality water.",
   "created_utc": 1693598757,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypq9kw",
   "message": "yes, because i live in scotland \u0026amp; our tap water is incredible",
   "created_utc": 1693598832,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypqhno",
   "message": "I do. I need hydration. UK tapwater is among the cleanest in the world",
   "created_utc": 1693598915,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypqu4o",
   "message": "No, our tap water has tiny black bits so we have to use a filter before boiling the water - that's in UK",
   "created_utc": 1693599045,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypqwsk",
   "message": "Yes, I also have a Brita filter tho.",
   "created_utc": 1693599071,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypqxvd",
   "message": "yes, its free and in winter i get instant ice cold water",
   "created_utc": 1693599083,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypr1kj",
   "message": "Don’t forget the fluoride for those teeth!!",
   "created_utc": 1693599122,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypr2f4",
   "message": "I definitely do.",
   "created_utc": 1693599131,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypr5jf",
   "message": "I used to until my town sent our a letter saying there was trace amounts of lead in the water. Now we use big jugs.",
   "created_utc": 1693599164,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jyprm8q",
   "message": "Yes, it’s healthier than anything with sugar, but not as healthy as purified or alkaline water.",
   "created_utc": 1693599340,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypvt9x",
   "message": "No, because across my city and other states I’ve lived in there have been issues with lead contamination. The city has sent me a Brittany in 2 different locations because the amount of lead was higher than the allowed limit. Water quality is different across multiple states too. \n\nI just drink Brittany water or filtered water only now.",
   "created_utc": 1693600920,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jypycdl",
   "message": "Yes, because where I live, the water is tested monthly for microorganisms and heavy metals.",
   "created_utc": 1693601865,
   "score": 2,
   "submission_id": "1675sxb"
  },
  {
   "comment_id": "jype9gk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1675sxb"
  }
 ]
}