{
 "submission_id": "1675hep",
 "title": "What is something people wrongly assume about you all the time?",
 "selftext": "",
 "created_utc": 1693570487,
 "permalink": "/r/AskReddit/comments/1675hep/what_is_something_people_wrongly_assume_about_you/",
 "score": 255,
 "url": "https://www.reddit.com/r/AskReddit/comments/1675hep/what_is_something_people_wrongly_assume_about_you/",
 "comments": [
  {
   "comment_id": "jynpr8u",
   "message": "I’m 70 years old, look older, retired and walk 3X every day. People stop their cars assuming that I have dementia and am lost.",
   "created_utc": 1693571583,
   "score": 165,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynsxrt",
   "message": "That I'm an extrovert. I'm just really good at faking it and I actually find you exhausting.",
   "created_utc": 1693573011,
   "score": 97,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynoboo",
   "message": "I’ve had several people assume I’m a really devout Christian. I kind of enjoy telling them I’m an atheist and haven’t ever gone to church other than weddings or funerals. “Oh, but you’re so nice?” Yeah, I don’t need religion to be nice",
   "created_utc": 1693570910,
   "score": 70,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynpsmz",
   "message": "That I'm very helpless and insecure. It's a result of my disability. Disabled people generally struggle with the problem that able-bodied people frequently infantilize us. In my case, this may be stronger than in others because I'm blind. When you're blind, your body motions and especially the way you walk tend to be very cautious. This has multiple reasons. For starters, I obviously don't want to get hurt (it still happens but I try to avoid it). Secondly, I don't want break things. For example when I'm at an unfamiliar place, I'm always super rigid and careful because I'm scared I will knock over something and cause a giant mess (it has happened before). Thirdly, I also use my hands to explore my surroundings. When I step into a room, I can't just \"take it in\" in a single glance like sighted people can. I need to explore it with my hands and my body. This takes much longer than simply looking at something. Not being able to see also means I need to memorize everything. For example I need to memorize where the door is, how far away it is from the table and so on. This takes up tons of brain space that sighted people can use for other tasks. Sometimes I get lost and I need to re-orient myself. I know it sounds funny but I've even managed to get lost in my 2-bedroom apartment once or twice. I know these situations quite well by now, so they don't stress me out as much as they used to. I simply gather my thoughts, touch my surroundings and after a minute or two, I'm re-oriented. However, I've noticed that sighted people find it very hard to watch this. They want to help me (which is nice) but seeing me like this also gives them the impression that I'm a lost little child who's feeling completely insecure.\n\nThis view of me as a blind person can be very frustrating sometimes, especially when I'm trying to talk to a woman. I'm an adult and I actually feel just as confident as the next person. I just look more insecure and helpless because I'm slower, because I bump into shit and because I sometimes get a little lost. But it's not actually a big deal. It just takes extra patience on my part to deal with those situations.",
   "created_utc": 1693571602,
   "score": 34,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynrbd8",
   "message": "That I'm approachable and will want to talk to them. I just have one of those faces, unfortunately.",
   "created_utc": 1693572307,
   "score": 28,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynsm66",
   "message": "That I'm always angry. No. I have resting B face. I'm actually quite fine. You assuming I am angry is what actually makes me angry.",
   "created_utc": 1693572874,
   "score": 28,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynuxiz",
   "message": "I'm introvert so when i go out and meet new people i dont talk so much. It got to my ears that people assume that i am arrogant.\nThey cant get that you can be good looking and well dressed but having social anxiety",
   "created_utc": 1693573857,
   "score": 25,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynu4fx",
   "message": "that I *can't have ADHD* when I tell them about my diagnose.\n\n\"oh but you don't fiddle around a lot or are impulsive enough to have that\"\n\nplease look up the different types of ADHD before you make assumptions, thanks.",
   "created_utc": 1693573518,
   "score": 15,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynvpgh",
   "message": "That because I am a black woman, I am a bible thumping, god-fearing Christian.\n\nInstead I am a staunch atheist.",
   "created_utc": 1693574180,
   "score": 14,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynvpw3",
   "message": "That I grew up sheltered. I’m timid from growing up in a violent household, not a sheltered one.",
   "created_utc": 1693574185,
   "score": 14,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynsc8e",
   "message": "That I’m straight 😂",
   "created_utc": 1693572753,
   "score": 12,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynnosy",
   "message": "That I'm angry.",
   "created_utc": 1693570612,
   "score": 11,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynt836",
   "message": "I have resting miserable bastard face.  Even when I'm perfectly happy I look morose.  Every summer I go to music festivals and will routinely have people come up and check on me to make sure I'm ok because apparently I look like I'm on the verge of tears.  It doesn't help that I look a good 20 years older than I actually am so they just see this worn out old git who looks like they are on the edge of a breakdown.  In fact I'm usually just happy inside my own head enjoying the music.",
   "created_utc": 1693573135,
   "score": 10,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyns1ku",
   "message": "People assume i can fix thier computer because i work in I.T.",
   "created_utc": 1693572629,
   "score": 11,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyno1ib",
   "message": "That because I had a drug problem in the past that I'm completely untrustworthy despite being sober for years.",
   "created_utc": 1693570780,
   "score": 18,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynr5je",
   "message": "People assume I have the worst motives they can come up with.  \nJust go try discussing something online - you'll see for yourself.",
   "created_utc": 1693572230,
   "score": 8,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynrsw7",
   "message": "People often assume I'm being sarcastic or rude, especially in online interactions. But in reality, I'm straightforward and upfront. If I intend to be critical or unkind, I'm not subtle about it. Tone and intent can be challenging to convey online, leading to misconceptions.",
   "created_utc": 1693572528,
   "score": 9,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynrpch",
   "message": "I don’t enjoy social interaction. I don’t even like talking to you, I have to do it to not look stupid.",
   "created_utc": 1693572484,
   "score": 7,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo36zh",
   "message": "From the way I look and dress, I appear to be just any old redneck white boy from the farm. Flannel shirt, baseball cap, work boots, skanky ponytail, usually unshaven. And I'm often pretty dirty from doing yard work and from a long-term remodeling project I'm working on. People, therefore, make all sorts of assumptions about my education and politics.\n\nIn reality, I'm a well-educated liberal who reads and writes poetry and listens to classical music. I can quote Whitman, Dickinson, and Shakespeare from memory. I have a pet rabbit I talk baby talk to. I have a vase of flowers on my kitchen table I grew and cut from my own flower garden. I like to drink wine and tea. I'm...cultured, I guess.\n\nI don't broadcast my stealth liberal ways. I just like to let new people discover them. So many times, I have seen a flash of surprise in a new person's eye when I accidentally say something educated. It's like they're going, \"Wait a minute, I had you pegged as an ignorant hillbilly,\" and they're trying to re-categorize me in their minds.\n\nIt's really fun being a puzzle piece that doesn't fit comfortably into peoples' stereotypes.",
   "created_utc": 1693577150,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynt8li",
   "message": "I'm so damn ruggedly handsome that people assume I get all the women. /s.",
   "created_utc": 1693573142,
   "score": 5,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1dga",
   "message": "At work I’m the boss, I wear a suit, I’m confident, I talk to everyone freely and easily. \n\nPeople wrongly assume that’s what I’m like. Outside of work my social anxiety is keeping me single and I don’t do much outside of watch YouTube.",
   "created_utc": 1693576442,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyno5po",
   "message": "Everyone around me assumes that I am a republican and a Trump supporter.  I live in a small town, and most people are.  I also own 5 rifles.\n\nUnfortunately, when people discover otherwise, their attitude toward me changes drastically, and they begin arguing with me about everything in the book.\n\nI will never vote for the oppression of other people.",
   "created_utc": 1693570833,
   "score": 7,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynu84j",
   "message": "I have a resting bitch face but I’m actually really shy. It actually physically hurts when I smile 😓",
   "created_utc": 1693573561,
   "score": 3,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynwsf9",
   "message": "1. That I have an attitude. I don't, I am just really shy with people at the start and it takes time for me to build some repo. But people just assume I am uninterested in talking to them.\n\n2. That I am an extrovert. I am not, I just fake it to blend in and to tame the first assumption most people make lol.",
   "created_utc": 1693574609,
   "score": 3,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynyful",
   "message": "That I’m a jock, all muscle no brains. Im tall and like to workout but literally know nothing about sports. Obsessed with anime and video games and chess.",
   "created_utc": 1693575274,
   "score": 3,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynzmqd",
   "message": "If they are a group of 2/3/4 and your group walks shoulder to shoulder taking up the entire 2/3/4 walkway. The person on the edge often wrongly assumes that I will move out of their way.\n\u0026amp;nbsp;\n\nI tell people i workout so I get to eat more. But actually work out so I can bulldoze cunts off the walkway.",
   "created_utc": 1693575749,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynzx7d",
   "message": "That I am a good person. In reality I am just good at faking it, I am grumpy bastard who don’t like anybody I just want to be by myself and be me but I do fucking love my car tho",
   "created_utc": 1693575869,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0kgc",
   "message": "Tan, plastic surgery, super long acrylic nails, bleach blonde hair. \n\nPeople tend to think I’m unintelligent.",
   "created_utc": 1693576126,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynxcib",
   "message": "That I’m younger than I am.  I’m a 40 year old woman and I still get mistaken for a college kid.  My 16 year old son gets mistaken for my little brother all the time.  My husband is mistaken for my dad/uncle or a cradle robber and because of my youthful appearance I’m perceived as a gold digger.  Truth be told I earn nearly 3x what my husband earns so if anyone was a gold digger it would be him and I’m also 5 years older than him 😂",
   "created_utc": 1693574837,
   "score": 5,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynppe0",
   "message": "That I'll howl at the most inopportune times....",
   "created_utc": 1693571557,
   "score": 2,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynu6rd",
   "message": "That I'm intimidating, because of my height.",
   "created_utc": 1693573545,
   "score": 2,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynujvt",
   "message": "That I'm a minor.",
   "created_utc": 1693573696,
   "score": 2,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynvqrz",
   "message": "That I'm smart. I rarely say anything because my brain's on vacation.",
   "created_utc": 1693574195,
   "score": 2,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyny166",
   "message": "That I am an extrovert and that I am not very smart.",
   "created_utc": 1693575109,
   "score": 2,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynyw99",
   "message": "That I am not friendly and unapproachable. \n\nIn reality, I just have a RBF and a low tolerance for ignorance and bullshit.",
   "created_utc": 1693575455,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo16dp",
   "message": "That I need a man or need to be in a relationship. I do not. I love being single and able to come and go as I please. I love myself enough to not need someone else to complete me. Flying solo is the best!",
   "created_utc": 1693576363,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo3yjg",
   "message": "I can come off as cold or aloof, but I'm actually quite friendly. I just need a little time to get used to you. Like a cat.",
   "created_utc": 1693577445,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5agd",
   "message": "That I'm a liberal or left leaning or votes for Biden because I despise Trump and most republican policies.",
   "created_utc": 1693577959,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo69xi",
   "message": "I’m a white male so that says a lot apparently",
   "created_utc": 1693578336,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6ae5",
   "message": "That I give a shit about what they are saying.",
   "created_utc": 1693578341,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo7i5v",
   "message": "That I am a mean person. I am actually super sweet and caring to those I love.",
   "created_utc": 1693578798,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynojgk",
   "message": "That I give a fuck",
   "created_utc": 1693571013,
   "score": 3,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynrzk7",
   "message": "For some reason people IRL often erroneously assume that I'm \"smart\", whatever that even means.",
   "created_utc": 1693572606,
   "score": 2,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynnpie",
   "message": "That I’m a vegetarian. I have pet chickens and fish so I don’t east fish or chicken. I also don’t like the taste of bacon or lamb so only really eat beef but not often.",
   "created_utc": 1693570622,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynoe8c",
   "message": "That I'm embarrassed by them, but I'm just being polite.",
   "created_utc": 1693570942,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynqims",
   "message": "all of it",
   "created_utc": 1693571933,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyntaso",
   "message": "That I am super successful and have all my shit together.\n\nIf only...",
   "created_utc": 1693573167,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyntp66",
   "message": "that I am heterosexual, I mean I don't *sound* bi or wear feminine clothes so I must be hetero *right*?",
   "created_utc": 1693573336,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynuo9s",
   "message": "That I'm wrong",
   "created_utc": 1693573749,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynv6q2",
   "message": "That I want to talk to them. 😅",
   "created_utc": 1693573965,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynvno5",
   "message": "People often cannot determine my sexual orientation.",
   "created_utc": 1693574159,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynvrk6",
   "message": "That I'm smart. I rarely say anything because my brain's on vacation.",
   "created_utc": 1693574204,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynvviq",
   "message": "That I am straight",
   "created_utc": 1693574246,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynworo",
   "message": "That I like ketchup.",
   "created_utc": 1693574569,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynxgtv",
   "message": "That I am stuck up and aloof and think I'm better than them. I'm actually just shy with self-esteem struggles.",
   "created_utc": 1693574884,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynxnjg",
   "message": "That I'm okay.",
   "created_utc": 1693574956,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynyat4",
   "message": "that im a bitch bc i have resting bitch face so when they find out that im nice and actually a people pleaser theyre surprised",
   "created_utc": 1693575216,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynye77",
   "message": "Assuming things by yourself and not communicating is what killed society. They “assume” I am taken all the time, also that I am cold and very serious. People can not take the fact that one can be normal nowadays.",
   "created_utc": 1693575255,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynygd9",
   "message": "I’m cold and snobbish.",
   "created_utc": 1693575279,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynyr2f",
   "message": "That I want to talk to them. I’m an introvert. I know how to put on small talk if I have to. But I really just want to be left alone.",
   "created_utc": 1693575398,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynz18n",
   "message": "That I know what I'm doing.",
   "created_utc": 1693575511,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynz7ia",
   "message": "That I live for the parties - I just love to dance, I only have time to socialize after 2300 and I have a hard time to be alone with myself. So yeah, beers and clubs it is for me. Literally I have no reason to stay at home. If I had my partner here, I would prefer cook something, chill, watch movies, etc.",
   "created_utc": 1693575578,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynzkwv",
   "message": "That I am a liberal. Had one guy assume I was because I have blue hair \u0026amp; I'm covered in tattoos. I was like, what? How does that mean I'm a liberal? He said its because I \"have the look\"..",
   "created_utc": 1693575730,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynzlxn",
   "message": "That I'm nice and gentle. I wear glasses and people think I'm a pious, proper, virgin, religious little guy, but I'm actually a babbling drunk with high tendency to insult others (who deserve it) and I'm really fond of blasphemy, dark humor, and satanism. I also usually tell people what they need to hear but do not want to, and so they're either horrified or furious with me whenever I open my mouth.\n\nI grew a long hair and a Rasputin beard, and now people don't look at me and see a nerdy nerd anymore.",
   "created_utc": 1693575740,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynzwpy",
   "message": "That  I’m an out going happy confident person, when in fact I’m deeply insincere and suffer with depression on the daily….. people think just because your a big guy with muscles that your cocky which isn’t further from the truth.",
   "created_utc": 1693575863,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jynzwvf",
   "message": "That, for whatever reason, I'm promiscuous because I'm bodacious?\n\nI'm a nerd \u0026amp; enjoy thy outdoors.",
   "created_utc": 1693575865,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo03ne",
   "message": "That I'm borderline broke.\n\nI drive my Mum's 20 year old car that she doesn't use any more, get all my clothes in charity shops (which I love and talk about enthusiastically) and the only social events I tend to show up at are festivals. \n\nI make really good money, I'm just very unmaterialistic day to day and spend my money on things people don't necessarily notice or that I don't brag about. I'm also an introvert and find social interaction exhausting so I invest that energy in big events and I'm very quiet the rest of the time. And I go on holiday by myself!",
   "created_utc": 1693575940,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0786",
   "message": "On Reddit… people assume I’m a dude.",
   "created_utc": 1693575980,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0g9q",
   "message": "I live in a small rural area, and people assume I am republican, go to church, and they are really willing to share racist, sexist, or homophobic comments with me.",
   "created_utc": 1693576081,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0j7p",
   "message": "That I’m always late. I’m rarely ever late but rush in at the last minute or show up late once and people never forget. Other people showed up later than me but now I somehow have a reputation for it in my family. I suppose they have to find fault somewhere… ha!",
   "created_utc": 1693576113,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0nfp",
   "message": "Grew up in Utah. Whenever anyone finds this out they assume I’m Mormon.",
   "created_utc": 1693576156,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0poi",
   "message": "That when I was younger, I had to know I was good looking. I never saw myself that way.",
   "created_utc": 1693576179,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0q6j",
   "message": "I'm a big guy. I'm harmless, but people assume I'm a hateful bully and act defensive as soon as I walk in.",
   "created_utc": 1693576185,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0qzf",
   "message": "Three things people always assume about me that is never true:\n\n\u0026amp;#x200B;\n\n1. I'm insecure when I wear my hoodie\n2. I'm wearing makeup\n3. I'm a furry",
   "created_utc": 1693576194,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0t35",
   "message": "I’m generally fairly upbeat and outgoing. I’m also meticulous, analytical and careful. I ask a lot of questions, even when I think I know the answer, because I want to verify that my understanding of things is correct. Because of this I don’t always leap into action immediately unless a situation is serious enough to call for it.\n\nIt’s surprising how many people have thought that those combination of traits means I’m naïve, or unintelligent, or slow, or that I don’t pay attention.\n\nHad someone at work once observe that I’m much sharper than they first thought of me, and that was such a backhanded comment that I actually flinched and did not have a reply to it.\n\nTaking time doesn’t mean I am unintelligent or slow. It also doesn’t mean I’m afraid to act. Just as being outgoing and friendly doesn’t mean I’m naïve, or even that I’m extroverted (social interaction is exhausting to me, I just want to put some good in the world when I do interact).",
   "created_utc": 1693576218,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0tub",
   "message": "I look like a man but I am a woman with hirsutism.",
   "created_utc": 1693576227,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0uez",
   "message": "I look like a man but I am a woman with hirsutism.",
   "created_utc": 1693576233,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo0vuw",
   "message": "That my husband and I are straight. Neighbor thinks we are brothers. Been together 22 years",
   "created_utc": 1693576249,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo11ac",
   "message": "White Americans assume I just moved here and don't speak English. I am a scientist. My parents  moved here when I was 9 and have been here for 50 years.",
   "created_utc": 1693576309,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo140f",
   "message": "I am Muslim just because I am Middle Eastern.",
   "created_utc": 1693576337,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo170b",
   "message": "That I'm gay because of my big butt :(",
   "created_utc": 1693576371,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo170j",
   "message": "That I’m an asshole. I am introverted to the core. Have always had issues looking people in the eyes, introducing myself, holding a conversation, etc. Because of all of this, people just assume I’m a stuck up prick, but I’m trying really damn hard not to come off that way.",
   "created_utc": 1693576371,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo17bl",
   "message": "Im actually this happy and perky all the time. Its a fucking show. You believe it because im putting on a show. You assume that I'm always positive and cheerful because that's what you get from me everyday.",
   "created_utc": 1693576374,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1bsz",
   "message": "That I'm a vegan. Apparently I look like I would be one.",
   "created_utc": 1693576423,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1d45",
   "message": "I’m stuck up because I don’t talk. Usually follows up with, “You’re so nice/funny, I thought you’d be mean”.",
   "created_utc": 1693576438,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1pdc",
   "message": "That I like country music. I don’t know how many times I’ve been told that I look like I would like country. I don’t know what that even means. It’s not like I’m going around in a cowboy hat and boots.",
   "created_utc": 1693576572,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1vmz",
   "message": "1. That I have an eating disorder. I usually weigh about 85 lbs. I am 5 months pregnant right now and weigh about 95 lbs, I eat all the time and just can't put on weight.\n\n2. That I'm a dumb woman who can't make decisions for herself because I'm a stay at home mom who homeschools her 5 kids. I've had several feminists tell me I'm just dumb and easily manipulated and that my husband is making me stay at home barefoot and pregnant like the old days and I should want a job outside of the home. Jokes on them I can do my side job at home lol. I make some money to contribute to the family and I get to stay home with the children like I had wanted to do for years after having a kid.",
   "created_utc": 1693576642,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1wbv",
   "message": "That i am a competent person and leader.",
   "created_utc": 1693576649,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1zap",
   "message": "That I actually am stupid based on how I act to be accepted.",
   "created_utc": 1693576680,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo1zv2",
   "message": "1) That I have no disabilities - I have a few chronic illnesses and was in a wheelchair... now just a cane.\n\n2) That I am a horribly rotten person who is a neglectful and abusive parent (note this is online only, IRL I get the opposite, the truth I'm sure is in the middle).  The fact that your parents abused you and are hurtful to you does not mean that every parent is abusive.  I've had 15 death threats in the past day or so since that \"parents of reddit\" post.",
   "created_utc": 1693576686,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo24g7",
   "message": "People who don't know me assume I'm about 19 because I look younger than I am.",
   "created_utc": 1693576733,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo2866",
   "message": "That I'm mean or angry. I'm a Black male over 6 feet with broad shoulders. A lot of the time people seem intimidated and shy away, assuming I'm going to hurt them or do something bad. However, when people do talk to me, they seem pleasantly surprised that I'm a normal human being. lol",
   "created_utc": 1693576771,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo2k16",
   "message": "that i am dumb, kind, or weak due to being of a smaller stature. submissive? sure. push over? nahhhhh",
   "created_utc": 1693576901,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo2x0e",
   "message": "I’m dumb because i have tattoos. No i just choose to spend my money on permanent artwork instead",
   "created_utc": 1693577043,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo36pg",
   "message": "That i'm mean. Just by looking at me...lol. I will literally talk to anyone, but i guess i have a mean face. Don't know what that means. But, ok...",
   "created_utc": 1693577147,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo38c8",
   "message": "That I‘m the type of person to choose career over family. I‘m a woman in my late 20s, a trainee lawyer and even some of my friends assumed I‘m the person in my friendgroup to most likely never have kids. That one hurt. I love kids and my SO and I talk about having kids a lot. Once we‘re settled of course. People say it‘s just the vibe they get from me. No clue what that means.",
   "created_utc": 1693577165,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo3cll",
   "message": "That I'm super grumpy/mad and intimidating.  Like, guy, im just standing still sipping my coffee and  it speaking for 10 minutes, thinking about life or something.  Is it that strange to just think?",
   "created_utc": 1693577213,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo3ndk",
   "message": "They look at my face and decide, she's definitely rude, not approachable...",
   "created_utc": 1693577326,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo3qxc",
   "message": "That I'm an airhead. \n\nA taxi driver once said to me \"you study PHYSICS?? You don't look like you'd study physics!!\" 🤦‍♀️",
   "created_utc": 1693577363,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo421t",
   "message": "That I am capable of anything and I'm a good problem solver. Nah. I have ADHD, half the time I'm in panic, I don't even know what I am doing and why.",
   "created_utc": 1693577483,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo43cj",
   "message": "My age. Apparently i look 10 years younger",
   "created_utc": 1693577496,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo44lv",
   "message": "That i am sad. I must have a \"resting sad face\".",
   "created_utc": 1693577511,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo45nb",
   "message": "That i get bitches..",
   "created_utc": 1693577522,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo45og",
   "message": "That my life is easy and i think about nothing!!!! I hate when people think that m dumb",
   "created_utc": 1693577523,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4a9e",
   "message": "That I eat much just because I eat fast.",
   "created_utc": 1693577572,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4kjw",
   "message": "I've been working in retail for seven years. \"Customer service mode\" turns on the moment a stranger begins talking to me. People think I'm legitimately interested in talking to them about their lives, when I honestly don't care but can't shut it off.",
   "created_utc": 1693577683,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4l9i",
   "message": "Im an asian guy with glasses. People assume im bad at driving and good at math. I'm actually bad at both.",
   "created_utc": 1693577691,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4n3k",
   "message": "Opinions based on my demographics. It happens all the time, I'll be having a conversation with people who don't know me well and they assume I share some of their views/opinions because most people who fit my profile do.",
   "created_utc": 1693577711,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4nm1",
   "message": "That I'm a mom because I'm fat and the \"correct\" age to have kids.\n\n\nI am fat but that's due to an eating disorder and I pray to God I never have kids because the stress on my body from that will likely kill me.",
   "created_utc": 1693577716,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4o5v",
   "message": "That i actually care at all about what they think about how I live my life, choose to dress, anything really…..to many people seem to think that they should have input on others life no matter what….we’ll got news for you people like that….it’s my life, my choices….and I don’t give a fuck what you think",
   "created_utc": 1693577722,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4p52",
   "message": "that because I’m an only child it automatically means I grew up ‘spoilt’ and had everything ‘my own way’.\n\n…I was abused and neglected. And spent most of my time as an only child frightened and alone. \n\nI find people also take my (although now drastically improving-pleased to say) shy/quiet mannerisms for arrogance as a result of this assumption also, when actually it’s just trauma.",
   "created_utc": 1693577732,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4paj",
   "message": "That I’m super self-confident. I don’t know how they come up with this… \nAlso everybody appreciates my upfront and straight forward demeanor. If they only knew that I keep most of my thoughts to myself.",
   "created_utc": 1693577734,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4r1k",
   "message": "People think I'm rude because I don't talk much",
   "created_utc": 1693577754,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4tlh",
   "message": "That I have fucks to give.",
   "created_utc": 1693577781,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4vxp",
   "message": "That I'm arrogant, which couldn't be further from the truth. I'm a confident person, and I walk, talk and behave as such. It certainly doesn't mean I'm arrogant. I think people, especially since Covid, have become more unsure of themselves, so I come off that way.",
   "created_utc": 1693577806,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4xpb",
   "message": "That I’m 10 years younger than I am",
   "created_utc": 1693577824,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4ylv",
   "message": "People often think that I am dumb/stupid or don't know how life works. I do know how life works, but I am quite angry for the fact that many things should not have to be this way. And then people think that I am negative, while I am actually sad that people are not solving their issues.",
   "created_utc": 1693577834,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo4ysd",
   "message": "That I'm unhealthy, unfit and have never played sports.\n\nI'm a bit fat to be honest, and that's because I like food. However I go to the gym 3 times a week and can smash a workout, I used to play rugby, and I'm a good swimmer. I've been told by fellow gym goers, who have worked out with me that I'm a lot fitter than I look.\n\nI'm pretty sure I'd have a better body if my diet was better.",
   "created_utc": 1693577835,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo51x1",
   "message": "Age.\n\nI still have a baby face well into my 20s, but it's starting to become less round and mature a little... I think.",
   "created_utc": 1693577869,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5302",
   "message": "That I'm mentally weak or dumb because I'm emotional. fckn high IQ mfers. I'm sick of that shit.\n\n\u0026amp;#x200B;\n\nEDIT: took out the exact number",
   "created_utc": 1693577882,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo55nc",
   "message": "People always thought of me as super smart because I did well in school. I would say I'm actually pretty average, just good at remembering shit.",
   "created_utc": 1693577910,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo59im",
   "message": "That if you fuck with me, i will become aggressive, atleast according to the fact that i have been in two fights at school, in the span of 3weeks",
   "created_utc": 1693577949,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5dzu",
   "message": "That I'm posh",
   "created_utc": 1693577994,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5ejz",
   "message": "That I’m happy.",
   "created_utc": 1693578000,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5fq0",
   "message": "I really love my family when I don’t. I live with my two older parents. They don’t have dementia, and they don’t care for me either. I don’t make any money and I am slowly putting myself though school. Multiple times new empty nesters have pulled me aside to tell me they’re proud I am taking care of them. I am not and wouldn’t.",
   "created_utc": 1693578012,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5i8u",
   "message": "Apparently, whenever I'm not around, my coworkers all make jokes about how \"grumpy\" I am. But I'm not grumpy at all. I just hate them and want them to die.",
   "created_utc": 1693578039,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5j3h",
   "message": "For some reason, the first impression thst people seem to get from me is that I'm either gay or special need (which I'm not) so I'm not sure what's happening there",
   "created_utc": 1693578048,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5kbt",
   "message": "I’m short and chubby and ask a lot of questions.  People often think I’m naive.  I’m not…I’m a bit sneaky in my approach and can be quite persuasive.",
   "created_utc": 1693578062,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5p7m",
   "message": "Angry 😆 since I'm always in my resting .... face",
   "created_utc": 1693578114,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5r0v",
   "message": "People assume that I eat lots of crappy food and don't excersize. \n\nI just look big since being ill years ago.  It changed my body and I'm never going to be thin again. Big deal, I'm alive, well and happy.",
   "created_utc": 1693578134,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5t5u",
   "message": "That I am/was a teen mom. I’m almost 30 years old and my child is 5. I just happen to be 5 feet tall, petite build and smallish chest, and have flawless (in the least cocky way ever, but shout out to genetics) skin. The oldest age I’ve had someone assume for me is 24 and they said “I feel like that’s pushing it” but 18/19 is the norm. I went back to college at 27 and many classmates believed I was a new high school grad lol. I also get stopped by security in the liquor store, before I can even pick something up, so I have gotten use to having my ID ready before even walking in, because telling them I’ve been legal for 10 years (I’m in Canada) has never worked and in one case only made matters worse when I was accused of lying after following up “I’ve been legal for 10 years believe it or not” with  “technically I only have to show the cashier my ID when purchasing alcohol”.\n\nThe only *somewhat* benefit to this is telling creepy men I’m a minor when they try to talk to me (obviously creepy means saying the word minor doesn’t phase some of them)",
   "created_utc": 1693578156,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5t5x",
   "message": "That I played basketball. I’m 6’5”. That’s not exactly huge for a basketball player. I usually turn it around and ask if they played miniature golf lol. I played baseball and football for the record. Not that it matters 😂",
   "created_utc": 1693578156,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5vxt",
   "message": "That i “don’t eat” just bc i’m skinny or tell me i need to eat more bc of it. One thing i’ve always hated about that is when- and kind of unrelated- if you say you DONT like being as skinny as you are, people will berate you for it saying “i’m sorry you’re skinny😩 im sorry you fit the beauty standards” like srsly bro? So it’s okay for ppl to be insecure about their overweight body but not the other way around?  Bffr. Not every skinny person has a perfect model-hourglass curvy body. \n\n  It’s all “body positivity” until it comes to a skinny person complaining about how they don’t like their weight. Overweight people aren’t the only ones allowed to have insecurities about their weight thank u. Your problems have nothing to do with mine, if i want to be insecure about being underweight i will💀👍",
   "created_utc": 1693578185,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo5ykz",
   "message": "That I'm a lot younger than I really am. It's been a consistent thing in my life, and as I've gotten older, I've really began to appreciate it, but some times it's annoying. \n\nMost recently, I was in an uber and the driver was asking me what I do because I was on a work trip and I explained my job. He just looked up at the rearview mirror at me and said \"How old are you? You don't look like you're old enough to have done everything you say that you did\". I was a little taken aback, but laughed and told him my age.",
   "created_utc": 1693578214,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo60jw",
   "message": "That I'm really interested in their scented candle and essential oil business.",
   "created_utc": 1693578235,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo62bh",
   "message": "That I’m devoid of emotions bcs of my facial expressions. Some say I’ve a doll like mannerisms which is odd",
   "created_utc": 1693578254,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo64jk",
   "message": "When I watch a movie or a series, especially sitcoms, my family thinks I'm in a good mood. In reality, when I watch a sitcom, I feel terrible and it is my coping mechanism.",
   "created_utc": 1693578278,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo659b",
   "message": "That I'm (finally) dead.\n\nMissed one, Harry!",
   "created_utc": 1693578286,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo67rq",
   "message": "People often think I'm \"up to no good\" bc I have lots of piercings and tattoos. But my full-time job is taking care of dementia patients. I hug and kiss the ones who let me, I sincerely have a soft spot for them 🩵",
   "created_utc": 1693578312,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6avg",
   "message": "That, because I have a traditional name and live in a well-off area (with parents), I am over 70 years old - I'm 30 and keep getting flyers addressed to me for assisted living and special lifting chairs that are easier to get out of!",
   "created_utc": 1693578346,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6ax3",
   "message": "People assume I'm lazy or don't have a \"real job\" because my average shift starts at 10am (which means I can sleep until 8ish everyday, so it's not as real?).",
   "created_utc": 1693578346,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6b74",
   "message": "My age",
   "created_utc": 1693578349,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6exp",
   "message": "I look like a capable, straight, country boy manly man who you wouldn’t want to fight.\n\nI’m actually a nerdy awkward gay guy who can’t throw a punch.",
   "created_utc": 1693578388,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6hro",
   "message": "That im Mexican,...........full blood native American",
   "created_utc": 1693578419,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6k5y",
   "message": "For some reason i give off \"square\" vibes to a lot of people and they are surprised when i tell them that I've smoked weed/done lsd/shrooms\n\nAnd yes I've tasted alcohol but I'm firmly set on not getting drunk, it doesn't seem that appealing to me",
   "created_utc": 1693578445,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6l8l",
   "message": "That i am this small defenseless dainty little girl. I am about to be 30 and curse like a sailor - the look on peoples faces is priceless. Obviously if i am in company of a child younger than teens or someone 70+ i calm it down but people my own age? Nah i will act how i am, i am not putting on a show for those who are probably the same way. I just don’t care anymore mostly 🤷‍♀️",
   "created_utc": 1693578456,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6ldy",
   "message": "That I’m a satanist. Lol I might dress a little weird but I’m Jewish af",
   "created_utc": 1693578457,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6nqi",
   "message": "That I am depressed. One time in school the kid who sat next to me started to roll up my sleeves to see if I was self harming",
   "created_utc": 1693578482,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6nyd",
   "message": "That I’m always sick. My right vocal cord is paralyzed and has been my whole life. I sound extremely raspy and soft spoken (but I talk up a storm lol, God knew the world could t handle me with a loud voice and loud personality! 🤪). For those that know me, know that’s not the case, but for someone unaware, it’s a whole explanation lol (I’d rather tell them to educate them, I never get mad/upset when someone assumes I’m sick, I’m very aware of how I sound.). Kids are the funniest with asking about it (the parents get mortified while I’m cracking up!). Even if someone doesn’t ask, if I know in conversation that they have a baby at home, I’ll just tell them and be like I’m not a health threat 😂 (I’m a barber so sometimes new customers tell me oh we just had a baby then it’s like automatic for me, oh I’m not sick!).",
   "created_utc": 1693578484,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6pk9",
   "message": "That I’m mean, conniving and a general asshole, when in reality I’m naive and a trusting idiot.",
   "created_utc": 1693578501,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6qor",
   "message": "That I'm smart.",
   "created_utc": 1693578512,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6qz0",
   "message": "That's I'm selling Dragon Porn.\n\nThat was ONE TIME!",
   "created_utc": 1693578516,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6vps",
   "message": "Apparently I give off “gay” vibes? I’ve been mistaken for a lesbian basically ever since I was old enough to date. I’m not even bi. Sure, women are pretty, but I like boy parts.\n\nI have no idea why this is a thing, and I’ve had numerous awkward situations arise because of this weird and incorrect assumption.\n\nMy SO said it’s because I’m “like 70% dude” 😂",
   "created_utc": 1693578564,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo6y7e",
   "message": "Everything about me. I'm missing the middle center section of my hair, people assume drugs. No. Alcohol,  severe anxiety. I picked it out because I just feel the need to do so. I did quit, it's growing back. The need and itch is still there especially when the scabs form.\n\nI have no teeth. Out of pity, they were all pulled so id quit having infection after infection in my face. My father force fed me when I was little, so I grew up having a food trauma that has no name or any kind of help. My mom was no help either. Just me to deal with no experience in the nutrition/ food area, small bit, but it's gotten so extreme I can't self help myself anymore.\n\nI attempted suicide and they told me the muscle relaxer I attempted overdose on will be stuck in my spinal fluid the rest of my life. On top of it, I experienced a traumatic brain injury. I'm sure I cracked my skull. But hey. At least I'm hard headed.\n\nYou can't explain that shit to people when it's *that* bad. It's embarrassing. It's difficult to.. explain. I assume nutritional deficiency, but hey, I'm not a nutritionist. It sounds fake, but my reality is painfully real. I blame myself every. Fucking. Day. For breathing and for being such a burden on myself and others, I wish I had died in the hospital. I did my best until it got out my hands now I'm extremely lost.",
   "created_utc": 1693578589,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo71d3",
   "message": "I was a people pleaser and often played dumb most of my life. Learned early that nobody really likes a clever chubby dude. \n\nPeople in my life assume I’m still the same but after losing a bunch of weight and being put on anti depressants a lot of them have had some rude awakenings when I speak my mind.",
   "created_utc": 1693578622,
   "score": 1,
   "submission_id": "1675hep"
  },
  {
   "comment_id": "jyo7rpg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1675hep"
  }
 ]
}