{
 "submission_id": "16757pc",
 "title": "women of reddit, what’s the biggest misconception about periods?",
 "selftext": "",
 "created_utc": 1693569754,
 "permalink": "/r/AskReddit/comments/16757pc/women_of_reddit_whats_the_biggest_misconception/",
 "score": 203,
 "url": "https://www.reddit.com/r/AskReddit/comments/16757pc/women_of_reddit_whats_the_biggest_misconception/",
 "comments": [
  {
   "comment_id": "jynmb7t",
   "message": "that we can hold it in\n\nfollowed closely by tampon size being proportional to vagina size",
   "created_utc": 1693569937,
   "score": 141,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynnn65",
   "message": "Its all liquid... In reality its like a really gross slime, with massive stringy clots in it\n\nEdit: so my most up voted comment is about when subros decides to slide his way out from the depths of hells gates, thank you so much!",
   "created_utc": 1693570589,
   "score": 85,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynqpri",
   "message": "It slowly comes out and goes straight out…women with period issues feels the gushes, clots and it going up their ass crack",
   "created_utc": 1693572024,
   "score": 25,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynzs7c",
   "message": "That women all have it the same or similar. This is a misconception I get from both genders. Just because you have a period doesn’t mean you know how mine feels. I had a three month long continuous period a few years back due to an organ torsion in my ovary and a lot of women were very unsympathetic. I was going through a pack of overnights a day and wearing two pairs of pants yet my female coworkers made a big stink to my male boss about me not wanting to work overtime over a “little bleeding.” Made me boil with rage like a pot of spaghetti noodles. If you’re one of those #blessed types that has a three day trickle and some tummy bloat once a month good for you but don’t speak for those of us that have to live with the 7-9+ day painful apocalyptic crime scene simulator. We are not in the same boat.",
   "created_utc": 1693575811,
   "score": 165,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynmf32",
   "message": "In my country it's believed that menstrual blood is harmful\n\nW h a t",
   "created_utc": 1693569990,
   "score": 145,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyodtqx",
   "message": "That painful periods are normal. For years I was suffering for 4-5 days before my period's start, the first two days I couldn't leave the bed but my gyno simply prescribed some magnesium for the cramps. Turns out it was endo which is nuch more common than anyone would think. The other thing that always bothered me is that women who actually have normal periods simply cannot understand and are trully not sympathetic. I've faced so much sceptisim from other women...",
   "created_utc": 1693581136,
   "score": 134,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynz0i3",
   "message": "That you only need one tampon/pad a day. That the flimsy 10/$1.25 brand is going to work as well as a good brand.",
   "created_utc": 1693575503,
   "score": 179,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynmgsq",
   "message": "My bf thought it was all liquid",
   "created_utc": 1693570014,
   "score": 84,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynpjt2",
   "message": "That some men think we can just turn it on and off and that we're exaggerating!\n\nI absolutely detest tampons, a tiny bit of cotton wool stuffed up my muffin was not comfortable, nor it is stop the bucketful's of blood running out of me like a tap, all over my muffin, bum, trousers and anything I sat on! Give me pads or adult diapers any day!",
   "created_utc": 1693571484,
   "score": 112,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyo7ogz",
   "message": "That everybody is different. Periods suck bc there are random side effects that may come w them, but it’s unique to that person\n\nFor me, I get extreme physical fatigue. My back usually hurts through my period, but for some reason the first day it feels like my back is actually broken. Like I cannot stand up all the way straight, nor am I lift anything- not even my baby. And it’s always the beginning of my period, and the pain self corrects as the week continues.",
   "created_utc": 1693578865,
   "score": 52,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyo6gmu",
   "message": "That you can rollerblade with a massive smile on your face whilst menstruating.",
   "created_utc": 1693578406,
   "score": 127,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyoqopf",
   "message": "\"It'S JusT BloOd, how bad can it really be?\"\n\nOk bub, you wanna strap into the endometriosis simulator? Cool, we'll start with having you sit in this chair, don't mind the spikes in the seat and back, just get comfortable. What? You can't? Oh right, we added two knobs in the back to stimulate back pain, oh well. Now, we'll add the cattle prod up the ass... What? No, bud this is only simulating day one. Jerry will be around in a minute with the bucket of day old blood and clots, just sit tight while I put this clamp around your head. \n\nAwwww, he ran away before we could add the fish hooks and peanut butter shits!",
   "created_utc": 1693585766,
   "score": 45,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyo8aow",
   "message": "That there is any measure of control over them. And that high levels of pain and blood loss to point of passing out is \"normal\"",
   "created_utc": 1693579093,
   "score": 29,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyooxd3",
   "message": "That it should hurt. Period pains are a thing but they shouldn't be interfering with your life. The number of times women have had their pain dismissed is absolutely ridiculous just because people think it's normal.",
   "created_utc": 1693585145,
   "score": 34,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynnec5",
   "message": "The cramps are in the one place, once the cycle is over your hormones stop raging and your no longer \"emotional\" \n\nThat we all like tampons- I refuse to wear tampons because the first time I did I was meme walking like shrek and Bakugo katsuki had sex, people said \"its just not up far enough\" if I had pushed that mother fucker any further up it was gonna come out my nose.. What's more young woman who got there's for the first time won't be comfortable with shoving something up there fanny since most of them are 12!!!",
   "created_utc": 1693570469,
   "score": 58,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynqwgi",
   "message": "That is doesn’t hurt *that bad* and we’re just putting it on.",
   "created_utc": 1693572110,
   "score": 60,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyodie3",
   "message": "That one's period blood and tissue comes out from the same place that we pee from.\nRead up on your human biology, dude! 🤣🤣🤣",
   "created_utc": 1693581016,
   "score": 20,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyont1s",
   "message": "People (almost always it's men) think that we lie about having terrible pain. My lower belly hurt so bad that i screamed in pain, couldn't walk and wanted to throw up. Now I'm on birth control and it helped me, I'm not in such pain. But that was horrible before the pills. So get help if you're in so much pain, that's not normal!\n\nAlso, we can't hold it in! And we don't bleed and pee from the same hole. My acquaintance thought that we do...\n\nYou can get pregnant even on period. Aaand the amount of blood is different for everyone. Aaaand it's not just pure blood. It's also parts of tissue from the womb which falls off during period, some slimey thing from vagina and other stuff\n\nI may add something later",
   "created_utc": 1693584747,
   "score": 20,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyodos6",
   "message": "That it is a missed conception?",
   "created_utc": 1693581083,
   "score": 72,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyonc2u",
   "message": "The amount they claim we bleed, it is more than that",
   "created_utc": 1693584582,
   "score": 17,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp34jv",
   "message": "That you can just put in a tampon and go cavorting around in white pants.",
   "created_utc": 1693590266,
   "score": 18,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyojwx0",
   "message": "Apart from just the actual bleeding and cramps, there’s a lot of symptoms that are just plain strange that people are generally unaware of.  One weird one is that your sense of smell varies when you’re about to hit your period — I can tell when mine is on the way because the smell of coffee in the morning is suddenly WAY more apparent.",
   "created_utc": 1693583368,
   "score": 16,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyom01i",
   "message": "You only get cramps while on your periods.",
   "created_utc": 1693584106,
   "score": 16,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp0edc",
   "message": "I get pissed when one woman discounts another woman’s pain during their cycle. My mother downplayed my horrid periods the entirety of my youth as her’s were rare (super irregular) and no big deal when they arrived. My pain was severe with nausea/vomiting and near passing out. Once I was wheeled out of high school as I could not walk. It was awful as I had already stumbled to the bathroom to puke and pass out at the toilet. My mother was mortified at my “overreaction.” \n\nWhile in labor with my first kid I was wrapped up in the monitor for contractions and my mom was kinda snarky and wanting to know how I felt and kinda letting on that now I would know true pain. I told her it was uncomfortable but not that big of a deal as it felt exactly like period pains. She said something about how it would get worse….blah, blah, blah….. then the next contraction registers on the machine and she watched the intensity go up and up and up. She was flabbergasted. I just looked at her right through the contraction, calm as a cucumber, and told her you can get used to a lot of pain when you have to endure it for years on end. She said “I never knew.”  I said she did but didn’t believe me because it was not her own experience. She now laments at how awful my periods were and there was just nothing she could do to help. Eye-roll. Anyhooo….. about 40 hours later that kid was cut out of me as I never dilated a centimeter.",
   "created_utc": 1693589278,
   "score": 18,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp3d2k",
   "message": "My husband, an intelligent man with a physics degree, thought for a long time that we stuck pads directly to our vaginas.",
   "created_utc": 1693590348,
   "score": 14,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyoqgng",
   "message": "That we can control it.\n\nIt's not the same as pee. Think of it as a bloody nose. It happens when it happens.",
   "created_utc": 1693585686,
   "score": 14,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp381w",
   "message": "Ok I’m gonna go there…period poops and farts. Sorry men, it might change how you look at us fundamentally if you really knew lol. And i have to pretend is everything is fine, dandy, and normal when all i want to do is lay in bed and fart. \n\nOne more thing: if something bothers your girl and she’s on her period, don’t chalk it up to being hormonal exactly. If it bothers us during our periods be assured it bothers us all the time. Just, when we’re on our periods we don’t have the patience to bury it under 6 gulps of willful silence. It may seem out of nowhere to you but trust me, it’s there all the time.",
   "created_utc": 1693590301,
   "score": 37,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyohjzd",
   "message": "That we are full of hormones during our period.  \n\nOur hormone levels are actually very low when we are bleeding compared to the rest of our cycle.",
   "created_utc": 1693582524,
   "score": 10,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyoyx84",
   "message": "That it is just blood. There are clumps. Think liver",
   "created_utc": 1693588748,
   "score": 13,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp8bja",
   "message": "That cramps are only in the lower abdomen or lower back. Hell no. I cramp EVERYWHERE. lower abdomen, my back, my vagina, my clit, my urethra, my rectum, my hips, my thighs. It’s bad.",
   "created_utc": 1693592153,
   "score": 10,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypb5jc",
   "message": "1. That every woman has the same symptoms during their cycle.\n2. That they last a set amount of time.",
   "created_utc": 1693593269,
   "score": 7,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyoy45d",
   "message": "It is NOT normal for your cramps to hurt so much that they debilitate you. Some people have cramps that are like headaches, a little annoying but with an ibuprofen it’ll go away. \n\nI get cramps so bad that it’s feels like my back, legs, and hips have concrete in them and if I move there’s huge flares of pain. Even if I’m not moving, the cramps come in waves so hard I can’t concentrate on anything except not throwing up. I used to wake up crying in high school because I thought I was having appendicitis, then go to school the next day with cramps and on 3 hours of sleep. When I told a doctor this, they kept saying “oh it’s normal for your cramps to hurt! Here’s some ibuprofen.” I was on 800mg three times a day and it did NOTHING to help.\n\nEventually I got a doctor to listen to me, and they found out I had endometriosis. Now I have an IUD, get my period maybe every 2-3 months, and it’s super light with little to no cramps. The relief had been so sweet 😭",
   "created_utc": 1693588456,
   "score": 12,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypkekn",
   "message": "The amount of ass washing you need to do. So, so much.",
   "created_utc": 1693596661,
   "score": 12,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jynnt99",
   "message": "That the average teen girl/young woman NEEDS hormonal birth control to \"regulate \" their cycles. \n\nWhile birth control can be used to treat symptoms of certain conditions that cause painful cramping and irregular cycles, it isn't the only treatment option, and it isn't necessary for most young girls.",
   "created_utc": 1693570672,
   "score": 27,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyov838",
   "message": "That you have to have them every month . When birth control pills were invented in the ‘60s all medical professionals OBGYN knew that birth control pill could be taken nonstop for a year or longer, but they thought women would want to have a period and PMS to feel normal every month.",
   "created_utc": 1693587408,
   "score": 9,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyowm2d",
   "message": "Anything an incel posts about them. \n\nWe can't hold them till we get to a toilet, we need more than 20 tampons a year, it isn't a sign we are rotting from the inside out, it's not more painful to be a man, etc.",
   "created_utc": 1693587909,
   "score": 11,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyonzv7",
   "message": "That we’re bleeding, like a wound.  It’s more like sloughing off a scab.",
   "created_utc": 1693584814,
   "score": 3,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp3914",
   "message": "That birth control would make it better",
   "created_utc": 1693590310,
   "score": 3,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp9ncb",
   "message": "That they end all sentences. But some sentences end with question marks and others end with an exclamation point.",
   "created_utc": 1693592663,
   "score": 3,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypeeef",
   "message": "That it’s less blood than it actually is \nSome men I’ve met think we go through 1 pad a day or one pad a cycle when in reality it can get up to 5-6 pads a day or more",
   "created_utc": 1693594450,
   "score": 4,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyph68k",
   "message": "That it's not embarrassing. To all the boys in my class, yes, it is embarrassing to bleed out of your butt during maths. Yes it is!!",
   "created_utc": 1693595462,
   "score": 8,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyphkfx",
   "message": "I have a couple.\n\n- We also find our periods gross, we know it is natural but it is still gross for us, the ones who handle it.\n\n- \"Just use the cheaper tampons, it won't cost you much\" , you know ones that don't last 2 minutes and the risk of toxic shock is higher because they are cheaply made.",
   "created_utc": 1693595609,
   "score": 7,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypt4jm",
   "message": "It’s really not nature’s finest design.\n\nGot a lot of flaws.",
   "created_utc": 1693599912,
   "score": 5,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyq1sws",
   "message": "That periods last for one week each month.\n\nI may have a gap of 5, 7, or 10 years between periods, I hardly ever menstruate, but they can last a week or six months.\n\nStop believing that women should be able to tell they are pregnant immediately due to their period being late. \n\nThat stupidity is staggering, but dudes still write legislation based on the assumption that you must just know quickly if you are pregnant.",
   "created_utc": 1693603186,
   "score": 3,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyq38sp",
   "message": "That women become purely emotional and/or can’t be trusted to make rational decisions while on our periods.",
   "created_utc": 1693603747,
   "score": 5,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyovn1u",
   "message": "That you can control your hormones. Riding the dragon becomes an art form as you get older. You paste a smile on your face when you want to kill everyone. Then you get your period and feel full of love. Those hormones are strong! Be kind to teenage girls going through it! They are Powerful enough to make another human!",
   "created_utc": 1693587555,
   "score": 6,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyovrz3",
   "message": "That every woman has terrible cramps and a week-long period with a week of PMS beforehand. I have an IUD now and don’t have them anymore but when I did, they were light, not too painful, and ended pretty quickly.",
   "created_utc": 1693587604,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp5u61",
   "message": "That it's just blood. There's all sorts of stuff in there...",
   "created_utc": 1693591247,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp8eez",
   "message": "That we’re being “dramatic” or exaggerating when we complain about the pain, fatigue, and inconvenience of it all. Like no, Sorry… I can’t just “vomit on command” to “fake” how severe my pain is it really does hurt *that bad*",
   "created_utc": 1693592180,
   "score": 3,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp9v9k",
   "message": "That all women have periods that are the same",
   "created_utc": 1693592762,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypavhr",
   "message": "That they get easier/ less intense after you’ve had a baby. Sometimes it’s the opposite. Nobody told me that was an option I was shocked when it happened.",
   "created_utc": 1693593169,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypu64w",
   "message": "Some guys think women/girls can \"hold it in\" until they get to a bathroom. Ha.\n\nSome people don't understand why some women get anemic every month. I had anemia for my whole young adult life. Birth control pills curbed the flow, but made me sick as @#$#. A former friend actually said to me, \"But you're not *supposed* to be anemic. That's supposed to be separate blood.\"",
   "created_utc": 1693600298,
   "score": 3,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypv9ie",
   "message": "That's it's only blood, cramps and mood swings.",
   "created_utc": 1693600710,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypw2xl",
   "message": "The change in hormones would make me irritable and very very very depressed(Suicidal at times). It was like night and day with very sudden changes too. I used to think it was normal to have such intense mood swings until I realized that not everyone got to a point where they wanted to self harm or kill themselves 😬",
   "created_utc": 1693601023,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypxc5a",
   "message": "Not a person who menstruates, but I heard an account a while back of a man who thought that *all* women who menstruate do it the same time, during the full moon.\n\nThat would have affected the course of human history, I think.",
   "created_utc": 1693601489,
   "score": 5,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jypzkec",
   "message": "That I can't pee cuz I have a tampon in",
   "created_utc": 1693602330,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyq07ug",
   "message": "that everybody gets period cramps",
   "created_utc": 1693602577,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyq4okv",
   "message": "That it's blood like what comes out of a paper cut or busted nose.\n\nIt's *soooooooo* not.",
   "created_utc": 1693604306,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyq7v53",
   "message": "Probably that it’s “just pain.” Periods can cause diarrhea, lightheadedness, nausea, fainting, etc",
   "created_utc": 1693605578,
   "score": 3,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyq8a1m",
   "message": "That they’re easy",
   "created_utc": 1693605746,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyqa5gd",
   "message": "That it only lasts a week for everyone",
   "created_utc": 1693606514,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyqap3y",
   "message": "My whole life I’d had periods that traumatized some female friends when I told them about it. I mean, sometimes splattering bathroom stall walls with blood when changing mega-tampons plus full size pads hourly.\n\nLast year I had a water ablation to stop post menopausal bleeding. When I found out more about ablation, how effective it is at reducing excessive bleeding, and how long it’s been around, I was so angry. WHY had NO doctor ever offered this to me? Why do doctors let us suffer without giving us options? \n\nI’ve always been super vocal and open with doctors, but I’m not a specialist. People complain about drug commercials on tv in the US, but at least some people find out that new treatments happen every day.",
   "created_utc": 1693606741,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyqcfoo",
   "message": "We can't control when it comes, and it days change when we get it, it is not always on the same days",
   "created_utc": 1693607476,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp0e13",
   "message": "That periods are a life disrupting horror show.\n\nHonestly... Even though I bleed like a stuck pig for the first couple days (have to use overnight pads and change them every 3 hours), after a couple years it just becomes normal. \n\nA little inconvenient and gross but normal.",
   "created_utc": 1693589275,
   "score": 5,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyp5ppz",
   "message": "We can’t just “hold it”. It’s not pee.\n\nAlso yes, they really ARE that painful",
   "created_utc": 1693591202,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyop8ez",
   "message": "That we can “pee” it out or control it. \n\nYou’d be surprised how many men have said this to me.",
   "created_utc": 1693585250,
   "score": 1,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyq8err",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyph8lz",
   "message": "That being on your period makes you bitchy. Who among us has not heard \"Must be on the rag\" or some other snide comment when we respond irritably.\n\nLeaving aside that there are plenty of non-hormonal reasons to be irritated, and that \"every woman is different\" --\n\nYeah, I am often irritable, impatient, or short tempered a few days BEFORE my period starts. It's called PMS for a reason. The \"P\" stands for \"pre\". Once my menstruation starts, it's a relief. Yes, there are other symptoms then, but the irritability disappears. So no, I'm not on the rag when I'm snippy with you. But I probably will be soon.",
   "created_utc": 1693595486,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyqf9rx",
   "message": "That because it happens monthly, we get used to the pain. It hurts every time. It feels like a brain freeze in your pelvis for 3-5 days",
   "created_utc": 1693608688,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyqhyoj",
   "message": "That it’s just cramps… umm lot more to it than that.",
   "created_utc": 1693609858,
   "score": 2,
   "submission_id": "16757pc"
  },
  {
   "comment_id": "jyqbxyi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16757pc"
  }
 ]
}