{
 "submission_id": "1677x0e",
 "title": "What's a common belief that's straight up bullshit, yet somehow most people believe it?",
 "selftext": "",
 "created_utc": 1693576753,
 "permalink": "/r/AskReddit/comments/1677x0e/whats_a_common_belief_thats_straight_up_bullshit/",
 "score": 48,
 "url": "https://www.reddit.com/r/AskReddit/comments/1677x0e/whats_a_common_belief_thats_straight_up_bullshit/",
 "comments": [
  {
   "comment_id": "jyp3y3s",
   "message": "Commonly believed myth: Wolf packs have competition among wolves that determines their status. So alpha wolves, beta wolves gammas and so on, and the pack ruled by an alpha male in an alpha female.\n\nThat is discredited research that was actually refuted by its author . That research was based on captive wolves who formed artificially large packs.\n\nIn the wild, a wolf pack is a nuclear family .\n\nSo if you were going to kill your alpha male and mate with the alpha female, you’d be killing your father and fuck your mom .\n\nThat’s why members of the Wolfpack don’t mate with each other. they’re literally brothers and sisters and Parents.\n\nNot every wolf has children . And the wolves that don’t have children helped raise the Cubs.\n\nBut that’s because those are there siblings!\n\nhttps://phys.org/news/2021-04-wolf-dont-alpha-males-females.amp\n\nWhen people call a human being an alpha male, for instance, that does not exist .\n\nAt least not the way they think it does. They think it means being ultra dominant against other males and often violent..\n\nThat is not a thing.\nI’ll tell you how to be an alpha male. \n\nWhat is An alpha male wolf ?\n\na dad who provides for his family . \n\n🙏❤️",
   "created_utc": 1693590560,
   "score": 12,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyohia3",
   "message": "That if you shave, your hair will grow back thicker and longer",
   "created_utc": 1693582508,
   "score": 42,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo8wae",
   "message": "That a salary increase can lead to a lower net income because of tax brackets.\n\n(I am not talking about the welfare cliff, which is different and very real.)",
   "created_utc": 1693579315,
   "score": 187,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo6btg",
   "message": "Most of what's marketed as \"recyclable\" is just that - marketing. \n\nThe vast majority of what we put into the recycling bins in our homes never gets recycled. If it doesn't end up in a landfill in your own country, it's likely shipped off to some other country's landfill. \n\nIt's not your fault. You're still doing the right thing by thinking about separating trash from recycling, it's just not meaningful.",
   "created_utc": 1693578356,
   "score": 235,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo5ual",
   "message": "HR dept will have your best interests at heart and not just looking out for the company.",
   "created_utc": 1693578168,
   "score": 112,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp7vge",
   "message": "You don't get a cold from being cold, it's a virus",
   "created_utc": 1693591995,
   "score": 69,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo3pax",
   "message": "Waiting 30 minutes before swimming",
   "created_utc": 1693577345,
   "score": 176,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo9ary",
   "message": "One common belief that lacks scientific support is the idea that people only use 10% of their brains, which is a myth perpetuated in popular culture despite being scientifically inaccurate.",
   "created_utc": 1693579467,
   "score": 132,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyop0hz",
   "message": "That Breakfast has to be the standard foods associated with breakfast.",
   "created_utc": 1693585176,
   "score": 85,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo638p",
   "message": "That most spiders are something to be feared.",
   "created_utc": 1693578264,
   "score": 45,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo9q5m",
   "message": "* **You need to drink 8 glasses of water a day** [(You don't)](https://www.google.com/search?q=you+don%27t+need+8+glasses+of+water\u0026amp;oq=you+don%27t+need+8+glasses+of+water\u0026amp;aqs=chrome..69i57j69i64.3492j0j4\u0026amp;sourceid=chrome\u0026amp;ie=UTF-8)\n* **Diamonds are rare and valuable** [(they're not)](https://www.theatlantic.com/family/archive/2021/01/diamonds-arent-special-and-neither-is-your-love/617859/)\n* **The lady that got burned my McDonalds coffee didn't deserve to win** (S[he deserved to, and McDonalds was straight up evil](https://www.tortmuseum.org/liebeck-v-mcdonalds/))\n* **Unions are bad** ([They're the best worker protections in history](https://www.epi.org/publication/unions-and-well-being/))\n* **You need to know your carbon footprint**  (You don't. [It's a made up term](https://interestingengineering.com/culture/carbon-footprint-coined-by-big-oil-to-blame-you-for-climate-change) the oil industry created to stop people blaming them and instead blame themselves)",
   "created_utc": 1693579627,
   "score": 200,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyofdai",
   "message": "The belief that the way things are, is the way they have to be.",
   "created_utc": 1693581710,
   "score": 81,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyoppfc",
   "message": "The classic eat x spider a year while sleeping",
   "created_utc": 1693585417,
   "score": 42,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyob550",
   "message": "The customer is always right.",
   "created_utc": 1693580149,
   "score": 60,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp4fy9",
   "message": "Gmo's are bad. Everything has chemicals in it just enjoy your life",
   "created_utc": 1693590743,
   "score": 13,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyovg5f",
   "message": "I don't blame people for not understanding this intuitively, because math. But here goes.\n\nIt's a common misunderstanding that just being \"in space\" causes an astronaut to become weightless. As in, just get high enough above the surface, and you start floating instead of falling.\n\nReality:  astronauts are always falling, all the time. They appear \"weightless\" because the spaceship they're in is falling around them at the same velocity. Just that they *also* have enough horizontal velocity that the Earth's surface curves away from them as they fall, so that they can never land.\n\nIf it were possible to build a skyscraper at the same height as the Space Station's orbit, you could take an elevator to the top floor and stand there, weighing almost as much as you weigh back down on the surface.",
   "created_utc": 1693587487,
   "score": 25,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyozplo",
   "message": "Carrots don't improve your eyesight, that was a troll during WW2 to prevent the Germans from knowing about Radar.\n\nOr so I heard.",
   "created_utc": 1693589033,
   "score": 27,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp004i",
   "message": "You have to drink x amount of water a day. And x being quite a lot.\n\nIf you get thirsty you drink. Excess drinking will cause strain on your kidneys and drain vitamines from your body.\n\nPrior to the 90s, people were not carrying waters bottles with them, or keep one at the workplace. You drank if you were thirsty. Today I see people obsessive about drinking water.",
   "created_utc": 1693589134,
   "score": 29,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp4egr",
   "message": "Horoscope/astrology",
   "created_utc": 1693590727,
   "score": 17,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypa0gw",
   "message": "That apparently male genitalia can permanently change a woman's anatomy, and you can tell how many partners and how recently she's been with based on her genitalia. Also, somehow, 100 men 1 time is somehow different in terms of \"usage\" than 1 man 100 times because apparently women have memory foam vaginas that form to a man and therefore many different men mean \"looser\" vagina. That having many past partners affects your about to \"pair bond\" or some dumb shit, making \"ran through\" women less loveable partners. \n\nThe people who spit this nonsense are brainwashed or are just having a fragile ego, because they weren't the woman's first and only, that means they're less special, as if women are a one time use item. Then again, men who think like this DO think of women as one time use items and have a disturbed and distorted view of women. They're gripping their dicks with a gorilla grip and wondering why they can't feel anything. If a woman is loose, it's because she's turned on. No, your girl welcoming you after you being away for some time \"loose \" doesn't mean she cheated, just that she's excited to see you. If she's \"tight\", then that's either medical, purposeful clenching for your pleasure (like kegals), or she's nervous or not turned on enough. That last one is a problem because of you go in before she's warmed up it can hurt her, but if she's to nervous, unless she's a virgin then you're probably not ready and she's not comfortable enough around you.",
   "created_utc": 1693592827,
   "score": 24,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp5xvd",
   "message": "That verbal abuse isn't abuse and that it builds strong character. Please stop whoever believes this",
   "created_utc": 1693591286,
   "score": 18,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyos3ve",
   "message": "That you can guarantee that people will fall for you.",
   "created_utc": 1693586281,
   "score": 8,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyozntk",
   "message": "Lactic acid is bad for your muscles.\n\nYour muscles THRIVE on that shit. The more lactic acid the faster and harder they work. Every damn research paper I found in more than a decade says its good and better.\n\nUnfortunately it started with a research that saw increased lactic acid buildup, saw increased micro damage to the body, and said “yep, that’s what causing it”. Completely ignoring the possibility that lactic acid buildup does not necessarily have to be the cause. You are working hard, that causes the damage.\n\n“But its acidic!”\n\nYeah, but the product that becomes lactic acid is just as acidic, and that causes no damage at all when its in the muscles beforehand. Because muscles are kinda build to handle that shit, and they do better with lactic acid because thats the exact time you NEED to be better.",
   "created_utc": 1693589015,
   "score": 15,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyokfzm",
   "message": "That sugar makes you hyper. It doesn’t, it’s just an old myth.",
   "created_utc": 1693583551,
   "score": 52,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp05o8",
   "message": "Income tax rates apply to your entire wages.",
   "created_utc": 1693589190,
   "score": 13,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyowdcb",
   "message": "Hitler being rejected from art school, caused him to rise to power and start WWII. I know it’s more of a joke, but people utter this stupid reductionist joke so often it gets tiring.",
   "created_utc": 1693587821,
   "score": 5,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypd8u8",
   "message": "That cracking your knuckles causes arthritis. Not only has this been disproven, but by that logic - wouldn't cracking all the other joints in your body every time you stretch cause arthritis?",
   "created_utc": 1693594030,
   "score": 7,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyoaanw",
   "message": "That working gives your life meaning and value. You have that just by existing.",
   "created_utc": 1693579834,
   "score": 30,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo2sw6",
   "message": "Trickle down economics",
   "created_utc": 1693576997,
   "score": 77,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo38kt",
   "message": "All politicians are the same",
   "created_utc": 1693577168,
   "score": 71,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp5z8s",
   "message": "There are chemicals that turn pool water a different colour when someone pees in the pool.  This lie has been decreasing urine levels in public pools for decades.",
   "created_utc": 1693591300,
   "score": 6,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo7iyw",
   "message": "Ten second rule",
   "created_utc": 1693578807,
   "score": 23,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp5g89",
   "message": "Not most, but way too many. Astrology. There's adults in the world that believe the planets positioning during your birth has a humongous impact on your personality.\n\nRealistically, every person is capable of every behavior humans express, so *of course* your horoscope gets at least one thing right. That's because the personality traits listed are *human* traits, go figure!\n\nThese people are allowed to vote, buy guns (in my country at least), the whole nine yards. Shit's absolutely wild to me. Same shit applies to the yahoos that think minerals impact their mood or the course of their life. How low is their bar of evidence required to sway their beliefs? God damn.",
   "created_utc": 1693591103,
   "score": 19,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp69qo",
   "message": "That you are exception and can make money betting",
   "created_utc": 1693591406,
   "score": 5,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp7b35",
   "message": "One common belief that is complete nonsense, but for some reason many people believe it, is the myth that people only use 10% of their brains. In fact, we use all of our brain resources, although not always efficiently. This myth originated in the early 20th century and still lives on in the minds of many people thanks to books, movies, and other sources of popular culture",
   "created_utc": 1693591789,
   "score": 5,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypbe5j",
   "message": "That you should let the food cool down, before you put it in the fridge.",
   "created_utc": 1693593352,
   "score": 6,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypdqav",
   "message": "Hydrogen peroxide should be used to clean wounds.\n\nIt was assumed to be a good idea because the body naturally produces it for that purpose, but research revealed carpet bombing an open wound with a strong oxidizing agent is not a good idea.",
   "created_utc": 1693594207,
   "score": 5,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyppxhs",
   "message": "That the Republican Party is “For the People”.",
   "created_utc": 1693598707,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyoyw9j",
   "message": "That wasn’t real communism, it will work this time!",
   "created_utc": 1693588738,
   "score": 27,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo35h9",
   "message": "Billionaires earned their money",
   "created_utc": 1693577134,
   "score": 71,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyogstu",
   "message": "90% of the belief on reddit",
   "created_utc": 1693582244,
   "score": 16,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyovv5t",
   "message": "That a dead persons beard carries on growing after death. The face shrinks giving that illusion.",
   "created_utc": 1693587635,
   "score": 8,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyponx4",
   "message": "Vaccines cause autism.\n\nThe single Dr who made the claim, had it debunked- and he was disbarred for making it.",
   "created_utc": 1693598233,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypp78n",
   "message": "God.",
   "created_utc": 1693598432,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyosdo5",
   "message": "That meat is unhealthy.",
   "created_utc": 1693586381,
   "score": 25,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo8842",
   "message": "money can't buy happiness",
   "created_utc": 1693579067,
   "score": 21,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp41vl",
   "message": "That the earth is flat.",
   "created_utc": 1693590599,
   "score": 7,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyovypn",
   "message": "Pot is completely harmless.",
   "created_utc": 1693587670,
   "score": 17,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyoibro",
   "message": "The idea that we only use 10% of our brains seems pretty common but it's nonsense.",
   "created_utc": 1693582808,
   "score": 9,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyotoxf",
   "message": "That diet drinks are actually good for you.",
   "created_utc": 1693586858,
   "score": 6,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp8had",
   "message": "When something is beyond comprehension, it must be supernatural. Ehrm. No.",
   "created_utc": 1693592209,
   "score": 7,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo31tz",
   "message": "The government is for the people.",
   "created_utc": 1693577095,
   "score": 21,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyonno0",
   "message": "That children can’t receive sex education and that they are incapable of understanding these concepts…",
   "created_utc": 1693584693,
   "score": 20,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp3o91",
   "message": "Theistic religions",
   "created_utc": 1693590460,
   "score": 17,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo6o3s",
   "message": "that weed isn’t addictive",
   "created_utc": 1693578486,
   "score": 20,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp2wpe",
   "message": "Your blood in your veins is not blue.  Blood is always red. Blood that has been oxygenated (mostly flowing through the arteries) is bright red and blood that has lost its oxygen (mostly flowing through the veins) is dark red.\n\nThe bluish color of veins is only an optical illusion. Blue light does not penetrate as far into tissue as red light. If the blood vessel is sufficiently deep, your eyes see more blue than red reflected light due to the blood’s partial absorption of red wavelengths.",
   "created_utc": 1693590188,
   "score": 3,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypequ1",
   "message": "Everyone’s smart enough to graduate college",
   "created_utc": 1693594571,
   "score": 3,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypgc9g",
   "message": "That it's illegal to drive barefoot",
   "created_utc": 1693595153,
   "score": 3,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyprg90",
   "message": "Religion",
   "created_utc": 1693599277,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyoy1ql",
   "message": "White people were never slaves.",
   "created_utc": 1693588433,
   "score": 28,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyolzay",
   "message": "That the brain isn't fully developed until the age of 25. Everyone is different and you can't put a hard line on when everyone's brain is developed. 25 is just an age that sounds right but isn't 🤷‍♀️",
   "created_utc": 1693584098,
   "score": 10,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo3fta",
   "message": "People disagree with each other, because they lack knowledge.",
   "created_utc": 1693577246,
   "score": 9,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyodfq0",
   "message": "That the “Free Market” is an actual thing that can be achieved and not a framework for explaining markets and optimizing them to benefit people.",
   "created_utc": 1693580991,
   "score": 11,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyoyaze",
   "message": "astrology",
   "created_utc": 1693588524,
   "score": 6,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo3oy1",
   "message": "Trump is innocent",
   "created_utc": 1693577342,
   "score": 25,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo3xad",
   "message": "Flat Earth",
   "created_utc": 1693577432,
   "score": 12,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyo5ask",
   "message": "Black people can not feel pain/have an extraordinary pain tolerance. This is a very common myth that is taught to medical doctors around the world. When Black patients go to their primary doctor or an emergency room to say they have pain, many times they’re accused of drug seeking. \n\nI always recommend to anyone, get a Black doctor. They don’t believe that myth and are more open to listen to whatever is bothering you. \n\nI just discussed this with my nurse, who is a Black woman. She said it was posted in nursing school. She even told me she had another parent who went to the ER and they refused him medication. She had to intervene. \n\n[Myth](https://historyofyesterday.com/the-myth-of-black-people-not-feeling-pain-is-still-believed-to-this-day/)\n\n[National Library of Medicine](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4843483/)",
   "created_utc": 1693577962,
   "score": 14,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp3p3q",
   "message": "That Jesus is God and also God is his son, and also that God killed himself/his son to provide forgiveness for my “sins” that are only sins because he said so? Make it make sense.",
   "created_utc": 1693590469,
   "score": 10,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp5060",
   "message": "It's not sex if you stick it in the butt, you'll still be a virgin",
   "created_utc": 1693590944,
   "score": 5,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypd9lh",
   "message": "Politicians are doing what's best for their constituents.",
   "created_utc": 1693594038,
   "score": 5,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyot3g7",
   "message": "\"Some guy in ancient Rome built a steam engine so therefore the fall of the Roman empire set the course of human history two thousand years.\"\n\nThis one drives me fucking crazy.  It is so unbelievably idiotic on so many levels you could probably teach an entire college course on why its bullshit.  I'll see if I can limit it to a few bullet points though.\n\n- One guy in ancient Rome building a crude, primitive steam engine that had almost no practical use does not mean the Romans were one step away from creating the entirety of the 19th century with all of its thousands upon thousands of scientific, technological, philosophical and cultural breakthroughs.  It's like thinking that two kids who strung two paper cups together with a piece of string are just right around the corner from building a global telecom network.\n\n- The fall of Rome is probably the most overblown event in human history, thanks to brilliant writer but shit-tier historian Edward Gibbon.  Empires collapse all the time and the results are rarely ever apocalyptic and in fact often do more good than harm (just look at all the empires that collapsed in the 20th century and how much nobody misses any of them).  The fall of the Roman empire may, at most, have set back the progress of European culture just a bit but - and it's real easy to forget this if you live in the West - Europe =/= the world.\n\n- \"But just imagine if the advances of the Roman empire had been able to continue unimpeded.\"  Here's the thing: that happened.  It's called the Byzantine Enlightenment and it's one of the most important events in human history that produced some of the most brilliant minds the human race has ever known (seriously, go look up the accomplishments just of Avicenna and Averroes, to say nothing of countless other major Byzantine scholars).  The tide of human progress never stopped: it just shifted from Europe to the Middle East for a few centuries (to say nothing of all the important work Indian and Chinese scholars did during this time as well).  But you never hear about the Byzantine Enlightenment in the West because if there is one thing Westerners don't ever want to talk about it's Brown people proving themselves to be smarter than White people.\n\nIf you've ever wondered what kind of technological wonderland we'd live in right now if the Roman empire hadn't collapsed just look around you.  Steam engine or no steam engine, in terms of science and technology almost nothing would be different (culturally though, who knows?) and can we please stop spreading this stupid, stupid myth?",
   "created_utc": 1693586643,
   "score": 10,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp6i33",
   "message": "That health insurance companies need to exist, and “allow for us” to have greater control over our healthcare. And also that it is cheaper (for citizens) than any government run program would be.",
   "created_utc": 1693591491,
   "score": 4,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp3czo",
   "message": "The election was stolen",
   "created_utc": 1693590347,
   "score": 8,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyp9iut",
   "message": "Daylight Savings is for the farmers (the ones dealing with livestock actually find it to be a pain).",
   "created_utc": 1693592606,
   "score": 2,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypfyr5",
   "message": "That whining to companies about their questionable practices will result in them changing.",
   "created_utc": 1693595017,
   "score": 2,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypjtk8",
   "message": "The earth is flat",
   "created_utc": 1693596442,
   "score": 2,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypk96h",
   "message": "Religion.  All forms of it… Creation theory. Some higher form created the universe. The power of prayer. Heaven, hell,  karma.  Anything to do with some mystical being who creates, destroys, can hear you, influence outcomes… It’s all complete bullshit and  only a small minority of the worlds population understand this.",
   "created_utc": 1693596604,
   "score": 2,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyplf9a",
   "message": "God",
   "created_utc": 1693597041,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyplip4",
   "message": "Jesus Christ is our lord and savior",
   "created_utc": 1693597077,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypno2d",
   "message": "That THC is not addictive, and does not cause short and long term negative effects.",
   "created_utc": 1693597863,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypnr2s",
   "message": "Macs don't get viruses. \n\nThat's bullshit. Are you less likely to get a virus on a Mac than a Windows PC? Yes, because Mac OS has safeguards built into the operating system that protect you from viruses and hackers. Microsoft is trying to do that with Windows 11, but there's really no such thing as a completely hack proof operating system. \n\n But that doesn't mean that you're completely immune. It's just like driving. Take the necessary precautions and checkups before you venture out, and don't do anything stupid, and you'll be fine.",
   "created_utc": 1693597894,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypnrbq",
   "message": "\"Searing the steak seals in the juices.\"",
   "created_utc": 1693597896,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypns1t",
   "message": "\"You'll get most of your taxes back at the end of the year. So, really, you only pay like a small amount of taxes. \"\n\nNo, you won't, and no, you don't, you big dummy.",
   "created_utc": 1693597904,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypntzw",
   "message": "Flat earth",
   "created_utc": 1693597924,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypol9d",
   "message": "That when a woman has sex with a lot of men, or a man with a big penis in her vagina gets “loose”. This is straight up innaccurate and a total myth that is used to Shame women and curtail their sexuality. In reality, how large or small a woman’s vagina is is much like a man’s penis. Genetic. A virgin can have a large one and a prostitute can have a small one.",
   "created_utc": 1693598208,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jyppraj",
   "message": "That MSG is bad for you",
   "created_utc": 1693598643,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypqcug",
   "message": "Theistic religions.",
   "created_utc": 1693598865,
   "score": 1,
   "submission_id": "1677x0e"
  },
  {
   "comment_id": "jypadhd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1677x0e"
  }
 ]
}