{
 "submission_id": "167arvn",
 "title": "What was something fairly small that made you feel betrayed by your SO?",
 "selftext": "",
 "created_utc": 1693583328,
 "permalink": "/r/AskReddit/comments/167arvn/what_was_something_fairly_small_that_made_you/",
 "score": 7,
 "url": "https://www.reddit.com/r/AskReddit/comments/167arvn/what_was_something_fairly_small_that_made_you/",
 "comments": [
  {
   "comment_id": "jyoph5a",
   "message": "I had a friend who dumped his gf when he overheard her making fun of his (admittedly, rather nerdy) sister to her friends.\n\nHe said it wasn’t just about loyalty to his sis, it was about not wanting to be with someone who has to put others down to feel better about herself.\n\nAlways thought it was admirable.",
   "created_utc": 1693585335,
   "score": 164,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp079u",
   "message": "It's small, but one year we were both working 15-18 hour days but had thanksgiving off. I planned the menu, he didn't give input. I ordered the ingredients online during my lunch break to pick up after work because I didn't have time to shop. I woke up early, made everything. Cleaned the dishes and the kitchen after. All he did was complain. I made too much. I had too much wine (3 glasses over 7 hours). After all that work and not even a compliment or a thank you? Yeah- we divorced. That was our last thanksgiving together.",
   "created_utc": 1693589205,
   "score": 241,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp5wl8",
   "message": "We were going through airport security together. She went first and when she was being screened, pointed at me and said \"make sure you check my boyfriend, he always has knives\" as a joke *and then I got detained for a search and questioning and almost missed the flight*. And no, I didn't have any knives other other contraband on me. Then she got mad at me for almost missing our flight.\n\nLIKE WHAT DID YOU **THINK** WOULD HAPPEN HERE **EMILY**",
   "created_utc": 1693591272,
   "score": 136,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyovcxa",
   "message": "The most extreme case I know of is my dad and the girlfriend he had before my mom came along.\n\nHe and the gf were high school sweethearts and had been together for three years. They were both dying to see Back to the Future 2, a movie that had been highly anticipated for years.\n\nHe had a family emergency the day it came out so they agreed to see it the following Monday. He found out from friends she went to see it with a douchey guy friend my dad never really liked.\n\nHe was so hurt, and she was so unapologetic (her attitude was “I’ll go see it with you too! Why did I have to wait?” even though they’d agreed to see it together) he told her they needed to take a break.\n\nHe fully meant for it to be temporary, just until he cooled off, but then he met my mom when he went to see the movie by himself…and he never looked back. He does feel a bit guilty though because his ex was pretty devastated when she found out he’d met someone else and wanted to end things for good.",
   "created_utc": 1693587456,
   "score": 58,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyokbtq",
   "message": "Seeing my girlfriend casually flirting with other guys. Letting them drape their arms over her and laugh into her neck, while drinking.\n\nIt seemed oddly intimate but she said I was being insecure and paranoid. I finally had to walk away because we had different ideas on what it meant to be in a relationship.",
   "created_utc": 1693583511,
   "score": 203,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyowonq",
   "message": "I had recently married my now ex-wife.  We were moving overseas for a few years after I finished up some training for the Air Force.  She wanted to visit some family several states away so I told her to do that while I finished the training and we'd meet up afterwards.  My father's birthday was during this period.  I got him a card, signed it and then mailed it to her for her to sign and send it to him.  Pre-addressed, postage paid and all she had to do was sign and drop it in the mail.  I finish training, fly out to meet her and guess what's laying on the floorboard of her car on the passenger side?",
   "created_utc": 1693587934,
   "score": 37,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp4dkf",
   "message": "When he got Covid, he was quarantined downstairs. I waited on him hand and foot. Three days later, I got Covid but while he was feeling better and still quarantining himself, I had to be sick and care for our son. I was stooped over the counter trying to make him dinner and he just went back downstairs. I’ll always remember that",
   "created_utc": 1693590718,
   "score": 98,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyoyl9n",
   "message": "I taught our dog how to “speak” (bark on command). This took a lot of treats and lot of patience on my end. She got annoyed with because the dog was barking and I was saying “speak” over and over. At a party I overheard her telling her friends that she taught him that trick.",
   "created_utc": 1693588626,
   "score": 43,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyoomsx",
   "message": "I found out my girlfriend was still talking to her ex and lying about it. He was thousands of miles away. She was comforting him about his parents' divorce. I believe nothing inappropriate happened. And if she'd been honest about it we might have been fine.\n\nReally, it was the lying for me.",
   "created_utc": 1693585041,
   "score": 29,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyovd41",
   "message": "My ex took me out to a nice anniversary dinner. I can never finish a restaurant entree so I took half home. He knew I really loved the meal and was looking forward to leftovers. He ate them while I was at work. \n\nIt was a small betrayal and I didn't break up with him or anything. There wasn't a fight, no drama. But it did kinda taint the anniversary memory for me, can't lie.",
   "created_utc": 1693587458,
   "score": 117,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp0k18",
   "message": "Other people have told me this is a small thing and I should have gotten over it:\nMy ex's friend didn't like me and would regularly make nasty comments about me, or sexual comments about my body. My ex would pretend he hadn't heard or would leave the room so I was left alone with his friend.\n\nUnfortunately, this is one reason why he's an ex, but others have told me it wasn't a big deal x",
   "created_utc": 1693589334,
   "score": 129,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp69rv",
   "message": "not asking me if i want anything from whatever fast food place he’s stopping at on the way home… it’s so small but it makes me feel like he isn’t thoughtful toward me.\n\nedit: can y’all please read my other comments before jumping in and acting like my husband kicks puppies lol it’s not that serious.",
   "created_utc": 1693591407,
   "score": 121,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp41t8",
   "message": "We were talking about cooking/presentation, and he said, “yeah, you don’t do pretty”.\n\nIt’s been echoing in my head ever since.",
   "created_utc": 1693590598,
   "score": 6,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyol4cg",
   "message": "My girlfriend knew that her sister was cheating on her boyfriend. She had been cheating for at least six months.\n\nMeanwhile I had been reassuring this dude (the sister's bf) that he was being paranoid and his girlfriend was completely devoted to him (at least that's the impression I got from her). My girlfriend KNEW I was reassuring this dude and fully approved of it.\n\nWhen I found out her sister was cheating, my gf KNEW her sister was cheating, had lied about it, and had allowed me to mislead this guy I was very hurt.\n\nShe said it wasn't her place to tell and, frankly, it wasn't her business or my business.\n\nI had to break up with her, I couldn't be with someone who felt that comfortable with infidelity within a relationship. She thought I was overreacting to something that had \"nothing to do with us.\"\n\nI don't know, maybe I was. All I know is that I didn't feel comfortable with her anymore.",
   "created_utc": 1693583793,
   "score": 123,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp0rdo",
   "message": "My ex would skip the songs I liked that came on the radio.",
   "created_utc": 1693589409,
   "score": 249,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp0lua",
   "message": "When I was assaulted by being groped in the street he did nothing.   He looked at me like “what, do you want me to make a scene ?”",
   "created_utc": 1693589353,
   "score": 48,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyor1nx",
   "message": "I knew a guy who ended an engagement because he found out his brother had kissed his fiancée and she hadn’t told him.\n\nShe told him nothing happened. She pushed him away. It never happened again. And she didn’t tell him because she didn’t want to ruin his relationship with his brother.\n\nHe believed her, but he said he couldn’t trust her.\n\nI never really agreed with that decision because I totally get where she was coming from when she didn’t tell him. They were a good couple too, it was sad to see them part ways.",
   "created_utc": 1693585894,
   "score": 69,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyooeq8",
   "message": "My high school girlfriend lent my hoodie to someone else",
   "created_utc": 1693584961,
   "score": 193,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp0yna",
   "message": "Small but we moved in together. Made a deal, no smoking in the house. Few weeks in, come home and she is smoking at her desk. Front door was six feet away. Maybe minor but I don’t think it was a big ask",
   "created_utc": 1693589484,
   "score": 226,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp770i",
   "message": "When I was married about 5 years in and far from home, I got to work and my car battery died. I called my husband at the time because I needed help. I needed help because I had no idea how to replace the battery and needed a ride to go buy a new one.\nIt still confuses me to this day. He said \"I'm off work but I'm heading out to go hunting. Go have your work friends help you\" And he refused to come help me. I never felt so alone and worthless. \nLike if my mom called my dad, he'd be there in minutes! If I was home, I could have called buddies in different counties even and they'd be there to help me. But he absolutely refused to come help. It was the beginning of the time where if I had any self-esteem, I should have clearly seen the signs of continued cruelty and divorced him.",
   "created_utc": 1693591745,
   "score": 249,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp1mxj",
   "message": "We had our first date in this super cute pub in a super cute town. \n\nThen over the next few years that pub was our spot. When we got married we had our wedding reception there.\n\nSeveral years later, living several hours away from that town my husband tells me he’s going to go stay with his friend in that town because the pub is shutting down and they’re gonna have one last hurrah. I already had plans that weekend I couldn’t get out of, but I was never invited. \n\nMy husband is usually super considerate so I was pretty taken aback and still feel hurt about it.",
   "created_utc": 1693589727,
   "score": 11,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyor3n4",
   "message": "[deleted]",
   "created_utc": 1693585914,
   "score": 37,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyorljo",
   "message": "Being friends with a guy that she knew had feelings for her\n\nBut to be fair that escalated to her denying he was making moves on her, getting a matching tattoo with him and not telling me until after it was over, and then leaving me for him because \"she was tired of me questioning her so much\"",
   "created_utc": 1693586095,
   "score": 167,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp43fe",
   "message": "Wife made a snide remark about my niece checking herself into the mental ward at the hospital cause she could feel a episode coming on and didn't feel like she should be unsupervised at the time. My wife also suffers with mental health issues and ya know i thought would understand this kind of stuff. I drove my niece to the hospital and walked her in myself and made sure she got checked in ok.",
   "created_utc": 1693590615,
   "score": 142,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp8jno",
   "message": "Wasn't a deal breaker or anything but it was really disappointing hearing they continued watching shows I thought we were watching together when I wasn't around.",
   "created_utc": 1693592234,
   "score": 96,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp5wei",
   "message": "Ex-SO, not current. Eating my specialty, extra expensive food items I buy because I have GI issues when there were literally the same items (ex: gluten free Breton crackers and regular Breton crackers) he could have had in the house leaving me with no snacks. Not just once, but many many times over the course of three years. Not the reason we broke up but I did not understand why he kept eating my stuff. They didn't even taste better than the regular version!",
   "created_utc": 1693591270,
   "score": 111,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp9uu6",
   "message": "My ex husband would tell me he was going to plan a date for us after I would beg him to take on the mental load of planning something nice for me rather than me doing it for him every time. He would talk up the date he was planning for days, when the day would come and we are getting ready to get in the car he would say ‘where do you want to eat?’ Not only did he not plan a date ahead of time but then he put the mental load of figuring it out on me right as we were leaving.\n\nThen after we would go back and forth on where to eat as we are driving there he would suggest EVERY RESTAURANT WE DROVE PAST INSTEAD OF WHERE WE CHOSE TO GO. It was insanely frustrating.",
   "created_utc": 1693592757,
   "score": 169,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp9byy",
   "message": "my ex, they read my journal/diary. But thats prob not a “small” thing. Rather a huge red flag but..",
   "created_utc": 1693592522,
   "score": 40,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypamsg",
   "message": "We had downloaded a couch co-op game to play together and completed the opening and had lots of fun, but I had worked a 12 hour night shift and desperately needed some sleep.\n\nWhile I was sleeping she found a not busy online friend and beat the entire puzzle game without me.",
   "created_utc": 1693593083,
   "score": 77,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypbpkm",
   "message": "My girlfriend had a male friend who was 350+lbs but super vain and thought the only woman worthy of him were playboy centerfolds… she had been friends with him for probably 10+ years in the same friend group before we meet and started dating. We both had friends of the opposite sex so at first it was no big deal but the dude would turn any interaction sexual..she had made comments in the past to the friend group she was apart of how she never wore underwear and always took her pants off the moment she got home from work…at first I was pretty tolerable but he started mentioning it whenever I would go hang with her friend group and all his jokes with her were sexual in nature and the constant sexual innuendo from him was non stop even on her social media pages he would always post memes about “during sex” and “ best friend application nudity required” shit like that..I started questioning her about it and she always defended him saying that’s just how he was, but he wasn’t like that with any of the other ladies in the group.  I did a little more digging and found out that when they first had met my girl had asked him out(she was 100 lbs heavier at the time before a weight loss journey when I met her) he turned her down on account of his vanity like I said dude was somewhere between 350-400lbs but thought the only woman worthy of him we’re playboy models…after I found that out I told her I wasn’t comfortable with how close they were.  I told her I thought he was using my girlfriend to get his kicks since none of the woman he wanted, wanted him back or anything to do with him for that matter.  She backed off and things were ok for a bit until one day he wrote on her Facebook that he bought them matching shirts and she should come visit him some time they could watch movies in their underwear together on his couch. I told her right then and there the moment I saw it that her relationship with dude was done if she wanted our relationship to continue.  She texted him and told him that was in appropriate being that she was in a relationship with someone else.  I thought that was the end of it until one day my girl left her phone in my ride my curiosity got the better of me so I checked to see his reply and the dude called me insecure and my girl agreed with him…ended the relationship later that week when she asked why I told her because of my insecurities",
   "created_utc": 1693593466,
   "score": 82,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypcdpr",
   "message": "I spent our entire marriage managing him; making his appointments, getting him places on time, making sure thank you notes were written and bills were paid, cleaning the house, caring for the baby, doing the dishes, reminding him to brush his teeth, and so on.\n\nI finally got burned out and divorced him.\n\nA couple years later, when discussing an autism screening (he has every sign of autism), he said, \"I'm just not gonna get tested, since it's had no adverse effect on my life so far.\"\n\nThe divorce meant nothing?\n\nRunning me into the ground meant nothing?\n\n(Happy ending: I'm married to a man who manages himself, the kid's 16 and has at least ADHD if not autism, and I'm teaching him good habits. Like cleaning and brushing his teeth.)",
   "created_utc": 1693593716,
   "score": 125,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypb8gd",
   "message": "Me and my SO are LDR, we call each other every night for daily updates. Whenever there's a problem with my earphones (like static or mic problems) I try to solve it right away. Sometimes, I even buy new earphones even though my current is still functioning well, just for the sake of his hearing comfort. \n\n... BUT whenever the problem is on his end, he makes a little to no effort to fix it. I even endured a MONTH of static communication on his end. And when I had enough, I used the magic word PLEASE. Yes he threw the earphones but now we're talking on speaker phone and I hear everything LOL.\n\nI feel betrayed with the lack of effort. He can afford to buy a new one (he works at DOST). He even have spare earphones he uses when he travels at work with his motorcycle.",
   "created_utc": 1693593297,
   "score": 34,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp92p7",
   "message": "The day we got back from hospital, I pumped out a bottle so he could feed our son for the first time. He gave it to his mom instead",
   "created_utc": 1693592428,
   "score": 88,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypdzzh",
   "message": "We would go to the grocery together, and he would immediately split away from me, get his items, check out, and then wait after the register or outside the building for me to finish. I can’t explain it, but that really pissed me off. My current boyfriend walks through all of the aisles with me, and I really appreciate the extra company and time with him. It makes a mundane task much more enjoyable.",
   "created_utc": 1693594305,
   "score": 93,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyojvuz",
   "message": "I know my bf felt betrayed, in his last relationship, when he found out his SO was sharing intimate details of their private life with her friends. It wasn't even anything bad (I was one of those friends so I was privy to it) but he felt she had no right to do that without checking with him, just as he wouldn't go around describing details of her body to his friends without checking with her (or, you know, at all).",
   "created_utc": 1693583358,
   "score": 150,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp8vtq",
   "message": "She denied knowing me three times.",
   "created_utc": 1693592358,
   "score": 55,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp2jci",
   "message": "When she could not be bothered to save any money for us but then turned around and socked away 2 grand to buy into and MLM.",
   "created_utc": 1693590053,
   "score": 64,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyorhf1",
   "message": "My bf kept calling me “naked grandma” last night after I got out of the shower lol.",
   "created_utc": 1693586053,
   "score": 96,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp7mm1",
   "message": "He picked up a prescription for me and called to ask my middle name. We’ve been together for eight years.",
   "created_utc": 1693591907,
   "score": 94,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypc6qk",
   "message": "His mother LOVES escape rooms. They were fun the first 5 or so times, but now Ive been to 40+ and honestly I hate them deeply, but I go along anyway. He decided to tell his entire family that I hated them in the middle of an escape room.",
   "created_utc": 1693593643,
   "score": 44,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp8iez",
   "message": "This is a super tangent but when my son was three, he came out of his room looking for his chips. He *never* gets chips and he was so excited and proud that he saved some for later. Well mom (me) ate them. He came out the room, asked about his chips, I told him what happened, he said *”You ate my f***in chips?”* and it was the first and last time he ever cursed (he’s 9 now) and man I just know that was his first feeling of betrayal in life.",
   "created_utc": 1693592221,
   "score": 75,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp8ofm",
   "message": "I always had a better memory than him, he’d forget things very easily, and anytime I brought up something I remembered but he didn’t he’d call me a liar. Seems silly maybe even comical, but really messed with my head when he began to call me delusional and I honestly wasn’t sure if I was or not. Started to question my reality.",
   "created_utc": 1693592283,
   "score": 90,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp9aj1",
   "message": "When my ex apartment-sat for me, I told him not to invite anyone over without my permission. He invited his best friend over literally just to bake a dessert and lied about it.\n\nI said “if I asked [best friend], what would she say?” That night he texted her asking her to lie to me.\n\nI would’ve been annoyed that he crossed a boundary, but it bothered me even more that he would go so far as to get his friends to lie to me—and it was so upsetting to see that they’d be willing to do it.",
   "created_utc": 1693592506,
   "score": 76,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp7ojb",
   "message": "He was a pathological liar. He lied about almost everything he told me about himself.  If I knew the truth I would have never married him.",
   "created_utc": 1693591926,
   "score": 26,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp84us",
   "message": "When he eats all of the leftovers of something that he knows he should have shared. Makes me feel irrationally betrayed.",
   "created_utc": 1693592089,
   "score": 48,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp9mfq",
   "message": "When I couldn't add my male coworkers as friends on Facebook but it was okay for him to have his female friends. His words were, \"They're men they're not trying to be your friend they just wanna fuck you\"",
   "created_utc": 1693592651,
   "score": 61,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypbin7",
   "message": "My boyfriend at the time knew how much I loved wingstop fries. They're kinda undercooked and limpy, I love them so much. One time we were at wingstop and he ordered them well done without telling me. Normally he would just always order me my own fries from wherever, so this made me realize that he just didn't like me anymore.",
   "created_utc": 1693593394,
   "score": 34,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp80t5",
   "message": "He went some random girl’s animal crossing island to hang out",
   "created_utc": 1693592048,
   "score": 70,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp9mmu",
   "message": "My husband is flirting with his ex on Messenger. To be fair, it's nothing overt and she doesn't seem to be flirting back, but he seems to find a way to make a seemingly sexual innuendo out of nothing (stuff that even she seemed baffled by). When I flirt with him, he generally just seems uncomfortable. \n\nAnd I can't really say anything to him about the flirting because then he'll know I looked at his messages with her and he'll see that as a worse offense than some light flirting. I don't know what to do or how to feel.",
   "created_utc": 1693592653,
   "score": 18,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypa5xg",
   "message": "When I was pregnant they ate the rest of my fuckin blueberries. I’m not still upset tho. Definitely not.",
   "created_utc": 1693592894,
   "score": 64,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypi4su",
   "message": "Ex asked me to stop singing along to a song on the radio. I was in the backseat, he was up front with a friend. I wasn't singing loudly, just kind of to myself. I know I'm no professional but I've been told I can carry a tune at least. My heart fell in my stomach. I was so embarrassed.\n\nIn contrast, my husband will stop on random songs on the radio and wait just to see if I start singing along lol Married 11 yrs and he only recently admitted to playing this game with himself.",
   "created_utc": 1693595819,
   "score": 34,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp7xl5",
   "message": "Found a picture of another woman’s breasts on his phone when I was 8 months pregnant with our daughter.",
   "created_utc": 1693592015,
   "score": 28,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypbygr",
   "message": "The woman who lives down the road made a move on my partner. She'd been leading up to it for a week though so I'm not surprised about that.\n\nHe deleted the message so it \"didn't cause drama\" and didn't reply. \n\nI found the deleted message. It's how I can confirm he didn't reply.\n\nStill fucks with my head 9 months later. It's not a relationship ender (we've been together 17 years, we will be fine) but still felt like a bit of a betrayal.",
   "created_utc": 1693593558,
   "score": 6,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp9lw7",
   "message": "I had a very vivid dream where he cheated on me and I ended up in like a sister wife situation. I had that unshakable feeling of betrayal for weeks afterward. I tried really hard not to feel it, and even harder not to show it, but he knew. Every few days I’d say something in an unnecessarily snappy tone and he would be all “Still? Really??!?!”",
   "created_utc": 1693592645,
   "score": 15,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyp5xkz",
   "message": "my gf and i are both photographers and she went out of her way to exclude me from a shoot that she knew i wanted to do just because i was having a bad day. a much bigger issue happened from there, but we are still together",
   "created_utc": 1693591283,
   "score": 4,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypb8j8",
   "message": "my ex shared my nudes to his brother without asking or telling me",
   "created_utc": 1693593298,
   "score": 12,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypdqhl",
   "message": "He called me the B word while I was driving to ikea because I missed a turn.  I was speechless.",
   "created_utc": 1693594208,
   "score": 21,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypelv7",
   "message": "The one thing that got me good was that she was insistent on sharing her favorite music/YouTube videos/interests with me and I would always watch and try to get interested so we can enjoy them together but whenever I tried to share something with her she would never even look in my direction, and make fun of me for liking things I liked. \n\nThe thing was this was my first girlfriend and I just assumed this is normal so I accidentally just stopped sharing anything I’m interested in with all of my future relationships by mistake because I thought my interests were weird and they would judge me. Oops",
   "created_utc": 1693594523,
   "score": 13,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypgcng",
   "message": "My husband and friends finally talked me into taking a break and going on a hiking weekend with the girls during a long, busy stretch of working overtime, and being caregiver to my mom in Long Term Care, and my aunt in Palliative Care. I went, but touched base with my husband briefly each of the 3 days. I even talked to him the last day to say that we were considering an extra hike that would make us late coming home. Several hours after I got home late and was in bed, around 11pm, he thought to tell me that my aunt’s DOCTOR had phoned just after I had left on the friday, to say the end was near. I was stunned that he hadn’t told me earlier. I would have come home, or at least called the doctor. Because it was so late, and I knew there would only be one staff on the floor, I decided to wait and call in the morning. Yes, she died before then. Sure, he just “forgot” to tell me about a call, but after 94 years on this earth, my aunt died alone.",
   "created_utc": 1693595157,
   "score": 53,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypgneq",
   "message": "my ex - she had a dream about me beating her and actually got mad at me and wanted me to apologize. Not like a cute, hey babe you should be sorry; more like an actually apology. I broke up with her",
   "created_utc": 1693595266,
   "score": 4,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyphngc",
   "message": "luckily, i find this story hilarious, but i'll never let my husband forget it. we were playing Mario Party Superstars with 2 friends and we were playing the Space Land map. my husband used double dice to INTENTIONALLY run through the countdown in the center space so that the laser hit me and i lost all my coins. that mf swears he thought the countdown had 1 extra number. \n\nhe bought me dinner that night.",
   "created_utc": 1693595641,
   "score": 28,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypisj2",
   "message": "Think some people in these comments need to reconsider \"small\"!\n\n\u0026amp;#x200B;\n\nI was coming in with an actually small thing--if they watch an episode of Your Show without you.",
   "created_utc": 1693596062,
   "score": 20,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypoxf9",
   "message": "The guys dick who she left me for ayoooo",
   "created_utc": 1693598331,
   "score": 19,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyotozh",
   "message": "He displayed artwork his ex made for him. She is a very good artist so it was nice to look at, but it really made me uncomfortable. It was crazy to me that he kept it up after he and I got together, especially after some of the stories he told me about the end of their relationship.",
   "created_utc": 1693586859,
   "score": 25,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypi8a7",
   "message": "When she brushes her teeth without telling me and then we're both in bed half falling asleep and I say 'ahhhh man we've still gotta brush our teeth' and she turns to me and evil smiles and says 'I already did'",
   "created_utc": 1693595854,
   "score": 25,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypfzfs",
   "message": "My ex-husband referred to me as “the ball and chain” while conversing with his friends, and didn’t understand why that hurt me. I was constantly asking him to leave the house and spend time with his friends, go do fun things apart from me, and I caught him blaming me when telling them he couldn’t go out with them.\n\nThis isn’t the reason we divorced, but is one of the small things which he felt was innocuous but really did feel like a betrayal to me.",
   "created_utc": 1693595024,
   "score": 30,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypbulh",
   "message": "When he said that Mother’s Day was just a commercial joke, then we went to his mums and he got a beautiful bunch of flowers delivered for her. I got nothing.",
   "created_utc": 1693593517,
   "score": 19,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypg295",
   "message": "I’ll often make fun of myself for the sake of making my wife laugh. We have this running joke that I’m a girly man because I cry during movies and I enjoy musicals, etc. \n\nIt’s all fun and games when we joke about this at home, but one time we were out with her friends and she referred to me as a “princess” in front of them. Maybe I’m being insecure - it’s never a problem when we joke at home, but for some reason it felt insulting in front of her friends.\n\nI laughed it off in the moment, but I pulled her aside later and told her I didn’t appreciate being made fun of publicly like that. I guess it’s because I felt this was our little inside joke and I was being vulnerable for the sake of making her laugh, but when everyone is in on the joke it feels like I’m not making people laugh anymore, they’re just laughing at me.",
   "created_utc": 1693595053,
   "score": 17,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypr3qe",
   "message": "He told me I was like Frankenstein after I’d had an emergency c-section with our baby. And because my boobs grew as I was breastfeeding, and had stretch marks.\n\nHe thought it was funny, but I didn’t appreciate it 2 weeks postpartum 🤷‍♀️",
   "created_utc": 1693599146,
   "score": 14,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jyplb0t",
   "message": "We had *our* house that her family had never been to. We were going to have them out when I got off work, she ended up having them over an hour or two early. No problem, of course. \n\nI got home and started getting the pizza ready (made the dough from scratch the night before, had fresh quality ingredients ready for them to build their own pizzas). They had been watching a show before I showed up. \n\nOkay, pizzas are done! Time to sit and eat. I get some light music that I knew everyone enjoyed going, and was heading into the room after serving and helping everyone. My ex told me \"can you turn the music off, we're watching this\". \n\nOne of the whole reasons for having them over is that her and I were planning to get married, and I wanted to get to know her family, which means *talking*. Her and I had also discussed the need to set a precedent that our lives and our relationship were our priority, because these people had caused her a lot of trauma and been incredibly controlling of her. This was not me lecturing her, it was what she wanted and what I wanted. Just want to make that clear, I wasn't in competition with them over who got to run her life. She was my partner. \n\nAnyways, obviously I'm not going to make a scene, or demand that they have a conversation if they want to watch a show. But the other seats were taken (not a huge living room) and I was off to the side. Okay, pizza is good, and I can sit through the show I'm not interested in. \n\nLight and limited conversation, because a loud violent show is on. I saw a fly on my TV screen (I bought it years before meeting her) and went to get my flyswatter. Her brother said something in Spanish, she repeated, in English for me \"Paul (fake name) says not to hit it, it's bad for the screen!\" ... It was delivered like Paul was in charge and I should do what he says. \n\nI swatted the fly lightly and threw it away, sat back down. \n\nThey watched TV for a while longer, Mom and Brother eventually got up and said it was time to go, everyone said bye, the usual. \n\nAfter, she could tell I wasn't in a super positive mood, and had something on my mind. She asked me, so I was honest. That at no point was I considered in the group decision to watch TV. That one of the reasons we had them over was so *I* could get to know them, and them get to know me. And I certainly didn't want to watch that show. I also communicated that the way she jumped to repeat her Brother about the TV/Fly was a bit disrespectful to me, like her Brother was in charge and I should heed his warning. \nI wasn't even offered to choose my seat in my own house, I just filled in the space after them. I felt like a guest in my own house, a bit excluded and not really part of the family. There were the three of them, and then me. \n\nUnfortunately, one of her responses to emotional/painful situations was to apologize heavily, overdo the self blaming and woe is me, I'm a terrible partner, etc. Not really focusing on how I felt or why I cared. \n\nA huge part of it was trying to set the precedent that *her and I were partners*.  And I didn't get included in my own house. \n\nIt's not even that big of a deal. But I put a lot of thought and effort into being a good host to them, and had a plan with her, that just got thrown out the window, while I felt like a person who walked into other people's home.",
   "created_utc": 1693596998,
   "score": 12,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypt8w4",
   "message": "He got me a household item (that I didn't ask for or want and that he uses often) for my birthday--the day of my birthday. Shortly after that, it was Christmas and he didn't get me anything at all and suggested very late in the evening that maybe he could pay for me to do something if I wanted. He literally didn't even think about getting me a single thing or even planning anything for me when I plan his birthday every year. For clarity, he has never planned a birthday for me and is happy to let the day go by without comment. This year I'm not getting him shit and I'm not planning shit for him.",
   "created_utc": 1693599955,
   "score": 12,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypqplh",
   "message": "After complaining for months that I never got to sleep in, despite being the only one to get up to the kids in the night, he finally let me sleep in one morning. I woke up hearing him quietly saying to the kids “Mummy’s had long enough; go wake her up”. I only had maybe an hour extra. He always had several.",
   "created_utc": 1693598998,
   "score": 10,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypvtaf",
   "message": "When I was going through an extremely difficult and complex prrgnancy with our twins, I had SERIOUS Orange juice cravings. But, I also had gestational disbetes, heartburn so bad it was medicated and Hyoeremesis Gravidarum. So I rationed it, which was seriously hard to make myself do, and allowed myself a single serving a day. I was also starving but my babies had crushed all my organs so I could barely fit anything in my stomach, I was *losing* weight and starting to have feelings of what I can only describe as primal food-guarding.\n\nOne day I woke up and found the orange juice carton in the bin. He had drank the last of it, I was too ill to get to the shop and he was out at work all day. I phoned him literally sob-screaming 'how could you...'. I've genuinely never felt such deep emotional betrayal before or since. I cannot explain it, hormones, medical difficulties and growing two people seriously messes with you.",
   "created_utc": 1693600920,
   "score": 10,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypdsly",
   "message": "It’s silly in retrospect, but my husband (at the time) pawned my wedding ring and then lost it in pawn. For some reason that broke my heart.",
   "created_utc": 1693594229,
   "score": 8,
   "submission_id": "167arvn"
  },
  {
   "comment_id": "jypz1yl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "167arvn"
  }
 ]
}