{
 "submission_id": "167ggxj",
 "title": "People of Reddit, is it weird for a 30 year old to date a 21 year old? If so, why?",
 "selftext": "",
 "created_utc": 1693596281,
 "permalink": "/r/AskReddit/comments/167ggxj/people_of_reddit_is_it_weird_for_a_30_year_old_to/",
 "score": 145,
 "url": "https://www.reddit.com/r/AskReddit/comments/167ggxj/people_of_reddit_is_it_weird_for_a_30_year_old_to/",
 "comments": [
  {
   "comment_id": "jyq32ho",
   "message": "I wouldn't say creepy but more wonder why?\n\nI was in a way different place at 21 than I am at 30and I dont know if I would want a partner at that place.",
   "created_utc": 1693603677,
   "score": 6,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyplane",
   "message": "I’m almost 30 and definitely wouldn’t date someone that age but that’s just me though. I’ve slowed down a lot in life and I don’t think a 21 year old would be moving at the same pace as me",
   "created_utc": 1693596994,
   "score": 135,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypmd87",
   "message": "I was 34 when I met my wife 25. I felt a little weird about it to be honest but you get over it if you love each other. Hanging out with each other’s friends was the weirdest part but you get over it pretty quick.",
   "created_utc": 1693597389,
   "score": 179,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqdgqf",
   "message": "Here's one data point...my story.\n\nI'm male.  When I was 34 the younger sister of a good friend of mine fell for me.  She was 21.\n\nI wanted nothing to do with her.  To me the age gap was a bridge too far not to mention she was my friend's sister.  Nothing good could come of this.\n\nIn retrospect I often said my father would have talked me out of it...but my father was already dead.  Nobody in my circle discouraged me from dating her.  My friend, her brother, gave it his blessing.  His wife also was on board, going so far as to set up a date for us.  We dated and got married when she was 24 and I was 37.\n\nHoly shit was she fucking immature.  She never wanted me as a husband, she wanted a younger, smarter, cooler, more athletic, handsomer father who was also an excellent baseball player and better cook than her dumb ass old man.  She shied away from every decision, every single tough situation, and bailed at the first sign of any strife.\n\nMarriage lasted 9 months.\n\nMy advice is this.  Morally and ethically you're in the clear but if you're trying to find a woman to make a future with, find a woman.  Not a girl.",
   "created_utc": 1693607910,
   "score": 240,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyq2koi",
   "message": "9 years is not a huge gap. When it becomes concerning is when the developmental gap is large. The difference between 40 and 31 is rather minimal. But the gap between 30 and 21 is huge because of the maturation and development that takes place in the 20s.",
   "created_utc": 1693603484,
   "score": 67,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypvvr3",
   "message": "I wouldn't personally do it. When I was 30 I dated someone who was 23 and it was _awful_, the maturity/life experience gap was very evident. 21 would just be the same. Two people at vastly different points in life, who likely want to experience different things (and at least for the 30 year old, maybe not experience some things again), and probably want a different pace of life. Not saying it couldn't work, but I think the outcome would be vastly different if it was 31 and 40.",
   "created_utc": 1693600946,
   "score": 28,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypk84s",
   "message": "To me? Yes. Other people can do whatever they want, but I could never date someone that's part of an entirely different generation than I am. I also wouldn't want to date someone that's still in the process of growing up. People in their early 20s are often barely any more mature than people in their mid-teens and that's a hard pass.\n\nEdit: Reworded this slightly due to a couple of responses. Overall point is the same.",
   "created_utc": 1693596593,
   "score": 68,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypwttv",
   "message": "There will always be 2 opposite answers to your question. Because people are different, they have different life experience, different values, different lifestyle. And for the same reason my answer to your question is 'no, it's not weird'. Some people at the age of 21 may be much more mature than others in their 40th. So it's absolutely not about numbers. If you feel good together - why would you care if it is weird to some random people?\nPersonal example: I met my future husband when I was 19 and he was 30. I don't think I've ever felt this age gap. Yes, it wasn't easy at the beginning (especially considering the fact that we lived in different cities and it was a combo: age difference + distance). But we worked it out. I don't believe in relationships that do not require any effort from both sides. Doesn't matter you have 11 or 0 years difference. It's all about you either want to be with this person or not. \nWe celebrated our 10 years wedding anniversary in June btw 😊",
   "created_utc": 1693601298,
   "score": 93,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqddtg",
   "message": "I’m 30 and would never date a 21 year old. So it’d be weird for me.",
   "created_utc": 1693607875,
   "score": 25,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqfc9i",
   "message": "the closer to my age the better. I wanna be able to relate. 34 years old and I remember what being 21 was like. I don't want that again, life is a journey and I'd rather not go backwards just for pussy, tbh.",
   "created_utc": 1693608718,
   "score": 12,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqsseo",
   "message": "Honestly I think that it's fairly normal for people to date people older than them. The main thing for me tho is that people who are 30 will normally be at a different stage in their lives and want different things and that could lead to bigger problems in the future. So I think it isn't weird particularly but I feel like it would be more difficult than having relationships with people closer to your age. (In general I mean, not all the time)",
   "created_utc": 1693614659,
   "score": 1,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqdd5t",
   "message": "*Leonardo DiCaprio has entered the chat*",
   "created_utc": 1693607867,
   "score": 21,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqko0y",
   "message": "It really depends on the two individuals.  \n\nI was 29 when I met my wife at work. She was 19.  We got married 18 months later. We’ve now been married 43 years, have 3 wonderful kids and 6 great grandchildren, and we’re still in love.",
   "created_utc": 1693611056,
   "score": 9,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypkyhk",
   "message": "Yeah, it's weird. Not weird enough for me to want to stop you, but weird enough for me to question why a 30 year old would want to date someone that level of relative immaturity.\n\nEDIT: I didn't realize this blew up and I'm not interested in discussing it, but the harder some of you try to convince me, the creepier I find you. This is creepy behavior and you telling me \"but I did it!\" doesn't make it less creepy. I know people in real life who did it and who are a lovely model couple – I also know people who won the lottery. Doesn't make investing in the lottery a legitimate investment choice.",
   "created_utc": 1693596874,
   "score": 87,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypmmmi",
   "message": "I dont think age gap is a big deal if its a legal and mature relationship. Like people who get bent out of shape if a 60 year old dates a 30 year old- theyre both legal and consenting adults trying to live their own lives, theres nothing wrong with it and it doesnt need your input, the, \"Well when they were 30 they werent even born yet,\" argument means absolutely nothing to me if they met and consented at a legal age where the younger of the 2 was allowed to make that decision for themselves",
   "created_utc": 1693597487,
   "score": 146,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypjmp0",
   "message": "I think it's weird since that's a pretty big age difference. But since they're both adults and I assume they both want this relationship, it doesn't really matter what I think.",
   "created_utc": 1693596372,
   "score": 75,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyq314q",
   "message": "I used to date someone 7 years older than me. It is not weird but you will notice a lot of differences in terms of maturity. We just lasted for 2 mos. Lol\n\nI know people that are dating with a huge age gap and l they are still going strong until now. It really depends on the people not the age, I think.",
   "created_utc": 1693603663,
   "score": 6,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqdgcf",
   "message": "49….. dated a 33 year old.  If you can tolerate blathering on about Pokémon good on you.",
   "created_utc": 1693607905,
   "score": 6,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqkr6c",
   "message": "No, date whoever you as long they are not under 18.",
   "created_utc": 1693611095,
   "score": 6,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqqajq",
   "message": "I don't think so, my sugar daddy is 30 and pays for everything i like so i think if you strike a balance like this it can work out well :)",
   "created_utc": 1693613558,
   "score": 1,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypprni",
   "message": "Depends on the people. It's really only 9 years difference, which to me, is nothing really. It just depends...I could see a couple where there's zero concern and another where it's kinda predatory.",
   "created_utc": 1693598647,
   "score": 36,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypqfp6",
   "message": "There’s 12 years between me n my wife. \nShe’s actually the older one. \nI was in my mid 20s when we met. \nWe’ve been together for close to 25 years now and it’s never been an issue for us.",
   "created_utc": 1693598896,
   "score": 38,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypk0nt",
   "message": "Often times, the couple in question will be at two different stages in life. However, I don’t think there’s anything morally wrong with it.",
   "created_utc": 1693596515,
   "score": 24,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypmyib",
   "message": "It depends. Some 21 year olds are very mature and focused. Others are basically children. I'm 27 and I don't really have the desire to date anyone 21 or younger because they're still so new to adulthood. 22 is probably my absolute bare minimum because they've had a year or so to get an understanding of bar culture(in America), and they are more likely to \"keep their cool\" in social situations. But everyone is different.",
   "created_utc": 1693597604,
   "score": 36,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqdfvz",
   "message": "Im 24 and think 21 is too young. I’ve gone through so many changes in my early 20s i just see anyone 21 or younger a BABY",
   "created_utc": 1693607900,
   "score": 16,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqcc7t",
   "message": "FYI my best friend is the 21f here, I'm trying to prove a point to her!\n\nEDIT: I've known this person for 8 years, I know her better than her own mother. I don't know if I should intervene and tell her the truth or wait it out, I just don't want to see her hurt or regretting anything, she's only been with him since February of 2023",
   "created_utc": 1693607435,
   "score": 9,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypqix4",
   "message": "I have no issue with age-gap relationships, however, 30yo was about the time when I realized that 20-21-22yo women were not really compatible with me. I don't think it's weird, just pushing the boundary of compatibility.",
   "created_utc": 1693598928,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqfe4p",
   "message": "No, but sometimes yes...\n\nPeople are more than their age.",
   "created_utc": 1693608741,
   "score": 5,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypjhiv",
   "message": "No one cares.  You're both adults.",
   "created_utc": 1693596320,
   "score": 62,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyq4eed",
   "message": "Don't let these losers stop you from having fun or meeting the love of your life.\n\n30 isn't old. Go ahead and date the 21 year old.",
   "created_utc": 1693604198,
   "score": 75,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqcf8y",
   "message": "It's not weird and it happens all the time.",
   "created_utc": 1693607471,
   "score": 9,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypk5ng",
   "message": "The general rule is half your age and add 7 - so for a 30 year old that would be 22. \nI therefore wouldn't say a 30 and 21 is too weird (depending on the people) but don't be surprised if you become the butt of the occasional joke.",
   "created_utc": 1693596566,
   "score": 32,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypkr5k",
   "message": "Age is just a number, as long as both individuals are consenting adults and have a healthy relationship, it's not weird at all.",
   "created_utc": 1693596796,
   "score": 18,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqeqgr",
   "message": "Yes.  I would shudder at the thought of some girl wanting me to go out to the clubs/bars to get a drink and get hammered.\n\nI have to get up and go to work in the morning.",
   "created_utc": 1693608454,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqh3b9",
   "message": "Ah look, it’s all about the relationship. I’m 55, my wife is 35, we are very compatible and very happy. Honestly, if a relationship is legal, equitable and happy who should care what others think?",
   "created_utc": 1693609477,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqhrul",
   "message": "Age doesn't really matter all that much imo. \n\nBut if the 21 year old actually has the mindset and maturity of a 21 year old, then it's just not gonna work out long term I think.\n\nNow, if for some reason they are much more mature than what you'd expect from a person that age, I can totally see it work and there's no problem with it.",
   "created_utc": 1693609772,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqi1fz",
   "message": "Doesn't matter at all.  If your both happy fuck everyone else.",
   "created_utc": 1693609891,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqj39f",
   "message": "Mehhhhh.  I met my wife when she was 24 and I was 34.  We've been happily married 12 years.  Age gaps can be rectified through maturity.  I didn't think I'd ever date someone much younger than me, but I did, and it worked out.",
   "created_utc": 1693610354,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjo6o",
   "message": "No. If you two get along and respect each other then go for it. My wife is 12 years younger than me. Met at 40 and 28. Married with two boys, all is good.",
   "created_utc": 1693610611,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqkn8s",
   "message": "It depends on the specific 21 year old.  For me, most of the time I wouldn’t consider it. That said, when I was in my early 30s I did date someone who was 21. He was perhaps the most intelligent person I’d ever met. I wasn’t even physically attracted to him at first. In fact, I remember thinking he was “unfortunate looking”.  Then we talked for hours and suddenly I found him irresistible in every way. I tried to remain mindful of the potential differences that could arise due to the age gap, and we checked in with each other about it regularly. \n\nI did feel very self conscious when we were in public together, which is something I regret in hindsight. He looked very young, and while I was often told I looked young for my age at the time, the age gap was nonetheless obvious to anyone who looked at us. I think a big part of my self-consciousness was due to the fact that we were a gay couple, and a lot of people still view all gay men as “predators”.  I definitely got dirty looks from the people who think all gay men are “groomers”. We often engaged in mild PDA precisely to anger those types of people.  Eventually , we stopped dating but it was amicable, and we have remained friends. He is still one of the most amazing people I’ve had the privilege to know.",
   "created_utc": 1693611046,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqkylz",
   "message": "If both parties are of legal age, are consenting, and feel safe, I don't think there's anything weird about it.",
   "created_utc": 1693611188,
   "score": 3,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqpivj",
   "message": "Meh. When you think of it as 23 and 14, it's creepy but 85 and 76 is a cute old couple. \n\nYou do you.",
   "created_utc": 1693613216,
   "score": 1,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypphtu",
   "message": "It's fine. Can we please please please please please please stop infantalizing adults?",
   "created_utc": 1693598543,
   "score": 30,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyq0xq3",
   "message": "No. \n\nBut you will probably find that a larger age gap means they are leading different parts of their life and that can be annoying. \n\nBut I find most people annoying anyway so...",
   "created_utc": 1693602855,
   "score": 8,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqb435",
   "message": "Reddit seems to think any age difference is the end of the world. If you 2 click and get on well and like being with each other. Well, that's no one else business. That's between you 2. So, I wouldn't be asking Reddit. If you like her, go for it.",
   "created_utc": 1693606917,
   "score": 8,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyq2umv",
   "message": "I'm 24 and I don't think I could date a 21 yr old. At least not the average one.",
   "created_utc": 1693603594,
   "score": 11,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypwkm4",
   "message": "No. Not really. Both of you are consenting adults.",
   "created_utc": 1693601206,
   "score": 8,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqf67e",
   "message": "No judgement here. They are both adults.",
   "created_utc": 1693608645,
   "score": 4,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqfbti",
   "message": "My wife was 32 and I was 22 when we started dating. Not weird at all.",
   "created_utc": 1693608713,
   "score": 4,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypl36r",
   "message": "two consenting adults can do whatever they want. Dont care. No matter what you say about maturity and experience, at 21 you should be able to make your own informed decisions about things",
   "created_utc": 1693596921,
   "score": 8,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyppx0r",
   "message": "No, I don't think so.",
   "created_utc": 1693598703,
   "score": 8,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypxvrm",
   "message": "It’s weird. 21 is still very young. 30 year olds are much more mature",
   "created_utc": 1693601694,
   "score": 10,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyq4v5p",
   "message": "As long as both are 18+ and consenting, what’s the issue? Love whoever the fuck you want",
   "created_utc": 1693604377,
   "score": 12,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypjjfw",
   "message": "A little bit, yeah. The age gap is pretty big, and the 30 year old is much more likely to have a lot more life experience.",
   "created_utc": 1693596340,
   "score": 13,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jypjj3c",
   "message": "[deleted]",
   "created_utc": 1693596336,
   "score": 1,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqa9bw",
   "message": "From personal experience, I did not think it was weird at the time I was 22 dating a 31 year old… but now as a 31 year old myself, I see it as a problem. The life experience from 22-31 is vastly different. I also feel like as a 22 year old it was easier for me to be manipulated by someone who was older and had more dating experience. I would question why the 30 year old can’t date someone closer to their own age. There are probably reasons…",
   "created_utc": 1693606559,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqct10",
   "message": "Im halfway through 30s. My cut off age is 29. However its not that weird if its a genuine connection. Its not as bad as say someone in their late 20's-early 30's dating a 19 year old.",
   "created_utc": 1693607633,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqdos2",
   "message": "I don’t think it weird. But what does a 30 year old man have to talk to a 21 year old about.",
   "created_utc": 1693608008,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqizkm",
   "message": "I'm 35m. My person of interest is 45f. If that gives you any insight to my taste in women.",
   "created_utc": 1693610308,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqj0a7",
   "message": "If you're both on the same page as is this fun, or is this serious, it's fine.",
   "created_utc": 1693610316,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqj4b6",
   "message": "Casual date, yes.  Long-term?  Probably not.",
   "created_utc": 1693610367,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjbby",
   "message": "That’s a bit much. A 30 year old and a 21 year old are at very different places in their lives. What would you even talk about?",
   "created_utc": 1693610453,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjg9w",
   "message": "I'm 34 dating a 26 year old, we don't think it's weird. As long as both of you are consenting adults, I say do you.\n\nSide note, Leonardo DiCaprio is in his 40's dating girls 18-24. It's generally accepted that men become established later in life and date younger beautiful women.",
   "created_utc": 1693610514,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjom4",
   "message": "Depends on your culture",
   "created_utc": 1693610617,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjpai",
   "message": "Big answer is it depends. Maturity levels, life stage, life goals, financials, expectations, fitness,",
   "created_utc": 1693610626,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjrka",
   "message": "Not weird",
   "created_utc": 1693610654,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjrrq",
   "message": "No, it is not!\nIf both are adults, over 18, then it is not weird and not a problem. \n\nBtw don't care about what people thinks, no matter what you do, there will always have people criticising and judging you.",
   "created_utc": 1693610657,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjs10",
   "message": "I think it's okay, I am really worried about the 30s guy, he will handle so much child behavior",
   "created_utc": 1693610660,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjsjd",
   "message": "Not at all",
   "created_utc": 1693610666,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjtej",
   "message": "I mean if you progress 30 years later you’re 60 they’re 51 the gap doesn’t seem too weird.\n\nIt’s all in the mindset and situation.",
   "created_utc": 1693610677,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjuh9",
   "message": "Get in there.  Game is game.",
   "created_utc": 1693610690,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjuhj",
   "message": "I’m about 30 and if I found one I liked I’d do it. The issue is the difference in life experience makes it really hard to relate to someone that young. You’re just at such different places in your life and your understanding of the world around you is based on so much more.\n\nWould 100% have sex with someone that young though. That’s just about physical attraction",
   "created_utc": 1693610690,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjv01",
   "message": "While it's not weird, because it's 2 consenting adults, there would definitely be a lot of challenges to work through due to how big the age gap is.",
   "created_utc": 1693610697,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqjxn8",
   "message": "Guess it spends on maturity level.  Some 21 year olds are a lot more mature than others.",
   "created_utc": 1693610729,
   "score": 2,
   "submission_id": "167ggxj"
  },
  {
   "comment_id": "jyqepdf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "167ggxj"
  }
 ]
}