{
 "submission_id": "167n3tb",
 "title": "What's something you believed about sex when you were a virgin that you realized was not true when you started having sex?",
 "selftext": "",
 "created_utc": 1693612249,
 "permalink": "/r/AskReddit/comments/167n3tb/whats_something_you_believed_about_sex_when_you/",
 "score": 232,
 "url": "https://www.reddit.com/r/AskReddit/comments/167n3tb/whats_something_you_believed_about_sex_when_you/",
 "comments": [
  {
   "comment_id": "jyqwbn2",
   "message": "Girls don’t literally wanna go all night. They get sore.",
   "created_utc": 1693616251,
   "score": 14,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqob25",
   "message": "Getting a girl to cum takes a lot of effort lol thought it would be easier",
   "created_utc": 1693612674,
   "score": 247,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqpnmu",
   "message": "Someone told me back in middle school that pussy tastes like peaches. I believed that for awhile. \n\nIt does not.",
   "created_utc": 1693613274,
   "score": 24,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqnoou",
   "message": "For me, it would be the stereotypical \"sex is the best thing in the world\" that every virgin in high school believes. What I realized when I got into a relationship and started having sex regularly is that intimacy is the best thing in the world - cuddling, closeness, kissing, hugging - and sex itself is just the cherry on top.",
   "created_utc": 1693612396,
   "score": 71,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqwcv7",
   "message": "I thought basically only boobs and naked girls would turn (straight) guys on.\n\nI had no idea how very extensive and random that list of things is until I got with my bf.\n\nHe confessed that, before we were together, he once headed to the bathroom seeking…release **after hearing the noises I made while scratching multiple mosquito bites**.\n\nApparently the “whimpering and moaning” mingled with the occasional gasps of pain were too much for him to handle.",
   "created_utc": 1693616266,
   "score": 182,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqy7hr",
   "message": "That it would be fun and easy. While it can be fun, it is not easy. Fucking is fucking exhausting, even if you're on the bottom.",
   "created_utc": 1693617129,
   "score": 124,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqp5x1",
   "message": "That both of you had to be dead serious and always grunt and moan and scream each others name. I eventually found out there’s giggling. And sarcasm. And impatience.",
   "created_utc": 1693613054,
   "score": 33,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqpp4a",
   "message": "The hole is lower than you think.",
   "created_utc": 1693613293,
   "score": 148,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqxti8",
   "message": "I used to buy lube to put in my hands and, er, position myself to pretend I was doing what I was thinking about, and I thought that actual sex would only feel a little bit better. \n\nThe extent to which I was wrong cannot be overstated.",
   "created_utc": 1693616949,
   "score": 148,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqvhwb",
   "message": "I thought that moaning during sex was just an exaggerated thing that porn stars did for effect. Then when I first had sex I found myself moaning really loudly. 😅 Just because I'm silent when I masturbate doesn't mean I will be during sex!",
   "created_utc": 1693615875,
   "score": 162,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqyqwz",
   "message": "Apparently it's not the most euphoric mind bending feeling one can experience and most of the enjoyment comes from other aspects.",
   "created_utc": 1693617383,
   "score": 228,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqukeo",
   "message": "There’s no “blowing” involved with BJs apparently.",
   "created_utc": 1693615454,
   "score": 75,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqyc43",
   "message": "You stuck it in and peed instead of the thrusting action",
   "created_utc": 1693617191,
   "score": 11,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqzzst",
   "message": "Lower boys... It's way lower.",
   "created_utc": 1693617967,
   "score": 112,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqnmb2",
   "message": "You’re supposed to slowly pull anal beads out. Girls don’t like it if you start them like a chainsaw",
   "created_utc": 1693612366,
   "score": 176,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqz1fl",
   "message": "That bigger is better. It is not. It's just more painful for the women.",
   "created_utc": 1693617521,
   "score": 30,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqswd4",
   "message": "That girls care about virginity... I'm 29 never had sex and this girl was like you've had sex right? no? hm... aight and went on to have sex with me even teach me she made it a fun experience for both of us and I will always be appreciative of that since I was fully convinced no woman would look at a 29 year old virgin and want to teach them when they're already well in to their sex life.",
   "created_utc": 1693614707,
   "score": 242,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqo5gu",
   "message": "That simply the act of penetration would be enough to get me off. \n\nTheres gotta be little to no anxiety mixed with the right mood, workmanship and person. Also its about the other person as much as its about you.",
   "created_utc": 1693612603,
   "score": 178,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqz7bd",
   "message": "I thought men lasted for hours before they cummed.  Those Stunt Dicks lied to me.",
   "created_utc": 1693617597,
   "score": 108,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqoiqf",
   "message": "I learned 2 things:\n\nBlowjobs weren't as awful as I was led to believe. Media and older siblings of friends made me think it's like drinking acid that could kill you but it's just like, uncomfortable. They'd make you believe they went to war after giving a blowjob\n\nSex is like a tiny percentage of a relationship. Like assuming you have sex for 4 hours every day which is a TON of sex that's only 28 hours of the like 112 waking hours in a week. You gotta like just being around the other person more than liking having sex with them. Also having sex all night long is only fun in theory, cause everything hurts the next day",
   "created_utc": 1693612769,
   "score": 168,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr1l1q",
   "message": "That you just fall asleep naked after. Movies didn't tell us about the clean up after the act.",
   "created_utc": 1693618696,
   "score": 210,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqouoo",
   "message": "I believed your partner would reciprocate in trying to please you. Selfishness in the bedroom is not a one gender thing.",
   "created_utc": 1693612915,
   "score": 166,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr0p0w",
   "message": "girls don’t wanna get “pounded” into oblivion. porn makes you believe you gotta be a jackhammer",
   "created_utc": 1693618293,
   "score": 92,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqrgck",
   "message": "I thought all doggystyle was butt sex.",
   "created_utc": 1693614067,
   "score": 128,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr0emn",
   "message": "So weird but like…..\nMy highschool boyfriend and I were so awkward. I decided one night I was gunna give him a handjob. I was so nervous that while I did it we just made out the whole time without stopping. Lmfao. \n\nHe came all over my hand and so far and so much. I never really watched porn so I knew it was coming but didn’t know what to expect. I was just shocked at the force and amount. I didn’t realize basically it was gunna be more than one “spurt” too",
   "created_utc": 1693618160,
   "score": 181,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqu8w9",
   "message": "That you can't laugh and need to be romantic. I love those moments where I'm turned on, but can still laugh at things that happen. Sex should be fun. It doesn't need to be tied up in a perfect little bow.",
   "created_utc": 1693615310,
   "score": 100,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqr7bo",
   "message": "Didn’t have an odor now I understand the candles bit in movies, I think if you could smell porn 90 percent of people wouldn’t watch it",
   "created_utc": 1693613957,
   "score": 94,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqu6z5",
   "message": "That a man could give me an orgasm",
   "created_utc": 1693615286,
   "score": 70,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqzjwa",
   "message": "That I, a woman, would cry and regret it. Hell, not only did I NOT cry, it felt more like I gained additional knowledge. Learned a lot of things that I didn't learn at school.",
   "created_utc": 1693617757,
   "score": 72,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr1m9d",
   "message": "That getting fucked up the ass feels good immediately.",
   "created_utc": 1693618711,
   "score": 17,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqupj4",
   "message": "When I was roughly seven or eight, because I had only seen magazines of sex, I assumed you stuck it in and didn't move and somehow it would feel great. Shame it's not like that really, it would be a lot easier 😅",
   "created_utc": 1693615519,
   "score": 57,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr196q",
   "message": "I believed the clitoris was this enigma that nobody except batman could find. It's pretty fucking obvious to find it. You don't even need to see it. Just rub around down there. She'll let you know when you find it. Also, it's not something I believed or didn't believe, but male and female genitals are in different spots. The first time I reached down a girl's pants, I went for where my penis is on my body. Nope. Vaginas are on the bottom, whereas I'd say a penis is on the front.",
   "created_utc": 1693618546,
   "score": 141,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqy80r",
   "message": "That sex is actually worth the effort it takes to make it happen…",
   "created_utc": 1693617136,
   "score": 16,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqnmcu",
   "message": "It's not porn.",
   "created_utc": 1693612367,
   "score": 32,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqyy8g",
   "message": "I barely talked at all the first two times I had sex and my partners had to prompt me to say yes, no and interact with them. \n\nPorn doesn't usually show that you don't just moan or dirty talk, you gotta communicate!",
   "created_utc": 1693617479,
   "score": 33,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr044q",
   "message": "That a dick could actually be hard as a rock.",
   "created_utc": 1693618022,
   "score": 35,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr1106",
   "message": "That cowgirl is a fun position. Literally had a friend of mine in HS break his dick because of reverse cowgirl.",
   "created_utc": 1693618448,
   "score": 42,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3cip",
   "message": "Hi lesbian here 👋🏻 before I started being intimate with women I always thought that a woman’s vagina was supposed to taste and smell like fresh fruit or what not.\n\nThis is me overhearing other’s conversations but after actually being intimate I realized that a woman’s vagina will have an odor and a taste sometimes like water and that is normal bc every woman’s body is different. Odors can be strong and vary a woman can have good hygiene and keep herself clean but for other reasons she just may have a strong scent. \n\nWhen I learned that it helped me accept myself too!",
   "created_utc": 1693619507,
   "score": 58,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqnl8k",
   "message": "That it was the best feeling in the world.",
   "created_utc": 1693612353,
   "score": 22,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr1aso",
   "message": "Every pretty woman was slutshamed so hard that I thought the more sex you had, the more physically attractive you became, somehow. Like... I believed all the girls who had bigger tits than me got bigger the more they had sex, and that the reason I developed early was because I started masturbating at a young age.\n\nI was super pissed off when I found out that having more sex doesn't make your skin clearer or your tits bigger or your hair more lustrous and I've never really gotten over it.",
   "created_utc": 1693618566,
   "score": 58,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqvu07",
   "message": "That it hurts, I remember thinking no way that a penis is going in there! That's gotta hurt!",
   "created_utc": 1693616026,
   "score": 22,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr01mr",
   "message": "My parents told me, repeatedly, that sex was the most painful thing in the world, because it was between your legs so it was dangerous. I believed it at 10, but it made 13 y/o me roll my eyes because I knew how babies were made and knew people had sex for fun. Losing my virginity at 13 was my only rebellious act EVER, and literally just to prove my parents wrong to myself smh",
   "created_utc": 1693617990,
   "score": 8,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqyzcy",
   "message": "I believed I liked having sex with women, had sex with several women and realized it's not my thing",
   "created_utc": 1693617493,
   "score": 29,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqzn24",
   "message": "u get married, u fuk , have a family and live happily ever after.. i m not a virgin, no woman, no family,  bad experience",
   "created_utc": 1693617799,
   "score": 4,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqzu2b",
   "message": "Sex Ed in school always led me to believe 2 things. Unprotected sex ALWAYS 100% leads to pregnancy no matter what and an STD/STI no questions asked",
   "created_utc": 1693617892,
   "score": 27,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr0xb3",
   "message": "The first time hurts so much, it’s hard to do any more of it for a week or two afterwards. (This was my experience anyway)",
   "created_utc": 1693618401,
   "score": 8,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr10fr",
   "message": "South Park is the one to blame. I thought that, once you had sex, my little buddy down there would stop waking up randomly, so I wouldn’t have any awkward or embarrassing moments no more. That shit didn’t stop and neither did I.",
   "created_utc": 1693618441,
   "score": 8,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr11y4",
   "message": "Im a really ticklish person, so I thought that sex would tickle down there like alot, thankfully not. It was one of my biggest fears as a virgin",
   "created_utc": 1693618459,
   "score": 14,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqtcr8",
   "message": "That it was going to be magical and the feelings were going to be the best. I couldn’t wait for the butterflies. Turns out, I’m asexual, so yeah.",
   "created_utc": 1693614911,
   "score": 12,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqz8s9",
   "message": "That everything goes everywhere in the first try.\n\nYou need a combination of aim and feeling to get it right.\n\nAlso, it's dry sometimes.",
   "created_utc": 1693617615,
   "score": 11,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr0jj0",
   "message": "I believed that pregnancy couldn’t happen until at least a week after her period. \n\nThen I lost my virginity at 15. Boy was I wrong…",
   "created_utc": 1693618222,
   "score": 10,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr1ff1",
   "message": "Guys need foreplay too. I thought I could just go for it but I was soft at first due to nerves. Thankfully she was patient and gave me a light back massage and her nails were nice along it and it got me ready for action 🥴\n\nAlso the clit is a wonderful thing to massage and take care of while you’re getting steamy with a woman. Gets her very excited.\n\nBasically just both people need to rub their hands over each other’s sensitive areas to get the engines started.",
   "created_utc": 1693618625,
   "score": 25,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr1osz",
   "message": "How long it lasts.",
   "created_utc": 1693618744,
   "score": 10,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr32vl",
   "message": "Everybody cums together, like in the movies.",
   "created_utc": 1693619382,
   "score": 12,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3a6z",
   "message": "That men know what they’re doing lol",
   "created_utc": 1693619477,
   "score": 7,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr4t1f",
   "message": "Anal sex isn't like asking for dessert after finishing your entree at a restaurant. There are logistics involved!",
   "created_utc": 1693620187,
   "score": 7,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqolm2",
   "message": "It’s not the most important thing but it sure is great.",
   "created_utc": 1693612803,
   "score": 6,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqw4oo",
   "message": "Before I had sex, I thought it was overly complex and idealized. I learned it's a natural, beautiful act about connection and communication... Among other things.",
   "created_utc": 1693616162,
   "score": 9,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqyo41",
   "message": "Thought it was supposed to feel good 🤷‍♀️",
   "created_utc": 1693617348,
   "score": 5,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqsp00",
   "message": "That I would be good at it",
   "created_utc": 1693614615,
   "score": 4,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqtw51",
   "message": "Doogystyle does not equal anal",
   "created_utc": 1693615150,
   "score": 10,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqw43u",
   "message": "That vagina’s had far more “flexibility” than I was expecting. There was much less grip around my penis than I imagined it to be. Just being honest.",
   "created_utc": 1693616155,
   "score": 5,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqyv4d",
   "message": "That all that nonsense in porn was real.",
   "created_utc": 1693617439,
   "score": 2,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqzmxx",
   "message": "Everything?",
   "created_utc": 1693617797,
   "score": 2,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqzpc9",
   "message": "Pulling out does not always work!",
   "created_utc": 1693617830,
   "score": 2,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr0wvp",
   "message": "that i was going to change mentally/emotionally after having sex. i thought i’d feel more grown up or just different in general but nothing changed honestly, i just felt normal (which i’m actually grateful for).",
   "created_utc": 1693618396,
   "score": 11,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr1qg8",
   "message": "Bags of sand",
   "created_utc": 1693618766,
   "score": 1,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr232q",
   "message": "That I’d be able to cum over and over all night long",
   "created_utc": 1693618930,
   "score": 5,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr237q",
   "message": "That sex is awkward. No it’s not!!!",
   "created_utc": 1693618932,
   "score": 6,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr27ct",
   "message": "I had very little notion of foreplay. I thought people just decided to have sex, took off their clothes, and commenced screwing. \n\nIt was only after I started actually having sex that I realized the penetrative sex part is just, as it were, the icing on the cake of a whole lot of foreplay.",
   "created_utc": 1693618986,
   "score": 5,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr35h2",
   "message": "That as you get older females want less sex.  UMMM, not me-I'm more horny than ever!!",
   "created_utc": 1693619415,
   "score": 6,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3c1q",
   "message": "Honestly I used to think it was a lot like porn and that my partner would do anything I wanted her to do and nothing would feel uncomfortable to her. I later realized having sex is a lot like dancing with someone",
   "created_utc": 1693619500,
   "score": 5,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3h2b",
   "message": "That when you’re married you could have sex whenever you wanted. The first year May be that way but after that it’s a little more… complicated",
   "created_utc": 1693619565,
   "score": 7,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3kap",
   "message": "I have learned that ladies really don’t care about how big your pp is.",
   "created_utc": 1693619606,
   "score": 5,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3w7v",
   "message": "I thought dudes were always \"hard\" but that they would just hang down.",
   "created_utc": 1693619754,
   "score": 1,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3xww",
   "message": "Girls generally dislike sex and only endure it to keep their man happy.",
   "created_utc": 1693619777,
   "score": 1,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3y1i",
   "message": "Some vaginas are larger than others.",
   "created_utc": 1693619779,
   "score": 6,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr3ynj",
   "message": "Not sure if this counts, but as a guy who had previously only had sex with other men until his late 20s, I thought that sex with women would be *very* different. In reality it's all basically the same, at least when it comes to topping.\n\nNow what did surprise me was how soft and smooth women can feel. I was used to my partners being scruffy and/or having plenty of body hair, so the tactile sensation was different.",
   "created_utc": 1693619787,
   "score": 12,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr45mx",
   "message": "i always thought i’d have sex before i ever gave a blowjob. i believed that a man’s pubic hair grew all the way to the tip of the penis and i was like, “why would anyone want all of that hair in their mouth?!”",
   "created_utc": 1693619880,
   "score": 1,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr4tpl",
   "message": "That u walk differently .. if u walk with your legs close together.. your a virgin .. after u walk with your legs apart .. don't ask me why I beleived that lol xx",
   "created_utc": 1693620196,
   "score": 6,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr7lhv",
   "message": "Seen so many movies/shows where the characters just look at each other in the elevator and start randomly making out so thought that happened often",
   "created_utc": 1693621495,
   "score": 1,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr7x53",
   "message": "That id come if I went on top\nMy hymen took many times to break and it was bloody every time",
   "created_utc": 1693621645,
   "score": 1,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr89o9",
   "message": "It's a lot of effort and cardio. My ass just wants to cuddle tbh.",
   "created_utc": 1693621810,
   "score": 1,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr8afb",
   "message": "It's not always very serious and sexy. There have been so many times I broke down laughing for no reason. A good partner would probably give you a confused look and laugh a bit too. Don't fuck someone who won't laugh with you while fucking.",
   "created_utc": 1693621820,
   "score": 6,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr8ra7",
   "message": "Only girls hurt when they're having their first time. \nTurns out a virgin penis also hurts the first time it's entering a vagina. 🤷🏻‍♂️",
   "created_utc": 1693622048,
   "score": 5,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqsgg9",
   "message": "That it was like it is in the movies. Always intense, always passionate and makes you scream every time. That is not the case.",
   "created_utc": 1693614510,
   "score": 3,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqsla5",
   "message": "I thought anal would suckkk.. \n\n\nI love it 😻",
   "created_utc": 1693614569,
   "score": 3,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqtwwp",
   "message": "That being covered in cum wasn’t gonna be uncomfortable idfk why I just thought it wasn’t gonna bother me but it makes such a fucking mess",
   "created_utc": 1693615160,
   "score": 10,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqurux",
   "message": "How little a vagina feels like my hand",
   "created_utc": 1693615548,
   "score": 2,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqv6tp",
   "message": "That the guy would just know how to do everything I like without me saying anything.",
   "created_utc": 1693615736,
   "score": 3,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqwa9t",
   "message": "I’ll get back to you in 10 years.",
   "created_utc": 1693616233,
   "score": 3,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqx22b",
   "message": "1. All girls are neat - nnnope, many of them a lot messier than they lead boys to beleive. All those hair buns and tons of perfume mean she was too lazy to take a shower today. 🤣\n\n2. Any sex with any girl would be great - not at all, don’t like starfish.\n\n3. Doing oral only brings pleasure to your partner - wrong again, and now I’m a certified vAgitarian…",
   "created_utc": 1693616595,
   "score": 2,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqo1ch",
   "message": "That women get to have an orgasm too sometimes",
   "created_utc": 1693612551,
   "score": 3,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqs4q1",
   "message": "giving is better than receiving 😁",
   "created_utc": 1693614362,
   "score": 3,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqrnvv",
   "message": "That it was a two person max thing",
   "created_utc": 1693614157,
   "score": 2,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqwq4n",
   "message": "That it would be fun and loving.",
   "created_utc": 1693616439,
   "score": 2,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyqo8p5",
   "message": "Anal sex unexpectedly hurts",
   "created_utc": 1693612644,
   "score": 3,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyr7wip",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "167n3tb"
  },
  {
   "comment_id": "jyrl48j",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "167n3tb"
  }
 ]
}