{
 "submission_id": "167oab5",
 "title": "How are people in their 20’s affording life with luxuries? Or is everyone going deeper into debt?",
 "selftext": "",
 "created_utc": 1693615425,
 "permalink": "/r/AskReddit/comments/167oab5/how_are_people_in_their_20s_affording_life_with/",
 "score": 35,
 "url": "https://www.reddit.com/r/AskReddit/comments/167oab5/how_are_people_in_their_20s_affording_life_with/",
 "comments": [
  {
   "comment_id": "jyqy3gf",
   "message": "It's a combination of things.\n\nSome people have high paying jobs, some people get help from family, some people had money from an unexpected windfall, and some people are just going into debt, expecting that next raise to fix everything",
   "created_utc": 1693617078,
   "score": 165,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqwlvp",
   "message": "Do they live at home with their parents? No rent/mortgage frees up a lot of disposable income in the short run.",
   "created_utc": 1693616383,
   "score": 95,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqutiq",
   "message": "I believe the deeper into debt because I’m watching my friends do things that I can’t do and I have the highest income amongst the group but I’m not everyone",
   "created_utc": 1693615569,
   "score": 58,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr0clc",
   "message": "The people I know are going into debt. A friend of mine is tens of thousands in debt because he frequently vacations",
   "created_utc": 1693618133,
   "score": 71,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqxkv2",
   "message": "Keep in mind that the 20-somethings who are most visible are the ones with money. Obviously, poor people in their 20s don't post pictures of all the shit they buy.",
   "created_utc": 1693616838,
   "score": 7,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqxnqe",
   "message": "You fools!\n\nGo into debt, the world will be over by the time the debt is due.",
   "created_utc": 1693616876,
   "score": 169,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyquoh3",
   "message": "Depends, what are you calling luxuries? Some people have wealthier parents, some go into debt, some make money early in life or get very very good jobs early on.",
   "created_utc": 1693615506,
   "score": 110,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqzouu",
   "message": "When I was in college and mid 20s all my peers living it up were supported financially by their parents. \n\nThey would work full/part time but that was all spending money. \n\nThe answer to these questions is almost always parents",
   "created_utc": 1693617824,
   "score": 39,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyquksg",
   "message": "Most people live a life style they cannot afford to impress others.",
   "created_utc": 1693615459,
   "score": 126,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr1y8r",
   "message": "As a 20-something, unfortunately I don’t think many of my friends save or invest. Just spend their money as they get it. I’ve expressed interest in house hunting and they were shocked I had “enough saved for a down payment” while they are buying designer bags and jewelry",
   "created_utc": 1693618867,
   "score": 10,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyravzx",
   "message": "Itt: a lot of assumptions and possible resentment. Maybe they saved up for a bit. Maybe they have a really good skill set that allowed them to get a good job. Maybe they're born rich or maybe they are going into debt.\n\nUsing ops example, someone getting the new phone could have saved up to afford it and taken advantage of a trade up program. Maybe they bought those designer shoes or bag second hand or was given by a friend or family as a gift. \n\nInstead everyone here assumes oh they're bad with their money and going into debt.\n\nJust let people live their lives, worry about yourself.",
   "created_utc": 1693623043,
   "score": 11,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqyh2z",
   "message": "According to Reddit,  everyone is poor except for billionaires.  And that’s just not the case.  A lot of people are still doing ok for themselves.",
   "created_utc": 1693617255,
   "score": 70,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrb4yr",
   "message": "Reddit always like to just argue \"they are in debt\"\n\nbut there are LOTS of people with money out there, and they have kids. \n\nI grew up with friends whose parent's had rental properties, clearing 20k a month easily, \n\ntl;dr: Not everyone is broke.",
   "created_utc": 1693623163,
   "score": 20,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrdetd",
   "message": "I'm 31 but the answer is 2 incomes and no kids",
   "created_utc": 1693624278,
   "score": 8,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr4zyr",
   "message": "I stocked up on toilet paper during the great run of 2020",
   "created_utc": 1693620276,
   "score": 16,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr31ao",
   "message": "It just depends. Some folks in their 20’s are making bank. My neighbor who is in his later 20’s is crushing it at a private equity firm while his wife is PA with a children’s pulmonary practice.",
   "created_utc": 1693619363,
   "score": 17,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr1enf",
   "message": "I make 6 figures, but I live with family. You can do alot with the extra 1.5-2.5k a month that would normally go toward rent. Obviously some trade offs, feels like I don't have as much freedom if I were renting on my own/with roommates, but it definitely affords for some travel opportunities, a car payment, savings and investments.",
   "created_utc": 1693618615,
   "score": 12,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr6bsf",
   "message": "It has to be debt.  I have a wonderful job that pays well enough but it’s a pretty small department and we all make about the same.  The youngest guy in our department is 19.  A nepotism hire that the rest of us just cannot understand how not only he got the job but how he’s managed to keep it.  (It honestly pisses us all off because most of us have degrees or years of experience and this is one of the cities best jobs in our field) but there is the aforementioned nepotism of course but the dude is also just legitimately fucking horrible at the job and has zero interest in being any better at it.  (Hard to blame him since management just seems to give him a free pass)\n\nAnyway this dude lives so beyond the means of everyone else in the department.  He also makes the least of anyone in the department because he was hired at the entry level rates.  So when he came into work last week bragging about the new rifle he bought for 4K we all rolled our eyes.  He also rented a penthouse apartment within a week of being hired at our company.  Bought his gf a car.  Took a 10 day Vegas vacation (at 18 lol).  I think he and his gf have gone thru 5 dogs in the year I’ve known him, all pure bred.  All sold or surrendered at a loss to him, lucky for the dogs.  His gf is also unemployed after being fired from her warehouse job last February.  He constantly also brags about his gaming set up, like he’s spent over 5K on a PC in the last year on top of having the three big consoles.  \n\nAlso always complaining about how careless his gf is with money.  Like she intentionally broke her phone one day while upset with him and made him buy her a new iPhone.  She pawned their iPads so she could buy one of the dogs.  Every week it’s another story.  It’s actually hilarious how open he is since I would never brag about most of these things but he has zero self awareness.  I think he’s trying to impress us but he’s having the opposite affect.\n\nAll of my other coworkers and I whom are all at least 5yrs older but average 15yrs older joke and gossip about it because we all make more than him and know there’s no universe we could live how he does without being colossally in debt.  That or he has rich parents or family but we don’t think that’s true.  We’re just waiting for it to catch up with him but maybe we’re wrong and it just won’t… my bosses are at least finally fed up with his lazy crap so hopefully we hit some impasse soon.  The double standard of how much is expected of us and how little is of him is wearing on everyone’s nerves.  Just showing up is all he needs to do to catch a paycheck. We’re so short staffed though I get why they haven’t fired him, which sucks.",
   "created_utc": 1693620896,
   "score": 12,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqxptd",
   "message": "Everyone has an OF site.",
   "created_utc": 1693616903,
   "score": 5,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr2100",
   "message": "\u0026gt; Or is everyone going deeper into debt?\n\nSt Peter don't you call me cause I can't go",
   "created_utc": 1693618903,
   "score": 6,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrbzj6",
   "message": "It seems everyone driving around (at least where I live) has a brand new F-350 or a Raptor,  or Tahoe. It blows my mind because those are 100k vehicles. Crazy",
   "created_utc": 1693623575,
   "score": 6,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqusw0",
   "message": "They have rich parents",
   "created_utc": 1693615561,
   "score": 11,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr1lka",
   "message": "Personally, for me, the only reason I can afford luxuries is because I own my house outright. If I had rent or a mortgage to pay it would be a very different situation.",
   "created_utc": 1693618703,
   "score": 10,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqyoyd",
   "message": "I've always wondered how the fuck anyone travels anymore.",
   "created_utc": 1693617359,
   "score": 12,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr1v7z",
   "message": "No debt here. I’m fortunate to be earning well, but no debt bar $9,000 or interest free student loans. I live a privileged life, with a lot going for me! Am 27.",
   "created_utc": 1693618826,
   "score": 6,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr37xg",
   "message": "27, moved out, now in debt, unable to move out again bc of debt. Piss poor living with parents again fml",
   "created_utc": 1693619447,
   "score": 9,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr3n4z",
   "message": "Being a stripper helps 😁",
   "created_utc": 1693619642,
   "score": 10,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr0nqf",
   "message": "Going into debt most likely.  This is what the stats say anyway.  People want the same lifestyle their parents had but don't realize their parents worked 15-20 yrs to get that lifestyle.",
   "created_utc": 1693618277,
   "score": 13,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr5oit",
   "message": "Debt so much debt",
   "created_utc": 1693620594,
   "score": 11,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr5skw",
   "message": "Most people are financially illiterate and don’t realize it. How many weeks are in a month? Where do you get your credit report for free from? What percentages do you prioritize regarding housing, transport, utilities, entertainment and savings? Most people I know don’t know how to keep a proper book and look around shocked at the end of the day.",
   "created_utc": 1693620648,
   "score": 11,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr6grn",
   "message": "Zero understanding of credit cards that's for sure and just piling debt.  You'll see a common pattern watching Caleb Hammers videos that lit a fire under me to do better and learn.",
   "created_utc": 1693620961,
   "score": 9,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrd5z3",
   "message": "Pocket watching is so bizarre, what’s it to ya? Its the same regurgitation every time. “Mommy \u0026amp; daddy’s money”, “crippling debt”, “they’ll be sorry they didn’t save up.” Does knowing the answer change your life trajectory in any way?",
   "created_utc": 1693624154,
   "score": 8,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqy1a6",
   "message": "I can’t imagine it being a possibility for me but i do wonder if they experience burnout… like if you’re earning enough income to support yourself in terms of food and rent and also have money to spend on luxury items and major assets I’d imagine a lot of saving + good stable work hours + pay for an extended period of time but to get your foot into that door is hard work so either help from parents/family or just really solid work ethic. I’d also wonder how they manage a decent social life while doing this since most activities involve spending money and that adds up real quick.",
   "created_utc": 1693617050,
   "score": 4,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqy9s5",
   "message": "Rich parents or crypto scammers. Somethimes both.",
   "created_utc": 1693617160,
   "score": 4,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr3atf",
   "message": "The bank of mummy and daddy 🏛️",
   "created_utc": 1693619485,
   "score": 4,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr40j6",
   "message": "There's a lot of debt in developed countries because people believe they deserve something. You work hard, you got that degree, why not splurge a little? Some feel they're only in their 20s for so long. They have the rest of their life to worry about saving. \n\nI think it's a lot of people seeing others having extravagant lifestyles online and wanting the same. They justify it one way or another.",
   "created_utc": 1693619812,
   "score": 4,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr69e5",
   "message": "Just wait until you see the shit people who don't have the money do in their 30s and 40s.",
   "created_utc": 1693620865,
   "score": 4,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr6xfk",
   "message": "In my case....luckily got a decent job, been there a few years, lived at home with my parents to save money and bought a house at 27\n\nI didn't know how else to do it",
   "created_utc": 1693621186,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrasfp",
   "message": "While I’m not sure to what extent you’re referring to, I’ll speak for myself and say it’s budgeting. In my mid twenties I was making $16-18 an hour splitting a two bedroom apartment in Texas. After all my bills and necessities I probably still had a few hundred left over for myself. I could always take a decent vacation or splurge on a huge purchase of $1,000+ every few months with a bit of financial planning. \n\nAlso don’t have kids lmao.",
   "created_utc": 1693622999,
   "score": 4,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrfh5o",
   "message": "Do you think everyone in their 20s is poor? Plenty of people with great paying jobs.",
   "created_utc": 1693625307,
   "score": 4,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr3nuv",
   "message": "Honestly,\n\nMe and my partner like the finer things in life, we go on great holidays, have a nice apartment, nice clothes and jewellery and watches. We collect wines from all over the world and eat at Michelin recommended or star restaurants monthly and eat at normal restaurants twice a week. Neither of us have rich parents or extremely high paying jobs.\n\nThe trick is; we have no savings. We spend our money as it comes. To us having savings seems silly when we can enjoy life now. We can home in the future to earn mega money and buy a house or put aside some money but it’s not the life we have right now and we want to enjoy life NOW. We only get this life once and savings can’t come with you!\n\nI hope this helps because I feel this is how a lot of people are living good lives now. It’s always been the norm to save save save save, that’s wonderful if it fits in your plan but there is no way to compare lifestyles as often times this is the way for people and they’re not rich, just living life as it comes!",
   "created_utc": 1693619652,
   "score": 20,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr9lzz",
   "message": "My husband (29M) and I (27F) are friends with a couple (who also have a daughter) who make a combined $70k… yet they always seem to be buying new things, going on vacation, and getting the latest and greatest stuff (new TVs, PS5, Nintendo Switch, etc.) From what she’s told me, they have $30k in credit card debt and no savings. I asked her how they planned on paying the debt, and she said she was making the minimum payment each month… and didn’t even know her APR. I had her look, it was 30%. I couldn’t even believe what I was seeing.",
   "created_utc": 1693622450,
   "score": 7,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr07a6",
   "message": "Mostly parental support\n\nMerely having parents to cover your back is a big factor, many also have rent and some expenses covered",
   "created_utc": 1693618064,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr2399",
   "message": "It seems a lot are going into debt. A lot of banks seem more than happy to give out mortgages to 20/30 somethings for homes in the 400K+ range.",
   "created_utc": 1693618932,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr6jor",
   "message": "Love debt!! No equity !! Woohoo",
   "created_utc": 1693621000,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr6tz0",
   "message": "By living paycheck to paycheck with a lot of economic risk.",
   "created_utc": 1693621138,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrcu6r",
   "message": "Learn a high value skill, get a better laying job. All my friends with bread are in the medical, engineering, law, sales or tech adjacent field.",
   "created_utc": 1693623988,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrglni",
   "message": "Im in my mid 40s and I know a ton of people who don't make near the amount that they spend. My sister is in debt because she wanted her kids to experience these  lavish vacations, which is weird because some of our best vacation memories involved camping in a tent. \n\n I don't understand how people can just not worry about debt. The anxiety I get from owing massive amounts of money is a much larger burden than the thrill I get from a purchase. \n\nHowever, my wife and I take trips all the time, she's a flight attendant so we fly for free and if I tag along on a trip of hers, I can stay in the hotel for free too. If you look at her social media, we look like we're living high on the hog, but in reality we just do things as cheap as possible. \n\nThe problem with social media is no one posts a pic of the beans and rice they ate on Wednesday, or the bills they decided to let slide for just one more month. We only post the highlights and because of that when we see how other people are \"living\" we don't see the full picture.",
   "created_utc": 1693625885,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrhrh1",
   "message": "I work 112 hours a week on a 14 day on 7 day off schedule. I work hard \u0026amp; enjoy my spoils from that overtime.",
   "created_utc": 1693626488,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyri2oe",
   "message": "I honestly think that Gen Z are such nihilists that their view is basically that debt doesn't matter because the world is fucked.  I don't think they're entirely incorrect.  Either capitalism collapses or it destroys the planet.  Either way, debt doesn't mean shit.",
   "created_utc": 1693626653,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrief2",
   "message": "Personal anecdote time:\n\nI'm friends with a couple; he's a pharmacist, she's a medical sales rep for a cosmetic surgery company. They've got three kids. They pull in quite a bit of money. We were hanging out at my house talking about the future and what we'll do when we're in our late 50s/60s. The topic of retirement investment came up and they looked at me like I was from Saturn. \n\nThis couple, completely capable of saving more than most people earn in a year just spend literally everything they have. They've got no savings. I asked what their retirement plan was. \"We'll just open a pharmacy and use the income from that as our retirement money.\"\n\nThe concept of that plan not actually working did not occur to them. They assume their physical condition and mental acuity will continue their entire lives. They're living quite the hedonistic life. He's overweight with diabetes, yet he still eats and drinks like a person half his age. During that dinner, between the two of them they drank four bottles of wine. \n\nThis is what a lot of those \"luxury living 20s\" people are. They're living in luxury because they've got absolutely no savings or worse are fueling that lifestyle on credit.",
   "created_utc": 1693626831,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqv0b5",
   "message": "Everyone gonna hate me for saying this, but it's because the economy is in pretty good shape, people's real earnings are quite high historically, unemployment low, and people are less likely to have kids in their 20s and will spend more on luxury goods instead.",
   "created_utc": 1693615654,
   "score": 12,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqur4p",
   "message": "They are either from more affluent families, incredibly lucky, or most likely going into debt to facilitate a lifestyle that they definitely can't afford.",
   "created_utc": 1693615539,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqycdb",
   "message": "Good old internet convincing the poor to show off a flashy lifestyle because they too are just a temporarily broke millionaire.",
   "created_utc": 1693617194,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr0g8h",
   "message": "I want to people have excepted that they will never own a property so they will have fun with her savings instead. Also a lot of trust fund babies as well. Can’t tell you the number of people from school where their parents paid for everything",
   "created_utc": 1693618181,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr1vy6",
   "message": "I don’t plan on retiring is my strategy",
   "created_utc": 1693618836,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr4cia",
   "message": "Credit card debt 100%. Obviously not the case for everyone but many people are living past there means. Consumer CC debt just went past 1 trillion.",
   "created_utc": 1693619971,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr5lzx",
   "message": "Discover is damn near 30% apr",
   "created_utc": 1693620560,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr60wy",
   "message": "They’re definitely using someone else’s money. Parents or the banks. Normal people in their 20s have energy and time, but no money.",
   "created_utc": 1693620758,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr8xpc",
   "message": "I'm a licensed electrician. Bought a house using college savings as the down payment. Filled the two spare bedrooms with roommates. Sandwiches and Ramen for 9/10 meals. Still going into debt (I spend a lot on my car)",
   "created_utc": 1693622129,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr9rbp",
   "message": "Could always be selling drugs.",
   "created_utc": 1693622521,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrbzgr",
   "message": "Debt is possible. It's also possible that they're getting money from their parents. But it could just be a matter of having different spending priorities than you might have. Some people choose to save money or put it towards investments or buying a house, while others would spend that money on fun things instead.",
   "created_utc": 1693623574,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrdx42",
   "message": "1 teabag serves me 5 cups",
   "created_utc": 1693624531,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrdzm6",
   "message": "Influencers get paid a lot and use that money to make more content which grows their platform and makes them more money. Also wealthy parents or they have a well paid job",
   "created_utc": 1693624565,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyre3c0",
   "message": "I make 40k a year but that’s according to my four day a week schedule. I typically work 40+ hours. But I still make poor decisions from time to time but try to save money where I can. Maybe one day I’ll get a raise, maybe one day I can buy a house, maybe one day I can have other luxuries, but I have enough for now. Yes I’m in debt, but I’ve never missed a payment and double pay when I can. \n\nBut then I think, the world could go to shit any moment. Already is heading that way. So why not get into debt. Why not make bad decisions. I can enjoy my life the way I want. Or I can be another person who lives within their means. So now I have a motorcycle lol. Which actually helps a bit. It’s cheaper to own and maintain if I do stuff myself. Insurance is less, I pay about $15-$20 to fill up. And it’s fun too",
   "created_utc": 1693624615,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyreve5",
   "message": "The real question is what do you call luxury? Living well if you’re good with money is far away from being impossible. Not talking about the US as I don’t live there but well, unless you’re making minimum wage in a HCOL area you should be able to live decently",
   "created_utc": 1693625004,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrfle3",
   "message": "Rich parents or massive debt",
   "created_utc": 1693625368,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrfn4c",
   "message": "Went to a smaller state school for 2k a semester, got an engineering degree, graduated in May 22, live in a one bedroom apartment in a rural area, drive an old Honda civic. No debt, going on a cruise in January.",
   "created_utc": 1693625393,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrggb0",
   "message": "I’m in debt, baby!",
   "created_utc": 1693625806,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrhnrh",
   "message": "Neighbor's kid has wrecked two nice cars, is on his third. Not even 20 yet.\n\nDaddy's money.",
   "created_utc": 1693626436,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrhyi0",
   "message": "America runs on debt",
   "created_utc": 1693626591,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrif22",
   "message": "Generational wealth. Great grandparents made some wise investments in real estate.",
   "created_utc": 1693626841,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyriots",
   "message": "Parents.",
   "created_utc": 1693626984,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyripkd",
   "message": "Wealth classes",
   "created_utc": 1693626995,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrjado",
   "message": "I'm a millennial and I remember when my friends got out of university and were making slightly above minimum wage and living at home, but were buying LV, Gucci, Dior, etc bags, so this isn't new.",
   "created_utc": 1693627322,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrjaun",
   "message": "So I think I'd fall into this category.  For me personally, I live in a hcol area with a lcol rent. I'm paying $600/month on a salary of $80k so I've got a good amount of spare cash to play with each month. I'd very much say I'm an anomaly though. For comparison to whats typical in my area, my friends mostly make around what I do or slightly less, but have 2x or 3x my rent plus utilities.\n\n I've been really lucky with my living arrangement tbh, and thats largely what lets me have the luxuries I do have. My roommate's parents own the place and are only collecting rent from me to pay the cleaning lady at their vacation home, which is why rent is so low.",
   "created_utc": 1693627329,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrjdmj",
   "message": "Legacy money or they got into the right line of work or got lucky in an investment or married well.  That covers most of it.",
   "created_utc": 1693627373,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrjdn2",
   "message": "I have a buddy that just can’t wrap his head around needing to pay off his credit card balance. He just slaps it on there and pays it when he can. Alooooot of people are in credit card debt.",
   "created_utc": 1693627373,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrjebt",
   "message": "Credit cards",
   "created_utc": 1693627384,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrm5rc",
   "message": "Despite what most redditors will tell you, polls show the vast majority of Americans are happy with their finances.\n\nIt's just that complaining online gets you the updoots.",
   "created_utc": 1693628939,
   "score": 1,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqvz9e",
   "message": "I can afford a decent car because: high car payments plus I work 2 jobs, sometimes 3 or 4 if you count Doordashing and dog walking occasionally on the side",
   "created_utc": 1693616094,
   "score": 5,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr0wou",
   "message": "Our lives are inflated by mystery and intrigue. Don't believe every picture you see, and every narrative you hear. It's tough for them!",
   "created_utc": 1693618393,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyquvi8",
   "message": "*cough cough* fake rich. What actually matters is assets if you wanna see the truth, look at their assets, assets are things that make you income people, if it doesn’t make you income, it’s not an asset… if there’s no assets, there’s no wealth, it’s fake rich….",
   "created_utc": 1693615593,
   "score": 6,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr0xck",
   "message": "Entry level salaries have also skyrocketed, I just offered a kid $100k for a role that I got paid $55k for 10 years ago",
   "created_utc": 1693618402,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyr4kp4",
   "message": "It’s a secret trick called living in a country that has a functioning economy and the government cares about the people more than the profit of business owners.",
   "created_utc": 1693620078,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrdyfo",
   "message": "I had a friend, she was constantly taking trips to turkey every few months, buying new clothes every week, eating out at restaurants every other night and bought a car, yet she worked at the mall. I didn’t understand where she got all the money, until we became closer. Turns out she was 10s of thousands of dollars in debt. And I had 28k saved during that time, and didn’t buy anything. I was able to invest my money and grow it.",
   "created_utc": 1693624549,
   "score": 2,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyqxa91",
   "message": "They don't spend on expensive dinners, expensive outfits etc. They save and spend on what they have prioritised first. Secondly affording a house, kids, cars and loans is not that expensive as it seems ! With proper planning all of it can be managed in your monthly salary !",
   "created_utc": 1693616702,
   "score": 3,
   "submission_id": "167oab5"
  },
  {
   "comment_id": "jyrdhry",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "167oab5"
  }
 ]
}