{
 "submission_id": "168gqhs",
 "title": "Why don’t cheaters stay single if they want to have sex with more than one person?",
 "selftext": "",
 "created_utc": 1693695858,
 "permalink": "/r/AskReddit/comments/168gqhs/why_dont_cheaters_stay_single_if_they_want_to/",
 "score": 254,
 "url": "https://www.reddit.com/r/AskReddit/comments/168gqhs/why_dont_cheaters_stay_single_if_they_want_to/",
 "comments": [
  {
   "comment_id": "jyvhy6i",
   "message": "They want the benefits of being in a relationship, like companionship, love, stability, readily available sex, but they also want the freedom, excitement, and novelty of a single person.",
   "created_utc": 1693696804,
   "score": 108,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvfyux",
   "message": "Because they’d prefer to have a sure thing on the hook and not get caught. Having their cake and eating it too.",
   "created_utc": 1693695939,
   "score": 223,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvharq",
   "message": "They want a stable lifestyle while fooling with others.",
   "created_utc": 1693696514,
   "score": 170,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvuzbs",
   "message": "From my experience, I was the safety net",
   "created_utc": 1693702528,
   "score": 229,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvg5b0",
   "message": "Because they don’t want to be alone but not with just one person. It’s like having food in the fridge but wanting go out to eat kind of lol",
   "created_utc": 1693696015,
   "score": 99,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw7uky",
   "message": "It's not just about the sex. They want both the familiar comfort of a relationship and the excitement of the spark at the beginning when everything is new.",
   "created_utc": 1693708149,
   "score": 180,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvgt1y",
   "message": "I genuinely think that most cheaters get off the exhilaration of possibly getting caught or getting away with something. If they were single, there’d be no exhilaration",
   "created_utc": 1693696300,
   "score": 50,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw00kg",
   "message": "I’ve asked this to some friends who have cheated on their partners. There were common answers. \n\nBeing in a relationship is usually more attractive. It gives signals that you are stable (even though you’re open to cheating.) It also makes you seem less like a threat so others are able to get closer and become more vulnerable than they might otherwise. \n\nBeing in a relationship makes getting rejected feel less bad because you have something else to go home to. \n\nMost people who cheat do so because they are bad at communicating. They aren’t getting what they want from a relationship so they seek it elsewhere instead of just asking for it.",
   "created_utc": 1693704728,
   "score": 105,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywe0q1",
   "message": "There’s a number of reasons people cheat, and most don’t really boil down to “they want to have sex with multiple people”\n\nOne driver of this behavior that I’m familiar with is it’s a common thing in overfunctioner/underfunctioner relationships. These are where one partner is “the responsible one/the competent one/the one that handles things” and the other is “the irresponsible one/the underachieving one” etc. To be clear, this doesn’t mean that the underfunctioner actually is incompetent or incapable, but rather that both partners begin to see them that way. It begins to look and feel a bit like a parent/child dynamic rather than partners feeling equal\n\nIt’s a dynamic that some relationships fall into as their strategy for collectively dealing with stresses/pressures that make the people in the relationship feel less secure. Basically they kind of split duties for things in a relationship. This is great and normal and healthy is it’s “you do dishes and I do the laundry”, but it becomes unhealthy if one person takes on a disproportionate amount of those duties. Now division of responsibility looks different in different relationships, it’s not always going to look like splitting chores down the middle, work down the middle, child care down the middle, etc, what’s important is that the partners feel like equals and don’t feel like a parent/child.\n\nThese kind of dynamics pop up in a lot of ways, although many people tend toward one of these roles based on past traumas making flexibility and cooperation for healthy relationships difficult which can increase the risk. Substance abuse problems can be a common cause, where you kind of split things down a line of “this is the person that takes care of things and this is the partner that gets taken care of”. It tends to be a very difficult dynamic to escape without professional help and often just gets more severe over time, because as it keeps happening, the “overfunctioner” tends to grow more tired and resentful and the “underfunctioner” tends to have decreasing self-esteem and feels less and less capable over time (again, it doesn’t mean they actually are incapable people, but that they begin feeling this way)\n\nWithin these dynamics, one common thing to happen (among many others unrelated to this thread) is the “overfunctioner” tends to cheat. This is driven by a conflicting scenario where they care about their partner and don’t want to leave or feel like they have to stay to take care of them, but still seek to get certain emotional needs met within that environment. I don’t mean to make it sound like it’s ok, this is obviously not a healthy way to deal with this situation and can really hurt someone. I merely mean to answer the question and provide ONE specific somewhat detailed answer of this\n\nI’ve learned a lot about overfunctioner/underfunctioner dynamics because I’ve ended up in a number of relationships with this dynamic and ended up seeking therapy and spent time learning about these dynamics in general. Fortunately no cheating occurred in these relationships, but in learning about these dynamics I learned that that is a common thing that happens, and having been the overfunctioner, I can see how that feels like an appealing solution, because these dynamics can make you feel trapped in a situation where you have to care for your partner that you care about, but that partner isn’t in a place to be able to meet your needs, so you just have to kind of sacrifice constantly and handle everything. In my most recent experience, my partner had some pretty significant trauma from childhood and had quite a severe drinking problem and was frequently suicidal when drinking. Because of this, it didn’t really feel like leaving was an option, and ultimately this is someone I cared for immensely, but my entire life began to be about handling that. I loved them, and also I just felt drained all the time, I was afraid to meet with friends because I was afraid of them drinking while I was away (and they didn’t want to come along, frequently feeling too tired and stressed), I needed jobs with flexible hours where I could rush home if needed or miss a day suddenly if necessary, I started having a number of health problems related to me basically coping by stress eating, sleep wasn’t happening, and I just felt terribly lonely because they were out drinking most the time or drunk at home, or just stressed to the point of just being emotionally unavailable at home. I felt trapped in a situation that I couldn’t repair, I didn’t feel like I could leave, and that left me feeling chronically lonely and exhausted. I never cheated, but I can see how people in that situation would feel driven to do so, since the alternative is just…running on empty.\n\nUltimately we both sought individual therapy, it took some time but things got much better, the relationship eventually dissolved but I’m happy she got help and is safe, and I also am in a better place having addressed some of my problems that made me feel compelled to sacrifice endlessly in relationships. I’m very happy she got the help she needed because while I’m talking about my experience here, I know she was hurting immensely and just trying to survive, and I’m happy that things are so much better now.\n\nBut yeah, that’s the super long-winded explanation and personal experience that hopefully helps answer ONE possible reason",
   "created_utc": 1693711007,
   "score": 180,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw54y5",
   "message": "Stability vs. Adventure.",
   "created_utc": 1693706956,
   "score": 15,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw49vz",
   "message": "Can’t be a cheater if you can’t cheat",
   "created_utc": 1693706587,
   "score": 28,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw5u9a",
   "message": "Their idea of success in life is having the trappings of a family, while also maintaining the lifestyle freedom of a single person.\n\nBasically, they're trying to have their cake and eat it too, they have no integrity, and they're narcissistic little shits.",
   "created_utc": 1693707262,
   "score": 118,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywbf4k",
   "message": "Some people just like the thrill and the chase but still want someone to come home to at the end of the day but know they can’t have both if they’re honest",
   "created_utc": 1693709797,
   "score": 11,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywceew",
   "message": "In the case of my ex husband, he saw me as a stepping stone. Being with me allowed him access to a bougier world than he could access on his own. He gained financial resources, networked, attained a status job, and then \"traded up\". But he cheated pretty often on his ascent as well. So sometimes they're gaining money, resources and societal legitimacy from their spouse.",
   "created_utc": 1693710279,
   "score": 31,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvi2w1",
   "message": "Because it strokes their fragile ego to know that they are getting away with cheating before they get caught.",
   "created_utc": 1693696860,
   "score": 80,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw4mcq",
   "message": "I don’t think most cheaters intend to cheat when they get into relationships",
   "created_utc": 1693706733,
   "score": 84,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywifr0",
   "message": "Because they want the benefits of being in a relationship and having someone be faithful to THEM, without having to return the same Fidelity",
   "created_utc": 1693713133,
   "score": 26,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywtb03",
   "message": "Because people aren’t just one thing.\n\nA “cheater” may actively be trying to curb their intentions, but fails\n\nThey may really want the stability and intimacy of a relationship, but lack the drive to commit and ride out the rough patches.\n\nOr yeah they could just be duplicitous dirtbags who DGAF about anyone but themselves",
   "created_utc": 1693719371,
   "score": 19,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw9fhs",
   "message": "I think for some people it's easier to blow up a relationship than gently exit one.",
   "created_utc": 1693708887,
   "score": 9,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywacm0",
   "message": "Bc the people they want to have sex with don't want to have sex with someone sleeping with multiple people.",
   "created_utc": 1693709309,
   "score": 7,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxvgod",
   "message": "Cheating is not cookie-cutter. It’s not a one glove fits all so everyone does it for different reasons.",
   "created_utc": 1693745203,
   "score": 8,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyy0bi8",
   "message": "If they are married with kids and their partner loses all interest in sex they can’t decide to “stay single” because they haven’t been single for a long time.",
   "created_utc": 1693747557,
   "score": 9,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywunat",
   "message": "Deadbedrooms with financial ties",
   "created_utc": 1693720239,
   "score": 8,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywetsn",
   "message": "What many of us find out painfully is that a cheater isn't a type of person, that walks around with a big C on their head. Most of the time its the laid off dude in a distant marriage, the wife who married so young shes now a different person but can't communicate it well -- scared to loss her family.  \n\n\nIt sucks but most are human and find themselves there for a spectrum of reasons most of which aren't premeditated",
   "created_utc": 1693711372,
   "score": 56,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxwet3",
   "message": "i love the thrill",
   "created_utc": 1693745698,
   "score": 68,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvgas7",
   "message": "they probably wanna feel loved, and think “this time will be different” but it isn’t and they’re too dumb to notice a pattern",
   "created_utc": 1693696082,
   "score": 17,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvm2cr",
   "message": "Ego.",
   "created_utc": 1693698604,
   "score": 24,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywfqz9",
   "message": "Monogamy isn’t for everyone. Some people choose to cheat because it’s more socially accepted than multiple partners.  \n\nIt’s why my wife cheated. We had a long talk and parted ways. I’m not poly. She is. She never mentioned it. Just cheated. \n\nShe eventually wanted to try and make it work because “she loved me more than anyone else she was dating”. Terrible thing to say to a monogamous man 😅. I found someone wired like I am and she’s currently doing god knows what. We all lived happily ever after.",
   "created_utc": 1693711818,
   "score": 26,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxmq24",
   "message": "Go read /r/deadbedrooms for a day. There are a lot of cheaters who ARE having sex with only one person because of their marital situation.",
   "created_utc": 1693740229,
   "score": 10,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywxvek",
   "message": "Do you throw out your old TV before you have brought a new one? \n\nSame mentality cheaters have. Ending your relationship means potentially being alone if things don't work out with the new person they're seeing. That's why they slowly build up a new emotional connection and relationship with the new person while maintaining the old.\n\nOf the 10+ times someone I know, or my self has been cheated on, only one of those was a fling. Every other one they ended up dating the new person.",
   "created_utc": 1693722420,
   "score": 5,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxxws4",
   "message": "Because saying that cheaters cheat because they want sex is an extreme oversimplification of the multitude of reasons any given individual might have for cheating.",
   "created_utc": 1693746447,
   "score": 6,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxzuue",
   "message": "It’s good old-fashioned selfishness, isn’t it? They’d rather keep a good thing around under false pretenses while still doing whatever/whomever they want. \n\nStraight up eating that cake and wanting it too.",
   "created_utc": 1693747344,
   "score": 5,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvk0cx",
   "message": "Regular sex from the person they cheat on.",
   "created_utc": 1693697702,
   "score": 12,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywk4zl",
   "message": "most cheaters cheat because the relationship isnt providing something they need. it's not ok but there's something going on that drives to it",
   "created_utc": 1693714005,
   "score": 8,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxu613",
   "message": "Why do people simplify cheating for everyone?",
   "created_utc": 1693744505,
   "score": 7,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyww383",
   "message": "Because you become a cheater, this is not (always) something that you are. And it happen after you engage in a relationship that do not satisfy you and that you can’t leave for various reasons.",
   "created_utc": 1693721189,
   "score": 3,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxsyvf",
   "message": "Because they don’t know that until they’re deep into a relationship and love the other person.",
   "created_utc": 1693743845,
   "score": 4,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyy2iao",
   "message": "Life is complicated yet we constantly seek simple answers for complex questions. \n\n#sad",
   "created_utc": 1693748539,
   "score": 5,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyy7n9c",
   "message": "It’s black magic fuckery but it really is about 800billion times easier to get a women’s attention when you’re in a relationship.",
   "created_utc": 1693750607,
   "score": 5,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jz0c24b",
   "message": "People like this have a egotistical view of themselves that need all the benefits of a LTR but can’t commit because they think they are special and can fuck people over without considering the pain they inflict.",
   "created_utc": 1693777985,
   "score": 5,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jz0cch2",
   "message": "Because they’re shitty people.",
   "created_utc": 1693778097,
   "score": 4,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvk7n5",
   "message": "Depends on the kind and the reason.  I notice for guys it can be more the effect of suddenly becoming attractive to a larger cohort the very moment they begin dating someone.   I learned this oddness very early on but also think cheating on someone is disgusting.  Don't think it is necessary to hurt someone like that in order to have what you want.  Just do the fucking breakup and swing on to the next person you sex obsessed monkey.",
   "created_utc": 1693697790,
   "score": 17,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyx12vf",
   "message": "The insecurity of being alone",
   "created_utc": 1693724724,
   "score": 8,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxung3",
   "message": "There isnt any one singular reason as the cause for cheating can vary greatly depending on the individual cheater\n\n\nCould be self sabotage\n\nImpulse control\n\nSelf esteem issues\n\nDead bedrooms\n\nDead/dying relationship\n\nAs well as countless other reasons\n\n\nBut this sub lacks the maturity to discuss a topic like this",
   "created_utc": 1693744768,
   "score": 7,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywka25",
   "message": "Because they're assholes. All cheaters are assholes.\nNo exceptions.",
   "created_utc": 1693714077,
   "score": 34,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywen7t",
   "message": "Because most cheaters I know aren't just cheating.  They legitimately are narcissists, sociopaths, etc.  They truly don't believe they'll be caught.  They truly don't see the wrong in it.  They truly feel deep down that what they are doing is the RIGHT thing.  Most people I know that cheat only care about themselves.  They have no conscience or compassion.  \n\nThe problem is that you just don't understand them.  Because you have a soul and a conscience.  People like that just DO NOT CARE about the well-being of others.  They treat people like most of us would treat a mosquito that landed on our arm, simply swat it and move on and never think about it again.   Don't try and understand why, because we (us normal people) will never ever comprehend what goes through their heads.  \n\nSure, everyone's gonna have a story about a good man or woman that got caught up in the moment.  But most of the stories all come from the same exact type of people..the narcissists.  The old saying \"once a cheater, always a cheater\" still holds true a large portion of the time.  I'd love for some of you Reddit research-gurus to find us a stat on that.  How many people cheated ended up cheating again?  I bet the statistics will be mind-blowing.",
   "created_utc": 1693711289,
   "score": 36,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyvheno",
   "message": "Stay single? In *this* economy?",
   "created_utc": 1693696562,
   "score": 13,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywa5v5",
   "message": "Constant validation from people feeds their ego. The more validation they get, the more they feel empowered.",
   "created_utc": 1693709225,
   "score": 13,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywkdpl",
   "message": "For some, they would never admit it but I believe they do actually enjoy hurting people and sabotaging relationships in a weird way. I doubt most of them are doing that consciously, but it’s a pattern I see.",
   "created_utc": 1693714129,
   "score": 5,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywlcb0",
   "message": "I'm not a cheater and never have cheated but I would like to add that when I'm single it seems like no women are interested in me. The second I get with a woman it seems like a ton more come out of nowhere and are magically interested in me. It makes no sense at all.",
   "created_utc": 1693714635,
   "score": 8,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyw4ite",
   "message": "Because they're fucking slime balls with no standards or discipline.",
   "created_utc": 1693706690,
   "score": 27,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywelkl",
   "message": "Your question is worded to deliberately pre-suppose (a) that a person has chosen to be a cheater first, and then sought to lure someone unwittingly into a committed relationship.  And (b) that sex alone is the reason most people cheat.  I’m sure that happens, but I don’t think that’s the typical genesis behind cheating at all.  You should watch/listen to some Esther Perel talks for more insight.\n\nThere’s an old saying that sex is only 10% of what makes a good relationship good, but about 90% of what makes a bad relationship bad.  So it’s always assumed that the reason for cheating is purely sexual.\n\nI think most people (both genders) that “start” cheating are already in a relationship, and are entangled in a set of family, child-rearing, financial, cultural, and religious pressures that tend toward staying married, but are deeply unhappy about some aspect (quite often not sex, but just affection, and feeling needed, loved, and valued) of the relationship.",
   "created_utc": 1693711270,
   "score": 10,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywm2gb",
   "message": "The other person wanted the relationship more than the cheater. The cheater just went with the flow and then a couple months in their situationship told the cheater they’re a couple.",
   "created_utc": 1693715029,
   "score": 3,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywqzyt",
   "message": "Financials, kids, appearance /status/respect of family unit, don't want to rock the boat and go through change",
   "created_utc": 1693717899,
   "score": 3,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyxzx2g",
   "message": "Because it’s way easier to get a relationship than  FWB or casual sex",
   "created_utc": 1693747371,
   "score": 3,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyy0g8o",
   "message": "Relationships are hugely romanticised in modern media. We grow up thinking monogomy is the norm, and while that can be the case, it's not the only case. I think for men especially, attraction to other women doesn't really go away. It's biological to want to procreate.",
   "created_utc": 1693747619,
   "score": 3,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyy7hbw",
   "message": "I known people who cheated because they wanted specific type of sex with someone who wasn’t their long term partner.  The specific example I recall was an acquaintance wanting to explore bdsm / master \u0026amp; slave, but she didn’t want to bring those dynamics to her primary relationship.  \n\nHer and her husband were ethically non-monogamous in general, but this desire seemed specifically something she didn’t want to have him involved in so she wasn’t talking about it to him.",
   "created_utc": 1693750548,
   "score": 3,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywlxna",
   "message": "My dad cheated on my mom because women kept throwing themselves at him, and he eventually relented. \n\nHe was miserable with my mother, but she baby trapped him at a young age into three kids. Forced him to drop out of highschool to pursue work to support her because she refused to work. He was miserable, but tried to stick around for our sake. This was at a time where father's didn't have a chance in hell of custody without a bulletproof reason. \n\nEventually we wound up in these townhouses on government assistance. He was the only present father around and that seemed to appeal to a lot of the single moms around at the time. I guess they started coming onto him and he initially refused, but eventually went for it with a few until my mom found out. \n\nI'm in no way excusing what he did, this is just one of the only real cases of \"why\" someone did it and tried to stick around. He didn't want to not have his kids.",
   "created_utc": 1693714951,
   "score": 9,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyviys0",
   "message": "They are unhappy, unwilling to admit they are wrong, and ego is so big they think they can get away with it",
   "created_utc": 1693697246,
   "score": 7,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywfuvs",
   "message": "They want freedom while having someone that won’t leave them. Its like open relationship but the cheater is selfish.",
   "created_utc": 1693711869,
   "score": 7,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywyw0n",
   "message": "Because sex and commitment relationships are two different things, most cheaters love the person they are committed to and want to continue being with also sometimes people are selfish and want to have it all",
   "created_utc": 1693723149,
   "score": 7,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyws4r4",
   "message": "If you say, want sex three times a week, finding a new person every time would mean you need 120 successes in a month, that's an impressive rate of pull for the average person.\n\nInstead, get a relationship. It's stable and consistent but sex drops to once a week, once a month, the cheater fills the gap with another while still maintaining the initial relationship, this means 2 successful seductions which is much more attainable.\n\nOr less ex based but let's say you get 80% of your needs from your partner, have a good life, place to live, stable best friend, confidant but there's a missing 20%, you fill that gap with the side piece, and finding someone to fill that 20% is way easier than finding an 80% match, think of the wonderful but sexless marriage, the successful businessman whos too busy to romance the wife, the good mother who refuses to do anal, etc... there's that little bit that's just not getting met, so finding the sex, or the romance, or the anal, is the expedient means to fulfillment.",
   "created_utc": 1693718609,
   "score": 5,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jyx4yv2",
   "message": "jfc this is like asking a room full of Europeans to explain the rules of American football.\n\nI started cheating on my (stbx)wife as a response to our dead bedroom marriage. I did everything I could to try and resolve things between us, to no avail. Ultimately I even asked for the open relationship, which she shot down. At that point cheating became a last-ditch effort to save my sanity and the marriage. People get bent out of shape over cheating, but a lot of people don't realize that telling your partner that despite everything they do and bring to the table, it's not enough because they don't fuck you enough can also be extremely devastating. Especially if that person doesn't value sex, and can't comprehend why you'd be willing to walk away from them over it.\n\nOnce you've opened that Pandora's Box, it's open forever. For me, I began to question the sanity of depending on one person to be your everything. Especially sexually. Especially when we don't give enough consideration to sexual compatibility when forming and proceeding with relationships. Especially when sexual compatibility can change over the years for a number of reasons. \n\nI do think that monogamy can work, given both people are on the same page or at least reasonably close enough in regards to relationship wants and needs. Unfortunately...that isn't the case a lot of the time. So many people have a hard line in terms of what they're willing or capable to do. I've met women who refused to give BJs, and expected her partner to just go the rest of his life never getting one ever again. I've met women who could offer little more than a blank stare if you tried to talk to her about your own issues and anxities. Women who would actively belittle my interests and hobbies but then expect me to participate and respect hers. \n\nThese are major deficiencies, of course, but as long as you're not expecting everything from just one person, it can work. She won't give BJs? Fine. Get them from someone else. Can't talk to her about my issues? Fine. A different woman will listen. And so on. Get your cup filled here and there.\n\nSo why not just be polyamorous? Society, at large, is not. I would enter into relationships telling women I wanted to keep it strictly casual, only for her a few months later ask why we aren't serious yet. I've met women who swore up and down that they'd be okay with me seeing other people...but then when I tell them, surprise, they weren't okay with it. People's insecurities prevent them from even entertaining the idea most of the time. \n\nThis is just my experiences though. I feel there is a lot wrong with how we approach modern relationships.",
   "created_utc": 1693727648,
   "score": 6,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywhkqy",
   "message": "A few reasons, really.\n\nA feeling of stability. The perks of a relationship. The thrill. A back up. Selfishness. Sense of authority or betterness. \n\nWhatever their reason, they're all trash. They're the same type of people who get jealous or would dog you for cheating while they're cheating. They're scared of an open relationship because they can't imagine someone other than them being an option for them.",
   "created_utc": 1693712709,
   "score": 7,
   "submission_id": "168gqhs"
  },
  {
   "comment_id": "jywwzfv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "168gqhs"
  }
 ]
}