{
 "submission_id": "168z6nh",
 "title": "What is the most fucked up thing to happen on Reddit?",
 "selftext": "",
 "created_utc": 1693753203,
 "permalink": "/r/AskReddit/comments/168z6nh/what_is_the_most_fucked_up_thing_to_happen_on/",
 "score": 157,
 "url": "https://www.reddit.com/r/AskReddit/comments/168z6nh/what_is_the_most_fucked_up_thing_to_happen_on/",
 "comments": [
  {
   "comment_id": "jyzmk9c",
   "message": "There was a thread awhile back on this sub asking people who killed somebody why they did it. One of the more popular comments was from this guy who said that when he and his friends were kids in the 80's, they were playing outside when they got to the top of this hill, and came across another kid who was generally considered to be the weird kid in the town. They tell him to leave but he refuses. An argument ensues, which ends with one of the boys pushing the kid off the hill to his death, leading to OP and his friends to quickly flee the scene. The next day, the body was gone.\n\n\n\n\n\n\n\n\n\nThe thing is, users were quickly able to find what State OP was from because he had shared it on his profile several times, and when somebody replied to his comment with an unsolved case from that State that was similar to his story, OP quickly deleted his comment.",
   "created_utc": 1693768950,
   "score": 20,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzcw3l",
   "message": "The post where the grandmother didn't belive a child was allergic to coconut and then the child died because the grandmother put coconut oil in her hair",
   "created_utc": 1693765494,
   "score": 41,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz4a0g",
   "message": "The dude who documented trying heroin for the first time and his descent to full blown addict was pretty fucked.  \n\nHe did recover and is still clean if memory serves,  though.  \n\nThat damn safe still gets to me",
   "created_utc": 1693762486,
   "score": 253,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyzuho",
   "message": "The entire sub dedicated to getting high on Benadryl is pretty fucked up but specifically I recall one guy posting exceedingly large amounts he would take and then one day he posted a lethal amount and then never posted again.",
   "created_utc": 1693761020,
   "score": 183,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzda0w",
   "message": "A few years back there was a post on r/legaladvice where a user was asking in extreme detail how sexual assault cases are prosecuted and how the police gather evidence.\n\nFrom their replies and ensuing follow-up questions, it was completely transparent that they were actually looking for advice on how to avoid getting caught.",
   "created_utc": 1693765635,
   "score": 120,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyf1y0",
   "message": "Probably the dude who asked reddit for help regarding wife's infidelity and ended up with wife killing their kid out of spite.",
   "created_utc": 1693753312,
   "score": 234,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz9xtz",
   "message": "One that sticks with me recently is the one where the woman found out her husband was sleeping with her mother and her twin brothers were actually her husbands kids",
   "created_utc": 1693764455,
   "score": 3,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzlglp",
   "message": "The guy that kept finding weird notes in his apartment and was suspicious and it turned out he was getting carbon monoxide poisoning and reddit saved his life.",
   "created_utc": 1693768556,
   "score": 178,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyza25l",
   "message": "The dude who caught his son molesting his dog and his wife defended their son",
   "created_utc": 1693764499,
   "score": 188,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyu0hu",
   "message": "Didn’t people posting on Reddit while participating in the current war for Ukraine get a whole unit of people killed?",
   "created_utc": 1693758876,
   "score": 142,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyynf06",
   "message": "The ask a rapist thread",
   "created_utc": 1693756460,
   "score": 243,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jz04acp",
   "message": "Not as well known as some others but I saw a thread on glitch in the matrix where someone talked about how a room in their apartment disappeared when they were away for a long weekend. Their roommates said it never existed too, so they were freaking out.\n\nIf I remember correctly they updated a month or so later just saying \"Update: I have a brain tumor.\"",
   "created_utc": 1693775087,
   "score": 3,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz9yid",
   "message": "Oh and the programmer guy who actually taught a lot of people how to program and write code. He was sexually assaulting his son? I think, I can't remember all the details.",
   "created_utc": 1693764462,
   "score": 159,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyoaew",
   "message": "The guy who wanted advice about his wife having an affair with the neighbour, majority obviously said to leave her and he did and she ended up taking the lives of their kids.",
   "created_utc": 1693756773,
   "score": 99,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyyvaq",
   "message": "Back in the day I hit the random option on the app and it showed me a subreddit where people were fucking dead corpses. The old reddit was wild",
   "created_utc": 1693760681,
   "score": 148,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz2z10",
   "message": "That 1 time a sub for pedos got subreddit of the year.",
   "created_utc": 1693762060,
   "score": 173,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyykq8p",
   "message": "reddit playing detective during the Boston bombing?",
   "created_utc": 1693755462,
   "score": 19,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz3n42",
   "message": "Jolly rancher or coconut...?",
   "created_utc": 1693762282,
   "score": 109,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz4i6a",
   "message": "The serial rapist describing his escapades (I think mostly in college?) was pretty awful. That was maybe 10 years ago, though.  I just remember redditors thinking...wait, this guy is a serial predator and they can just sort of admit their past on here and get away with it and others might learn or celebrate it.  Maybe this was a mistake, kind of thing.  It might have been an AMA of sorts, but I can't remember.",
   "created_utc": 1693762560,
   "score": 200,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz3lv5",
   "message": "The guy who broke his arms and couldn't fap anymore so started having sex with his mom instead.",
   "created_utc": 1693762271,
   "score": 126,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz61bs",
   "message": "Dude accidentally posting himself having sex with a watermelon in r/gardenwarfare2",
   "created_utc": 1693763078,
   "score": 170,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzfuxw",
   "message": "Somewhere in the top ten would have to be the Gabby Petito subreddit drama.  The girl from the van life youtube channel who was murdered by her boyfriend.  They made a subreddit about it, speculating and playing detective, enjoying themselves in that weird heartless reddit way, and at one point the mod team decided to make [custom awards](https://www.reddit.com/r/SubredditDrama/comments/q3tjgf/mods_on_rgabbypetito_decide_to_introduce/).  The levels of depraved cringe were not measurable on any known scale.  \n\nThen, when some sane people got wind of this, they backtracked and decided to apologize with long, long, masters thesis in-depth pointless mod posts, in one of which the mods [signed their usernames](https://www.reddit.com/r/SubredditDrama/comments/q5klum/mods_of_rgabbypetito_apologize_with_entire/) on paper and took photos of them, for reasons I do not comprehend.",
   "created_utc": 1693766555,
   "score": 111,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzdr6b",
   "message": "The kid who told the story of when he went to a summer camp that turned out to be a cult. He escaped and his parents got him home safely, but shortly after he told the story, he immediately denied all of it and claimed there was nothing wrong with the summer camp. Makes it seem like his account was compromised by them.",
   "created_utc": 1693765804,
   "score": 76,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz4ebj",
   "message": "https://reddit.com/r/confessions/s/zlzzCUUkz1\n\nGuy with the psycho son.",
   "created_utc": 1693762526,
   "score": 26,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyw19d",
   "message": "That guy who shot his dick off",
   "created_utc": 1693759648,
   "score": 162,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzd1wj",
   "message": "Definitely the Boston bomber thing. Horrified to learn how the hivemind harassed that bereaved family. It apparently didn't let up even after it was discovered that the guy was innocent. Vile.",
   "created_utc": 1693765554,
   "score": 214,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzbrf7",
   "message": "The guy who lived an entire life, wife, kids, everything. All ruined because of that lamp. I still think of that sometimes when I swear the picture on my fireplace is in a different position / the Monopoly man had a monocle.",
   "created_utc": 1693765095,
   "score": 49,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzlwso",
   "message": "The one thing I'll always remember besides the top ones mentioned is the guy who was in a coma or something and had like a dream or something about having a wife and kids and then he woke up and didn't and he was confused and sad about it.  \n\nEdit: OK now that I read the entire thread, it was that he had gotten a head injury/knocked out and while he was knocked out he lived like an entire life... years of courtship and marriage and having two kids. And then he woke up and it was only a little bit later and a cop was helping him to the hospital... so basically he lived a 10 year life or so in a matter of minutes of being blacked out.",
   "created_utc": 1693768717,
   "score": 211,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz7k1f",
   "message": "the profile of a user who was in a deep psychotic state that he cut his penis because god said so.\n\nu/worthless319",
   "created_utc": 1693763606,
   "score": 69,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyysm8u",
   "message": "That video of the underground chinese baby-corpse-soup is amongst the most fucked up shit ive ever seen.",
   "created_utc": 1693758358,
   "score": 134,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzcsg0",
   "message": "That dude who made the mustard gas or whatever it was I’m the bathroom and started posting pictures of his skin melting",
   "created_utc": 1693765457,
   "score": 134,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jz0d471",
   "message": "Probably tame compared to others, but the post by a girl who caught her parents having sex. They were role playing having sex with her and the mum was dressed in her daughters clothes. \n\nShe went to stay with a friend and her friends father began a sexual relationship with her. \n\nLast i saw she had moved on to become a stripper.",
   "created_utc": 1693778406,
   "score": 56,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz74b4",
   "message": "Broken arms kid.",
   "created_utc": 1693763456,
   "score": 152,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyl1mb",
   "message": "\"We got him.\"",
   "created_utc": 1693755584,
   "score": 233,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyv1vz",
   "message": "On a more disgusting side of “fucked up”, the infamous post “ The Swamps of Dagobah”.   You’ve been warned curious Redditor\n\nEdit: I won’t summarize the content; look it up yourself.  The story itself is pretty well written.  It’s a work of art, a very disgusting one at that.  Like a beautiful painting but painted with puss, shit, and other disgusting foulness.",
   "created_utc": 1693759275,
   "score": 225,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzdc2r",
   "message": "Realizing I could have been learning something useful instead of endlessly scrolling.",
   "created_utc": 1693765655,
   "score": 246,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz9agm",
   "message": "Cum box. \n\nEveryone else already mentioned the other shit, so I'll just stick with the cum box.",
   "created_utc": 1693764225,
   "score": 146,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz3d0p",
   "message": "BME Pain Olympics circa 2007",
   "created_utc": 1693762189,
   "score": 80,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzk4c4",
   "message": "Forgot exact details but the post about someone who tried to leave their wife but in retaliation killed their kids and would have her family watching their graves to prevent the husband from having a proper chance to grieve",
   "created_utc": 1693768086,
   "score": 84,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzlttp",
   "message": "Something, something, broke both my arms...",
   "created_utc": 1693768688,
   "score": 80,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz8uyb",
   "message": "It wasn't really fucked up but it was wild how quick it was. There was some sort of AMA of an Afghan warrior and he was responding to some questions and talking about it and half way through mods and stuff confirmed that the U.S bombed and killed him. It was impressive",
   "created_utc": 1693764071,
   "score": 204,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyytuj9",
   "message": "Gotta be the Boston Bomber series of events",
   "created_utc": 1693758816,
   "score": 134,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz4x6j",
   "message": "This is what [https://www.reddit.com/r/MuseumOfReddit/](https://www.reddit.com/r/MuseumOfReddit/) is for.",
   "created_utc": 1693762701,
   "score": 137,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jz08cfq",
   "message": "The one that affected me most was on BORU recently.\n\nIt starts as a hilarious story about the redditor's friend who is a really specific kind of stonemason working on a historic building. The boss of the firm he's contracting for is a dick so he leaves knowing they can't replace him, they end up getting someone from overseas who uses a similar but different technique which doesn't meet the building regulations etc. Really good malicious compliance type story.\n\nThen out of nowhere the redditor telling the story dies from complications after a car accident. His wife takes over his account and posts updates, but she also loses all hope for her future without him and from the last post it looks like she probably killed herself.\n\nIt was just so fucking sad.",
   "created_utc": 1693776557,
   "score": 34,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz0rlc",
   "message": "A pedo subreddit being voted the subreddit of the year back in 2008.",
   "created_utc": 1693761324,
   "score": 155,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz2g0l",
   "message": "Colby 2012",
   "created_utc": 1693761882,
   "score": 61,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzebzn",
   "message": "I didn't see this myself, but some guy posted about anally raping his wife as some sort of a annual tradition. Probably got wiped from reddit since I searched for it and didn't find it.",
   "created_utc": 1693766008,
   "score": 61,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyt5e3",
   "message": "That dude who broke his arms. You guys know the one.",
   "created_utc": 1693758557,
   "score": 113,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz9ref",
   "message": "Not the most fucked up thing, but do you guys remember the woman who posted about a weird door that she found in her new house, everyone encouraged her to go check it out and she was never heard from again?",
   "created_utc": 1693764390,
   "score": 126,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzekjv",
   "message": "Poop knife",
   "created_utc": 1693766089,
   "score": 188,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz6f3j",
   "message": "Not too disgusting and fairly recent, the Reddit short on GameStop was a bit wild.",
   "created_utc": 1693763209,
   "score": 87,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyyf89f",
   "message": "Kinda wild that the current CEO once defended an outright pedo sub when it became the news.",
   "created_utc": 1693753375,
   "score": 202,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzlktn",
   "message": "Someone once told me that before it was banned, 75% of reddits traffic went to a r/jailbait. \n\nYou fill in the blanks on what that sub was.",
   "created_utc": 1693768597,
   "score": 44,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzedlz",
   "message": "Definitely the father who's son was fucking the family dog.",
   "created_utc": 1693766024,
   "score": 23,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzfy1n",
   "message": "u/spontaneousH",
   "created_utc": 1693766589,
   "score": 23,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzxgr2",
   "message": "Lot of mentioned ones, but there was the story of the guy who had commented under one of those \"Have you ever killed someone?\" AskReddit threads. Story goes something like he was upstairs playing games with headphones on while his wife and kid were downstairs. Some intruder broke in and sexually assaulted the wife at knifepoint, while he was upstairs unaware. I think he finally heard something so he came downstairs and saw what was happening and shot the intruder dead. Made extra sure to point out the intruder was Hispanic and his wife developed PTSD and would panic around hearing men speak with Hispanic accents, and made sure to warn people about wearing headphones during gaming. As it turns out, the story was a lie. Some redditors played Batman and fact-checked, searched his posting history  and the area he said he was from, and whatever else they do. Come to find out it was either a complete fabrication or a copypasta with some details changed, I forget.",
   "created_utc": 1693772713,
   "score": 21,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jz0c4cu",
   "message": "Foot tacos guy. This guy had to have his foot amputated following a motorcycle accident. Well he had always been curious about eating human so he decided to take his amputated foot and make tacos out of the meat.",
   "created_utc": 1693778009,
   "score": 20,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyz86rl",
   "message": "r/incestconfessions",
   "created_utc": 1693763827,
   "score": 41,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzeloh",
   "message": "The guy with two dicks",
   "created_utc": 1693766101,
   "score": 40,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzfota",
   "message": "People peer pressuring not to sell GME, when a good amount of us were indeed selling. We’re not all in positions to turn down 480/share.",
   "created_utc": 1693766494,
   "score": 42,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzbo81",
   "message": "Not as big as other things, but a kid of what looks to be 8 throwing his cat on a bed, leading to him being doxed and his ip being revealed, all on the r/jakertown subreddit which eventually led me to leave the sub",
   "created_utc": 1693765064,
   "score": 62,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jz0s5pb",
   "message": "On aita there was one person who had a series of posts. Bout two or three to my knowledge\n\nBasically her and her hisband have three kids. Two on the spectrum and under 6. And one infant. Basically bedtime is a noghtmare because the two older ones are hard to out down and tend to keep each other up. They get loud enough that they will wake the other two so its a mess of a balancing act every noght for both of the oarents.\n\nDad basically found that they go down easy if in a car while its driving so at bed time he takes one of the two out to drive around while they fall asleep. This opens the other one up to be out to sleep much easier.\n\nWife becomes suspicious because she feels the drives take too long or something.\n\n\nReddit decides to adamantly convince her he is raping all the children definitively (in the comment exchanges she is showing signs of diminished mental health btw)\n\nThey get her so twisted that they collectively talk her into tracking him\n\n\nSecond post is how she tracked his car illegally and has been secretly recording him(no evidence of anything bad going on and the kids have nothing but the highest praise for him). The sub continues to insist the kids are raped daily  and that she needs to divorce hik and escape with the kids…. As the exchanges continue op is clearly going through some mental break down. Reddit however is having too much fun torpedoing her life…..\n\n\nAita is really a toxic shitty sub",
   "created_utc": 1693784604,
   "score": 18,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzhi3q",
   "message": "There was the CO2 poisoning guy but that's one of the less fucked up things to make the list",
   "created_utc": 1693767144,
   "score": 59,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jyzjlm1",
   "message": "People making money off of sitting in front of a microphone reading from Reddit. Seriously these are people's real dilemmas and somebody who paid for a $35 microphone sits on tick tock and makes thousands off of other people's stories? Even when people ask that their stories not be told! That's definitely the most fucked up thing about Reddit.\n\nOh and the sites like factionate that steal everybody's stories and put them in a big list with a bajillion ads.",
   "created_utc": 1693767904,
   "score": 62,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jz0mnba",
   "message": "The time reddit administration covered for a pedophile they hired",
   "created_utc": 1693782302,
   "score": 14,
   "submission_id": "168z6nh"
  },
  {
   "comment_id": "jz01vy5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "168z6nh"
  }
 ]
}