{
 "submission_id": "1695jpv",
 "title": "What do alot of parents do that unknowingly screws their children over?",
 "selftext": "",
 "created_utc": 1693768544,
 "permalink": "/r/AskReddit/comments/1695jpv/what_do_alot_of_parents_do_that_unknowingly/",
 "score": 249,
 "url": "https://www.reddit.com/r/AskReddit/comments/1695jpv/what_do_alot_of_parents_do_that_unknowingly/",
 "comments": [
  {
   "comment_id": "jyzlvis",
   "message": "Forgetting what it was like to be that age, and expecting their kids to react differently to things than them when they were that age.",
   "created_utc": 1693768704,
   "score": 114,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzuzc0",
   "message": "They fail at letting their kids fail and figure out how to recover. It prevents the kids from becoming resilient.",
   "created_utc": 1693771851,
   "score": 54,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzsafe",
   "message": "Not apologize when they’re wrong",
   "created_utc": 1693770914,
   "score": 152,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzxiui",
   "message": "Over sheltering them.  You can't protect your kids 24/7 for their whole lives.  It leads to naive adults that get taken advantage of.",
   "created_utc": 1693772733,
   "score": 138,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzrnno",
   "message": "Might sound a little contradictory but either not disciplining them or disciplining them way too much",
   "created_utc": 1693770700,
   "score": 28,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzmhas",
   "message": "Not teach them to think for themselves",
   "created_utc": 1693768921,
   "score": 180,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzmkb1",
   "message": "Forgetting that a kids brain isn’t fully developed like their own. \n\nAlso, shaming in any way of something your kid is into. Trying to learn about it is actually quite helpful and a good way to connect. And, parents can learn things that they like too. I didn’t know I liked Pierce the Veil until my 12 year old liked them and I wanted to check them out",
   "created_utc": 1693768951,
   "score": 217,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzu3mb",
   "message": "Try to fill every minute with organized activities such as traveling sports leagues.  Don't get me wrong, some extra curricular activities are good, but when your kids never have an unaccounted for minute I think it has a negative impact.",
   "created_utc": 1693771545,
   "score": 131,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzljpt",
   "message": "Comparing them with other kids🤦",
   "created_utc": 1693768586,
   "score": 22,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzt1u7",
   "message": "Shouting at them instead of having a conversation",
   "created_utc": 1693771179,
   "score": 243,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzrwd9",
   "message": "Not discussing money with them. \n\nI'm not saying parents should dump their financial stress on their kids, but things like budgeting, taxes, and personal finance discussions would've helped me tremendously.",
   "created_utc": 1693770782,
   "score": 137,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyznsqy",
   "message": "Not encouraging them to learn basic skills like cooking for fear it’ll *MaKe a MeSs*",
   "created_utc": 1693769379,
   "score": 65,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzx40c",
   "message": "Refusing to be wrong or take accountability. Being wrong is ok and it can be a learning moment for both of you. Randomly punishing your kid for being right or potentially right cause they argued may make it so they never ask you anything again.",
   "created_utc": 1693772591,
   "score": 151,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzrue9",
   "message": "Thinking them as property. We all understand parents are responsible for the offspringss actions but they aint property.",
   "created_utc": 1693770764,
   "score": 134,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzokqb",
   "message": "Never telling them 'no'",
   "created_utc": 1693769637,
   "score": 199,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzsf1r",
   "message": "Posting them on social media.\n\nClarification:\n\nWhen they get disciplined \u0026amp; it gets recorded \u0026amp; posted online.\n\nNot respecting their privacy.",
   "created_utc": 1693770957,
   "score": 104,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzukxt",
   "message": "Not taking the time to explain themselves on certain topics. The whole 'do as I say because I said so' or 'because I had you' is not effective.",
   "created_utc": 1693771710,
   "score": 150,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzv2my",
   "message": "Not respecting their privacy because it's \"their home\" . Barging into their room , asking them to leave the door open etc...\n\nIt give kids anxiety. And it last . \nI moved to my own place and sometimes I still look at the door expecting it to open etc...",
   "created_utc": 1693771882,
   "score": 169,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzxuzw",
   "message": "Telling them \"That's nothing to be sad over, some kids don't even have \\_\\_\\_\\_\\_\\_\"\n\nNow I repress my feelings and cry whenever I have to let them out, never believing they're valid :)",
   "created_utc": 1693772850,
   "score": 206,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzwj5s",
   "message": "Putting excessive pressure on their children to meet their own unfulfilled aspirations.",
   "created_utc": 1693772391,
   "score": 90,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzqmb9",
   "message": "Not allowing their children to have privacy",
   "created_utc": 1693770343,
   "score": 207,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzt0zf",
   "message": "Not letting them learn how to mourn. \n\nOn a grander scale, there’s this idea of not letting your children suffer. We all know it’s important to let them struggle a little to learn how to cope. \n\nBut one no one ever talks about is allowing your child to mourn a loss. If a beloved toy breaks, go buy a replacement ASAP! If a pet fish dies, go buy a replacement ASAP! You’re teaching the kid to just replace things they’ve lost instead of processing the loss. So what happens when they lose something that can’t be replaced? They don’t know what to do or how to handle it. Like, let your kid cry over their dead fish for a few days and bury it in the garden with some flowers before asking if they’d like another.\n\nPeople think it’s small, oh it’s just a toy, but losing a beloved toy is likely the closest thing a kid has to losing a person or a pet they’ve had for years like a dog. Let them learn to mourn their lost teddy bear so they’ll build those processes and when older, can mourn the family dog, etc.",
   "created_utc": 1693771172,
   "score": 172,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzreoq",
   "message": "Yelling at them for dropping/breaking/spilling stuff. \n\nNot their fault! \n\nAnd way to teach them they can’t come to you when they accidentally fuck up in the future.",
   "created_utc": 1693770616,
   "score": 178,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzr6p9",
   "message": "Forcing them to interact with their adult friends, then ridiculing them for not wanting to socialize with rando adults, and then humiliating by bringing up an embarrassing moment as a \"hilarious\" anecdote.\n\n*\"Come on down and say hi!\"*\n\n*\"OH, LOOK WHO FINALLY  DECIDED TO JOIN US!\"*\n\n*\"Oh, this is the funniest thing!  Did you know she still wet her bed until she was six! Six! AHAHAAHAHAH!\"*",
   "created_utc": 1693770542,
   "score": 34,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzuh0z",
   "message": "Guilt tripping them",
   "created_utc": 1693771674,
   "score": 50,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzsoow",
   "message": "I was raised with the motto “If you lose, you can’t come home.”  \n\nMy great-grandfather said it to my grandmother when she was being bullied by a boy.\n\nMy grandmother said it to my mother when she ran in the house from a girl who was beating her up;  kicked her out and locked the door.  “If you lose, you can’t come home.”\n\nFor me, there was no one incident.  It was just a mantra.  And now I am absolutely afraid of failure of any sort, I come to work hours early to prepare and stay late to make sure I’ve got it right.  Same with my hobbies, and every part of my life.  I cannot be bad at anything.  Free time only exists as practice/study/training time.  The amount of pressure I put on myself is not healthy.\n\nI’m 38 years old, and I haven’t spoken to my mother in 10+ years.\n\nBut I almost always win, and I’m fucking amazing at the things that I do.  Small consolation.  Parents fuck us up, man.",
   "created_utc": 1693771053,
   "score": 29,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzx36e",
   "message": "Not telling them why a decision was made of they ask. The \"cause I said so\" or \"dont talk back to adults\" is so damaging",
   "created_utc": 1693772583,
   "score": 80,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzsdhp",
   "message": "Passing on food issues by commenting on their children's weight or what they eat etc. Or commenting on their own weight and food habits-- always dieting and putting themselves down.\n\nI am so lucky my parents and family have a healthy relationship with food, and thus I do as well. I have adult friends who have all kinds of messed up food issues precisely bc their parents messed them up.",
   "created_utc": 1693770942,
   "score": 28,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzvigi",
   "message": "Giving them stupid names or with stupid spellings.",
   "created_utc": 1693772036,
   "score": 206,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzv323",
   "message": "Not worrying about the \"easy\" and \"uncomplicated\" kids, who are always well-behaved or \"already so grown up\" - because they had to. \n\nThey usually are like that for a reason and will probably grow into people pleasers who struggle to set boundaries and stand up for themselves.",
   "created_utc": 1693771886,
   "score": 178,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzv80p",
   "message": "Forcing them to hug people (friends/family members) when they say they don't want to. All you're teaching them is to put other people's feelings above their own discomfort. Bonus points for guilt trips \"well if I don't get a hug then I won't give you this toy I bought for you\" please don't teach my child to give physical affection in exchange for gifts. \n\nI was raised this way and was such a people pleaser, I would make my life as difficult as possible to make sure I don't inconvenience a soul, it's a lot of work to unlearn it",
   "created_utc": 1693771935,
   "score": 151,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzpyuz",
   "message": "I'll add my two cents here, not seeking therapy for kids who are showing signs of depression or other mental issues because they think they are just \"a little sad\" or \"he'll get over it\"",
   "created_utc": 1693770122,
   "score": 141,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzs603",
   "message": "Telling your kids they are so smart constantly when they are excelling in primary school but then expecting the exact same grades and chastising them for being lazy once they hit middle school and the work actually becomes difficult.\n\nYou're not 'pushing them to do better', all you've done is instill this idea that they've peaked early and that they are a failure and a disappointment for not being a genius, because everything used to be so easy and suddenly its hard and everyone is mad at them. Ask me how I know.\n\nParents: reward honesty, hard work and a good attitude. Don't attach your kids worth to their grades and test scores. Also the difficulty jump for things like math is absurd between primary and secondary school, so expect some struggle. Not to mention puberty is happening at that time and absolutely fucking with the kids emotions.",
   "created_utc": 1693770872,
   "score": 140,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzqsbr",
   "message": "To want to be their best friend, not their parent.",
   "created_utc": 1693770401,
   "score": 45,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzumwc",
   "message": "Having arbitrary rules which they drop for the younger kids or apply differentlyto different kids. We have very few rules but we discuss why we have them with our kids and if we think they're not working we talk about that with them.",
   "created_utc": 1693771729,
   "score": 147,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzoxnz",
   "message": "Shouting, makes kids scared of it , not a good thing to be scared of as a adult",
   "created_utc": 1693769761,
   "score": 211,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzyuh4",
   "message": "unloading their stress and issues on kids. that's what therapy is for. kids need to feel safe, protected, loved, etc.",
   "created_utc": 1693773189,
   "score": 205,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jz00gno",
   "message": "Forcing their kid to do something they *really* hate doing because \"it'll be good for them\".\n\nThat's not how it works. You should encourage your kid to do things, but you should also be able to tell when they really don't want to. It'll just have the opposite effect otherwise.\n\nEdit: Specifically when they really don't want to *continue* doing that activity. Give it a couple tries.",
   "created_utc": 1693773749,
   "score": 208,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jz06byl",
   "message": "Having a toxic relationship and staying together for the “sake of the kids”",
   "created_utc": 1693775816,
   "score": 141,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzwgf2",
   "message": "Try to keep their kids from making mistakes. Mistakes are good teaching moments, and when you are a kid, the consequences are the least serious. This would lead to more honesty and openness, since kids wouldn't feel okay with discussing a mistake with you, because they know you want to help them grow from it! Instead, parents are making their kids keep secrets out of fear they will be punished, instead of taught how to better handle the situation.",
   "created_utc": 1693772365,
   "score": 70,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzxowd",
   "message": "Not letting them struggle. \n\nI don’t mean parents should never help, but running in to fix every difficulty teaches kids to think they can’t solve problems. Help them by asking questions, by encouraging them to explore solutions - not by clearing every obstacle in their path. \n\nAnd then - help them to reflect on the process. Praise them for their effort and their persistence. Let them learn to view mistakes and failures as part of the process. Let them own their successes and be proud that they worked hard.",
   "created_utc": 1693772790,
   "score": 185,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jz00g02",
   "message": "Saying 'you should smile more' when the kid has a good reason to be miserable about...",
   "created_utc": 1693773742,
   "score": 61,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzvuqw",
   "message": "MIND GAMES! I don't know about other parents but mom knows how to mess with my head. She doesn't do it intentionally, or as well as her mom does, but it has messed me up for years and now I don't have enough confidence to stop being a people pleaser or really speak my mind.",
   "created_utc": 1693772151,
   "score": 120,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzvn8n",
   "message": "Teaching them that being hit is okay when it's from someone who loves you and as a punishment given by them \"because they love you\"",
   "created_utc": 1693772081,
   "score": 108,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzxfnk",
   "message": "Over protective and always having to be right. Also being too strict.",
   "created_utc": 1693772702,
   "score": 52,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzw6pw",
   "message": "Have them\n\nSome people should just like, really not have kids.",
   "created_utc": 1693772267,
   "score": 116,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzxz4n",
   "message": "Preparing the path for their kid, instead of the kid for their path",
   "created_utc": 1693772890,
   "score": 99,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jz054xs",
   "message": "Not realizing that they have the same emotions and experiences as adults, without the years of figuring it out. The are literally little people. Anything you wouldn’t do to an adult you certainly shouldn’t do to a child. You don’t hit an adult when they are wrong, you don’t scream at them, you treat them  with the same dignity and respect as anybody.",
   "created_utc": 1693775388,
   "score": 174,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzwud3",
   "message": "Making their “purpose” in life their children.  Your parents purpose and self worth will be dependent upon your actions. Letting your parents down etc.",
   "created_utc": 1693772499,
   "score": 130,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jz00szh",
   "message": "Bullying their own kids and then telling them they need to ‘toughen up’ and grow a ‘thicker skin’ when the kid get upset. Like whatever happened to just treating your kids with respect and kindness so they in turn would treat others with respect and kindness? \n\nAlso, completely disrespecting their kids’ boundaries when they say no. If you don’t listen when your kid is telling you no, why would your kid think that anyone else is going to listen to them when they say no?\n\nI think your own parents being your biggest bully growing up is a topic that seriously needs more research. And I don’t mean just the obviously abusive kind. I mean the subtle bullying, constantly telling your kids they can do better so why aren’t they getting better grades, the constant bringing up embarrassing shit that happened when they’re kids, the pranks that makes your kid embarrassed and uncomfortable and then telling them they can’t take a joke, forcing your kids in situations where they’re clearly uncomfortable and doing nothing to make them feel better or secure.",
   "created_utc": 1693773865,
   "score": 136,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzz2uq",
   "message": "comparing then to other kids\n\nI vividly remember all the times I was like six and my dad sat me down to watch kids my age with amazing talents and ask \"when are you gonna play guitar like this?\" \n\nhe thinks I don't remember but I so do",
   "created_utc": 1693773265,
   "score": 44,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jz0r9o7",
   "message": "- yelling at your child\n- never admitting you’re wrong\n- having kids to repair a relationship\n- trying to force your kid to wear certain clothes / makeup\n- telling your kid not to be so sensitive\n- getting drunk every weekend \u0026amp; then pretending like you don’t have a problem\n- screaming at your kid for several hours while drunk, forgetting about it completely, then buying an “I’m sorry” breakfast the next day\n- not going to marriage therapy when marriage is having problems\n- telling your 13 year old kid about specifics of your mental health problems\n- comparing your kids to each other\n- idealizing one kid \n- scapegoating one kid\n- having totally different private and public personas\n- years later pretending you never said \u0026amp; did all those things to your kid that you did do \u0026amp; then on the off chance they have proof of those things, gaslighting the fuck out of them and telling them “it was so long ago, just forget about it”\n\nI probably can think of more",
   "created_utc": 1693784226,
   "score": 50,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzr9dp",
   "message": "not teach kids how to manage money",
   "created_utc": 1693770567,
   "score": 92,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzv7rm",
   "message": "Making them feel like a burden, either financially or logistically, has to be up there as a silent trauma that takes root over time.",
   "created_utc": 1693771933,
   "score": 113,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jyzn2po",
   "message": "thinking your child can't think for themselves until they are 18",
   "created_utc": 1693769127,
   "score": 131,
   "submission_id": "1695jpv"
  },
  {
   "comment_id": "jz0ioya",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1695jpv"
  }
 ]
}