{
 "submission_id": "1696476",
 "title": "What’s the dumbest thing you did out of horniness that you instantly regretted doing?",
 "selftext": "",
 "created_utc": 1693769910,
 "permalink": "/r/AskReddit/comments/1696476/whats_the_dumbest_thing_you_did_out_of_horniness/",
 "score": 172,
 "url": "https://www.reddit.com/r/AskReddit/comments/1696476/whats_the_dumbest_thing_you_did_out_of_horniness/",
 "comments": [
  {
   "comment_id": "jz09kli",
   "message": "Looked up \"naked girls\"  once, and now my life's messed up.",
   "created_utc": 1693777018,
   "score": 72,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1y961",
   "message": "At 18, I (M) signed up for Cougar Shag (here in the UK it's a mature woman sex site), and made a date with a 46 year old woman.\n\nI get there, she stinks of cigarettes and her house is an absolute disaster and I can't get it up when it eventually comes to it. I spent about 15 minutes jerking my flaccid dick over her tits trying to get hard while she talked dirty to me before she eventually asked me to leave. \n\nLongest 15 mins and most awkward night of my life.",
   "created_utc": 1693803720,
   "score": 193,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzv0ey",
   "message": "Oh god, banged my colleague who I really really really hated working with. I resigned 2 months later as it was becoming very suffocating.",
   "created_utc": 1693771862,
   "score": 89,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzqkp9",
   "message": "with a co-worker. Worst mistake ever, i dont know how to get out of this situation.",
   "created_utc": 1693770328,
   "score": 209,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0naqk",
   "message": "Sharing a real picture of myself with a stranger. Nudes from neck down is one thing but showing my face was a HUGE Mistake!",
   "created_utc": 1693782573,
   "score": 32,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzsxu8",
   "message": "You guys ever get like post-nut clarity, where you’re just like wtf did I just watch",
   "created_utc": 1693771141,
   "score": 46,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0lxw5",
   "message": "I was so horny one day when I picked up my gf at work. We went to a park and you know those hooded slides? Well keep that in mind. This happened at midnight but we went on the slide and I banged up the ass cause I had no condom for vaginalwhile we were inside the hood of the slide and we were hanging on so we did not slide down. A good humored cop in a squad came by and saw two sets of legs sticking out and all he said on the bullhorn to 'get a room you two' driving away and cackling",
   "created_utc": 1693782010,
   "score": 121,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzsak3",
   "message": "Got married then had kids",
   "created_utc": 1693770915,
   "score": 124,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0fiwr",
   "message": "This feels like an appropriate post for the coconut guy:\n\nhttps://reddit.com/r/tifu/s/Ps7HC4sglX",
   "created_utc": 1693779373,
   "score": 60,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz19n29",
   "message": "In college, two girls (just friends) from our home town asked my roommate and me to come party with them as they had two other girls at their place. One of the girls was also in college at our university and the other was that girl’s parent’s foreign exchange student from Iceland. We all got drunk and next thing I know my roommate and I were in a bedroom with the two girls we just met. I was on the bed with the college-aged girl making out and my roommate was on the floor, having consensual sex with the foreign exchange student. A couple days later, the college-age girl who was very religious was feeling guilty and threatened to call the cops on my roommate because he had had sex with a 17-year-old! We were too drunk to even consider that she might be under age. For the next two weeks we drove ourselves crazy thinking that the police were going to be knocking on our apartment door charging my roommate with having sex with a minor and me as an accomplice. Thank God, she had second thoughts and never reported it to her parents or the cops, but we were sweating this out for about three weeks.",
   "created_utc": 1693791959,
   "score": 117,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0zn8l",
   "message": "wanted to feel what being cummed inside was like. decided in my state of horniness that any liquid would work. so i grabbed the closest thing: a perfume bottle. \n\nit did not work. \n\ni have not felt worse pain since and was in a car accident about a year after that event. snapped my arm in half. it was nothing compared to that burn between my legs.",
   "created_utc": 1693787669,
   "score": 27,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1oo8s",
   "message": "Nice try wife",
   "created_utc": 1693798740,
   "score": 206,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1fp39",
   "message": "When I was in high school, I would flash my boobs on Omegle to the creepy men for attention. For some reason, I thought it was kinda hot, and the more I look back on it, I was very lucky I didn't get in some kind of trouble for being underage and doing that.",
   "created_utc": 1693794612,
   "score": 202,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz20z59",
   "message": "Had a family car, three rows of seats, when I was younger. Must have been about 11 or something, the age before you can properly produce cum\n\nUnfortunately, that meant I would danger wank a lot. Parents parked the car to watch people play cricket, I was supposedly in the back on my game boy, but I was cranking one out\n\nWhen you first discover your penis and the magical properties it can offer, you get driven to some risky business",
   "created_utc": 1693805238,
   "score": 128,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1sa65",
   "message": "Spent 400$ at a strip club",
   "created_utc": 1693800516,
   "score": 60,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz16qbg",
   "message": "Shagged someone who I knew liked me after years of knocking back advances because I knew fine well it would hurt their feelings, I told them many times it would hurt their feelings because I don't view them that way and have nothing to offer romantically. One day the horny just struck when they were being forward and I was then stuck with months of angst ridden \"You must like me, you are in denial\" when really I'm just very compulsive with sex when I don't want to be. It meant nothing, absolutely nothing, I did like them as my friend too. Wasn't exactly dishonest because I said exactly what would happen all along but I regretted that one",
   "created_utc": 1693790691,
   "score": 160,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzq8dw",
   "message": "Sexted with my bestie (we're both straight females)",
   "created_utc": 1693770213,
   "score": 82,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz21pxi",
   "message": "Took a nude nature walk on a park path. Hid behind a tree when I heard two guys riding mountain bikes.",
   "created_utc": 1693805665,
   "score": 46,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz05stq",
   "message": "Signed up for Reddit.  Lol",
   "created_utc": 1693775626,
   "score": 166,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz08es6",
   "message": "Had sex at a massive lake party. In broad daylight, in front of everyone. That was horniness and alcohol tho. But ya, not a great moment for me.",
   "created_utc": 1693776581,
   "score": 192,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz111j0",
   "message": "Slept with my ex. As soon as I did that, her manipulative and controlling bs started coming out again. Harrassing any woman I started talking to. Going through my phone. Then shed flip her shit because I didnt want to sleep with her. Then claimed she was pregnant. Would blow up my phone. Only got aay from her because I moved.",
   "created_utc": 1693788247,
   "score": 87,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2e17r",
   "message": "“I started swearing to my god and on my mother's grave\nThat I would love you to the end of time!\nSo now I'm praying for the end of time\nTo hurry up and arrive”",
   "created_utc": 1693813413,
   "score": 34,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzyndn",
   "message": "Sex with ex husband and two of his coworkers.",
   "created_utc": 1693773122,
   "score": 158,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2e28s",
   "message": "Kept having sex with a man I really liked, when I knew it wasn't reciprocated.... He was safe and I never felt in danger and that can be hard to find. But I was only hurting myself. But sometimes you just crave human touch.",
   "created_utc": 1693813433,
   "score": 30,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz12hs9",
   "message": "“Fell in love” with an absolute wack-job. Took me months to get out of that situation. I was too afraid she’d kill me or herself.",
   "created_utc": 1693788851,
   "score": 61,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzr5cx",
   "message": "Drove through a blizzard, unplowed country roads in a tiny old Honda. Thankfully made it but bottomed out too many times to count and that old car was barely able to push through.",
   "created_utc": 1693770528,
   "score": 98,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0m04r",
   "message": "Attempting to fuck a mcdonalds toy",
   "created_utc": 1693782036,
   "score": 98,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz19g4o",
   "message": "Thought someone wasnt going to smell as bad as last time.\n\nspoiler alert, they did.",
   "created_utc": 1693791875,
   "score": 56,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1fnce",
   "message": "Unprotected sex with someone who told me before: vasectomy and clean 6 mo sti test.\n\nTold me after, had unprotected sex with a woman cheating on her husband and a coke addict. \n\nClean bill of health 3 months later, still have 3 months more until i feel comfortable again. \n\nIm in hell.",
   "created_utc": 1693794590,
   "score": 57,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz16yxg",
   "message": "These are surprisingly tame.",
   "created_utc": 1693790795,
   "score": 120,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzufcv",
   "message": "Hooker",
   "created_utc": 1693771657,
   "score": 108,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1bevg",
   "message": "At 15 having sex with my girlfriends mother who was 35.",
   "created_utc": 1693792732,
   "score": 117,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1sdm3",
   "message": "Banged an ex who was 6 months pregnant with someone else’s kid so I could nut inside…creampie fetish.",
   "created_utc": 1693800566,
   "score": 64,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2c6g2",
   "message": "It seems like I'm not the only one I fucked the new office girl at work now, it's been 6 months she's in love with me and I don't know how to get out of it",
   "created_utc": 1693812172,
   "score": 22,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0uaw1",
   "message": "I was the \"other man\" for a few months. I wish I could say I was naive, but I knew better. But it had been a few years since my divorce and I hadn't been with anyone since. I wasn't even actively looking for anybody, and my boss kept being more and more flirty. Eventually horniness and loneliness got the better of me and we had an affair. We hooked up several times over a few months and then I finally cut it off. What an idiot.\n\nEDIT: P.S. it was the best sex I've ever had.",
   "created_utc": 1693785494,
   "score": 124,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2fbe7",
   "message": "Not out of horniness but my innocences was ruined when on the computer, it was firefox and the previous search results were all there. I had 3 older brothers. As a child I would search up pokemon because it was the coolest thing.\n\nNow one day I started typing in P... O... Then I saw what I though was a dumb way to spell corn. I was never the same since....I'll never forget my first memory of big boobie russian teacher.",
   "created_utc": 1693814262,
   "score": 18,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1ircn",
   "message": "searched up porn on a sleepover with friends. Parents found out and we were grounded for months 😭",
   "created_utc": 1693795971,
   "score": 38,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz22348",
   "message": "I sorta like positioned a stuffed animal in a scissoring position when I was like 13/14 and curious because I wanted to know what it was like to get it on with another girl. Regret regret regret cringe cringe cringe.",
   "created_utc": 1693805879,
   "score": 16,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz24lzm",
   "message": "Moving out of college at the end of my first year. Since I went to the same college as my twin sister, my parents went in two trips to take our stuff, so they took half our stuff one weekend, then the second weekend we went with them with the remaining stuff.\n\nAnyways, on the first packing, I packed away my lube, thinking it would only be a week until I was home and I get spend a week not jacking off so I could focus on finals. Never trust an 18 yo guy to not be horny.\n\nFew days in and I was getting a bit hot and bothered but I had no lube to crank one out, so I ended up going into the dorm's shower and making some makeshift lube from shower shampoo and the water from the shower head. Big mistake.\n\nThe shampoo was kinda cheap and sticky and my sick ended up shriveling and I didn't get an erection for a week. Even worse, I think some of the soap got into my penis hole so it hurt to pee for a week too.\n\nMistakes were made...",
   "created_utc": 1693807376,
   "score": 19,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz13sme",
   "message": "Stuck my dick in crazy",
   "created_utc": 1693789414,
   "score": 66,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0pr2j",
   "message": "Asked my ex for some pictures even though I already knew what the answer would be",
   "created_utc": 1693783590,
   "score": 15,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jyzszt9",
   "message": "Fapped on my dead classmates last pic",
   "created_utc": 1693771161,
   "score": 139,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1vwlq",
   "message": "Fucking my co-worker. Been at the same job for 10 years. Got pulled into a lot of drama, and now I have to work shoulder to shoulder with her, and she just makes my skin fucking crawl. Sadly, she isn't going anywhere any time soon, and I'm far enough up the seniority ladder that I don't plan on changing. And now, I have two days a week I just can't stand being at a job I love.",
   "created_utc": 1693802431,
   "score": 52,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0s9y1",
   "message": "Paying for porn",
   "created_utc": 1693784655,
   "score": 43,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2aob3",
   "message": "I went to meet up with an older guy when I was about 19 and he was in his early 40’s, he owned a nearby business so we met in the back and he blew me at like 3 in the morning\n\nCut to 5 minutes in and I feel this weird warmth, dude somehow bit his tongue or something and was bleeding all over his mouth and my dick. I have no idea how he didn’t notice or why he just continued, I pushed him off and cleaned up real quick to leave in the bathroom, he met me outside, gave me $100, and I never heard from him again (for clarity, I don’t do sex work and there was no indication, I was just young and horny)",
   "created_utc": 1693811213,
   "score": 12,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz24wk0",
   "message": "Did it with a girl i just met that week, without protection, and busted in the hooha. Not worth it. Nothing bad came out of it other than a \"just to be safe\" visit to check for stds after i found out about her \"reputation\", but that could've been the end for my life. That couple hours of fun wasn't even worth the paranoia i felt for the following weeks as i waited for her cycle, not to mention if she would've ended up preggo, or if she gave me an std. \n\nDont be silly, wrap yo willy!",
   "created_utc": 1693807554,
   "score": 27,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2a0rz",
   "message": "Fucking my close friend.  Post nut clarity is real.",
   "created_utc": 1693810799,
   "score": 9,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1o4ka",
   "message": "Fucked my then bf in a park. Tbf it was 1 am but even still I cringe.",
   "created_utc": 1693798475,
   "score": 19,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1v9f9",
   "message": "Got out of a dead-end long-term relationship. Called up Crazy for a rebound. Popped a good ol’ “I love you” during the deed out of habit. Got stalked for YEARS by Crazy. Never again.",
   "created_utc": 1693802087,
   "score": 17,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2sj44",
   "message": "Creampied the neighbor",
   "created_utc": 1693823378,
   "score": 9,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1g8zy",
   "message": "Jerked off in the parking lot of a Marshall’s",
   "created_utc": 1693794857,
   "score": 17,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1l6q4",
   "message": "Let my husband give me a facial whilst wearing lash extensions. Never again.",
   "created_utc": 1693797077,
   "score": 9,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0ybvh",
   "message": "Masturbated",
   "created_utc": 1693787141,
   "score": 15,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz11hqg",
   "message": "I once had sex with my stepmom’s sister",
   "created_utc": 1693788430,
   "score": 23,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz11v0h",
   "message": "Continued tapping after already busting a nut",
   "created_utc": 1693788585,
   "score": 21,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1lh5z",
   "message": "A girl named Leslie.",
   "created_utc": 1693797214,
   "score": 7,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz19of7",
   "message": "Had a summer fling with the mother of a kid I went to HS while home from college. She was young for having a son that age and looked good. But it wasn't a cool move. But if was fun.",
   "created_utc": 1693791974,
   "score": 12,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1e1nl",
   "message": "Slept with someone who I probably would not have otherwise",
   "created_utc": 1693793878,
   "score": 5,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1yzh8",
   "message": "Got a happy ending massage.  Fastest cash id ever spent",
   "created_utc": 1693804134,
   "score": 7,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz2j50k",
   "message": "You ever used Vick's menthol rub when you're sick?  \n\nWell, imagine that but on your dick...",
   "created_utc": 1693816844,
   "score": 6,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0xxtw",
   "message": "Jacked off to my crushes pfp of her in a bikini, felt like a creep and pedo, that post nut clarity was soul crushing",
   "created_utc": 1693786978,
   "score": 46,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz0z3j9",
   "message": "Shampoo…😣",
   "created_utc": 1693787447,
   "score": 16,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1zegf",
   "message": "I told my house help she had nice boobs",
   "created_utc": 1693804369,
   "score": 5,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1vade",
   "message": "Fucked my husband's (he had a very low sex drive when it happened because of work stress) employee, got pregnant and had to have an abortion behind his back. It was a terrible idea and now this relationship is dead.",
   "created_utc": 1693802102,
   "score": 28,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1gian",
   "message": "Smashing my cousins girlfriend ..we live In The same house.  What do I do...........",
   "created_utc": 1693794970,
   "score": 18,
   "submission_id": "1696476"
  },
  {
   "comment_id": "jz1zmzn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1696476"
  }
 ]
}