{
 "submission_id": "1698xvy",
 "title": "Ask Straight guys, how would you feel if a gay male stranger suddenly told you, \"You are hot AF\"?",
 "selftext": "",
 "created_utc": 1693776595,
 "permalink": "/r/AskReddit/comments/1698xvy/ask_straight_guys_how_would_you_feel_if_a_gay/",
 "score": 224,
 "url": "https://www.reddit.com/r/AskReddit/comments/1698xvy/ask_straight_guys_how_would_you_feel_if_a_gay/",
 "comments": [
  {
   "comment_id": "jz0m9wi",
   "message": "I'm just gonna quote a meme I saw about this.\n\n\"As a straight guy, getting hit on by a gay dude is like receiving a ton of money in the wrong currency. \n\nI can't do anything with it right now, but if I ever cross the border, I'll be one lucky guy.\"\n\nSeriously though, it'd be very flattering, even if I can't reciprocate the feeling.",
   "created_utc": 1693782149,
   "score": 162,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0cb27",
   "message": "I would turn to my girlfriend and say\nI told you so",
   "created_utc": 1693778083,
   "score": 119,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0d6ue",
   "message": "I'd give him my optometrist's business card.",
   "created_utc": 1693778436,
   "score": 76,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0cz8i",
   "message": "Remember what I’m wearing and wear that exact outfit everytime I head out",
   "created_utc": 1693778349,
   "score": 237,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz08mv2",
   "message": "I'd be very flattered",
   "created_utc": 1693776668,
   "score": 35,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz09236",
   "message": "i would be flattered and awkwardly thank them",
   "created_utc": 1693776827,
   "score": 161,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0dnp5",
   "message": "I got cat called a few days ago walking by a construction site I'm a 33 year old male. Made my day lol",
   "created_utc": 1693778624,
   "score": 66,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0afpo",
   "message": "I’d take the compliment. No harm done. \n\nProbably suck his cock too.",
   "created_utc": 1693777353,
   "score": 155,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0dymv",
   "message": "I'm a straight man,  I get that alot from some gay men and my reaction is the same as when a women comments my looks, I say thank you and smile, I even had a dance off one time with a gay man and his boyfriend got jealous so I had to hug him and tell him I'm not gay he just has cool moves lol.",
   "created_utc": 1693778745,
   "score": 189,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0gy4d",
   "message": "Apparently I am a desirable bear man so I get hit on from time to time.  It is flattering.  I wish women were equally attracted.",
   "created_utc": 1693779945,
   "score": 62,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0gdxn",
   "message": "That's a bit aggressive from any stranger for me. But in more realistic terms, I was once living in a small rural conservative town in the middle of nowhere and the guy running the butcher counter at the grocery store would flirt with me and told me I had beautiful eyes. I was very flattered and went home and told my wife that I was hot shit.",
   "created_utc": 1693779719,
   "score": 50,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0bdvc",
   "message": "I’d take it as a compliment. Gay guys can be hella picky 😂",
   "created_utc": 1693777722,
   "score": 84,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz090jr",
   "message": "Take the compliment. If someone says anything nice about you it’s a good thing and should be embraced as such.",
   "created_utc": 1693776811,
   "score": 42,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz09yzs",
   "message": "I would say thanks just as if a woman said it. No biggie.",
   "created_utc": 1693777172,
   "score": 77,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz09kud",
   "message": "thanx, bro",
   "created_utc": 1693777020,
   "score": 31,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0b1fu",
   "message": "This happened to me. I was very flattered - and bummed I had to tell him I was straight.",
   "created_utc": 1693777584,
   "score": 20,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0kwfl",
   "message": "To quote Gabriel Iglesias, I would tell my girlfriend (if I had one), “you better not mess up. I have options!”",
   "created_utc": 1693781577,
   "score": 20,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0o5mg",
   "message": "Not really expecting it, probably say “Thanks, you too.” Before realizing what I said.",
   "created_utc": 1693782929,
   "score": 19,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz09smr",
   "message": "Nope. I'd appreciate the compliment like I would from anyone else.",
   "created_utc": 1693777103,
   "score": 18,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0h05h",
   "message": "ego boost baby",
   "created_utc": 1693779968,
   "score": 19,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0y7wp",
   "message": "I used to get hit on by gay guys a lot when I was a bartender. I was in pretty good shape but not model handsome and I certainly didn’t receive the same kind of attention from women. I asked one of my gay friends if I put out a gay vibe and he told me, “It’s not just that you’re attractive or that you seem gay. You make them feel safe enough to hit on you.”\n\nStill to this day one of my favorite compliments.",
   "created_utc": 1693787093,
   "score": 19,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0kiu9",
   "message": "As a straight man.  I'd be honored and would blush. \nCompliments are compliments",
   "created_utc": 1693781419,
   "score": 14,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0lvym",
   "message": "As a gay guy with a couple long term straight friends I’ve found they’ve always taken my compliments (completely platonic) the right way and have at times seemed a bit honoured I’d gone out my way to notice.",
   "created_utc": 1693781987,
   "score": 14,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0lzcr",
   "message": "I’d say, “I may look hot, but I’m only 98.6F on the inside. Do you want to feel?”",
   "created_utc": 1693782027,
   "score": 26,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0ffql",
   "message": "surprised and complimented. that happened maybe 3 or 4 times when i lived in Chicago and San Francisco—apparently i have a cute butt—and they never took it badly when i politely explained that i swing the other way. and none of them ever treated me the way guys treat women they’re hitting on. in fact, i’d rather hang out with gay men than straight men because i don’t have to deal with heteronormative macho bullshit. the surprise would be because i’m 66 years old and not exactly a prime specimen. so i reckon i’d feel even more complimented.",
   "created_utc": 1693779336,
   "score": 11,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0i41v",
   "message": "Take it as a compliment and keep moving",
   "created_utc": 1693780426,
   "score": 9,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0k26e",
   "message": "If I got hit on by women half as much as I get hit on by gay men I'd be so full of myself my head wouldn't fit through doorways.",
   "created_utc": 1693781225,
   "score": 10,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0nyu0",
   "message": "First time I went to a gay bar (with my ex-gf) that happened. They knew I was straight and just wanted me to know that I was pretty hot to them, but they were very respectful of boundaries beyond that. One of my best bar experiences ever.",
   "created_utc": 1693782852,
   "score": 10,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0tiuw",
   "message": "As a 400+ pound man I’d be flattered but seriously concerned about their eyesight",
   "created_utc": 1693785173,
   "score": 17,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0jw21",
   "message": "Thanks my dude. But you’re barking up the wrong tree. Happy hunting. I hope you get it in.",
   "created_utc": 1693781156,
   "score": 9,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0apm8",
   "message": "It’s happened.  And I take it as a compliment.",
   "created_utc": 1693777460,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0jwqq",
   "message": "I apparently have a type. I get hit on by short muscular tatted/pierced guys all the time. And they all wear way too much axe and drive ricers or pickups without a speck of dust on um.",
   "created_utc": 1693781164,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0m1b8",
   "message": "\"You seriously need glasses\".",
   "created_utc": 1693782049,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0m621",
   "message": "Flattered, but also weird. Not because a gay say to me, but because no one ever say that to me. So that an stranger suddenly say that would make me feel weirded out",
   "created_utc": 1693782105,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0nuzp",
   "message": "That ain’t gonna happen.  \n\nNOBODY finds me attractive.",
   "created_utc": 1693782807,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0p6xg",
   "message": "Damn, I'm hot AF!",
   "created_utc": 1693783363,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0g1xd",
   "message": "Happened to me before but unfortunately he wouldn't leave me alone even after I told him I was straight. Now I know how women feel.",
   "created_utc": 1693779583,
   "score": 15,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0k4si",
   "message": "As long as it ain’t going anywhere, I’d be really stoked. \n\nSeriously. The gay man is attracted to - **maleness!** The compliment would be extremely affirmative.",
   "created_utc": 1693781255,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0l1fe",
   "message": "This happened to my brother once, back in his hot, young days. He said back to the guy, “Thanks, but you couldn’t handle me.” LOL",
   "created_utc": 1693781636,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0mbl8",
   "message": "I have had this happen several times. The only women who seem to find me attractive have been in relationships with me (maybe I'm easy?).\n\nI am flattered, and then when I find out it's not the sex I'm interested in, slightly disappointed.",
   "created_utc": 1693782167,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0mcu5",
   "message": "Have had it happen a few times in my life. I’ll tell you like I told them, I’m flattered, but I’m straight. We had a good laugh and we both went on about our days.",
   "created_utc": 1693782183,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0o5lx",
   "message": "I'll take what I can get.",
   "created_utc": 1693782929,
   "score": 4,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0og2q",
   "message": "Flattered. Confident. Sexy. Complimented.",
   "created_utc": 1693783048,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0qyc6",
   "message": "I would be flattered. Just cause I’m straight it doesn’t have to mean I don’t like the compliment. I’d just be glad someone found me attractive.",
   "created_utc": 1693784098,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0s3r2",
   "message": "I’d be suspicious. I’m old and overweight. Even when I was young and skinny I wasn’t “hot AF”. I’d expect that someone was attempting to scam me in some way.",
   "created_utc": 1693784582,
   "score": 6,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0ut04",
   "message": "It depends on how they're going about it. At one point, I lived in a section of a city with a fairly significant LGBT population. I was complimented by gay strangers every now and then.\n\nIf it was just a compliment in a normal or even somewhat normal tone, it was a nice pick-me-up and I walked a little taller for the day. That was the case most of the time.\n\nThere were a couple times where the comment was much more sensual or sultry, and I was uncomfortable.",
   "created_utc": 1693785707,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0w6p9",
   "message": "I personally think most men would love to be complimented buy anyone. Getting told you look ugly by a gay guy really hurts the soul.",
   "created_utc": 1693786263,
   "score": 4,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0xxbl",
   "message": "I got told im ugly by a gay guy, we both laughed",
   "created_utc": 1693786972,
   "score": 4,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0bea1",
   "message": "It would make me very uncomfortable. \n\nOne time, a noticeably gay man stopped right in front of me, tipped down his sunglasses, and looked me up and down. I pretended not to notice and kept walking. That made me uncomfortable.\n\nAnother time, a less noticeably gay man, whom I've never seen or spoken to beforehand,  asked me straight up, \"Would you like a blowjob?\" All I said was \"no,\" and I turned around and walked the other way. That one made me flustered and upset. \n\nLadies, I feel for you and all the times you're aggressively hit-on by strangers.",
   "created_utc": 1693777726,
   "score": 32,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0qtzz",
   "message": "I would let him give me a BJ",
   "created_utc": 1693784049,
   "score": 10,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0npl0",
   "message": "Kind of happen, a few friends like going to a local gay bar to dance, went why? Don’t know? Played some pool, as I was taking my shot some queen came up and slapped my ass, said I had a hot ass. Nope not having it, walked out and went away. \nThe friends wonder why I left later, explained what happened, they said I should have taken it as a compliment. It wasn’t the compliment it was the slap. Honestly I hate dance club, not my scene, not a big fan of bars in general. I was uncomfortable to say the least.",
   "created_utc": 1693782746,
   "score": 4,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0tidn",
   "message": "I’d say thanks bud. You’re not so bad yourself.",
   "created_utc": 1693785168,
   "score": 4,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0ufin",
   "message": "A gay man twice my age was too handsy with me at a family gathering. Not all related to me as it was friends, family (including extended), and some work associates of the host. At first he would tell me I’m very handsome, I’m well dressed, and loads of other compliments. I told him I was flattered and that he looked nice too. He then outright said “I want to fuck you” to which I politely declined and informed him that I’m straight and uninterested. I attempted to distance myself from him throughout the entire night and he became more and more forward, eventually grabbing me by force and trying to kiss me on the face, hugging me and not letting go, etc. He never touched me below the belt, but it was still very uncomfortable and despite me asking him not to, he continued to do it and asked me to go home with him several times.\n\nGetting complimented by another man, straight or not is fine. Most men don’t receive any compliments or attention. But when a line is drawn and crossed, it becomes extremely uncomfortable. When I told other people, they simply said “oh that’s just how he is” but I feel like if it was a man doing this to a woman, someone would’ve said something to him.\n\nI saw him again at another gathering months later where he did the same thing except he’d throw in the occasional “I respect you, and I’m not trying to sleep with you”, and would then be handsy with me and tell me he wants me to fuck him. \n\nOverall? Hated it. Extremely uncomfortable and I have no plans of going to any gatherings or events where he may be present. If I show up to one and I see him, I’m leaving. If he simply complimented me and stopped trying to pursue me after setting that boundary, I would have had no problem with it at all. In fact, I’d be very flattered",
   "created_utc": 1693785548,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz18keu",
   "message": "I would be very concerned about that guy’s eyesight. Poor fella.",
   "created_utc": 1693791487,
   "score": 1,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz08oob",
   "message": "Prolly feel just as embarrassed and awkward as if a woman did it.",
   "created_utc": 1693776686,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0aqen",
   "message": "Flattered.",
   "created_utc": 1693777469,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0dpzw",
   "message": "I'd be quite happy, at least someone like me!",
   "created_utc": 1693778649,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0e44a",
   "message": "A compliment is a compliment and I would say thanks.",
   "created_utc": 1693778803,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0fdny",
   "message": "Pretty goddamn validated",
   "created_utc": 1693779313,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0feqz",
   "message": "Flattered as hell",
   "created_utc": 1693779325,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0fwu2",
   "message": "I would thank him for the compliment. If he wished to take things further I would just tell him that I'm very flattered but that I'm straight. Usually this is followed by, 'Pity' and the person leaving, and everyone is more or less happy.",
   "created_utc": 1693779526,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0hv5m",
   "message": "It would make my day. I don’t remember the last time I received an unsolicited compliment about my appearance.",
   "created_utc": 1693780325,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0m0zo",
   "message": "This guy needs glasses. or has a thing for old, fat guys",
   "created_utc": 1693782045,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0m7rs",
   "message": "Honestly it's happened (not those exact words), puts a bounce in my step for the rest of the week.",
   "created_utc": 1693782126,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0n7nx",
   "message": "At this stage of my life…I’d be happy to hear that from anyone.",
   "created_utc": 1693782537,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0olhy",
   "message": "Complimented AF",
   "created_utc": 1693783114,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0ooyy",
   "message": "That would make my day",
   "created_utc": 1693783154,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0oozd",
   "message": "Confidence booster for sure",
   "created_utc": 1693783154,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0xgrs",
   "message": "Flattered, but a bit uncomfortable. Hypotheticals like this makes you appreciate what women sometimes have to go through.",
   "created_utc": 1693786786,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0yy95",
   "message": "NGL, it's expected, yet still flattering, but I let them know that I'm not interested. I think it's fuckin' cool, honestly.\n\nBack when I had long hair and more of a bubble butt, dude's would catcall me thinking I was a chick all the time, and I can't tell you how many of them wanted to fight as soon as they realized that I was a dude. It was always hilarious when it was in front of another male friend and they'd get violent, and I could say they wanted to fight me because they really wanted to fuck me. 😂",
   "created_utc": 1693787387,
   "score": 3,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz09fv0",
   "message": "A compliment is a compliment, I’ll very happily take one.\n\nHowever, a gay male stranger did once notice me and shouted out something before running back into the pub he was smoking outside of. He’d gone back in to get his phone and ran down the street to then demand that I take his number",
   "created_utc": 1693776968,
   "score": 5,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0elv3",
   "message": "I would thank them",
   "created_utc": 1693779002,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0et63",
   "message": "I'd love that. \n\nThen the doubt would set it, and I would not believe him.",
   "created_utc": 1693779083,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0fbf8",
   "message": "chuckle because I'm not anymore",
   "created_utc": 1693779288,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0g8gp",
   "message": "Honestly I’d be flattered, maybe blush.",
   "created_utc": 1693779658,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0h561",
   "message": "Thank you.",
   "created_utc": 1693780025,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0hlet",
   "message": "I’d be feelin’ good",
   "created_utc": 1693780212,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0hxb7",
   "message": "I've never been given a compliment. So meh don't know how I'd go.",
   "created_utc": 1693780350,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0jfj6",
   "message": "Honestly, flattered. Someone who is attracted to man thinks I am an attractive man. Plain and simple. \n\nIt's like some dudes think a gay guy saying they look good makes *them* gay. It's hilariously insecure and makes zero sense.",
   "created_utc": 1693780969,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0ki9v",
   "message": "No different then If a female said the same thing, why do you assume it would be different?",
   "created_utc": 1693781412,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0lxi8",
   "message": "Say thanks",
   "created_utc": 1693782006,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0mb4g",
   "message": "Flattered.",
   "created_utc": 1693782162,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0msdd",
   "message": "I'd see if I could upsell to NSA bj .",
   "created_utc": 1693782360,
   "score": 2,
   "submission_id": "1698xvy"
  },
  {
   "comment_id": "jz0njni",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1698xvy"
  }
 ]
}