{
 "submission_id": "169gdy0",
 "title": "Guys who lost a significant amount of weight (50+ lbs) how did you do it?",
 "selftext": "",
 "created_utc": 1693796779,
 "permalink": "/r/AskReddit/comments/169gdy0/guys_who_lost_a_significant_amount_of_weight_50/",
 "score": 106,
 "url": "https://www.reddit.com/r/AskReddit/comments/169gdy0/guys_who_lost_a_significant_amount_of_weight_50/",
 "comments": [
  {
   "comment_id": "jz1kp0h",
   "message": "Counting calories \u0026amp; working out a few times a week\n\nEdit: worth flagging that calorie counting is definitely the more important piece here. For me, the best benefit of working out / exercise was helping me stay disciplined with my diet. I was way less inclined to cheat on my diet after getting my ass kicked in a HIIT workout or a long walk. Also want to note it took me close to 2 years to lose the weight and keep it off, and that’s not including failed attempts. I eat right 85% of the time and for that other 15% I eat my favorite foods but my only rule is no binge eating. I’ve tried the 100% no cheat meals crash diet before and gained all the weight back I lost and then some after caving",
   "created_utc": 1693796845,
   "score": 76,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1lwcz",
   "message": "Stopped drinking",
   "created_utc": 1693797413,
   "score": 205,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1tsvk",
   "message": "Went from 310 to 205 by completely cutting out fast food, switching to diet soda and hitting the elliptical machine Friday, Saturday and Sunday for 30 minutes. \n\nIt took a couple years but here I am!",
   "created_utc": 1693801314,
   "score": 15,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz22jz9",
   "message": "Quit drinking alcohol and soda, I really only drink water with lemon now..quit eating out, only cook my own food, alot of chicken vegetables, nothing fried.. and hit the gym multiple times a week... Went from around 250 down to 174 now.",
   "created_utc": 1693806152,
   "score": 203,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1ytxc",
   "message": "I lost 65 lbs.  I fast walk 3 miles every day (about 40 minutes)  I eat fish and chicken breast only, (no red meat),  rice and pasta, and lots of veggies and all the fruit I want.   I cook almost all of my meals myself.  I cut out alcohol completely, no beer or wine, but I love beer so I drink one non-alcohol beer a day. Also, no sodas or soft drinks.  I started in 1988.  I'm 6 feet tall and my weight  has been stable at 190 for years.   I'm 77 years old and other than a few aches and pains in the morning I feel  a hell of a lot better than when I was 40, drinking every day and  265 lbs.",
   "created_utc": 1693804042,
   "score": 109,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1mqxu",
   "message": "Intermittent fasting. I lost 54 lbs in 6 months only eating in an 8 hr window per day",
   "created_utc": 1693797809,
   "score": 60,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1nyk7",
   "message": "Lost 140. It started with education and calorie tracking. I had to learn what calories were in foods. Then set a daily calorie goal. \n\nAdded walking which then started to include jogging. Had to stop jogging due to knee issues so I switched to cycling. \n\nStarted strength training after I dropped the weight. \n\nThe big takeaway is that it was/is a lifestyle change.  6 years later I am still tracking calories and exercising.",
   "created_utc": 1693798394,
   "score": 35,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1kqob",
   "message": "Ate less; Shat more",
   "created_utc": 1693796866,
   "score": 182,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1ogyl",
   "message": "I lost 40, which is close. \n\nI got a combination of the flu and pneumonia at the same time I was recovering from a gum graft, which forced me to have a liquid diet. \n\nI do not recommend this method for weight loss.",
   "created_utc": 1693798640,
   "score": 247,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1tkj1",
   "message": "500 calorie deficit daily eating almost exclusively pizza. I call it the \"pizza diet\". The original point was to show my co workers that all their fad diets were dumb and you could just be at a deficit to lose weight. Now I sort of love it and have been going strong. That being said, don't do a diet to make a point. Suddenly, their original claim that it \"wouldn't work\" has changed to \"its healthier to be fat than to eat pizza all the time\" which I personally also disagree with.",
   "created_utc": 1693801190,
   "score": 208,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1wbl8",
   "message": "My husband says  intermittent fast and pickleball! Lost 70lbs so far",
   "created_utc": 1693802656,
   "score": 38,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1l4wi",
   "message": "OMAD, tons of water, no sugar, lots of cardio.",
   "created_utc": 1693797054,
   "score": 145,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1ks02",
   "message": "A balanced diet and intermittent fasting",
   "created_utc": 1693796884,
   "score": 103,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1s7x3",
   "message": "Getting at least 15,000 steps per day. Cutting out sugar. That did it.",
   "created_utc": 1693800487,
   "score": 119,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1v1pb",
   "message": "Eat less, exercise more.",
   "created_utc": 1693801973,
   "score": 118,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1kl1z",
   "message": "By breaking up with my ex-girlfriend. She was so heavy, she was weighing me down!",
   "created_utc": 1693796794,
   "score": 175,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1lbgr",
   "message": "Exercice 20 minutes of cardio/sweat\nMorefiber, less Sugar .\nMore Bean like chili or Chickpea less rice less pasta.\n\nLess sweet more sweat",
   "created_utc": 1693797139,
   "score": 62,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1vl66",
   "message": "I got myself hooked on adderall by accident.",
   "created_utc": 1693802260,
   "score": 55,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1mdyc",
   "message": "CICO diet, calorie counting using an app (FatSecret). I lost over 60 pounds.",
   "created_utc": 1693797639,
   "score": 32,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1uux3",
   "message": "Lost 30 pounds since April, made significant cuts to my drinking and stopped eating like shit while increasing my physical activity. There's no secret...calories in vs calories out.",
   "created_utc": 1693801873,
   "score": 14,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1rkn0",
   "message": "Better food choices, less portions, lots of exercise.",
   "created_utc": 1693800162,
   "score": 14,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz28gqu",
   "message": "\u0026amp;#x200B;\n\nI will tell you this, most diets work.\n\nSome diets might  be bad for you nutritionally.\n\nSome diets might be dangerous and stupid.\n\nBut weight loss has a very low bar for quality that the most diets work.\n\nAs long as you can follow your like around 2000 calories: most diets work.\n\nI've seen it all before the \"coca cola diet\" guy, the \"water only for a month\" diet guy who got flamed on the internet, the diet will work as much as placing fire burns on kerosene. \n\nAfter that cardio cardio cardio. Lots of people will sell all kinds of exercises and all kinds of diets.\n\nYou're probably not an athlete, you're probably not a model or some kind of bodybuilder\n\nso you don't need to focus too much on aesthetics or at all, you can always do this later when you have a less dangerous weight range.\n\nIf you just focus on cardio you cut out the middle man,\n\nyou no longer need a trainer or a even a gym (although i did cardio at the gym on late nights across the road).\n\nI'm not saying you need to cut out the middle man but you CAN do so and it has advantages.\n\nYou can go for walks anytime of the day and it is free.\n\nYou don't have to learn anything or risk injury or spend much money.\n\nThe only thing with walking is that you need volume rather than quality, lots of hours.\n\nIf you walk 2km an hour then you might be walking 15 hours a week to cover 30km.\n\nMe i can do 30km in 3 to 4 hours a week for fun.\n\nWalk before you can run. Programs try to skip walking or things on the same level as walking perhaps to have a more professional looking approach.\n\nAt a certain point in the journey running and all the fancy exercises made sense for me and it was much easier that's when i looked towards training my core a little more and etc which actually helped me progress into running.\n\nIt was so easy to progress running after i reached a certain weight range after that sure ditch cardio.\n\nBut you can entirely do cardio the whole way around. You just need to be in a healthy weight range and have a diet where if you get a blood test the doctor will be happy.\n\nWith high volume cardio and a diet around your BMR or 2000 calories and no breaks you will lose weight it is just a matter of time. It's like using your phone all day and not charging it, it's just physics the energy has to come from somewhere. \n\n\u0026amp;#x200B;\n\nToo much focus is placed on avoiding the feeling of hunger.\n\nIt's ok that you are hungry but it's bad that you are nutritionally lacking.\n\nYour stomach stretches to incredible proportions as well as your appetite.\n\nIf you have been overeating for an extended amount of time your stomach and appetite will likely be enlarged so even if you are in a nutritionally adequate and stable diet  you will feel hungry regardless.\n\nThe hunger fades through out the day.\n\nAnd i will argue that as long as your nutrition is on point. The hunger is your friend.\n\nAs much as the stomach and appetite can stretch it is also scary how much it can contract!\n\nNo one talks about this but the appetite can fall to dangerous proportions.\n\nI was running 30-50km+ a week for fun. I probably spent half the time running than some people spent at the gym.  But i never changed my diet, i wasn't hungry. I tried eating more calories but didn't increase enough so i reach a point where i need to really be careful as i was losing too much weight with my diet and activity level. It's actually surprisingly challenging to gain weight in some situations if you would believe.\n\nThe hunger tells you that your are moving towards a lower appetite.\n\nThe thing i want to get out of this is that hunger fades,\n\n it fades through out the day, and through out the weeks \n\nand when it was fades it can take your appetite to lower levels where weightloss is intuitive and you actually have to be careful. But yeah hunger can be your friend.\n\n\u0026amp;#x200B;\n\nLastly is know what weight loss feels like.\n\nWe just talked about hunger and how it fades in extreme ways.\n\nWell stemming from that that you really need to understand what it feels like to lose weight as it could be a new feeling that you might not understand and that you might misunderstand. \n\nYou can't just try and avoid the inconvenient part.\n\nI kinda like to compare this to the first Spiderman movie when Peter was transforming into his power. He just felt horrible as if he were sick, then he woke up and and he had 20/20 vision and a six pack.\n\nIf your body is going to contract to twice or even one-third of its current size you will likely feel it at some point. And if you are not feeling it there is a chance that you are not moving towards your goal.\n\nIf you try to learn a new language i guarantee you it can be unpleasant trying to remember and memorize such a large amount of information that are so new to you.\n\nBut eventually you remember things very easily. A math topic might be hard  when you were a kid but it would be laughable to struggle on the same question today. It would be hard to imagine how some people might struggle with it.\n\nThe discomfort is a sign that something is happening rather than nothing. And the discomfort much like hunger fades.",
   "created_utc": 1693809794,
   "score": 42,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1vr31",
   "message": "Counting calories and cycling. I don't count calories anymore but I cycle 150 to 250 miles per week",
   "created_utc": 1693802348,
   "score": 34,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1y2yg",
   "message": "I got cheated on.",
   "created_utc": 1693803623,
   "score": 20,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz20xpu",
   "message": "Stopped drinking half gallons of Crown Royal every 2 days",
   "created_utc": 1693805216,
   "score": 28,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1m9fg",
   "message": "Fasting.",
   "created_utc": 1693797585,
   "score": 20,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz26wfg",
   "message": "Ozempic, but then started counting calories,  focusing on protein intake and hitting the gym regularly.",
   "created_utc": 1693808788,
   "score": 21,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1omyb",
   "message": "I exercised more, ate more vegetables and lean meats with less beef/pork, and made meals with smaller portions.\n\nI also drink a shitload of water every day.",
   "created_utc": 1693798722,
   "score": 12,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1q308",
   "message": "Complete lifestyle change. Doing a \"diet\" doesn't work. Hardest part of losing weight is keeping it off. \n\nI used to be relatively active, was in the soccer team in my highschool and actually was able to keep up with the team on sprints and could even run a mile under 10 minutes weighing 300lbs. \nMy problem was that I'd drink Gatorade like I was an actual athlete. Juices and sweet teas. My eating habits were terrible too. \"I dont eat that much, I only eat once or twice a day\" yeah that was my issue. My first meal was at lunch in highschool and then I'd eat after school. Fairly big meals, nothing too crazy but My body would go into \"hibernation\" mode so anything and everything I'd eat, I'd store it. \n\nSo what changed? \nWater only. \nI'd actually eat breakfast within an hour of waking up, then I would eat every 2 hours after that and I'd eat 6 times a days only.. \nBreakfast - snack - lunch - snack - dinner - snack. \nAs for exercise I did a lot of HIIT cardio. Long distance running doesn't help much when trying to lose weight, short high intensity is better. This sped up my metabolism like crazy. I incorporated weight lifting once I lost 80lbs and my final products was 150lbs lost. Went from 300+lbs to 172lbs in about 2 to 3 years. Maintained it for a good 2 years until covid lockdowns fucked me up. Gained 60lbs during them once I got tired and bored of running 7 miles every 2 days.",
   "created_utc": 1693799426,
   "score": 25,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1ulz9",
   "message": "High protein/low carb OMAD",
   "created_utc": 1693801739,
   "score": 12,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1mot5",
   "message": "Undiagnosed type 1 diabetes will do it fast asf",
   "created_utc": 1693797781,
   "score": 6,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1sxbd",
   "message": "I lost 100 lbs between my junior and senior years of college (11 years ago) I only ate like 1000 calories a day and ran a mile or two a night. That was it. Having the time to nap all day in colleges helped so I didn’t snack a lot lol",
   "created_utc": 1693800850,
   "score": 15,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1u6m1",
   "message": "Stop eating before bed, intermittent fasting, working out of whichever form, cutting out foods, believing in yourself.\n\nNo, you don’t have to start all things at the same time, focus on one thing and maintain it for 4 weeks, then add when you are curious and excited or want too.. it will all build together ever so nicely. It won’t happen overnight, over a month, but I promise you will feel it in a week, see it in 3 months, enjoy the process…",
   "created_utc": 1693801513,
   "score": 6,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1wdod",
   "message": "A boring way. \nMore calories burned than calories ingested. \n\nEssentially … \n- stopped drinking alcohol which meant less calories and  I also didn’t get evening cravings for food. \n- tracked what I was eating using a calorie app\n- started walking and then doing CrossFit (calories burned).",
   "created_utc": 1693802686,
   "score": 11,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1nb43",
   "message": "Tracking food, setting physical goals marathon, tough mudder etc. the hard part is maintaining after all of the “you look great” comments stop and the general satisfaction of seeing progress on a scale. I would say for long term success toss the scale and make sure to lift weights in your routine.",
   "created_utc": 1693798076,
   "score": 17,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1uaue",
   "message": "Didn’t lose 50+, but I did lose 45 over a year by taking a 1 hour walk every day. Didn’t change my diet, but the extra calories burned did enough.",
   "created_utc": 1693801574,
   "score": 19,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1uyxc",
   "message": "I lost about 25kg in a bit over 6 months. This was 5 years ago. There is no real secret. It’s exactly how you’d think I did it. I exercised a lot, and ate less. \n\nI didn’t eat nothing. Just less. Enough so that I had plenty of energy but that I would feel hungry at points during the day. I didn’t track calories or macros or whatever. \n\nAs for exercise. I did circuit classes 2-3 times a week, and ran twice a week. I did the circuit classes cause I had friends doing it. I ran because it stripped the weight off of me. \n\n- - - -\n\nSo if you are asking for advice for how to lose weight. Eat less food, but make sure it is nutritious. Find exercises that you want to do. You might have to try a lot of different exercises to find the one that you like.\n\nAll that exercise takes a lot of time. Probably eight hours a week by the time you include going to/from the gym etc. One of the hardest parts is finding the equivalent of an extra full work day a week.",
   "created_utc": 1693801932,
   "score": 6,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1ws05",
   "message": "Down 250. Clean, low carb (not keto) eating. 2 large meals a day in an 8 hour window. Lots of walking.",
   "created_utc": 1693802900,
   "score": 11,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz28h07",
   "message": "Got divorced. \n\nEdit: badum tsssssh",
   "created_utc": 1693809799,
   "score": 12,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1psm9",
   "message": "More veggies, less dairy, lean proteins, smaller portions and lucky enough to live near a national park where I ride my bike 14+ miles 6x a week. Lost over 60 lbs!",
   "created_utc": 1693799289,
   "score": 3,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1vvl0",
   "message": "Lost 35kg (~77lbs) this year, starting from mid january. I stopped eating cady and meat. I tried to eat less food every day.  \nI also started cycling which is the best sport (for me at least) to lose weight.",
   "created_utc": 1693802415,
   "score": 3,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1wu84",
   "message": "Used to be 300+lbs , now I'm sub 220 and steadily keep going lower and lower.  \n\n1) No Junk food. No artificial sugars \n2) Limit your portions (at first it's extremely hard but as soon as your stomach size decreases it will come to you naturally ( periodically do PROPER fasting breaks with proper preparation and steady return  ) \n3) stay active , do sports. Focus on traveling on foot more , it truly helps \n4) If you need that extra kick that helped me alot - get production and not hourly paid physical job. Helped me drastically to drop first 50 pounds as more you work more you earn\n5) Dont give up and be consistent. At one point your results will slow down and you will feel like you make no progress as our bodies are smart and complicated and they don't like to stick to new sets of rules so your body will start playing games to keep the mass\n6) Make sure to find people who support your goal and can compliment you to push even harder. \n7) Take progress pictures, you won't regret it",
   "created_utc": 1693802933,
   "score": 6,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1x0rb",
   "message": "My fitness pal app..  and working out regularly with Power90.  What you eat will contribute to about 90% of your weight loss.  Working out will just help boost it along and make you fitter.",
   "created_utc": 1693803027,
   "score": 7,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1ydpu",
   "message": "Ate better and moved more.  My ~60 pounds was spread over a few years, but I lost the biggest chunk of it, ~25 pounds in a summer, when I started walking everywhere plus doing a couple HIIT sessions a week.  My HIIT workouts consisted of me going for really long walks, and about five times during the walk I'd sprint as fast as I could for about thirty seconds.  I'm not gonna say whether that's strictly better or worse than longer distance jogging or other types of cardio, but it worked for me at the time.",
   "created_utc": 1693803791,
   "score": 3,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz2cg0m",
   "message": "I've never lost 50+ lbs but I am slowly dropping weight to my desired amount currently. Some things I've found:\n\n-Eat breakfast, something light but full of protein and fibre I eat fruit with yoghurt and granola pretty much daily.\n-Drink a lot more water than you normally do, sometimes hunger pangs are actually just dehydration in disguise.\n-If you're hungry... Eat. Don't Starve yourself because your diet won't last very long, you'll give up very quickly. \n-you will fluctuate in weight, it can be demoralising but progress will be made if you keep up with it. \n-walk more, I can't stress this one enough, walk more steps, it's easy, it's not too intense and it adds up. \n-use a meal planner (one I've come across recently is eatthismuch.com, plug in your diet, your calorie goal and how many meals you want throughout the day, it'll come up with a plan)\n-A really big one that I never see come up, don't feel you have to stick religiously to all of these rules as hard and fast as possible, take the ones that work for you and incorporate into your daily routine, you're much more likely to stick to it. \n-The hardest part of exercising is getting outside to do it, once you're out of your house there's no reason not to do something. \n-Take a weekly photo of yourself (keep it in a safe folder if you want) so you can easily see the benefits and gains you're making over time (it can be really difficult to see your improvements daily, but weekly will show you how much you're progressing) \n- If you're eating less, you're going to be tired, at least for a little while, that's the hard part, eventually you will form healthy habits, unfortunately there's no shortcut on this one, you just have to put up with it. \n-cook more (probably the easiest thing on the list to do), reduce the size of your plate, you can always go back and eat more if you're still hungry, but you'll find that by having less on your plate you will probably start eating less anyway. \n- Have a realistic goal in mind 50+ lbs is a hell of a lot depending on your size, it's also going to be slow going, don't try losing too much too quickly. \n- Don't always be calorie counting, there will be times (such as social events) where you can let loose and treat yourself, don't restrict yourself to not having fun just to lose weight, just don't do it too much. \n\nThe first step is the hardest, it gets easier from there. You've identified a problem, you're looking at solving it, you're well on your way to the first step. Keep your head up and puff out your chest knowing that improvement will come, and that you're putting in the hard work now that will do nothing but benefit you in the future.",
   "created_utc": 1693812348,
   "score": 7,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz2yuy6",
   "message": "i lost 63 pounds over maybe 2 years and i have no idea why i should probably go to a doctor lmao",
   "created_utc": 1693827416,
   "score": 3,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz31c14",
   "message": "Got divorced .. instantly lost 120+ pounds",
   "created_utc": 1693828793,
   "score": 8,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1lbil",
   "message": "Meth",
   "created_utc": 1693797139,
   "score": 7,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1l5dw",
   "message": "Water is very important as well as a set regimen of workouts. Or just a good long walk.",
   "created_utc": 1693797060,
   "score": 6,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz216o7",
   "message": "Keto\nr/keto",
   "created_utc": 1693805354,
   "score": 10,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz24qa7",
   "message": "Lost 53lbs, going from 220 lbs to 167 lbs in a span of 6 months following a keto diet and going on a 5km walk 3 times a week",
   "created_utc": 1693807453,
   "score": 5,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz28ldn",
   "message": "I just fell in love and stopped eating",
   "created_utc": 1693809876,
   "score": 6,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1rd2z",
   "message": "Its literally always gunna come down to eating less than you burn. Theres calculators and shit online for this.",
   "created_utc": 1693800058,
   "score": 6,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1wwhp",
   "message": "I’m a big guy, so when I actually put my mind to it and work at it, I can lose weight pretty quick.  I lost about 70ish pounds over the course of 6 months.  The only thing I did was kept my daily intake of calories around 1500.  Some days it was over, some it was under.  \n\nFor me, eating the same thing daily is easy.  I wouldn’t really eat breakfast, but I would have the same thing for lunch and dinner, and since I have a sweet tooth, I always allowed myself some chocolate at the end of the night.\n\nYou just have to burn more calories than you take in.   It worked for me,  but once I got lazy with my counting, I put back on weight.  It’s not a diet, it’s a lifestyle change, it’s not always easy but it’s doable.",
   "created_utc": 1693802966,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1wygl",
   "message": "Did a shit ton of cardio, 2-3 hours for an entire week (this was during COVID) and cut down carbs and oily stuff in general\n\nWent from 92kgs 203lbs (92kg) to 154lbs (70kg) in about a year, currently back at about 176lbs (80kg) as I’ve started working out :)",
   "created_utc": 1693802994,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1x1v4",
   "message": "It was the day I grew tired of despising what I saw in the mirror, and not wanting to even be in photos. Finally my friend posted a photo of us together and I was just disgusted. I taped it to the fridge, and worked out every single day just doing cardio, all protein like grilled chicken and lots of water with green tea. I lost 80lbs and went back down to 160. I didn’t realize how much of my confidence came from my appearance until I had lost it. Did this in about 3-4 months. Another time was 30lbs in 2 months and that was pure salads, grilled chicken and steak. Small portion 3 times a day and a weigh in every Friday. Results are addicting",
   "created_utc": 1693803044,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1xl1d",
   "message": "Cocaine. After that started intermittent fasting to keep it off. Going to say I didn’t plan to start that way, was just a side effect of poor life choices",
   "created_utc": 1693803344,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1y661",
   "message": "I lost 30 lbs in about a month recently just due to stress. Would not recommend.\n\nWhat I would recommend is really paying attention to everything you put in your body and at what time. \nYou can completely change your body composition if you do this.",
   "created_utc": 1693803672,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz1yh13",
   "message": "I started by focusing just on fixing my diet. Calorie tracker, discipline. The hunger goes away and the habit builds until its the new normal.\n\nThere's no easy way to do it. It all comes down to learning to live, eating less.",
   "created_utc": 1693803842,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz21gk0",
   "message": "Ate exactly 2000 calories a day usually around the same time, avoided midnight snacking even if i felt hungry, ran 3-4 miles twice a week with my dogs and thats all i did really. I went from 215lbs to 158lbs and it took about 4 months",
   "created_utc": 1693805517,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz29gbq",
   "message": "Counting calories to make sure I'm in a deficit, gym 5 times a week, at least 10000 steps every day :)",
   "created_utc": 1693810434,
   "score": 2,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz29hqf",
   "message": "Trail running and calorie counting. Trail running is my absolute favorite because it tends to burn a lot more calories than road running, and it's way more interesting, which lessens the mental difficulty of running. I lost a lot a decade ago and have since put it back on after some surgeries and having kids, a full time job, etc, but I literally just started up again a week ago and I'm already getting addicted to trail running like I was years before. It's an exciting feeling! My biggest vice right now is soda. That's going to be the hardest thing, I think.",
   "created_utc": 1693810458,
   "score": 5,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz311sg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz3pcn9",
   "message": "I went vegan. Went from 240 to around 185-190.",
   "created_utc": 1693839665,
   "score": 9,
   "submission_id": "169gdy0"
  },
  {
   "comment_id": "jz2ejub",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "169gdy0"
  }
 ]
}