{
 "submission_id": "169nm64",
 "title": "What celebrity were you most surprised to find out was a jerk irl?",
 "selftext": "",
 "created_utc": 1693820445,
 "permalink": "/r/AskReddit/comments/169nm64/what_celebrity_were_you_most_surprised_to_find/",
 "score": 252,
 "url": "https://www.reddit.com/r/AskReddit/comments/169nm64/what_celebrity_were_you_most_surprised_to_find/",
 "comments": [
  {
   "comment_id": "jz2oy3b",
   "message": "Oprah/ Ellen",
   "created_utc": 1693820875,
   "score": 216,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2orjg",
   "message": "Bill Cosby?   I've seen a bit of dis on Phil McGraw too.",
   "created_utc": 1693820737,
   "score": 230,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2ojg2",
   "message": "Chevy Chase",
   "created_utc": 1693820578,
   "score": 106,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2oice",
   "message": "It seems like Julia Roberts is not really that nice when not in front of a camera.\n\nI grew up watching her movies since my mom and aunt are big fans and I've always thought she was a sweet amazing beautiful lady.\n\nTurns out she's really not.",
   "created_utc": 1693820555,
   "score": 231,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3ebcv",
   "message": "Surprised no one has mentioned Bill Murray. Then again maybe it's not that much of a surprise?",
   "created_utc": 1693835024,
   "score": 186,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2ohch",
   "message": "Tobey Maguire",
   "created_utc": 1693820536,
   "score": 196,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2pysf",
   "message": "Bruce Willis. Not super surprised I suppose, but really disappointed.",
   "created_utc": 1693821600,
   "score": 76,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3e4j2",
   "message": "As a Canadian. Shania Twain is a HUGE Bitch.",
   "created_utc": 1693834937,
   "score": 202,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3b6zx",
   "message": "Will Smith.  Loved him as a kid and was one my favorite actors since the fresh prince and and the movies up to Pursuit of Happyness \n\nThen all that cringe family drama and then him smacking Chris Rock was the deal breaker for me and I no longer like him",
   "created_utc": 1693833629,
   "score": 185,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2ofjf",
   "message": "OJ",
   "created_utc": 1693820500,
   "score": 194,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2ooms",
   "message": "Being surprised by a celebrity being a jerk is like being surprised you got shocked when you put a fork in a power outlet.",
   "created_utc": 1693820681,
   "score": 199,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2x32r",
   "message": "beyoncé. i still like to believe that she's nice and she seems like she is but the stories i heard from people who encountered her and jay-z... ehh",
   "created_utc": 1693826364,
   "score": 153,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3bv11",
   "message": "Zoey Deschanel",
   "created_utc": 1693833928,
   "score": 126,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2op7s",
   "message": "Ellen. She always seemed sweet on camera.",
   "created_utc": 1693820693,
   "score": 225,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2ztt7",
   "message": "Rolf Harris - a jerk would be putting what he did mildly but he was beloved in a sweet eccentric uncle way without giving off a false vibe like some other ‘nice guy’ celebs. When a few older celebrities in Britain got accused of historic sex crimes a lot of them were not considered that surprising, but Rolf was the person people felt a genuine sense of shock towards; it felt like a betrayal.",
   "created_utc": 1693827973,
   "score": 142,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3cha0",
   "message": "Kevin James. Heard dude is a MASSIVE prick",
   "created_utc": 1693834207,
   "score": 16,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2uncr",
   "message": "The Weeknd. Unfollowed that guy everywhere smh",
   "created_utc": 1693824800,
   "score": 232,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3cevi",
   "message": "Jim Carey.  That video of him kissing (Alicia silverstone on camera and how uncomfortable she looked was actually jarring as I’ve always had a high opinion of him.",
   "created_utc": 1693834179,
   "score": 16,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz35n5r",
   "message": "Thought you said \"What celebrity were you most surprised to find out that people jerked off to irl?\"\nI had to re-read the post because there's no way that would be an actual question.",
   "created_utc": 1693831003,
   "score": 13,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz348jq",
   "message": "all of them.",
   "created_utc": 1693830306,
   "score": 5,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3fow6",
   "message": "Tyrese Gibson, Emma Roberts, Edward Norton, Michael Peña",
   "created_utc": 1693835651,
   "score": 254,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3g8tq",
   "message": "I got into an internet argument with John Dimaggio (voice of Bender) when I was like 14 years old. This was over email using my hotbot account at the time (just to date myself), sometime before Futurama premiered..\n\nTo be fair I'm not sure if he was the jerk or I was. Wish I still had those emails",
   "created_utc": 1693835895,
   "score": 56,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3aovo",
   "message": "Toby Maguire",
   "created_utc": 1693833399,
   "score": 5,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3dhk7",
   "message": "I guess Ellen switched from 'sweet on camera' to 'sour in reality'! 😂",
   "created_utc": 1693834651,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3fe9p",
   "message": "Michael Jordan",
   "created_utc": 1693835520,
   "score": 177,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3izke",
   "message": "Khalid.\nI've been fortunate to have been a part of a lot of different events, festivals, and shows. I've met a bunch of singers and preformers throughout my time at these events... \nThe most memorable what this guy, but not for anything good.. it was for his attitude towards hotel staff, my colleagues, and his own team. arrogant asshat.  I had to avoid him, I can keep my mouth shut when I have to but I can't contain my face. \n\nSurprisingly I expected Cardi B to be \"that b*tch\" but NOPE, she was a doll! \nMy room happened to be next to her's/ her crew .. final day of a festival I woke up to laughing yelling and loud music from their suite.\nI was like whatever, honestly.. it's part of it all, nbd. But they had bought me breakfast and mimosas (left at my door with a note by housekeeping) and when they caught me on my way out they apologized for their \"routine\" and even asked me if I wanted to come hang out. \nI had things to do for the day or I would have but seriously.. from all I heard that wasn't at all what I expected.\n\nEdit: spelling",
   "created_utc": 1693837087,
   "score": 71,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3asjd",
   "message": "Kevin Spacey",
   "created_utc": 1693833447,
   "score": 76,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3amga",
   "message": "Renato Aragão, brazilians will feel me",
   "created_utc": 1693833369,
   "score": 4,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3fvxm",
   "message": "Wayne Brady. Heard directly from a limo driver in Las Vegas. Guess he’s a real I’m better than you duck head type.",
   "created_utc": 1693835737,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3h4yd",
   "message": "James Corden",
   "created_utc": 1693836288,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz32hu0",
   "message": "Jesus. came walking up to my boat, trauma dumped on me, then skipped away as a storm rolled in.",
   "created_utc": 1693829404,
   "score": 16,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz31xh4",
   "message": "JK Rowling.\n\nWhen I found out it felt like being hit by a brick.\n\nAnd I have been hit by a brick before.",
   "created_utc": 1693829112,
   "score": 25,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz31t3y",
   "message": "I thought they were all jerks. Figured they all just get into character when the camera is on",
   "created_utc": 1693829048,
   "score": 4,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3himj",
   "message": "Cosmo Cramer",
   "created_utc": 1693836455,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3ij8d",
   "message": "None. They're all out of touch ass hats.",
   "created_utc": 1693836896,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3inra",
   "message": "Tom Hanks",
   "created_utc": 1693836949,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3kffy",
   "message": "I've heard Jeff Dunham is an ass in person but the only source I have is a couple friends who went to a show and tried to get autographs. If true it really bums me out, some of his stuff is a miss but most of its really funny and I genuinely thought he was a nice guy.",
   "created_utc": 1693837687,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3finz",
   "message": "The singer from Smash mouth",
   "created_utc": 1693835574,
   "score": 1,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz2op7w",
   "message": "Maybe Don Trumpo.",
   "created_utc": 1693820693,
   "score": 253,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3j8xj",
   "message": "Jonah Hill",
   "created_utc": 1693837195,
   "score": 191,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3coj6",
   "message": "Christopher Reeve",
   "created_utc": 1693834297,
   "score": 250,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3jwef",
   "message": "Jerry Lewis.\n\nGrowing up as a kid in the 1970s, I watched his movies (both with and without Dean Martin) countless times on tv. I just LOVED his movies (still do). And he was hailed as a Saint for his charitable efforts regarding muscular dystrophy.\n\nAs the years passed, little by little it was coming out how a godawful human being he really was. How he was a serial philanderer, cheating on his wife early on in their marriage, sexually harassing and abusing numerous actresses he worked with, secretly fathered a child (a daughter) in the 1950s with a fashion model and never acknowledged her existence or helped his biological daughter out, even when she went homeless decades later. Passed away, leaving all his sons and/or grandkids nothing in his will.\n\nPretty shocked to learn what a jerk, a monster, he was in real life.",
   "created_utc": 1693837467,
   "score": 13,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3kmwq",
   "message": "Gary Burghoff, better known as Corporal Radar from M* A* S* H. Apparently he is not as much of a teddy bear as one would expect.",
   "created_utc": 1693837771,
   "score": 210,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3nk12",
   "message": "I am never surprised when a celebrity is a jerk.",
   "created_utc": 1693838950,
   "score": 99,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4nl5b",
   "message": "Many years ago I volunteered for a charity. We had an event where Jim Carey was a keynote speaker and guest. This was shortly after \"Mask\" was released.\n\nWhen Jim Carey showed up, he was a cock to everyone. \n\nWhen the event started, we expected him to still be a cock. Nope, it's like he flipped a switch and became \"Jim Carey\" and wowed the audience. \n\nWalked off stage and was a cock again.",
   "created_utc": 1693852783,
   "score": 203,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4x16g",
   "message": "interviewed zachary quinto once. i could tell he was very talented and he would be going very far with his career in a more thespian-like manner. he wasn't a terrible person but he was unsurprisingly - how do i put this... um, well - conceited. obviously he can back it up; he's very talented but, c'mon - it's still just acting. \n\nif anyone loves Chris Pine, he is absolutely charming in real life; knows how to address fans and press. a total sweetheart. \n\nbut the biggest sweetheart of them all is Elijah Wood. what a great actor to interview. humble, kind, sensitive, and very very sweet natured.",
   "created_utc": 1693856445,
   "score": 186,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz407z8",
   "message": "Jerry Lewis.  Came into my store once and was a complete jackass.  You know who was amazingly nice to me?  Martin Landau, a very nice man.",
   "created_utc": 1693843871,
   "score": 167,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4k95g",
   "message": "Rachael Ray.  She seems pretty outgoing and friendly but I've read on several different platforms that she's an ahole.  It's a shame.",
   "created_utc": 1693851497,
   "score": 106,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4nstq",
   "message": "Not an asshole (like what you would expect) but...\n\nParis Hilton is apparently an absolute sweetheart.\n\nA good friend of mine who used to work in the fashion industry and has met her on more than a few occasions said that she is consistently one of the nicest celebrities he has ever met. He is a \"nobody\" in the industry but she recognized him the 2nd time she saw him and walked over and continued their conversation where they left off 6 months prior.",
   "created_utc": 1693852866,
   "score": 130,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3tkhv",
   "message": "Dhar Mann  , bro built his whole career by making videos on kindness , helping others , compassion , empathy etc. Turns out he was an awful boss and didn't even pay his employees a wage they could live off of despite having millions of views on his youtube channel",
   "created_utc": 1693841313,
   "score": 71,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz41owy",
   "message": "Ellen Degeneres. It just really sucks that she’s such a hypocritical bitch",
   "created_utc": 1693844436,
   "score": 170,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz405cn",
   "message": "Maybe not \"jerk\" per se, but I was pretty floored hearing Danny Trejo- who went to prison for armed robbery and witnessed murders by drug dealers- say that the one guy he wouldn't fuck with was...John Cusack.",
   "created_utc": 1693843843,
   "score": 97,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz48461",
   "message": "Is a Buzzfeed writer posting these questions? Because this is like the third “which celebrity’s a dick” article I’ve seen in the past 24 hours on this subreddit.",
   "created_utc": 1693846902,
   "score": 150,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4k30y",
   "message": "Bill Nye.\n\nWas a huge fan growing up. My brother works for NASA at Goddard in Maryland and Mr Nye has been a guest speaker for a number of events. The dude is apparently, according to my brother and his colleagues, a total jerk and gets a little creepy with the ladies. Anytime I've shared this, I get a fair amount of people disbelieving or say it's probably a misunderstanding. Look into it for yourself and I'm sure you'll find many anecdotes of him being an ass.",
   "created_utc": 1693851431,
   "score": 74,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3qw7r",
   "message": "Morris Dees, the founder of The Poverty Law Center, whom I had admired for years.  Then he was fired, allegedly for sexual harassment and his treatment of minority staff.",
   "created_utc": 1693840274,
   "score": 105,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz445ee",
   "message": "NPH",
   "created_utc": 1693845382,
   "score": 93,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4lcfj",
   "message": "In an interview with a show runner who worked on The Tonight Show for over 20 years, they asked him who was the meanest celebrity ever on: Billy Crystal.",
   "created_utc": 1693851912,
   "score": 47,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz42bl3",
   "message": "I run a recording studio and I get some celebrities now and again mostly doing voice overs.\n\nI had Danica Patrick doing voice over for a tv show she produced about racing.  \n\nShe thought the read was only a few lines, but they had like 10 pages for her.  \n\nShe lost her shit when I handed her the script.  She spent almost 40 minutes on the phone yelling at her assistant and other people about it...Instead of just fucking doing the read.\n\nWhen she finally calmed down, she was a huge asshole to the producers on the phone listening in. Its typical for them to ask the reader things like, \"gives us one more take of that a little slower...\"  When they would, she would explode about how much time she is giving them already and she is only going to read each thing once.\n\nIt was really cringe. I always wonder how much she was paid for that and was so just unaware of how lucky she is.",
   "created_utc": 1693844680,
   "score": 223,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4mbq4",
   "message": "Steve Martin. Started out as a promising young, black inventor with great ideas about eyeglasses. Eventually let all the wealth get to his head and wound up broke again after his glasses left customers crosseyed. What a shame.",
   "created_utc": 1693852294,
   "score": 7,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4xn5v",
   "message": "My Dad worked as a chef in various restaurants over the years and got to meet quite a few celebrities that way. The one that always stuck out to me was when he told me he got to serve dinner to Richard Dreyfuss. I had always liked his movies and brand of humor. To me, he seemed like a nice guy. \n\nMy Dad told me he was incredibly rude and entitled, demanding that the staff not speak to him at all. They comped his meal as a courtesy but never received a compliment or thank you. Like dude, next time, just go through a drive-thru if you don't want to interact with people.",
   "created_utc": 1693856678,
   "score": 38,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4kvs8",
   "message": "I'm still a huge fan, but when I met Danny Elfman backstage after an Oingo Boingo concert, he was a total dick! He was a dick to this other guy first, making funny faces at him while he was saying what a big fan he was. He was openly mocking the poor guy. Then, he was a dick to my date, a nice young woman who simply asked a question. I was shocked. All the other guys were nice, especially Johnny Vatos and the horn section guys. I have heard other people say they met him and he was nice, so maybe I got him on a bad night, but still. I could have the day from hell and I'd still be nice to people, especially ones who like me.",
   "created_utc": 1693851736,
   "score": 73,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz490s8",
   "message": "I’ve heard Jason Bateman is a dick and that makes me really upset",
   "created_utc": 1693847249,
   "score": 92,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4jfcd",
   "message": "soulja boy. not that surprising but this situation stands out among the celebs i’ve met. \n\nmy sister in law \u0026amp; i were out shopping in LA with my nephew in a stroller. we passed a famous shoe store and saw soulja boy run out with a few boxes of shoes. a guy in the store ran out after him saying “you didn’t pay! come back”. soulja boy tries to open his car door but it’s not working for some reason. he sees the guy still standing there so he runs back with the shoes while laughing and saying “haha just joking man chill”. what really pissed me off was that when he ran back into the store he damn near knocked my nephew’s stroller over and just looked at us like “so?” fucking dick.",
   "created_utc": 1693851176,
   "score": 34,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4j478",
   "message": "I lived in Oklahoma when Twister was filmed. Locals who worked/dealt with Helen Hunt, referred to her as Helen Cunt.",
   "created_utc": 1693851057,
   "score": 85,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4eyd7",
   "message": "Jared Leto, I've read all the stories and the guy is just awful.",
   "created_utc": 1693849491,
   "score": 110,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3nsj6",
   "message": "Adam Baldwin - I always generally enjoyed his work in movies and loved Jayne in Firefly. then I ran into Baldwin on witter many years ago and saw what he's like.\n\nJoss Whedon goes in the same category, but for different reasons",
   "created_utc": 1693839045,
   "score": 135,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz5a7ls",
   "message": "William Shatner. He’s unpleasant. Frequents my home town in KY because he owns a horse farm. He tells people to go away and leave him alone.",
   "created_utc": 1693861534,
   "score": 27,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz401r2",
   "message": "She’s not a huge celebrity (I don’t know how liked she is in the country music circuit), but Cassadee Pope’s band opened for one of my friends a little over a decade ago. She was saying some pretty terrible things about fans after the show, and I called her out on it. Mind you, a lot of us were assholes in our early 20s, so she might be different now, though.",
   "created_utc": 1693843804,
   "score": 21,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz4wj51",
   "message": "Alton Brown",
   "created_utc": 1693856252,
   "score": 22,
   "submission_id": "169nm64"
  },
  {
   "comment_id": "jz3wvu2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "169nm64"
  }
 ]
}