{
 "submission_id": "169n7t2",
 "title": "What's a conspiracy theory that you find interesting, even if you don't believe in it?",
 "selftext": "",
 "created_utc": 1693819010,
 "permalink": "/r/AskReddit/comments/169n7t2/whats_a_conspiracy_theory_that_you_find/",
 "score": 48,
 "url": "https://www.reddit.com/r/AskReddit/comments/169n7t2/whats_a_conspiracy_theory_that_you_find/",
 "comments": [
  {
   "comment_id": "jz2psz5",
   "message": "Nibiru or Planet X",
   "created_utc": 1693821481,
   "score": 31,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2qywg",
   "message": "i think the hollow earth theory is cool, in a fictional sense. the theory suggests that's where all the cryptids are living in. honestly? there's a lot of endless possibilities to that",
   "created_utc": 1693822308,
   "score": 26,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2qwlk",
   "message": "The whole Paul Is Dead thing.\n\nI don't buy any of it but it's interesting to see how some people read 'clues' in the music and artwork.",
   "created_utc": 1693822262,
   "score": 18,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz32uzo",
   "message": "The Phantom Time theory. Basically that AD 614 - 911 didn’t happen.",
   "created_utc": 1693829596,
   "score": 17,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz36ayf",
   "message": "Fidel Castro is Justin Trudeau's father. It holds juuuust enough water to be interesting.",
   "created_utc": 1693831331,
   "score": 51,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2nbm0",
   "message": "Flat earth. It astounds me that people believe it with the evidence we have",
   "created_utc": 1693819716,
   "score": 56,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2ryxc",
   "message": "Read this somewhere a few years back, Michael Jackson was killed because he wanted to expose all the elite pedophiles. His ranch was actually sort of a safe haven for victims. He was framed as a pedo so that his image will be shattered and no one would believe whatever he said.",
   "created_utc": 1693823001,
   "score": 35,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3a2tj",
   "message": "That Avril Lavigne was replaced by a doppelganger some years ago.  I jist love the sheer randomness of picking her to be a center of a theory like that.",
   "created_utc": 1693833112,
   "score": 12,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2mkec",
   "message": "The US hiding a UFO retriever and research program. I imagine they are retrieving their own crashed experimental craft, but it’s fun to think of them recovering an actual UFO including an alien pilot.",
   "created_utc": 1693819186,
   "score": 34,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz38i0o",
   "message": "90s gangsta rap was propaganda to enhance profits for companies that operate private prison systems.  Music industry had shared equity investors with private prison companies",
   "created_utc": 1693832377,
   "score": 10,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2mrzp",
   "message": "John Titor",
   "created_utc": 1693819331,
   "score": 18,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz310lh",
   "message": "Dulce base in New Mexico, or Skin Walker ranch",
   "created_utc": 1693828621,
   "score": 8,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2mjju",
   "message": "QANON - I obviously don’t believe it but I just find it interesting of how it’s exposes how vulnerable and naive people are on social media, or just flat out puts dumb people on display.",
   "created_utc": 1693819172,
   "score": 18,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2vxov",
   "message": "the moon being an artificial satellite is so interesting",
   "created_utc": 1693825637,
   "score": 12,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz36qtt",
   "message": "Birds are spy drones, and they sit on power lines to recharge.\n\nIt's so easy to test, anyone can shoot a random bird and dissect it, but people still spread it around.",
   "created_utc": 1693831546,
   "score": 11,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2yuki",
   "message": "Catholic takeover of the US government. Something a lot of people have been afraid of from the 18th century up until mid-20th century. \n\nhttps://historymatters.gmu.edu/d/5073/\n\nAlso the \"Vatican conspiracy theories\", believing that the Church and its representatives are secretly controlling secular society with a Satanic agenda for global domination.",
   "created_utc": 1693827410,
   "score": 9,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2whzt",
   "message": "Charles Manson and the CIA connection",
   "created_utc": 1693825995,
   "score": 5,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3c6j7",
   "message": "Australia doesn’t exist. It’s just an elaborate\ncover up by the British government for a mass murder, telling people that criminals are being sent to a penal colony but in ‘reality’ prisoners just get executed on the edge of the earth.",
   "created_utc": 1693834074,
   "score": 4,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2mv9f",
   "message": "Bush did 9/11",
   "created_utc": 1693819394,
   "score": 8,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2rh0d",
   "message": "That some celebrities have given their soul to the devil to achieve the epitome of success!",
   "created_utc": 1693822660,
   "score": 5,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3aukx",
   "message": "Faked moon landings. Something seems truly unbelievable about the fact that in 1969 we somehow managed to land a tiny space craft on the surface of the moon, go for a stroll, play some golf, then fly back again.\n\nAnd yet we haven't been back properly or tried to do anything even close to as exciting as the Apollo programme since??\n\nI can see why conspiracy on this one is so attractive because....it's so damned outrageous!! We could do so much 50 years ago and today we just fire Teslas into the atmosphere for jokes and struggle to even get that much. Curiosity rover is about as close as we get to that kind of excitement but it just doesn't feel 'real' until human feet step alongside it.",
   "created_utc": 1693833473,
   "score": 6,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3ekez",
   "message": "I have kind of an odd one. \n\nI wholeheartedly remember watching a video on youtube years ago. That talked about algorithms and internet search histories. When combining these two things it could predict people's search patterns. At the time the video was made there was a future time period where it predicted all internet search histories stopped for like 3 months. Then started up again.\n\nI can no longer find this video or any other information related to this.",
   "created_utc": 1693835142,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3f4mq",
   "message": "The CIA's involvement in the assassination of JFK",
   "created_utc": 1693835399,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2qk2z",
   "message": "Hitler actually escaping to Argentina",
   "created_utc": 1693822012,
   "score": 9,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2qa4p",
   "message": "That Europeans -French during the Napoleonian campaigns in particular- systematically smashed the noses of egyptian sculptures to hide the fact that this awe inspiring civilization was predominantly ruled by black people.",
   "created_utc": 1693821825,
   "score": 7,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2mu4d",
   "message": "The Hollow Earth Theory",
   "created_utc": 1693819374,
   "score": 6,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz373o4",
   "message": "Chemtrails.  Is every aircraft mechanic sworn to secrecy about the tanks on the plane or what?  Why don't we ever see them refilling the tanks?  Why don't people take air samples and figure out exactly what chemicals are used?  The logistics of it would be mind-boggling.",
   "created_utc": 1693831716,
   "score": 5,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2mwhb",
   "message": "Flat earthers. They conduct experiments to confirm their theories, which, on the contrary, refute them, and after that, they continue to believe in them. This is ridiculous",
   "created_utc": 1693819417,
   "score": 9,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2mz0p",
   "message": "That aliens built the pyramids and came to watch to teach early humans about maths etc. Also that humans are aliens who got rid of the dinosaurs so we could settle on earth. It sounds too far fetched to be true but I think it would be great if it was as it kind of makes logical sense to me",
   "created_utc": 1693819469,
   "score": 4,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz37r4z",
   "message": "Quantum immortality, there is a youtube video (I think it was called reddit Abyss) about a guy on reddit that went nuts over it.",
   "created_utc": 1693832024,
   "score": 2,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3fpp9",
   "message": "That Ted Kaczynski was created by MKUltra… shit wait he was!",
   "created_utc": 1693835661,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3harc",
   "message": "I don’t believe it, but the theory that the Titanic was really the Olympic is a fun one.",
   "created_utc": 1693836360,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3ijxd",
   "message": "That we live in a simulation and glitches can happen",
   "created_utc": 1693836904,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz32f13",
   "message": "Black knight satellite. The claim is that there is a 13k year old satellite In polar orbit (there are real pictures of \"it\") but it's just some space debris from NASA. Somehow they included something about Nikola Tesla discovering it.",
   "created_utc": 1693829363,
   "score": 2,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2sj8e",
   "message": "pizzagate. i know it’s been debunked but i still don’t trust any hollywood elites.",
   "created_utc": 1693823380,
   "score": 5,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2wq8r",
   "message": "The Mandela Effect",
   "created_utc": 1693826139,
   "score": 4,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2n2vm",
   "message": "The American meat industry conspiracy. Except I do believe in it.\n\nhttps://www.livekindly.com/the-outrageously-corrupt-history-of-the-meat-industry/",
   "created_utc": 1693819550,
   "score": 2,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz35efj",
   "message": "[the greenland theory](https://hive.blog/greenlandtheory/@romonero/greenland-theory)",
   "created_utc": 1693830885,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz39apt",
   "message": "One interesting theory I read a while back was that there is a group called the elites who are the actually the ones who control everything. Their wealth is in the trillions and to hide the evidence of their existence they created American Politics as a cover by making it a show that entertains the masses and we fall for it.",
   "created_utc": 1693832747,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz38ea9",
   "message": "That Covid-19 was made in a laboratory in China, and that it was either accidentally or intentionally released onto the world. XD",
   "created_utc": 1693832331,
   "score": 0,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz34vf4",
   "message": "Sandy Hook.",
   "created_utc": 1693830623,
   "score": 0,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz2t9io",
   "message": "I find interesting that some people believe that  female comedians funny. I have never seen one ( exception possibly Joan Rivers) , so it remains just a conspiracy theory.",
   "created_utc": 1693823878,
   "score": 236,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3abbt",
   "message": "The first landing on the moon was filmed in a studio in America...",
   "created_utc": 1693833223,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3amnz",
   "message": "Throw back Thursday was invented by the FBI/NSA to test facial recognition/ageing software.  Sounds believable to me.",
   "created_utc": 1693833371,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3cvkp",
   "message": "Last Thursdayism is interesting. Ots the belief that everything before last Thursday never happened and we all have artifical memories.\n\n\nI thought something along the lines of this as a kid (while thinking maybe I was abducted by a fake family that sorta looks like me, and so questioned my memories), so I decided to commit that moment to memory since I was certain it happened right there.",
   "created_utc": 1693834384,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3dbkw",
   "message": "The HAARP Machine. It’s ignorant beyond belief to try and conceptualize it existing. It’s the only one I find REMOTELY interesting. I don’t believe it. The rest are honestly INCREDIBLY underwhelming. Most are beneath contempt.",
   "created_utc": 1693834578,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3dy26",
   "message": "Hollow Earth",
   "created_utc": 1693834854,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3e0kw",
   "message": "JFK Assassination being a big conspiracy. \n\nIt’s incredibly unlikely but definitely interesting",
   "created_utc": 1693834886,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3eeb9",
   "message": "Mountains are just the remains of absolutely colossal trees!",
   "created_utc": 1693835062,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3esxn",
   "message": "America never landed on moon on 1969 it was just green screen.",
   "created_utc": 1693835249,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3f1jm",
   "message": "Arby’s is a front for money laundering.  No way that many people are buying Beef n Cheddars to buy all the restaurants they’ve bought.",
   "created_utc": 1693835359,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3fc5k",
   "message": "That Hagrid was Voldemort's secret Death Eater.",
   "created_utc": 1693835494,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3fzl8",
   "message": "The Pope was allegedly angry at Trump for building a wall between Mexico and the USA, because Mexicans are largely Catholic and having more Mexicans in the USA would mean more support/power for the Vatican in the USA.",
   "created_utc": 1693835782,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3ggrc",
   "message": "MH370 abducted by alien Airforce",
   "created_utc": 1693835992,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3gs5q",
   "message": "Probably \"Paul McCartney has been dead for ages\".\n\nTo me, that's a perfect example of what conspiracy theories used to be (or perhaps it's just all I knew when I was younger): Interesting shit-talking and people coming up with creative ways to make things fit and try to support it, but no harm is really done. Like \"Elvis is still alive on some island in the carribean\".\n\nNowadays so many conspiracy theories seem like instruments to transport ideology, alienate and indoctrinate people, spread hatred and actively work against progress, for example by diffaming science.  \nThey are actively harmful, and some certainly have blood on their hands.\n\nBack in the day, the worst you had in that regard was \"Big Pharma isn't producing this medicine on purpose\" or \"Saudi oil oligarchs are hoarding patents for electrical vehicles to delay them becoming relevant\". They were also harmful, but they were nowhere near as bad as recent conspiracy theories and most importantly, particularly the first one was still widely seen as shittalking and laughed off or frowned upon by everyone with the slightest bit of expertise if someone was serious, at the very least when it was about certain life-saving drugs.",
   "created_utc": 1693836131,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3hduq",
   "message": "That the Kardashian Sisters keep their brother chubby so they can use his fat for their injections.",
   "created_utc": 1693836398,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3hwe6",
   "message": "Flag earth, hollow earth, giant ice ball with a puddle theory\n\nI think all would be pretty cool sci Fi concepts, idk how people can actually believe them though",
   "created_utc": 1693836621,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3jhly",
   "message": "I have two:\n\nStairway to Heaven has satanic lyrics when played backwards.\n\nThere's a scene in Wizard of Oz where you can see a munchkin that hung himself on set.\n\nI can't believe people actually believe in either one lol.",
   "created_utc": 1693837295,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3jziv",
   "message": "There is a theory that the Titanic didn't actually sink back in 1912. It was actually swapped for its sistership, the Olympic, as part of an insurance scam.\n\nLong story short, the Olympic had an accident in 1911 which would put it in the shipyard for a long time, in turn delaying the launch of the Titanic. White Star Line would be ruined. To mitigate this, they would repair the Olympic in-dock, remodel her superficially to look like the Titanic (flooring, interior), and send her off with a new nameplate.\n\nThere is actually some solid evidence for this, for example when the Titanic was photographed in-dock she had 14 evenly spaced uniform portholes on C-deck, while the Olympic had 16 unevenly spaced port holes. [Comparison](https://shorthand-social.imgix.net/prod/story/jCPyIbzzPVc/media/dabc33c0ec6411e58172cfb1db5e8826/original.jpg?w=1200\u0026amp;h=1200\u0026amp;fit=max\u0026amp;fm=jpg\u0026amp;q=70\u0026amp;auto=format)\n\nThe ship that left the docks in southhampton in 1912 indeed had 16 unevenly spaced portholes.\n\nhttps://www.thoughtco.com/thmb/DuQnpLpeRSyZa5zoc3L8G4GWLEg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/R.M.S.Titanic-5baae8d6c9e77c0025e53f86.jpg",
   "created_utc": 1693837503,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3k2qa",
   "message": "Finland doesn’t exist, it was created by the Japanese and Russians so they can fish in the Baltic. Fin-land!! Get it??",
   "created_utc": 1693837541,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3kkf5",
   "message": "Ancient aliens.  Working on some fiction based on it being true.",
   "created_utc": 1693837743,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3kldq",
   "message": "That former President Obama worked for the CIA affiliated company Business International Corporation after graduating from Columbia with his B.A. Whether the former President ever did anything for the CIA as a lowly intern before grad school, it’s a crazy coincidence.",
   "created_utc": 1693837754,
   "score": 1,
   "submission_id": "169n7t2"
  },
  {
   "comment_id": "jz3lf5c",
   "message": "I don't believe in pizzagate type nonsense but I do think that wealthy and powerful people are much, much, much more likely to be child molesters than your average joe. The reason for this being that the pursuit of money and power is ultimately joyless and unfulfilling and as a result of having a big gaping hole in one's heart and nothing to fill it, one tends to opt for increasingly extreme and depraved behavior. So while I don't believe in the conspiracy about them harvesting adrenochrome and I don't buy into there being a Satanic angle, I think there must be something to the claims that elites gather in secret to abuse children.",
   "created_utc": 1693838092,
   "score": 1,
   "submission_id": "169n7t2"
  }
 ]
}