{
 "submission_id": "169qxo1",
 "title": "Non-Americans of Reddit, what’s an American custom that makes absolutely no sense to you?",
 "selftext": "",
 "created_utc": 1693831179,
 "permalink": "/r/AskReddit/comments/169qxo1/nonamericans_of_reddit_whats_an_american_custom/",
 "score": 129,
 "url": "https://www.reddit.com/r/AskReddit/comments/169qxo1/nonamericans_of_reddit_whats_an_american_custom/",
 "comments": [
  {
   "comment_id": "jz6cc5b",
   "message": "Commercials for drugs. That you can't even buy yourself. But 'ask your doctor!'",
   "created_utc": 1693878067,
   "score": 136,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz40m2j",
   "message": "Cashiers who aren't allowed to sit during their work\nLike.... Why??",
   "created_utc": 1693844022,
   "score": 26,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5o33m",
   "message": "Kids beauty pageants. \nParents are willingly sexualizing their children. \nIt’s weird.",
   "created_utc": 1693867273,
   "score": 144,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3ihx8",
   "message": " Having to find somebody to cover shifts when you're off on leave/sick.\n\nIsn't that literally what the manager is there for?",
   "created_utc": 1693836879,
   "score": 25,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz548sv",
   "message": "No tax included in the price tag",
   "created_utc": 1693859212,
   "score": 163,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3ltc2",
   "message": "Home owner associations dictating the smallest details of your own home.",
   "created_utc": 1693838250,
   "score": 0,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz4oum1",
   "message": "Doing your own taxes, and being punished if you get it wrong by mistake.",
   "created_utc": 1693853267,
   "score": 28,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3xqt6",
   "message": "At 18 you can join the army, carry guns, fuck, drive car. But buy and drink alcohol only 21???",
   "created_utc": 1693842914,
   "score": 6,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz404v7",
   "message": "Black Friday. You spend Thanksgiving saying how grateful you are for what you have, and then have a massive free-for-all over stuff you want.",
   "created_utc": 1693843837,
   "score": 233,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3c1l2",
   "message": "The toilet gap.",
   "created_utc": 1693834010,
   "score": 234,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5b5et",
   "message": "Televangelists springs to mind, there is one absolutely morally repugnant one with a massive house and private jets whose name I can't recall. I vehemently dislike organised religion at the best of times but why people actually listen to the ones that are very obviously money-grabbing lying scum is totally beyond me.\n\nEdit: The one I was thinking of was Kenneth Copeland, seems to me he might be \"worst among equals\" as it were.",
   "created_utc": 1693861902,
   "score": 140,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz465yb",
   "message": "Sales tax not being included in the price already. Wild.",
   "created_utc": 1693846153,
   "score": 82,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz4zzz2",
   "message": "Paid maternity leave not being legislated as a basic employment right.",
   "created_utc": 1693857577,
   "score": 73,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3ybc3",
   "message": "People have mentioned tipping but the whole process of paying in restaurants is pretty strange. \n\nCustomer being given a receipt and pen to write down the tip. \n\nGiving the server your card and them just disappearing out the back with it. \n\n\nHere they just bring the POS terminal to the table and you pay.",
   "created_utc": 1693843134,
   "score": 236,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5b2sv",
   "message": "Having one week of paid vacation or sometimes not any time at all",
   "created_utc": 1693861874,
   "score": 116,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5mn3a",
   "message": "Speaking as an American we don't understand most of these either.",
   "created_utc": 1693866651,
   "score": 116,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5h1gb",
   "message": "Mega churches\n\nEdit: jeez I’ve never had more than a 100 people react to anything I put in here! I (almost) feel like a celebrity.\n\nThe thing with (what I know about) these mega churches is not so much people believing in one thing or another. \n\nIt’s just that it’s so far removed from the sober teachings of Christ that I know and I don’t understand the people that go to these venues and think: Yes! What I am doing here is how Christ wanted us to honour God.\n\nWhat happened to take care of your neighbours? \nWhy not preach/worship outside in a field and spend all those tax-free millions on feeding the poor?\n\nMaybe good to add, I’m an atheist so I may have gotten the teachings of Christ wrong and mega churches are in fact how God wanted it.",
   "created_utc": 1693864302,
   "score": 63,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz36ep9",
   "message": "tipping, do some actually live of the tips?",
   "created_utc": 1693831382,
   "score": 46,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz6ipne",
   "message": "Not using anything that is “ the rest of the world” standard:\n\nSAE v Metric, for measurements\n\nF v C for, temperature \n\nLetter v A series, for paper sizes\n\n110v v 240v, for power\n\nA square black and white sign v red ring around a number, for speed signs\n\nMM/DD/YY v DD/MM/YY or YYYY/MM/DD, for dates\n\nNo concept that there are 24 hours in a day / that is Military Time v using normal time.\n\nEntrée v Entrée for describing a meal",
   "created_utc": 1693880980,
   "score": 108,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3xc1y",
   "message": "Obligatory tipping.",
   "created_utc": 1693842756,
   "score": 122,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3n0bk",
   "message": "Anything and everything related to belonging and participating in a Fraternity/ Sorority. ESPECIALLY the selection and hazing. ETA: actually, the selection and hazing are the problems",
   "created_utc": 1693838730,
   "score": 20,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3q3yg",
   "message": "Not wear green onPatrick's Day—or risk getting pinched! The tradition is tied to folklore that says wearing green makes you invisible to leprechauns, which like to pinch anyone they can see. Some people also think sporting the colour will bring good luck, and others wear it to honour their Irish ancestry.\n\nWe don’t pinch anyone in Ireland for not wearing green on the day. It’s not a part of Irish folklore at all. Corned beef and cabbage isn’t an Irish thing either.",
   "created_utc": 1693839965,
   "score": 136,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5sr0s",
   "message": "Wedding cake smashing.\n\nAs in, into the brand-new spouse's face. \n\nAmericans are so polite, diplomatic, and kind, and the occasion demands that the celebration be decorous. Then someone does something so ..... tacky. It is jarringly weird to me.",
   "created_utc": 1693869299,
   "score": 177,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5elib",
   "message": "Tipping. The employer should be paying wages not the customers",
   "created_utc": 1693863300,
   "score": 173,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3uq4b",
   "message": "Baby showers. Here in Sweden it is generelly considered bad luck to give baby gifts before the baby is actually born. When the baby is born and the parents have gotten a few weeks alone with their newborn they usually start inviting people to meet them, but one or a few at a time, and then you bring a gift.",
   "created_utc": 1693841763,
   "score": 15,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz53e66",
   "message": "Maternity leave, or rather lack off",
   "created_utc": 1693858880,
   "score": 156,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5qj6u",
   "message": "Your lack of adequate maternity leave is mind-blowing 🤯",
   "created_utc": 1693868333,
   "score": 41,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3665r",
   "message": "Gender reveal parties, I couldn't give a fuck what you're having and you shouldnt give fuck what im having. I hate that it's slowly becoming a thing in the UK",
   "created_utc": 1693831265,
   "score": 51,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3aylg",
   "message": "People enthusiastically defending the health-care system that bankrupts people, sometimes even in reddit threads where people show off their horrendous medical bills.\n\nEdit: I wrote a long comment in two parts in response to a [comment below](https://reddit.com/r/AskReddit/s/ceD8t03r0t).  \nPart 1: [Barely coherent ramble about insurance costs and taxes](https://reddit.com/r/AskReddit/s/GDCRuaitIH)  \nPart 2: [Summary of a surgical procedure I had last week](https://reddit.com/r/AskReddit/s/DlBo64pb2Y)",
   "created_utc": 1693833524,
   "score": 238,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz6uje6",
   "message": "Not sure if it's a custom but i hate the fact that all children are expected to leave their family's house and live on their own by at least their 20s.\n\nI come from the middle east where it's very common to live in multi generational houses. You'd probably never leave your family's house unless you are getting married or they literally just kick you out or something lol.\n\nActually many people choose to remain in their family's house even after marrying and having kids and what not. It's very normal here for a house to have like 3-4 different generations of the same family in it.",
   "created_utc": 1693886966,
   "score": 39,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3i2xb",
   "message": "It’s almost a cliche that when you meet someone who was in the service you have to say “thank you for your service “\nWe were in Florida last year (and that state is a whole different story). There was an older gentleman who couldn’t even carry on a conversation because it was a never ending stream of “thank you for your service”.\nI appreciate anyone who does anything to help others. I find the constant “praise” is overkill.",
   "created_utc": 1693836699,
   "score": 182,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3vi1s",
   "message": "A lot of the High School stuff, like all the formal dances, Football, cheer leading. They’re such a big deal in the USA.",
   "created_utc": 1693842061,
   "score": 17,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz38o2k",
   "message": "The pledge of allegiance things at school. What in the actual fuck?",
   "created_utc": 1693832457,
   "score": 18,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz363sj",
   "message": "How are bidets not commonplace",
   "created_utc": 1693831233,
   "score": 185,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3ompo",
   "message": "The excessive consumption of Starbucks beverages.",
   "created_utc": 1693839379,
   "score": 162,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3kmeg",
   "message": "When you guys go to a restaurant to eat and the tip is compulsory - where I am from you tip however much you want, if you get really good service you might leave a nice tip, if you get bad service you might not tip at all. Why should I be forced to pay a tip if the service is bad? Don't get me wrong most places I go to eat the service is good and I will always tip but I don't feel like I should be forced in to paying a tip as a fee.",
   "created_utc": 1693837765,
   "score": 94,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3v43w",
   "message": "mindlessly voting along party lines, even though the party's candidate is a complete fool",
   "created_utc": 1693841912,
   "score": 10,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5asfp",
   "message": "The head over heels worship for the military (if you did that with the military here you'd probably annoy them, they usually just want to be left alone to enjoy their meal or whatever they're doing).\n\nFiling your own taxes.\n\nMajor League Eating.\n\nDrinking age of 21.",
   "created_utc": 1693861761,
   "score": 56,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3nchu",
   "message": "Calling a team \"World Champions' of a sport that only your country competes in.",
   "created_utc": 1693838865,
   "score": 232,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz4zeks",
   "message": "Beep-sounds on tv when someone swears. \nIt’s just words. It can’t bite you.",
   "created_utc": 1693857349,
   "score": 136,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3vfeu",
   "message": "refusing to use metric",
   "created_utc": 1693842032,
   "score": 78,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz6as0a",
   "message": "That 18 year old boys are old enough to die for their country but they can’t buy fucking alcohol..Oh, sorry; I’m an American but still, I don’t understand that shit at all..",
   "created_utc": 1693877352,
   "score": 48,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz6ne8w",
   "message": "Why is medical bankruptcy not at the absolute fucking top of this list?",
   "created_utc": 1693883213,
   "score": 43,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3i8nl",
   "message": "Homecoming. Your high school is having a football game, and everyone is town goes to watch and it's a big deal because???",
   "created_utc": 1693836768,
   "score": 31,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3tdd9",
   "message": "Asking \"How are you doing?\" Without wanting to know how anyone is doing",
   "created_utc": 1693841235,
   "score": 235,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3gkok",
   "message": "The tipping culture. Working a job and then having to depend on charity seems extremely wierd. I don't understand how people put up with that, having employment but having to basically beg for money to survive.",
   "created_utc": 1693836041,
   "score": 86,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz364bl",
   "message": "The level of patriotism, like you don’t need to salute the flag or whatever every morning at the start of school.",
   "created_utc": 1693831240,
   "score": 179,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3m2o5",
   "message": "The Gender reveal thing celebrations WHY.",
   "created_utc": 1693838354,
   "score": 65,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz3at5d",
   "message": "cmiiw but playing the national anthem before EVERY sporting event? Just never understood it, maybe it's just because I'm Australian and we only every play the national anthem before finals (or playoffs if you're American) games.",
   "created_utc": 1693833454,
   "score": 228,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz4ko1m",
   "message": "The whole \"building credit\" thing. Not sure it's a custom or just plain stupid. The amount of money that I can borrow is a reflection of my income and what it is that I want to borrow money for. The idea that you can't get a mortgage because you didn't pay for groceries with a credit card 10 years ago is absurd.  \n\nI suppose part of it is how the housing market works, it weird that if you can't pay your mortgage, then you can just drop the keys in the mailbox and it suddenly becomes a problem for the bank. Here if you can't pay your mortgage it's still your house and your problem. Sure the bank can use the law to make the government force you to sell to pay of debt, but that's different.",
   "created_utc": 1693851655,
   "score": 128,
   "submission_id": "169qxo1"
  },
  {
   "comment_id": "jz5rwhg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "169qxo1"
  }
 ]
}