{
 "submission_id": "16agdiu",
 "title": "What are y'all starting to dislike the more and more older you get?",
 "selftext": "",
 "created_utc": 1693895225,
 "permalink": "/r/AskReddit/comments/16agdiu/what_are_yall_starting_to_dislike_the_more_and/",
 "score": 211,
 "url": "https://www.reddit.com/r/AskReddit/comments/16agdiu/what_are_yall_starting_to_dislike_the_more_and/",
 "comments": [
  {
   "comment_id": "jz7fvm2",
   "message": "The five day work week.",
   "created_utc": 1693901903,
   "score": 126,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7aqs4",
   "message": "Social media. It's just gotten worse and worse since I was in highschool.",
   "created_utc": 1693897795,
   "score": 187,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz79tkr",
   "message": "Loud noise!",
   "created_utc": 1693897101,
   "score": 95,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7at6b",
   "message": "Trying to be cool and get attention, especially with people whom i am not close to. Now i just wish to be peaceful",
   "created_utc": 1693897846,
   "score": 52,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7efru",
   "message": "Everything needing an app. Why can't I just use this perfectly fine browser?",
   "created_utc": 1693900713,
   "score": 47,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77dc0",
   "message": "People",
   "created_utc": 1693895272,
   "score": 27,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7fq5o",
   "message": "Social Media, specifically Instagram. I realise how much time I wasted worrying about how people perceive me and my interest and experiences.",
   "created_utc": 1693901778,
   "score": 38,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7f442",
   "message": "Hangovers",
   "created_utc": 1693901269,
   "score": 129,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7bgpu",
   "message": "Work.  At this point I’d rather not do it lol",
   "created_utc": 1693898352,
   "score": 206,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7dn08",
   "message": "Traveling, but not seeing the sites or any of that. I mean the actual transition from one location to another.\n\n\nI did a few trips in my 20s where I'd be finding all different ways to save money and go to as many places as possible - overnight buses, sleepless nights, budget airlines, etc. Last trip was 4 years ago at 29 and haven't traveled because of the pandemic. \n\nRecently did my first trip since then and all the \"transition\" stuff between countries really got me tired - early rides to airports, immigration, customs, security, waiting at the gate, budget airlines that charge for *everything*, waiting for the plane door to open so I can finally get off...\n\n\nNext time I'm just doing one country and flying an airline that will at least give me water.",
   "created_utc": 1693900063,
   "score": 19,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz783vk",
   "message": "I'm 62.  Working has lost its color.",
   "created_utc": 1693895817,
   "score": 120,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7bdxn",
   "message": "Children screaming for no reason and loud noises really frustrate me.",
   "created_utc": 1693898294,
   "score": 190,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz78h9w",
   "message": "The ibuprofen expense line on my budget.\n\nEta: thanks for all the concern about my liver and gut, but it was basically a joke. In reality I only take modest doses for occasional acute pain.",
   "created_utc": 1693896095,
   "score": 40,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7ci3h",
   "message": "Responsibility.\n\nHonestly i'd rather be a kid/young adult and having to deal with very little. Now i'm responsible for my family, work, income, bills, house, chores, insurances, parenting etc.... and it doesn't get any less, seems like there's just more being piled on.",
   "created_utc": 1693899157,
   "score": 219,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77icc",
   "message": "Meeting new people.",
   "created_utc": 1693895376,
   "score": 150,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7d2p7",
   "message": "Cars driving through the neighborhood fast. \n\nLike slow the f**k down, people are trying to live in here!\n\nJust 10 years ago I was one of those drivers...",
   "created_utc": 1693899611,
   "score": 6,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7ajgb",
   "message": "People and work",
   "created_utc": 1693897640,
   "score": 233,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7d3lq",
   "message": "Gossip. I never enjoyed it, but being around grown adults who speculate to over compensate for whatever insecurity is insanity.",
   "created_utc": 1693899631,
   "score": 236,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7k6hd",
   "message": "Always being tired and getting up in the morning. I really took the amount of sleep I got when I was younger for granted.",
   "created_utc": 1693905366,
   "score": 183,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7fmyy",
   "message": "Fashion. Or trends.\n\nThe older I get and the more I see trends coming back over and over I realize how dumb it all is. Wear a style that works for you and don’t change your whole fucking personality and life because some paid influencer proclaimed -thing- is now in.\n\nI saw influencers hail crop tops as the best thing ever. Making tiktoks than they can only be taken from them over their corpse… and then never wear any again.",
   "created_utc": 1693901706,
   "score": 221,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7gu4y",
   "message": "Food chains on every corner. As a kid I loved Panera, chipotle, Starbucks, etc but I’ve grown so tired of traveling the country and finding the same stuff in every city. I live in an area with massive growth and I swear 80% are chains.",
   "created_utc": 1693902673,
   "score": 122,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77n5n",
   "message": "Teenagers, they become more and more repulsive",
   "created_utc": 1693895476,
   "score": 208,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7cd0a",
   "message": "Television programs.\n\nI've become so picky I barely watch anything.",
   "created_utc": 1693899047,
   "score": 122,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7h54t",
   "message": "Children that seem to shout like they are dying when infact they are just playing... Like why do they screech so much I don't remember anyone acting like that when I was younger.",
   "created_utc": 1693902923,
   "score": 135,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7fjzb",
   "message": "myself especially my younger self.\n\nToday morning I thought \"Today is going to be a great day\" and now its about 2 pm here and I feel like slapping that naive bastard from earlier today.",
   "created_utc": 1693901637,
   "score": 3,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7ezs0",
   "message": "Unnecessary or excessive noise",
   "created_utc": 1693901172,
   "score": 106,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7j354",
   "message": "Tech… 32 now and I couldn’t give a shit about catching up on the new phones etc… when my current phone dies I’m getting whatever the best phone under £200 is at that time… aint no way I’m paying close to £1k on a phone these days just to watch YouTube and ignore messages/calls.",
   "created_utc": 1693904492,
   "score": 83,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7fewf",
   "message": "leaving the house",
   "created_utc": 1693901518,
   "score": 64,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7btjc",
   "message": "I am so fucking sick of people bitching and whining about shit that will NEVER effect their lives. I'm so sick of people who are just malicious and shitty because they can be. I'm so sick of the FAKE OFFENDEDNESS that everybody seems to have these days.  \n\n\n\"I FIND THAT OFFENSIVE!!\"  \n\n\nFuck off. You do not. You just want something to bitch over to fill in the empty space in your hollow, sad existence. Those two gay twinks sharing a banana-split at the beach are NOT your problem.",
   "created_utc": 1693898622,
   "score": 11,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz79u6r",
   "message": "That I still have to work on past trauma. Like it’s such a waste of time for me that I have to “fix” myself because someone else was too lazy to raise another human mature enough to not cause harm on another person. Like, such a waste of time in general that people constantly have to heal from each other. I’ll never figure out why we are wired to be like this. I know it’s so John Lennon but it would just be amazing to be free without a worry and be able to be in the company of people unbothered by each other just staying true to their own shit. \nIt’s mind boggling that people will choose friendships/ relationship based on wether we can agree on almost everything or not, or that me not having the same view as someone else would be offensive to anyone (unless it’s crime related and something that would hurt another human being of course), but I mean. Why aren’t we rooted enough in ourselves to never take anything personally, because we had to endure some broken human being along the way. I hate the phrase that what doesn’t kill you makes you stronger. I don’t know. Thanks for letting me vent.",
   "created_utc": 1693897114,
   "score": 147,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7g52q",
   "message": "Celebrity worship.",
   "created_utc": 1693902108,
   "score": 105,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7bjfs",
   "message": "People.",
   "created_utc": 1693898409,
   "score": 126,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7giaz",
   "message": "Gatekeeping and elitism, especially in music. I used to do it myself, and when I see people do it now I'm disgusted that I ever sounded like that.",
   "created_utc": 1693902404,
   "score": 80,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7gu6b",
   "message": "Drinking",
   "created_utc": 1693902674,
   "score": 60,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz79194",
   "message": "[removed]",
   "created_utc": 1693896515,
   "score": 32,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7ft6k",
   "message": "Being too open in public like on social media. I have already met multiple people who was too open about their feelings that others started using it against them. I also know a public figure in our country that basically has her life an \"open book\" that even those small things they do on lunch is shared on social media. I have nothing against that is that is what a person prefers but I am constantly seeing people starting to use personal things against her and her family.\n\nThere is this constant reminder that often crosses my feed saying that the less you share about your life the less haters and idiots can use against you.",
   "created_utc": 1693901848,
   "score": 96,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7iloq",
   "message": "Getting older.\n\nLittle me wanted to be an adult so bad. Now I wish I could go back to being a kid again. \n\nI miss not having crippling debt and not having any bills to pay.",
   "created_utc": 1693904103,
   "score": 94,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77v5j",
   "message": "Tv. It used to have content , now it's all reality shows and teen drama.",
   "created_utc": 1693895641,
   "score": 223,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7hgno",
   "message": "Drinking\n\nAs a former binge drinker who turned 30 this year, I can't stand waking up with a hangover and having Several days of that fuzzy feeling in your head after a big session.\n\nAlso can't stand other drunk people in general, the mess they make (litter, vomit etc), the shouting, the fights and all the grief that goes with it. \n\nI'm not completely teetotal but I never have more than 3 pints at the absolute most when I am out. And even then that's only a handful of times a year nowadays.",
   "created_utc": 1693903182,
   "score": 26,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7hh1s",
   "message": "People talking loudly on the phone - like dude, you're next to the mic!",
   "created_utc": 1693903191,
   "score": 125,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7hoxu",
   "message": "Big cities. As a teenager I wanted to live in a big city close to everything and wanted to be rich and famous. I'm still very young but I'm starting to get more and more comfortable with the idea of slow living and small towns",
   "created_utc": 1693903369,
   "score": 217,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7jnpf",
   "message": "Ads. On the radio, tv or youtube doesn't matter. It went from slight annoyance to anger over the years. Just the whole manipulate people to buy shit rubs me the wrong way. \n\nWhen it's pride month everyone loves the lgbt+. Except in the middle east.\n\nThen they use the blm movement and riotting because that was/is relevant. \n\nYoutube cracks down on creators who are not p.c. but have you seen the ads they allow? \n\nJust now i heard an ad on the radio for a discrete hotel to i guess cheat on your partner? (People from Belgium who listen to top radio will know what i mean).\n\nGive me normal ads for normal things that show me what the product can do and the price. No weird story to try and be funny or 'cool visual' that has nothing to do with the thing being advertised. Just get to the point and leave me alone afterwards.\n\nSorry for the rant but i really hate ads.",
   "created_utc": 1693904946,
   "score": 53,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7fac5",
   "message": "Ignorance",
   "created_utc": 1693901413,
   "score": 65,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7issh",
   "message": "Willful ignorance",
   "created_utc": 1693904265,
   "score": 128,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7gath",
   "message": "Mean people",
   "created_utc": 1693902236,
   "score": 14,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz79h55",
   "message": "Unlearned peoples opinion on how Govt works…once they open their mouths…they just complain, and drags everything down to stupid level.",
   "created_utc": 1693896838,
   "score": 135,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz79k6w",
   "message": "Teenagers",
   "created_utc": 1693896903,
   "score": 78,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7a0ky",
   "message": "Loud noises",
   "created_utc": 1693897247,
   "score": 48,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77nwy",
   "message": "Porn",
   "created_utc": 1693895492,
   "score": 130,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7pers",
   "message": "Parents who let their children run wild in public.",
   "created_utc": 1693909395,
   "score": 105,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77zcv",
   "message": "soda",
   "created_utc": 1693895726,
   "score": 15,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7etjh",
   "message": "Assholes",
   "created_utc": 1693901033,
   "score": 15,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7c17w",
   "message": "Social media.",
   "created_utc": 1693898789,
   "score": 64,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz79g8a",
   "message": "The world we live in",
   "created_utc": 1693896819,
   "score": 39,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7ef2u",
   "message": "Politicians",
   "created_utc": 1693900696,
   "score": 39,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7g7sv",
   "message": "Actually going out to do things. I would rather sit at home with some snacks and dick around online. Reddit, YouTube, Twitter, maybe watch a movie or a new series.",
   "created_utc": 1693902169,
   "score": 40,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7dbbu",
   "message": "Living (I’ve always hated it )",
   "created_utc": 1693899801,
   "score": 106,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77c4k",
   "message": "Expensive restaurants",
   "created_utc": 1693895248,
   "score": 69,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7icuu",
   "message": "Leaving the house 🏡",
   "created_utc": 1693903906,
   "score": 26,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7pz48",
   "message": "My religious culture. My religion (Islam) in itself is fine (to a certain level) but the culture I was born and raised in has become increasingly toxic as I have grown up. Maybe it’s because now that I’m becoming an actual human being with my own Thinking and ideologies I’m starting to feel this way but there are so many rules I just don’t get. Like how girls need to get married off right away, we need to cover our bodies 24/7, we shouldn’t be friends with the opposite gender etc. thanks for letting me vent",
   "created_utc": 1693909801,
   "score": 27,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz77pe2",
   "message": "Noise\nTraffic\nThe grind\nClothing",
   "created_utc": 1693895523,
   "score": 11,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7h3dz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz8lyqd",
   "message": "Generica. \n\nThe same shit strip malls and stores everywhere I go.  The same bland architecture, be it stores, or 'luxury condos'. \n\nNothing has charm and style anymore.  I could be in West Virginia or Florida or New Jersey.  Hard to tell.",
   "created_utc": 1693924384,
   "score": 254,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz88jnb",
   "message": "The vicious cycle of people treating each other poorly because someone treated them poorly in the past, so they feel the need to treat others poorly.  And so on and so on.  \n\nSo exhausting.",
   "created_utc": 1693919339,
   "score": 133,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7qpnq",
   "message": "Rude people. I work in retail and there are so many of them.",
   "created_utc": 1693910314,
   "score": 114,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz82523",
   "message": "People who are judgmental towards others having a life challenge. Life has a way of humbling us all and you never know when you’re going to go through a challenging period, need help, have a medical crisis, etc. Saying “I would never let myself get into that situation” is ignorant because shit seriously happens sometimes. We all have periods of vulnerability where we don’t make our best decisions.",
   "created_utc": 1693916726,
   "score": 114,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7ulry",
   "message": "People. I'm getting cranky and increasingly fed up with having to deal or see people who have no consideration for others, usually in public.\n\nNarrow sidewalk? Lemme just go in the very middle of it, arms outstretched to the sides, so I take the whole width.\n\nQuiet bus ride? Lemme whip out my mixtape that EVERYONE in the vehicle hears, it's so sick.\n\nShopping going nicely? What if I stand sideways with the trolley and/or my buggy/bags and block the whole aisle, because I found that one jar of pickles particularly fascinating.",
   "created_utc": 1693912839,
   "score": 82,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7hv5m",
   "message": "People literally killing themselves to live ‘the dream’ Who’s damn dream is it?",
   "created_utc": 1693903509,
   "score": 65,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7e0pe",
   "message": "Drama. Drama drama drama.",
   "created_utc": 1693900366,
   "score": 27,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7wyl7",
   "message": "The sexualizing of everything. Or maybe I’m just disliking my growing awareness of it.",
   "created_utc": 1693914197,
   "score": 41,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jzac05v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz8n8sv",
   "message": "Driving. I used to love driving. I lived for road trips. Now it's just incessant bullying, tailgating, road raging and rampant, unchecked flouting of laws, no matter where you go. Constant anxiety.",
   "created_utc": 1693924847,
   "score": 48,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz87xpe",
   "message": "Rudeness. People treating me badly and acting like I'm crazy for not liking that. Casual racism and misogyny. I don't have time for any of this crap anymore.",
   "created_utc": 1693919097,
   "score": 38,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz7ufpw",
   "message": "Being asked for my email address/to opt in to a rewards program when I just want to make a simple in-person purchase.",
   "created_utc": 1693912739,
   "score": 31,
   "submission_id": "16agdiu"
  },
  {
   "comment_id": "jz8qg3u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16agdiu"
  }
 ]
}