{
 "submission_id": "16apx1m",
 "title": "What would you name a newborn child if you really, really wanted to ruin their life, but wanted to maintain plausible deniability about having done it on purpose?",
 "selftext": "",
 "created_utc": 1693924455,
 "permalink": "/r/AskReddit/comments/16apx1m/what_would_you_name_a_newborn_child_if_you_really/",
 "score": 24,
 "url": "https://www.reddit.com/r/AskReddit/comments/16apx1m/what_would_you_name_a_newborn_child_if_you_really/",
 "comments": [
  {
   "comment_id": "jz9k38a",
   "message": "My granny is called Eileen. Little did my great grandparents know that she would contract childhood polio that left her with one leg longer than the other. I feel terrible for this, my granny is a Saint...but come on!",
   "created_utc": 1693936599,
   "score": 223,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9bt15",
   "message": "Name it “Porn”. In Thai language, it is a common name that shows up often. It means getting a good blessing. \n\nEx. If a powerful mythical creature grants you “porn” to be healthy and can recover fast, it means you have receieved a good “Porn”.",
   "created_utc": 1693933578,
   "score": 35,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8ya8c",
   "message": "i had read a story about how a woman unintentionally named her daughter after a concentration camp. she said she just liked the name and had no idea. the craziest part was that she got pretty far before anyone told her.",
   "created_utc": 1693928680,
   "score": 82,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz96kzk",
   "message": "The last name \"Dyck\" is very common in the area I live in. When I moved here in grade 8, there was an announcement over the schools PA for a \"Harry Dyck\" to report to the office. I couldn't believe what I was hearing, so probably Harry Dyck lmao",
   "created_utc": 1693931596,
   "score": 182,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9km40",
   "message": "I have a soft spot for Fontanelle.",
   "created_utc": 1693936790,
   "score": 243,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz97ad3",
   "message": "Petal, Honey or Bunny. They sound like cute names for a little girl at first, except that it's rather hard to be taken seriously years down the line when you're a full-grown adult and trying to address a boardroom of important people and your name is something like \"Petal Rose\", \"Honey Little\" or \"Bunny Walker\", making you sound like a character straight out of a Beatrix Potter novel or a Sylvanian Families toy.",
   "created_utc": 1693931861,
   "score": 179,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz970n3",
   "message": "Tony spelled Ptoughneigh",
   "created_utc": 1693931758,
   "score": 1,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9j5h9",
   "message": "Just fucking anything with stupid spelling. My kid brought a new friend around the other day and he goes \"hi, I'm declan with a k and yes, I will be saying that for the rest of my life\". I was like, funny line but also poor bugger.",
   "created_utc": 1693936256,
   "score": 166,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz99npf",
   "message": "There’s a guy here in dc shown on the news all the time. He’s like the spokesperson for the us park service so he’s on whenever there’s an event on or around the mall. \n\nAnyway his name is Mike Litorist. They don’t pronounce the t at the end like they ABSOLUTELY SHOULD more often than not. It always amuses me! \n\nNot the name you really wanted as a kid. Then you’re dealing with the press for a living? Lol\n\nEdit: his name is actually Mike litterst. They just say litoris",
   "created_utc": 1693932793,
   "score": 232,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8q9d6",
   "message": "This weekend I was doing some digging around looking at possible names for my next D\u0026amp;D character, a druid. I was looking at famous druids in stories and in history and stumbled upon the name Cumhall. The thing is, I didn't stumble upon it on a website suggesting fantasy names, it was on a website suggesting genuine baby names for your babies and had a whole paragraph on the great druid Cumhall and whatever book series he was from.\n\nSo I'm going to say Cumhall. I'd just refer back to \"my favorite book series\" as plausible deniability.\n\nBonus: Berlin. I went to high school with a girl whose name was Berlin and she fucking hated it. Not because it's a horrible name in its own right, but her last name was Wall. So her legal name was Berlin Wall. She was born in '91, her parents fucking knew what they were doing",
   "created_utc": 1693925916,
   "score": 253,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz94yjs",
   "message": "A girl I knew had a brother named Jack Zopf.",
   "created_utc": 1693931008,
   "score": 251,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz95bcw",
   "message": "My surname is king so either Jo or Mark or Wan",
   "created_utc": 1693931133,
   "score": 151,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9e73z",
   "message": "I had an art teacher in middle school whose name was Mrs. Cox. We would talk in hush tones about the potential first names she gave her son; “was it Harry!?” One day, she heard our musings and relented that she named her son “Seymour,” and that we were to end our none sense immediately.  It had the opposite effect and our giggles when she walked into the room only intensified. \n\nShe had married into the name, but I’m unsure what her maiden name is. We later found out she named her first born son Seymour after her father; an apparent tradition in the family her husband chose to honor. Unfortunate for that boy that his last name was also Cox. I imagine school was not easy for the lad.\n\nEdit: spelling, on mobile",
   "created_utc": 1693934442,
   "score": 213,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8wjl7",
   "message": "Ljót Bergljót Ljótsdóttir.\n\nEnglish translation - Ugly Rockugly Uglydaughter.\n\nThis is a perfectly valid name around here and I don't know why.\n\nIt's dying though thankfully.",
   "created_utc": 1693928084,
   "score": 29,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9ncj4",
   "message": "Knew a guy named Otto Graph. That was just weird.",
   "created_utc": 1693937804,
   "score": 168,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8oxzz",
   "message": "Chrisdoughpher as Christopher or MaughLeigh as molly",
   "created_utc": 1693925452,
   "score": 231,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz909g8",
   "message": "Ben Dover.\n\nLegitimate actual person my sister knew. \n\nHis parents were really nice people too, just PAINFULLY naive. Deeply religious types. \n\nLet us say after five years in a West London comprehensive, Ben was neither naive or religious.",
   "created_utc": 1693929345,
   "score": 134,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz96hfa",
   "message": "Gaylord.\n\nYes, this is an actual name, and it makes me depressingly sigh to think of it again.",
   "created_utc": 1693931558,
   "score": 56,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz96wkt",
   "message": "Bambi Lam, if you're reading this, sorry I kept singing Black Betty.",
   "created_utc": 1693931717,
   "score": 99,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9f3s6",
   "message": "My parents knew someone in university who called himself Dick (from Richard of course). Dick‘s last name was Trickle. My dad in particular can’t tell the story without laughing uncontrollably.\n\nI’d say that Dick Trickle gets my vote.\n\nEdit: thank you all for sharing with me the hilarious names you’ve heard. They are absolutely ridiculous. Who thinks of these names as viable options for their children?",
   "created_utc": 1693934768,
   "score": 101,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8yle4",
   "message": "X Æ A-12",
   "created_utc": 1693928784,
   "score": 109,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8pdp5",
   "message": "Syphilis. \nI had a friend who thought this was the most beautiful name, but he didn't know it was an STD 🤦",
   "created_utc": 1693925604,
   "score": 51,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz96ojv",
   "message": "Placenta.  My older sister is a nurse and she actually had a patient who named her baby girl this because she thought it sounded pretty.  I mean, how would you even shorten that into a plausible nickname?!?",
   "created_utc": 1693931633,
   "score": 32,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz94id7",
   "message": "Analeigh.  It’s the perfect curse.",
   "created_utc": 1693930849,
   "score": 234,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8xxfx",
   "message": "Adolf. Nobody recovers from that anymore",
   "created_utc": 1693928559,
   "score": 102,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz92j11",
   "message": "Latrine",
   "created_utc": 1693930135,
   "score": 191,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9b8m5",
   "message": "One that always made me chuckle was Gary Neville’s dad - Neville Neville",
   "created_utc": 1693933371,
   "score": 255,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8wnaz",
   "message": "Mike Hunt\n\n\nEric Shin\n\n\nDick Dumas\n\n\n(These are real people)",
   "created_utc": 1693928120,
   "score": 203,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9jezo",
   "message": "In high school I knew someone whose last name was \"Null\" and she crashed databases and webforms everywhere she went.  She changed her last name legally on her 18th birthday to \"knull\" so it was pronounced the same, but didn't crash things.",
   "created_utc": 1693936353,
   "score": 0,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jza8wiw",
   "message": "Macaroni.  Mac for short, even on their birth certificate. They always go by Mac, no one would ever call them Macaroni, only me and in private. Most people will assume Mac is short for Mackenzie, but Macaroni will know.  Macaroni will know every second of every day.  It will burn deep down inside.  This is how i will create a supervillian.",
   "created_utc": 1693945911,
   "score": 126,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9aloc",
   "message": "Heywood Jablome",
   "created_utc": 1693933140,
   "score": 48,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9ee59",
   "message": "I knew a Buster Hymann",
   "created_utc": 1693934514,
   "score": 255,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9kk12",
   "message": "I went to school with a girl named Summer Eve which is a douche",
   "created_utc": 1693936769,
   "score": 194,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9n8pe",
   "message": "Snith Johm\n\nHaving a surname as a first name, and first name as a surname, means people would mentally swap them.\n\n Having n  instead of m would keep getting autocorrected on computer forms and causing hell for paper work.\n\nBoth you can blame on typos when completing the birth certificate.",
   "created_utc": 1693937765,
   "score": 187,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8x0yd",
   "message": "Amy Schumer already did this - “Gene Attel Fischer” so Genital Fissure… which is a skin tear on your genitals. She claims to not have realized but doubt it.",
   "created_utc": 1693928250,
   "score": 200,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz90cmw",
   "message": "Anakin",
   "created_utc": 1693929375,
   "score": 163,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz921ae",
   "message": "Knew a kid names Holden iscoc",
   "created_utc": 1693929960,
   "score": 139,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9726l",
   "message": "Had a friend in middle school that said she wanted to name her future daughter Lizard and call her Liz for short, so that when people assume it stands for Elizabeth or something the child could correct them that it’s short for Lizard🥲",
   "created_utc": 1693931775,
   "score": 84,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8nhuu",
   "message": "Shazam, pronounced “Shuh-ZAM.” Really stress that last syllable.\n\nLittle Prince would be a close second.",
   "created_utc": 1693924937,
   "score": 138,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9bwwe",
   "message": "1. Birdynn\n2. Leesfayvrit\n3. Axydent\n4. Mystaike\n5. Hooreyoo\n\nThank you to TikTok",
   "created_utc": 1693933616,
   "score": 214,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz92zwr",
   "message": "Karen\n\nI don't think I need to elaborate further",
   "created_utc": 1693930306,
   "score": 195,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz98j88",
   "message": "New Hampshire had a representative named Dick Swett in the mid 90's.",
   "created_utc": 1693932357,
   "score": 125,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9trpu",
   "message": "Knew a guy in college who's last name was Raper. Then legally changed it to Rader.  Why he waited so long was bizarre.",
   "created_utc": 1693940257,
   "score": 30,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz8zit2",
   "message": "The great cornhollio",
   "created_utc": 1693929096,
   "score": 157,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jzad47h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jzaagy1",
   "message": "My husband's last name is Artz. I joke that we should name a baby boy Marshal.",
   "created_utc": 1693946470,
   "score": 139,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jz9x3xb",
   "message": "In 2006, a  local couple named their son Adolf  Hitler.  The authorities took the child away in 2010 .",
   "created_utc": 1693941588,
   "score": 128,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jzaksf5",
   "message": "I think I could ruin my son's life by naming him T'Challa. I am not black.",
   "created_utc": 1693950207,
   "score": 46,
   "submission_id": "16apx1m"
  },
  {
   "comment_id": "jza4ac7",
   "message": "Well with the surname Beale… batmo is the most valid option",
   "created_utc": 1693944238,
   "score": 42,
   "submission_id": "16apx1m"
  }
 ]
}