{
 "submission_id": "16arwzg",
 "title": "People who slept past noon on 9/11. What was waking up like?",
 "selftext": "",
 "created_utc": 1693929183,
 "permalink": "/r/AskReddit/comments/16arwzg/people_who_slept_past_noon_on_911_what_was_waking/",
 "score": 185,
 "url": "https://www.reddit.com/r/AskReddit/comments/16arwzg/people_who_slept_past_noon_on_911_what_was_waking/",
 "comments": [
  {
   "comment_id": "jz9bjwv",
   "message": "I was in Las Vegas for a trade show.  Parties with co-workers until about 3am pacific time and rolled into bed maybe an hour before the first plane struck.   I woke up about 7:30am expecting to do a hungover shift at the show … turned on the morning news… and spent about 15 minutes rubbing my eyes and trying to absorb the images of smoke-filled lower Manhattan.   Went to the lobby to meet my co-workers in order to process it all and saw the strangest thing - \n\nAbout 50% of the people were standing around stunned by the news.  The other 50% had been in the insular, clock-free, newsless bubble of the casino all night and we’re still partying hard.  \n\nOddest moment of my life.",
   "created_utc": 1693933486,
   "score": 2,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9cxpl",
   "message": "Did anyone see the documentary Voices From the Towers? There was one guy who worked night shift, and his brother kept ringing him, so he either turned his phone off or on silent and went back to sleep. When he woke up he checked his messages, to see what was soooo important that his brother wouldn't stop disturbing him, when he knew he was on night shift and slept during the day.\n\nIt was a message saying that the stairwell below brother's office was blown out and it didn't look like brother was going to be able to get out of the WTC, so goodbye and I love you.",
   "created_utc": 1693933989,
   "score": 29,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz94s46",
   "message": "I worked the graveyard shift the night before. Woke up at noon (Miami), jumped in the shower and went back to work. When I got to work, it was closed. I was furious no one had notified me that our afternoon meeting was cancelled. Keep in mind I still had no idea about what had happened in NYC that morning. Went back home to email my boss to complain about the cancelled meeting without notifying me. Got home, opened my laptop to a popular news site and there was a picture of people running away from the towers…looked like something you would see on a National Enquirer magazine cover. I then went over and turned on the TV just in time to see an instant replay of one of the planes hitting the towers…by that time it was 1:30 pm. I sat in front of the TV the rest of the day in disbelief.",
   "created_utc": 1693930945,
   "score": 36,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9ad6w",
   "message": "I have the perspective of being a kid in east africa at the time, I had just gotten out of school at about 3pm ish with no prior knowledge of what was happening. My entire family was glued to their TV and I think the 2nd plane had hit at this point, I remember my uncle explaining to me that people had intentionally flown a plane into the towers. I was 8 years old and naive and I remember my first immediate thought was: how did the perpetrators pull this off without killing themselves? I had no concept of a suicide attack.  \n\n\nNo other memories from that day but my uncle told me I essentially lost interest and went to play video games, it just didn't feel real to me.",
   "created_utc": 1693933053,
   "score": 250,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz93u70",
   "message": "Only semi related story I know of is from an old roommate.\n\nHe fell asleep with the TV on and woke up right as the 2nd tower got hit.\n\nTook him several minutes to realize what was going on.",
   "created_utc": 1693930610,
   "score": 218,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz93vbr",
   "message": "My wife works nights, sleeps days. Woke up about 2PM to phone messages from all the kids (adults) And from me - multiple messages from me. I was at work. First thing she did upon awakening was call me, before turning on the tv. I just told her - \"turn on the TV and then call me back\". She was astounded to say the least, then spent the rest of the afternoon calling the kids. \n\nQuick side note: Had a friend who was in the air heading from UK to USA. Mid-flight they got a message from the pilot simply saying no flights are being allowed in or out of the USA so they were diverting to the Toronto. No reason why was given - she was thinking \"Did we have a nuclear accident - or even nuclear war. What on earth could cause all flights to be diverted?\" She had kids in Chicago and a husband waiting for her in the USA. This was so unprecedented the terrorism aspect never occurred to her. Very frightening times for all concerned. Eventually got a rental car (shared with strangers) and made it safely home nearly one day late.",
   "created_utc": 1693930622,
   "score": 226,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz94i50",
   "message": "My wife worked for 7:00 PM to 7:00 AM every day.\n\nso she was asleep when it happened. I went and woke her up to tell her.\n\nshe said (in a sleepy, tired, groggy voice) \"OK, tell me about it later when I get up.\"",
   "created_utc": 1693930847,
   "score": 20,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz8zsvr",
   "message": "I was a kid in middle school in Brooklyn, so I kinda went through it and saw it all with my eyes. \n\nBut I was watching a documentary about it and everyone was like “I woke up at 6am” and the towers were gone by 10… so I’m wondering what the world was like waking up to if you slept in that day.",
   "created_utc": 1693929190,
   "score": 74,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9i7d2",
   "message": "Millennial here. I was a freshman in high school. We had a double block on Tuesday mornings, and a break in between. My friend and I went to the cafeteria for bagels and those little cream cheese packets. We got back to the classroom and her twin brother told us a plane hit the first tower. He was/is a dick and would make a joke like that. The teacher had turned on the tv in class and we realized he wasn’t joking. The rest of the day we went from class to class, watching the news reports. I remember my last class, the teacher had an adult son that worked in NYC and she spent all day trying to get in touch with him but couldn’t.\n\nA lot of things from that day I will never forget, but one particularly stands out.\n\nI went to a regional high school. The school district called for early dismissals at all schools. We were the first ones on the busses. They told us not to say anything to the younger kids and freak them out - let their parents explain it to them. I sat on the bus for ~45 mins, filled with children from 6-18, and no one said a word.\n\nNot a single sound. You could hear a pin drop.\n\nSitting in that seat, in total silence, made me truly understand the seriousness of the situation and I knew the way I saw the world and my country was forever changed. And it all happened in the time it took to go the cafeteria and back.",
   "created_utc": 1693935904,
   "score": 96,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9d04g",
   "message": "I did.  I worked in Building 5 of the World Trade Center. I had had a dentist appointment the day before in the same building and just didn’t feel like going to work.  Realized my work would pile up if I don’t go in. But decided against going in cause I just don’t feel like it. Called up my manager and told him I was taking a personal day and went back to sleep.  \n\nOnce we were together again in a new temp building he told me about as soon as we hung up, the first plane hit.  I was renting a room in West New York also known as “Bergen Line.”  My landlady was surprised when I casually walked into the kitchen. She thought I had gone to work and was so happy to see me.  Old school Cuban woman. Didn’t live with my cell phone like I did so when she showed me the news on the tv, my stomach fell in to my ass.  \n\nI ran and got dressed. I had AT\u0026amp;T at the time and of course the lines were not working unless you had Verizon. I couldn’t get a hold of anyone. I walked from 72nd St and Park all the way to the beginnings of  The Heights in Jersey and fell into my fairy godmother’s arms. She called herself The Original Latin from Manhattan. \n\nI spent days at her house just waiting to hear news of my coworkers because the time the planes hit was the time we would normally go out onto the mezzanine to get breakfast or go out into the streets to get food.  \n\nMy mother was not in the U.S. and thought I had died.  Luckily for us, no one was lost at Morgan Stanley that day. The worst that happens was the side of our building looked like it had been put into a shredder.  \n\nBecause I was asleep, I feel that I did not experience the same terror as others.  I was able to stay home until managers reached out and told us when to come back to work and how we would get there and where we would be. When I started to ride the PATH train and the lights blinked out, I did not understand the fear of the strange woman sitting next to me who grabbed my hand.  \n\nBut in the days after, I learned fear. It was something to constantly hear helicopters and strange vessels flying so close overhead. And to see armed military at the entrances of train stations and waking around underground armed. This would be our new normal for a long time.  I didn’t go near the site until it was completely demolished.  And when I finally did. I just stood there and cried.",
   "created_utc": 1693934013,
   "score": 52,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9s9qk",
   "message": "So, not exactly the title but I have a wild story about this.\n\nI live in France, but most of my family is in the US. My mom's cousin, a middle eastern woman in her 40s, worked in tower 2. Her sister, two years younger, worked in a building maybe 50 meters away with windows facing the towers.\n\nWhen it happened, I was at school and way too young to understand anything. I just remember my mom picking me up from school, in a panic, and her and my dad watching TV. I have other memories from a while after when my mom tried to explain to me what had happened but I was 5 years old at the time so, yeah, no distinct memories.\n\n*I learned the following story throughout the years:*\n\nWhen it happened, my whole family thought that our cousin was in tower 2 working. No one had any news from her, and her little sister literally watched everything unfold from her office windows in real time, thinking her sister was being killed in this attack in front of her. Phones lines were not working, so for at least a week, the whole close and extended family thought that our cousin had died in the attacks. Both elderly parents living in NYC witnessing the whole thing, and of course her sister.\n\nA week later, we heard from her. The morning before 9/11, her office sent her on an unplanned business trip to London. It was very last minute so she didn't have time to warn anyone, and once in London when she heard about the attacks she couldn't tell anyone she was okay because of the phone lines not working.\n\nI went to my first trip to NYC when I was 9 years old. Here, I got to understand how deeply this attack had affected America. Our cousin who worked in tower 2 lost all of her co workers that day. She doesn't talk about them, she doesn't talk about the events too much, except from the solidarity between New York citizens that happened the following days and weeks. \n\nHer sister took us to her office, near Ground Zero, and we were able to see what she meant by \"windows facing WTC\". There was literally a glass wall with a perfect clear view of, well, the crater. Mind you, it was four years after the attacks, but there was still some very visible damages. She took us there through security and everything so we'd be able to see how it really was. She, also, never spoke of her own trauma regarding that day, but only mentioned how Manhattan was flooded by people in the streets who had no where to go, people living in Jersey stuck in the city because all the bridges and tunnels were closed, and how locals were opening their doors to anyone who needed a shelter.\n\nA year later I moved to NYC for a few months, living with our cousin above (not the one working in tower 2). One night we had over for diner our upstairs neighbor, who dreamed of having French *crêpes* and we were delighted to make some for her. After she left, our cousin quietly let us know that her husband had been a passenger in the flight directed towards the White House, that crashed in Pennsylvania, and he had left her a voice message on her phone during the flight telling her what was happening and saying goodbye.\n\nAll of these stories just made me extra sensitive to this topic. I read books about it, so many of them, watched all the documentaries, but I still have troubles comprehending everything that happened. It still seems surreal. I visited years later the new museum they did and the memorial, and couldn't stop from sobbing all the way through.",
   "created_utc": 1693939652,
   "score": 153,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz965rm",
   "message": "I was actually asleep until about 10 that morning (Central time, so 11 in New York) since I worked second-shift hours at the time.\n\nMade myself breakfast and got in my car to go to a class I was taking. I had my radio on in the car, mostly for background noise, and I kind of started registering that there was something dramatic going on. But still I was mostly tuning it out.\n\nUntil the reporter said the words, \"Where the Twin Towers *were*\", and I was jolted to attention. I specifically remember thinking she had misspoken when she used the past tense.\n\nThen I got to class and found out what was going on. Not much learning was done in class that day.",
   "created_utc": 1693931437,
   "score": 12,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz95cr9",
   "message": "I got up right around noon and promptly showered and went to run to the store. I was driving to the grocery. My first inkling anything was wrong was I kept passing gas stations with cars all lined up back to the road. I was just like huh, wonder what that's about. Got my groceries and went back home and there was a message on my answering machine saying \"Dude, did you hear? We're at war!\".",
   "created_utc": 1693931146,
   "score": 129,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz94h48",
   "message": "I have a slightly different perspective. I was 20 years old at the time, and had just moved to Paris 12 days before 9/11 from New York.\n\nMy day was almost over, I was about to go to the store to buy the new Bob Dylan album that had been released that day, when a person told me that a plane hit the world trade center. He told me to take the metro along with some of my classmates to the apartment of the Director of the program, which was all the way across the city, but to try to act natural, since there would be people on the train who had no idea what had happened, and we didn’t want to cause a panic.\n\nWe were going to her apartment because she had a television that could get CNN. I stood on the train, silent for a half hour with these other people I knew.  One of the girls was trying, not to freak out, because her father was a Ukrainian diplomat at the UN.  We got to the apartment a few minutes before the tower fell, we saw it live on TV all the way from France in the mid afternoon.\n\nWe couldn’t get phone calls through to the United States for hours, and that one girl was so scared for her dad. Plus others among us had parents and family who lived and worked in New York City, of course.  So I had a brilliant idea to make the situation, more tolerable, which was to open this lady‘s wine cabinet and start pouring everyone glasses. We all got shitfaced, watching our city get destroyed from across the ocean.",
   "created_utc": 1693930836,
   "score": 153,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9hpca",
   "message": "I wasn’t asleep, but I was on a hike in the woods with no phone so had no idea.  When we were walking back to our car at about noon when a truck driver pulled up and said  “Did you hear what happened?”  And told us.  Went home and turned on the TV to total chaos.   It was pretty surreal.",
   "created_utc": 1693935716,
   "score": 81,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9ivd2",
   "message": "I was woken up by my (ex) wife shortly before the second plane hit (I worked nights). Followed shortly after by my phone ringing from my command telling me to pack my seabag and get into deployable status. I had just home from deployment a month prior.",
   "created_utc": 1693936152,
   "score": 83,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz972f4",
   "message": "I was asleep in my room, and I woke up to my mom banging on my door crying and I VERY clearly remember her saying \"we're going to war.\" I stumbled out to the living room  to see  my family standing/sitting/kneeling with their eyes glued to the TV. it was a surreal experience because we all somehow knew what it meant even though we really had no idea what the fuck was going on.",
   "created_utc": 1693931778,
   "score": 95,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9yt0y",
   "message": "I was sick with a cold and high on NyQuil. I was woken up by a huge bang that I assumed was related to the street paving going on outside. Only much later, after I had gotten out of bed and was semi-coherent, did I realize it was the plane hitting the pentagon less than a mile from where I lived.",
   "created_utc": 1693942222,
   "score": 140,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9ii50",
   "message": "It was a different time back in 2001, you could literally go hours without knowing about national news.",
   "created_utc": 1693936016,
   "score": 63,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9lvhc",
   "message": "Somewhat related story, I had been in New York City for two weeks before 9/11 hit. I immediately called my father to tell him I was OK I said where’s mom he said mom still sleeping This was 10:00 AM by now. My father went and told my mother the exact quote “ I want you to know that xxx is fine. I spoke to her on the phone. Something really, very, terribly. bad has happened but I wanted you to hear it from me first”.",
   "created_utc": 1693937257,
   "score": 68,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9c5gj",
   "message": "My parents were hippy dippy San Francisco home schoolers who had put their tv in storage so we would all be kids who read and played in nature. I remember waking up probably around 9am, walking into the kitchen to get breakfast and my mom telling me that the World Trade Center had gone down. I had never been to New York and had no idea what the world trader center was so I remember my immediate childlike reaction being like “okay, I’m going to go get some cereal.” I remember realizing how serious it was because my dad came home from work hours early and carried the tv in from the garage, and put the little antennas with the foil on them so we could watch the news live. And then we just watched the news live for days. Flight 93 was originally supposed to land in my hometown, and several of the other flights were also heading to California, and I remember my parents calling everyone they knew who traveled for work to make sure they were safe. No one I personally knew was on the flights, but extended family of people I knew were. It such a surreal day in my memory of waking up to a changed world and slowly realizing it over the course of the day.",
   "created_utc": 1693933702,
   "score": 53,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9cgav",
   "message": "It was during my freshmen year of college.  I had an outdoor lab for four hours that morning.  There were murmurs on my professor’s AM radio of a ‘small plane’ striking one of the towers before we left the lab and did our outdoor sampling thing for 4hrs in some secluded woods.\n\nMe and my classmate were walking back to the dorms around noon after we finished up.  None of us in the lab had any idea about what had happened.  We found it really odd and unsettling that literally no one was outside during that walk.  Beautiful sunny day and for a college of 5k students we maybe saw five people out walking around and they looked….off.\n\nWhen we got to our dorm and entered the hallway of my floor I’ll never forget how literally every single door was open, but with a lot of empty rooms with sporadic rooms filled with people.  Popped in the first room with people to see footage of the second tower falling after the fact.  Complete shock, definitely a time-slowing-down moment.",
   "created_utc": 1693933811,
   "score": 236,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9lfg9",
   "message": "I worked a weird shift. 5 pm til 4 am. My wife worked normal hours so usually I would stay up and play video games til she got up at 6 and then make her breakfast and talk or we would never see each other. So, she went to work and I went to bed. I woke up to her shaking me awake saying \"Babe, get up, we've been attacked.\" I was half out of it and said groggily \"[her company's name] has been attacked?\" I was thinking maybe hackers or something. She said \"No! We've been attacked. The Twin Towers are on the ground.\" \n\nI was immediately awake.",
   "created_utc": 1693937092,
   "score": 52,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz942se",
   "message": "I woke up around 9:45 in Queens that day. Saw the report, heard sirens. Smelled like an electrical fire for weeks after.",
   "created_utc": 1693930695,
   "score": 120,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9j8zt",
   "message": "I was in college and we had an answering machine where you could hear the message being left. \n\nI woke up to my sister crying on my answering machine, telling me my dad was ok. This was probably 9 or 10... So not noon.\n\nI was like WTF... I think I called my dad and he was like uh, turn on the TV... \n\nMy dad occasionally had to go to the Pentagon, and happened to be driving to DCA around the time the plane flew into the Pentagon. He wasn't flying out though. He was in NYC the day before, and because of weather took the train from NYC to DC, and was going to DCA to get his car.",
   "created_utc": 1693936292,
   "score": 84,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9ivdc",
   "message": "It wasn't quite noon, but both towers had fallen by the time I woke up. I was in college, but all of my classes were later in the day, so I usually stayed up late. I was sleeping and the phone rang, but I ignored it and went back to bed. After about the 3rd time ringing I decided it might be be important so I got up and answered and it was my sister who was freaking out saying the US was under attack and that the World Trade Center was gone.\n\nI immediately turned on the news and watched right up until it was time to go to class. We still had classes that day because the school leadership said something like \"we aren't going to bow down to terrorists\" or something like that. We got to class, but the teacher ended up taking us down to an area with TVs to watch the news anyway.",
   "created_utc": 1693936152,
   "score": 45,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9mddt",
   "message": "This is always such a weird story for me. I was 18 and in college but living at home. I didn’t have class that day and at that time most nights I would be up until like 5AM and sleep til 2PM. \n\nMy mom came running into my room screaming and crying that the world trade center was attacked. Because this had happened previously and my Mom can be pretty dramatic at times, I had no idea the gravity of the situation. I rolled over and went back to sleep.\n\nI woke up at 2PM to see my family watching the crashes on loop and crying. I felt equal parts mortified and embarrassed.",
   "created_utc": 1693937443,
   "score": 33,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9mnrc",
   "message": "I was working a split graveyard shift and 6pm-2am at the airport, and Tuesday was my day off. I didn't set an alarm. I got woken up around 9:30 am (11 Eastern) by my phone and I let it go to the answering machine. It was my mom, and she was telling me about what was happening. What I find funny now was she ended it with a \"so, you know, might want to turn on the TV or something\".",
   "created_utc": 1693937550,
   "score": 37,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9r55y",
   "message": "It was my sophomore year of college. I didn’t have an early class so I slept in that day. When I woke up, my roommate was gone to class and I just sort of made coffee and got my things together for my class later on. Our landline dorm phone was blinking red that we had a message, so I listened to it and it was my roommate’s mother.            \n\nIn an extremely calm and almost “removed” voice, she said: “Hey Brian, it’s your mother. I was just calling to see if you and FabulousCallsIAnswer are alright, I hadn’t heard from you this morning so you are probably in class. I just wanted to see if you guys were OK and if you saw the terrorist attacks in New York. Call me later, bye.”          \n\nWhat is this woman talking about? Clicked on the TV, and I saw only one tower still standing. I wasn’t sure what I was looking at. I had missed both planes hitting and the first tower collapse. My brain kept trying to process what I was seeing and how one of the Twin Towers had seemingly vanished when I saw the second tower collapse in real time and the reporters on whatever station were just freaking out.           \n\nI picked up my phone and saw missed calls from most of my friends, but weirdly neither one of my parents had called (I found out later they were both late to the news coverage as well, distracted by work or errands.) I watched the recap of what happened on the news, and over the next hour or so the true horror of what occurred  (and even an inkling of what would occur) slowly dawned on me.            \n\nAnd in my opinion, we still haven’t truly recovered from that day. It just destroyed the whole timeline.",
   "created_utc": 1693939212,
   "score": 39,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jza1a22",
   "message": "I was working overnights and was sleeping.  Woke up around 10:30 as I could hear the TV on and hear newscasters the whole time, and my wife never watched the news.  She was home with our new born, and would occasionally watch trash like Oprah or Ellen.\n\nI could just barely hear a male talking sombrely, so I got up to check out what was on.  I just sat there and watched, and thought what kind of world did I bring my son into.\n\nThat was the moment we (Gen-Xer’s and older Millennials) lost our innocence.  The sun set forever on those positive vibes from the 1990’s on that day.",
   "created_utc": 1693943142,
   "score": 38,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz96738",
   "message": "I was definitely sleeping in, my friend used to call me every afternoon to wake me and coax me to go hang out. \n\nThat day, I got the call but when I answers it was \"AHHH WAKE UP! THE WORLD IS ENDING! PLANES ARE CRASHING INTO BUILDINGS!\"",
   "created_utc": 1693931451,
   "score": 127,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz977nk",
   "message": "I had worked the entire night prior and went to sleep around 6:30am.  Woke up to my dad calling me freaking out saying we were being invaded.   Was surreal watching it all after the fact.  Sat on the couch watching the news the whole day after that.",
   "created_utc": 1693931833,
   "score": 30,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9h887",
   "message": "I slept until 10am in Texas. I turned on the TV just after the 2nd tower fell.  I saw the huge wave of dust spreading thru the city and for a few minutes I thought NYC had been hit with a nuclear bomb.",
   "created_utc": 1693935539,
   "score": 31,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9ophf",
   "message": "I worked in the financial district of NYC, mere blocks from the attacks. As irony would have it, I worked until 2am that morning, so I was asleep when everything had happened.\n\nSince everyone was trying to reach me (my partner at the time worked in Manhattan as well, so he not only witnessed it, my family and his were trying to either let me know he was okay or trying to find out if he was okay…just surreal), my phone was ringing off the hook so it woke me up. It was so confusing that when I would hang up, another call would come in, then another etc. and all I could make out was “someone bombed the World Trade Center, which I drove past in a car service at 2am, not even 8 hours ago.”\n\nI was coming down with a cold, so I planned on sleeping in, and going into the office in the afternoon (we had a global support desk, so that was perfectly fine). I didn’t find out if my coworkers were all right till later (they all were and got out of the city safely)\n\nI still feel so…detached when I see all the footage. Because by the time I had gotten up, turned on the news to figure out what exactly had happened, the entire world changed.",
   "created_utc": 1693938306,
   "score": 32,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9zmxb",
   "message": "An increasing number of Reddit users weren't even alive yet on 9/11(/2001).",
   "created_utc": 1693942533,
   "score": 32,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz989eg",
   "message": "I was staying with my new in-laws. As I came out of the guest room and walked to the bathroom, my mother-in-law was all agitated about the news of a plane crashing into the WTC. She didn't mention it was an airliner. I thought it was a small plane.\n\nI thought, \"Huh. Plane crash. Probably some idiot being stupid while site-seeing in his Cessna. What a bad place to crash. Sucks for that dude.\"\n\nAnd then I took a shower. Didn't think a whole lot of it.\n\nWhen I came out of the shower, I learned a second plan had hit the towers. And that was the oh shit moment.",
   "created_utc": 1693932246,
   "score": 91,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9boea",
   "message": "I was in college, and my roommate woke me up around 10AM because my sister called the apartment. It went something like:\n\nSis:  JRAA78 mom wants you out of the city!!\n\nMe:  Huh, what, why? \n\nSis:  where have you been, we're under attack!!!!  We've been trying to reach you for an hour.   \n\nI wasn't in NY.  We had a landline house phone, everyone was calling everyone so you couldn't get through anywhere, just busy signals for hours. \n\nMe: uh, I'll call you back. \n\nI walk into the living room and see the smoldering remains of the buildings on TV.\n\nMe to my roommate: What's going on???\n\nRoommate:  Planes flew into the world trade center and they fell. \n\nMe:  where is this, here? \n\nRoommate: no new york. \n\nMe:  Roommate, when the country is under attack, for fucks sake wake me up. \n\nRoommate:  but I heard your g/f leave at like 5AM.  I figured you were tired. \n\nMe:  ok, but seriously next time just wake me. \n\n\nThen we continued to watch the news for like a week straight.",
   "created_utc": 1693933531,
   "score": 98,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9hh1u",
   "message": "I didn’t sleep in late, but it was the most amazing thing I have ever seen. I’m British, I was ten years old at the time. I remember it was a Tuesday, as my mother worked on Tuesday’s in those days, and so my grandmother came to pick my sister and I, up from Primary School. I was old enough to walk home without parental supervision by then, and was messing about with friends, so I got home slightly later at 15:15 GMT. When I got home, my grandmother was talking in a really serious tone, and I thought at first I was about to be told off for doing something wrong. I then asked my grandmother what’s wrong, and she pointed at the TV, and said something bad’s happened in America, the BBC news was on, and she said a plane has flown into a building in New York. My first thought was, was it an accident, but my grandmother said no, they are saying it is terrorists and there has been two planes. I think by then the first tower had already come down, and the Pentagon had been hit, but the North Tower was still up. There was also a ‘fourth’ plane hijacked somewhere. My next thought was that I hope the firefighters can get in there, in time to get everybody out. There was smoke everywhere, it looked like a film, people were running around crazily, and you could see people were jumping out of the windows of the North Tower, in desperation, constant sirens, but then at what must have been 15:28 GMT or 10:18 in New York, the North Tower started(well minutes before) the balls of flames were getting bigger and there were visible gaps in the building, with huge chunks of debris falling off. The North Tower started buckling, and you could tell it was giving way, audible screaming, I think the news guys were saying, ‘it’s gonna go, it’s gonna go or something. Then it collapsed almost vertically into dust. My sister, grandmother, and I saw that live. It was unbelievable, the silence after that, with the sirens still going on, to call it eerie would be an understatement. \n\nThe Pre-9/11 vibe was a completely different world, the ‘old world’ if you like. It was so strange, having grown up watching American culture.\n\nWhen I realised it was terrorists, I immediately understood that it was a symbolic attack on the USA, meaning we hate your culture, we want to destroy it, America is an enemy, that has too much control and needs to be attacked.",
   "created_utc": 1693935631,
   "score": 76,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9iz7l",
   "message": "I was still sleeping when a friend called me panicking and just kept yelling that they're attacking the United States. Coincidentally they had just started construction on my street near my house so my groggy brain was sure we were being bombed. It was a confusing few minutes for sure.",
   "created_utc": 1693936191,
   "score": 25,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9tw33",
   "message": "We were on a boat in Russia. It was strange getting a lot of sympathy from the Russians and the government. They were lovely. The Russians. Not the government.way back then.",
   "created_utc": 1693940308,
   "score": 27,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9gdxu",
   "message": "Slept through the first plane then my grandma ran in when the 2nd hit and said we’re being attacked. She was born in 1922 so I took it seriously then.",
   "created_utc": 1693935236,
   "score": 79,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9b9o3",
   "message": "I had some buddies that were backpacking that week.  Picked them up the following Sunday.  They did not believe me when I explained it in the car, and had to put on news radio to back myself up.",
   "created_utc": 1693933381,
   "score": 43,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9iy6o",
   "message": "It’s trippy to listen to music and watch tv programmes which came out about 6 months before and up to 9/11. It really brings you back to that time, and the way it felt back then, before that event happened. It was definitely still the ‘90’s’\nalbeit the end of it, and at the time nothing was wrong, a real optimistic vibe.\n\nWhereas in 2002 it’s a new era.",
   "created_utc": 1693936180,
   "score": 47,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9ndpn",
   "message": "My aunt and uncle were avid backpackers and were 3 days into a 10 day hike through the Yosemite backcountry during 9/11. They learned of it from a tv l at a random gas station somewhere on the 395 a week after the attack. I remembered her just being so confused and calling my dad in a frantic as she assumed he was going to be swept off to war (he was a naval officer at the time).",
   "created_utc": 1693937816,
   "score": 19,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz95dg4",
   "message": "I didn't sleep past noon but I remember waking up, groggy to John Stewart crying. All channels appeared to have lost it, their nerves and sense of stoicism. It was a shock for me at 13 to see the everyone just completely broken down.",
   "created_utc": 1693931153,
   "score": 55,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9phse",
   "message": "Not me, but my dad. He worked third shift at the time and school decided to cancel all after school activities and my dad always slept until around 1 PM so I gave him a call from the payphones at school right at 1 PM. He asked what was wrong and I said football practice was cancelled but we were going to the park to have our own practice instead. He again asked why and it hadn't hit me that he didn't know. I told him that two jets had hit the WTC buildings and they were gone, another plane hit the Pentagon and another crashed in a field. He said there is no way, stop making stuff up and I said that would be the most unbelievable series of events to make up, just turn on a TV. \n\n\n\nHe finally turned on the TV and just said \"holy shit\". About a half hour later he got the call to come back into work at 7 PM to work 12 hour shifts until further notice. He worked as a firefighter / paramedic at a plant that had a bunch of DoD contracts and they wanted all security officers and firefighters to be on hand just in case something happened.",
   "created_utc": 1693938598,
   "score": 16,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jzab87h",
   "message": "Kind of related- A friends dad was on a fishing trip in Canada where they had to be flown in. 100% off the grid. They were supposed to be picked up on 9/11 but all flights were grounded. The pilot finally shows up two days later and they are livid since they were running out of food and thought they were stranded. Pilot explains what happened and all was forgiven. That would make a hell of a movie.",
   "created_utc": 1693946738,
   "score": 16,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9i5ry",
   "message": "I was working nights and stationed in Hawaii.  The time difference is 6 hours between NY and HI.  My wife was on her way to work and called me about the planes hitting the towers around 6am. I was woken earlier and didn’t process it well.  About 5 min later I turned on the news to the mayhem.  I was watching it for about 10 mins and got a phone call from base to return to base immediately.  That drive/day was crazy and I will never forget the feelings I had diving to base.  The front gate was backed up for miles and miles and it took well over a hour to get on with all the extra security things going on.",
   "created_utc": 1693935886,
   "score": 15,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz951qu",
   "message": "I live in Canada on the west coast I remember this day clearly and it affected us Canadians as well",
   "created_utc": 1693931039,
   "score": 26,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz97t5e",
   "message": "I didn’t sleep in past 10am but instead was getting ready for school. I am on the west coast and remember the news was always on in the mornings. We watched the news about the first tower being hit and thought it was an accident. Then the second plane hit on live tv. I didn’t want to go to school but my mom was adamant that I still go. She is an immigrant who came from a war-torn country and this event didn’t seem like a huge deal for her. I got to school and my 1st period teacher had the tv on and that’s when WTC 2 collapsed. Our school shut down and all parents were immediately informed to pick their kids up.",
   "created_utc": 1693932065,
   "score": 30,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9q4zl",
   "message": "My brother worked as a barman in New York at the time and of course slept all day. He woke up to a million missed calls and texts from ‘we were just wondering if you’re okay’ to ‘Will you just pick up the phone you Bollox your mother is out of her mind with worry’. Funny looking back now but far from it at the time.",
   "created_utc": 1693938837,
   "score": 14,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz94g7z",
   "message": "I was a freshman in college, I absolutely slept till like 11am ish, I remember someone on the elevator in my dorm telling me about the first plane hitting the tower. I skipped class to go to the Union and watch news on the TV, I had not even processed what one plane hitting the tower meant, when the second one hit. I just remembered thinking, this is bad. That is an understatement, I know. But I realized right then, we are going to war. I don't know what news stories were important at the time, but nothing else mattered anymore.",
   "created_utc": 1693930828,
   "score": 37,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9krl7",
   "message": "I woke up at 9:30 pacific time in my parents house alone. I was in a high school PM program at the time and I was 16. I didn’t have a cell phone and none of my afternoon school friends were on AIM. It was a very strange experience to watch the footage over and over in a house by myself. It very much felt like it was the start of a war but it also felt like a fever dream being alone and disconnected.",
   "created_utc": 1693936847,
   "score": 12,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz94q1q",
   "message": "Not noon, but 9:30am central.\n\nAs I arrived at work, the guy on the radio said they were cutting away because of two huge fires in New York.\n\nThen the co host said something about “…yeah and there’s not a cloud in the sky”\n\nI was on autopilot ironically enough and didn’t quite clue into two planes hitting the towers.\n\nAll I heard was something about a plane crash and then the statement about not a cloud in the sky.\n\nI really didn’t get it right away and wasn’t too alarmed.\n\nIt really sunk in when I got to my desk though and people we’re talking and it slowly dawned on me what probably happened.\n\nGot the obligatory email from the CEO an hour later or so later about having work to do. \n\nI went back home and never saw the collapse of the towers because I was still working at the time. I think I left right after the second one collapsed - can’t remember to specifically.\n\nSeeing things on TV later that day made it all too real. Depressed for a good long three weeks.",
   "created_utc": 1693930925,
   "score": 24,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9ycp0",
   "message": "I was a junior in college. I had a tiny apartment in midtown manhattan and that day was the one day of the week I didn't have early classes. I got up at 10am, got ready and went to take the subway downtown, completely oblivious to the mess that was already happening in the streets around me.\nWhen I got to the station there was an MTA guy standing there saying: \"no trains!\". I asked him if there was another train going downtown and he replied: \"nobody's going downtown. Everybody's going uptown.\" I gave up and started walking. \"I'll figure it out as I get closer downtown\", I thought. For some reason my mind completely ignored the insane traffic, the people standing outside cars to listen to the radio, the people walking uptown all shocked and covered in ash, the sense of shock and emergency all around.... \nThen I got to 5th avenue, to a spot that can see all the way down to to the WTC. And there it was: instead of the familiar two towers was the biggest pillar of smoke I have ever seen in my life. And then it hit me. Like in the movies when the character realizes the big twist. All the bits and pieces of words and information and images that were around me made the most horrifyig sense.\nI ended up walking all the way to campus, only to sit with everyone in the common room and watch it on tv. \n\nOn the way back home, a few hours later, I walked on broadway and when I got near the Empire State building, I started hearing the sound of a jet airplane approaching. By then we knew all air traffic was halted, so this was strange. The sound got really loud really fast. Everyone on the street started running away from the empire state building, fearing it could be another target. Then I looked up, only to see an F15 military jet zoom down broadway at low altitude and crazy speed. Like a michael bay film. \nWent home, turned on the tv and lit a joint. \nIt was by far the most surreal day I have ever experienced.",
   "created_utc": 1693942052,
   "score": 26,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9cu0o",
   "message": "I lived on the west coast, and had a “no tv before school” rule. I put my kids on the bus, made coffee, turned on the news just in time to watch the second tower collapse on live tv.",
   "created_utc": 1693933951,
   "score": 11,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9eu3m",
   "message": "I thought I had woken up to an April Fools joke ngl",
   "created_utc": 1693934671,
   "score": 11,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9jmtn",
   "message": "So, I didn't wake up past noon. I was actually in Sydney, Australia at the time (I'm American). I was visiting there with my father. We were staying in a youth hostel in Sydney, and our flight was supposed to leave the next morning. So, I don't remember the exact time, but it was sometime in the middle of the night that my dad woke me up and said, \"You have to come see this.\" Half asleep, I remember watching the news in one of the common areas with people from all over the world. It was really surreal. They would say how sorry they were to us. It was hard to grasp the gravity of it while being so far away. \n\nThe next few days were crazy. We couldn't get a phone call to our family through. Our flight was delayed and supposed to leave earlier, so our family didn't know for sure if that was our flight or not. They were freaking out trying to get a hold of us as well. We did finally get through to them, and after that my dad spent basically every waking hour talking to whoever he could to get us on a flight home while I spent all my remaining money playing Counter Strike and StarCraft in internet cafes. Due to his persistence, I believe we were on the first commercial flight from Sydney to the US after 9/11.",
   "created_utc": 1693936434,
   "score": 11,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9l7a5",
   "message": "Now imagine what it would be like today with social media",
   "created_utc": 1693937008,
   "score": 11,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jz9o16t",
   "message": "My brother was woken up by our father. He knocked on the door, opened it up and told him planes had flown into the twin towers and that the buildings collapsed. He went right back to sleep. He thought our dad was being stupid. He woke up hours later and saw it was real.",
   "created_utc": 1693938058,
   "score": 11,
   "submission_id": "16arwzg"
  },
  {
   "comment_id": "jzb83cg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16arwzg"
  }
 ]
}