{
 "submission_id": "16b0qeq",
 "title": "Which brand are you actually loyal to and why?",
 "selftext": "",
 "created_utc": 1693949139,
 "permalink": "/r/AskReddit/comments/16b0qeq/which_brand_are_you_actually_loyal_to_and_why/",
 "score": 100,
 "url": "https://www.reddit.com/r/AskReddit/comments/16b0qeq/which_brand_are_you_actually_loyal_to_and_why/",
 "comments": [
  {
   "comment_id": "jzaubvj",
   "message": "Costco. They do an amazing job vetting vendors. They may not have a lot of selection, but what they have, is almost always amazing. And if it isn’t, their return policy is amazing.",
   "created_utc": 1693953847,
   "score": 128,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzavt9r",
   "message": "Dawn dishwashing liquid cuts through grease like crazy.  Mix it equal parts with white vinegar for an excellent bath rub soap scum remover.",
   "created_utc": 1693954434,
   "score": 47,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzap5aj",
   "message": "Scrub Daddy makes one hell of a sponge.",
   "created_utc": 1693951836,
   "score": 147,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaurhw",
   "message": "Anker: power banks, phone cables, and the like. I have yet to see one of their phone cables fail.",
   "created_utc": 1693954019,
   "score": 123,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzawb9w",
   "message": "Charmin. Specifically the Ultra Soft toilet paper because my butt deserves nothing less than the best.",
   "created_utc": 1693954633,
   "score": 113,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzas46w",
   "message": "Brother Printers, especially the laser variant. It just keeps working and there is no cartridge nonsense like *that other brand*.\n\nI would recommend it to everyone, always. Nobody ever has issues with them.",
   "created_utc": 1693952976,
   "score": 226,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzakcg9",
   "message": "Toyota... affordable and reliable cars",
   "created_utc": 1693950043,
   "score": 114,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzazj3f",
   "message": "Aldi. They were there for me when I was broke and currently keep me from going broke with grocery prices these days. Some of their brands are superior in my opinion eg. salsa.",
   "created_utc": 1693955931,
   "score": 202,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb99l9",
   "message": "Ain’t no cream cheese like Philadelphia cream cheese.",
   "created_utc": 1693959907,
   "score": 105,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzai91z",
   "message": "Audio Technica, never owned headphones that have the same price/quality as those made by them",
   "created_utc": 1693949271,
   "score": 167,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzay3lk",
   "message": "Tide. Smells lovely and clean.",
   "created_utc": 1693955353,
   "score": 28,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbalg5",
   "message": "Fiskars. Everything they do is top quality. That brand is like a national treasure to Finnish people. They do plenty of products with metal and plastic and pretty much everyone around here has had a pair of Fiskars scissors for up to 20 years. Sure, their products are more expensive but they're made to work and last for an eternity.\n\nEdit: after writing this I checked wikipedia and apparently Fiskars is one of the oldest companies in the world! It was founded in 1649!",
   "created_utc": 1693960462,
   "score": 25,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb205d",
   "message": "Heinz Ketchup. Not Hunts, nor Red Gold, especially not Sir Kensington",
   "created_utc": 1693956929,
   "score": 146,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaujpt",
   "message": "Costco. It's not too expensive of a membership, and you get some great savings on gas (pretty big here in California) and buy in bulk items. Of course, I probably buy a bit more than I need to for my family, but the 3 month hassle-free return policy is very generous. It's kind of a game changer for expensive devices like laptops since we can always return them if they suddenly break within the first few weeks or were defective.\n\nNot to mention the $1.50 hot dogs, average but affordable clothes (esp. socks \u0026amp; underwear), and Costco Travel isn't half bad with some of the discounts when it comes to rental car \u0026amp; hotel packages. Sure there's cheaper ways to get stuff out there, but, generally speaking, Costco delivers pretty good value for the price.",
   "created_utc": 1693953932,
   "score": 81,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaohdi",
   "message": "Honda. Their cars are dependable and look a little cooler (to me) than Toyotas. That’s with the exception of the trucks. Honda trucks look dumb. \n\nHonda also tends to recall stuff that other car manufacturers wouldn’t. I had the condenser replaced on my Civic a few months ago when the A/C stopped working. Would’ve been $3k to fix, but Honda had a recall and all I had to pay for was the labor.",
   "created_utc": 1693951581,
   "score": 6,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzasalt",
   "message": "Sennheiser, Logitech. Good quality products.",
   "created_utc": 1693953045,
   "score": 75,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb08bg",
   "message": "Bounty paper towels. I’ve tried all the brands, as Bounty is not cheap. IMO they are the best and I’m fine being loyal to the brand.",
   "created_utc": 1693956209,
   "score": 21,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaurdj",
   "message": "Doritos. My body's carbon atoms are probably 50% from Nacho cheese powder.",
   "created_utc": 1693954017,
   "score": 123,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb2pab",
   "message": "Q-Tips.\n\nEvery other cotton swab is inferior, and I think I've tried them all. Either there isn't enough cotton, or the stick is too flimsy. Only Q-tips get it right.",
   "created_utc": 1693957214,
   "score": 18,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzayi9x",
   "message": "Patagonia. Quality products and environmentally / socially responsible.",
   "created_utc": 1693955518,
   "score": 139,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaj6mt",
   "message": "Dickies and because I've been wearing them since I was a teenager.",
   "created_utc": 1693949618,
   "score": 74,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzahyr3",
   "message": "Sybian machines. There's nothing better.",
   "created_utc": 1693949167,
   "score": 95,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzat2s4",
   "message": "Anker.  Great warranty and customer service.",
   "created_utc": 1693953353,
   "score": 42,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzawkg7",
   "message": "I swear DeWalt power tools.\n\nNon battery operated I don't give a shit. Usually I get husky but I'll buy whatever is available.\n\nI got into DeWalt because it's what my dad used and growing up its what all the pros used. From DeWalt to Catapillar heavy machines, yellow has always been synonymous with professional construction equipment to me.\n\nFrankly any of the major three brands will serve you fine. Makita, Milwaukee, or DeWalt are good quality tools if you avoid their entry level lines (tho maybe for a DIY project this is fine, but Ryobi is also something to consider).\n\nOnce you're in a battery system tho you're kind of locked to it as the batteries are generally not cheap.\n\nDeWalt has one of the better battery warranty replacements I've seen. 3 years, no questions asked replacement in the US. Most of the time they don't even ask for the bad battery.",
   "created_utc": 1693954736,
   "score": 30,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzakhyh",
   "message": "Dukes Mayo, Its just the best mayonaise there is.",
   "created_utc": 1693950099,
   "score": 81,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzavj6c",
   "message": "Victorinox - cuz Swiss Army knives rock, and they make great watches too. Add top-notch customer service, and they've made me a happy customer for life.",
   "created_utc": 1693954324,
   "score": 36,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb9mho",
   "message": "Hidden Valley ranch dressing, French's yellow mustard, and Heinz ketchup. I will do without if one of those brands is not available for those products. Nothing else is remotely close.",
   "created_utc": 1693960056,
   "score": 12,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzapmt2",
   "message": "Titleist. \n\nLots of good golf balls out there, but there's only one pro v1.",
   "created_utc": 1693952022,
   "score": 49,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzat11j",
   "message": "Mazda - Hasn’t let me down yet.",
   "created_utc": 1693953334,
   "score": 50,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbaghc",
   "message": "Subaru, because they're reliable, and I want lesbians to think I'm cool.",
   "created_utc": 1693960404,
   "score": 47,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzamksk",
   "message": "Polar Seltzer. Nothing but LaCroix competes, but they're sort of their own thing.",
   "created_utc": 1693950866,
   "score": 34,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzauu96",
   "message": "American eagle. They have jeans that best suits me than any other brand.",
   "created_utc": 1693954049,
   "score": 37,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzasco0",
   "message": "Dr Pepper.",
   "created_utc": 1693953067,
   "score": 48,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaucbt",
   "message": "Dukes Mayonnaise and Brooks Running Shoes \n\nOne tastes good and the other feels good on my feet.",
   "created_utc": 1693953852,
   "score": 20,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzax9ab",
   "message": "Red Wing Boots, specifically USA made. I'm rough on my shoes, and typically wear the same pair several days per week until they wear out eventually. Bought a secondhand pair almost two years ago, and I wear them most days out of the week. Still in fantastic shape. I can step in a deep puddle of water and won't get so much as a couple of drops on the inside. \n\nCharvel guitars. I've never played a bad Charvel from any period of time, and they're 100% the best value for your money. DK24's all blow any modern Fender out of the water QC-wise, and ironically they're owned by Fender. \n\nFinally, Kewpie mayo. Yes, the one with the baby. Best mayo on the planet.",
   "created_utc": 1693955014,
   "score": 21,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb73q6",
   "message": "Tide detergent. We used Tide growing up. I tried all the various cheaper brands when I was a young adult, and they just didn't do the job Tide does. I do add half a cup of Oxiclean with Tide for stubborn stains in white loads when necessary.",
   "created_utc": 1693959011,
   "score": 17,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzau8tn",
   "message": "Tamiya Model kits/supplies. \n\nThey make insanely good stuff",
   "created_utc": 1693953813,
   "score": 7,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb4k4x",
   "message": "Ponds cold cream",
   "created_utc": 1693957970,
   "score": 8,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzas7pg",
   "message": "Rickenbacker guitars. Still family owned and they never upscaled production to meet demand because they didn’t want to sacrifice on QC. Obviously things still slip through the cracks occasionally but I’ve never had a problem with one that came from the factory that way.",
   "created_utc": 1693953014,
   "score": 22,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb167b",
   "message": "ThinkPad. Even their worst laptops are still pretty darn good. \n\nThe reason I like them so much is because even when they buckle to trends in the industry, they do it better. When they stopped using their godly classic 10 row keyboard they moved on to the best chiclet style keyboard on the market. When the market started pushing ultra thin and light laptops, they made those but also kept selling port rich thick laptops. \n\nEven when they got rid of the actual buttons for the track point the touchpad was still really good, and when they saw everyone get pissed about it they switched back.",
   "created_utc": 1693956592,
   "score": 22,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzazb1d",
   "message": "It’s not really up to me but I have very wide feet so the only decent looking shoe brand I can wear is new balance",
   "created_utc": 1693955842,
   "score": 7,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb2ylf",
   "message": "Merrell. I love their jungle mocs. Everyone calls me a grandpa at 17 bc of those shoes, but I love them",
   "created_utc": 1693957319,
   "score": 8,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbesk8",
   "message": "Osprey. Super comfortable hiking backpacks, and their lifetime warranty is actually legit. They will repair or replace *any* damage or defect for any reason on any model ever made.",
   "created_utc": 1693962183,
   "score": 8,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaq8ei",
   "message": "Arizona iced tea.  Everything 99 cents.",
   "created_utc": 1693952250,
   "score": 31,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb95ys",
   "message": "Carharrt. Fits great, well made.",
   "created_utc": 1693959864,
   "score": 11,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb5irx",
   "message": "Ibanez.  For 33 years or so, I've found their mid-high range of instruments pretty much the best bang for the buck out there.  It only got better in recent years, too.  They blow everybody out of the water.  I play bass and guitar, and in order to get something that's really worth it better than Ibanez's $1200-$1800 price range, you are shelling out $3500+ easy for boutique level stuff.  Often, even their 600$ basses range are pretty good, especially if you just throw aftermarket electronics in them.",
   "created_utc": 1693958361,
   "score": 5,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb6m0s",
   "message": "Subaru. My outback just does everything I need it too. Plus they are inexpensive for what you get",
   "created_utc": 1693958810,
   "score": 6,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzatfmg",
   "message": "Valve Software.\n\nTheir own games may be so-so nowadays, but Steam is the patron saint of the PC gaming world.\n\nWhich is why this ongoing class-action suit against them infuriates me.",
   "created_utc": 1693953494,
   "score": 22,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb5auv",
   "message": "Tampax.   Removing only the string is terrifying.",
   "created_utc": 1693958272,
   "score": 5,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbbb0i",
   "message": "Frequent work traveler and points collector \n\nI only fly United, only rent hertz, and only stay Marriott",
   "created_utc": 1693960753,
   "score": 6,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbbhue",
   "message": "Amex",
   "created_utc": 1693960833,
   "score": 8,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzax25s",
   "message": "Paul Reed Smith. Quality control is second to none.",
   "created_utc": 1693954933,
   "score": 12,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzam73f",
   "message": "bought some \"Earfun\" bluetooth earbuds as cheap throwaways for a trip and they've been some of my most reliable kit. only bought another pair to have as a spare and for when these need recharging. then got a family member one of their higher end models as a gift and they love them.\n\nnot an audiophile recommendation, but as someone who's owned a lot of cheap headphones over the years since that first cassette walkman, these sound as good as any tiny form factor set I've used. (of course nothing compares to full sized cans.)",
   "created_utc": 1693950724,
   "score": 4,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzavntg",
   "message": "Altra. Foot health is more important than most people realize. They are the most comfortable hiking/running shoes I've ever worn in my life (and I've tried a lot).",
   "created_utc": 1693954373,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb0a2j",
   "message": "Fender. Reliable quality, legendary sound, never looks out of place.",
   "created_utc": 1693956228,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb1epp",
   "message": "Call of Duty. It was an important part of my childhood gaming life, so I just buy it every year out of tradition even if there is no campaign or the multiplayer will be shit. It's symbolic.",
   "created_utc": 1693956685,
   "score": 4,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbo2iz",
   "message": "Trader Joe’s. I’ll complain about them from time to time for sure, but I’m always going back for something specific when I’m bored",
   "created_utc": 1693965992,
   "score": 1,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzax849",
   "message": "Nintendo. I just couldn’t get into other gaming systems. I started with the original and just waiting for the prices on the switch to go down so I can own every one of their systems.",
   "created_utc": 1693955001,
   "score": 13,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaxod0",
   "message": "Asics shoes, just hold up super well compared to other shoes I've had",
   "created_utc": 1693955181,
   "score": 14,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzazspe",
   "message": "Discount Tire.  Helped me out in a few flat tire jams.",
   "created_utc": 1693956038,
   "score": 7,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzal8ro",
   "message": "IKEA furniture. I'm Swedish. And cheap.\n\nPBR. It's pretty much the only beer I like. (It's not considered whitetrash here in Sweden)\n\nOld Spice. I only use their gel-sticks, I love that there are so many nice smells to choose from.",
   "created_utc": 1693950376,
   "score": 23,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb2mdo",
   "message": "L.L. Bean and Sperry. LL Bean has clothing that will last you a lifetime and a wonderful replacement warranty should something happen to your clothes like a seam popping. And if you're not looking at their fashion shoes, Sperry footwear is incredibly durable. I have owned 3 pairs of the traditional leather Topsiders and 4 pairs of rubber boots that have all served me extremely well. I'm super hard on my shoes and clothes since I'm a sailor, so the fact that LL Bean and Sperry have managed to get my repeat business is a testament to their quality and durability.",
   "created_utc": 1693957180,
   "score": 8,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzausdc",
   "message": "Old Spice cuz I've been using it all my life and have no reason to change.",
   "created_utc": 1693954029,
   "score": 6,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb83q4",
   "message": "Bud Light.  Because it makes hateful stupid people angry.",
   "created_utc": 1693959423,
   "score": 7,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzaycmc",
   "message": "Been using Logitech mouse and keyboards for arouns 15 years and except for g103 mouse everything still works. I had to replace a mouse cable once. They do durable schick design and i always feel safe because of the positive stories i hear about their customer service",
   "created_utc": 1693955455,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb0ptf",
   "message": "Not much. I’ll usually just get whatever for pretty much anything.\n\nI don’t drink a lot of pop but when I do it’s Coke. I guess that.",
   "created_utc": 1693956407,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb0w43",
   "message": "Dawn Powerwash\n\nAnker",
   "created_utc": 1693956478,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb42jq",
   "message": "Barbasol and Zippo. They don’t seem to change much but haven’t lowered quality. And they’ve been around for a while.",
   "created_utc": 1693957773,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb8km5",
   "message": "Bic Lighters-all others are junk.",
   "created_utc": 1693959618,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzb997p",
   "message": "Chobani. I like the yogurt, it has less sugar than other brands, and they're good to their employees.",
   "created_utc": 1693959902,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbbdqa",
   "message": "Asics athletic shoes. I have a high arch and they've always been supportive, even the cheap ones.",
   "created_utc": 1693960786,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbd5yk",
   "message": "Ol' Roy dog food. It may not be the best on the market, but the Vitamin K it contains is the ONLY reason my Boxer survived being poisoned with D-Con.",
   "created_utc": 1693961521,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbdlmj",
   "message": "Dukes Mayonnaise. Nothing else comes close.",
   "created_utc": 1693961697,
   "score": 3,
   "submission_id": "16b0qeq"
  },
  {
   "comment_id": "jzbmui3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16b0qeq"
  }
 ]
}