{
 "submission_id": "16b132p",
 "title": "What brand did you stop buying why?",
 "selftext": "",
 "created_utc": 1693949892,
 "permalink": "/r/AskReddit/comments/16b132p/what_brand_did_you_stop_buying_why/",
 "score": 57,
 "url": "https://www.reddit.com/r/AskReddit/comments/16b132p/what_brand_did_you_stop_buying_why/",
 "comments": [
  {
   "comment_id": "jzash38",
   "message": "Nestle.",
   "created_utc": 1693953116,
   "score": 127,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzanjol",
   "message": "BP. They polluted the Gulf of Mexico. It's still leaking.",
   "created_utc": 1693951226,
   "score": 98,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb6tri",
   "message": "Nutella because they unnecessarily use palm oil. I use Kirkland brand chocolate hazelnut spread now, which uses sunflower oil.",
   "created_utc": 1693958898,
   "score": 85,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb9wpx",
   "message": "Ticketmaster. They charge too much. Anyone who uses that service deserves to pay whatever they're charging.",
   "created_utc": 1693960175,
   "score": 85,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzammw2",
   "message": "I try my best to avoid Nestle products but it’s ridiculously hard with them owning so much.",
   "created_utc": 1693950888,
   "score": 110,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzate84",
   "message": "All the fast food places Yum Inc has destroyed.",
   "created_utc": 1693953479,
   "score": 44,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb238q",
   "message": "I stopped buying Apple products for a petty reason.\n\nI learned that your \"purchased\" music is really a lease.\n\nHad an album purchased for 5 years, and it was gone one day, when I went to go re download it.  \nCalled Apple, and they said because the licensing for the music had renewed, I would have to buy it again.\n\nSwitched to an Android and never looked back.\n\nAt this point that was 8 years ago.",
   "created_utc": 1693956964,
   "score": 135,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb264z",
   "message": "Up \u0026amp; Up, Target's current in house brand.  \n\nWhatever their in house brand prior to being rebranded as Up \u0026amp; Up was, it was pretty good, a solid generic.  Up \u0026amp; Up got slapped on packaging and suddenly the quality dropped dramatically.\n\nI'm much pickier about my Kirkland brand items (Costco in house) than I used to be, they changed maybe 5 - 10 years ago (but their toilet paper was always terrible).",
   "created_utc": 1693956996,
   "score": 15,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzal498",
   "message": "Nike. None of their clothes or shoes fit me.",
   "created_utc": 1693950329,
   "score": 32,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb5g83",
   "message": "Anything by Nestle. They are the most soulless and evil corporation there is. \n\nPlease don't give them money.",
   "created_utc": 1693958333,
   "score": 36,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb94pj",
   "message": "Lululemon. Paid about 100 bucks for leggings only to have them pill after 5 washes!",
   "created_utc": 1693959849,
   "score": 12,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbar2k",
   "message": "Nike because of their unethical use of Uyghur slave labor.",
   "created_utc": 1693960527,
   "score": 24,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb6hsm",
   "message": "MacDonalds\nKFC\nBurger King\n\nBad quality food, prefer to be hungry",
   "created_utc": 1693958762,
   "score": 11,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbclim",
   "message": "Trojan - after the vasectomy",
   "created_utc": 1693961290,
   "score": 11,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzaz238",
   "message": "LG. Had a smart phone with an obvious manufacturing flaw and they refused to repair it. I sent it to their repair center in Texas 9 times. They eventually offered to give me a cash settlement if I signed a non disclosure. I told them to fuck off. I'll never buy anything LG again.",
   "created_utc": 1693955743,
   "score": 18,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb83lt",
   "message": "GM.  My wife needed a new car back in 2014, so we went and bought one there.  I had worked there for about a year and knew the salesmen, so I threw them some business and got a decent deal on a Cruze.  About a year later I needed another car, so I went and bought a sonic for myself.\n\nAbout two years in, and like clockwork shit started breaking.  Her water pump broke, got it fixed.  The next month, my water pump broke, got it fixed.  The next month, her AC pump broke, we got it fixed.  The next month my AC pump broke, got it fixed.  Her o2 sensors went bad, we had it fixed.  Next month my o2 sensors went bad, we had it fixed. Her fuel pump; my fuel pump; her stereo; my stereo.  Coolant leak; coolant leak. It was fucking uncanny.\n\nAs soon as we got them to a baseline where it seemed like they weren't in the shop for a while, we got rid of those fuckers.  And I'm pretty sure they both had a head gasket leak or a cracked head when we got rid of them too.\n\nFuck GM.",
   "created_utc": 1693959421,
   "score": 16,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzamz8d",
   "message": "Lurpack. Because one tub is £7.50 \n\nPrice of butter is actually a disgrace",
   "created_utc": 1693951015,
   "score": 9,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb6c50",
   "message": "TP-Link. They collected user data without telling the users, then sold the data to 3rd parties. Not only did I stop buying their products, I ripped their crap out of my network.",
   "created_utc": 1693958698,
   "score": 8,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzba7kr",
   "message": "Pantene.  They used to have a great moisturizing shampoo but they switched to one that made my hair feel like straw.",
   "created_utc": 1693960301,
   "score": 8,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzanwct",
   "message": "Nokia. I can't anymore",
   "created_utc": 1693951358,
   "score": 8,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzaxj1p",
   "message": "Pedigree. Makes my dog lose his balance when walking or sitting and pukes everytime.",
   "created_utc": 1693955121,
   "score": 7,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb7x7z",
   "message": "Duluth.  I used to love their stuff, but it's all gotten so expensive and the materials are thinner now.  I guess I can thank it for making me pick up a new hobby, sewing my own stuff.",
   "created_utc": 1693959349,
   "score": 6,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb8ptl",
   "message": "Levi's\n\nUsed to buy them for work pants. \nThey fall apart too fast.\nCarhartt last way longer.",
   "created_utc": 1693959677,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb9cl5",
   "message": "Nike, crap gear",
   "created_utc": 1693959942,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbp2lj",
   "message": "Goya. Seeing that little twerp kid of Trump’s posing with a can of beans in the midst of a pandemic really pissed me off. Also, piss poor product, so it’s easy to cut out.",
   "created_utc": 1693966410,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzavegh",
   "message": "FUBU, turns out I wasn’t “us”.",
   "created_utc": 1693954272,
   "score": 19,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbbmz1",
   "message": "Kotex. Gave me an infection. Use the menstrual cup.",
   "created_utc": 1693960893,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb2jy7",
   "message": "I daily drive android and Apple(for work) phones. I loathe apple products. having worked with them in an enterprise setting, I can't stand the brand. It's all \"it just works\" marketing, but in practice... Sure it does... After you deal with three layers of \"support\" just to use the damn things and hassling with multiple accounts. In our business environment with several thousand devices and hardware from client to network. The apple stuff is always the biggest headache. My former director of technology loved the stuff, daily drive apple everything and would put it into our business. Now that I'm the director, slowly phasing them out.",
   "created_utc": 1693957153,
   "score": 26,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzamug5",
   "message": "IKEA. Moved to Ireland and there is just *one* store on this entire island and sadly it's not close to me.",
   "created_utc": 1693950965,
   "score": 13,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb48o6",
   "message": "Amazon because I refuse to give Bezos my money, and Anastasia Beverly Hills makeup because early on in the war she posted something supporting/glorifying Putin. Fuck that shit.",
   "created_utc": 1693957842,
   "score": 12,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzaoscw",
   "message": "Pixel doesn't make small phones anymore.",
   "created_utc": 1693951695,
   "score": 12,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb9kay",
   "message": "most of them, because money.",
   "created_utc": 1693960030,
   "score": 4,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzapdra",
   "message": "Apple.  Samsung makes better alternatives.",
   "created_utc": 1693951926,
   "score": 39,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzauz42",
   "message": "Levis.  They set the standard for denim jeans but nowadays the quality isn't what it used to be.",
   "created_utc": 1693954103,
   "score": 11,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb210z",
   "message": "Angel soft, toilet paper, because it hurt my butt",
   "created_utc": 1693956939,
   "score": 6,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb465p",
   "message": "Papa John's... it really did suxk, but after his proclamation, sealed the deal.",
   "created_utc": 1693957814,
   "score": 8,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzapz9g",
   "message": "Gymshark because they’re shitty quality. Not worth the money.",
   "created_utc": 1693952153,
   "score": 6,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzaoetb",
   "message": "Adis",
   "created_utc": 1693951553,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzazamy",
   "message": "O’Charley’s\n\nThey were basically slightly nicer than Applebees as a chain, and they were my favorite as a kid. \n\nThis restaurant is the worst fall from Grace I’ve seen due to COVID. They’re food became inedible. Now, they closed almost all of them in my area. Suddenly too.",
   "created_utc": 1693955838,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzazqg6",
   "message": "Caterpillar boots. Sizing has gone all off, just not as comfortable as they used to be.",
   "created_utc": 1693956013,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzazwuf",
   "message": "Cadbury chocolate. \n\nWhittakers all the way!",
   "created_utc": 1693956083,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb51wu",
   "message": "Neutrogena. It made my face break out into a painful rash and swell. Never again!",
   "created_utc": 1693958171,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbf2r4",
   "message": "Old Navy, they’re not a savings if the clothes fall apart after a couple of washes. \n\nFord \u0026amp; Chrysler vehicles had a couple of each and they were really unreliable.",
   "created_utc": 1693962300,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbf9xq",
   "message": "hollister, i used have some hoodies like 3-4 years ago, and now i just see a bunch of 6th and 7th graders wearing it",
   "created_utc": 1693962380,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbgqwv",
   "message": "Jimmy Johns and all the companies owned by Inspire brands. \n\nSince they were bought out the quality dropped so bad I can’t eat there anymore. I looked at who the owners owned and said yup, everywhere they own that I’ve been to is shit.",
   "created_utc": 1693962981,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbimgy",
   "message": "Fitbit. The watches fell apart just after warranty expired and the customer service was awful.",
   "created_utc": 1693963748,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbjfs2",
   "message": "Budweiser",
   "created_utc": 1693964094,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbkum8",
   "message": "Hobby Lobby. \n\n1. Their homophobia and trying to block rights to healthcare/birth control under their benefit plan. \n\n2. Their selfish and asinine claim that their business was essential because they sold fabric for mask-making during the early months of the pandemic. Their stores have a very small fabric section, and most if it was not mask quality. (I have no idea if it is now because I won't buy from them.)\n\n3. Their [antiquities purchase fiasco](https://www.pbs.org/newshour/world/stolen-mesopotamian-tablet-acquired-by-hobby-lobby-finally-going-back-to-iraq). Claiming naiveté my a**.",
   "created_utc": 1693964671,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbnpdv",
   "message": "Jimmy John’s and Papa John’s because the CEOs are nuts. Also Barilla for the former CEO’s homophobic remarks years ago.",
   "created_utc": 1693965843,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbobja",
   "message": "I will stop buying Samsung phones and move to Sony as soon as my S9+ dies because Sony has headphone jacks and expandable storage in a flagship design.",
   "created_utc": 1693966090,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzakruh",
   "message": "Nike timberland basically any company that became famous and focused on their brand instead of making a good product.",
   "created_utc": 1693950201,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzalfj1",
   "message": "I don’t think I’ve ever consciously stopped buying a brand for a specific reason. If anything maybe TastyKakes but only because they are not in my area.",
   "created_utc": 1693950444,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzax21i",
   "message": "Brewdog. Notorious for \"brewdogging\" (getting job candidates to do free work for them) among many other things.",
   "created_utc": 1693954932,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb8ec8",
   "message": "Wingstop. Overpriced and salty foods",
   "created_utc": 1693959546,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbc1eb",
   "message": "McDonalds, the place was originally for when you had $5 and wanted a decent sized meal for the price, now it’s like double the price for the exact damn thing at a lower quality",
   "created_utc": 1693961060,
   "score": 6,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb3nzd",
   "message": "Stopped buying Goya products for good when the owner/his fam became very public and rabid in their support of Mango Mussolini a few years back, and vice-versa (emphasis on vice). \n\nPrior to that, I was mystified at how when I'd go to my neighborhood markets, clearly poor Latino fams seemed to buy nothing but their stuff, when equal or better quality/less expensive options were available next to them, and/or Latin shops. \n\nNot sure if it was simply because of the bilingual labeling or what, but it happened all the time, and I've made dishes with their competitors/imports/store brands that were just as good, if not way better. I always felt they were fleecing immigrants with just a standard product in a wrapper they could read. \n\nWhich, considering the grifters they were backing, now makes all the sense in the world, amirite?",
   "created_utc": 1693957608,
   "score": 8,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbdw2a",
   "message": "Bud Light, about 10 years ago: It has no flavor. Bud Light was my first beer brand. I refused to try anything else because, apparently, brand loyalty was a thing for me in my early 20s. I eventually tried a different brand at a party, and I realized the silliness of limiting myself to one beer just because of 'reasons'.  I'll drink it, I just won't buy it if I can avoid it. I now enjoy many brands... except craft beer.(bleh)",
   "created_utc": 1693961810,
   "score": 4,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb7mec",
   "message": "Nestle, Pepsi, P\u0026amp;G, many others... any brand that refuses to end operations in the Russian Federation.",
   "created_utc": 1693959225,
   "score": 7,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzavoly",
   "message": "Motorola. Massive sudden quality issues.",
   "created_utc": 1693954383,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbcysi",
   "message": "Nike",
   "created_utc": 1693961440,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbemc1",
   "message": "Nike, h\u0026amp;m and Zara slave labor",
   "created_utc": 1693962111,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbfn44",
   "message": "Nutella because of Palm Oil. Palm Oil sourcing is rapidly destroying orangutan and other animal habitats",
   "created_utc": 1693962525,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbgdei",
   "message": "KFC \n\nTaco Bell\n\n\u0026amp;#x200B;\n\nBoth are absolute trash now at EVERY location. I used to LOVE both during the 90s and early 2000s.",
   "created_utc": 1693962828,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbhbug",
   "message": "I returned a Panasonic CD player that stopped working under warranty. In the two months it was being repaired the warranty ran out. This is back when CD players were new and for me, expensive.\n\nIt worked fine for a few weeks and then the same problem reappeared.\n\nPanasonic refused to do anything. \n\nI gave them my word, and 43 years later I have yet to buy anything else they make. I'm hoping to live long enough to make it 50.",
   "created_utc": 1693963214,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbhxnj",
   "message": "Levis. Quality seems to just be noticeably worse every pair I get.",
   "created_utc": 1693963465,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbi3em",
   "message": "Levi’s and specifically 501 jeans. Just not the same quality they used to be. Their vintage reproductions are nice but insanely expensive.",
   "created_utc": 1693963530,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbjarz",
   "message": "I swore I'd never buy another Apple product after my 4th gen (5th?) iPod after iTunes renamed my entire CD collection that I spent weeks ripping to my computer. Every file was renamed to a 4 digit code and put in random folders because Apple thought I may pirate the music I owned.",
   "created_utc": 1693964035,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbjzqb",
   "message": "Beats by Dre.  Overpriced trash. I fell for the product all because Dre the goat beat maker/ dj/ music producer put his name on the product.",
   "created_utc": 1693964314,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbnjoa",
   "message": "Nestle. I’ll die of thirst before I give them my money.",
   "created_utc": 1693965776,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbo6hb",
   "message": "I try to avoid Koch brothers products.",
   "created_utc": 1693966035,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbo6kk",
   "message": "Dyson - Every product has failed or been recalled for a fault. Overpriced and complicated engineering trying to solve problems that don’t exist.",
   "created_utc": 1693966036,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzboofu",
   "message": "Disney",
   "created_utc": 1693966243,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbperl",
   "message": "Android phones. I grew up",
   "created_utc": 1693966555,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbqmno",
   "message": "Nike.  Quality is terrible",
   "created_utc": 1693967080,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbao0j",
   "message": "Not brand, but store. Ive been trying to avoid shopping at Target because it truly is not a discount store. Every time I go in there I spend at least $200, because I impulse by stuff I don’t need",
   "created_utc": 1693960492,
   "score": 4,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb0j3r",
   "message": "Tim Hortons coffee.\n\nAbout 20 years ago they started leaving coffee on the burner until it sold.\n\nSince I drink my coffee black no sugar they seem to think I wanted the worst dregs.\n\nThey stopped after a while but I will not go back.",
   "created_utc": 1693956330,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb5mut",
   "message": "Bayer products",
   "created_utc": 1693958407,
   "score": 3,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb8oel",
   "message": "Fat Tire Brewing. \nEmployees had ownership in the company. The founders who had majority sold the company out from under them cause some company came forward and handed them fat checks. Owners said company is doing great so let's sell. All the employees were forced to sell their stakes.",
   "created_utc": 1693959660,
   "score": 4,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb9g02",
   "message": "I used to buy Aunt Jemima products but stopped after they changed the name to Pearl Milling Company. It’s my personal protest.",
   "created_utc": 1693959981,
   "score": 4,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzaxyrx",
   "message": "Martins Rolls and Bread - Because the owner decided to support a racist prick for office. So by buying, I feel like I would be basically supporting the KKK.\n\nPapa Johns - Because the owner claimed giving Healthcare to his employees would add 25 cents to every pie.. and he just couldn't do that to his customers. (I used to order like twice a week.. When I stopped.. they closed the only local shop like 4 months later. Victory!)\n\nStellantis car brands - Because they are the worst for reliability and I know several people who ended up with really bad cars. \n\nNot a brand, but a location:\n\nWildwood, NJ. - Had a horrible run in with bad locals, bad cops, etc.. when I was younger.. so never going to ever spend a dime in that awful place.",
   "created_utc": 1693955300,
   "score": 6,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb4b0u",
   "message": "Wendy's. They used to be my favorite fast food, but it disgusts me now. Idk if it was a dip in quality or just outgrowing it. (Edit:spelling)",
   "created_utc": 1693957869,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb4ava",
   "message": "I'm boycotting Goya because they support Trump.",
   "created_utc": 1693957867,
   "score": 5,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzazk80",
   "message": "Xbox",
   "created_utc": 1693955944,
   "score": 2,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbjwni",
   "message": "Old spice. Because it’s poison. Switched to a salt stick. I never smell and when I do it’s of my own manly accord. With a bit of salt scent.",
   "created_utc": 1693964278,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbmfw6",
   "message": "Ivanka Trump clothing, shoes, purses. She is her father’s daughter.",
   "created_utc": 1693965327,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbqlfo",
   "message": "Eos",
   "created_utc": 1693967065,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbc9v3",
   "message": "I used to buy exclusively New Balance shoes because they were good for my Plantar fasciitis.  But then I saw that they give almost no money to the democratic party and a bunch to the GOP.  I haven't bought their shoes in years.",
   "created_utc": 1693961156,
   "score": 0,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbdw4k",
   "message": "Dropped my NYT subscription because they kept publishing fascists and transphobes.",
   "created_utc": 1693961810,
   "score": 0,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb0esx",
   "message": "Ben and Jerry's anti cop company",
   "created_utc": 1693956282,
   "score": 249,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzamai1",
   "message": "Highgradelaid weed. It's overpriced crap. Bell Canada. 12 hours on hold? Nope. Mcdonald's, You close your store during covid and have the drive thru open but you don't serve customers on foot? That's discriminatory.",
   "created_utc": 1693950759,
   "score": 252,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbkmyg",
   "message": "Ben and Jerry’s\nSlava Ukraine 🇺🇦",
   "created_utc": 1693964583,
   "score": 1,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzakxxw",
   "message": "[deleted]",
   "created_utc": 1693950264,
   "score": 248,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzb20on",
   "message": "[removed]",
   "created_utc": 1693956935,
   "score": 252,
   "submission_id": "16b132p"
  },
  {
   "comment_id": "jzbkbf0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16b132p"
  }
 ]
}