{
 "submission_id": "16bir8l",
 "title": "What's something you can't tell your partner for fear of upsetting them?",
 "selftext": "",
 "created_utc": 1694002753,
 "permalink": "/r/AskReddit/comments/16bir8l/whats_something_you_cant_tell_your_partner_for/",
 "score": 172,
 "url": "https://www.reddit.com/r/AskReddit/comments/16bir8l/whats_something_you_cant_tell_your_partner_for/",
 "comments": [
  {
   "comment_id": "jzdhthk",
   "message": "The first piece of jewellery I bought my wife was a necklace. We went on holiday and she lost it.\n\nI said I would replace it but it wasn’t the same, she was upset that she’d lost it for sentimental reasons.\n\nI emailed the hotel and of course they hadn’t found it. So I bought a replacement and told my wife they found it.",
   "created_utc": 1694005600,
   "score": 182,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdhy0r",
   "message": "Not me but my parents. If my mom wants to hide literally anything from my dad, no matter what it is, she just puts it somewhere where he would have to bend over to see it. Doesn't matter if it's something like a package of oreos, if my dad has to bend over to find it he's never going to find it. I've tested it with my own snacks when I was still living with them to confirm it works. He'd be mad if he knew how many snacks we'd hidden from him simply because he doesn't bend over low enough to see it in the cabinet.",
   "created_utc": 1694005657,
   "score": 149,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdoma7",
   "message": "That she is wayyy more like her mom and sisters than she likes to think.",
   "created_utc": 1694008462,
   "score": 82,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdhufq",
   "message": "The remote didn't disappear. I accidentally put it through the washing machine and destoreyed it and threw it out in a panic.",
   "created_utc": 1694005612,
   "score": 25,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzeg1fo",
   "message": "I wanted my husband to quit wearing denim shorts because they made him look old. He had gained a bit of weight, so I kept buying his jorts in his old size 34 and I bought khaki shorts in a 38. He will never read a label for any reason. He would put on the jorts and then lay on the bed and lift and spread his legs to stretch out the shorts a bit. He blew out the back seam of two pairs in the same day, then ended up putting on the khaki shorts. Since then, almost 20 years, he has insisted that khaki shorts are made better and fit more comfortably than denim shorts of the same size.",
   "created_utc": 1694018546,
   "score": 254,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdhsfb",
   "message": "My wife has a beautiful heart. I jokingly call her a Disney princess because any animal that she comes across she has to talk to, and greet. She has cried by seeing a dead raccoon on the side of the road before.\n\nAt the time, I was working day shift and she was working a swing shift. I had a busy day, but I saw she sent me some pictures of a young doe that was eating in our front yard. She seemed thrilled. I came home and saw the same deer! Dead. On my god damned porch. I felt like I started to hear “the first 48” theme playing as I realized I have six hours to get rid of this thing before my wife gets home and her world is shattered. I call my local city authorities thinking they wouldn’t want a dead animal in the middle of town. Turns out, they couldn’t care less. I called some local raptor shelters to see if they could take a stat donation but it turns out the dead deer business is booming and they didn’t have a need for donations at this time, especially in the next 6 hours.\n\nFrustrated, I call my dad to vent and get advice on what to do. His response is only a “Hold on bud, I’ll be there in 15 minutes.” I go back inside to take care of the dogs and within the next 15 minutes I see me dad back his huge truck into my back yard, has the tail gait down and is knocking on my door with a pair of nitrile gloves on and another pair in hand for me. It was starting to get dark out, but we had that thing loaded up and found a special place to, uh. “Dispose” is it. We made it back with 20 minutes to spare before my wife got home.\n\nI haven’t told my wife because I think it would either break her heart, or creep her out at how efficiently my dad can dump a body.\n\nAnyway, wifey thinks her deer friend is alive and well, and totally not at the bottom of a ravine.",
   "created_utc": 1694005588,
   "score": 209,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdhv72",
   "message": "His favorite dip is like 80% mayo. He has a terrible aversion to mayo. His mom has made it when he's not been around his whole life, and now I continue the charade.\n\n(It's a really good dip.)",
   "created_utc": 1694005622,
   "score": 226,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdpqlq",
   "message": "I hate your mom and I'm a little afraid you're going to turn into her, both physically and personality wise.\n\nEspecially since your dad keeps talking about how you have your mom's whole face and personality from back when they first got together.",
   "created_utc": 1694008912,
   "score": 202,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdesy5",
   "message": "It was me who cooked with oil and didn’t clean the spatters off the stovetop… not the cat",
   "created_utc": 1694004234,
   "score": 151,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdmcai",
   "message": "I am very worried about my future, particularly financial security, because we currently live together with his elderly father. I adore them both, but he is sick and may not live more than another 5 years and his dad is quite old. It seems more likely than not that within just several short years, there's a good chance they could both be gone and I could be entirely alone. I know he *knows* this as well as I do, but the idea of verbalizing it makes me feel ill, because it feels selfish to worry about it now. But I don't really think it *is* selfish. I think it's real and I need to be planning for it.",
   "created_utc": 1694007537,
   "score": 89,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdc04i",
   "message": "I daydream/wonder what it would be like to live completely alone. How I wouldn’t have to compromise.",
   "created_utc": 1694002908,
   "score": 39,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdl7kr",
   "message": " I would like to go somewhere and be alone for a few weeks. I love them so much but I have never been on my own in my life and I would like to try it for a minute.",
   "created_utc": 1694007068,
   "score": 166,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdzf8y",
   "message": "That the pulled chicken sandwich was not good 😔",
   "created_utc": 1694012591,
   "score": 238,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdrc1j",
   "message": "She is using words incorrectly.  She has a half dozen she routinely misuses and does not want to hear it.  Example: The middle of the road is the median, not the medium.  Drives me insane.",
   "created_utc": 1694009541,
   "score": 180,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdbx0t",
   "message": "That they pronounce 'meme' as 'me-me.' It physically hurts me.",
   "created_utc": 1694002870,
   "score": 42,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzds3aa",
   "message": "I’ve been having suicidal thoughts for the last year or so.  \n  \nEdit: wow, thank you everyone for the support and kind words. I actually have my first therapy appointment tomorrow afternoon. Due to some medical bills this year, I hit my out of pocket on my insurance, so thought I should give it a try since I won’t be paying anything. Yay America. 😂",
   "created_utc": 1694009832,
   "score": 44,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdpfcp",
   "message": "we're an older couple.\n\n\"if you don't get your fat ass out of that chair and get some exercise, that's where you're going to die.\"",
   "created_utc": 1694008786,
   "score": 99,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze6gfx",
   "message": "I love sleeping next to my girl. But I sometimes wish we had separate beds. I miss sprawling out and sleeping on a angle.",
   "created_utc": 1694015139,
   "score": 126,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzduwm7",
   "message": "That parenting isn’t a contest to see who can stress out over the kids more.",
   "created_utc": 1694010905,
   "score": 106,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdzsqk",
   "message": "I only put spiders outside when she sees them. If they're only noticed by me I let them continue hunting bugs, sometimes with a few soft words of encouragement. You're doing a great job, little guy.",
   "created_utc": 1694012727,
   "score": 111,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdc2ox",
   "message": "Your best friend grabbed my ass. I let it go because he was so drunk he passed out in his own vomit. He either doesn't remember or is acting like he doesn't remember. And I can live with that.",
   "created_utc": 1694002940,
   "score": 187,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze7srd",
   "message": "Every bad thing that happens doesn't require someone to be blamed for it. And that someone doesn't always have to be me.",
   "created_utc": 1694015617,
   "score": 4,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze3pc3",
   "message": "Bad breath, how do I tell them??",
   "created_utc": 1694014159,
   "score": 196,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze4ems",
   "message": "I've been wanting to share this, but I'm worried it might upset my partner. Sometimes, I feel like we don't spend enough quality time together, and I miss the deep connections we used to have.",
   "created_utc": 1694014412,
   "score": 45,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdoi38",
   "message": "You're a slob and part of the reason this relationship hasn't moved forward is because I can't see myself moving in with you until you change.",
   "created_utc": 1694008416,
   "score": 198,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzf6jfb",
   "message": "I am tired in my soul.\n\nI carry the mental load, do 99% of the domestic chores, do the meal planning, grocery shopping, and cooking.  I’m the breadwinner and also the one responsible for our finances.\n\nI’m tired in my heart and soul.  You agree when we talk about our future but there’s no execution on your end.  \n\nYou see my frustrations and you think it’s PPD but it’s you, not the kiddos.  I’ve been doing the therapy and the Zoloft.  Why aren’t you?",
   "created_utc": 1694027801,
   "score": 167,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze8jrt",
   "message": "He was scammed on my engagement ring. The website he ordered it from advertises “lab grown diamonds” but you have to really pay attention to the product pages, because they will send you glass, and NOT the lab grown diamond that you think you are purchasing. They are able to get away with it on technicality because their website offers “lab grown and simulated diamonds”, and although they sent him a “certificate of authenticity”, nothing on it say anything about it being a lab grow diamond. Basically he paid almost $2k on cubic zirconium. \n\nIt doesn’t matter to me because I love him and want to marry him, I couldn’t care less about the ring. He was so proud of himself for picking out a gorgeous ring (and to be fair, it is a really pretty ring) that this is something I’m gonna be taking to my grave lol.",
   "created_utc": 1694015883,
   "score": 47,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdbtg9",
   "message": "Yes, physically your brother IS hotter. But your personality puts you over the top.",
   "created_utc": 1694002824,
   "score": 101,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdyod6",
   "message": "That I hate seeing her on her mobile phone scrolling through mindless videos of people doing dumbshit while she’s got company.",
   "created_utc": 1694012312,
   "score": 211,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzddcwb",
   "message": "I don't like your new hair cut and it has made me marginally less attracted to you.",
   "created_utc": 1694003553,
   "score": 21,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzet2rh",
   "message": "My husband doesn’t drive. His mom was in a near fatal car accident when he was young (he was not in the car) but this emotionally traumatized him and he never learned to drive. I love him so much but it is so emotionally taxing being the only person who can drive. I feel like 75% of my time with him is driving him places he can’t get himself to without a car. He won’t even get himself food if I’m not around. He is a very hard worker and a great provider but I feel like the only time I get to spend with him is in the car. When I bring it up he gets very upset and defensive.",
   "created_utc": 1694023092,
   "score": 76,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzeh6k6",
   "message": "Her lack of interest in intimate touching makes me feel totally unwanted, selfish, useless, and hopeless.",
   "created_utc": 1694018949,
   "score": 147,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzegzgs",
   "message": "Honey, it is painfully obvious that you are only putting up with your family because of the wealth you are in line to inherit. No shame, I'd do the same thing if my family had money, but can we start being honest about it so we're both in on the ruse? I would tolerate those visits much better if we we could at least joke with each other about how \"it's time to go visit the creepy assholes\" or something.",
   "created_utc": 1694018878,
   "score": 253,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze6wma",
   "message": "I like time to myself . Between kids and house chores we don’t have much time to ourselves outside of the weekend. I ofc want to spend time with her but sometimes I want to do things independently.\n\nI really struggle to ask for this time because I’m scared of upsetting her.",
   "created_utc": 1694015300,
   "score": 128,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzejg9f",
   "message": "That his prognosis, at absolute best, appears to be 7 years from his surgery, which means he only has about 5.5 years now. \n\nHe was diagnosed with and has been treating for brain cancer. He’s “lucky” because his is a slower growing one. But he doesn’t like me looking into things and reading studies, though he knows I do it he just doesn’t like to see it or hear about it. And his doctors haven’t brought up prognosis, and he hasn’t asked them. And it’s not my place to ask them at his appointments. \n\nThere was a study recently on his specific type of tumor (for reasons I won’t get into, studies specific to his tumor are few and far between) looking at prognostic factors. I’ve been obsessed with trying to understand every corner of it trying to pinpoint what to expect. It’s impossible I know, but it’s been my focus in the quiet moments lately. And then it hit me the other day that the upper end of every variable was about 7 years overall survival from the date of surgery. And that’s not even a guaranteed 7 “good” years, because the end is going to be awful. \n\nMoments like this you learn time really is relative. 7 years can seem like an eternity. But when you’re facing your partner’s death it feels like absolutely no time at all.",
   "created_utc": 1694019743,
   "score": 121,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze588n",
   "message": "Their anger issues really scare me.",
   "created_utc": 1694014703,
   "score": 174,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze7pac",
   "message": "*yes, your hairline is receding*",
   "created_utc": 1694015583,
   "score": 174,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzea8zw",
   "message": "[deleted]",
   "created_utc": 1694016485,
   "score": 59,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdffl7",
   "message": "I love you, yet wish I'd never married you.",
   "created_utc": 1694004527,
   "score": 246,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzefiwd",
   "message": "The dog loves me more and when she goes to join him it’s because I gave her the command to “find (partner’s name)” 😅",
   "created_utc": 1694018362,
   "score": 187,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze206n",
   "message": "That I wish he was more romantic and sweet. My husband is a doer, he built my dream master bathroom, he redid our whole front lawn/front patio area to one I am in love with, he helped build my home library. But when it comes to romance, there’s none. I try not to let it bother me since he’s built a home I love. But sometimes it doesn’t bother me.",
   "created_utc": 1694013543,
   "score": 225,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzexzy7",
   "message": "I love that all the comments from husbands talk about how they have an elaborate, years-long lie to hide something that would make their wife sad and every comment from a wife is like \"my husband has a shirt I hate so I moved it roughly 18\" from where he normally keeps it and since it's not in his direct line of sight he never wears it\" haha",
   "created_utc": 1694024825,
   "score": 128,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdpzo1",
   "message": "I shrank your new (and expensive) sweater by mistakenly washing it with my clothes on regular. When I realized what happened, I hid it until you went to the store and then stuffed the now too small sweater back into the laundry. When you later hand washed it and discovered it no longer fit, I was very sympathetic with how irritating it was that the sweater had shrunk despite you taking every precaution.",
   "created_utc": 1694009012,
   "score": 193,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdjqu1",
   "message": "No those jeans don't make your ass look fat, the fat in your ass makes your ass look fat, the jeans just accentuate it.",
   "created_utc": 1694006451,
   "score": 104,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzewxpo",
   "message": "It is so fucking annoying that nobody in your whole damn family can be on time. It’s truly not that hard and I’m sick of showing up places on time and then y’all walk in 30 minutes to an hour later. Being late constantly is an ugly trait to have.",
   "created_utc": 1694024452,
   "score": 40,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzfho9p",
   "message": "I'm sometimes frustrated because we can't try new restaurants or recipes. He has A LOT of culinary dislikes. I often joke that he only eats 7 vegetables (tomatoes, peppers, cucumbers, potatoes, lettuce, onions, and avocados) but it's actually a struggle because he refuses to try anything else. He hates curry and garlic. He also hates creamy sauces, soups, many salads, beans, sweet-and-sour anything, mushrooms, and all sushi rolls. I often feel like I'm feeding a six-year-old.  \nMy grandparents took us to a very fancy restaurant once (I'm talking Michelin-star, famous chef, the works), and he spent the ride back fuming because he didn't like any of his food. I tasted it and it was glorious; he just can't handle anything with any \"exotic\" spices (read cardamom, dill, rosemary or anything that's not paprika). He simmered down after I took him to McDonald's for chicken nuggets and a cheeseburger.  \nI try to accommodate our meals to his taste, but I look forward to my in-person office days because I can buy a nice meal for myself. I'm already craving tomorrow's sushi.",
   "created_utc": 1694031608,
   "score": 79,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdmf8a",
   "message": "My spouse's dreams are way worse than I let on. Spouse doesn't remember the dreams upon waking and asks for a nightly recap since spouse wakes me multiple times a night. The really bad dreams I don't speak about. The psyche is expelling a lot of trauma and I don't want my spouse carrying that around during waking hours. I'd rather the poison of my spouse's childhood stay in the void rather than burden them when awake. Spouse can not recall dreams at all and is a lovely person. I'll give a short daily recap if a dream is funny or relevant but the really really bad dreams stay in that secret space between what's said and what's better unsaid.",
   "created_utc": 1694007571,
   "score": 64,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze67ps",
   "message": "I really don't like how her parents treat her. She does everything her parents say in fear of them being mad at her. They will tell her she can do this if she does that first, then they will change what she needed to do or might even say they didn't say that. She's 23, we're married, we have a kid on the way, and it feels like any decision we make has to be approved by them. \n\nFor the record, I've told her this multiple times and she agrees with me to a certain extent",
   "created_utc": 1694015053,
   "score": 66,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzeemtc",
   "message": "That my nerves are shot and my compassion is running low while trying to support him through ongoing depression, anxiety and unemployment.",
   "created_utc": 1694018046,
   "score": 87,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzef3gm",
   "message": "I feel like I am raising our daughter alone. She's only 6 weeks old and I'm basically doing it solo whilst he carries on with his life",
   "created_utc": 1694018208,
   "score": 124,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzeao0c",
   "message": "I know she's still drinking.",
   "created_utc": 1694016635,
   "score": 107,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzeamu8",
   "message": "One year for Christmas, she was trying to surprise me with something, but I hate surprises. I was out of a job at the time and didn't want anything extreme because I knew I couldn't return the favor. I told myself I wouldn't snoop, just ask a few questions and express that I didn't want anything big bc poor. She decided to try and casually ask me if I was still interested in a concert for my favorite band, and I immediately knew. Her face gave it away. I knew she got tickets, but it was more. She got us meet and greet tickets, and I found out a few days later after her face kept giving it away. Christmas came and I was right. But I didn't need to act, I was really happy. It was an amazing gift, and we had an amazing time. She was so proud of herself for pulling it off without telling me. I'll never tell her I knew, just because she was so happy.",
   "created_utc": 1694016623,
   "score": 52,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzebwbs",
   "message": "Some of these are cute, but some of these are aweful.",
   "created_utc": 1694017079,
   "score": 93,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdp87v",
   "message": "That she needs to understand her limitations. She's a wonderful, amazing, beautiful person, but she's not the brightest. She's failed community college twice but wants to get a doctorate. This is not a matter of her not putting in good effort or having resources, but her abilities. She's enrolled again in community college and is taking the pre requests before she can do college allegebra and English for credit. The amount of effort it takes to explain something to her is significant. But the amount of effort it takes to get her to apply or remember it is... Yeah.\n\nShe has high goals and I don't want to crush her spirit. She's good at so many things and I know she can be successful in other ways. I will help her to the best of my ability, but I can't take exams for her. There's no way I can have the \"be realistic\" conversation without being a jerk or crushing her dreams",
   "created_utc": 1694008707,
   "score": 221,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzece9p",
   "message": "Not really “partner” but boyfriend of 3 months…\n\nI have been referred for an appointment for suspected cancer. I don’t plan on saying anything until I know exactly what is going on. That goes for everyone else in my life too.\n\nI feel guilty for keeping this from him, and for sneaking around for doctors appointments. \n\nWe talk deeply about everything, so this feels like a BIG lie by ommission…",
   "created_utc": 1694017252,
   "score": 28,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzeu6pm",
   "message": "When I sit in the garden and stare into space it's because I want some peace. Silence. Listen to the trees, the birds, feel the breeze, watch a cat walk across the fence, silent empty moments. \n\nWhat I do not want is to hear how\n\" Susan is back from her holiday and had a terrible time in Heathrow and Jane got caught in that thing with the air traffic whatever. Did I hear, it was the French apparently, it was in an article. Have I looked at the wiring in the bathroom, have I thought about the tiles, have I thought about a different bath, did I get that link she sent me. I look stressed, I need a break from work. I look really stressed out. There's that season of Witcher, should we give it another try? Why not. You really do look stressed. What's wrong? . \"\n\nI cannot say \"leave me in peace woman!!! For five fucking minutes\". For some reason I must say \"that's interesting. Hmm. Well. Hmm. Wow. Mm-hmm. Yeah. Ok. Mmm. Wow. Really. Wow. Mmm\"",
   "created_utc": 1694023479,
   "score": 27,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzf5rk8",
   "message": "I am really just three beavers in a trenchcoat.",
   "created_utc": 1694027529,
   "score": 27,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze0yzo",
   "message": "That I slept with her best friend before they ever knew each other. (Back in high school)\n\nIt's just something that is not needed to be known.",
   "created_utc": 1694013163,
   "score": 99,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzdpioa",
   "message": "It's starting to get noticeable that you aren't exercising anymore :(",
   "created_utc": 1694008823,
   "score": 176,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jze9r9l",
   "message": "I’m not sure if your new sexual kinks are linked with your alcoholism and once/ if you get through recovery it will go back to how it was before or if this is what you always wanted. I was happy to try and experiment but there is not a single bone in my body attracted to a man dressed as a woman, I don’t get any sexual gratification from pegging you, and I don’t want to make fun of you while you walk around in heels. I just want to have sex with a man who likes to have sex with women and not pretend I’m a man and you are the woman.",
   "created_utc": 1694016311,
   "score": 64,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzejtdq",
   "message": "I know the reason my MIL/step FIL got divorced. It was not mutual nor was it as simple as “things didn’t work out” which my MIL told my spouse.  My ex FIL called me and confided in me when he found out his wife had cheated multiple times.  I did not think it would be beneficial to anyone to know that my MIL was a cheater.",
   "created_utc": 1694019873,
   "score": 23,
   "submission_id": "16bir8l"
  },
  {
   "comment_id": "jzercwf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16bir8l"
  }
 ]
}