{
 "submission_id": "16blq7v",
 "title": "Redditors with younger coworkers, what was your “I’m officially old” moment?",
 "selftext": "",
 "created_utc": 1694010431,
 "permalink": "/r/AskReddit/comments/16blq7v/redditors_with_younger_coworkers_what_was_your_im/",
 "score": 244,
 "url": "https://www.reddit.com/r/AskReddit/comments/16blq7v/redditors_with_younger_coworkers_what_was_your_im/",
 "comments": [
  {
   "comment_id": "jzefwpv",
   "message": "My childhood cat lived to 21.5 so teaching (freshman biology lab, so students were ~18) became very weird when I realized my cat was older than my students",
   "created_utc": 1694018498,
   "score": 17,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze4l4g",
   "message": "They started calling me \"mom\" or \"Mama bear\" on the walkie-talkies. I find it kind of endearing, actually.",
   "created_utc": 1694014474,
   "score": 70,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzecn02",
   "message": "I was talking to a coworker about movies and our favorites. I said something like “I watched that movie so much when I had it on tape in my college years”\n\nHer: Tape?\n\nMe: You know, on VCR?\n\nHer: VCR?\n\nMe: Oh well I guess those are old now. Everything is on DVD now.\n\nHer: DVD?\n\nMe: I guess those are old too. I guess Blu-ray is what’s on disc now.\n\nHer: Disc?\n\nMe: Nevemind\n\nShe was half joking but nonetheless it made me feel old.",
   "created_utc": 1694017338,
   "score": 248,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze7xuz",
   "message": "When i fell down the last couple of steps on a stairway. No one pointed and laughed like I expected, instead they helped me up and asked me if I was okay.  That’s when I knew.",
   "created_utc": 1694015667,
   "score": 23,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze3owo",
   "message": "They were complaining how hard and awkward it is to meet women on Tinder.  I asked if they ever had to call a girl at home and her Dad answered the phone. They were horrified.\n\nAnother time one of my guys asked what a payphone was. We worked at a phone company.",
   "created_utc": 1694014154,
   "score": 220,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze9v38",
   "message": "I'm a preschool teacher. It's been a TRIP to watch parents go from Soooo much older than me, to the same age as me, and now they're younger than me!?!?",
   "created_utc": 1694016348,
   "score": 212,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze3jg7",
   "message": "We were talking about where we were on 9/11, and my coworker went quiet. He wasn’t even born. \n\nWe also had a band that was famous in the 90s stay at the hotel, and he had no idea who they were, meanwhile I was so star struck as they were my entire childhood!",
   "created_utc": 1694014099,
   "score": 216,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzehqi1",
   "message": "Our payroll company went under (luckily not with our money), so for that month, we got real live, honest-to-goodness paper checks. Several co-workers didn't really know what they were or how they could turn them into money.",
   "created_utc": 1694019144,
   "score": 146,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze141c",
   "message": "I'm in IT. Co-worker needed to borrow a serial cable. The cable was older than the co-worker.",
   "created_utc": 1694013214,
   "score": 26,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdzg9b",
   "message": "In trade school, we were doing introductions, saying a little bit about ourselves. One kid says \"yeah, I'm really into classic cars, I have a 1997 *something or another*. Me, the other couple older folks, and the instructors all made audible groans of horror.",
   "created_utc": 1694012602,
   "score": 241,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze09i8",
   "message": "Various colleagues were debating whether the Concorde had been real. They couldn’t fathom that supersonic civilian aircraft used to exist and now they don’t anymore. \n\nThe Concorde last flew in 2003, when these colleagues were toddlers.",
   "created_utc": 1694012903,
   "score": 138,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdu14w",
   "message": "When they say “you look great for your age” like DED",
   "created_utc": 1694010575,
   "score": 207,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze6ylr",
   "message": "Had a co-worker ask me, “Back before cell phones, did you just have to wait around at your house for a call?”  Uh, yeah, pretty much.",
   "created_utc": 1694015321,
   "score": 78,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdu3dc",
   "message": "Years ago, before I retired, when I met a new young troop and realized I'd been in the military longer than they had been alive...",
   "created_utc": 1694010599,
   "score": 254,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze7mnu",
   "message": "Went grocery shopping and I thought, \"Hey, they're playing some pretty good music.\"",
   "created_utc": 1694015557,
   "score": 120,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze2t1f",
   "message": "Younger dude said his first gaming console was the PlayStation 4, first computer ran windows 8, and had no idea what we meant by dial up or rotary phones. Had to stop and reevaluate my age lol.",
   "created_utc": 1694013833,
   "score": 177,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzed0es",
   "message": "had an intern refer to the 90s as 'the late 1900s'\n\nwtf. its true, but it makes my teenage years sound like the oregon trail or something",
   "created_utc": 1694017470,
   "score": 222,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze45o4",
   "message": "I made a Half Baked reference to a bunch of stoner kids and they didn’t get it",
   "created_utc": 1694014322,
   "score": 116,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdzxi1",
   "message": "When that guy from SmashMouth died.",
   "created_utc": 1694012778,
   "score": 197,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdu0gz",
   "message": "When I couldn't decipher the two youngest coworkers parts of the conversation. I had to search what some words meant.",
   "created_utc": 1694010568,
   "score": 251,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze62au",
   "message": "Getting a blank stare after saying we’d meet, “Same bat-time, same bat-channel.”",
   "created_utc": 1694014999,
   "score": 247,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze2v3b",
   "message": "I'm a (female) computer geek.  I was running cables with this guy at work one night, and he kept trying to keep me out of the actual work part.  I finally told him 'I've been doing this since before you were born!'\n\nThat was about 25 years ago, and as of right now, I've been working in the computer field for 44 years.",
   "created_utc": 1694013854,
   "score": 205,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzec7pq",
   "message": "Left a note for a new hire to call IT to help him set up his work phone and he couldn’t read cursive. Asked me what language I wrote the note in.",
   "created_utc": 1694017189,
   "score": 190,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze8a1v",
   "message": "When they absolutely love a \"new\" song and then I tell them it's a re-make of a song from 25 years ago. They almost always try to tell me I'm wrong, until I pull up the evidence and then it's shocked Pikachu face lol.",
   "created_utc": 1694015787,
   "score": 68,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze58no",
   "message": "When I accidentally referred to it as THE Discord instead of just Discord.",
   "created_utc": 1694014707,
   "score": 6,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze0afm",
   "message": "I work at a brewery part-time as a beertender (aka bartender) for extra income and free beer. I'm 45, and most of them are in their early 20s. I like all of them, but boy, did I realize quickly that I was out of touch with today's slang in the US! We were trying a new beer, and my coworker was like, \"Damn, this really slaps,\" and that was followed by \"no cap\" by another. I stood there so confused about what these guys just said. They have all taught me much more since😆",
   "created_utc": 1694012913,
   "score": 103,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze7qsv",
   "message": "When they said they went to high school with my daughter",
   "created_utc": 1694015597,
   "score": 227,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze66z8",
   "message": "(coworker) hey, a few of us are going out Friday night, wanna come?\n\n(me) sure\n\n(cw) great! Meet at my place at 11.\n\n(me) wait, 11pm?...ok (to myself) that's when I was planning on going to bed",
   "created_utc": 1694015046,
   "score": 220,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdy8gj",
   "message": "Five or six years back, my team and I went out for lunch around the holidays. Somehow, \"Where were you on 9/11?\" came up, and we're all going around the table sharing stories. I was in my first week of university. I thought a Third World War was about to break out, and I was in exactly the right age to have to go fight it. I watched the second plane hit live on television, and by the afternoon I was making plans to join the navy. \n\nI tell this story, and a lot of the senior people around the table's heads are nodding, then the new hire chimes in, \"I was in the second grade...\"\n\nToday, most of those senior people have moved on to other things, and my team has grown to include a number of young people. Sometimes I tell them the tales of twenty years ago when I learned how to use Adobe Photoshop 7.0 that came on a thing called a CD. My graphic designers nod. They've heard those legends before, but they were pre-JK at the time. Then they show me how to do something in Photoshop the non-dinosaur way, and I nod too. I've heard the legends of these new-fangled ways that make my hard jobs easy before...",
   "created_utc": 1694012148,
   "score": 57,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzfxbr9",
   "message": "my younger co-worker always lifts my heavy tool bag off the floor to hand it to me so I never bend down... that's when I knew I turned a critical point in my life.",
   "created_utc": 1694037012,
   "score": 151,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze85ac",
   "message": "A coworker and I were talking and they said \"say less\"\n\nI replied \"oh... Okay.\" And I walked away confused.\n\nI had to google what that meant after.",
   "created_utc": 1694015739,
   "score": 152,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze4ly5",
   "message": "They used lingo I've never heard at the time.  He says \"thats fire\"  and I kind of mockingly repeat it but i didn't do it exactly like how he said, I was like \"that shits on fire\" and he laughed at me and was like \"nah man its just 'fire'.\" Lol",
   "created_utc": 1694014482,
   "score": 247,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdu8zy",
   "message": "Realizing they didn't know what a cassette tape was.",
   "created_utc": 1694010659,
   "score": 209,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdvs1b",
   "message": "Social drinks after work, then being hungover af the next day while everyone else is 100% normal.",
   "created_utc": 1694011236,
   "score": 189,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdttxw",
   "message": "Got a new boss that was younger than myself.",
   "created_utc": 1694010498,
   "score": 239,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze5uyv",
   "message": "I told one of my coworkers that my first job was working at blockbuster video and got a long side eye before he said boy, you're a lot older than you look.\n\nEdit: forgot a word",
   "created_utc": 1694014926,
   "score": 214,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdwi6w",
   "message": "When I knew my nipple ring was older then they were",
   "created_utc": 1694011504,
   "score": 185,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdw1fh",
   "message": "I had to explain “VH1 Pop Up Video”\n\nFound a YouTube example, and immediately had to shut it down due to being problematic.",
   "created_utc": 1694011334,
   "score": 228,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze73bw",
   "message": "Lovely coworker invited me to a party at her house. That *started* at 9:00 pm. That’s bedtime!",
   "created_utc": 1694015367,
   "score": 79,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzduyxx",
   "message": "Not me, but my 40 year old husband was picking up food for the office. A 18 year old co worker asked if he had Cashap. My husband was like “Say what?”. He had no idea such a thing existed.",
   "created_utc": 1694010928,
   "score": 181,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze4jna",
   "message": "\"ok boomer\".  I'm gen x.",
   "created_utc": 1694014460,
   "score": 133,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdw6cs",
   "message": "\"Who's Bruce Willis?\"",
   "created_utc": 1694011383,
   "score": 160,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzedcr7",
   "message": "When a younger female said she was going to come by \"with some incredible tea.\" I was profoundly confused and disappointed when she showed up to my office without a calming elixir of the gods and instead proceeded to talk shit about our co worker.",
   "created_utc": 1694017590,
   "score": 126,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzefyq5",
   "message": "I work with a couple of lads and they are huge gamers. Every conversation is about gaming in some way, shape or form. Occasionally they'll ask me if I've played specific games and depending on my response if the conversation continues to flow.\n\nA few days ago, they were talking about Final Fantasy 7R and as usual asked me if I'd played the game. I said I had a couple of times and that I loved the original and consider it my all time favorite game. They asked me when was the original released and when I told them it was around 1997, both of the lads responded along the lines of, \"I wasn't even born then\".\n\nI wouldn't necessarily class myself as old, but that moment certainly made me feel it.",
   "created_utc": 1694018518,
   "score": 143,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze4a75",
   "message": "When they were planning a party outside of work and I asked \" sounds cool, can I come?\" They answered \" sure we didn't think to invite you, we thought you weren't into this kind of stuff anymore.\"",
   "created_utc": 1694014368,
   "score": 183,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzeaxsh",
   "message": "I was playing some Willie Nelson in the shop and one of the new kids was like 'what's this gay cowboy shit, play some Postie'\n\nHad to grit my teeth over that one",
   "created_utc": 1694016733,
   "score": 182,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzdub04",
   "message": "When they didn't understand my 'AOL dial-up' references.",
   "created_utc": 1694010680,
   "score": 128,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze2o6y",
   "message": "I had to explain Rick Rolling.",
   "created_utc": 1694013784,
   "score": 220,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze7os6",
   "message": "I made a Seinfeld reference in a meeting and nobody understood.",
   "created_utc": 1694015578,
   "score": 118,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze2pz7",
   "message": "The new hire has been alive for as long as I've been married.",
   "created_utc": 1694013803,
   "score": 53,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze71l1",
   "message": "Software engineering manager here. I have team members that have never seen Lord of the Rings.",
   "created_utc": 1694015350,
   "score": 30,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzeai8z",
   "message": "In 2016, my GM rapped Ludacris' song Ho. My young coworkers gave him a round of applause...because they thought he was freestyling...because they didn't know the song. Then I realized since they were like 19, that song came out when they were toddlers.",
   "created_utc": 1694016577,
   "score": 106,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzecj1g",
   "message": "One of my coworkers said their parents got them into Nirvana and Soundgarden because “that’s what they listened to in highschool.” I think I went into a fugue state for a minute with that one. But I still maintain that I am not old, and that 1997 was a few years ago.",
   "created_utc": 1694017299,
   "score": 111,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze1od1",
   "message": "I'm a millennial. One of my coworkers didn't know who Queen was.",
   "created_utc": 1694013421,
   "score": 236,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze7202",
   "message": "When a ~25 year old woman said to me “your generation…”. I was only 40, which isn’t that old right??",
   "created_utc": 1694015354,
   "score": 55,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzebdwp",
   "message": "When someone tried to set me up with their mother.",
   "created_utc": 1694016895,
   "score": 52,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze2j80",
   "message": "This effing toddler \"software developer\" had the freaking nerve to tell me that Windows 95 was released BEFORE HE WAS BORN. I was like, no dude, it was just a few years ago. I asked him how old he was. He tells me he's 26, just finished his masters. He must be thinking of DOS 6 or around there. \n\nYup. He was born after Windows '95 was released.",
   "created_utc": 1694013734,
   "score": 190,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze88hw",
   "message": "Saving Private Ryan happened to be on the TV in the break room.  During one of Tom Hanks' scenes, my coworker said \"Oh, hey...it's the guy from Polar Express!\"\n\nMy man, you do *not* disrespect Buffy Wilson like that!!!",
   "created_utc": 1694015771,
   "score": 182,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzeb74h",
   "message": "When I referenced the band Offspring and none of my staff had heard of them. I just curled up and died inside.",
   "created_utc": 1694016828,
   "score": 98,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze2xlx",
   "message": "Girl was 17 and just had a baby. I was 32. She asked me if I was into investing (which at the time I only had savings accounts and CD’s). She asked my opinion on it, I suggested that maybe she needed to talk to an actual financial advisor. She said “I really just wanted to talk to an adult about it.”",
   "created_utc": 1694013879,
   "score": 198,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzebpj7",
   "message": "I'm mid-50's and a programmer. I have been a programmer longer than a couple of the people on my team have been alive. There is also a dude that just doesn't have any interest in retiring, is in his mid-70's and worked on ARPANET.\n\nSome of our team meetings are pretty entertaining!",
   "created_utc": 1694017011,
   "score": 49,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzewa34",
   "message": "They said \"surely there's a better way to do this\"....I replied \"yes there is, I will show you, but don't call me Shirley\". \n\nThey didn't get the reference and now I'm old. Lmao",
   "created_utc": 1694024219,
   "score": 46,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze3j49",
   "message": "They didn’t know who stone cold Steve Austin is",
   "created_utc": 1694014095,
   "score": 86,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzeafpp",
   "message": "“I can tell you’re older because you call it *the* Gap.”",
   "created_utc": 1694016552,
   "score": 40,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jze1spz",
   "message": "Had a kid ask me what 9/11 was like.",
   "created_utc": 1694013466,
   "score": 78,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzeb9c8",
   "message": "When I asked them if they remember Madonna’s Like a Prayer video controversy, and realized they weren’t even born.",
   "created_utc": 1694016850,
   "score": 74,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzec7is",
   "message": "We have half walls between our desks and I was talking to my coworker who sat at the desk beside me over the half wall between us. The wall comes right up to the bottom of my face, so I said “I feel like Wilson from home improvement.” And he said “what’s that?” \n\nAlso the time another coworker got his ear pierced over the weekend and was saying “yeah I wanted to try out an earring now instead of waiting until I’m like 30 and old” \n\n😑",
   "created_utc": 1694017187,
   "score": 77,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzejhdf",
   "message": "When a Gen Z referred to the 90's as the late 1900's.\n\nExcuse me while I crumble into dust",
   "created_utc": 1694019754,
   "score": 35,
   "submission_id": "16blq7v"
  },
  {
   "comment_id": "jzf2sgo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16blq7v"
  }
 ]
}