{
 "submission_id": "16bnq8k",
 "title": "What's your opinion on the rise of retail theft all across America?",
 "selftext": "",
 "created_utc": 1694015320,
 "permalink": "/r/AskReddit/comments/16bnq8k/whats_your_opinion_on_the_rise_of_retail_theft/",
 "score": 174,
 "url": "https://www.reddit.com/r/AskReddit/comments/16bnq8k/whats_your_opinion_on_the_rise_of_retail_theft/",
 "comments": [
  {
   "comment_id": "jzepeah",
   "message": "It's honestly pretty shocking to watch on social media.\n\nThere's a lot of disinformation out there about how you can steal a certain amount without facing any real prosecution.  So people just load up carts with a highly specific amount of food and then just walk out of the store without paying.\n\nCraziest is the guy who just walked into a 7-11 and started pilfering cigarettes in a garbage can.  The guy taking the video was narrating about how the guy stealing was within his rights and how the store has insurance to cover these losses so they shouldn't worry about it.  And then the store owner just starts beating the shit out of the robber with a broom handle.... and the guy narrating and just insisting that the store owners are in the wrong for stopping a theft.",
   "created_utc": 1694021820,
   "score": 110,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzedoue",
   "message": "It's a symptom of a much larger disease.",
   "created_utc": 1694017709,
   "score": 148,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzeua82",
   "message": "I think more retail businesses might switch to a \"Members only\" type of service and check everyone at the door for membership. They'll also be checking peoples carts/bags as they leave and any theft will result in a loss of membership and loss of shopping rights at said store.",
   "created_utc": 1694023513,
   "score": 131,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzedeir",
   "message": "Stores have always \"allowed\" and expected retail theft.  It is hard to prosecute people for it, the penalty is small, and holding a person for shoplifting opens the store to danger and liability.\n\nBut now people are hearing through social media that they can get away with it, so more people are doing it.  It's like school shootings - they always happened but social media is making it more known so there are copycats.\n\nUntil the 1920's, stores simply did not let customers pick up items on their own.  The items were kept behind the counter and the clerk got everything for the customers.  But you had to have a clerk per customer.\n\nSo we may go back to shopping the old fashioned way.",
   "created_utc": 1694017607,
   "score": 111,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzf2ben",
   "message": "I’m seeing it heavily in the San Francisco/Bay Area.  I live in Oakland and it’s not uncommon in grocery stores (people walking out with carts of food) and at big box hardware (I’ve seen guys walk out of Home Depot with spools of romex and tools).  It’s a wide perception that our police don’t roll for any crime that doesn’t include shooting so people who are desperate don’t have much to hold them back.",
   "created_utc": 1694026330,
   "score": 253,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzejisy",
   "message": "As an honest shopper, it makes my experience really suck and I live in a nice area. A few examples:\n\n* I go to WM to buy a cleaning packet for my Braun electric razor. It's locked in a cabinet. I turn on the light and wait 10 minutes as employees actively walk around my aisle and avoid eye contact. I finally go the pharmacy and ask for help,  and while I am 1 aisle over an employee sneaks in, shuts off the help light and and then disappears. I finally go to the electronics isle, ask for help and get somebody to get a manager. It took 25  minutes to get my shaving stuff. The cleaning packs for my razor are $8.\n\n* I needed a GoPro battery from BestBuy and saw online the store down the street had them in stock, so I think _Oh I'll just go grab one at lunch_.  I show up and wait in a little bin and assigned an employee who walks me to the battery and then walks me to the checkout. It was so awkward and I couldn't even wander the isles and look around. I will never go back to BestBuy.\n\n* Home Depot - I need 20 of their black bins that are in Sale. I get them on a cart and go checkout. I need to wait for a manager to come over and one at a time, they take them all apart and check for merch being snuck out between the bins.  They were cool about it tho unlike WM or BestBuy.",
   "created_utc": 1694019768,
   "score": 248,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfr853",
   "message": "I work at Levi’s and we’re seeing more organized theft. I’m talking about people coming in separately (but are working together) to distract employees while others are grabbing jeans and booking it. The bad thing is, my store is located outside of the mall and there is an alley way where they can easily escape to, without repercussions. \n\nIt’s frustrating because we get blamed by management, but at the same time, I’m not sacrificing my health or safety for some denim.",
   "created_utc": 1694034867,
   "score": 17,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzf2nt6",
   "message": "It's further evidence of the breakdown of our social contract.  Those that have break every rule possible and look down on those that don't. Those that don't no longer feel like they should follow the rules since those above them don't. I don't agree with their choice, mostly because they fail to realize how much it impacts everyone around them through raising costs, and general unfairness, but I do understand their motivations.\n\nBTW this is not \"stealing a loaf of bread,\" these people steal any and everything, mostly to resell or to just have nice things.  So this is less a symptom of abject poverty, but more about our social fabric unraveling.",
   "created_utc": 1694026448,
   "score": 243,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzf3527",
   "message": "People stealing food is one thing but gangs blasting through a mall and stealing handbags and clothes is by no means the same to me.",
   "created_utc": 1694026611,
   "score": 126,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzf81y9",
   "message": "Its a symptom of societal decay of norms and cohesion, along with a symptom of deep poverty on the lower classes.\n\nEDIT\n\nThere was a sort of social deal.  \nIf you're willing to work and put in the effort, and weren't too stupid or did stupid mistakes, you could earn a living enough to give you a decent life and some amenities and a roof. If you were good working class - not even middle - you could even buy and pay down a house.  \nSo the deal was that. Do your part, and you have a future.  \nNow, this is not true. You can work all you want, you won't be able to afford a damn house, have a decent life, you'll be forever in debt.  \nSo if society doesn't give you that deal, why should you obey its rules other than to avoid punishment?  \nLikewise, people in society understand that the deal is revoked, which takes away some of the moral justification of enforcing harsh laws and securing property. Because underlying all of this, people understand where it starts.",
   "created_utc": 1694028330,
   "score": 48,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzevy00",
   "message": "Raises our prices, endangers the safety of employees, we've already seen many retail stores close creating job loss. The harmless narrative seems pretty false so far. A shame the theory had to get tested to find out.\n\nThe politicans that never had to work a day in retail sitting in their gated communities with private security getting their amazon deliveries   are amused though.",
   "created_utc": 1694024102,
   "score": 71,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzedzso",
   "message": "result of the continuing breakdown of social connections in the US. Free food is easy to get. People are stealing stuff that can be resold and people don't steal when they think they're stealing from their own or the community prevents it. Neither are really in operation today so there is widespread theft. Many many problems today stem from a society set up with the assumption that we have a local community and then we went and imploded that.",
   "created_utc": 1694017817,
   "score": 252,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzeh1ht",
   "message": "This is how you get food deserts.\n\nNo business, of any size or morality, can operate for long when their employees are not safe and they do not bring in enough money to cover costs.",
   "created_utc": 1694018898,
   "score": 236,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfnzwg",
   "message": "It's pure stupidity. These morons think it's a victimless crime when all they're doing is increasing the price of goods for everyone else.  The same people stealing are the ones crying and protesting when these retail stores pack up and leave their area altogether.",
   "created_utc": 1694033743,
   "score": 55,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzezw2u",
   "message": "My opinion is that it sucks for all the rest of us, because the idiots doing this stuff are costing us all time and money. I don't want to order everything I need online. I like to look at the stuff I want from time to time, but these scumbags are going to ruin that option for all of us, and they are driving up costs and eliminating jobs in the process.\n\nIt is past time to crack down on the criminal element and deal with them much more harshly instead of just standing by and watching them destroy everything.",
   "created_utc": 1694025490,
   "score": 58,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfe6sq",
   "message": "DESTABILIZATION OF A NATION",
   "created_utc": 1694030454,
   "score": 28,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzeu02c",
   "message": "What do you expect when theft isn’t prosecuted?",
   "created_utc": 1694023414,
   "score": 122,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfkxzz",
   "message": "Corporate America has made living/housing unattainable for a very large portion of America, including the poorest population even more.\n\nIf you make necessities like gas and hosing half of peoples income what do you think people will do? Starve and sit?",
   "created_utc": 1694032718,
   "score": 12,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzef006",
   "message": "It’s the same people who would fill up grocery carts full of stuff. Then run them out of a building. Now stores put a stop to that. So they move onto a new victim. Big retail that never had to deal with this. They don’t have shopping carts and security. But if you rush them with 60 people they can’t stop you.",
   "created_utc": 1694018175,
   "score": 66,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzf5cka",
   "message": "Theft always disgusts me, in any form.  \n\nThe thing that's really bothersome to me is when you see all these smash and grabs, and ransacking's, then when the companies pull out of the city, the people are blaming corporate greed, and not the denigrate thieves for them leaving. \n\nThe utter detachment from reality around them is what's really disturbing.",
   "created_utc": 1694027383,
   "score": 23,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzecux1",
   "message": "I’m more concerned with wage theft",
   "created_utc": 1694017415,
   "score": 134,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzf22x6",
   "message": "Segments of the population out of control",
   "created_utc": 1694026249,
   "score": 33,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfme6e",
   "message": "Theft increases costs for everyone. The root cause should be identified and resolved.",
   "created_utc": 1694033211,
   "score": 9,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzgg399",
   "message": "It is insignificant next to wage theft and the ever-increasing wealth inequality that creates the conditions for retail theft to prosper.",
   "created_utc": 1694044552,
   "score": 9,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzeiybt",
   "message": "I don't live in America, but if it's similar to how it is in my country, it's hilarious that people are coming to the defense of these scumbag thiefs.\n\nI worked in retail for 15 years until recently and the problem with shoplifting isn't that hungry people are stealing it's that career criminals and scumbag drug addicts are. Nobody cares that there are some loaves of bread missing. \n\nYou add those two groups in and now you're missing protein, vitamins, women's health products, razors, batteries etc etc that then gets traded for drugs and cash.\n\nYou eternally-middle class, smarmy reddit cunts see supermarkets flee from low income areas and blame the corporations that run them instead of a culture that promotes ruining things for everybody else. A culture that you now embrace and encourage, because in your terminally online brain, you confuse \"shoplifter\" for \"hero\". \n\nI fucking hate redditors.",
   "created_utc": 1694019569,
   "score": 231,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzexa1r",
   "message": "Mass theft, mass lawlessness, and discarding of social norms are all signs of a fractured social contract.\n\nMake no mistake, it is fracturing.  \n\nWhen our last president proudly proclaimed he was \"smart\" for using legal loop holes to avoid  paying taxes, to shirk responsibility to participate in sharing the cost of living in a civilized society he essentially communicated \"taxes and laws are for the weak and stupid\".",
   "created_utc": 1694024573,
   "score": 25,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfn98d",
   "message": "Just wait 10 years. Now is nothing",
   "created_utc": 1694033499,
   "score": 7,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzecbbx",
   "message": "What retail theft? I didn't see anything.",
   "created_utc": 1694017225,
   "score": 211,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzff73l",
   "message": "I hate that these losers steal stuff the majority of us pay for.  I’d love to see some security guard beat the shit of them for once",
   "created_utc": 1694030805,
   "score": 25,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jze9vs9",
   "message": "Because politicians don’t give a fuck.",
   "created_utc": 1694016355,
   "score": 70,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzexcsx",
   "message": "The rise in retail theft that mysteriously matches perfectly with the decline in real checkout lines. They can play it off as if it is roving bands of thieves because it is easier to blame that than their stupid decision on no longer hiring checkout employees",
   "created_utc": 1694024600,
   "score": 21,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzed8gi",
   "message": "First, my opinion would be to be confident that it is true\n\nhttps://www.cnn.com/2023/01/18/business/retail-shoplifting-shrink-walgreens/index.html",
   "created_utc": 1694017548,
   "score": 51,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfbp75",
   "message": "Food, ok fine I understand that. But that’s not what is being stolen. I have witnessed people stealing mass amounts of expensive goods like wire, generators, and power tolls. That is not necessities that is for profit. That’s not even the mass gangs of people raiding stores. It’s disgusting, it ruins the shopping experience for customers who want something but no it’s locked up, it makes retail workers job that much more difficult because on top of normal responsibilities they now have to go around locking and unlocking stuff. It further hurts employees as stores will cut hours if there is high theft (they can afford not to do this if they are a large company but they still do it).",
   "created_utc": 1694029602,
   "score": 11,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzgfbyu",
   "message": "It’s a symptom of the poverty epidemic. Desperate people will do anything to keep a roof over their head and food on their table.",
   "created_utc": 1694044237,
   "score": 5,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzelgiy",
   "message": "Victimizing criminals and blaming the police for everything isn't helping the situation.",
   "created_utc": 1694020449,
   "score": 98,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzetwvq",
   "message": "I think the pandemic just fundamentally broke people on so many different levels.  I don't know what the cure is or even what the cause is but it seems like since then we're just so awfully broken and no one wants to take responsibility for anything.  When it's not your fault and you have a chance to stick it to the people who's fault it is, why wouldn't you?",
   "created_utc": 1694023384,
   "score": 9,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzfq3ew",
   "message": "It's shitty af, and the entitlement of these thieves enrages me. \n\nDuring the baby formula shortage, a ring of homeless assholes were going around stealing tubs of baby formula -- not even to make a profit on the black market, which would be bad enough -- but to return to the store for a refund. \n\nThe tubs would have to be discarded of course.\n\nIt's a small example, but I really wish the authorities would crack down and actually hand out prison time.",
   "created_utc": 1694034468,
   "score": 7,
   "submission_id": "16bnq8k"
  },
  {
   "comment_id": "jzft2vo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16bnq8k"
  }
 ]
}