{
 "submission_id": "16cgu14",
 "title": "What is a \"dirty little secret\" about an industry that you have worked in, that people outside the industry really should know?",
 "selftext": "",
 "created_utc": 1694095732,
 "permalink": "/r/AskReddit/comments/16cgu14/what_is_a_dirty_little_secret_about_an_industry/",
 "score": 227,
 "url": "https://www.reddit.com/r/AskReddit/comments/16cgu14/what_is_a_dirty_little_secret_about_an_industry/",
 "comments": [
  {
   "comment_id": "jzjop1i",
   "message": "We touch your food with our hands. Weird. And yes, we wash them so often that they might fall off. That, or you get assoles that wear gloves for 12 hours and never change gloves or wash their hands.",
   "created_utc": 1694102916,
   "score": 208,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjytao",
   "message": "I worked at a major jewelry company in the US. When we wanted to buy jewelry, we paid what it costs to make the product (material, labor, shipping), plus 10%. I paid around $115 for a pair of $950 diamond earrings.",
   "created_utc": 1694106339,
   "score": 46,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkewkd",
   "message": "If you’re ever buying bulk gravel/sand/crushed stone from a local pit/quarry that has scales to weigh the amount of product you’re getting- you’re getting fucked because you’re paying for water. Most of these pits/quarries spray the living fuck out of their stockpiles before/during operation to make the material heavier in the truck. Never buy by the ton- always buy aggregate by the cubic yard. It’s a measure of volume- not weight. \n\nSource: I own a rock crushing business/multiple quarries and I charge by the cubic yard to not screw the public :)",
   "created_utc": 1694114700,
   "score": 174,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjrny3",
   "message": "They put little weights in lipsticks to make them feel more expensive so they can charge more.",
   "created_utc": 1694103925,
   "score": 191,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjz5ti",
   "message": "Zoos and museums are universally held together with double sided tape. The size or prestige of the organization doesn’t matter either.",
   "created_utc": 1694106460,
   "score": 247,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjudwp",
   "message": "There is a lot of money spent every year that decides where specific items are placed on grocery store shelves.  \n\nIf you're at a grocery store that's part of a chain, and you look at a shelf and there's an item that's approximately at eye level, I guarantee you that the company that makes that item paid a lot of money to put them there.  There's lots of weird psychological tricks that go on in terms of how stores are laid out.",
   "created_utc": 1694104846,
   "score": 220,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjobqb",
   "message": "I wouldn’t say it’s mostly a secret but agency staffing firms churn and burn college graduates who are basically thrown in the wild. The recruiter you worked with may be gone in six months and that’s why a lot of ghosting happens.",
   "created_utc": 1694102795,
   "score": 80,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjwwn9",
   "message": "When the health inspector shows up, a mad scramble happens in the back to clean the kitchen while they start the inspection in the dining/bar area of the restaurant.",
   "created_utc": 1694105687,
   "score": 29,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk03c1",
   "message": "The roses you buy at Valentine's Day were harvested around Xmas. It's the worst time of the year to buy roses and I don't mean because they're more expensive. They're also the worst quality because it's a longer holding time between harvest and use than any other time of the year.\n\nNever ever ever send flowers through an order processing service. Look at the location you're in or sending to and talk to a florist in that area directly. Don't pick a picture off some external website. Ask the florist what they have and can make that fits your budget. If you're worried, ask them to text you a pic of the completed design.",
   "created_utc": 1694106813,
   "score": 33,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjzvhg",
   "message": "High volume recruiters spend an average of 10 seconds looking at a resume.",
   "created_utc": 1694106721,
   "score": 218,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkecxc",
   "message": "HVAC guy here. Not really a secret but home owners sure think it is. CHANGE YOUR FUCKING FILTERS!!!",
   "created_utc": 1694114509,
   "score": 57,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkebss",
   "message": "If it’s the first time a professor is teaching a course, there is a good chance they are just one lecture ahead of the rest of the class.",
   "created_utc": 1694114498,
   "score": 134,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjha85",
   "message": "If your business uses an inventory company, your numbers will not be correct.",
   "created_utc": 1694100368,
   "score": 138,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk6dr5",
   "message": "People like to think that data analytics is some objective truth when there is sooooooooo much bias and room for subjectivity in data collection, analysis, interpretation, and communication. Oftentimes insights are cherrypicked datasets deliberately presented to make a specific point rather than having the data craft the conclusion.",
   "created_utc": 1694110487,
   "score": 158,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjyzjo",
   "message": "ex-farmer here. specifically, I worked at a \"bio-certified\" one. since there were no pesticides or herbicides used, every snail, every bug, every mouse had to be killed \"manually\" or by having a LOT of their natural predators around, ie. cats. \n\nthe reason? nobody buys tomatoes, or anything else with snail bites on them",
   "created_utc": 1694106398,
   "score": 38,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjqriw",
   "message": "My billable hours are not the actual hours",
   "created_utc": 1694103616,
   "score": 107,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjx0or",
   "message": "a very popular local bagel shop/bakery i worked at advertised all of our baked goods were homemade (dozens of muffins, danish, cinnamon rolls ect) and they were not. they all came from sysco, frozen on sheets. many customers would rave about the baked goods saying they were the best they’ve had. god bless them",
   "created_utc": 1694105726,
   "score": 76,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk2tqf",
   "message": "Locksmith here.\n\nWe can get into any lock/door within 30 seconds.\n\nAll the posturing and bringing out a impressive toolkit and hammer drill is just showmanship to pro long the call out.\n\n30 seconds flat.",
   "created_utc": 1694108135,
   "score": 234,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkavgy",
   "message": "Microsoft Excel runs the country",
   "created_utc": 1694113198,
   "score": 63,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjsvgy",
   "message": "When an app pops up with a 'do you like this app?' thing, the Yes button goes to the App Store for a review, the No button goes to an internal complaint process. This on average filters upset customers away from the app store and artificially raises app score by a whole star on average. That is the only way most corporate service apps have 4 stars.",
   "created_utc": 1694104337,
   "score": 122,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjn56m",
   "message": "When you go somewhere that has novelty beer dispensers that you and a group can take to your table, just know they are incredibly incredibly difficult to clean thoroughly and there’s probably mold in there.",
   "created_utc": 1694102402,
   "score": 136,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjtfzg",
   "message": "Aerospace has a phrase \"Get Healthy in Maintenance.\"    Underbid the contract to win to the work; then they over charge on the maintenance activities.  It's an investment strategy that pays well.   Many aerospace sites have \"cash cows,\" long term maintenance contracts that keep the money coming into the site.\n\nBTW - this is one of the reasons DoD spends sooooooo much.",
   "created_utc": 1694104530,
   "score": 212,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjxkxf",
   "message": "You have to know your way around health care to get good health care\n\nEdit: I had no idea this would get attention but I’m so glad it did.  Here’s a summary of some tips (thank you to many of the ppl in this thread for their own experiences and tips too!!)\n\nWhat you should know:\n\n1.  Your patient rights.  You can ask for a referral to a specialist. You can ask for second opinions.  You can ask to see what is in your chart.  Know your rights.\n\n2. If you have a family member in a hospital or long term care home, please visit and be there as much as possible.   When you are sick or old you are just not able to summon the energy to be on top of Med errors or even general care.   The more eyes on the care and environment the better for your family member.\n\n3.  Advocate for your family member.  Do some research too:  what is the illness? What are some options?  And take these to the doctor and ask if they’re appropriate (with the patients consent obviously) for the patient.\n\n\n4.  Follow up.  If the office doesn’t call you : FOLLOW UP.  Keep following up with offices, pharmacies, specialists, etc.  until you’re satisfied.\n\n\n5. If you are in the States, review your bill. Go over every item and see what can be negotiated and hound them until you feel it’s fair.  The squeaking wheel gets the grease.\n\n\n5.  Get a job in health care.  Not a clinician? No problem: environmental services and portering are excellent well-paying entry-level jobs that can get you potentially into a union.  You will learn hospital and health care really fast.  \n\n\n6. Before your family member goes home from hospital make sure you see a “discharge planner” or a “social worker” to talk about discharge.  Hospitals are full and they usually are pressed to send people home fast with health care at home being an option: but it’s not the only option.  Talk to the discharge planner and push back if you need to.  Look up questions to ask the discharge planner.\n\n\n7.  If you want the doctor to do/prescribe/refer something and they CHOOSE NOT TO, you are within your rights to say “May I have that option noted in my chart?  I’d like to keep track of what I’ve asked you about”.   Innocent, right?  Well it’s a good way to get the clinician to think about whether they want their rebuttal of your suggestion in the chart.\n\n8. If it feels wrong, please see someone else.  Don’t just blindly trust health professionals.  They’re people too.  They’re not magic.  Some are better than others.  read clinician reviews so you at least know what to expect.\n\n\nTo all those folks who go into appts with chronically ill family, or partners, you are guardian angels.   Keep doing what you’re doing.  It is more supportive (and the optics for the clinicians matter) than you know.",
   "created_utc": 1694105916,
   "score": 32,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjw73z",
   "message": "Nobody who actually sorts mail gives a shit about your package. The word fragile doesn't stop them from throwing it 20ft into a metal container.",
   "created_utc": 1694105449,
   "score": 8,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzj7wh2",
   "message": "Bedbugs are actually incredibly common in hotels. It’s just that nicer hotels generally have better means of treating them.",
   "created_utc": 1694096997,
   "score": 232,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjt42e",
   "message": "Wash all of your “new clothes”.  A very high percent has been worn and returned.",
   "created_utc": 1694104420,
   "score": 57,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkt8qb",
   "message": "Not all that much of a secret, but, i used to work in a peanut butter factory, we produced about 25-30-ish different storebrands ranging from very cheap to stupidly expensive, we had a grand total of 3 recipes, chunky, not chunky and no additives",
   "created_utc": 1694119550,
   "score": 82,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkgoep",
   "message": "Life coaches need life coaches the most.",
   "created_utc": 1694115319,
   "score": 6,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjiiat",
   "message": "more product hits the floor and then thrown back on the line than you know.\n\n\nsource: worked in a meat packing plant.",
   "created_utc": 1694100797,
   "score": 59,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjv8h3",
   "message": "If OSHA ever pays attention to small breweries, the entire industry is going to be shut down.\n\nEdit: Me, checking this comment just now.\n\nhttps://tenor.com/bin8m.gif",
   "created_utc": 1694105128,
   "score": 151,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjsmzh",
   "message": "Airlines often make more money carrying cargo than passengers. Also, they have much stricter contracts about delivering cargo on time than passengers. \n\nIf a plane is overweight, they will usually remove passengers before they remove cargo.",
   "created_utc": 1694104257,
   "score": 82,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjxwbs",
   "message": "The ice cream machine is not broken, no one put it in its cleaning cycle when it needed to be so they're locked out of it until they do the whole cleaning process.",
   "created_utc": 1694106025,
   "score": 43,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjrwyx",
   "message": "Whenever you see a high profile person publishing an opinion piece in a news outlet, 9 times out of 10, they didn't write that. The \"author\" came up with a 1-2 sentence concept of what they wanted to say; their second-in-command engaged whoever the ghostwriter is; the ghost created the copy; the high profile person's #2 reviewed for necessary changes; the high profile person themselves reviewed and signed off; and the #2 engaged marketing people to place the piece in a news outlet.\n\nIf you see an article from a CEO, a Sr. VP, a member of an elected body, anyone with status, they don't write their own stuff. This is not inherently bad - organization leaders are busy, and they have the resources to have a team oversee their public-facing thoughts, so they don't have to worry about it. Still, the opinion pages of just about every news outlet in America (and elsewhere) are populated largely by ghostwriters.\n\nSource: Am a ghost",
   "created_utc": 1694104013,
   "score": 133,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkdm7p",
   "message": "You don’t get the healthcare you need or deserve unless you advocate for yourself. Same goes for your loved ones.",
   "created_utc": 1694114248,
   "score": 80,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkdh6m",
   "message": "I worked in the moving and storage industry and if you EVER pay movers to pack and move your family, DEMAND an itemized bill and proof of service. \n\nThese people are out here RAKING people over the coals. Inflating box counts, charging for services not performed, etc. it’s not AS BAD if it’s COD but if it’s a corporate move for your job??  DEMAND IT. You might not be paying for it out of pocket, but it’s still showing on your income as taxable wages. \n\n**special note to say not ALL companies do this but ALL the ones I worked with did**",
   "created_utc": 1694114198,
   "score": 113,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjittl",
   "message": "75% ( based on personal experience)of the people working on volume build housing sites in the uk ( think persimmon, bloor etc )give zero fucks about the quality of their work as long as they get paid , and don’t have to go back and put it right .",
   "created_utc": 1694100910,
   "score": 222,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzj91mo",
   "message": "Wells Fargo (and other banks, WF is just the worst I’ve had experience with) likes to come up with ways to illegally charge you fees.  They then eventually get sued, pay a fine that is less than 1% of the profit they made on those fees, then finds a new slightly different way to fuck you some more.  Rinse and repeat.\n\nFind a good credit union.  Mega banks are all screwing you over.",
   "created_utc": 1694097411,
   "score": 196,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzj6oyk",
   "message": "Hotels don't change the comforter on the beds in between guests unless there's a noticeable stain on it. If the pillows are placed on a chair instead of on the bed at check out, housekeeping assumes they weren't used and puts them back on the bed without changing the pillowcases. All of this is due to cutting corners in housekeeping because the keepers are under strict timers for each room, and they have an insane amount of rooms to do everyday.",
   "created_utc": 1694096555,
   "score": 1,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk0gb9",
   "message": "None of your  restaurant food is \"made with love\". Anger and anxiety is what made that muffin, Tina, don't you forget it.",
   "created_utc": 1694107001,
   "score": 12,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzj4tfb",
   "message": "In the consulting world, nobody really knows what they're doing",
   "created_utc": 1694095851,
   "score": 65,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjqya8",
   "message": "The insane mark up on manufacturing cost to retail for prestige brand gold and silver Jewelry  (engagement rings aren't nearly so bad)",
   "created_utc": 1694103678,
   "score": 232,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkhefe",
   "message": "I use to work as a secretary at a roofing company.  \n\n\nA common practice of \"scumbag\" roofing companies (in regards to rubber row home roofs) - if your neighbor calls a scumbag roofing company and they fix their roof and then not long after you or another neighbor's house starts leaking - there's a terrible possibility that the scumbag company went out and knifed a hole in your roof.\n\n\u0026amp;#x200B;\n\nThey do this because your neighbor may recommend their company to you as their roof is no longer leaking.  Scummy move.",
   "created_utc": 1694115563,
   "score": 120,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjztgz",
   "message": "I'm way late to this party, but I used to be a political campaign manager and political office staffer.\n\nThe US government is run by an invisible network of interconnected staffers. The good elected officials are informed, but it's still the staffers who inform them. They write bills, they write bill summaries, they research the issues, they write the things the elected officials say. Without staffers, the vast majority of elected officials wouldn't have a fucking clue what's going on, and we have *an absurd* amount of influence over the information they base their platforms off of.\n\nOn the campaign side, the reason there aren't viable third party candidates in the US is that campaigns are highly complicated, absurdly expensive, and outrageously time consuming. Successful candidates even for your state legislative races really can't do it all by themselves, which is why everyone hitches their wagon to a party. Only ultra wealthy people can really afford to run their own successful campaigns, and even they usually need a party apparatus just to get the competent manpower required to run a successful campaign. Our first past the post means of voting virtual guarantees a two party system, because elections are just extremely difficult for individuals or small party organizations to campaign in.",
   "created_utc": 1694106701,
   "score": 117,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjppxr",
   "message": "IT certification companies that sell courses to \"get you into a well paid IT job by learning while you still do your day job\" are selling you a hollow dream.\n\nI did sales. Not a single person I, or my team, suckered into buying an expensive set of courses got a job in IT, anywhere, ever. Well, amost, the company did get a single student into a job, but it was with us. In the end after giving phone-ins 'Marks' the sales script I just use to say to them \"Now ask me how many people we've found jobs for.\" I got sacked when management listened to tapes of my phone calls. It was the only favour they ever did me.\n\nMost people just didn't finish the courses because they were too tired after work but the company knew this and still sold them.",
   "created_utc": 1694103265,
   "score": 167,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjyhmo",
   "message": "Cruise ship crew members are underpaid and overworked, to the point where it'd be illegal in most rich countries.\n\nExplanation:\n\nI worked for a company that serviced cruise ships while they were on-shore and in port.\n\nThe staff and crew on the ships (who actually travel with the ship) are often from developing countries and are really underpaid for the amount of hours they put in. Here in Canada (and I'm sure in the US too), it'd likely be below minimum wage.\n\nHow can the companies get away with this? Flags of convenience. Much like how cars have different license plates from different provinces/states, ships must also be registered to a jurisdiction. But because there aren't enforced rules about the ship ACTUALLY being from where they're registered, they tend to have \"home ports\" from countries where labour laws and regulations are more relaxed, and follow the rules from those places instead of their actual places of operation.\n\nThe crew puts up with this because despite being underpaid by wealthy countries' standards, that translates to a LOT of money in their home countries. So if they work for a few years on a cruise ship, they can gather enough money to put their kids through school or buy a new house back in their own country. So they tolerate it.\n\nThis is why you have so many ships that have \"PANAMA CITY\" or \"NASSAU\" painted on the rear as their home port, even if the company itself is based in Florida or something and the ship itself has never been to its own port of registry.",
   "created_utc": 1694106228,
   "score": 48,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjzjnq",
   "message": "I was in research in academia at an engineering school of Boilermakers (hint) and the principal investigators changed data to make it fit their hypotheses. The main principal investigator eventually became president at a school of Aggies (another hint) but was recently forced to resign and retire to get her completely out of the Aggie system permanently. (But let it be known that this doesn't necessarily mean that it's ex-president, Margaret Katherine Banks, and her husband, Arthur Paul Schwab.)\n\nI'm sure there's a lot more fraudulent data published by researchers at prestiguous research and academic institutions.",
   "created_utc": 1694106600,
   "score": 13,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjw65e",
   "message": "I've worked in the music industry for 10 years and have access to financials of nearly 15% of all artists' recorded music revenue. Nobody is making as much as you think. The superstar artists who look like millionaires are not, in fact, millionaires.",
   "created_utc": 1694105439,
   "score": 116,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkaelv",
   "message": "The Defense Department literally just spends money to spend it without any actual purpose just so they can say it was spent so they don’t receive less next year. In my building with 10 men the men’s restroom was gutted and remodeled 3 times in 3 years.",
   "created_utc": 1694112990,
   "score": 120,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjzi9h",
   "message": "In highschool, I worked in a warehouse for a major shipping company, loading semi trucks with packages. I saw a lot of people who didn't care or would get frustrated because of the work environment and start throwing packages, stepping on them, disregarding \"fragile\" labels, being rough with packages that obviously contained high value stuff like laptops and tvs.\n\n1. If you ship something, make sure you package it with sufficient bubblewrap.\n\n2. When a package is delivered to you, that box is FILTHY. You should probably wash your hands after opening it and do not set it on your bed or kitchen table,",
   "created_utc": 1694106586,
   "score": 112,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjteju",
   "message": "Worked in a distribution center for a major US clothing retailer. We took in a lot of clothing returns and to cut our costs we almost stopped inspecting the clothing altogether. If the plastic packaging isn't manufacturer labeled + sealed and is a generic plastic sealed bag there is a good chance someone else wore that before and it was not cleaned. \n\nIf you order clothing online please give your clothing a double check and wash them before you wear them.",
   "created_utc": 1694104518,
   "score": 198,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkdkz3",
   "message": "There is very little math in investment banking. (Trading, however, is different). They put up all kinds of gates to keep people out to chose “the best.” But all you need is good grooming and arithmetic.",
   "created_utc": 1694114237,
   "score": 115,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkarcw",
   "message": "Post covid recycling in America basically does not exist anymore. No one is taking the end product anymore so massive yards of processed material is sitting and degrading.",
   "created_utc": 1694113147,
   "score": 62,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzj5533",
   "message": "When you call a cable company to cancel you speak with sales first the deals they offer are not the best they can do.",
   "created_utc": 1694095974,
   "score": 190,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk00oo",
   "message": "Many therapists are still practicing after probation or punishment for really egregious acts, and they don’t have to disclose this to potential clients. \n\nIf a therapist actually gets their license revoked they often go into life coaching.",
   "created_utc": 1694106779,
   "score": 176,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzl0dpf",
   "message": "Las Vegas casino security:\n\nPeople kill themselves a lot in Las Vegas. They are always snuck out he back and guests rarely find out.",
   "created_utc": 1694121940,
   "score": 125,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjzwoo",
   "message": "While in the process of buying a car, the finance manager will openly discuss your financials (especially if very good or very bad) with most of the staff there after.\n\nThe 'closed door' meeting is mainly a disguise to make you feel comfortable so you will buy ad-ons.\n\nIn reality, you will get shit talked around the dealer if you have bad credit or they discover something interesting when running credit.\n\nAt the 3 dealers I worked at in 2 different states at the end of HS and through college...Every single one was the same.\n\nGod knows how much actual personal info gets tossed around haphazardly. I'll never finance through a dealer/manufacturer because of it.\n\nAs a side note - these 'finance managers' rarely ever have a background in finance. It's a lucrative position that most have to work their way up to... if you can deal with the hours. They're just seasoned car sales people.",
   "created_utc": 1694106733,
   "score": 55,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjqfeg",
   "message": "There are train derailments all the fucking time that don't make the news. Not all of them are hazmat related, but it happens a lot.\nEdit: in the United States, I didn't respond to derailments in Canada or Mexico.",
   "created_utc": 1694103504,
   "score": 187,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkvcjw",
   "message": "this isn’t necessarily a dirty little secret, but I work in a clinical laboratory at a big hospital. there is absolutely NO DIFFERENCE between pregnancy tests you get from the dollar store vs the $20 clearblue at cvs. they have the same. exact. technology.\n\nalso, we use cheap ass pregnancy tests in the lab. please save yourself, if you’re in the US, that $1000 ER visit and get a cheap ass pregnancy test. I promise they are no different.",
   "created_utc": 1694120253,
   "score": 136,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzj5375",
   "message": "Customer service reps are timed on calls so when we rush you, it isn't to be rude.",
   "created_utc": 1694095954,
   "score": 221,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk0650",
   "message": "[deleted]",
   "created_utc": 1694106852,
   "score": 87,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkylwl",
   "message": "Schedule your surgery as early in the day as possible. People in the OR get just as tired at the end of the day as anyone else.",
   "created_utc": 1694121344,
   "score": 209,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjxlz9",
   "message": "More people in the US die from simple medical mistakes than are reported.",
   "created_utc": 1694105927,
   "score": 44,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk3ndb",
   "message": "Most companies run on a patchwork of technologies and setup, often with items being left alone because it works but no one knows why or how. Most IT equipment is also the cheapest the company can buy. They see it as a cost and not as revenue so they don't care. Most older companies especially financial companies are still running off of the Terminal systems that were implemented decades ago, any new technologies they are using are often interfacing with these terminals at some point to remove the user interaction directly in the terminals. \n\nAlso the actual threat of cyber attacks are massive and companies have built some massive walls to protect the companies. It's mind boggling just how many spam/phishing e-mails are being stopped, the number of connections deemed as treats being blocked by the firewall and the constant user stupidity that needs to be fixed or prevented.\n\nEdit: I used to work for a financial company that wasn't a bank. Their main application, the one that ran the entire company was a 16 bit application. They were so far behind that when it came time to upgrade to windows 7 from windows XP after the extended end of life, they had to upgrade computers to windows 7 32 bit because 16 bit applications wouldn't work on 64 bit application. Since I was given a 64 bit PC and needed that app I needed this for my job, I called up IT and was told they're still testing out solutions. So they had close to 5 years to prepare for this and still somehow got blind sided by it",
   "created_utc": 1694108501,
   "score": 89,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjxu1x",
   "message": "When I was a mechanic at a Toyota dealership 18 years ago,of the £100 an hour labour charge you were paying,I earned £7 per hour of it.\n\nAnd today someone who’s left the trade in the last year,they told me they were on £11.50 an hour.In nearly 2 decades wages have risen by £4.50 an hour.And we have to buy all our own tools,which will tot up to the thousands over the years.Nothing subsidised by the employers,and no tax rebates or adjustments are given either.",
   "created_utc": 1694106004,
   "score": 105,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkp9de",
   "message": "I work in childcare. If your child has a milestone first at the centre, we don’t tell you. Taking first steps is the one that sticks out the most.",
   "created_utc": 1694118236,
   "score": 183,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjv36b",
   "message": "Cyber security. You have absolutely no clue how out of date and insecure the vast majority of the planet’s IT infrastructure is. But the problem is that infrastructure is built upon so heavily and is such an intrinsic piece of what came after that you can’t just swap it out or upgrade it. All you can do is build layers of defence around it.  \n\nThis is the important shit too. Nuclear systems, power stations, hospitals, militaries, banks, you name it. Your average office PC will be vastly more secure if it’s kept up to date than the PC that’s used to access all your medical records, because it isn’t held back by poor future proofing and still receives important security updates.",
   "created_utc": 1694105080,
   "score": 65,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkc12r",
   "message": "My buddy worked at our local movie theater (AMC), he told me the signs up front say \"no outside food or drink\" but their policy says they can't search or stop people even if they clearly have something, I told this to another buddy and he went next week with a whole tai dinner and a big gas station soda, cashier said it smelled good lol",
   "created_utc": 1694113675,
   "score": 73,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk8wa9",
   "message": "Nurses and doctors have too many patients and the nurses are on the front  line to alert the doctor on important changes in patient condition. Ideally a nurse should have no more than 4 patients who are stable but VERY FREQUENTLY nurses will have 6 to 8 patients and in that mix there are very ill individuals. We URGE you to read r/nursing frequently to get a true flavor of the atrocious dangers you are ALL in if you are a patient in the hospital. The medical establishment is gaslighting you with the nice websites, music in the lobby, smiling calm staff but behind the curtain we are all scrambling to make sure we don’t make errors but with all the stress, long shifts ….people are most likely dying from nursing and doctor errors. Most are avoidable if we weren’t stretched so thin. The industry will say there aren’t enough nurses and that is partly true but we’ve been in many many situations where there can be safer staffing numbers. Coworkers calling the hospital offering to work and they are declined. \nUnfortunately, the medical system is all too focused on financials to pay BIG CEO and upper management salaries and they answer to their shareholders interests and NOT you the patients. It is a dangerous time to be a patient. \nAgain, I beg you all….in mass….educate yourselves buy reading the nurse’s comment on how scared they are. Anything marked “vent” is most likely a good read on a stressful and dangerous shift for a nurse.",
   "created_utc": 1694112208,
   "score": 203,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzl0m23",
   "message": "I have seen how the sausage is made. Well, Slim Jims and it’s in damn-near NASA level clean room! By far the CLEANEST food production facility I’ve ever seen!",
   "created_utc": 1694122020,
   "score": 211,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkjtyl",
   "message": "Library workers could give zero fucks about your late fines.",
   "created_utc": 1694116408,
   "score": 43,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjidj9",
   "message": "Porta-potties are basically made to look clean and smell good when cleaned, they're not actually sanitized in pretty much any way.",
   "created_utc": 1694100750,
   "score": 142,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjwqa7",
   "message": "Fast food, cleanliness gets overlooked to an extreme amount. Cleaning things properly takes time, which means that is time that youre not making orders to sell to customers.   \n\n\nPeople like to say \"Just clean during downtime\" but there is no such thing as downtime. Because they will cut your crew to a skeleton, meaning you cant get orders out fast enough for there to be downtime.  \n\n\nPeople like to say \"Then clean at close\". Nope, because they want you out asap, as to not run up the labor time. Get what is needed to be done for the morning shift and GTFO",
   "created_utc": 1694105629,
   "score": 2,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjvn7c",
   "message": "I apologize in advance.  Do you ever set your groceries in the fold back child seat of your grocery cart?  Between children with leaky poop diapers, vomit, the dirty shoes when children stand up and the small pets that are often placed there, you probably should stop doing that.  The carts are not cleaned daily…not even close.  They are sanitized by professional steam cleaners, once a month.  ONCE A MONTH.  That’s the frequency the Health Department requires.  You’re welcome.",
   "created_utc": 1694105266,
   "score": 150,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzj6abf",
   "message": "Unless it’s a chocolate themed cafe, there is a good chance your hot chocolate is just made with the powder used to garnish your cappuccino. \n\nAlso although I never did this, I’ve known plenty of baristas who will give you the wrong milk, either by accident when they’re in a rush, or on purpose if you’re rude or sometimes when they think you’re just snooty with your milk choices. So if you’re lactose intolerant, be sure to mention it!",
   "created_utc": 1694096406,
   "score": 220,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk0i2m",
   "message": "Still surprises me people don't seem to know you're SUPPOSED to call and threaten to cancel. We don't mind. We're not going to give you the offers unless you ask for them, that would be financial suicide.",
   "created_utc": 1694107024,
   "score": 174,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzlcdbr",
   "message": "I used to do landscaping/mowing. All these people being like “I hire a professional lawn care company”. Like, no you don’t. You hire me and about 4 crackheads.",
   "created_utc": 1694126311,
   "score": 232,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzk5m89",
   "message": "Wash the top of your cans. Mice poop on those things all the time while they are in warehouse or transit.",
   "created_utc": 1694109897,
   "score": 94,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkjfqo",
   "message": "The casket industry is a massive rip off",
   "created_utc": 1694116270,
   "score": 84,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzjyz6d",
   "message": "Ask for copies of your medical records and documentation if a procedure or incident didn’t go the way it was supposed to. Chances are very high that somebody fucked up.",
   "created_utc": 1694106395,
   "score": 222,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzlb7za",
   "message": "I work in the cannabis industry. The DEA certified labs that test for compliance and potency are wildly inaccurate. We’ve sent tests to 7 different labs of the same material and received 7 different potency results.",
   "created_utc": 1694125877,
   "score": 80,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkemdm",
   "message": "I’ve been in IT for 20+ years. \n\nWe’re not smart. We just google shit.",
   "created_utc": 1694114601,
   "score": 87,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzkd6s3",
   "message": "If a trucker has parked there, a trucker has pissed there. No exceptions.\n\ne: And no, I don't mean in the bathroom of the adjoining property. I mean right where that truck has parked.",
   "created_utc": 1694114095,
   "score": 4,
   "submission_id": "16cgu14"
  },
  {
   "comment_id": "jzm90i4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16cgu14"
  }
 ]
}