{
 "submission_id": "16crzo4",
 "title": "How did you think babies were made when you were little?",
 "selftext": "",
 "created_utc": 1694124103,
 "permalink": "/r/AskReddit/comments/16crzo4/how_did_you_think_babies_were_made_when_you_were/",
 "score": 247,
 "url": "https://www.reddit.com/r/AskReddit/comments/16crzo4/how_did_you_think_babies_were_made_when_you_were/",
 "comments": [
  {
   "comment_id": "jzlb8tk",
   "message": "I don't recall a time where I gave the matter any thought without knowing the reality of it.\n\nLike, literally, until the day I was first introduced to the concept of birth, I don't think I *cared* where babies came from.",
   "created_utc": 1694125886,
   "score": 116,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlb1pu",
   "message": "Let me explain… in second grade, a guy asked me if my mother was a virgin, I replied ‘f*ck yeah’",
   "created_utc": 1694125812,
   "score": 234,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzleopy",
   "message": "I thought the president send people their babies when asked by mail.",
   "created_utc": 1694127224,
   "score": 43,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl7hsu",
   "message": "Magic. I thought that if a man and a woman love each other a lot, a baby will just automatically form in the woman's stomach. After nine months, the doctor's would have to extract it somehow, presumably by cutting - I think mom actually mentioned that she had a C-section and that she was put asleep and the doctors had to get me out.",
   "created_utc": 1694124465,
   "score": 163,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl6nu4",
   "message": "Thought they grew on trees. True story.",
   "created_utc": 1694124159,
   "score": 71,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzljvm1",
   "message": "So I was raised in a very conservative family . I never got the sex talk . Eventually when I was about 8 they let me know babies come from sex but didn’t tell me what sex was . So we were watching a movie with a very modest sex scene in it . They fast forwarded through the very lewd parts but I did see a tiny bit . One day my older sister asked me what I thought sex was . Me thinking I’m smart and remembering what little I saw in the movie we watched I confidently said “ two people slithering on top of eachother like snakes in a barn “ where I got the snakes and barn part from I’ll never know but I really thought babies came from just slithering on top of someone",
   "created_utc": 1694129274,
   "score": 107,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl7vjx",
   "message": "I thought that there was already a fetus inside the girls that would not grow and develop until the girls became women.",
   "created_utc": 1694124607,
   "score": 54,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl9n1y",
   "message": "I thought you bought them at a store because of a comment from my best friends mom",
   "created_utc": 1694125273,
   "score": 29,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlit92",
   "message": "Mommies want a baby, they go to the doctor and doc puts a little baby in her tummy, and it grows until it's ready, and then they go back to the doctor and they take it out. \n\nLater I learned that boys pee into a girl's butt and she gets pregnant that way. Boys are gross. \n\nThen I learned that boys get boners, and I wondered if it would hurt my butt or if they could just pee at it. Then my mom decided to tell me the full story. \n\nDid you guys all know that's not pee?",
   "created_utc": 1694128838,
   "score": 63,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl7ate",
   "message": "I thought women just magically got pregnant out of thin air. I told my cousin once that he wasn't my real cousin cuz I wasn't related to his mom (she married my uncle) and it isn't the dad that has the babies. Being a 3 year old at the time -- I was 5 -- he was absolutely crushed.",
   "created_utc": 1694124393,
   "score": 104,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl89vd",
   "message": "They grew like a seed inside the mother's belly.",
   "created_utc": 1694124753,
   "score": 22,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlc86o",
   "message": "That my dad traveled the world to find a baby fruit with a medicinal seed inside and when he returned, my mom ate the fruit and it took 9 months for the seed sprout into me. But in reality they were just raw dogging each other.",
   "created_utc": 1694126256,
   "score": 20,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzldk1c",
   "message": "I knew how they were made since I was little. My parents literally made me watch as they conceived my sister. Still haven't gotten over that.",
   "created_utc": 1694126788,
   "score": 20,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl7y0j",
   "message": "I thought that my mom ate someone and grew into a baby",
   "created_utc": 1694124632,
   "score": 18,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlf4lw",
   "message": "I thought that a couple had to makeout naked in bed and that the exchange of saliva somehow put a baby inside the Mom. I watched too many romcoms at an early age😂\n\nWhen I later learned that the penis goes into the vagina I was so confused cause I had no idea there was a hole down there and had to search for it😂",
   "created_utc": 1694127403,
   "score": 17,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlde8p",
   "message": "When two people kissed at the altar during marriage.",
   "created_utc": 1694126722,
   "score": 16,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlef9e",
   "message": "My mom was pretty upfront about pregnancy and delivery when she was pregnant with my little sister, but she didn’t explain conception because I didn’t ask. I think I thought that pregnancy just happened spontaneously when a man and woman lived as a couple with each other.",
   "created_utc": 1694127121,
   "score": 16,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl9e8q",
   "message": "I asked my mom and she told me the truth. \n\nEducate your kids folks. They can handle it.",
   "created_utc": 1694125178,
   "score": 15,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl9sls",
   "message": "I wasn’t entirely sure but assumed it involved butts for quite a while",
   "created_utc": 1694125333,
   "score": 14,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl7czz",
   "message": "I didn’t.\n\nThey just showed up, honestly.",
   "created_utc": 1694124416,
   "score": 60,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl6t5z",
   "message": "Same as I do now. Everyone made sure I was informed...",
   "created_utc": 1694124213,
   "score": 18,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlgvld",
   "message": "When I used to ask my dad where I came from he'd say he found me under a rock in the forest. Of course I would go look for babies under rocks too I but all I ever saw was dirt and those rolly-polly pill bug thingies, so gross thinking babies were just found THERE. Relieved to find out how they were actually made🤣",
   "created_utc": 1694128084,
   "score": 8,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlhkyc",
   "message": "I thought my parents rubbed stomachs together",
   "created_utc": 1694128363,
   "score": 8,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl6ng1",
   "message": "I thought santa was bringing them",
   "created_utc": 1694124155,
   "score": 14,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl6q13",
   "message": "i sincerely believed that a woman had a chance to shit a child",
   "created_utc": 1694124181,
   "score": 38,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl9f8x",
   "message": "When two people kissed.",
   "created_utc": 1694125189,
   "score": 28,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlkg2f",
   "message": "{{In Don Draper tone}}\n\n*I did not think of babies at all*",
   "created_utc": 1694129510,
   "score": 5,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlhcag",
   "message": "a man and woman had to lay next to eachother overnight and then pray to God",
   "created_utc": 1694128269,
   "score": 5,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlhtr1",
   "message": "I had seen my parents kissing sometimes so I thought that was the way. I was at the age where kids get jealous of any possible siblings at this point, so every time I saw them kissing I rushed towards them in order to separate them.",
   "created_utc": 1694128458,
   "score": 5,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlicu3",
   "message": "U could buy them off a hospital. The price was a cannula or a drip.",
   "created_utc": 1694128667,
   "score": 4,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlj7f3",
   "message": "I thought men had to pee in a women for a brief period of time, probably got that conclusion after watching animals mate",
   "created_utc": 1694128998,
   "score": 5,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlmhqg",
   "message": "A stork delivered them, of course. Wtf lol",
   "created_utc": 1694130373,
   "score": 6,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlcgwd",
   "message": "Pumpkin patch",
   "created_utc": 1694126351,
   "score": 4,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlcr9n",
   "message": "i just explained to my kids how they are made so this question makes me laugh",
   "created_utc": 1694126466,
   "score": 4,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzljbli",
   "message": "I just assumed that once a couple got married God just made the woman pregnant and they had a baby.",
   "created_utc": 1694129045,
   "score": 4,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlkn64",
   "message": "The government. I used to think that we lived in a totalitarian society and that the government were in complete control of everything.",
   "created_utc": 1694129594,
   "score": 4,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlo2dk",
   "message": "Thought that my parents found me under a bridge",
   "created_utc": 1694131023,
   "score": 4,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzldfs0",
   "message": "I thought the number of balls you had determined the amount of kids and they’d pass into the girl by kissing",
   "created_utc": 1694126740,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzle5km",
   "message": "I was informed pretty quickly on that but my experience is unique.\n\nI was born through a C-section, my sister was born through a C-section, most of my cousins were born through some C-sections. I believed some kind of C-section was the natural way to be born. I thought that midwives and such in middle ages were there to perform C-sections. And I always wondered how the fuck did early homo sapiens perform C-sections with like sharp bones or rocks, or when did we evolve to start getting C-sections? I grew up on a farm and I knew that cats, dogs, cows, etc. don't often get C-sections. But for humans it just clicked in my head as the default.",
   "created_utc": 1694127021,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlfi97",
   "message": "Made from mothers",
   "created_utc": 1694127552,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlfz1g",
   "message": "After a couple gets married, they just automatically have it.",
   "created_utc": 1694127734,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlik0g",
   "message": "The women in my family explained to me at the age of 6 that a doctor calls you sometime after reaching adulthood at the age of 18 to schedule a baby delivery date. The husband either pays to schedule the appointment or the government does after verifyimg that you have neen married and financially stable for quite some time.\n\nI found out the truth at 10 years old when someome dumped a nudie video on the sidewalk and a friend decided to play it.",
   "created_utc": 1694128742,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzljl5s",
   "message": "I thought the sperm went into the woman through belly buttons.",
   "created_utc": 1694129155,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzljra7",
   "message": "I thought you got pregnant when you kissed your spouse. I always feared accidentally impregnating someone if we kissed, lucky for me i never had the opportunity to kiss someone",
   "created_utc": 1694129224,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlk503",
   "message": "Magically babies appears in the womb after sometime when couples get married..  lol",
   "created_utc": 1694129384,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlmrey",
   "message": "Didn’t know how the cum came out so I thought men had to pee to get the sperm in.. really confused me as to why people liked sex so much if it was just peeing lol",
   "created_utc": 1694130485,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlmxzz",
   "message": "I thought that bird poop morphed into babies over time.",
   "created_utc": 1694130560,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlnroh",
   "message": "I thought they just grew in your stomach (NOT the uterus) randomly",
   "created_utc": 1694130900,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzm8dtk",
   "message": "Storks... I thought ppl trained them to steal babies from a factory and you would leave special treats on your door step as payment and encouragement for the stork to steal one for you. \n\nwas scared to death of birds for the longest time. would have a tantrum at the zoo when I saw a flamingo",
   "created_utc": 1694139279,
   "score": 3,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl6y8n",
   "message": "Before I knew what a vagina was I just assumed everybody was popping out butt babies and the only way to have sex and make a baby was anally",
   "created_utc": 1694124266,
   "score": 8,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzl776t",
   "message": "I was told babies were made when two people hold hands and their sweat combines into a baby. Doesn’t make sense now that I think about it but I believed it for a while.",
   "created_utc": 1694124356,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlbfd0",
   "message": "I knew babies came from sex as a fairly young child. My parents never sugar coated that. \n    But for some reason, as a kid, I thought you only had to have sex once to have multiple pregnancies. I seriously didn't fix that misunderstanding until early middle school.",
   "created_utc": 1694125953,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlc9y4",
   "message": "I was told that my dad drew a baby figure on my mom's stomach \u0026amp; that's how babies are formed 😅 I imagined it not with a pen but with a finger drawing, and the baby will magically appear. 😅",
   "created_utc": 1694126274,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlcv0w",
   "message": "Now that I think about it I don't think I was ever told. But one of my favorite shows growing up was Wild Discovery. So I think I already had a general idea and didn't ask questions when my older half sister was pregnant.",
   "created_utc": 1694126508,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzld0dw",
   "message": "I never thought of it before reproduction class. But after reproduction class I thought men leave sperms on bed so women come and suck them inside. Like why would both be naked in front of each others. Never thought that the two things fit either or there is a pleasure side. \n\nPS. scientifically this can actually work.",
   "created_utc": 1694126568,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlh371",
   "message": "I think i knew it was sex but i thought sex was like sliding a hot dog in and out of a bun, like j sliding between the labia horizontally 😭",
   "created_utc": 1694128168,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlhwyj",
   "message": "It's funny because I never even thought about it. I knew the stork thing was bs, but I just didn't care where babies *came* from. Listen, they're either here or they're not, but you couldn't have bothered me to look into where they came from... until puberty at least",
   "created_utc": 1694128493,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzll3gj",
   "message": "i lowkey thought kissing a girl on the lips would've made them pregnant...guess that's why quite when i was 14 i got my first kiss",
   "created_utc": 1694129781,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlmf3v",
   "message": "I knew how they really were made when I was around 7 but before that I believed a woman just thought enthusiastically about wanting to have a baby and it would pop up on their bellys and I was afraid I'd get pregnant by accident just by thinking about it.",
   "created_utc": 1694130343,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlmgcv",
   "message": "I thought you would buy them from the store and it was like build a bear where you would choose the color and the clothes and the name. So one time I told my parents I want a brother because I'm lonely since my sister's have each other and I have no one. They said ok. I said but since we are in Walmart, just buy one now and they started laughing. I was sad that day thinking why they didn't buy me a brother. Later in middle school I found out and thought \"no way my parents did that\"",
   "created_utc": 1694130357,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzln1nr",
   "message": "Babies R’ Us.",
   "created_utc": 1694130602,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlnvmi",
   "message": "Kissing.  Also, at one point, I theorized that pee had something to do with it.",
   "created_utc": 1694130945,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlnw1o",
   "message": "I honestly thought that they had to do a whole new wedding ceremony then the woman will be pregnant by literally wearing a wedding dress but the weird thing that I didn’t remember any wedding ceremony for my younger siblings thats when I knew the truth",
   "created_utc": 1694130950,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlruzl",
   "message": "I didn't really think about it much. Briefly thought about it once and realized I simply didn't know, then called it good.\n\nShortly after found porn and thought it was some ecclectic form of wrestling that people *really* liked, which honestly isn't too far off the mark.",
   "created_utc": 1694132592,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlsdfi",
   "message": "The Stork of course!",
   "created_utc": 1694132798,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlxwkw",
   "message": "I thought people would just randomly get pregnant and have kids, like it was random. You could be single but pregnant with no former partner. It was like a gamble",
   "created_utc": 1694135031,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlzb0r",
   "message": "I thought that when a couple wants to have a baby, the wife just goes “You know what? I think it’s time!” And Poof! She’s pregnant.",
   "created_utc": 1694135600,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzm0xxl",
   "message": "Bro i thought if you didnt take birth control, that a baby just automatically grew in you. \nNot nearly as horrifying as how I thought they came out. After I figured out it wasnt the belly button, i assumed the baby therefore claws and rips its way out the front of the stomach.",
   "created_utc": 1694136263,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzm3y2i",
   "message": "The movie, “Look Who’s Talking” helped me understand the birds and the bees at a super young age.",
   "created_utc": 1694137486,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzmty2a",
   "message": "I found a book about it in my grandfather's library when I was about 7. It was labelled for children between ages 6 and 9, had a lot of age appropriate pictures of the human body and how it develops with age, and it explained everything quite well. I never had to ask my mom that uncomfortable question because of that book. I plan to give it to my kid when he's able to understand it a little better so he can learn too.",
   "created_utc": 1694149604,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzn04ut",
   "message": "i thought if a man and a woman kiss the woman would be automatically pregnant 😭😭",
   "created_utc": 1694153653,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzn2maf",
   "message": "I had no idea. I think I believed that it was just one of the things in life that happened naturally by itself when you reched a certain age. A lot of things happens with our bodies as we grow, and for some reason I figured that becoming a parent was just part of it.",
   "created_utc": 1694155437,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jznbx9m",
   "message": "I once heard the word condom and my parents explained it was like a balloon that people could use if they did not want a baby. So I figured a woman would walk around all day holding a balloon if she didn't want a baby otherwise it would appear randomly in her belly. I also figured since I never saw a woman holding a balloon it meant every woman wanted a baby.",
   "created_utc": 1694162659,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jznjhqg",
   "message": "I thought that after u get married it just happens randomly",
   "created_utc": 1694168246,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jznkkik",
   "message": "Up until like 9 I didn't know guys had weiners. This is how it should be. You shouldn't know everything about gender until you're old enough to actually understand it all.",
   "created_utc": 1694168976,
   "score": 2,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlayvf",
   "message": "My parents kept me in the dark about that. I had to watch a PBS NOVA special at age 11. And it really grossed me out that women / girls have an opening down there where babies come out EWWW",
   "created_utc": 1694125783,
   "score": 1,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlxff3",
   "message": "Nobody ever lied to me. I was always given sex ed in an age appropriate way because I grew up in a culture that is honest.\n\nThe idea that there are societies that claim babies come from birds or whatever seems very egregious and creepy to me.",
   "created_utc": 1694134836,
   "score": 0,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzla8kc",
   "message": "I thought doctors had to cut a woman's stomach open to get the baby out",
   "created_utc": 1694125505,
   "score": 1,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlbc9p",
   "message": "I always knew they were inside the mother but I thought they would cut her belly and then saw it or something",
   "created_utc": 1694125920,
   "score": 1,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzlcvs4",
   "message": "I honestly never even thought about that. Then one day in school I overheard a group of kids talking about it and was like woah..",
   "created_utc": 1694126517,
   "score": 1,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzle7m2",
   "message": "Pooped into toilets with a basket",
   "created_utc": 1694127042,
   "score": 1,
   "submission_id": "16crzo4"
  },
  {
   "comment_id": "jzmhn4m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16crzo4"
  }
 ]
}