{
 "submission_id": "16cr55x",
 "title": "People who fell out with their best/close friend, what killed it?",
 "selftext": "",
 "created_utc": 1694122225,
 "permalink": "/r/AskReddit/comments/16cr55x/people_who_fell_out_with_their_bestclose_friend/",
 "score": 221,
 "url": "https://www.reddit.com/r/AskReddit/comments/16cr55x/people_who_fell_out_with_their_bestclose_friend/",
 "comments": [
  {
   "comment_id": "jzl6v1o",
   "message": "I worked with them. They were very lazy and constantly started drama between myself and our coworkers. Lost pretty much all the respect I had for them.",
   "created_utc": 1694124233,
   "score": 128,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlx7lz",
   "message": "Friends for 20 years. Helped her with rides, money, cloths ect.  The first time I asked her for anything was after my husband had brain surgery and needed meds the local pharmacy didn't have. I couldn't leave him alone and could not take him with me so I asked her to watch him for an hour. She said no she wanted to go to the store with her bf.\n\nI never talked to her again. And thank goodness she didn't have the balls to show up to my husband's funeral.",
   "created_utc": 1694134750,
   "score": 253,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlix2t",
   "message": "I was bff with mine from age 16 to 30. It slowly became apparent that she was a narcissist. I loved her anyway stupid me. When we were 30 we were all out at a restaurant and I went to use the bathroom. For some reason I could hear her voice clear as day and she was taking so much shit about me! I came out of the restroom, dropped some money on the table and told her to suck my ass. I left and never looked back. She tried to message me to tell me I was crazy. I blocked her. Last 13 years without her have been great",
   "created_utc": 1694128882,
   "score": 142,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlpdjc",
   "message": "She warned me about my fiancé at the time, now ex-wife, and I didn't listen to her. My fiancé didn't like that and told me to pick her or my friend. I picked my fiancé and then she eventually cheated on me multiple times including while we had an infant at home. Never been more wrong in my life.",
   "created_utc": 1694131572,
   "score": 27,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlzrqf",
   "message": "Nothing at all, and that is the saddest part. No big fight, no disagreement, no nothing. One day they met their now spouse and suddenly that was it. Since then radio silence",
   "created_utc": 1694135787,
   "score": 99,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlaome",
   "message": "Realizing that he was a shit friend who saw me as lesser than him, and he used that as justification to try and completely control my life",
   "created_utc": 1694125678,
   "score": 226,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlna3c",
   "message": "Best friends for 12 years. She was a complete bridezilla. \n\nLong story short, I was maid of honor and was expected to pay for multiple showers, ended up paying for part of her dress, and was asked to plan/pay for the entire bachelorette trip. I was in the process of building a house so I said no to the parties and trip (paying not planning/attending) and was swiftly booted from the wedding. \n\nFunny part was, the guy had been cheating on her and she knew and told me she was gonna leave him. She didn’t. She cheated on him back. He found out while I was with them, they broke up. Two days later I got a call they were engaged. So bizarre.",
   "created_utc": 1694130698,
   "score": 73,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlsukw",
   "message": "I was drugged at a bar by a creepy dude (not our friend but a friend of a friend). I was basically a walking zombie. I was featured on two of my “friends” snap story of me rolling around on the floor speaking incoherently. We all went back to my best friends place and the creepy guy followed. My other friend kept telling her to kick him out of her place and got bad vibes. She then left me alone in her living room with the guy while she had sex with some other guy. I was then sexually assaulted. You can only imagine my confusion waking up in the morning and piecing things together. The friend that was trying to kick the guy out, called me and told me to look up his name online. He was being charged and going to be serving time in prison for child sexual abuse. I felt left down by my “friends” that night. I haven’t been the same since. A part of me died that night, along with my best friend of 20 years.",
   "created_utc": 1694132998,
   "score": 123,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl38uf",
   "message": "They moved and stopping putting any effort into the relationship whatsoever. \n\nI offered to go there, I offered to fly them here (they hadn’t secured work yet) and they never made time. They never reached out. \n\nWhen I finally wrote and said it seemed apparent they’d lost interest in the relationship and I respected that but needed to move on rather than wait indefinitely, they refused to acknowledge anything had changed, and told me I sounded crazy. I asked why I hadn’t heard from them or seen them in a year and a half. No response. \n\nReality is subjective, as they say.",
   "created_utc": 1694122940,
   "score": 128,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzmkfrr",
   "message": "All these comments make me feel better about the friends I have lost. It makes me feel less alone. I’ve realized a lot of people have gone through similar, heartbreaking, situations with their friendships.",
   "created_utc": 1694144366,
   "score": 161,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl1as5",
   "message": "He started doing heroin",
   "created_utc": 1694122259,
   "score": 47,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzljson",
   "message": "I cared more about the relationship than she did. I’m not gonna beg anyone to be my friend.",
   "created_utc": 1694129240,
   "score": 162,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlknb4",
   "message": "I can’t be the kind of friend most people want.  depression, I’m always slow to respond, I don’t want to go out often.  Also time doesn’t seem to affect how I feel about friends, but people think it’s weird to get back in touch after a couple years and act the same.  It’s on me tbh",
   "created_utc": 1694129595,
   "score": 104,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl29i3",
   "message": "She adopted a pitbull, let it off leash immediately during the very first meeting with my dog, and her dog instantly attacked mine. Almost ripped her ear off. I had to literally beat the shit out of that pitbull to get it to release my dog. My ex best friend just stood there screaming and did nothing. The next day she reported MY DOG to the county as the aggressor. \n\nLuckily my dogs vet vouched that she was a sweet, completely non aggressive dog. She also submitted evidence of all of the injuries my dog had, while the pitbull only had injuries from ME, when I had to beat it to stop it from murdering my dog. Luckily my dog ended up having her name cleared, but that instantly killed a 12 year friendship. I never spoke to her again",
   "created_utc": 1694122597,
   "score": 48,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzldsy6",
   "message": "We were best friends in high school. I moved in with him in 2015 because I needed a place to stay, and his father offered to let me rent out a spare bedroom for super cheap. \n\nWithin five months, my friend made a romantic/sexual pass at me. I was not interested. This eventually escalated into fighting every day, which ended with him threatening to slit my throat with a knife. \n\nI left that night and have never looked back.",
   "created_utc": 1694126886,
   "score": 65,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzltzsv",
   "message": "He molested my daughter and her two sisters.",
   "created_utc": 1694133458,
   "score": 15,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm1q2k",
   "message": "I have adhd and am a terrible communicator",
   "created_utc": 1694136577,
   "score": 88,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlhx7k",
   "message": "I have no idea, but she stopped responding to texts or reaching out",
   "created_utc": 1694128495,
   "score": 163,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlsakh",
   "message": "She married an abusive husband. \nEmotional and verbal abuse that I know of (including personally being present for the abuse), though she once left, before being married, because she was concerned he would hit her…\n\nI tried so hard to be a safe space, but through a series of unfortunate meetings, I had to prioritize myself.\n\n\nOn a gentle note to others, I have had lots of great best friends, but growing up without a cellphone and social media being everything all the time, I have moved and changed, and previous relationships have naturally passed. And that’s OK. Enjoy the times you’ve had and the things you’ve learned.",
   "created_utc": 1694132765,
   "score": 82,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm9ddq",
   "message": "My son was delayed. Hers was not. Her son was roughly a year younger and there were constant snide comments about how much sooner her son hit milestones than mine did. I gave her the benefit of the doubt that maybe she didn't mean it the way it came across and I was just touchy. And then she called my 2 year old stupid because he was mostly nonverbal. She got told to fuck off. 😊",
   "created_utc": 1694139685,
   "score": 79,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzll0yo",
   "message": "She literally turned into her mother, only caring about appearances. At 23. I couldn’t take the judgment any more.",
   "created_utc": 1694129752,
   "score": 15,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl435r",
   "message": "I met her through one of my guy friends that I used to work with. We became extremely close. Hung out all the time talked about our issues. Thought I really knew her as a person. Then a year after she married my friend, she cheated on him with an ex and just left to be with the ex and his family. My guy friend was heart broken and so was his daughter who she had grown close to. I refused to even talk to her after that. Cheating isn’t something I will overlook or condone.",
   "created_utc": 1694123234,
   "score": 44,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlqozz",
   "message": "We did the party stage (drugs and alcohol) in our late teens / early 20s together.\n\nI had a kid in my early twenties and started focusing on my career, and moved into my own place as we were previously roommates.\n\nHe kept going on the partying until his mid-30s but had his kid and got married recently and you know… settled down.\n\nWhenever we run into each other, it’s always cordial and we catch up for a little bit, but we just stopped seeking each other out when we decided to follow separate paths.",
   "created_utc": 1694132123,
   "score": 58,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlr09n",
   "message": "When she told me to get over my friends’ deaths. (Btw my friends got killed right in front of me). And she refused to apologize.",
   "created_utc": 1694132249,
   "score": 150,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlt06e",
   "message": "She blew off my wedding to go to burning man with some dude that dumped her shortly after.",
   "created_utc": 1694133063,
   "score": 137,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlu4zh",
   "message": "It was my fault. I have bipolar, and I wrecked her 21st birthday party while I was manic.\n\nI apologised, but I’d done too much damage and she told me she didn’t want to see or hear from me again.\n\nThat was decades ago, and we haven’t spoken since.",
   "created_utc": 1694133516,
   "score": 96,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm0bso",
   "message": "Good close friend through high school. He was an only child of a single mother. Mom had to go out of town for a month during summer into freshman year of college. She didn't want him home by himself so we took him in for the month.\n\nMy mom woke up at 4am one day to get some water and heard noise from our den. Friend is in the pull out sofa in his boxers with my ex next to him with no shirt but a bra on. Her hands shot out from under the cover and she immediately said \"we weren't doing anything\". My mom let him stay one more night until he could find another arrangement. \n\nI tried to stay friends with him but that plus few other weird incidents killed it. The final straw was going to his new buddies apartment when we got to college to smoke hookah and weed. While there, his friend grabbed a revolver and pointed it at me and pulled the trigger. It was unloaded, and the only thing keeping me from punching this dude was the fact that he was clearly unstable and probably had bullets in his pocket. \n\nMy friend didn't see it as a big deal and had no idea why I didn't want to keep his company anymore",
   "created_utc": 1694136014,
   "score": 46,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl484b",
   "message": "school ended. Never heard from her again lol",
   "created_utc": 1694123282,
   "score": 166,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlpsdt",
   "message": "I’m just toxic :( got too many mental health issues, can’t hold down friends, fear of abandonment and all",
   "created_utc": 1694131747,
   "score": 158,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlzx3a",
   "message": "He cheated on his girlfriend a bunch. I couldn't support that, but at the end of the day it was none of my business. He acted like it was no big thing and said, \"I just need to get some strange every now and then. Afterwards our relationship is stronger than ever.\" Whatever, man. None of my business.\n\nBut THEN she cheated on him and it led her to finally leave him. He acted like it was the biggest betrayal he'd ever faced and he couldn't understand what would make her do such a thing to him. Again, none of my business, but at some point i just had to ask myself if that's really the kind of person I wanted in my life.\n\nI don't.",
   "created_utc": 1694135846,
   "score": 77,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzls2uz",
   "message": "He developed romantic feelings for me. One night he decided to drunk message my husband about how lucky he was to have me, he better treat me well, etc. Had to cut him off and end the friendship completely.",
   "created_utc": 1694132678,
   "score": 251,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzljnzh",
   "message": "She started doing A LOT of coke. She was always a little spicey, but the coke turned spicey into aggressive and bitchy. Final straw was when she started dating her dealer.",
   "created_utc": 1694129187,
   "score": 107,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlwvn3",
   "message": "showing me that we had different definitions of loyalty and always knowing that I couldn’t trust her to have my back, even though she undoubtedly knew I had hers",
   "created_utc": 1694134615,
   "score": 40,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlr23d",
   "message": "She found new, cooler, less ugly friends and suddenly I was \"an embarrassment\" to be around",
   "created_utc": 1694132270,
   "score": 131,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlp49y",
   "message": "Asshole wanted me who was barely affording to live where I was to save 2 - 3k to go to his wedding out of state. Wanted me to.pay for the suit, flight, lodging, food, and oh my gf wasn't allowed to come. Also wanted me to meet his female friends??? Told him couldn't do it and he blocked me on everything. Keep in mind this dude was making 100k plus, living with parents so not really paying rent. Also he told me 3 months before the date. Savings barely had $50 and with my bills I was barely making an extra $100 a month. \n\nOther BFF tried to convince me to convince a mutual friend to fuck him behind his gfs back. Started date rape drugging others. Left fast af",
   "created_utc": 1694131465,
   "score": 65,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlwm9z",
   "message": "Well it ended but was repaired. She got into a relationship with a walking red flag, and I told her as much. Things kept getting worse with him until I wasn’t able to watch it anymore. Then he convinced her that I was the toxic one and trying to control her so she didn’t want to be friends anymore. I told her he absolutely would hit her if he hadn’t already. I said I respected her decision to choose him over me, but please don’t delete my number and to call me when it came time to run. She did and she’s out, learned from it, and we’re friends again",
   "created_utc": 1694134508,
   "score": 69,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzltl96",
   "message": "I realized I was a second class citizen in the relationship and nothing I did would ever change that because their role depended on my role. Bye bitches.",
   "created_utc": 1694133302,
   "score": 93,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlbsyw",
   "message": "i was best friends with this person for almost 4 years. we were literally platonically married. it was always a 2-in-1 package deal, because EVERYBODY knew the other's number 1 (which was each other).\n\nhe, and two of my other really close friends, began spreading a rumor that i was racist and transphobic (with no proof). i lost almost all of my online friends because of it, and while i was crying over the entire situation every night, he was treating the whole thing like it was the funniest thing in the world. when my friend talked to him, he didn't take the conversation seriously at all.\n\nand before anyone asks: no. i am not racist or transphobic.",
   "created_utc": 1694126096,
   "score": 176,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlxnww",
   "message": "Best friend and I met a couple of girls late night. I didn’t hit it off with the girl I met but he did with his. He dated her for a few months and during that time he shared some weed. She broke up with him and 6 months later he found out she was an informant because he got arrested and sent to jail for 3 years. \n\nI supported him in jail visiting every couple of weeks and dropping off commissary goods that were acceptable. The day he gets out I drive to pick him up. First place he wants to go is to someone’s house and buy some weed / hang out with a friend. No hanging out with me, no thanks, just a free ride. Stung like hell. Didn’t hear back from him for few weeks when he needed another ride. I just hung up the phone and stared at the wall for an hour.",
   "created_utc": 1694134930,
   "score": 57,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlmdvm",
   "message": "They were jealous when I got engaged to now SO. They got a bracelet vs me getting a ring.  Wouldn’t commit to even coming to my wedding 10 mos away.  She told me that SO and I wouldn’t last.  I walked away. Didn’t tell her we were done,  just dropped the rope so to speak.  Ran into her right before her first divorce was final. Saw she’s now on marriage #3.  It is sad because we really were best friends.  But I could not deal with her jealousy. More the 30 yrs later SO and I are together. Better than ever.  Looking back now she and I were drifting apart because our life focus was different.  I was in college and she was pursuing a very different field.  She’s done alright. I’m happy for her. Last I heard there was some jealousy over something else in my life.  So I chose well to walk away.",
   "created_utc": 1694130329,
   "score": 117,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl36rm",
   "message": "She thought I was going to nick her boyfriend.",
   "created_utc": 1694122920,
   "score": 28,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm3sz8",
   "message": "Wish I knew. Best friend of over 10 years, maid of honor at my wedding. Saw her once after the wedding, then she kept blowing me off. Never gave me a reason and I’d be lying if I said it doesn’t still bother me.",
   "created_utc": 1694137428,
   "score": 28,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm4k5c",
   "message": "Heroin. He can't put it down. I tried for years to help him. \n\nNick, if you ever read this. Your parent's deaths were not your fault.",
   "created_utc": 1694137742,
   "score": 24,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlhfg5",
   "message": "I suspected her husband could be abusive, asked her if she was safe, and she flipped on me for \"accusing\" her husband of something like that. I told her I'd have done it again. For context it's an arranged marriage.\n\nWell I guess... irreconcilable differences in fundamental values.",
   "created_utc": 1694128303,
   "score": 48,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlly8n",
   "message": "We were arriving in a foreign city from different places, so at different times. She had the shortest distance to go and was the only one with a car. \n\nWhen one friend’s flight time was changed and she was going to be stranded at an airport an hour drive away, the dumped-friend refused to drive out to get her. There was literally no other way for the stranded-friend to get to us, she was going to be stuck alone in a foreign city overnight with no accommodation. \n\nWe cancelled the trip because I refuse to entertain women who leave other women in danger when they can help fix it.",
   "created_utc": 1694130145,
   "score": 50,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlyevn",
   "message": "One-sidedness.",
   "created_utc": 1694135238,
   "score": 52,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlxblz",
   "message": "Sadly, I discovered I wasn't as important to HER as SHE was to me. She got married (maid of honor of course), had kids (was in the delivery room for both), and slowly got...side lined. I didn't think about it that much. She's married now, got these kids, this ahole...um....anyhooo....So I didn't think much of it. Till her high school bestie moved back into town for a minute. And she started having OUTINGS. WITHOUT THE KIDS. WITH HER. When she was too busy to even CALL ME! I was so HURT!\n\nSo one day? I just quit calling her. \n\nIt's been over 20 years, sadly.",
   "created_utc": 1694134794,
   "score": 85,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlrxqg",
   "message": "I met the best friend I’ve ever had in high school and we remained super close in college but during our last year I became very depressed and withdrew super hard socially. It took a few years for me to bounce back and by then we had grown too far apart. We’ve spoken about it and she says she understands but we’ve never really recovered. There is too much distance. \n\nIt’s honestly one of my bigger regrets in life. I miss her all the time.",
   "created_utc": 1694132622,
   "score": 46,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm0odj",
   "message": "He was working towards a philosophy major. He was becoming more conservative, I was becoming more liberal, he never wanted to talk about ANYTHING but philosophy and politics and he loved to talk. It became exhausting, I found myself dreading spending time with him because the conversation would be exclusively politics even if I explicitly asked to change the subject it would quickly come back.\n\nThen COVID happened and we didn't see each other for a year. Then we just never reconnected and now it's been over 3 years.\n\nI still have other very conservative friends and family who I have great relationships with but politics isn't the only thing we talk about.",
   "created_utc": 1694136156,
   "score": 65,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl2q7p",
   "message": "Apparently me being gay 💅🏻 oh well",
   "created_utc": 1694122759,
   "score": 182,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlpneh",
   "message": "Friend #1: we were childhood friends.  I went to college and started a life of my own, she got married several times and had a couple of children.  We had two completely different lives. \n\nFriend #2: was a college friend that we remained in touch after college.  I even moved near her and her husband when I chose to relocate to another state for a job.  After a few years, and a trip to visit her out of state when she was separated from her husband, she had a bi-polar episode and accused me of doing something I didn’t do and told me she didn’t want to have anything to do with me any more. \n\nI’ve found much better friends that I have more in common with since then.",
   "created_utc": 1694131687,
   "score": 19,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm8bl3",
   "message": "Telling me what to do and how to feel.  I take advice, not orders.",
   "created_utc": 1694139254,
   "score": 22,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlzak0",
   "message": "They literally wanted to be me. They started dressing, acting like me and competing with me. Last straw was trying to basically take over my life by purposely not inviting me out in an attempt to isolate me from friends and would try to make a pass at any guy I expressed an interest in. So overall found out they were crazy and just wanted reactions from me so I cut them off and life’s been great since; although they still stalk my social media…",
   "created_utc": 1694135594,
   "score": 19,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlz1h2",
   "message": "I did. As I’ve gotten older my introversion has steadily worsened, and eventually pretty much everyone decides that you don’t want anything to do with them.",
   "created_utc": 1694135492,
   "score": 18,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzl67iw",
   "message": "\n\nLong one this one. Buckle up….\n\nWe’d been friends since school - well over 25 years. I’d been seeing my girlfriend (now wife) for a year or so and we’d been invited to a wedding of one of her oldest friends who was back to the UK from Australia for a short period to get married. They hadn’t seen each other in a few years and so she was thrilled to get an invite to see her friend and introduce me etc. We lived in the Midlands and the invite was Cambridge way. \n\n6 days after we’d confirmed our attendance we got a wedding invite through the door for a mutual friend of me and my bestie - a old school pal of ours who we both saw regularly. The wedding was for the same date as the other event. I had no prior knowledge that this would be the case. \n\nFactoring in we were originally down to attend the wedding service and reception for my wife’s friend, we thought we’d try and do our utmost to not offend either party by suggesting the following: \n\nGo to my girlfriend’s friends wedding service in Cambridge and then race back to the Midlands to attend the Reception and evening ‘do’ for my friends big day. Having confidently suggested this perfect solution to my friends prospective wife (when she chased for an idea of who was attending) I was told in no uncertain terms that we were “…either there for the whole day or not at all”. I was gobsmacked. We were doing our best to make both parties happy (including going back on our originally agreed full day attendance at my girlfriends’ friends wedding) to try and this was how we were being treated! \n\nI rang my bestie up - confident he would agree with the ridiculous posturing from our mutual friends prospective wife. Instead of being backed to the hilt, my friend told me he “couldn’t get involved” and whilst he understood what I was saying he countered that with a suggestion that I go to my friends wedding and my girlfriend attended her friends wedding - problem solved supposedly. \nI couldn’t believe what I was hearing for the second time that day. I told him we’d bent over backwards to be kind to both sets of people - especially when we’d had my friends invite almost a week after the other invite, but he just wasn’t having it and didn’t want to get involved (he was best man for our friend). I told him how disappointed I was in him and thought he’d see how ridiculous his stance was. \n\nWe didn’t speak for 12 months. I went for the full day at my girlfriends friends wedding and it was lovely. I felt a massive pang of bitterness towards my friend and our mutual friend (who ultimately was too weak to stand up to his prospective wife and overrule her pettiness. I’d known him for 25 years and her casually 2 years at this point).\n\nIt was a painful year away from my friend. On the anniversary of us last speaking I could take it no more. I emailed him simply with the words “I think a year is long enough”. He agreed and we slowly rebuilt bridges to get back stronger. We agreed to disagree on the matter but vowed not to go over old ground and look forward. I do still feel bitterness about the situation as it wrecked the relationship I had with our mutual friend. That has never recovered - even though we occasionally exchange pleasantries if we’re out in the same group. \n\nMe and my best mate simply realised our lives were enriched with each other in them - and simply had to overcome our disagreement. I’m glad to say our friendship - some 15 years or so after the event - is stronger than ever.\n\nTL:DR - Fell out with best friend over mutual pal wedding snub. Now repaired friendship.\n\nEDIT: Thought it worthy to add (after reading some of the delightful comments 😏) that I didn’t fall out with my friend because he didn’t get involved and / or speak to the couple to intervene. I never asked him to. We fell out because I was disappointed that he didn’t have an opinion when I asked him if me and my girlfriend were being unreasonable in our attempts to please both sides. I felt, rightly or wrongly, that our 25 years of friendship would allow him the comfort to have an opinion on such a matter - whatever it was. The irony is that we wouldn’t have fallen out if he’d have told me his opinion - good or bad. I regret falling out and in the manner we did.",
   "created_utc": 1694123992,
   "score": 120,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzllkt9",
   "message": "I proposed.",
   "created_utc": 1694129986,
   "score": 69,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm88mi",
   "message": "They discovered their boyfriend was making fake accounts and inappropriately contacting minors (average age being 8)  and didn't leave. I immediately ended the friendship. She went on to marry him and have a little girl. Still makes my stomach turn...",
   "created_utc": 1694139220,
   "score": 37,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm8ygn",
   "message": "Introducing my absolute best friend of years to my other friends. They created their own friend group without me:)",
   "created_utc": 1694139512,
   "score": 37,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlyvig",
   "message": "I got divorced because my ex was hitting my son (2 at the time). I knew my then friend was extremely religious but it had never affected our friendship until that point. Apparently I should have tried to work it out ¯\\_(ツ)_/",
   "created_utc": 1694135427,
   "score": 14,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm0f2w",
   "message": "His wife insulted me for over 10 years and he never said anything to stop her or stood up for me. I ain't gonna ask him to choose between me and the mother of his children.",
   "created_utc": 1694136052,
   "score": 15,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlpssn",
   "message": "They were brainwashed by Qanon.",
   "created_utc": 1694131752,
   "score": 117,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlue97",
   "message": "In all honesty I believe having my kids ultimately sealed the deal. I was focused on them while still trying to maintain relationships with my mates when I could, but they would just assume I couldn’t attended things due to kids so they stopped asking. Found out myself and another mate with kids were being left out of the group on invites camping, not even a thought or question.\nI asked in the end if anything was wrong as it seemed as if they were ignoring me, got completely ignored and no invite to a bucks trip when everyone else in out group of 5 got one.\nSucks a lot being mates since I can remember and it ends up being like this. But sometimes life starts a new chapter so looking forward to what’s next.",
   "created_utc": 1694133622,
   "score": 16,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzloo9j",
   "message": "She started dating this super religious guy and stopped talking to me, we were best friends for 20 years.",
   "created_utc": 1694131277,
   "score": 30,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlrkj9",
   "message": "Meth",
   "created_utc": 1694132478,
   "score": 12,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlv57o",
   "message": "No idea. I’ve tried to ask her multiple times in the past decade, but she hasn’t told me.",
   "created_utc": 1694133920,
   "score": 10,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlwvrx",
   "message": "I found out she was gossiping about me.",
   "created_utc": 1694134616,
   "score": 10,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzlx2ia",
   "message": "My best friend in high-school became a drug dealer.\n\nWe both played basketball, and his parents weren't well off and pretty absent, so he was always over at my family's house. If we weren't playing basketball together, we were hanging out playing video games, going to parties, getting into typical teenage mischief. Once we got to our final year of high school, he broke his leg really bad and missed the entire season. He had a scholarship offer that was withdrawn after his injury. He became depressed and started ghosting me. He started hanging out with older \"gangsters\" from his community and started dealing drugs, then dropped out of high-school (he had about 2 months before graduation). \n\nAfter high school, I went to university on an athletic scholarship and lost almost all contact with him. I would run into him a handful of times while I was in undergrad, usually at a nightclub. He would be wearing designer clothes and dropping a couple thousand dollars in cash on bottle service/drinks surrounded by his crew. He would always com6e say hi to me and buy me a drink, or invite me to his table, but it just wasn't the same. He had changed so much from the person I knew. \n\nHe wound up getting caught in a police sting operation targeting the Hells Angel's. He got caught on video/audio selling a couple of kilograms of cocain to an informant. He was sentenced to 4 or 5 years of jail, if I remember correctly. I haven't spoken/seen him since. I have friends who still live in the city where this all took place, and they see him around every once in a while since he got out of jail. They never had a chance to speak with him, but apparently, he drives around in a rather expensive Mercedes. I have no idea if he turned his life around or his still up to his old games.",
   "created_utc": 1694134693,
   "score": 11,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm0pav",
   "message": "Alcoholism",
   "created_utc": 1694136166,
   "score": 11,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm26c5",
   "message": "Jealousy is my best guess.\n\nWe were buds, and for a long time he was sort of in the driver’s seat, more established, and settled, doing well.  \n\nAnd good for him.  I never gave it a thought,   We were friends.\n\nHe was also a few years older than me.  \n\nI was fine with him, not jealous or anything.  I genuinely liked our friendship, and imagined we would be pals for a long time.\n\nWell, I kept working and hustling and doing better and better as I made my way with my work, and people around me noticed, were very supportive, happy for me, etc…but that’s when he started making little snide remarks, wise ass comments, including the most obvious one of all…you’re a big shot now — which I heard loud and clear, but let go.\n\nI let all of those remarks slide, and I kept what I was doing to myself, but others in the know, who were happy for me, woud tell him, hey your pal X is killing it, doing well.  (We all worked in the same industry, tho we were not competitors).\n\nLittle by little he just withdrew from me….I would call like I always did and say hey, what are you  doing, you want to grab lunch, go to a ball game….are you going to so ad so’s, you want me to pick you up, etc.\n\nHe started to decline or not even return calls.\n\nHe just sort of ignored me more and more and I eventually stopped — how could I allow myself to be treated like that forever?\n\nSo…that was that.\n\nOthers who knew us well, all told me…he was jealous…you took off and good for you, you deserve it, but he liked you being a few steps behind him.  He didn’t want you getting bigger than him.\n\nWtf.\n\nWho thinks like that?\n\nI didnt want to believe that, but Im clear I never did anything to this guy, in fact, I went overboard at times with calling him and even asked him f something was wrong….\n\nIt is what it is.\n\nAnd ultimately, it’s his loss.\n\nIt bothered me for a time, but no more.\n\nI worked for all I did and I have helped and continue to help, support, alot of people around me, and it’s my privilege to be able to do so.\n\nI figure now that he probably did me a favor, wasn’t meant to continue on with me, in MY journey.",
   "created_utc": 1694136758,
   "score": 11,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm42g3",
   "message": "I don't know. One day she just stopped responding. I do not know if I did something wrong, if she just decided that I am no longer worth her time, that she actually did not view me as a friend, etc. There was no fight, no argument just one day no more friend.",
   "created_utc": 1694137537,
   "score": 10,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzltozk",
   "message": "He got married and his wife decided I was “not the kind of person that they want in their mutual lives moving forward.” I’d never even met her, they lived in another country at the time,  but he \u0026amp; I were friends for twenty years. Strictly, absolutely, never crossed a line platonic, it’d be like kissing your brother, gross. I still get sad every birthday because his midnight phone call was the highlight of my year.",
   "created_utc": 1694133344,
   "score": 34,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm2jdc",
   "message": "During Covid she fell deep into Q-Anon conspiracies.  Story [here](https://www.reddit.com/r/QAnonCasualties/comments/n56ud1/antivax_conspiracies_turned_my_best_friend_of_ten/).\n\nI miss her so much.  :(",
   "created_utc": 1694136906,
   "score": 55,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzm9a8n",
   "message": "She had health problems and chronic pain. Apparently she couldn't handle most relationships and began isolating. I think it's the truth for a variety of reasons. Very sad. She is such a great person.",
   "created_utc": 1694139649,
   "score": 10,
   "submission_id": "16cr55x"
  },
  {
   "comment_id": "jzmv3av",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16cr55x"
  }
 ]
}