{
 "submission_id": "16cztrs",
 "title": "What seemed sexy until you tried it?",
 "selftext": "",
 "created_utc": 1694144810,
 "permalink": "/r/AskReddit/comments/16cztrs/what_seemed_sexy_until_you_tried_it/",
 "score": 49,
 "url": "https://www.reddit.com/r/AskReddit/comments/16cztrs/what_seemed_sexy_until_you_tried_it/",
 "comments": [
  {
   "comment_id": "jzn1dza",
   "message": "\"taking a roll in the hay\" \n\nex girlfriend was a farm girl and we had sex up in the hayloft of her dad's barn a few times...Spiders everywhere, the smell and sound of cows downstairs, and you don't realize how hard or sharp hay and straw is until you're naked rolling around with a girl and you get a piece of straw stabbing your asshole 😂",
   "created_utc": 1694154547,
   "score": 204,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmuxtf",
   "message": "Pop rock blow jobs.",
   "created_utc": 1694150217,
   "score": 17,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmnlxj",
   "message": "Sex on the beach. \n\nAnakin was right.",
   "created_utc": 1694145973,
   "score": 15,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmrzcl",
   "message": "Doing it in a forest, too many mosquitoes and poison ivy.",
   "created_utc": 1694148428,
   "score": 207,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmm5r7",
   "message": "Shower sex in a normal size shower",
   "created_utc": 1694145213,
   "score": 166,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmw872",
   "message": "I ate my wife's ass in the shower whilst on holiday and almost drowned",
   "created_utc": 1694151022,
   "score": 183,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmnphd",
   "message": "[removed]",
   "created_utc": 1694146024,
   "score": 14,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmmuv6",
   "message": "Sex in pool / hot tub / shower. The water removes any kind of natural lube and it’s all friction.",
   "created_utc": 1694145573,
   "score": 163,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmrm6r",
   "message": "Sex on a water bed. It's like running in sand.",
   "created_utc": 1694148212,
   "score": 130,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmr8b2",
   "message": "Sex on a lawn chair. We broke the lawn chair and I accidentally pulled my girlfriend’s (now wife’s) ass cheeks apart on the way down\n\nEdit: Oookay, a bunch of people are asking about the ass cheeks - fair enough… First off, she was fine, but it did leave a small (temporary) rip, and she was pretty pissed because that was the second time something like that had happened. The first time was earlier in our relationship when we thought that scene from The Fast and The Furious where Dom picks up Letty would be fun to imitate. My dumbass did that while she was naked and didn’t realize how unstable (wobbly) ass cheeks are as a lifting surface (I was young and stupid). So, I pretty much just ended up yanking her cheeks apart really hard and didn’t really get much of a lift. That also left a small rip. Needless to say, sex didn’t continue in either instance… Also, her ass is perfectly fine now, thanks for your concern - you pervs :)",
   "created_utc": 1694147985,
   "score": 156,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmq1mu",
   "message": "Shower sex.  The foreplay is great, the mechanics are not",
   "created_utc": 1694147303,
   "score": 185,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmpbwz",
   "message": "A lot of porn positions.\n\nThey look flattering so they film it, but they're not optimal for actually having sex. They're optimal for filming porn.\n\nThat could even apply to reverse cowgirl.  It's common. It can be sexy, until something goes wrong.",
   "created_utc": 1694146902,
   "score": 39,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzn5kff",
   "message": "It wasn’t me, but a friend of mine hooked up with a girl during a party, and they went to take a walk in the woods nearby to “enjoy themselves”.\n\nHalf an hour later they came back. His foot and leg was bit swollen, red, and with a lot of little spots. Same thing with one of her ass cheeks (they were both wearing swimsuits bc we're all swimming earlier).\n\nTurns out that they were making out a bit too hard and didn’t noticed that they were trying to do it while laying on an ant hill/nest.",
   "created_utc": 1694157613,
   "score": 245,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmolp9",
   "message": "I knew my wife was the one when she helped me clean melted ice cream and whipped cream out of my pubes.",
   "created_utc": 1694146506,
   "score": 158,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmv355",
   "message": "Shower sex. A normal shower feels really small when there's more than one person",
   "created_utc": 1694150311,
   "score": 14,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmwjfz",
   "message": "Scissoring. Basically just gave my vag major rug burn.",
   "created_utc": 1694151224,
   "score": 80,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmv4xl",
   "message": "The whole \"daddy\" thing. It just turned really awkward when I called my girlfriend that.",
   "created_utc": 1694150342,
   "score": 99,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmqvof",
   "message": "Cumming inside someone who is definitely crazy.",
   "created_utc": 1694147783,
   "score": 133,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmlfm2",
   "message": "Whipped cream on body parts.So sticky",
   "created_utc": 1694144854,
   "score": 145,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmuf4e",
   "message": "Oh god. The one time I emulated porn, it had to be cockslapping: I basically booped my girlfriend on the side of her mouth with my dick, and she just looked at me like \"what are you doing?\" And I sheepishly responded with a sort of \"oh, uh, nevermind,\" and we just sorta pretended it didn't happen.",
   "created_utc": 1694149894,
   "score": 251,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmq8gd",
   "message": "Edible underwear",
   "created_utc": 1694147410,
   "score": 12,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmnrei",
   "message": "any food being eaten off the body... whipped cream, fruit, pancakes... just a sticky mess..",
   "created_utc": 1694146053,
   "score": 202,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmqlhu",
   "message": "Road head. Totaled my truck and almost got my dick bitten off.",
   "created_utc": 1694147620,
   "score": 192,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmqvh9",
   "message": "Threesome. It always ends with two no-shows followed by sad masturbation.",
   "created_utc": 1694147779,
   "score": 99,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzn9d8h",
   "message": "Holding a Malteser on the tip of my dick under my shorts and when my gf at the time finally walked in after 5 min I asked if she wanted to suck on a Malteser \n\nShe says yes \n\nFlip my dick out \n\nGf pulls the grossest face. I look down to see malteser has melted everywhere, and my dick looks like it it covered in shit chocolate and bits of crumbed Malteser all over my knob ....it was gross",
   "created_utc": 1694160591,
   "score": 176,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzn6gf8",
   "message": "Sex in front of a mirror. She still looked great. But that guy with the dadbod that was fucking her needs to workout more. Damn! What does she see in that guy?",
   "created_utc": 1694158291,
   "score": 249,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmvo6w",
   "message": "Polygamy. Was with this woman who didn’t do monogamy. I was like “Ight that means I can also see other people, why not let’s try this out”. It was super organized too. The first month was just myself and her. Then she had to leave town to see another partner, it was my first time having this situation. She told me where she was going, when she was going. I set up a hookup through online dating. \nThe day that she was to be seeing the other guy, in at home and for the life of me I just couldn’t help think about her getting folded like a pretzel. Jealousy ensued. I hooked up with another chick but it felt like I was just doing it for solidarity and that also didn’t sit well with me. Well I learned I’m not made for those kind of relationships! I have nothing against it, just not for me…\nWhen she (girl number one) came back, and we got to doing the deed, she had a bruise in the vague shape of a hand on her ass, for me to stare at as I plowed along…She was into rough sex. Anyways not for me.",
   "created_utc": 1694150670,
   "score": 73,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmq7at",
   "message": "Edible panties , they're like panties made out of fruit roll ups. What a mess!",
   "created_utc": 1694147393,
   "score": 100,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmty2h",
   "message": "Had to come on my alt for this one. Holding a ding dong while they're peeing. Just is awkward and smells like pee",
   "created_utc": 1694149604,
   "score": 188,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmxrl7",
   "message": "I'm not a fan of degrading... in thought it's hot. Call her a slut, whore, bitch, etc.\n\nBut when it's the person you love and truly care about? It's a lot fucking harder (no pun intended). I just wanna call her beautiful and say how amazing she is :(",
   "created_utc": 1694152035,
   "score": 84,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmrtym",
   "message": "Anal. I begged my GF for like 6 months straight! Ugh. My butt still hurts.",
   "created_utc": 1694148340,
   "score": 56,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmnvdp",
   "message": "A jar of Vaseline",
   "created_utc": 1694146112,
   "score": 222,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jznap3r",
   "message": "Frequent sex during ovulation in order to have a baby",
   "created_utc": 1694161670,
   "score": 58,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmmg5f",
   "message": "Sex.\n\nIt’s amazing with the right person but terrible with the wrong one",
   "created_utc": 1694145361,
   "score": 21,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmrava",
   "message": "Having sex with someone who smokes. I remember when I was a teen movies with hot woman smoking was sexy to me. Then I watch them do an \"after sex\" smoke and it just heighten my arousal.\n\nOnce I was old enough to have sex I dated a smoker. The smell and breath was a big turn off. After sex she asked if she could smoke in bed. I said \"why not\". But I didn't have an ask tray so she used a waste basket and something in ti caught fire. As I went to put it off, she panicked and droppes some ashes on my mattress.",
   "created_utc": 1694148027,
   "score": 150,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmywrk",
   "message": "Having my wife lick red wine off my cock. We were enjoying some wine and getting frisky, Seemed like a fun spontaneous idea. I dipped my head in the wine and was immediately overcome my intense burning. Apparently there’s enough alcohol in red wine to make sensitive skin burn super bad. Immediately rinsed off and pain subsided. After a good laugh we got back to it and had a nice time. And that’s how I learned to not stick your dick in red wine.",
   "created_utc": 1694152810,
   "score": 214,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmw679",
   "message": "scissoring with another girl. It's all acting lmao.",
   "created_utc": 1694150986,
   "score": 217,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmrlmz",
   "message": "I tried giving a bj underwater at the beach. It sounded like a good idea until after my 2-3rd try. Then I became determined, and that's where my mistake was.",
   "created_utc": 1694148204,
   "score": 201,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzn38aw",
   "message": "3sum it was my ex girlfriends idea actually she insisted on it anyway she started throwing punches at me when I had my ding aling in the other chick",
   "created_utc": 1694155887,
   "score": 201,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmvuys",
   "message": "69. Listen, it can be sexy for some of yall, but I feel like I am both getting a half ass blow job and giving some half ass pussy eating. I may just not he dexterous enough, idk, but I rather go one first and then the other so we both get our full nut.",
   "created_utc": 1694150786,
   "score": 63,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmnv6o",
   "message": "Mirrors. Ill stick to watching others and apologize to anyone who has to see me",
   "created_utc": 1694146109,
   "score": 60,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmpknn",
   "message": "69. I'm sorry but I just cannot focus on the pleasure of being eaten out while also trying to suck dick. It just feels pointless, I enjoy it much better when we're just focusing on one of us at a time.",
   "created_utc": 1694147037,
   "score": 27,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzn1vqy",
   "message": "dirty talk lmao. i said ONE word and busted out laughing. very embarrassing. extremely.",
   "created_utc": 1694154902,
   "score": 120,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmm2hz",
   "message": "Ex and I got a hotel room with a jacuzzi. This was a total sex date, all about trying out new things. Well, one thing we tried out was pissing on each other, in the jacuzzi. We talked later and agreed that neither one of us really get that kink, it was kinda pointless.",
   "created_utc": 1694145169,
   "score": 25,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzms0v3",
   "message": "Surprised no one’s said lap dance yet. It looks sexy, but is the ultimate exercise in frustration.",
   "created_utc": 1694148454,
   "score": 101,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmmjyb",
   "message": "Triple blowjob.\n\nI'm not really well endowed enough to have one on each nut plus one on the shaft.\n\nKind of like an instantaneous, \"technically I've done it\"... but no room or space for actual adequate motion.\n\nSome guys just have all the fun.",
   "created_utc": 1694145414,
   "score": 143,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmlhb6",
   "message": "Before I started having sex anal seemed like the hottest thing out there. \n\nNow I'm just like... that's where poo is made...",
   "created_utc": 1694144877,
   "score": 108,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzn1pg4",
   "message": "Foursomes, seeing another man taking your girl on an express trip to pound town was too much for me. Relationship didn't last long after that one",
   "created_utc": 1694154776,
   "score": 139,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmwnws",
   "message": "69- too much going on for me. Sounded fun on paper but neither of us could really enjoy it.",
   "created_utc": 1694151305,
   "score": 69,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmw27a",
   "message": "Let me speed this along for readers, to save time. The majority of answers will be:\n- anal\n- beach\n- any body of water\n- shower\n- poly\n- public\n- group setting (3 or more)\n- swallowing \n- videoing\n- voyeur\n- cuck\n- pissing/shitting\n- pain\n\nGood night. 💤",
   "created_utc": 1694150915,
   "score": 42,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmpyg1",
   "message": "Cumshot. I did it to a girlfriend years ago.  It’s not as cool as PornHub makes it seem.  She complained her eyes burned.  Also, it just looked like she sneezed really hard.",
   "created_utc": 1694147252,
   "score": 23,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmtt0a",
   "message": "face-slapping. \n\nmy husband and i take part in some more extreme kink/roleplay stuff here and there, and the thought of being slapped always sounded hot when i would fantasize about it. over the years i've tried a few times with a few different levels of pain involved but it just pisses me off lmao.\n\ni really enjoy being slapped/hit until i'm welted and bruised on many sensitive parts of my body, but even a light slap to the face turns me off and makes me upset instead. it's one of those things i gotta keep in my brain instead of real life lol :')",
   "created_utc": 1694149519,
   "score": 159,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmvlv7",
   "message": "Sex in the woods. Seems cool until you start getting twigs and leaves in weird places and the mosquitoes find you.",
   "created_utc": 1694150629,
   "score": 85,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmx4f4",
   "message": "Men with \u0026lt;10% body fat.   \nIts beautiful to look at and feel - but holy moly is the sex painful. Its either pounding your pelvis into a rock or getting hit by one (yes, im male). It definitely skewed my preferences to dad-bods/bears.",
   "created_utc": 1694151605,
   "score": 49,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzmsnn7",
   "message": "this is very specific but sex on a counter. idk if there’s something wrong with our counters or whatever but they’re too tall to comfortably have sex on them.",
   "created_utc": 1694148826,
   "score": 77,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzn6xls",
   "message": "reverse cowgirl. pp hurts when bended in opposite direction.\n\nstick to doggy, i guess",
   "created_utc": 1694158664,
   "score": 23,
   "submission_id": "16cztrs"
  },
  {
   "comment_id": "jzob1cm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16cztrs"
  }
 ]
}