{
 "submission_id": "16e4c96",
 "title": "What's a societal norm in your culture that may come as a shock to people from different cultures?",
 "selftext": "",
 "created_utc": 1694261952,
 "permalink": "/r/AskReddit/comments/16e4c96/whats_a_societal_norm_in_your_culture_that_may/",
 "score": 130,
 "url": "https://www.reddit.com/r/AskReddit/comments/16e4c96/whats_a_societal_norm_in_your_culture_that_may/",
 "comments": [
  {
   "comment_id": "jztq5gh",
   "message": "We put our babies outside to sleep, even in winter and sub-zero temperatures.",
   "created_utc": 1694273245,
   "score": 248,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzuewj3",
   "message": "I've seen newcomers low-key freak out on remembrance day when everybody stops in their tracks for the minute of silence.",
   "created_utc": 1694282580,
   "score": 237,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzupy7i",
   "message": "Saying \"sorry\" isn't apologizing. Sometimes I say \"sorry,\" and it means \"fuck you,\" instead",
   "created_utc": 1694286690,
   "score": 18,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztwujg",
   "message": "Living with your parents until you’re married, even if you’re reaching your 30s.",
   "created_utc": 1694275822,
   "score": 22,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztv3o1",
   "message": "I guess slurping while eating? In a lot of Asian cultures and more, slurping is a sign that one really enjoys the food and think it is delicious— while in Western culture it is considered rude.",
   "created_utc": 1694275160,
   "score": 71,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztwvkq",
   "message": "buying anything you want and as much as you want from the local pharmacy without doctor's prescriptions in vietnam",
   "created_utc": 1694275834,
   "score": 86,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzus12q",
   "message": "My Catholic boss died, and one of the young Jewish employees, reading about the funeral arrangements, was asking what was meant by the term \"viewing\".  \n\nHe was absolutely horrified to find out, \"What do you mean the body is there in the room, in an open casket? You've got to be kidding.\"",
   "created_utc": 1694287467,
   "score": 219,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzu4db1",
   "message": "\nWe kiss in the cheek to say hell even with strangers and even men-men(men are very affectionate with each other).\n \nWe don't have that much of respect for our elders like you talk informally with your grandparents and you would talk with your parents almost like you do with friends. \n\nWe eat dinner late for most of the people. Like 10pm/11pm.",
   "created_utc": 1694278642,
   "score": 148,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzuqkr9",
   "message": "Working up until the day you give birth and then having to go back to work 2-6 weeks later depending on the company.",
   "created_utc": 1694286925,
   "score": 24,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzv73qp",
   "message": "Lack of electricity  - South Africa has, for years, suffered from an energy crisis - on a daily basis we experience load shedding (blackouts) which can last upto 4 hous at a time, multiple times a day.\n\nAt this point, we even have an app with a schedule we follow to plan for the blackouts.\nWe've become so used to it that we basically schedule our lives/activities around it, which is shit, but it's our norm",
   "created_utc": 1694293160,
   "score": 74,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztq6on",
   "message": "Washing your ass after a number 2. Always awkward explaining to people why there's a fancy watering can next to the toilet (a lota or handheld bidet)\n\nAnd that one water bottle.. (IYKYK)",
   "created_utc": 1694273258,
   "score": 17,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztvxq1",
   "message": "Your parents *forcing and/or bullying you* to choose *your* degree and job is fine.",
   "created_utc": 1694275478,
   "score": 141,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzufocb",
   "message": "In Asian culture. Relatives fight with each other. Because each one wants to pay the bill for the whole family, eating out.\n\n'I will pay. I am the most elder person. I have responsibility to the family'\n\n'No I will pay. Even though I am young. I earn well enough. To cover. Let me pay this time'\n\nThat sorta argument happens.\n\nWhen I tell it to westerners. They don't believe it.",
   "created_utc": 1694282863,
   "score": 178,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztnrcu",
   "message": "Babies don’t get named until after they’re born, it’s taboo to ask parents about names they’re considering, and everyone just calls the child various nicknames until the naming ceremony or christening, usually 1-2 months later.",
   "created_utc": 1694272322,
   "score": 233,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzuk86n",
   "message": "Very small one but it never fails to amuse me when I ask non-Asians to remove their shoes before stepping into my house. They act like I just asked them to strip down to their skivvies when all I want is to keep my floors clean. 🤷🏻‍♀️",
   "created_utc": 1694284555,
   "score": 54,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztdsig",
   "message": "Keep telling guests to eat more even when they refuse (insist for at least 2-4 times). \n\nPacking the leftover food for close relatives in marriages (or any other big parties). People often get offended if someone does not give them food.",
   "created_utc": 1694268234,
   "score": 78,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzu8ixs",
   "message": "The massive drink sizes at restaurants",
   "created_utc": 1694280200,
   "score": 109,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztdqkw",
   "message": "Tea ALL THE TIME. There's tea in the morning, tea at noon, tea in the afternoon and tea at night. There's coffee too but there is ALWAYS tea.",
   "created_utc": 1694268212,
   "score": 12,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzu0b5k",
   "message": "Casually swearing in everyday conversation",
   "created_utc": 1694277132,
   "score": 94,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzufwsz",
   "message": "Growing up, I had a friend who was born in Bangladesh. When his family first immigrated, they didn't realize going down to the local park and killing a duck for food is not normal here in America...",
   "created_utc": 1694282948,
   "score": 161,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztbuz5",
   "message": "Being naked isn't a big deal. We have public places for being naked, are naked in the sauna, etc. \nMixed genders of course. Nobody cares.",
   "created_utc": 1694267383,
   "score": 230,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztxeql",
   "message": "friday 5 pm to early sunday you can drink as much as you want and that is okay but having a glass of wine with food outside of that schedule makes you alcoholic.",
   "created_utc": 1694276035,
   "score": 44,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzv8q3b",
   "message": "Wow, so many intriguing comments! Thank you to everyone that took the time to share something and answer my question \u0026lt;3 Feel like I have a much broader perspective on other cultures now. This question came to mind because I recently visited a lovely, elderly couple (family friend) and I experienced some cultural shocks myself. Firstly, their children addressed them by their first names. Secondly they were allowed to wear shoes indoors, even while laying on the couch! I live and have been raised in the UK but I have an asian upbringing (where neither of those things would be commonly tolerated), so witnessing a cultural shock like that really fuelled my curiosity XD",
   "created_utc": 1694293764,
   "score": 40,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzt2yqg",
   "message": "Paying for a licence to watch TV",
   "created_utc": 1694263121,
   "score": 59,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzt83ey",
   "message": "Apparently, being friendly to strangers. \n\nWhenever a question like this comes up, one of the top culture shocks non-Americans claim to have when visiting is how friendly and welcoming Americans are.",
   "created_utc": 1694265666,
   "score": 135,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztukpl",
   "message": "Drinking, non stop drinking. welcome to Britain!",
   "created_utc": 1694274950,
   "score": 73,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzt2ucf",
   "message": "Children being treated as their family's breadwinner or parent's retirement plan.\nToday's generation is working hard to slowly eradicate or atleast make that more manageable though.\nIn short, we do our damn best to set up boundaries.",
   "created_utc": 1694263056,
   "score": 236,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzt2z5d",
   "message": "We’re not allowed to touch people with our left hand because it’s assumed that’s that hand you use to wash your anus (most people wash themselves with water instead of toilet paper)",
   "created_utc": 1694263127,
   "score": 115,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztg7mg",
   "message": "We dont use our finger to point at the person or object. Its considered impolite.  We use our hand to refer to it.",
   "created_utc": 1694269274,
   "score": 63,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztrrxs",
   "message": "Putting your napkin on your lap while eating at a restaurant. I did this at the Hereford restaurant in Reykjavik, Iceland and the waitress was extremely confused.",
   "created_utc": 1694273872,
   "score": 77,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzu1zf8",
   "message": "Eating raw jerky salty fish as a celebration kept for 6000 years",
   "created_utc": 1694277749,
   "score": 19,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzu7u3g",
   "message": "How much it costs to die here.\n\nSo many people from other countries comment on the cost of handling the body, funeral, burial....",
   "created_utc": 1694279944,
   "score": 21,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzulcuc",
   "message": "Thou shalt not drink cappuccino after 11:00 ante meridiem.",
   "created_utc": 1694284979,
   "score": 23,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztpyj9",
   "message": "The shoey. The act of drinking a beer from a shoe.",
   "created_utc": 1694273170,
   "score": 44,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzv325i",
   "message": "Gay people are allowed to marry and show affection in public.",
   "created_utc": 1694291656,
   "score": 37,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzt6g4i",
   "message": "Offering food and alcohool if you are a guest and insisting rather often to try it even if you refuse to taste everything.I grew up to hate this sort of pushy hospitality. :))",
   "created_utc": 1694264891,
   "score": 83,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzud2lw",
   "message": "Guns. Guns everywhere.",
   "created_utc": 1694281895,
   "score": 110,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzt1843",
   "message": "Eating with your (right) hand, apparently",
   "created_utc": 1694262200,
   "score": 18,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztcsxc",
   "message": "We shun manual labor but religiously hit the gym, or run/bike streets or trails for miles on end in pursuit of peak physical fitness.",
   "created_utc": 1694267800,
   "score": 50,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztub5t",
   "message": "That we ARE normal.  \n\nWe don't all play bagpipes, wear kilts or eat haggis at every meal.  And I've never heard someone say \"Hoot mon!\" in my life.",
   "created_utc": 1694274849,
   "score": 52,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzu5t3f",
   "message": "Being barefoot is considered normal. Many children walk barefoot to school (they have shoes, just choose not to wear them). You'll see barefoot people in supermarkets and fast foods.",
   "created_utc": 1694279192,
   "score": 35,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzu45qi",
   "message": "People's lives being dramatically affected by the cost of healthcare.\n\nPeople staying at jobs or in marriages solely for the healthcare, people living in agony because they can't afford healthcare, bankruptcy due to healthcare debt being common.",
   "created_utc": 1694278562,
   "score": 116,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztake1",
   "message": "If you make money and have high status, it is perfectly normal to fuck your secretary and have a mistress. In fact, it is expected.",
   "created_utc": 1694266799,
   "score": 65,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztlerz",
   "message": "Our drinking culture (UK)",
   "created_utc": 1694271399,
   "score": 47,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzup6of",
   "message": "Denying life saving care to people that can't afford it so that insurance companies can profit.",
   "created_utc": 1694286406,
   "score": 100,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzvlmvu",
   "message": "Making family reunions, barbecues, and birthday parties by occupying 2/3 of the street in front of your house. Filling the sidewalks and half of the street with plastic tables and chairs. Children running amok in the street. Loud music. Drunk babbling until 3 AM with no regard for neighbors.",
   "created_utc": 1694298848,
   "score": 12,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztlov5",
   "message": "Not offering food to your childrens friends when they are over for a visit. It's quite common for them having to wait in the room while the family eats.",
   "created_utc": 1694271509,
   "score": 27,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzugna5",
   "message": "that sweet corn is a top tier ice cream flavour😮‍💨 IYKYK",
   "created_utc": 1694283226,
   "score": 9,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzvm9ci",
   "message": "Spitting on babies or anyone precious to us to ward of bad intent/ or like echar ojo. Nowadays we mostly just make little spitting noises pu pu pu and pat their heads a little. Sephardic culture",
   "created_utc": 1694299100,
   "score": 10,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztew2i",
   "message": "Cosleeping with babies til toddler or until they decide that they want their own bed 😅",
   "created_utc": 1694268715,
   "score": 36,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jztnxpk",
   "message": "It's impolite to say \"no\". People say something like \"Well, it's kind of hard right now\" instead.\n\nIt's also impolite to talk about money.\n\nWhen foreigners try to hire a native to do something and the latter politely refuses, often the foreigner will offer him some extra money and thus offend him. So the native, fuming, will say anything to get rid of the annoying foreigner, who later gets really surprised when the guy he thought he had hired doesn't show up.",
   "created_utc": 1694272388,
   "score": 31,
   "submission_id": "16e4c96"
  },
  {
   "comment_id": "jzv16wz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16e4c96"
  }
 ]
}