{
 "submission_id": "16enk8h",
 "title": "What celebrity death seems a bit too suspicious?",
 "selftext": "",
 "created_utc": 1694310729,
 "permalink": "/r/AskReddit/comments/16enk8h/what_celebrity_death_seems_a_bit_too_suspicious/",
 "score": 89,
 "url": "https://www.reddit.com/r/AskReddit/comments/16enk8h/what_celebrity_death_seems_a_bit_too_suspicious/",
 "comments": [
  {
   "comment_id": "jzx0no2",
   "message": "Haing Ngor - \n\n  Oscar and Golden Globe winner for The Killing Fields. Cambodian and former prisoner of the Khmer Rouge. Tortured and imprisoned in Cambodia. Murdered outside his home in Los Angeles. His family thinks it was revenge from Cambodia for his outspoken support for human rights and bringing people to justice in Cambodia.",
   "created_utc": 1694321835,
   "score": 22,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzyfbp4",
   "message": "\nShelly Miscavige , wife of Scientology leader  David Miscavige.  Disappeared  2013 after vocally  coming out against the practices of  Scientology.   Lawyers for the cult - I mean religion - still maintain she is alive and living a private life devoted to Scientology.\n\nRight.",
   "created_utc": 1694349721,
   "score": 249,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxsbvx",
   "message": "Sridevi\n\nShe’s a Bollywood actress who died in Dubai from accidental drowning in a bathtub, the day after a wedding where she was in perfect health and she had a huge life insurance which would pay only if she dies in Dubai.",
   "created_utc": 1694337658,
   "score": 112,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzx094k",
   "message": "Brian Jones of The Rolling Stones died under suspicious circumstances while swimming. The person he was swimming with (a contractor working on his house who Jones had accused of stealing from him) supposedly confessed on his deathbed to killing Jones.",
   "created_utc": 1694321597,
   "score": 210,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwm3tl",
   "message": "Jill Dando\n\nShe was a British TV presenter, news reader and journalist. She was shot on her front door step and it's never been solved.\n\nAlso Dr David Kelly, not exactly a celebrity, but he was a known public figure, he was a weapons expert that supposedly killed himself shortly after saying that the report on Iraqs nuclear weapons had been fudged.",
   "created_utc": 1694314309,
   "score": 68,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwoeyn",
   "message": "Nicole Brown-Simpson. From what I hear, her ex is still trying to find the real killer.",
   "created_utc": 1694315422,
   "score": 221,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwkg8c",
   "message": "Dorothy Kilgallen, reporter and TV personality. Died under mysterious circumstances while investigating Kennedy's assassination.",
   "created_utc": 1694313542,
   "score": 31,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwu784",
   "message": "[deleted]",
   "created_utc": 1694318292,
   "score": 38,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwgenl",
   "message": "George Reeves, the guy who played Superman in the 50s.  There were a bunch of people in his house the night he died, and a lot of conflicting stories, also he was having an affair with a studio exec's who was in attendance with his husbamd that night. Also forensics disagree with the testimony of the witnesses. It's all a clusterfuck",
   "created_utc": 1694311717,
   "score": 52,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxfjpl",
   "message": "In my hometown of St. Louis, Missouri, there was a sculptor and entrepreneur by the name of [Bob Cassilly.](https://en.m.wikipedia.org/wiki/Bob_Cassilly) His works, whimsical and larger than life, are all over the city. The crown jewel of all this is the wacky home of repurposed industrial materials into a crazy sort of playground, the popular [City Museum.](https://www.citymuseum.org)\n\nHe was a notoriously driven worker, and in 2011 he died in an apparent bulldozer accident working on a new outdoor art playground project he called [Cementland.](https://en.m.wikipedia.org/wiki/Cementland)\n\nHis death was even investigated, but again ruled accidental, despite one medical expert saying he had been beaten to death and the bulldozer accident was staged. \n\nNot a true celebrity, but a local legend here to be sure, and a person who left an indelible mark on this town.",
   "created_utc": 1694330882,
   "score": 91,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxm5ee",
   "message": "Don't know if he qualifies as a celebrity but Yuri Gagarin, Russian cosmonaut and the first man in space. After the kremlin sent one of his friends to certain death on an extremely unprepared rocket ship, in a desperate attempt to catch up with USA's progress, Yuri, a Russian hero and one of the most popular figures at the time, criticised the kremlin and blamed them for the death of his friend. Not too long after, he died when he allegedly lost control of his Mig-15. The official explanation given by the Kremlin is full of holes and to this day no one really knows what happened but, it seems obvious to some, that whatever caused his crash, the kremlin was responsible for it",
   "created_utc": 1694334399,
   "score": 120,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwu1cg",
   "message": "Dorothy Kilgallen. She was an investigative journalist and game show panelist on What’s My Line? She was digging into JFK when she died of an overdose. Her manuscript on JFK was taken by the govt and will never see the light of day",
   "created_utc": 1694318206,
   "score": 218,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxb1ez",
   "message": "I’m struggling to think of the name, but that spy that killed himself and then managed to padlock himself in a suitcase. \n\nGoogled him, Gareth Williams\n\nDeath ruled “probably an accident” https://en.m.wikipedia.org/wiki/Death_of_Gareth_Williams#:~:text=Gareth%20Wyn%20Williams%20(26%20September,London%2C%20on%2023%20August%202010.",
   "created_utc": 1694328390,
   "score": 131,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzx78z9",
   "message": "Not a \"murder\" or \"death\" and not really a \"celebrity \" but... WHERE is Shelly Miscavage?",
   "created_utc": 1694326008,
   "score": 136,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwy07g",
   "message": "Elliot Smith.  \n\nArguing with his girlfriend and then when she goes to take a shower in the middle of their argument, he suddenly decides to stab himself twice in the chest with no hesitation wounds. And of course she pulled the knife out before calling 911. And I think I’ve read she has exhibited so weird behavior before and since.",
   "created_utc": 1694320364,
   "score": 152,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwt45a",
   "message": "Y’all it would be nice if you include your reasons and not just post a name like we’re supposed to know all about it.",
   "created_utc": 1694317735,
   "score": 34,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxym46",
   "message": "It’s suspicious that Gary Busey isn’t dead.",
   "created_utc": 1694340965,
   "score": 17,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzweq6b",
   "message": "Marilyn Monroe’s death",
   "created_utc": 1694310969,
   "score": 90,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxl9tm",
   "message": "Is Karen Silkwood a celebrity?",
   "created_utc": 1694333928,
   "score": 60,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwqtrk",
   "message": "Didn’t John Mcafee get “whacked” tattood on himself or some shit just before he died? I may be wrong",
   "created_utc": 1694316579,
   "score": 208,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzweahp",
   "message": "Epstein.",
   "created_utc": 1694310770,
   "score": 202,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwv64l",
   "message": "Yevgeny Prigozhins flight crash",
   "created_utc": 1694318809,
   "score": 73,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwh7va",
   "message": "Brittany Murphy for sure...",
   "created_utc": 1694312085,
   "score": 177,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwq234",
   "message": "Not a celebrity but a notable person: Lee Harvey Oswald",
   "created_utc": 1694316199,
   "score": 59,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxc1ak",
   "message": "Gary Webb author of dark alliance, the explosive series of articles in the San Jose mercury news in1993 that exposed the cia operation to finance the war in Nicaragua with cocaine money. Cheap cocaine flooded the streets of America and started the Crack epidemic. His article was attacked by the mainstream press.  He lost his career and reputation.  He \"committed suicide\" in the early 2000s and was found to have 2 self inflicted gun shot wounds.",
   "created_utc": 1694328979,
   "score": 53,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwekwk",
   "message": "Natalie Wood.",
   "created_utc": 1694310901,
   "score": 143,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwrnj8",
   "message": "Dorothy Killgalen's death has got to be one of the most suspicious. There are many who feel she was about the break the real story behind JFK's death, but then suddenly she was dead.",
   "created_utc": 1694316994,
   "score": 28,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzzo206",
   "message": "This might be stretching the definition of \"celebrity\" but Rudolf Diesel, inventor of the diesel engine (and kind of a big deal in his day) died under really suspicious circumstances.\n\nOn September 29th, 1913 Diesel boarded a ship in Antwerp, Belgium on his way to a business meeting in London. He never arrived. His bed was never slept in, his shirts remained unpacked and his pocket watch was open on the night stand. The crew found his hat and overcoat neatly folded by the aft railing of the ship. The last entry in his diary was simply a cross on the day of the 29th\n\nAbout 10 days later they found a body in the channel that was eventually ID as Diesel. Pretty straightforward suicide, right?\n\nThe thing is, he gave his wife a bag when he left with instructions to open it upon his death. It contained 20,000 Marks (about $120,000) the whole of the Diesel's bank accounts withdrawn as cash.\n\nDiesel had recently declined to sell his patents exclusively to the German government and was on his way to London to meet with representatives of the Consolidated Diesel company and the British Royal Navy.\n\nAfter his death, no memorial or tomb was built until *1957*, when the founder of Japan's Yanmar Diesel company funded the building of a memorial garden for him.",
   "created_utc": 1694366585,
   "score": 46,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwl66d",
   "message": "Whitney Houston and her daughter. Whitney’s autopsy shows that she had defensive wounds- maybe it wouldn’t be as suspicious if her daughter wasn’t also found unresponsive in a bathtub.",
   "created_utc": 1694313874,
   "score": 148,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwqub9",
   "message": "I firmly believe Martin Luther King was not killed by James Earl Ray.",
   "created_utc": 1694316586,
   "score": 89,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwzwgw",
   "message": "Andy Warhol's death was an incredible case of medical malpractice, and there's some evidence that the nurses who overloaded him with IV fluids did it on purpose.",
   "created_utc": 1694321393,
   "score": 227,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwfsz3",
   "message": "I remember hearing about Michael Jackson saying people were following him not long before he died, but that could be due to mental health problems/drug use.",
   "created_utc": 1694311445,
   "score": 189,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwz4yb",
   "message": "Ivana Trump. On the eve of her non disclosure agreement about her marriage, divorce, and what she knew about the trump business set to expire. Why was her casket so heavy?",
   "created_utc": 1694320963,
   "score": 107,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzzddac",
   "message": "This is the most interesting askreddit I’ve read in a long time",
   "created_utc": 1694362664,
   "score": 42,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzyeeih",
   "message": "Betty White. The death of an immortal is always grounds for suspicion.",
   "created_utc": 1694349285,
   "score": 234,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxmxd5",
   "message": "Stuart Lubbock\n\nNot a celebrity but a 'celebrity' was involved. He was found dead in the pool at Michael Barrymores house, with horrific anal injuries which have been reported were that bad that they could not have been caused by having consensual sex. Evidence disappeared, people scarpered before the police turned up, the whole story is heartbreaking to read. \n\nHis poor dad fought for the truth for years and has sadly died without ever finding out what really happened or anyone being brought to justice.\n\nNobody has been held accountable for his death, absolutely awful.",
   "created_utc": 1694334817,
   "score": 68,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzx0rb0",
   "message": "Edgar Allen Poe",
   "created_utc": 1694321894,
   "score": 128,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwwnb3",
   "message": "Jean Spangler. She is assumed to be dead but has never been found. It was suspected that Kirk Douglas was involved in her disappearance",
   "created_utc": 1694319626,
   "score": 142,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzy7ifr",
   "message": "Natalie Wood.\n\nRobert Wagner killed her.",
   "created_utc": 1694345794,
   "score": 30,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzxsjsy",
   "message": "Some of the deaths in this thread were caused by $ci#n+o!o\u0026amp;y.",
   "created_utc": 1694337782,
   "score": 158,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "jzwtjhp",
   "message": "I'm not sure but I'm pretty sure that OJ Simpson killed his wife",
   "created_utc": 1694317950,
   "score": 0,
   "submission_id": "16enk8h"
  },
  {
   "comment_id": "k010gvl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16enk8h"
  }
 ]
}