{
 "submission_id": "16encbr",
 "title": "People of Reddit who have lost a lot of weight. What was the game changer?",
 "selftext": "",
 "created_utc": 1694310121,
 "permalink": "/r/AskReddit/comments/16encbr/people_of_reddit_who_have_lost_a_lot_of_weight/",
 "score": 105,
 "url": "https://www.reddit.com/r/AskReddit/comments/16encbr/people_of_reddit_who_have_lost_a_lot_of_weight/",
 "comments": [
  {
   "comment_id": "jzwtzfo",
   "message": "Spite. \n\nExercise to spite someone you hate—there is no better motivator.",
   "created_utc": 1694318179,
   "score": 50,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwmh8i",
   "message": "For me the game changer was regular exercise. When I don’t get regular exercise, I crave garbage all day. Anything heavy and salty. Burgers, cheese fries, burritos, pizza. But when I get regular exercise I crave only clean foods. Grilled chicken breast, salads, grilled vegetables, foods with nutritional value. I don’t know why that is but it created a positive feedback loop for me. The more activity I got, the less food I craved and the better quality food I craved.",
   "created_utc": 1694314482,
   "score": 88,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwket2",
   "message": "Quitting booze after decades of being an alchy.",
   "created_utc": 1694313525,
   "score": 234,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwoft7",
   "message": "My buddy and I were both really big. He eventually chose to lose weight and actually did it, so I copied him. He did keto and so did I. This was 2017-2018. Went from 360 to 230 in 15 months. I would not recommend this, it is incredibly unsustainable unless you just naturally hate carbs (which I don't).\n\nAfter I passed my goal (250) I stopped doing keto. Lost a bit more naturally and got into a poor relationship. Slowly started gaining weight back until that relationship ended and then gained a lot more. Then the pandemic hit and I gained a metric shit ton. Tried to start eating better but it didn't work. I think the shock of eating carbs regularly again plus the amount of food I ate being stuck at home fucked me up hard. By mid 2021 I was 390 at my highest. \n\nWas in my forever relationship at this point and she encouraged me to do it again, but properly. I joined the gym, started counting calories and trying to eat better in general. Since early 2022 I am down to 320 as of yesterday. It's taking longer, but it's working and it's actually sustainable this time. I don't feel trapped in a diet that makes me miserable. My goal is 250 again but I have no timeline. I feel better than ever even at my current weight.",
   "created_utc": 1694315434,
   "score": 0,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwgsnc",
   "message": "Just having a better understanding of portion sizes and calories. Becomes easier when you get used to your new menu and become familiar with what will fill you up without being too high in calories. Never drank much alcohol/pop already, but now I'm more averse to wasting calories on a drink. \n\nI was 195lbs in August of 2021 (30F, 5'6\"), dealt with some digestive issues which forced me to change my diet, and not being able to eat everything all the time made me drop a lot of weight quite quickly.\n\nMost recently I went from 152lbs on May 25th to 132lbs today. I walk regularly and run occasionally mostly to help with digestion and mood.",
   "created_utc": 1694311892,
   "score": 90,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwm8yu",
   "message": "I shredded my knee and was too fat for them to fix it. I started meal planning, calorie counting, cut out empty calories like soda, eventually had bariatric surgery combined with a keto diet. \n\nEventually got my knee fixed and started exercising to keep it stretched out and strong, have lost just shy of 400lbs.\n\nEdit: Well shit this blew up, and has taken a few detours into the realms of keto diets and addiction. \n\nInsert “thanks for the awards kind redditors” and also insert “it’s late and I’ve got to go to bed”. I’ll continue to respond to comments as I can, I’ll also try to find some before and after pics. I think I’m going to have to reach out to my bariatric surgeons office to get the before pics, I obviously hated having my pic taken so I turned into a ghost when a camera was in the room. \n\nIf anyone has more questions for me, wants info/advice, or more details about what my journey has been like over the last few years send me a DM, I’ll respond when able.",
   "created_utc": 1694314375,
   "score": 57,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwnswy",
   "message": "Heartbreak",
   "created_utc": 1694315121,
   "score": 136,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwpbvr",
   "message": "A lot of it was mental for me. I realized that I was eating stuff that really wasn't worth it. Like did I really even like that sad donut I just ate?  So now if I'm going to eat a high calorie food, it better taste really good and be worth it, because exercising for something not that great isn't worth it to me. A lot of times if I felt like eating, I would just pretend I ate whatever I was hungry for because I would still feel the same way if I would have ate it anyway.",
   "created_utc": 1694315860,
   "score": 99,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwmtiv",
   "message": "Pickleball. Seriously, I lost so much weight that I thought there was something wrong with me. Went to my doctor, she ran a whole series of tests, then finally came to the conclusion that it was my pickleball addiction. She recommended that I drink a protein shake after play to help keep my weight stable. It has, although I am still at/near my lowest weight since I was a teenager. And yes, I feel great.\n\nEdit: this weight loss didn't happen overnight, it took about two years. I started out about 20 pounds overweight and lost that weight in about a year and a half. But then kept losing and eventually lost 30 pounds total before adding more calories to stabilize. I'm still 5 pounds under my \"ideal\" weight but feel great. I play pickleball 3-4 hours a day, 6 days a week. I realize not everyone can do that. But it is what worked for me.",
   "created_utc": 1694314644,
   "score": 185,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwplqh",
   "message": "Seeing a specific picture of myself next to \"normal\" sized people. 100 pounds later, I can't believe I let myself get that big.",
   "created_utc": 1694315983,
   "score": 18,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwwmbm",
   "message": "Was like 320lbs. Went to a local amusement park for my son's 2nd birthday. Got on a ride with the overhead bars. I had to switch to a bigger seat. The attendant had to forcefully push on the bars to get it to lock. I almost passed out from not being able to breathe. The overhead harness was too tight. Cried after I got off the ride and started going to the gym and lost 70lbs",
   "created_utc": 1694319611,
   "score": 117,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwfa8t",
   "message": "I had gotten blind to how fat I had gotten and how terribly I was eating. \n\n I was in Walmart and had a buggy filled with garbage and I was looking at the discount cake when a guy who walked passes said \"disgusting\" under his breath. \n\n It made me feel awful. I took everything out of the buggy, went to my car and made an appointment at a bariatric doctor. \n\n They helped me learn about mindful eating, eating as coping mechanism, all or nothing mentalities, sunk cost fallacies, and a lot of great ways to lose weight and keep it off.",
   "created_utc": 1694311216,
   "score": 73,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwh6hb",
   "message": "My cousin went from stereotypically 'fat'  (i've no idea how much he weighed, but he was big) to slim and toned within about 12 months.\n\nWhen I enquired about what changes he made, he said, he stopped drinking alcohol, full stop. That was replaced by water, some tea (no sugar) and the occasional diet coke.\n\nStarted counting calories, so he'd never go over 1900 (I think that's what he said) in a day. I recall he was aiming ideally for about 1700 per day.\n\nAnd regular cardiovascular exercise. It wasn't anything immense, something like 20-30 minutes on a rowing machine or exercise bike 4-5 times a week. Enough to work up a sweat and get the heart pumping. Though he did state that was mainly just for fitness, not weight loss (first time I ever heard 'you lose weight in the kitchen, not the gym'). He also did press-ups and sit ups for general tone and strength. \n\nBut the _one_ thing he stressed was quitting booze (he had been a regular heavy drinker, mostly beer, most nights of the week). He also emphasised this was only one factor, however. In isolation it wouldn't have been enough.\n\nIt was a stark change and I remember what he said purely for how relatively simple it sounded vs the very obvious difference in himself. I was genuinely fascinated, it was a true double-take moment when I saw him in his new form for the first time. About three years later now, and he's still slim and in good shape. At this point I think he's just very mindful of what he eats and drinks, and maintains light regular exercise. \n\nAnd he doesn't just look good, he's clearly so much happier. So much more confident and energetic than he was, more upbeat and optimistic. His entire demeanour is different to what it was when he was 'the fat guy'.\n\nI however, have started noticing middle-age spread in myself, and am about to follow his example.",
   "created_utc": 1694312067,
   "score": 250,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwp2b4",
   "message": "Eliminating ultra-processed foods has been a game-changer. I only recently learned that these foods actually increase appetite rather than decrease it.",
   "created_utc": 1694315738,
   "score": 130,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzxh8bo",
   "message": "I took shrooms and had this huge life changing moment where I realised the fantasy character I maladaptive daydreamed about all day for years and years could be the real ME if I just tried and believed in myself. \n\nI've been working every day since then to make that my reality and I'd say I've done a pretty damn good job so far :)",
   "created_utc": 1694331802,
   "score": 151,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwewin",
   "message": "depression. probably would not recommend this method",
   "created_utc": 1694311050,
   "score": 52,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwloj8",
   "message": "Treating my anxiety and depression was a huge help for stopping my emotional binge eating.",
   "created_utc": 1694314111,
   "score": 5,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwo3i4",
   "message": "I started out life fat. For me it was the realization that your body is a product for your lifestyle. I realized I wanted to change my lifestyle. I didn’t want to be noticed for my weight, I wanted to be able to feel comfortable moving through space. I changed my lifestyle. Started exercising every other day and learned about basic nutrition. My goal wasn’t to lose weight but after living that way I checked it at the doctors and I’d lost around fifty pounds.",
   "created_utc": 1694315265,
   "score": 142,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwlm6d",
   "message": "Quitting soda",
   "created_utc": 1694314080,
   "score": 126,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwlnr9",
   "message": "Type II Diabetes...",
   "created_utc": 1694314101,
   "score": 213,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwfsth",
   "message": "Completely cut out processed food and drink a lot of water.",
   "created_utc": 1694311442,
   "score": 159,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwoq3d",
   "message": "I broke up with a shitty significant other, and started drinking less. Then I met the most amazing woman ever, and she got us both bikes so we could get out and enjoy the world together. I’m down almost 40 pounds and have kept it off for over two years. I don’t know if that counts as ‘a lot’ of weight, but I’m a short girl so it felt like a lot! We cycle 6-10 hours a week and I think it helps us have time to talk and bond over a shared hobby.",
   "created_utc": 1694315573,
   "score": 146,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwoq0y",
   "message": "Reading labels. Most things have significantly more calories than I would have guessed.",
   "created_utc": 1694315572,
   "score": 53,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzws988",
   "message": "I hated myself more than I hated not eating.",
   "created_utc": 1694317301,
   "score": 252,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwghyh",
   "message": "Before I quit smoking I could only hit the treadmill for like 10 minutes, max. Within a couple weeks of quitting, I was going 45+.",
   "created_utc": 1694311760,
   "score": 93,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwyv7l",
   "message": "Being diagnosed with Type 2 Diabetes.\n\nMy doctor said that we could control it with an oral medication initially (Metformin). He said there was a chance that I'd be able to control it, but what usually happened is people got progressively worse. Eventually I'd probably go on insulin and in a few years, he'd be cutting off my feet.\n\nThat scared me and I immediately changed my diet. I avoided carbs as much as reasonably possible. I also cut out sugar as much as possible. Even though I was told that milk chocolate was fine for diabetics, I avoided it initially too.\n\nI also started exercising daily (5x a week). Even if I didn't feel like it (which was often), I still put in the 40 - 60 minute workout. I alternated between weight training and cardio.\n\nThough I wasn't really trying to build muscle, that did happen. I also lost a lot of weight. In about 6 months, I lost about 40 pounds. \n\nMy doctor was impressed with my results, but all it took was stopping eating everything I wanted and to actually get moving a little. I sit at a desk all day, so the exercising was really required (and it's not that hard).\n\nToday several years later I'm still down and exercise to the same regimen. I eat bacon and other protein everyday, and of course vegetables. My cholesterol is \"unusually low\".\n\nI still avoid carbs as much as possible, but I don't do keto. I eat milk chocolate and a variety of sugar-free sweets that are available today. Some are indistinguishable from their sugared counterparts. And, of course, I can drink as many diet sodas as I like.\n\nSo I didn't \"cure\" my diabetes, but it is well controlled. I'm not on insulin and hopefully I never will be. Realistically, diabetes will kill me someday, but hopefully I'll die with my feet firmly attached.\n\nI never realized what a fatso I was; my wife never complained. But finding clothes that fit AND didn't make me look as fat as I was was a real pain. But today people still come up to me and comment on how much weight I've lost. And finding clothes that fit and look good is much easier.\n\nI'll have to keep at it and I'll probably never be cured, but that diagnosis was the real game-changer. My feet won't win any beauty contests, but I'm attached to them.",
   "created_utc": 1694320816,
   "score": 93,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwr9vz",
   "message": "Sprints, instead of running for hours. \n\nSprinting for 10 sec, rest for 10 sec\nDo it for half an hour and you'd be dead.\n\nBurns extreme amount of fat and is a game changer.",
   "created_utc": 1694316805,
   "score": 49,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwe8yd",
   "message": "Meal planning.\n\nSeriously, there are a thousand different ways to lose weight. Just saying “I’m going to eat less sugar or smaller portions” is not one of them. Creating a structured plan and sticking to it, whatever that weight loss plan is, was the best thing for me. Kept all those extra snack-sized calories from adding up.",
   "created_utc": 1694310752,
   "score": 76,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwnm25",
   "message": "This wasn’t a first option, but I was having trouble losing any weight and could not get my blood sugar under control. I went on Ozempic and gradually lost 35 pounds. I do exercise some but honestly not as much as I could. I also eat generally healthy but also not perfect. Ozempic lowers appetite and does other stuff I don’t understand. Feels like a bit of a cheat but one I needed.",
   "created_utc": 1694315029,
   "score": 12,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwd089",
   "message": "Understanding what empty calories were",
   "created_utc": 1694310218,
   "score": 155,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwtq3e",
   "message": "Getting sober. Lost about 25 pounds automatically from just not drinking over the course of the first 3 months or so, and then the desire to consume junk food late at night kind of disappeared and my life in general years later is so much healthier so I probably lost 10 more pounds after that initial loss. Alcohol is poison.",
   "created_utc": 1694318042,
   "score": 34,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwkqs3",
   "message": "[removed]",
   "created_utc": 1694313680,
   "score": 70,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwodrk",
   "message": "I’ve lost over 100 pounds. The shift for me was moving from a diet mindset to a lifestyle change mindset. Rather than trying another fad, I cut out (most) unhealthy snacks, avoid drinking most caloric drinks (water and coffee FTW), try eating more meats/fruits/veggies than not, and got smaller plates doubled up by a “no more second/third plates” ideal. \n\nAdd regular walks on top and the weight just melted off. Sure, sometimes it’s the opening weekend of football and I eat way too much pizza and drink way too much beer with homies. But since I’m not on a strict diet, having simply embraced a healthier living mindset, I don’t beat myself up and veer back into overeating since I “already let myself down” or whatever. The next day I just go back to my normal life. \n\nOver the long term, it worked wonders for both my physical and mental health. Whoooole lot less stressful than fad diets too!",
   "created_utc": 1694315405,
   "score": 81,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwv362",
   "message": "Eating little to no Sugar. \nAccepting that I dont need 3 meals a day and I can skip meals without dying. \nKeeping zero snacks at home. \nEliminating all soft drinks from my diet. \nPortion control.",
   "created_utc": 1694318770,
   "score": 90,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwonsz",
   "message": "If you’re looking for just one thing I eliminated that made a difference, Bread",
   "created_utc": 1694315542,
   "score": 130,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwjlbm",
   "message": "Intermittent fasting 18hrs",
   "created_utc": 1694313158,
   "score": 203,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwmbe5",
   "message": "Commitment and not trying to find a short term easy fix.",
   "created_utc": 1694314404,
   "score": 44,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzx7sd2",
   "message": "Starting ADHD meds. Suddenly I only eat because I’m hungry??? Game changer when I literally could not stop myself before and would eat until it was physically painful.",
   "created_utc": 1694326358,
   "score": 65,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwlh3m",
   "message": "Emotional trauma. I do not suggest this method.",
   "created_utc": 1694314016,
   "score": 96,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwqe57",
   "message": "Swapping booze for edibles.",
   "created_utc": 1694316364,
   "score": 22,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwss4z",
   "message": "Going to therapy and addressing my childhood trauma. I’ve learned a hell of a lot of issues can stem from it.",
   "created_utc": 1694317566,
   "score": 23,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwnms6",
   "message": "I was becoming increasingly aware of my weight, my clothes were getting bigger and bringing two kiddos into the picture made me realize this wasn’t it. Obesity related complications were not a joke and my kids deserved to have a healthy mother who would be around for them.\n\nSo I had the duodenal switch weightloss surgery and dropped 125lbs. \n\n^(before anyone can say this method is cheating, I invite you to follow the strict guidelines and diet I was placed on the 6 months leading up to surgery. By the end of it you are on clear liquids and spending another 6 months transitioning back to solids. Not every solid is edible and not every drink is drinkable anymore either. Some make me incredibly sick because I simply can’t tolerate it any longer.)",
   "created_utc": 1694315039,
   "score": 183,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwly0b",
   "message": "It's not a super big amount of weight, but I was steadily gaining weight before so any downwards movement is a big improvement.\n\nI started a multivitamin. I've got absorption issues of unknown cause, but when I started taking the multivitamin I became way less hungry. I guess I was deficient in something and overeating to compensate.",
   "created_utc": 1694314233,
   "score": 70,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwdh6q",
   "message": "Portion control",
   "created_utc": 1694310417,
   "score": 34,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwee9r",
   "message": "I started eating less food more often. Every 2-3 hours. And I started to chew it more thoroughly, and I started to take small pauses between each bite/mouthful.\n\nThat's it. I've so far lost 40 KG in 2 years. I still eat pizza with a coke to drink with it 1-2 times per week, and I still eat 1-2 chocolate bars 2-3 times per week.\n\nI'm not even that physically active, I'm a lazy nerd who only walks when I have to. But since I have no vehicle, I guess it helps I always have to walk to the grocery store.",
   "created_utc": 1694310818,
   "score": 63,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzx84yz",
   "message": "I recently lost 30lbs.  That probably doesn't qualify as \"a ton of weight\" but here's what I did:\n\n1) Commit to the sacrifice that weight loss requires - I had made half-assed efforts to lose the weight before but never really did the hard work that was required.  There are no shortcuts or game changers.  If you want to lose weight, you have to eat less and/or exercise more.  There are no other options.\n\n2) Count your calories.  We all underestimate how many calories we consume in a day.  When I started counting, I realized that even though I thought I had been \"dieting,\" I was still eating 2,500-3,000 cals per day.\n\n3) For me, routine was key.  I did the same thing every day.\n\n4) Coffee for breakfast with plenty of cream and sugar.  The fat from the cream was satiating, the sugar provided energy for the morning and the caffeine was a natural appetite suppressant that helped me get to 1pm before my first solid meal.  \n\n5) Smaller portions.  Just like #2, most of us are eating so much more than we think.  What I used to think of as a \"normal\" portion was actually pretty excessive.\n\n6) All the veggies you can eat.  They fill you up, and you can't gain weight eating vegetables no matter how hard you try.  Your stomach is just too small.\n\n7) The only snacking after dinner I'd allow myself was a piece of fruit or small piece of chocolate.\n\n8) Weigh yourself daily, but also be aware that because of water retention or your shitting schedule, there will be fluctuations that are inconsistent with the actual fat loss you're achieving.  Put the numbers in a spreadsheet and make a graph with a 3-day average.  One look at the line and you'll know exactly how you're doing.\n\n9) I thought I'd give myself cheat days every Saturday, but I found my progress so encouraging that I didn't want to create any setbacks.  This was sustainable for me, it might not be for everyone.\n\n10) Exercise.  45 minutes of intense cardio a day, six days a week.  In the long term, we all need to be doing strength training, but my goal was to lose weight and cardio was more efficient. I returned to lifting after hitting my goal.\n\n11) Drink tons of water.  It keeps you full and helps your body operate efficiently.\n\n12) Calories in, calories out.  It's physics.  As I said before, all you can do is eat less and exercise more.  If you're burning more than you're consuming, you WILL lose weight.\n\nBy following these rules, I was able to drop 30lbs in three months and it never felt particularly difficult after the first few days of adjusting.  \n\nGood luck. There are no shortcuts, but if I can do it, anyone can do it.",
   "created_utc": 1694326586,
   "score": 62,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwmpxo",
   "message": "I went to a check up one day… they weighed me, the scale said 165lbs. \n\nI googled 5’1, 165lbs and read I was basically obese. \n\nCalled a weight loss doctor, she put me on phentermine, I walked every single day for 30mins-an hour. Ate healthy for the most part, and drank lots of water. \n\nI am now on Wegovy (stopping soon)\n\nI an 120lbs. \nI look better \u0026amp; I feel better !",
   "created_utc": 1694314595,
   "score": 115,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwo9ap",
   "message": "Back in 2016 to 17, I went from 220 to 180. I didn't do much other than just to log everything I ate in an app. Didn't make a radical change of diet, I just was mindful of what and how much I ate.\n\nUnfortunately, since Covid, I have since gained quite a bit more weight and am up to 245. My work having snacks and cookies freely available to grab thoughtlessly is not helping anything at all.",
   "created_utc": 1694315344,
   "score": 69,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwnk7r",
   "message": "anxiety😍",
   "created_utc": 1694315004,
   "score": 47,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwujlf",
   "message": "I stopped snacking. Don't buy anything that's snackable.",
   "created_utc": 1694318475,
   "score": 15,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwl9b1",
   "message": "I found something worth living for, and being better for.",
   "created_utc": 1694313914,
   "score": 31,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwnxxw",
   "message": "I lost 55 lbs. by walking for 10km/day minimum, 6 days a week (minimum)",
   "created_utc": 1694315188,
   "score": 30,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwjq85",
   "message": "Fasting",
   "created_utc": 1694313220,
   "score": 26,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwl9aw",
   "message": "Cut out sodas and sugary drinks. Went from adding creamer and sugar to my coffee, to drinking it black. Started working out/ walking/ hiking more.",
   "created_utc": 1694313914,
   "score": 22,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwmeym",
   "message": "Ive lost some weight but not alot but laying off quick digest carbs.  Holy crap when your blood sugar fluctuates, you eat get a boost, then sooo tired and eat to get a boost.  Wash, rinse repeat.  The drop makes you crave food.",
   "created_utc": 1694314452,
   "score": 23,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwn6pv",
   "message": "I know people say you can’t outrun a bad diet, and that is true, but I personally cannot lose weight without running. For me, it’s like the running itself helps me realize how much work it takes to burn just a few hundred calories, and that knowledge helps me make better eating choices. Whenever I start running, I start eating better, and the two together help me lose weight. I also get positive reinforcement because the weight loss helps me run faster, so that encourages me to keep eating healthy.",
   "created_utc": 1694314823,
   "score": 27,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwlv0k",
   "message": "Don’t eat after 6. For me that was huge. Everyone is different though.",
   "created_utc": 1694314195,
   "score": 33,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzwsid2",
   "message": "Cut calories by 15% and walk 3 miles a day.",
   "created_utc": 1694317430,
   "score": 10,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzx4vmj",
   "message": "I was around 300lbs, and one night for some reason I got the itch to do a push up to see how many I could do. I struggled to do one, to the point I was afraid I was gonna fail and end up hitting my face on the floor and breaking my teeth. I was 25 years old at the time and thought, \"It's pitiful that a guy in his 20s can't do a single push up.\" So, I immediately put on some shoes that night and went for a walk at around the stroke of midnight. The rest was history.",
   "created_utc": 1694324445,
   "score": 11,
   "submission_id": "16encbr"
  },
  {
   "comment_id": "jzxr8ow",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16encbr"
  }
 ]
}