{
 "submission_id": "16ewcj4",
 "title": "What is the dumbest way you've ever made money?",
 "selftext": "",
 "created_utc": 1694339751,
 "permalink": "/r/AskReddit/comments/16ewcj4/what_is_the_dumbest_way_youve_ever_made_money/",
 "score": 237,
 "url": "https://www.reddit.com/r/AskReddit/comments/16ewcj4/what_is_the_dumbest_way_youve_ever_made_money/",
 "comments": [
  {
   "comment_id": "jzyjqe9",
   "message": "An American gentleman asked me for directions and gave me a 1 dollar bill as souvenir. This was in post-communist Hungary and I was maybe 10. I thought I won the lottery. \n\nI still have it.",
   "created_utc": 1694351708,
   "score": 78,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy53po",
   "message": "Reading books to my neighbour's parrot. He was depressed and needed company, apparently. I was 10, I enjoyed that work very much.",
   "created_utc": 1694344483,
   "score": 112,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyb1km",
   "message": "About 10 years ago I downloaded one of those Clash of Clans style app games.  This was before the “pay to win” model had arisen so I played the game for about a year and was actually pretty good at it and managed to get into one of the top clans.  After a year or so though the pay to win model began to rear its ugly head and ruin the game.  I saw the writing on the wall and decided it was time to hang it up.\n\nNow I had never spent a dime on this game but I knew that a lot of the big spenders would sell their accounts when they quit in an attempt to recoup some of their losses.  I knew my account wasn’t at that level but I figured it was worth a try.  I figured if I could get even $10 I would be happy.  I was in no rush to sell it though so I figured I would start very unrealistically high and then slowly go down on my list price.  I ended up listing it on a third party site starting at $500.  Within 12 hours I had a guy “counter offer” at $350.  I was blown away.  I wasn’t about to negotiate with that and jumped all over it.  To this day I still can’t believe that I had fun playing a free game for a year and then sold my account for $350.\n\nTL;DR:  I played a free mobile app game for a year and then sold my account for $350.",
   "created_utc": 1694347684,
   "score": 68,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy8v4g",
   "message": "I got a job as a 'fantasy model with long flowing hair' where I modelled for B grade American fantasy novels. Paid OKish, not well.\n\nI also signed away my rights like an idiot so occasionally turn up riding a horse, or casting a spell. Also once turned up on a book cover with '*a lady*' and my GF went 'Who the fuck is that!'?!\n\nPhotoshop my dear. Photoshop.\n\nI tried to read one of the books and it started 'He was not *traditionally* handsome'. Ouch.",
   "created_utc": 1694346534,
   "score": 7,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy53ai",
   "message": "Forgot to submit my self-assessment tax return for a year I owed £0 tax.\n\nGot fined £100.\n\nAppealed it, was successful, got paid £100.10 back.\n\nThanks HMRC x",
   "created_utc": 1694344476,
   "score": 157,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy0ek9",
   "message": "In the 90's I had some money spare and the British Government was attempting to stop the £ falling below a certain level against the US$.  On the radio in the mornings, day after day, serious expert were saying it couldn't hold out against the markets.\n\nI converted all my cash into US$.  Two weeks later I converted it all back into £'s and made £10k.  I literally did nothing except change some currency.\n\nTo be honest I wasn't the big winner.  George Soros made $1billion!",
   "created_utc": 1694341930,
   "score": 249,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy57zy",
   "message": "I once crashed my truck on the freeway (due to a faulty road, I got a big payout, don't worry guys) and when I was all shaken and like holy crap and pulling over into the grass on the side of the road, I stepped out of the truck on shaky legs, and there was just... a 20 dollar bill. Crisp and new. Just sitting there. I thought I must have imagined it, but I took it as a good sign, and then insurance inexcusably overpaid what my truck was worth and I got a much better truck for free *and* 20 bucks.\n\nDumb. Effective, but dumb.",
   "created_utc": 1694344554,
   "score": 253,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy86jj",
   "message": "Answered an ad on Craigslist. A dude shaved my head, and filmed it. Paid me $600.",
   "created_utc": 1694346162,
   "score": 206,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy971q",
   "message": "Sold my urine on job site to guys who knew they were going to be tested.",
   "created_utc": 1694346719,
   "score": 30,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzygmbc",
   "message": "Tutoring a kid in math who was far smarter in math than his mother thought. He didn't do the homework because he wanted to play video games. He aced all the test and quizzes but homework was 50% of the grade so he was getting a C in math. Mother basically paid me $20 an hour to make sure he did his homework, which he finished in about 5 min. We then played video games for the next 55 minutes and whenever the mother would check on us I would say something \"mathematical\" then he would say something \"mathematical\" and I would say \"exactly, now you've got it.\" I felt bad taking the money from the mom, but as a poor college kid, $20 is $20.",
   "created_utc": 1694350312,
   "score": 15,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzydc79",
   "message": "I worked at a recording studio and one of the engineers was working on a radio commercial. The spot called for a bit of dialogue between a vo talent and a bird whistling. The client figured we could just use sfx for the bird responses, but nothing was working. The engineer left the session for a bit to get some air and he told me what was going on. Not to brag, but I’m a pretty good whistler. I started mimicking what the bird “should” sound like, and his eyes went wide. He dragged me into the session to present what I did. I ended up being hired on the spot. I whistled for one commercial, which happened to be a union gig. So, I signed a contract that basically let me join for the day. I got about 800 bucks for the day, but also received residual checks for a couple more years after that. Whistling earned me about 3k in the end.",
   "created_utc": 1694348764,
   "score": 173,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy81r1",
   "message": "My offer letter was wrong. I asked for a one time sign on bonus since I was leaving my match at my previous job. HR agreed but then instead of doing it as a bonus they added it to my salary. I didn’t say anything. 2 years later during an audit they caught it. The ceo finds out and says “well even with his raise last year he still is worth it”. Never had to pay it back since it was an hr screw up and I’m good at my job.",
   "created_utc": 1694346097,
   "score": 206,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy3och",
   "message": "Some dude hit my friend with his car while we were crossing the sidewalk in front of a 7-11. We were 12ish at the time and my friend wasn't hurt except for a bruise that came later. He gave us each $20 to not say anything about it. We bought SO much candy.",
   "created_utc": 1694343695,
   "score": 229,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy5d97",
   "message": "I spent about an hour 12 years ago making a simple tshirt design and posted it on cafepress.  I still get $100-150 a couple times a year from it. It ain’t much, but it’s always a fun surprise to receive the check.",
   "created_utc": 1694344636,
   "score": 234,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzycjm7",
   "message": "Once turned up to an office for an interview however they gave me an pass, desk and access to a laptop and archives after I walked in the door. They kept calling me by my name so I never thought anything of it. \n\nI was there for a couple of weeks indexing and digitising old documents and once I'd finished the allocation of work my temp contract was up as it was only 2 weeks. On leaving they were going to cut me a cheque and asked \"How do you spell \u0026lt; random surname \u0026gt;?\" I said how would I know I'm called...\"\n\nThe shock on their face as they realised they had given a job to the wrong guy and had called me for the job instead of the knock back. Easiest but dumbest way of making money every",
   "created_utc": 1694348391,
   "score": 194,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzydkqy",
   "message": "Shoveling snow.  Yeah, I know how it sounds, but I was at my grandma's house and she had this shovel that was curved so if you held it right, the snow would curl up and move just like a snowplow.  I was like 6 or 7 years old.  I thought was so cool so I just went around her block clearing the sidewalks having a blast cause it's just like the big snowplows.  Before I know it, people are coming out of the houses and giving me money.",
   "created_utc": 1694348882,
   "score": 111,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzycqra",
   "message": "Guy I knew asked me to drive a bag to Oklahoma City and pick up another bag. I knew what I was doing but I didn’t really care. \n\nWhen I got back he handed me 5k in cash. \n\nStill to this day never knew what was in the bag or how much money I picked up. \n\nHe got popped a few years later for distribution and served 15 years of a 50 year sentence.",
   "created_utc": 1694348478,
   "score": 65,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy759t",
   "message": "Working as a landscaper, my boss called me up saying he had an odd job that would pay very well, but wouldn’t tell me what it was.\n\nI get to the job site and the owners said they came back from a two week vacation to a terrible smell in their back yard.\n\nCome to find out it’s a rotting deer carcass under their back porch. We tied rope around its feet and dragged it about half a mile into the woods, and still had to wash away all the shit and larvae left over on the ground. \n\nWas def not worth the $200",
   "created_utc": 1694345615,
   "score": 120,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy50di",
   "message": "In junior high, I bought cinnamon oil at a pharmacy on the walk home. I soaked toothpicks in it and sold them for 5 cents each. I made alot of money off one bottle considering the cost of it and the boxes of toothpicks.",
   "created_utc": 1694344434,
   "score": 248,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzxy8vl",
   "message": "I used to get paid to read palms at parties. Despite my \"entertainment purposes only\" disclaimer, people always took it too seriously. Even when they had seen me doing magic shows. Apparently watching me do card tricks for an hour wasn't enough to convince people that maybe - just maybe - I wasn't actually a psychic. \n\nI started feeling guilty about spreading nonsense, so I had to quit.  It was such easy money, too. Stupid parents raising me with stupid ethics.",
   "created_utc": 1694340771,
   "score": 232,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy323v",
   "message": "My dad had like a 1,000 playboys and I brought them to middle school and sold $10 a mag",
   "created_utc": 1694343341,
   "score": 20,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzycsfm",
   "message": "When I was at university I used to do campus tours and meet and greets for new students (in the UK, this is). The university I went to was in a city called Leicester. In the city centre, there was a street called Every Street. At the end, on the corner of that street and another, was a branch of Barclays Bank. So I used to bet all the freshers £20 that there was a Barclays Bank on the corner of every street in Leicester. It was a 15 minute walk from the campus to the bank, and they’d get smug because of all the intersections and street corners we’d pass, until we reached the bank and I made them pay up. Admittedly I spent almost all the money I made on booze within the first month, but still, totally worth it.",
   "created_utc": 1694348499,
   "score": 64,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyct9a",
   "message": "My married boss who I used to work for saw me with friends at a bar one night and pulled me aside and told me to come talk to him in his car\n\nI was young, dumb, and drunk so I happily went with him\n\nHe was talking about some shit about how I'm smart and a very good worker and he wants me to be successful and he gave me $100 from his wallet\n\nI was, again, very dumb, so I took it and said \"oh damn, thanks!\" And hopped out of his car and went back to my friends.\n\nHe never brought it up 😂",
   "created_utc": 1694348512,
   "score": 62,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy2qte",
   "message": "Local wannabe mayor payed me to vote for him when I was like, 18 😂",
   "created_utc": 1694343172,
   "score": 69,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy8a00",
   "message": "Fuji film had big supply chain issues that resulted in some of their premium films being unavalible for the past year - I had over a 200 rolls of medium format film stored in the fridge for a few years. Sold about half of them last month for $80 a roll.",
   "created_utc": 1694346221,
   "score": 203,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy9g0r",
   "message": "When I was an elder teen I went to the Walmart Supercenter in the middle of the night because we (my boyfriend at the time was with me) were bored and couldn't sleep.\n\nWhen we came out it was quite windy, the parking lot was pretty empty. I started seeing papers fly by and it was cash, mostly $20 bills. I started running around like a crazy person trying to find/grab all the bills I could. All in all, I was able to salvage about $700 while the majority blew off into the darkness/neighboring swampy wooded area.\n\nWe searched around for a human that it could've belonged to, but it was only us.",
   "created_utc": 1694346849,
   "score": 63,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyc4t9",
   "message": "Betting on DWAC, the merger partner for the Trump social network Truth social. I had it in my head after Trump got kicked off of twitter that he would start his own media company and use a SPAC to do it. as luck would have it I saw the PR before the market opened.  I put about $6000 into it on Thursday morning , most before the market opened, with some for my husband and some for my brother who was headed my way for a visit.  I missed the top on Friday morning due to a shower so I sold some and waited to sell the rest until Monday morning. $60,000.00 for me and my loved ones. We ate well that weekend. Thankyou trumpers for the cash.",
   "created_utc": 1694348193,
   "score": 171,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy0ab1",
   "message": "Buying a stock and forgetting about it",
   "created_utc": 1694341867,
   "score": 80,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyc2y3",
   "message": "My dad thinks water dowsing is real so I was outside pretending he was 10ft off of his guess and the neighbor came over and asked if I could do it on his property for his new well. I tried explaining I was just being an asshole but he said $100 was on the table. So, I just did the same magical crap on his property and got $100.",
   "created_utc": 1694348170,
   "score": 141,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzye6rd",
   "message": "My Aunt and I have a bit of a running joke that she always makes sure to get a hug from me and I've always pretended to not want one / be grossed out. One Thanksgiving she just offered me $20 if I gave her a hug. Which obviously I did and gleefully accepted my $20, even though I could see my uncle steaming a few feet away. \n\nThen a couple weeks later I found out they were a few months behind on mortgage payments.",
   "created_utc": 1694349167,
   "score": 142,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy7e6s",
   "message": "Focus groups.\n\nIn college I managed to make quick cash by doing marketing focus groups. Sometimes it would take an hour. Sometimes they were full and they'd give you full payment for showing up",
   "created_utc": 1694345740,
   "score": 71,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy74er",
   "message": "I drove 15km with a live pig in the back of an old Volvo 940 station wagon to settle a bet between 2 farmers.",
   "created_utc": 1694345602,
   "score": 101,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy2el1",
   "message": "Editing resumes, I got my degree in communications and technical writing. People would send the most outrageous resumes, like 14 jobs, with a few weeks between them. Long winded \"about me\" like it was a dating profile. Some even included a photo of what they looked like. Some photos were professionally done, others were obviously selfies or even worse the camera on their phone pointed at the bathroom mirror with flash on. I would always take the payment first for like $100 bucks, concise it down to a single page with the actual relevant information that the hiring manager or HR rep wants to see. I always delivered with a one day turnaround. Some people loved it, and they were able to get into prestigious university or jobs because we were in community college, others hate them because I \"took away their personality.\" Besides, I sold homemade edibles, gummies, and other sweets because weed wasn't legit business yet.",
   "created_utc": 1694342988,
   "score": 183,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyekl3",
   "message": "I played a stereotypical thief (black clothing, mask etc.) in security system commercial. It was fun experience, I made 200 PLN. I was trying to rob a safe and steal a bike. Funniest thing is my face is to this day in the background photo on FB of this security system page.",
   "created_utc": 1694349372,
   "score": 61,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy4u5t",
   "message": "It was snowing heavily, so school was cancelled. But the mail truck still came. My younger sister bet me she could race through the waist-high snow to the mailbox and back to the front door faster than me. We took off, and she easily beat me, but the rules are, you gotta touch the first destination before you run back, or it's cheating. \n\nSo she was racing past me and I still needed to touch the mailbox. I got to it and noticed a crumpled up piece of paper, it was a $100 bill! My sister was waiting for me at the front door and I showed her the money. We raced back to the mailbox, and found a second $100 bill! \n\nRan inside going \"mom mom mom look!\" Mom very slyly put the money in her purse and said \"we'll do something fun with this next weekend\". So really, it's the dumbest way I ever made my mom $200.",
   "created_utc": 1694344341,
   "score": 166,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyd9p2",
   "message": "Not me but a friend of mine helped people out with unemployment benefits during the pandemic (mid 2020) in the US, loads of people were applying and he would help them get the paperwork right and everything, nothing illegal, never lied or anything just helped them with the paperwork\n\nHis initial investment was a couple of hundred bucks for ads, he hired an accountant on commission and basically sat back while the money rolled in, he eventually had a falling out with his partner but he made over 50k in 2 months\n\nSad part id he offered me the part of the accountant, my share would've been roughly 3 hours a day for 8-10 months and I would've made around a million dollars, I declined the offer because I was busy building a career in software development, I only found out how much of a loser I am after being laid off and struggling to find another job",
   "created_utc": 1694348733,
   "score": 57,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzxzjmh",
   "message": "guy on the street asked to see my feet lmao",
   "created_utc": 1694341462,
   "score": 204,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy35kw",
   "message": "When I was 12 I sold a pack of gum to my classmate for $20 my mom thought I stole it from her purse and took it from me 😞",
   "created_utc": 1694343400,
   "score": 106,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzydi1l",
   "message": "When I was in HS some friends and I did face painting at a mall for little kids on Halloween. Fast forward 10 yrs, I'm serving in a bar and my boss asked if I could do face painting in the bar on St. Patricks day. Why not? I set up in one of the booths and even though there was no charge the customers were just throwing cash at me. I did St. Patrick from some guys church handout, a few more customers wanted little leprechaun \"footprints\" across their faces. It was a blast.",
   "created_utc": 1694348844,
   "score": 51,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy9av8",
   "message": "When CD burners came out I’d borrow CDs from people and burn copies and sell them to other people. Lenders got a discount. I just sold everybody’s music to everybody else and made thousands.  I was backlogged for weeks.",
   "created_utc": 1694346774,
   "score": 101,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy6ybg",
   "message": "Bought a 5 year old laptop for $75. Didn't like it. Sold it 2 days later for $90",
   "created_utc": 1694345501,
   "score": 44,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzxzo78",
   "message": "If your family is so rich, why can't you give me any money?\" And she gave me $100. I was like \"I want more\" and she gave me $200.",
   "created_utc": 1694341536,
   "score": 92,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyc88k",
   "message": "In my 1st year of College I picked up some side jobs like pet walking, baby sitting and some house cleaning. One man I cleaned for was in his late 60s, very wealthy retired business man. His wife passed away shortly before I started working at his home. One day out of the blue he told me he would double my pay if I would dress up while cleaning his house. He handed me a Amazon package and inside there was some high heels, black stockings and a garter belt and black thong. He also made it clear there would be no sex involved. The next time I cleaned I wore what he purchased and made some good money. and he kept his word and never tried anything with me. But I did notice the trash basket in his bedroom had a huge amount of toilet tissue. pretty sure he was masturbating",
   "created_utc": 1694348240,
   "score": 121,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzya08l",
   "message": "Sold sand, proppant. To oil companies for ridiculous prices. \n\nSure we had some made/manufactured ceramic proppant. But sold a lot of just regular every-day sand.\n\nI never did get my head around getting paid $65.00 an hour just selling sand.",
   "created_utc": 1694347148,
   "score": 46,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzybbux",
   "message": "Back when Star Wars Ep1 was released, Lays chips had a game with SW scratch cards which included money prizes as well as toys and Lays bags. It was possible to see the text behind the scratch off material by using a pocket laser. Was able to \"win\" $400 (a lot of money at that time in Eastern Europe) over the course of the promo, along with a bunch of toys and chips packs.",
   "created_utc": 1694347827,
   "score": 40,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzycckp",
   "message": "When I was a kid, a guy was giving $5 to anyone who filled out a survey at the mall.\n\nTook 2 minutes. $5 was pretty nice in the 1980s if you were 9 years old.",
   "created_utc": 1694348298,
   "score": 45,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyq20x",
   "message": "There was this old men’s club (Elks or Shriners I think) that put out an ad in the paper offering to pay $100 to any two people who would be willing to perform Abbot \u0026amp; Costello’s “Who’s on First” routine at one of their next meetings.\n\nI was in high school and got one of my buddies to agree to do it.  So we contacted them and offered to do it.  The guy said we were the only ones to answer the ad and yes.  The meeting was in a couple weeks so we worked our ass off to get every beat down.  We dressed the part and everything.\n\nWhen we got to the meeting hall, we were meeting the people that hired us in person for the first time.  They were super nice.  We performed the routine perfectly, got a thunderous applause and then people were just shaking our hands and giving us money after.  We cleared about $800.\n\nI played Costello’s part by the way.",
   "created_utc": 1694354201,
   "score": 41,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyddlu",
   "message": "My neighbour gave me $20 if I would go and buy a $1 glass of lemonade from their kids lemonade stand - it even tasted good!",
   "created_utc": 1694348785,
   "score": 73,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzygrtp",
   "message": "I bought a pair of Nike Off-White Dunk Lows from the SNKR app. There were 50 color ways, #1 and #50 we're uniquely different and more valuable. It was a blind box situation, so you didn't know what color you were getting.\n\nI never received them. I'm guessing they were stolen by the delivery person or something. I told Nike, got a refund.\n\nAnd then, randomly, I did receive them. And wasn't charged. And they were the #1 color way. So I sold them on StockX for more than $1000.\n\nMore silly money:\n\nI was once an extra on the hit television show \"Franklin and Bash\". It wasn't much, but it was dumb.\n\nWhen I was about 13 I made a really shitty Geocities website and made $10 or so off of ad revenue.\n\nIn high school, I kept a binder full of Magic: The Gathering cards. I didn't really play, but the kids who did knew I was basically a traveling card peddler.\n\nIn the early two thousands, while website building was still very difficult for the average person, I built portfolio websites for colleagues trying to find new jobs.\n\nI could go on - I have always enjoyed finding unique, legal and quick ways to turn a buck.",
   "created_utc": 1694350386,
   "score": 40,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzykj5v",
   "message": "I bought btc to buy steam games. Just as I did it, steam stopped btc payment. To withdraw the btc into cash, the crypto exchange required me to take self photo for authentification, I was too lazy to do that.\n\n7 years later, my btc was up 1000%. It ain’t much but lol.",
   "created_utc": 1694352040,
   "score": 37,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzxyo6q",
   "message": "Web scarping 50k products (price, picture, rating, comments) from a specific catagory on amazon. Dude used it in his phd thesis and paid me 50$.",
   "created_utc": 1694340993,
   "score": 116,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzxxi0q",
   "message": "[removed]",
   "created_utc": 1694340398,
   "score": 52,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyb1yc",
   "message": "Years back I had a deal with an online casino where I get paid $10 per download of their casino software using my affiliate link. They didn't even have to deposit. I wrote some roulette bot software that just automatically does a roulette betting scheme called martingale. It directs the user to the casino via my affiliate link upon installation. \n\nAt the same time, I found a software download website that you can deposit money and promote your software. Found that if I deposited money once, I could hit refresh on the confirmation page multiple times and get $1000s in my advertising account.\n\nI ran my software advert on every single slot of that website and it ran for about a week before it was caught. Made $1000s that month. Casino ended the deal after the first payout when they didn't make enough to cover it.",
   "created_utc": 1694347690,
   "score": 30,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzydxjy",
   "message": "I went to a bar with a group of colleagues during a work-drinks in West London. Was stood at the bar waiting to order with our Dev Ops manager. While waiting, a guy slid up next to her and started turning on the flirt. He looked about 12. (We're both in our early 30s)\n\nAt one point, after a minute or so, my colleague said, \"Sorry, but you're too young for me.\" \n\nHe replied by declaring he was older than that guy she's with.\n\nI'd given him space to take his shot (who am I to cock-block either side) but overhearing this, I immediately bet £10 he was younger than me.\n\nAn ID check later (he was 21. I was 32) and he willingly handed over a tenner.\n\nI ordered myself and the manager drinks as a thanks for free money. The two drinks came to £21.60.\n\nEasy come easy go. 🤣",
   "created_utc": 1694349041,
   "score": 30,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyit4z",
   "message": "Found an old sewing machine in the basement and fixed it up. Had to learn it in order to fix it. GF at the time then buys me a new Singer. I fix things here and there, mainly uniform stuff as I was a correctional officer at the time. It's very relaxing, and I love every opportunity to play with the different stitch settings and patterns. People started to notice my shirts were constantly looking great, with sturdy buttons that never seem to loosen.\n\n\"Your ol girl fix that shirt up for you?\"\n\n\"No? It took me five minutes to do with a sewing machine.\"\n\n*Cue scoffs and laughter, followed by hushed requests for me to fix things.* I literally turned a bit of black thread and a few minutes of work into a small but endless stream of cash simply because I worked around a bunch of people who were too fragile to ever dare engage in something they thought was unmanly. \n\nSomehow, they felt that it was the epitome of macho to walk around and whine about how their buttons were missing and how the clothing dept is not accepting tickets right now and that the blue isn't right on certain off-brands which looks tacky.",
   "created_utc": 1694351308,
   "score": 33,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyg9n4",
   "message": "I made about $800 Australian Dollars betting on the last US election *after* the key results were in and it was very obvious Biden was winning. It seems Trump supporters were still willing to put a bet on even though their guy had obviously lost.\n\nBought a bunch of parts and built a PC we called \"Biden\".",
   "created_utc": 1694350159,
   "score": 80,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy2k2u",
   "message": "Anti protest seat warmer. Didn’t know what we were being paid for for two and a half days. We’d rock up, hang around for 15mins, get $50 then get told to go home. Rinse repeat three times a day. Then one time some protesters rocked up and we got told to put on these shirts promoting some destructive mining operation and how it would help the economy and provide jobs. We didn’t return for the rest of the shifts after we found out what we were being paid to do.",
   "created_utc": 1694343075,
   "score": 165,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyg95n",
   "message": "Went through my old birthday/Christmas cards that I hadn't thrown out. Found £70",
   "created_utc": 1694350154,
   "score": 26,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyw534",
   "message": "My brother stalks deals on power tools like a hawk.  I'll occasionally get a text from him telling me to go to my local Home Depot and buy every unit of X available, usually at a ~90% discount. Sometimes these are errors, sometimes just deep clearance. I'll sell these on FB marketplace for a decent profit.\n\nChristmas eve I get a text, Milwaukee blower kits for like $10 (usually a couple hundred.)  I head over and literally fill my car. I usually snap the photos for the FB marketplace ad in the parking lot just to save time/not allow myself to procrastinate.  Immediately some dude messages me asking how many I had, how much I would take etc.  He's really close by, ends up coming to the literal Home Depot parking lot and buying all of the units I had (at about 50% of full value each.)  \n\nAfter emptying my car into his, I went back inside and bought the rest of the units and refilled my car.  Sold those over time as normal.  \n  \nEasiest/dumbest $3k I've ever made.",
   "created_utc": 1694356654,
   "score": 29,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyge63",
   "message": "I pulled up once in a friends pickup to a parking lot to take a break from driving and look at my phone to figure out how to get back to his house. All of a sudden people came up and starting loading these political yard signs in the back of his truck. When I got out of my car to ask wtf was going on. A woman says, \" hi! Here's the $2,400- wed like them placed along x road\"\n\nI paused and looked down and it was a bank envelope full of hundos.\n\nI said. \"Gotcha!\"\n\nAnd drove to the nearest supermarket, went in the back and threw them in the dumpster.",
   "created_utc": 1694350218,
   "score": 163,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy9rm3",
   "message": "Worked in a fast food place. There was a guy who used to come in, buy a coke with a $20, and tell me to keep the change.  He would look in my car window and drop cash in my sunroof if my tank was low. This went on for years. \n\nOne time, in the drive thru, he offered me $100 to kiss my hand. I did it.",
   "created_utc": 1694347024,
   "score": 82,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy67bg",
   "message": "I’ve studied in Singapore for one semester as an exchange student in 2012. My Chinese lecturer used to work as a voice coach and Chinese pronunciation consultant for the Singaporean film industry. \n\nOne day after class she asked if anyone would be interested in a hand modelling job. It was between me and a really handsome guy (who financed his studies by modelling for Abercrombie). $120 SGD was too little for him for 45 minutes of doing „app gestures“ on a fake iPad on camera, so I gladly took it.",
   "created_utc": 1694345105,
   "score": 40,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzz2yc0",
   "message": "Back in 2012 I was quite the stoner.  Always making little smoking accessories.  Cruising through the dollar store one day an idea came to me.  I would buy a 10 pack of plastic bugs or lizards, chop off the head and insert a metal wire, then drill out the body so the head would sit where it should.  I sold them to head shops as pipe pokers for $3 a piece, essentially turning $1 into $30, sold loads of them on etsy also for more per piece.  That blossomed into a nice little paid hobby, and now I make high end wood smoking accessories.",
   "created_utc": 1694359090,
   "score": 48,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzycga6",
   "message": "Buying Beanie Babies in Canada and selling them to collectors in America in the late 90s. ‘Maple the Bear,’ available only in Canada, would sell for hundreds of dollars across the border. My sister worked at a store that sold them, so we had a large supply at cost.",
   "created_utc": 1694348348,
   "score": 24,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyclmy",
   "message": "Selling those “sex bracelets” when I was in school. Each color represented something you “did”. Black and white meant you did the most . Sold for one dollar each and packs were like 2 bucks for fifty mixed colors. I made bank. 💸",
   "created_utc": 1694348420,
   "score": 21,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzykjt6",
   "message": "Some guy off Tinder once paid me $20 as motivation to do my own laundry.",
   "created_utc": 1694352048,
   "score": 23,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzykxr6",
   "message": "When I was younger, one of my friends knew a guy whose girlfriend was working as an escort. Guy was naive enough that he thought that guys just paid for an escorts company. He suspected that she was having sex with her clients, but he didn't know for sure. He ended up hiring me to find out if all of this was true. For a bonus, he wanted to know if she would perform oral because apparently that is something that wasn't happening with them.\n\nI was just a college student at the time so $100 and some tickets to a Cleveland Browns game were enough for me. \n\n\u0026amp;#x200B;\n\nTLDR; I got paid to hire an escort.",
   "created_utc": 1694352208,
   "score": 22,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyll0u",
   "message": "I was considering buying a BMW e30 convertible. \n\nI was on a test drive and stopped at a gas station to buy something to drink.\n\nDude came up to me and offered the, at the time, equivalent of 1500 bucks more than the seller was asking. I told the prospective buyer to meet me there 4 hours later when i finished work.\n\nPaid for the car, transferred ownership with the app and went and sold the car to the new guy for 1500 bucks more a few hours later.",
   "created_utc": 1694352465,
   "score": 19,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzycz28",
   "message": "My buddy: *Bet you a dollar you won’t flip off the principal when he drives by.*\n\nMe: *Watch this.*\n\n**One day later…**\n\nPrincipal in front of assembly: *We’ve reinstated  paddling as a punishment. Dapoopers, come with me.*",
   "created_utc": 1694348594,
   "score": 36,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyduxm",
   "message": "When I was 19 I was in a rehab group for teenagers. Being that we were all pretty serious addicts (this group was less teenage potheads and more suicide attempts and heroin junkies) our parents didn't really bat an eye when we took up cigarettes. Lesser of two evils. But most people were under 18 so they couldn't buy their own. It was the year CVS decided to stop selling tobacco products and were selling their cigarettes for $1 or $2 a pack to clear out stock. I bought hundreds and re-sold them. Literally cleaned out the two CVS stores near me. Profit was easily 4 figures because I was selling them with a markup even though I got them for 80% off.",
   "created_utc": 1694349009,
   "score": 36,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy6sw4",
   "message": "Sold gum in boarding school to elementery school kids for €1 a piece. Couldnt do it anymore when it got attention, kids started giving €2 a piece.",
   "created_utc": 1694345426,
   "score": 18,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy6hla",
   "message": "Wrote a program to \"hack\" the lottery. The guy had an idea he found some pattern in numbers, and wanted me to help him by writing a program that would do the calculations he was making by hand. 10 years later he still hasn't won the lottery. At least it was fun hanging around with him. He is really passionate about what he starts and goes all in. If only he could invest his energy in something more productive. The last time I saw him, he was chasing meteorites (some of them may have precious metals).",
   "created_utc": 1694345263,
   "score": 72,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy7m6b",
   "message": "I had a job where my boss also owned a restaurant. The very big freezer in the restaurant was broken, every day they would send me with an air dryer to melt the ice accumulated on the radiator so I can turn back the freezer on.\n\nI was paid to melt ice with an air dryer. Not even making this up.",
   "created_utc": 1694345852,
   "score": 37,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzybj58",
   "message": "My son was in middle school, and teachers could hand out “Eagle coupons” to students for good work, good citizenship in the school or if they assisted someone.  Essentially encouraging students to be kind and helpful and support the school community.  The Eagle coupons could be used at the school bookstore to buy things.  \n\nMy son however was always finding ways to game the system.  He began counterfeiting the Eagle coupons.  He turned in his counterfeit coupons and got a pencil topper of some sort.  He was playing with the pencil top pans a friend asked if he could see it “give me a quarter and I’ll let you see it for 5 seconds”.  The friend handed over a quarter, my son handed over the topper and 5 seconds later snatched it back.  \n\nThe next day the friend asked what it would take to buy this topper.  My son said $5.  The kid handed over $5 and my son handed over the topper.  \n\nHe repeated the process a couple more times using counterfeit coupons to buy things and then sell them.    The toys were generally under $2, so he was always making a profit even if he purchased them.  \n\nI found out about his “business” after the school year had ended.  The school abolished the Eagle Coupon idea the following year.",
   "created_utc": 1694347916,
   "score": 33,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy8qnh",
   "message": "When I was in high school a girl wanted me to come over and hookup. I was staying at a friend's house about 20min away. So I asked him for a ride over there a d he was like if she can give you some gas money I'll take you over there. So I told her she'd have to give me some gas money for me to come over. I showed up, we went to the back yard behind a shed, she sucked me off and gave me 7 dollars in gas money. My friend was down the road waiting. I called him and he picked me up then have him the 7 dollars in gas money.",
   "created_utc": 1694346461,
   "score": 49,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy7xr9",
   "message": "Stripped at a party for fun and got money put down my pants. So there's that",
   "created_utc": 1694346037,
   "score": 16,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzydl61",
   "message": "Paid through my last semester of college by boosting peoples accounts in overwatch. Half of that was from one guy who kept coming back despite dropping from master to bronze several times. Guy really still thought his team was holding him back.",
   "created_utc": 1694348888,
   "score": 16,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyfqf7",
   "message": "I grew up a military kid (dad was in the Air Force). I was also a smoker in high school. \n\nBack then (early 90’s) cigarettes on base were extremely cheap. I think they weren’t taxed at all. So for example, you could get a carton (10 packs) of Camels for $6. To make it even better, there was this long period where camel would have a $3 off manufacturer coupon on the carton that you could use for the purchase. \n\nI’d get my older brother to buy me a carton, then I’d sell packs at school for $1/ea (which was about half of what a pack would cost off base).  So fellow teens could buy from me without ID and could do so much cheaper than if they bought from a store. \n\nIn hindsight, I shoulda charged $2. Still…Easiest money ever. Lol",
   "created_utc": 1694349915,
   "score": 17,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzxwggm",
   "message": "I once sold a used Q-tip on eBay. Yeah, it was dumb.",
   "created_utc": 1694339832,
   "score": 85,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzybcb8",
   "message": "I was let go in the middle of the project. I agreed to finish it in a week for them for 3x my monthly pay they payed me before sacking me. They agreed.",
   "created_utc": 1694347833,
   "score": 14,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzyc6ue",
   "message": "I joined an MLM in the late 90s to the early 20s without knowing how toxic and predatory this practice was. I earned money because I basically misunderstood my upline. You see, whwn you are new in their \"pipeline\", you are supposed to invite and recruit \"downlines\" to be part of your team's pipeline on your \"right side\". But I invited a friend and placed him on my \"left side\" and he invited more and placed on my left side and so on, and I earned money more than my up line. They (my up line and her up lines) noticed this after 3 months and accused me of scamming them - - - yes, they called me a scammer who deliberately placed my friend on my left side to make sure I earn more than them. This was a time when cellphones are not yet prevalent in my country and that internet are only reserved for companies and businesses so the harassment I received were more on land-line calls, uninvited house visits and eventually my up lines conspired to deactivate my MLM account. But, I did make 10x of my investment but that traumatized me on MLMs.",
   "created_utc": 1694348223,
   "score": 28,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzy0dy5",
   "message": "I saw a one Euro coin on the pavement and picked it up.",
   "created_utc": 1694341920,
   "score": 49,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzydo7v",
   "message": "I know someone who \"married\" some rich foreign guys daughter for a year she got her citizenship he got like 10 grand.",
   "created_utc": 1694348926,
   "score": 13,
   "submission_id": "16ewcj4"
  },
  {
   "comment_id": "jzz2s4a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16ewcj4"
  }
 ]
}