{
 "submission_id": "16exg05",
 "title": "How important is sex for you in a relationship?",
 "selftext": "",
 "created_utc": 1694343692,
 "permalink": "/r/AskReddit/comments/16exg05/how_important_is_sex_for_you_in_a_relationship/",
 "score": 252,
 "url": "https://www.reddit.com/r/AskReddit/comments/16exg05/how_important_is_sex_for_you_in_a_relationship/",
 "comments": [
  {
   "comment_id": "jzy9iid",
   "message": "If our sexlife is working well it’s 10% of the relationship. If it is not working it’s 90% of the relationships.",
   "created_utc": 1694346883,
   "score": 219,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyh3jk",
   "message": "Sex is like air; it doesn’t matter unless you’re not getting any",
   "created_utc": 1694350535,
   "score": 133,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzye0cr",
   "message": "Very important, my first relationship turned into a dead bedroom situation and for me that's a 'never again'.",
   "created_utc": 1694349082,
   "score": 110,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyiin8",
   "message": "now it's my time to use this analogy\n\nwhen you buy a house, you look at everything. how its built, the size, the color, the living room, the kitchen and you also look at the toilet. now you wouldn't buy a house just cause of the toilet. but you also wouldn't buy a house that doesn't have a toilet at all.\n\nit's not the most important thing, but it can't be missing completely.\n\nEdit: please don't praise me personally for this, i just stole it from another redditor and paraphrased it here lol",
   "created_utc": 1694351176,
   "score": 32,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzygdqf",
   "message": "theres not much more non health related misery on reddit then on R/deadbedrooms so i'd say pretty important",
   "created_utc": 1694350212,
   "score": 5,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy45lb",
   "message": "It's one of the most important functions in a relationship for me. There is nothing worse than a sexless relationship. Subjective opinion, of course.",
   "created_utc": 1694343973,
   "score": 129,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy50e6",
   "message": "Me and my dog never talked about it.",
   "created_utc": 1694344434,
   "score": 189,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyalh2",
   "message": "I was in a sexless relationship for years and it made me severely depressed and self conscious. I'm glad I'm single and all but there isnt much hope left",
   "created_utc": 1694347448,
   "score": 14,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzybv4n",
   "message": "Not very. We are very loving, cuddling, foreplay, kissing etc. But the actual sex we don't do thst often. Sure it's nice but the physical contact we have is actually enough for both of us.",
   "created_utc": 1694348070,
   "score": 227,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyczcr",
   "message": "It's about libido.\n\nIt's invisible. It's silent. Might have a smell. \n\nFor certain though, it is PRESENT. One can only hope the person they're with libido is aligned with their own. If not, one person suffers while the other potentially feels guilt and or internal pressure to perform.",
   "created_utc": 1694348598,
   "score": 73,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyr2hu",
   "message": "Sex is not that important, I see it as a very nice bonus. We have gone months and sometimes almost a year without it and we are still going strong after 10 years together. We fool around if the other is pent up, but due to life and health circumstances sometimes full sex is not always available. Would I prefer if it was more often? Of course, but it is far, very far from being a dealbreaker.\n\nI find it so strange and even eye-opening that most comments say there's no intimacy without sex or call it a friend without benefits situation. My SO is my best friend and theres countless ways we are intimate and vulnerable with each other without sex.",
   "created_utc": 1694354634,
   "score": 20,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy3t8m",
   "message": "Sex is an important part of a relationship; it's all about connection and intimacy.",
   "created_utc": 1694343772,
   "score": 163,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy4d6k",
   "message": "Not too much. I enjoy the romantic stuff a lot more than the actual deed so eh.",
   "created_utc": 1694344090,
   "score": 223,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy9yt1",
   "message": "Dont care whatsoever if my partner is ace thats fine if they have a really high libido thats also fine i really dont care either way",
   "created_utc": 1694347129,
   "score": 109,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyt1ea",
   "message": "I don't understand all the comments saying that a relationship without sex is just friends. It seems like a lot of folks have never really loved somebody, or maybe they just have terrible chemistry outside the bedroom with their partners. I have friends, many of whom I'd even say I love dearly, but there is only one person that means so much to me that I'd be willing to spend every waking hour, and I guess also every sleeping hour lol, together. We are in alignment on our goals and values in life, and are working every moment to build a great life together where we can maximize the time we spend together just chilling. That's not a \"friendship\"... we are life partners. One of the many goals we share is to have a great sex life. But if for some reason this fell through, it would in no way invalidate the rest.",
   "created_utc": 1694355431,
   "score": 99,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzz8tol",
   "message": "I'm asexual with little interest in sex. While I understand that it's important in many relationship and often a requirement, I honesty don't see myself ever having sex.",
   "created_utc": 1694361041,
   "score": 27,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyd21l",
   "message": "It's absolutely essential. \n\nNo sex no go.",
   "created_utc": 1694348634,
   "score": 138,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzynjve",
   "message": "I don't seem to have a mental connection between sex and love/intimacy. It's like watching TV or any other leisure activity. So it's not really an important factor in relationships for me.",
   "created_utc": 1694353236,
   "score": 60,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzye1x5",
   "message": "Intimacy is what makes it a \"relationship\" (over a friendship), so VERY important.",
   "created_utc": 1694349105,
   "score": 254,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy3tsx",
   "message": "Depends what type of relationship",
   "created_utc": 1694343782,
   "score": 62,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyuqi4",
   "message": "Sex in a relationship is like salt in food: it only represents a small pinch in the entire dish, but if it's not there, you'll definitely miss it.",
   "created_utc": 1694356105,
   "score": 27,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzycync",
   "message": "For me and my wife it is not all that important. We are both NPF people and suffer from depression, so whenever we both are in the mood it may happen. Maybe two to three times a year. We have found other ways to show affection that works swell for both of us!",
   "created_utc": 1694348588,
   "score": 36,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzydv8t",
   "message": " At 43 I’m in need of sex more so than I was in my 20s. I’ve also been dating men in their 20s for the last two years. Sex is all it’s been for me until my horniness starts to wane 😂 \n\nBut when I do, I still need someone who wants to have an active sex life. If it’s not there as others have said it’s basically a friendship or eventually roommate situation which is what it turned into when I was married (but that was one of many issues)",
   "created_utc": 1694349013,
   "score": 78,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyb3m0",
   "message": "Not at all, I’d be fine in a sexless relationship. Though, I would prefer no sex to only a little sex. Because of that, I am also fine with, and encourage, waiting before the first time with a new partner.",
   "created_utc": 1694347714,
   "score": 57,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyi4ud",
   "message": "Not really. I mean, I'd date an asexual so long as I could jerk off when I needed to. It's not about sex, it's about releasing tension in my junk and I can do that plenty with my hand.",
   "created_utc": 1694351010,
   "score": 55,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzz256z",
   "message": "When you’re in your teens and 20s, a lot. It’s been put on this pedestal for a long time and now you get to see what it’s all about and it certainly doesn’t suck. When you’re in your 30’s with the same partner for a long time, far less. But that doesn’t mean the love isn’t there, you just don’t need to be snacking on that candy bar whenever possible. You wait to have that candy bar during those nice moments, and delayed gratification makes it taste that much sweeter. I have found that in a longer relation, ‘loving’ transfers from what I thought it was all about, the passion and cinematic romance, to maybe what we both really wanted all along, a partner. We love to cook together, clean together, exercise, play with our pups, watch our shows, spend time with our families. Sex, which seemed to be the end goal in youth, is far from it in adulthood. Yeah sex is cool, but have you ever had a productive day, accomplishing tasks, supporting one another, and knowing beyond a doubt that your partner is there to love you and not judge you or that being with this person brings out a better version of you that has sat dormant your whole life? That’s a much better place to be than worrying about how often you’re getting it in, and you still will.",
   "created_utc": 1694358823,
   "score": 46,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzye35w",
   "message": "For me it's give it take. I don't find much pleasure in sex, granted I do masturbate so the urge is still there. But I just don't find sex pleasurable. Though I would make an effort for my partner, but I would hope to find a partner kinda like me. Where sex is something that we can do, but it's not a necessity.",
   "created_utc": 1694349121,
   "score": 20,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyea9s",
   "message": "Sex is about being together and intimate to me. There's other things that do that, just less effective than sex, so while I enjoy sex and find it important in a relationship, I don't consider it essential",
   "created_utc": 1694349221,
   "score": 8,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzygyx1",
   "message": "My ex and I were very sexual incompatible and fought about sex all the time. So in my experience, yes, it is one of the most important aspects in a relationship.",
   "created_utc": 1694350474,
   "score": 9,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzykzef",
   "message": "Physical affection and intimacy is 11/10 important. That sometimes but not always manifests in sex. Also, sex isn’t a binary you’re having sex or you’re not having sex. There’s something super sexy and bonding about sexual intimacy that is just about that moment and not necessarily having to end with PinV with goal to O",
   "created_utc": 1694352227,
   "score": 15,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzynbt7",
   "message": "I’m a 50 year old male with very low testosterone levels basically causing no sex drive.  Luckily, my wife understands and is more into “cuddling” and just hanging out. So sex is definitely low on our priorities.",
   "created_utc": 1694353150,
   "score": 6,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy6rpq",
   "message": "dealbreaker if it fails on quality or frequency",
   "created_utc": 1694345409,
   "score": 34,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy615l",
   "message": "Couldn’t care less",
   "created_utc": 1694345014,
   "score": 30,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzycxsi",
   "message": "Very important but not as important as communication! We’ve been in an open-ish relationship for 2 years and it’s been really fun but not the biggest contribution of our relationship growth",
   "created_utc": 1694348574,
   "score": 5,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyfala",
   "message": "Very.  If we're not sexually compatible,  there's no reason to stay with them",
   "created_utc": 1694349705,
   "score": 5,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzlhxh",
   "message": "This one hit home.\nMy wife is currently 5 months pregnant.  Sex has been an issue for a long time. She only wants it when she does or wants another kid.\n\nLast night I asked after waiting 2 months… and again turned down.   It’s an absolute problem for me but she either just don’t get it or just don’t care.\n\nObviously I sympathize with here being pregnant but come on dude… bj.. handy… freaking somethin. \n\nI’m not a cheater, but I could definitely see why people do, this is ridiculous. \n\nThe conversations end with her just saying all I do is think about my self.",
   "created_utc": 1694365673,
   "score": 6,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzztk4g",
   "message": "I'm asexual, so not important whatsoever",
   "created_utc": 1694368485,
   "score": 19,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy6xfg",
   "message": "Very. For me, no sex means no relationship",
   "created_utc": 1694345488,
   "score": 21,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzycnh5",
   "message": "My bio dad who I rarely see or talk to mentioned one time that him and his fiance haven't had sex in 3 or 4 years. He seemed awfully troubled by it. I would have left her a long time ago. That's just ridiculous, idc how much I love her, dead bedroom is a NO from me.\n\nAs many others have said, you're pretty much just friends at that point.",
   "created_utc": 1694348441,
   "score": 20,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy484t",
   "message": "Pretty important. I think without sex I’d stop feeling desirable and that’s a big thing for me in a relationship. Tbh I want my partner to be head over heels, absolutely smitten and deeply attracted to me and that idea doesn’t really work out in my head if I don’t feel desirable because they’re not interested in sex with me. I think I could definitely be with with a partner who has a lower sex drive, but not one with no sex drive unless we had some sort of open relationship situation. \n\nProps to asexual people or people with lower sex drives for knowing what they do and don’t want and sticking to it, though!",
   "created_utc": 1694344010,
   "score": 30,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyu7hz",
   "message": "As an adult that was put through abuse and sexual abuse as a child well, sex gets fucking weird. I want it all the time but once I'm with you, and we are together the more I let you in and the closer we get, the less I want to be sexual. It makes you feel gross, like it did as a child. You love the person and care for them and it doesn't make you dislike that person, so in short it's subjective. Fuck you all who disagree lol 😂",
   "created_utc": 1694355895,
   "score": 10,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzynmmq",
   "message": "Depends. I have an excellent relationship with my accountant, but sex isn’t a part of it.",
   "created_utc": 1694353265,
   "score": 5,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzytsea",
   "message": "Quality over quantity. It’s a small part of a day or week. But pays dividends round the clock. So very important but it’s the emotion. Feelings. The smiles you get when you think of them. That lasts",
   "created_utc": 1694355727,
   "score": 6,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzziack",
   "message": "I don’t really like sex.",
   "created_utc": 1694364476,
   "score": 4,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy4dw3",
   "message": "It's so important to me, it's a deal breaker if your drive is lower than mine so I say it right ahead so we can part before we live this lie",
   "created_utc": 1694344101,
   "score": 12,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzydynm",
   "message": "You mean with my wife?",
   "created_utc": 1694349056,
   "score": 10,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzycwiu",
   "message": "On a scale of 1 - 10, it’s 9 important.\nI have a high libido so I need my partner to match my drive!",
   "created_utc": 1694348556,
   "score": 4,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzym4vk",
   "message": "I got married at age 20 (yeah I know) and wasn’t very experienced. My husband started wanting me less and less. I kept having to readjust my expectations and he’d laugh at the idea of sex every dsy. Something weird happened: I got really really repulsed by the idea of sex with him andI hated it when he did want it. I also never thought about sex much for like a year? That part of me was just dead.\n\n\nAfter the break up I learned that sex is essential to me in a romantic relationship and that MANY people have a higher libido and that it’s okay and not shameful.",
   "created_utc": 1694352684,
   "score": 4,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyq91g",
   "message": "I think it’s incredibly important for both parties to be on the same page regarding sex. Whether it’s a sexless thing, occasional, constant, monogamous, side pieces or full on swingers, if you’re not communicating and understanding there will be problems.",
   "created_utc": 1694354286,
   "score": 6,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k000bxo",
   "message": "For me very important. But if my partner and I couldn't have sex for an extended period of time, I could go without. Sex is very important but not nearly as important as communication and other romantic parts of relationships, like cuddling and all that",
   "created_utc": 1694370824,
   "score": 5,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyj3r0",
   "message": "Not important at all, if you can’t maintain a relationship without sex then it wasn’t a stable relationship to begin with.",
   "created_utc": 1694351435,
   "score": 12,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyl758",
   "message": "My advice for any long term relationship is, Never stop going down on each other.",
   "created_utc": 1694352313,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzd0hl",
   "message": "It’s not everything/all that matters, yet “no sex = no relationship” imo",
   "created_utc": 1694362535,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzde1w",
   "message": "Very important. If you’re not having sex with me then I guess that makes us friends.",
   "created_utc": 1694362672,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzheer",
   "message": "never been in a relationship bc I don't care for sex",
   "created_utc": 1694364147,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzztflb",
   "message": "I put it third, behind oxygen and water.",
   "created_utc": 1694368442,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzuss2",
   "message": "Very important.",
   "created_utc": 1694368914,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzv5n3",
   "message": "In the wise words of Kanye West: Money (or sex) isn’t everything, not having it is.",
   "created_utc": 1694369038,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzv8t7",
   "message": "Its a necessary element.",
   "created_utc": 1694369068,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzvm1z",
   "message": "Very. Its the only thing that separates a relationship from a friendship",
   "created_utc": 1694369196,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzvr7r",
   "message": "Very. Otherwise it's just friends without benefits and I've got loads of those.\n\nI get that the answer will be different for everyone and that's OK. But for me, sex is kind of a key part.",
   "created_utc": 1694369245,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k000b1j",
   "message": "Little to no priority, sure it's hot but there are so many better things in life than fucking",
   "created_utc": 1694370816,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k000nba",
   "message": "Little. I just want someone to cuddle. Sure it's better after sex, but cuddling without is good too",
   "created_utc": 1694370934,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k007uxn",
   "message": "Sex is the only reason it’s not a friendship. If sex isn’t involved frequently then we shouldn’t be a couple we should be friends.",
   "created_utc": 1694373482,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k00bbre",
   "message": "It's like food. When you have just eaten, food is not very important. When you have not had it for 3 days it is the most important thing.",
   "created_utc": 1694374654,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k00iwzf",
   "message": "It became the most important thing with my ex because she brought me out of my shell and I started to love my body and performance. That sexual validation went so deep",
   "created_utc": 1694377225,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k00q1lt",
   "message": "Uff right now is my top priority. I can express myself through sex, I can be vulnerable through sex, i can explore our love through sex... so tea really important 😌",
   "created_utc": 1694379668,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k00qes3",
   "message": "There are a lot of important things for me in a relationship but I’d have to say the emotional aspect is the most important to me. In our relationship the sex is great! Both my partner and I see it as another level of closeness which again is very important (both of our love languages are physical touch and quality time) but it isn’t just sex that we want in terms of the physical.Maybe it’s cause our relationship started out as a friendship and the sex and couple shit is an added bonus but I think we’re both ok whether he have it or not. Because of this I’d say yk it’s nice and important as a way of showing deeper levels of affection but not the most important part of our relationship. That’s how I feel tho.",
   "created_utc": 1694379792,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k00r3no",
   "message": "Went about 15 months without it with my wife, since she had 0 sex drive after becoming depressed. She only wanted it if we were drunk, which we stopped doing because it led to fights. It wasn't as necessary as I thought, but wow, not having it for so long sucked. We're in the process of splitting up, but we're still best friends. She just isn't the type of person who wants or needs sex, which caused us to slowly drift apart romantically.\n\nHaving 0 is not great, but every once in a while is super nice to have and can help maintain relationships.",
   "created_utc": 1694380028,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k00ruuq",
   "message": "Very. I have a high sex drive.",
   "created_utc": 1694380293,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k00z53c",
   "message": "50%.\nTruth.\nSex is very important but not just the act itself. It's the intimacy behind it and the bond between my spouse and me. Plus, for someone who is hypersexual, I need a man who can keep up and knows what he's doing.",
   "created_utc": 1694382918,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k0102k4",
   "message": "Dead bed means a dead relationship. Even though love is there, relationship is not.",
   "created_utc": 1694383268,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k012x5s",
   "message": "Can’t have a true relationship without it. Can’t build a relationship on it.",
   "created_utc": 1694384355,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k014za9",
   "message": "Sex is important in a relationship, as relationship is important for sex.",
   "created_utc": 1694385145,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k015jjw",
   "message": "It’s very important. When we aren’t having sex it’s super easy to get frustrated at everything, and I do mean EVERYTHING.",
   "created_utc": 1694385358,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k016vka",
   "message": "If you don’t have sex you’re not in a relationship.",
   "created_utc": 1694385869,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyf57r",
   "message": "[deleted]",
   "created_utc": 1694349637,
   "score": 10,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyb4pb",
   "message": "i dont know tbh",
   "created_utc": 1694347731,
   "score": 6,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyl893",
   "message": "It’s way down there. \n\nActually important? Honesty, communication, shared goals, putting your partner first, etc. \n\nActually spending time JUST BEING TOGETHER. \n\nYa know, the basic things that help ya go the distance and stay together.",
   "created_utc": 1694352325,
   "score": 8,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzxc61",
   "message": "If sex isn't important to a relationship then having sex outside said relationship shouldn't be a big deal.",
   "created_utc": 1694369789,
   "score": 5,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy9e63",
   "message": "Not important. Both our libidos are low. 1-2x a week max.",
   "created_utc": 1694346825,
   "score": 14,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzy88gn",
   "message": " Very, if it’s not good the relationship ain’t gonna work",
   "created_utc": 1694346193,
   "score": 3,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyfz3i",
   "message": "Extremely important, I get Bangry. And need that connection.",
   "created_utc": 1694350024,
   "score": 4,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzylibi",
   "message": "Very important. I'm kinda going through some difficult emotions these days with this, my boyfriend and I live in a conservative country where you pretty much can't live together unless you're married. Our relationship is beautiful but I always feel like we're missing out on a nice healthy sex life, I feel very disappointed that I can't have that regularly. Especially for me coz I naturally have a high libido. It's stressful, gives me feelings of depression, makes me feel lonely and makes me lose self esteem the longer I don't do it so I try to drown myself in work or focus on everything else but that's also taking a toll on my mental health. And now I'm constantly stuck in this frustrated momentum.",
   "created_utc": 1694352435,
   "score": 4,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzzoc4a",
   "message": "A relationship without sex is just a friendship.",
   "created_utc": 1694366684,
   "score": 4,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "k000dph",
   "message": "What’s with all these people who don’t like sex? Like it’s literally the most fun you can have another person and it’s intimate and meaningful.",
   "created_utc": 1694370842,
   "score": 4,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyhqz3",
   "message": "Sex is hereditary. \n\n\u0026amp;#x200B;\n\nIf your parents didn't have it, chances are you won't either.",
   "created_utc": 1694350832,
   "score": 8,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzya6bm",
   "message": "very.",
   "created_utc": 1694347234,
   "score": 2,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzybmy4",
   "message": "It's important and definitely something that needs just as much maintenance as everything else in a relationship. But, just like feelings, it can shift in intensity over the years.\n\nI used to be so much hongrier ten years ago but nowadays, sex is still nice but not a necessity for me to function. I mean, sometimes a quick date with Rosie Palms is good enough.\n\nBut intimacy with the lady is still something I won't say 'No' to. ;-)",
   "created_utc": 1694347963,
   "score": 2,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyi1i3",
   "message": "Crucial tbh and the most make or break of any relationship. \nIt's almost easier to put up with other stuff that you don't like than with sexual incompatibility.\nYou can learn to love the other stuff but that means there needs to be love sometimes.",
   "created_utc": 1694350963,
   "score": 2,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyi54w",
   "message": "Sex is a way humans connect in many ways physically mentally just some.  It brings us together",
   "created_utc": 1694351014,
   "score": 2,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyknrv",
   "message": "Extremely. Lack of sex is often coupled with a lack of intimacy in general. I for one can't have a relationship with someone who can't be intimate.",
   "created_utc": 1694352093,
   "score": 2,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzylgjr",
   "message": "On a scale to 1-10 it is 69 :).",
   "created_utc": 1694352415,
   "score": 2,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzym2fz",
   "message": "It’s very important to me. Intimacy aside, I enjoy having sex. And I’m not going to be in a relationship where I have to give that up. Been there, done that, felt like shit, never again.",
   "created_utc": 1694352657,
   "score": 2,
   "submission_id": "16exg05"
  },
  {
   "comment_id": "jzyva2h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16exg05"
  }
 ]
}