{
 "submission_id": "16f6bi8",
 "title": "What do men like to do on a first date?",
 "selftext": "",
 "created_utc": 1694367497,
 "permalink": "/r/AskReddit/comments/16f6bi8/what_do_men_like_to_do_on_a_first_date/",
 "score": 213,
 "url": "https://www.reddit.com/r/AskReddit/comments/16f6bi8/what_do_men_like_to_do_on_a_first_date/",
 "comments": [
  {
   "comment_id": "jzztxy6",
   "message": "Vanquish our enemies.",
   "created_utc": 1694368616,
   "score": 61,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzrqec",
   "message": "I’m not a man but first dates are generally meant to be shorter to decide if you actually have interest in the person. Coffee or drinks and an appetizer are easy first dates those things can last an hour and be extended if both parties are enjoying it",
   "created_utc": 1694367875,
   "score": 166,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0027ed",
   "message": "Go for a nice walk in the woods and see who finds the best stick. Have a good stick fight. It doesn't get much better than that",
   "created_utc": 1694371523,
   "score": 77,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzvvjc",
   "message": "We just want to hang out and have a good time. The pressure to “impress” a woman is really dumb and should go away. If you’re looking for an “impressive” man, go look somewhere else.",
   "created_utc": 1694369286,
   "score": 112,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k001bqs",
   "message": "Anal and ketamine",
   "created_utc": 1694371197,
   "score": 109,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzxqa2",
   "message": "I'm nerdy, so a museum works wonders. Preferably science/technology, or a natural history museum. Then something tasty to eat, not necessarily fancy, a good food truck would do.  \nAlso just hanging out indoors watching a movie while cuddling will be appreciated, that's the main kind of date we did with my wife. Which usually ended with staying over the night.",
   "created_utc": 1694369925,
   "score": 17,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzvx6w",
   "message": "a little bit of food and a lot of light conversation. I am just looking to see if we vibe and flow. I don't want to kill the comversation with a food coma, too much booze or trauma bonding. \n\nsaurce: am men",
   "created_utc": 1694369302,
   "score": 17,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k003k1w",
   "message": "Call me old fashioned, but a flowing conversation.",
   "created_utc": 1694371998,
   "score": 16,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzv4ui",
   "message": "Play chess. Screw.",
   "created_utc": 1694369030,
   "score": 97,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k004jqo",
   "message": "They like to go on dates with women they like.",
   "created_utc": 1694372342,
   "score": 13,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k000ttr",
   "message": "Watching the uncut LotR trilogy",
   "created_utc": 1694370998,
   "score": 13,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzts4c",
   "message": "mini golf!  Or just get drunk at a bar.  That was my now wife's and my first date.  We were fucked up from multiple margaritas.",
   "created_utc": 1694368560,
   "score": 52,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzxukj",
   "message": "Make out at the end of the date",
   "created_utc": 1694369965,
   "score": 41,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0056wg",
   "message": "I have never been on a date but i there is a thing i'd like to  try.\n\nI would ask the girl to go somewhere she wants to but never could and didnt want to go alone. Example maybe she is into arts but never had the occasion to share the experience of a galery with anyone.\n\nI am interested in many random things and stuff peak my intress all the time so i maybe could handle random stuff like that",
   "created_utc": 1694372562,
   "score": 9,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k003ogc",
   "message": "I’m a fan of taking my dates bowling and then for coffee or drinks. Something fun and light to make sure we mesh before longer dates",
   "created_utc": 1694372040,
   "score": 7,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k007jxo",
   "message": "Open my eyes as wide as I possibly can and scream \n\nThe waiters always hate it",
   "created_utc": 1694373380,
   "score": 7,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzv6rs",
   "message": "In my case it would be lite conversation and a good meal. I’m old fashioned I don’t think 1 hour after meeting we jump into bed and start fucking.",
   "created_utc": 1694369049,
   "score": 10,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k004kms",
   "message": "Pay attention, no phones, no distractions. My current partner noticed the waiter bought me the wrong drink order, not bad enough for me to worry about. He calmly and kindly corrected and arranged for a replacement, no fuss, no rudeness, just made sure I got what I wanted.. very sexy.",
   "created_utc": 1694372351,
   "score": 14,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzwsfj",
   "message": "It",
   "created_utc": 1694369599,
   "score": 7,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k005rxl",
   "message": "I'm nervous on a first date. I'm wondering if the girl is going to enjoy my company and vice versa. So the best first date is one where I feel more and more comfortable as the date goes on. One where the conservation flows and we lose track of time because we're having fun. So my expectation would be that if the girl is interested in me, then she will ask me questions about myself and feel comfortable answering my questions as well. Also that she will laugh at my jokes and maybe try to make me laugh too.",
   "created_utc": 1694372764,
   "score": 6,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzya1i",
   "message": "Don't sit perfectly in front of each other, sit with an angle of like 90 degrees. This way you can make eye contact but also look in front of you when you have the sensation that you're staring too much. Also it gives a sense of intimacy and the date seems more like two friends discussing and not like a job interview.",
   "created_utc": 1694370110,
   "score": 18,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0098po",
   "message": "Men be like \"Why don't women just ask directly instead of playing games\" and then when you actually do the answer is \"Vanquish enemies! Pilot a mech suit!\" 😂🤣\n\nI like to get coffee and talk while walking around the piers/wharfs in my area, there are a ton and it offers a peaceful and natural scenery that is lovely to look at but not too distracting so you can actually have a conversation. I like to walk because it gets your mind moving for interesting topics and also because it's usually a bit harder for my date to walk and focus on her phone at the same time",
   "created_utc": 1694373943,
   "score": 17,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzxgxp",
   "message": "Cream Tea.",
   "created_utc": 1694369835,
   "score": 5,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k009svg",
   "message": "A food fight, an argument and some angry sex.",
   "created_utc": 1694374131,
   "score": 5,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k000exr",
   "message": "Appetizers and wine, get to chill and know you better. \nIf it kicks off it can turn into a full blown dinner date/ drinks after",
   "created_utc": 1694370854,
   "score": 4,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00aer7",
   "message": "Playing halo 3 campaign in split screen coop",
   "created_utc": 1694374337,
   "score": 5,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00ud69",
   "message": "This comment section is just sad…",
   "created_utc": 1694381179,
   "score": 4,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k011qcj",
   "message": "Get to know an interesting and attractive woman.  \n\nMy first date with my late wife, we got stoned, went for a hike, then got pizza.   It was perfect.",
   "created_utc": 1694383899,
   "score": 5,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzv4yz",
   "message": "1st date ride the vibe keep it chill get to know the person.",
   "created_utc": 1694369031,
   "score": 7,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k000jyk",
   "message": "I can tell you what not to do, go to a concert. God that was a couple of awkward hours sitting next to a date not being able to hear them.",
   "created_utc": 1694370902,
   "score": 8,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0018fh",
   "message": "An adventure",
   "created_utc": 1694371158,
   "score": 3,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00bh9m",
   "message": "Assuming I've never met in person before, generally talk with the other person, either over a drink at a bar or at a cafe.  Sometimes go for a walk if it's nice out (Park, Riverfront or zoo).",
   "created_utc": 1694374705,
   "score": 3,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00c0cz",
   "message": "Honestly, we just want to survive it.",
   "created_utc": 1694374883,
   "score": 3,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00qfcd",
   "message": "Reading through al these you might wanna try again with the [Serious] tag haha",
   "created_utc": 1694379798,
   "score": 3,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k01cz6f",
   "message": "Too fuck",
   "created_utc": 1694388217,
   "score": 3,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k01f3vn",
   "message": "Fuck",
   "created_utc": 1694389061,
   "score": 3,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzwg8x",
   "message": "To crush our enemies, see them driven before us, and to hear the lamentation of their women!",
   "created_utc": 1694369483,
   "score": 8,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzz1wv",
   "message": "The Hibbitty Dibbitty",
   "created_utc": 1694370380,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzzxqv",
   "message": "****",
   "created_utc": 1694370685,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzzyho",
   "message": "Bowling!",
   "created_utc": 1694370693,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k001pd3",
   "message": "I prefer a situation where alcohol is served just to calm my nerves. But if you just wanted to do something fun, going Top Golf or the batting cages would be really enjoyable.",
   "created_utc": 1694371346,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k003xhu",
   "message": "I like casual activities. Trivia night at a pub, a short cooking class, any fun whimsical thing that splits the attention a bit and provides some tertiary conversation topics.",
   "created_utc": 1694372127,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k004959",
   "message": "Defend helms deep till Gandalf arrives",
   "created_utc": 1694372242,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k005al6",
   "message": "There's a think we all would love to do, but it seems that we have to wait after a couple of dates :-(",
   "created_utc": 1694372597,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k008t7a",
   "message": "I like to take them axe throwing.",
   "created_utc": 1694373803,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00brf6",
   "message": "something casual, grabbing ice cream and going for a walk for instance",
   "created_utc": 1694374800,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00qmwa",
   "message": "I like to juggle unexpectedly",
   "created_utc": 1694379871,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00rvx6",
   "message": "Anal",
   "created_utc": 1694380304,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00y8t2",
   "message": "Go to a Starbucks. It doesn’t even need to be for coffee. Get a crème frappuccino, hot chocolate, or a green tea latte. Then just talk. If you have the whole day then go for a walk after and then watch a movie. I’m also big on eating outdoors if it’s summertime.",
   "created_utc": 1694382588,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00z70j",
   "message": "Do things that allow you to discuss and react to the world around you. First/second/third date movies suck because you're not getting to know each other. Dinner is OK but you're reliant solely on the conversation. Attend a festival or art fair. Visit a museum. Go to a small community carnival or street fest. Your date will get to see how you interact with others and you'll have external situations to talk about, laugh at, etc.",
   "created_utc": 1694382938,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00znpm",
   "message": "I'm here for the food and to see if I can tolerate them while eating... if I can means it's clear to proceed.",
   "created_utc": 1694383113,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00zugr",
   "message": "Make the woman comfortable and have a good conversation over a good meal and then go for a walk",
   "created_utc": 1694383183,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k013kw8",
   "message": "A long indepth conversation about lifestyle, philosophy, prehistory, the future, artificial intelligence, aliens, climate change, the last Ice age, the carboniferous... hey! Why are you leaving?",
   "created_utc": 1694384607,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k014mrc",
   "message": "Invade Europe in a daring amphibious assault.",
   "created_utc": 1694385011,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0154ux",
   "message": "Smtn short and cheap in case things dont work out",
   "created_utc": 1694385203,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k015syp",
   "message": "Drink the blood of the non-believers.",
   "created_utc": 1694385457,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k01a8mr",
   "message": "Give her in depth lore of the doom games",
   "created_utc": 1694387152,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k01o3p7",
   "message": "We pay attention to the small details. What you wear, what you order, how you treat the server, how you look at us.  If it doesn’t all add up….. we don’t call you back.  But it goes both ways. A good guy gets that.",
   "created_utc": 1694392687,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzyidj",
   "message": "Wrestle",
   "created_utc": 1694370190,
   "score": 3,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzz3yk",
   "message": "What we want : Watching a movie at home with fastfood.\n\nWhat we think you want : Going to the restaurant.",
   "created_utc": 1694370400,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzzf73",
   "message": "Butt stuff.",
   "created_utc": 1694370505,
   "score": 5,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzr3dr",
   "message": "Just to see you. I could literally sit in a car with you for three hours if that was an option. Just sitting down and being able to talk to you personally by ourselves is all I truly want.",
   "created_utc": 1694367649,
   "score": 5,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k003zlf",
   "message": "I spent my first date with my wife on lsd (I was tripping, she wasn’t), the restaurant sucked so we went back to my house and I made her dinner, much better. Then we laid on my roof and talked until the sun came up.",
   "created_utc": 1694372147,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k007s79",
   "message": "Lots of meme answers here. Let me give an honest one.\n\nIt depends on the person.\n\nMy advice is to think about the person you're going on a date with and try to make choices that make them feel like you noticed the little things about them.\n\nI'd generally stay away from restaurants because eating detracts from your ability to chat, but some guys are foodies and love finding new places or being there at grand openings. For those guys, a restaurant might be a great choice if you can find one they haven't been to yet.\n\nI'd generally say to avoid movies for the same reason: can't talk in a theater. But same caveat, some guys are film buffs and love sharing experiences like that and talking about them later.\n\nThe point is that you can do something safe like drinks at a bar or club, or even an improv or comedy show. If drinks aren't your thing then something simple like a walk works great.\n\nIf you think he'd be light and playful enough for it, then challenge him to a thrift shop. Tell him he has an amount of money to buy something for himself, and that he can't go over budget. You split up and do the same, and meet at the register in 10 minutes. If you have good stores nearby then you'll easily find out the kind of person he is by what he buys.\n\nIf that sounds like it wouldn't work for either or both of you, then try staying in and cooking together. One person can create a shopping list and host, and the other person has to go buy the supplies. The person making the list isn't allowed to say what it is or show the other person the recipe, and the shopper does the cooking based off of what the host describes. It's a way to enjoy a meal, good or bad, and make it something you can talk about and do together.\n\nThere's tons more you can do, but the point is that you want to do something that he'd find fun, will allow him to feel good about himself, allow him to share some of his hobbies, and will be good conversation and allow you to know him better.\n\nIn the best case scenario you have a second date, and in the worst case scenario you have a lot of fun together and understand friendship is where it's at.\n\nThe biggest thing is to remember that it's for both of you and it isn't an interview, so you need to give him back whatever energy he ends up giving you. You are auditioning for him just as much as he is for you.",
   "created_utc": 1694373457,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00evjb",
   "message": "Analyze the target",
   "created_utc": 1694375839,
   "score": 2,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzuzps",
   "message": "Good question. I've never been on a date haha.",
   "created_utc": 1694368981,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzxw1p",
   "message": "I like something pretty lowkey for a first date. Coffee or a drink or two, maybe combined with a walk.\n\nBasically something inexpensive and fairly short where you an easily talk. Since the goal is to get to know eachother being able to talk is key. Also something on the shorter side is good if either person isn't feeling it they have a easy out. Also something that can easily be extended if things are going well is nice too.\n\nThat's why I like coffee or a drink. If it's at a pub or something maybe share an appetizer or something, not so much a full meal. Easy to talk, totally reasonable to cut it off after a hour or two, or stay longer if things are going well.",
   "created_utc": 1694369979,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzyh8r",
   "message": "have it happen",
   "created_utc": 1694370179,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzyzer",
   "message": "To be able to actually go on one for starters would be nice.\n\nWas meant to do crazy golf with this girl but she led me on...",
   "created_utc": 1694370356,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzrd44",
   "message": "[removed]",
   "created_utc": 1694367744,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k002bnv",
   "message": "Bang.",
   "created_utc": 1694371564,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzu44j",
   "message": "make the sex",
   "created_utc": 1694368676,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzweu6",
   "message": "Probably the same sorts of things as women. We’re all humans. We’re not that different. Individual preferences matter more. \n\nWhat would you want to do on a a first date?",
   "created_utc": 1694369470,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzxc57",
   "message": "Their date.",
   "created_utc": 1694369789,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzys5o",
   "message": "/u/Emily_VM Is likely part of [a growing bot farm](https://old.reddit.com/user/bumjiggy/comments/15p3oih/im_making_a_bot_list_im_checking_it_twice/)",
   "created_utc": 1694370285,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k004hmd",
   "message": "fuck",
   "created_utc": 1694372323,
   "score": 0,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzztdel",
   "message": "Sex",
   "created_utc": 1694368422,
   "score": 252,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k003zpc",
   "message": "Sex should be had before a first date. It’s such an Important part of any relationships it makes no sense to save it until later. The first time is rarely the best, but it allows you to see the potential. Then see where it goes from there. If the sex is bad and there’s no emotional connection, it’s much easier to walk away.",
   "created_utc": 1694372148,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzztrxa",
   "message": "Hey - Men hate dates. They are a chore. But they are a necessary evil to see if we like you.\n\nThe best date ever is one where you meet at Starbucks and find something in common you both like, then go do that.",
   "created_utc": 1694368558,
   "score": 248,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k007v0x",
   "message": "Have sex",
   "created_utc": 1694373483,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0082jk",
   "message": "Sex",
   "created_utc": 1694373555,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00ba7g",
   "message": "fuck",
   "created_utc": 1694374639,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00bwpz",
   "message": "Sex",
   "created_utc": 1694374849,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00e1a7",
   "message": "Oral and anal.",
   "created_utc": 1694375552,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00jaw3",
   "message": "Fuck, 100%",
   "created_utc": 1694377360,
   "score": 255,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00589q",
   "message": "My perfect date would end in sex",
   "created_utc": 1694372575,
   "score": 0,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k006pzf",
   "message": "Sex probably",
   "created_utc": 1694373090,
   "score": 0,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00fuzy",
   "message": "I'd be happy with a drunken blowjob and a cheeky finger",
   "created_utc": 1694376176,
   "score": 0,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00kdg5",
   "message": "Fuck",
   "created_utc": 1694377732,
   "score": 0,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k01yglc",
   "message": "Pay ideally",
   "created_utc": 1694396880,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k001kqs",
   "message": "I've never wanted to go on a date in my entire life. Can't imagine enjoying any of the capitalist bullshit they sell us out there. Can't imagine why the women enjoy it either but going out on dates is what they want, so I've done it against my own wishes plenty of times.\n\n\"What do women like on a first date?\", I think is a far more relevant question. Because I'm not gonna like anything we do, I'm just gonna have to do it because if I don't give you what you want, I'll die alone.",
   "created_utc": 1694371302,
   "score": 250,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzsqqd",
   "message": "Doesn't really matter to me. I'm there to see if I like you, not to do something else.",
   "created_utc": 1694368212,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzw88m",
   "message": "A couple of large enemas",
   "created_utc": 1694369407,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzxa6z",
   "message": "1. Top golf to just chill 2. a respectable dinner w/ alcohol 3. If you’re really cool, see live sports. 4. Coffee with museum and long walk.",
   "created_utc": 1694369770,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzzopj",
   "message": "Still no Date Yet!!!!!",
   "created_utc": 1694370597,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "jzzzwhj",
   "message": "Go to a restaurant, anything that involves talking and learning more about eachother.\n\nDO NOT go to a cinema for example, you don't learn eachother better because of it",
   "created_utc": 1694370673,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k001ni0",
   "message": "I generally like to get to know her before the whole sex thing comes into it.",
   "created_utc": 1694371329,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0028ur",
   "message": "first time ?\noh yes i very happy on first date \ni take her hand in to my hand and feels awesome",
   "created_utc": 1694371537,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k002cbx",
   "message": "To show interest in another woman while on the date, for will smith! Huzzah!",
   "created_utc": 1694371571,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k002mr6",
   "message": "Live music",
   "created_utc": 1694371675,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k002ty8",
   "message": "Take a nap.",
   "created_utc": 1694371747,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k002zwb",
   "message": "auditing",
   "created_utc": 1694371806,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k0030u4",
   "message": "Not sure what ‘men’ like, but I like to go to a nice restaurant and have a conversation.",
   "created_utc": 1694371814,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k003wp1",
   "message": "Debauchery and 2up on a motorcycle",
   "created_utc": 1694372119,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00acog",
   "message": "A movie used to be my go-to. You don't have to talk much, just sit there and watch. And if it goes well, then you go for a coffee or drink afterward. You just saw the same movie, so you've already got at least one thing to talk about.",
   "created_utc": 1694374317,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00bq99",
   "message": "Cook. I love cooking for people on my rotation.",
   "created_utc": 1694374789,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00bqj9",
   "message": "Have breakfast for dinner.",
   "created_utc": 1694374792,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00btv1",
   "message": "have people laugh at our jokes",
   "created_utc": 1694374823,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00dgnr",
   "message": "be with a girl",
   "created_utc": 1694375360,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00dobn",
   "message": "Eat. Laugh. Talk.",
   "created_utc": 1694375432,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00eogo",
   "message": "Dance on the graves of my ancestors … actually sounds great",
   "created_utc": 1694375772,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00fauf",
   "message": "Make a good impression",
   "created_utc": 1694375985,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k00h1rw",
   "message": "Go to a small quiet shop and have a talk over coffee and a light snack",
   "created_utc": 1694376580,
   "score": 1,
   "submission_id": "16f6bi8"
  },
  {
   "comment_id": "k01fg8q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16f6bi8"
  }
 ]
}