{
 "submission_id": "16fbfz5",
 "title": "What did you find out after a first date that was a deal breaker?",
 "selftext": "",
 "created_utc": 1694379306,
 "permalink": "/r/AskReddit/comments/16fbfz5/what_did_you_find_out_after_a_first_date_that_was/",
 "score": 148,
 "url": "https://www.reddit.com/r/AskReddit/comments/16fbfz5/what_did_you_find_out_after_a_first_date_that_was/",
 "comments": [
  {
   "comment_id": "k026n6g",
   "message": "he killed his dad and was accused of sexually assaulting his sister - both came directly from his mouth",
   "created_utc": 1694400557,
   "score": 121,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01uv10",
   "message": "He was a felon. Had a really unbelievable story about being locked out of his ex’s house and he broke in while JUST HAPPENING to be holding a rifle from Turkey hunting.  Terrifying.",
   "created_utc": 1694395410,
   "score": 238,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k025ngk",
   "message": "Had a guy seen completely normal, met up for a breakfast date, and before our order came he causally mentioned that I was beautiful l but would look even better with his collar on and his baby in my stomach. Out of the blue, not even remotely in the realm of the conversation at the moment. I just said I’m gonna pass on the meal and left before he said anything else, and blocked him as soon as I was home.",
   "created_utc": 1694400093,
   "score": 137,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01phxu",
   "message": "Prior to our first date he said he didn't have any kids. While he was driving me home after our first date he mentioned that he hated letting his baby mama use his car because she always messed with the radio stations and that it took forever to get his seat adjusted back to how he liked it.\n\nI was just out of highschool and wasn't looking to date anyone with kids. With how disrespectful he was during our date, finding out that he had a kid was an automatic deal breaker for me. He then kept calling and texting me and after I blocked his number he kept creating new social media accounts to get a hold of me because he wanted to go for a second date and kept bringing up that he was making good money so I'd be an idiot to say no to him.",
   "created_utc": 1694393257,
   "score": 73,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01b3lq",
   "message": "That he had restraining orders against him from not one, but two exes. Also asked if he could move in with me on the first date 😂",
   "created_utc": 1694387490,
   "score": 150,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01dr5h",
   "message": "Met up for drinks and she started telling me about how she thought I’d get along with her brother. After a couple of drinks, we end up at the bar where her brother worked. Hell of a guy. We kept playing hair metal on the jukebox and drinking beers. She went from saying I would get along with her brother to I remind her of her brother. The more she drank, the more she said it. We ended up making out and she started repeating the shit about her brother while rubbing my crotch.\n\nI made sure she got home safe but that shit creeped me out so much that I never spoke to her again.",
   "created_utc": 1694388524,
   "score": 224,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00qpz9",
   "message": "On the surface, he was a lawyer with an Ivy League degree. Then just one layer deep,he had six kids with 5 different women. One of his exes hated him so much he took their kids to Germany to get away from him. And the kicker? His youngest was 6 months old and he was sleeping on his exes couch.",
   "created_utc": 1694379901,
   "score": 78,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01hxzx",
   "message": "He told me that he couldn’t wait to have kids with me and that he had picked out our kids’ names. When I told him that this was our first date and I wasn’t sure about kids and that this was a super creepy thing to say to me, he insisted it was my duty as a woman and that it would make me very happy. \n\nYeah, there was no second date.",
   "created_utc": 1694390183,
   "score": 253,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00ri7x",
   "message": "My date kept trying to braid my hair lol. At first, it seemed weird, but not like a dealbreaker, but then he KEPT asking. The first time he asked, we were walking through the park, and I was telling a story, but he interrupted me, asking, \"Can I please braid your hair?\" I laughed, politely said no, and continued talking, but he kept interrupting, asking to braid my hair. I asked why, but all he said was, \"I just want to braid it,\" and kept reaching for my head. I swatted his hand away a few times, and when that didn't work, I told him I was ready to go home.\n\nIt was so creepy!",
   "created_utc": 1694380171,
   "score": 94,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01yu8y",
   "message": "3 days after the first time we met up this guy texted me and said he had something to ask. he said he “got curious and started going through his mom’s phone. he found her nudes, sent them to himself, and then jacked off to them.” he asked me “is that weird?” i said yes and blocked him 👍🏼",
   "created_utc": 1694397040,
   "score": 74,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k0155fd",
   "message": "She said she used heroin but unlike most people, she could do it safely.",
   "created_utc": 1694385210,
   "score": 61,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k016kud",
   "message": "She was married. We met at a bar and left together. Went and had dinner saw a movie and she spent the night. The next morning she says “I wonder if my husband figured out I didn’t come home” then she asked me for a ride to work and I got a ticket because she didn’t wear her seatbelt.",
   "created_utc": 1694385753,
   "score": 195,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01cit8",
   "message": "The date went well we just did the typical coffee and chat then decided to go back to my place for a movie. As soon as we walked in the door he tried to shove his tongue down my throat no warning. I backed away because he caught me off guard. He asked to use my bathroom (I thought more to escape embarrassment and to start over.) He walked out completely naked crawled onto my bed and spread his ass cheeks asking me to eat his ass and talking about inviting his friends over for an orgy. I was so confused because while we were messaging I asked him about sex like what he was into and looking for and he said he didn't want to have sex on our first date.",
   "created_utc": 1694388048,
   "score": 231,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01jdm7",
   "message": "He was hung up on his ex to the point he wouldn’t stop talking about her for the entire dinner.  Ohhh, and he told me he was an alcoholic that still drinks and runs AA meetings.  He got drunk and I used his phone to Uber him a ride home.",
   "created_utc": 1694390767,
   "score": 161,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01i2g0",
   "message": "Her other guy showed up in the middle of our date. She said \"Can I talk with him for a minute?\" I said \"sure\" then walked out the door and never looked back.",
   "created_utc": 1694390231,
   "score": 139,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01ivak",
   "message": "He asked me to pay for his court fees, that was my turn off so I wanted to leave to end the date.I said my goodbyes, he threatened to tell the whole restaurant I was having an affair \u0026amp; cheated on him if I left. I stayed in fear of embarrassment. Excused my self to the restroom where I made my escape to the door. He saw me from the window I saw him coming out I ran a bit, looked back to see him chasing me 😭😭😭",
   "created_utc": 1694390560,
   "score": 172,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01amy9",
   "message": "She had a date right after our date WITH HER STEADY BOYFRIEND. Not the next night, 5 minutes later. I had to drop her off at the next date. Like, why go out with me when you have a boyfriend!?!? I didn't even try to kiss her, but she planted a big one on my lips to say goodbye.",
   "created_utc": 1694387309,
   "score": 26,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01h3ci",
   "message": "He was a really bad magician. Brought cards and everything, couldn’t land a trick :/ \nI felt bad and took him up on a second date but that was it.",
   "created_utc": 1694389844,
   "score": 114,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01qvr2",
   "message": "That my date would not cut his toe nails that he would grow them on purpose because he would prefer using his toe nails to \"scratch his legs.\" \n\n\"I don't have to bend down so often.\"\n\nI got to see them. Folks, I ran. I ran.",
   "created_utc": 1694393808,
   "score": 64,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01pil8",
   "message": "He didn't even make it to the first date before telling me all about the custody battle with his crazy ex-wife over their 2 year old son.\n\nOh, plus the bit where he asked if he could kiss me, twice, and then to get around me saying \"no\", kissed his fingers and touched my forehead and said \"this is my kiss to you\" like a creep.",
   "created_utc": 1694393264,
   "score": 127,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k02a30u",
   "message": "She got off on watching the guys she was with get in fights. She gave some dude the come-fuck-me eyes and then expected me to brawl when he came up to hit on her. Fuck no, maybe you can catch a ride home with him.",
   "created_utc": 1694402184,
   "score": 206,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01xxfi",
   "message": "I think she was in love with her best friend and didn't realize it. She told me she and her long time best friend she called her \"wifey\" lived together in a single room with the friend's baby. She said that this friend always comes first and they're inseparable. They also have gotten kicked out like 3 times from house to house. She left the date early because whoever they were renting from was threatening to kick them out. We never really talked again but I wanted to tell she shouldn't be dating because she's already in a relationship.",
   "created_utc": 1694396659,
   "score": 137,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01zt7e",
   "message": "He had a record because he beat his ex-girlfriend. Like broke her face, bad.  My \"friend\" set me up with him to boot. Worst date I ever went on. \"Joked\" about keeping women chained up in basements. Bragged about tipping poorly, while he knew I was a waitress. Kissed me without my consent at my car. Texted me nonstop afterward, wanting me to join his church. When I found out his history the next day, I was sick to my stomach. Friendship didn't last long either.",
   "created_utc": 1694397460,
   "score": 184,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k014r0u",
   "message": "He lost a pile of money in crypto and NFTs. But still tried to convince me to get my money in to it.",
   "created_utc": 1694385057,
   "score": 239,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00z41z",
   "message": "It was during the first date, he talked shit to a harmless homeless woman. I was close to home and dismissed myself immediately.",
   "created_utc": 1694382907,
   "score": 143,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k026rvw",
   "message": "I got home and googled him after a great date. Turns out he was arrested 10 years before for putting a camera in the women’s washroom at his dental clinic. He was a dental surgeon. \n\nStill can’t believe I kissed that guy. So gross.",
   "created_utc": 1694400617,
   "score": 175,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01gblu",
   "message": "Technically this was after a second date but…I was so impressed that he’d treated me *and* the person who introduced us to sushi. I was 18 and he was 27, so I guess it just impressed me because most 18 year olds can’t just treat a group to sushi. \n\nBut then he let slip that he’d paid for it all with his mom’s credit card…he didn’t have a job. Recovering addict. And his mom’s credit cards were financing his whole life.\n\nSo….it was a deal breaker.",
   "created_utc": 1694389534,
   "score": 209,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01mol3",
   "message": "Date (19 M) said his ex's parents hated him. I asked why. Turns out his ex was 13F. Gee, why would her parents have a problem with them dating?   \n\n\nHere it is, years later and I still feel like I need to shower after typing that.",
   "created_utc": 1694392114,
   "score": 100,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k015v8d",
   "message": "He referred to every woman in his life as a cunt. His ex-wife. His coworkers. His son’s girlfriend. The ladies he came across at work (correction officer). He must’ve used it 12 times in a two hour conversation. I think that’s more than I’ve heard that word used in conversation in the previous 20 years combined. He was not British. There was no cultural slang going on. It was very off putting.",
   "created_utc": 1694385481,
   "score": 246,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01kneb",
   "message": "He had “no money to get home” and wanted to sleep at my place… big nope, stranger.",
   "created_utc": 1694391286,
   "score": 60,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01ee8d",
   "message": "He forgot to mention his three kids. Also, in the same breath said his ex was a psycho.  When I questioned why he hadn't mentioned his kids before, he said it didn't matter because they lived full-time with their mom. \n\nI have divorced parents. Guess how I reacted? \n\nAnother one kept talking about how he wanted five kids but didn't want to get married. I said that I wasn't down, sorry. He countered with \"but Europeans do it all the time.\" I was sitting there like, who the fuck sitting at this table is European, because I sure as hell am not.\n\nIDk why it's always about some kid-related issue. Maybe because they find out I work with children so they think I'm like a Duggar and/or willing to accept a gaggle of other people's children. Not happening.",
   "created_utc": 1694388771,
   "score": 82,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k018crq",
   "message": "He kept telling me what to do. It seemed innocent at first, but after the third or fourth time, nah, not doing this again.",
   "created_utc": 1694386433,
   "score": 96,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01i44l",
   "message": "He asked me to call his girlfriend to tell her we would be together now.",
   "created_utc": 1694390250,
   "score": 36,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k023ni5",
   "message": "She lied about having kids. I made it clear I didn't mind, but she was adamant that she had no kids. I find out she has a 5 year old. We're both late 40's.i would be ok with her having a kid. The fact she lied is the issue.",
   "created_utc": 1694399168,
   "score": 140,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k019wfs",
   "message": "found his twitter and besides his online personality being hating on women and loving soccer I saw a tweet about me, regarding a comment I said about not liking a certain artist and how stupid he thought I was… ghosted him immediately",
   "created_utc": 1694387019,
   "score": 184,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01irut",
   "message": "Threatening to cut my throat was a bit of a deal breaker.",
   "created_utc": 1694390521,
   "score": 114,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01l5ur",
   "message": "She couldn't stop talking about how much cocaine she did. I at worst have a drink once every few weeks. Not my scene.",
   "created_utc": 1694391498,
   "score": 205,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01dn3g",
   "message": "I read through the comments and expected to see so many trivial things.  \n\nI went on a date with a woman I met while travelling for work.  She mentioned her husband in passing the next morning.  I said \"wait, you're married?\" to which she replied, \"What he doesn't know won't hurt him\".  I was pissed.",
   "created_utc": 1694388478,
   "score": 177,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k026jfo",
   "message": "On the first date, he revealed that he had a tickle fetish and did not believe me when I said I wasn't ticklish. So the next 4 hours were filled with him trying to surprise tickle me...",
   "created_utc": 1694400510,
   "score": 122,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01togx",
   "message": "She mentioned that I should check out her pics from a trip she took recently on Facebook. I go on her account, and there were pictures of her with a guy with the caption \"I love this man.\" I asked her about him, and she said they have been broken up for a few months. The pictures were only posted two weeks prior to our meeting. I clicked on his tag, and there's pictures of him and her being a couple that was posted the day before she and I met. \n\nIt's obvious she was lying to me, and I'm not a fan of cheaters. I blocked her",
   "created_utc": 1694394940,
   "score": 250,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01r4dw",
   "message": "I’ve had some terrible ones but my best friends takes the cake. Her date said he was a writer and he’s doing a book about women…he said the first chapter was called “don’t flatter yourself”. He proceeded to tell her how women think they are above everyone and that his book would help solve some of their annoying issues. \n\nMine isn’t nearly as good but here is one of my top deal breaker dates - he came into the bar and instead of giving me a hug or handshake hello (first time meeting in person since we met from a dating app) he decided to lick my face. LICK MY FACE. He then sat down and talked only about how  he needed to get laid. I was mortified and left early.",
   "created_utc": 1694393901,
   "score": 22,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k0158li",
   "message": "He had two ex wives with kids and seemed way to eager for marriage number three. Big old nope!!\nHe also happened to grow up in this sex commune I grew up near called Moorehouse.\n\nTo be clear. The sex commune part was interesting but not why I wasn’t interested.",
   "created_utc": 1694385242,
   "score": 254,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01qe46",
   "message": "He was a convicted pedophile. As in, “how to catch a predator” arrested. And when confronted, did not acknowledge the significance of what he did nearly enough.",
   "created_utc": 1694393617,
   "score": 132,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01w01h",
   "message": "This was in college…..we met at a friend’s birthday party. She was a friend of a friend of a friend type deal. I should have known she was trouble from the start because at the party she told me she was a sophomore, turned out she was a freshman. But whatever….\n\nWe went out on a date for dinner, walked to get some ice cream, and then she invited me up to her dorm room to watch a movie. Her roommate was out for the night and we ended up hooking up. The sex was good, she was fun, and she was hot. Great combination. \n\nTwo days later she comes over to my place and my roommate and his girl are there too and we cook dinner. After dinner I drive her back to her place because she had a test the next day and needed to study. I go to walk her to her room and she stops me outside the building and says, “So, I have to tell you something….I have a boyfriend. He goes to school 8 hours away from here…but my roommate knows him and I can’t have you come up to the room to walk me home.”\n\nYep, that was the end of that. Told her that was cool. Call me if things ever ended with her boyfriend. She tried to call me to hang out the next weekend. I asked her if she was still dating the other guy and she said, “yes…no…Its complicated,” so I hung up. Never went out with her again.",
   "created_utc": 1694395878,
   "score": 35,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k0223z5",
   "message": "We met at a restaurant. Everything went nicely, but when we were ordering, he informed the waitress that I would be ordering, then he would watch me eat, and order his food when I'm about half finished. I got up from that table so fast.",
   "created_utc": 1694398480,
   "score": 200,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01vtnh",
   "message": "Had a great start to the first date, we’d been chatting online for quite some time and met at a mutual local pub and really enjoyed each others company after the nerves wore off. \n\nHe invited me back to his place, with the warning that he hadn’t tidied up. I’m tidy but not even remotely picky about a bit of a messy house.\n\nYeah no…. Not only was every inch of the kitchen counters covered in beer and alcohol bottles, the place looked like I walked into a place 15 years after a zombie apocalypse. The layer of dust on every item was shocking. And he had some really nice belongings, but all of them just rotting under the mess \n\nI actually felt really bad and asked if he was okay and had considered getting professional help. His answer was ‘nope, this is how I live’ \n\nI politely excused myself.",
   "created_utc": 1694395804,
   "score": 190,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01j6pj",
   "message": "She told me she smoked meth with her dad.",
   "created_utc": 1694390690,
   "score": 101,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01h69o",
   "message": "I went to the washroom during our date, as people do. Afterwards, he texted me to ask if I was playing the \"hold it\" game with him. I was puzzled. \n\nTurns out, peepee fetish. Fine. Not my thing though. He tried to get me into it by sending me porn stories. Not fine. \n\nLike have your kinks but don't force them on me or assume I'm playing some niche game lol",
   "created_utc": 1694389875,
   "score": 124,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01hob4",
   "message": "Drove erratically and way too fast with me in the car, trying to show off.  I refused to go on another date but stayed in contact.  They totaled their car the next week.",
   "created_utc": 1694390074,
   "score": 171,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k015k9i",
   "message": "Homie wanted a threesome with his step brother",
   "created_utc": 1694385366,
   "score": 231,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01vicc",
   "message": "First date where I let the dude pick me up. We went to the driving range and dinner. We both had a lot in common. I was really enjoying myself and getting more and more excited that I could see myself with this dude! \n\nI didn't want it to end so I suggested dessert. During the car ride there, total 360. He started talking about how women are meant to breed for one man and men are designed to fuck around and impregnate many women. How \"he's not like those guys\" but that's how the world works and \"304's\" are anomalies and commented on the way these women wear revealing clothes (cue me looking down at my skirt). After my initial shock, I challenged him. Then realizing this wasn't working, I disagreed and politely asked to change the topic. He wouldn't let it go.\n\nHe not only continued, but OVER AN HOUR about the \"biology\" of women and men, and then had a bunch of religious \"wisdom\" in there for me that I just can't remember. Looking back I totally could've gotten an uber home, but at the time he was my ride so I just politely smiled and nodded.\n\nThe next morning I texted him we had different world views it wasn't going to work. He tried to argue that we had a good time and \"fuck the world views, what if I just didn't tell you all this, we coulda been happy together\". Yeah, no thank you.",
   "created_utc": 1694395673,
   "score": 2,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01acup",
   "message": "He told me his ex has like 7 multiple personalities (also told me their names and ages). I might have been OK with him, but he has an 8 year old son with her, so she's going to be in his life for a while. I don't need the drama.",
   "created_utc": 1694387199,
   "score": 209,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01ffba",
   "message": "Not as advertised. \n\nI don't care if it's height, age or weight. If you lie about it I'm going to nope out of there, even if it leaves things feeling awkward as fuck. \n\nWe aren't starting something on dishonesty, sorry.",
   "created_utc": 1694389184,
   "score": 250,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01abk6",
   "message": "He spilled beer on his menu and slurped it off with his mouth",
   "created_utc": 1694387185,
   "score": 104,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01o475",
   "message": " He had previously been arrested for a serious assault on his ex-partner.",
   "created_utc": 1694392692,
   "score": 83,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00zelb",
   "message": "She told me she was a Christian life coach.  Then asked me what my personality type was and proceeded to try to tell me about who I was and why.",
   "created_utc": 1694383017,
   "score": 213,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k011bdu",
   "message": "She showed up in an outfit I describe as “shit we need milk, let me run to the gas station” and extremely late. She immediately asked if I wanted to get a room lol….nope.",
   "created_utc": 1694383740,
   "score": 210,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00pcw3",
   "message": "They lied about their age. Said they were younger than they were to get me on the date. I wouldn’t have cared about their age, but I did care about the lie.",
   "created_utc": 1694379431,
   "score": 139,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01omtn",
   "message": "Apparently she thought I was going to shuttle her Children- who I hadn’t even met yet- to and from school. That I was going to drive her to the hospital for a surgery she never told me about, keep her kids at my place overnight then bring her back to her place and be her housekeeper/ babysitter while she recovers. This after ONE DATE. So there wasn’t a second date. And she didn’t understand why I would balk at all this since “ your my boyfriend now and that’s what boyfriends do.”😳",
   "created_utc": 1694392899,
   "score": 160,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01c7c1",
   "message": "That she thought her neighbor fucking his dog was funny. And yes, I reported him to the cops. The dog is with a loving family now.",
   "created_utc": 1694387925,
   "score": 31,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k020oty",
   "message": "She was an alcoholic in denial. She told me she was on day 3 of a 90 day sobriety challenge and she was “struggling”. Her words. She didn’t think she’d been on a date sober before, she wasn’t sure what we were suppose to do.\n\nShe had been to court ordered AA for a DUI but knew she wasn’t an alcoholic cause her life “wasn’t as bad as those peoples.\n\nThen at the end she threw out “I kind of hate dogs”. She should have led with that.",
   "created_utc": 1694397853,
   "score": 74,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k018k7f",
   "message": "First date was great. What ended up being the dealbreaker was what I learned on the second date:\n\nIt was learning her purse contained morphine which she had stolen from the educational hospital she worked at in the Bronx in case her hangover from our date was bad. Also she had watched a stab victim die on the table earlier that day and was acting very chill when she decided to tell me about it.\n\nAlso at the end of the date she told me \"You know if you had been more of an asshole to me I probably would have tried to sleep with you.\" you know... if stealing morphine and nonchalantly telling your date the second time you've met them about the murder victim you tried and failed to patch up wasn't enough for you.\n\nEdit: man I'm remembering a lot about this date. She also told the story of the last guy she went out with who upset her so she called him a 'F@$$#t' loudly in the restaurant they were in. She told this story... rather loudly at the diner we ended up at for food later in the night. It was a long date... I was an idiot... I might still be an idiot... I dunno... I need a hug.",
   "created_utc": 1694386511,
   "score": 66,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01rkwb",
   "message": "Not after, but during the first date… I was catfished with pictures that were of her 15yrs prior, but I figured maybe I’ll make a friend. So I had the prime rib, while she started downing wine and said she wasn’t that hungry. *(She also asked if I could give her a ride home if she had another glass of wine, and that she was in the next little beach town over).*\n\nAfter dinner *(and her 3rd glass of wine)* we take a walk on the beach to get to know one another, you know… where are you from what do you do kinda chat. Turns out she’s the head of our local chamber of commerce… BUT she spent the last 10yrs at a Pray the Gay away church in Texas 🙄 that’s when I interrupted to tell her my daughter is Pansexual and she said “we should go get some more wine.”\n\nI said my back hurt and needed to go home, but she started a public temper tantrum (like a fucking 5yr old being ripped out of a Chuck E. Cheese)! I’m also actually friends with the owners of the restaurant and try to de-escalate the situation. She’s mad I’m not giving her a ride home and just generally being a horrible person. \n\nSo I begrudgingly agreed to take her home. First we have to go to her car and get her stuff. The car is a 1980s piece of crap with a Blow and Go in it from having too many DUI’s. And she brought 3 bags of stuff out of her car, a hair dryer and a suitcase, but wait, it gets worse! \n\nNot only does she not live in the little beach town next to mine she lives 45 minutes away so now I’m stuck in the car with her while she’s trying to violently jerk me off. I literally had to say “if you don’t stop, I will pull this car over and call the police” so then, when we get about a mile from her house, she rolls down the window and just starts screaming “why won’t you let me pleasure you!” At the top of her lungs… I pull into her driveway grab all of her stuff, take it up to the front porch and run back to my car because I have to take a piss like a racehorse and I know if I went into her house I probably wouldn’t of made it back out alive…worst first date ever!\n\nThe one funny thing that came out of it. The restaurant owners thanked me the next day and said if I ever get in a situation like that again we should have a SafeWord! So now if I’m on a first date and I ask if they still have the blueberry pancakes, security will escort my date out of the restaurant! I stopped dating for a few months after that one.",
   "created_utc": 1694394083,
   "score": 60,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01cw2l",
   "message": "The chewing noises",
   "created_utc": 1694388185,
   "score": 43,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01aagf",
   "message": "He said that his fav movie was \"A Serbian Film\". Idk that kind of scared me lol",
   "created_utc": 1694387173,
   "score": 230,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01ergv",
   "message": "Ask how much I make and what’s in my bank account.",
   "created_utc": 1694388921,
   "score": 254,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01kiox",
   "message": "A few options here:\n\n•tried to do cocaine in my car… then he blocked me when I told him I didn’t want a relationship\n\n•this one’s gonna sound weird but he thought he had discovered some amazing artist who wrote poems about lord of the rings and turned them into songs. The songs in question were just covers of the actual songs from the actual movies, with lyrics Tolkien himself wrote. He was creepy too, and then he refused to accept me telling him (rather politely) that it wasn’t going to work out\n\n•military guy (25) had a kid that I found out about after the fact. NOPE.",
   "created_utc": 1694391232,
   "score": 233,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01fpry",
   "message": "He told me he was kicked out of college because he was accused of rape. “But there wasn’t evidence for the state to charge him” but enough for him to be kicked out of school. I usually give folks the benefit of the doubt but that was a check please moment.",
   "created_utc": 1694389295,
   "score": 203,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k02fvqr",
   "message": "Apparently it was a dealbreaker for him when I beat him at Guitar Hero. 😂\n\nI really missed out on a real winner.",
   "created_utc": 1694405221,
   "score": 62,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k02sxl5",
   "message": "[deleted]",
   "created_utc": 1694413616,
   "score": 61,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01qssl",
   "message": "she told me that she's Catholic \u0026amp; I was going to burn in eternal damnation for being an atheist, but we still hooked up for a little while after that, even went to Australia with her for NYE!  \n\n\n  \n\n\n  \n\n\n  \n\n\nI went home early though because what ultimately turned me way off was that she had a life-long heart condition, had several surgeries throughout life \u0026amp; her doctor told her to cut back on coffee, so when I watched her blow 2 fat lines of coke at a NYE party I lost whatever interest I had left. Where does she get off telling me I'm living some awful life when she didn't give a flying fuck about her own? Hypocrite.",
   "created_utc": 1694393777,
   "score": 225,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01269w",
   "message": "They talked constantly about their Ex, it was clear that they were not over their past relationship.",
   "created_utc": 1694384069,
   "score": 108,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01c77c",
   "message": "Poor oral hygiene",
   "created_utc": 1694387924,
   "score": 110,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01kxz7",
   "message": "He parked his car in a parking lot that apparently closes with a gate after a certain time and his car got locked in there. He had to drive to work in the morning and was more than an hour from home, so I drove him all the way back. \n\nHe asked if he could smoke in my car, and I wasn’t about that but he had had a rough night and I felt bad, so I said sure. He proceeded to chain smoke 2 packs of cigarettes over the course of one hour and then had the audacity to ask if he could play some of his raps that he had on SoundCloud. After an hour of that and the interior of my car forever ruined, that was the end of that.",
   "created_utc": 1694391407,
   "score": 11,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k0226ib",
   "message": "He was friends with a guy who sexually assaulted our mutual friend when she was passed out drunk and still went to Wednesday board game nights with him every week. If that’s the kind of person he wants to spend his free time with then that says a lot about him.",
   "created_utc": 1694398512,
   "score": 112,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01x7y7",
   "message": "She made it very clear she was into being peed on and raped within 15 minutes of our first date at 715 on a sunday morning, we hadn't even ordered breakfast yet, it was ROUGH",
   "created_utc": 1694396377,
   "score": 57,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k028u1f",
   "message": "I met someone for dinner and we ended up going back to her place.  It was a really fun night and everything seemed to go great.  I called her the next day and left a message but never heard back.  I thought it was strange because like all of us I would like to think I can tell if things go well or not.\n\nAnyway, I let it go.  A couple days later she calls me up and tells me she had been arrested for drunk driving and had been in jail.  She had totaled a brand new mercedes after she ran a red light.  She didn't remember anything that  happened that night.  How she got in the wreck, nothing.\n\nI would like to say I put my foot down and decided not to see her again.  Nope, I tortured myself for the next 5 months.  She was a hardcore alcoholic.  Often times she couldn't remember anything from the night before.   She had just divorced some multi millionaire.  She told me she became a problem drinker because when ever she couldn't get out of sleeping with him she would drink alot.   The sex was amazing but I'm lucky I made it out alive.",
   "created_utc": 1694401584,
   "score": 56,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00z1cw",
   "message": "She’s in to MLM’s and encouraged me to ‘invest’ in this ‘amazing technology company’ that will launch an internet, cable, and cellular service...but first I should look in to the company’s ‘flagship’ health supplements and skin care products.",
   "created_utc": 1694382879,
   "score": 186,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01gy0b",
   "message": "Poor butt washing.",
   "created_utc": 1694389784,
   "score": 155,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01zzxj",
   "message": "He said he liked manipulating people for fun and could tell that I’ve been abused in the past, which is why id end up marrying him. Got way too sexual way too fast, didn’t want to wear a condom \u0026amp; said he didn’t like pulling out. Also said I had a “fertile womb” after I said I had a big family and that’s was great bc he always wanted 5 kids. \n\nDude got cut off and posted on one of those “are we dating the same guy” FB pages and had other girls commenting about how much of a creep he is to girls at the gym \u0026amp; how he told a single mom she wouldn’t be able to find someone to date/marry bc “no one wants used goods”",
   "created_utc": 1694397544,
   "score": 153,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01i9sz",
   "message": "He wouldn’t kiss me until it was after we said, “I do.”",
   "created_utc": 1694390315,
   "score": 55,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k016pnz",
   "message": "This happened a very long time ago when I was young. I went on a dinner date with a very handsome guy that I had met at my huge apartment complex's pool.\n\nWhile we were talking he had he  mentioned that his father was the minister of his church and proudly  showed me pictures of this big beautiful church with a high ceiling\nIt was paneled inside with wood.  \n\nHe didn't mention anything about his denominational beliefs.  But later in the discussion he.made some rather racist comments. I finished the date as gracefully as possible and went home. I never went out with him again.\n\nAs I said, it was a very long time ago.  So a few years later when shows like Jerry Springer and the Geraldo show were on they interviewed members of a crazy racist church group called the \"Christian\" Identity Movement (CIM). It turns out that his father was rather famous.  The church that he had shown me a picture of was also pictured on the Jerry Springer Show.\n\nIt was crazy. I never would have expected someone that looked like him to be so mentally ill.  It really hit me hard in the gut to learn that some things can look so nice and innocent and beautiful. But be so completely rotten and Evil\n\n\nhttps://www.ojp.gov/ncjrs/virtual-library/abstracts/christian-identity-movement-analyzing-its-theological",
   "created_utc": 1694385804,
   "score": 57,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k011bba",
   "message": "He could list on the fingers of one hand the foods he would eat. He was a great guy but I couldn’t even imagine a second date because I like to eat in restaurants and we’d used up the one local place that he would tolerate any of the dishes from.",
   "created_utc": 1694383739,
   "score": 44,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00thc4",
   "message": "She had recently been released from juvenile hall for assaulting her mom.",
   "created_utc": 1694380866,
   "score": 109,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01bvk6",
   "message": "She was a drug addict.\n\nShit sucked. Really cool girl, got along well, lots of chemistry… pill problem.\n\nI tried to ‘fix her,’ and it turns out she didn’t like my older kid. Kid wasn’t even 5. Had to cut that shit off.",
   "created_utc": 1694387795,
   "score": 235,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k00qad2",
   "message": "[removed]",
   "created_utc": 1694379750,
   "score": 14,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01io1j",
   "message": "Shouldn't have been a reason but it was at the time. Turned out she lived in the same apartment complex as my ex who I had spent the last 2 years trying to get over, including therapy. She was absolutely lovely, but I couldn't make the drive to her place without being flooded with emotions.",
   "created_utc": 1694390478,
   "score": 251,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01939d",
   "message": "Lied about age. Was 10 years older than he claimed.  I found out myself through internet research.",
   "created_utc": 1694386707,
   "score": 95,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k010lxv",
   "message": "After the date, we walked out, and as I walked to the passenger side, I said, \"Hey, did you leave your window down?\" We got a little closer, and it was apparent it was broken. \n\nHis immediate response was, \"probably a fucking (N word).\" I froze totally. He got into the car, and there was a police report left. The person had been caught doing the act, was arrested, and the officer left the information for my date. Unfortunately, it included a description that included the person was African-American.\n\nHe started yelling at the top of his lungs, \"I knew it! Fucking (N word)!\" Over and over. People were looking at us. I was so embarrassed. Honestly, I didn't even feel safe having him drive me to my own car. But, I wasn't familiar with the area. \n\nObviously, never spoke to him again afterward.",
   "created_utc": 1694383472,
   "score": 38,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01xayi",
   "message": "We went out for drinks, seemed a little immature but overall nice, said they were 25. Found out they were using their older sibling’s ID and had lied about their age. They were 19, I was 27.",
   "created_utc": 1694396412,
   "score": 49,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01y4vd",
   "message": "He was popping Xanax and chasing it with vodka. His pupils were dilated as fuck on our date and was acting super weird and embarrassing. I’m never dating a pill popper again, they’re nuts, especially when drunk.",
   "created_utc": 1694396743,
   "score": 48,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k027dnq",
   "message": "Invited him over for a nice home-cooked meal. He brought a bottle of wine and proceeded to drink the entire thing by himself before I finished cooking. He was totally sloshed and relentlessly hitting on me. Nope.",
   "created_utc": 1694400889,
   "score": 48,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k01ndsn",
   "message": "1 hour into the date. Everything's going pretty awesome. She's a hot, eastern European chick. well educated, smart, sexy, the whole package. No red flags.\n\nAs we're finishing our last drink she just casually mentions how gay people should be banned from going out in public, and should preferably be executed.\n\nI stood up, said \"thanks for the conversation but I'm going to leave now\". Left a 20 for the drink and walked.",
   "created_utc": 1694392403,
   "score": 132,
   "submission_id": "16fbfz5"
  },
  {
   "comment_id": "k042ang",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16fbfz5"
  }
 ]
}