{
 "submission_id": "16flio5",
 "title": "Guys who actually bought the “You won’t last 5 minutes playing this game” game from the ads from adult videos, what was it? What happened? Was it a scam?",
 "selftext": "",
 "created_utc": 1694405523,
 "permalink": "/r/AskReddit/comments/16flio5/guys_who_actually_bought_the_you_wont_last_5/",
 "score": 117,
 "url": "https://www.reddit.com/r/AskReddit/comments/16flio5/guys_who_actually_bought_the_you_wont_last_5/",
 "comments": [
  {
   "comment_id": "k03yhdv",
   "message": "[Vice (RIP) actually did an article about this.](https://www.vice.com/en/article/wxeja5/i-tried-not-to-cum-while-playing-the-adult-games-advertised-on-pornhub) \n\nBasically it's a scam to get 40 bucks a month off you. Maybe more.",
   "created_utc": 1694440078,
   "score": 42,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03w4l1",
   "message": "I was curious myself, so I used my Privacy.com account to create a $1 card. Enough to get approval, but that’s it. \n\nWhen I created the account and got access… the website was basically a Geocities website with a series of “this or that” images. “Which do you prefer?”\n\nThat was the game. But I did, in fact, get screwed. \n\n(Well… attempted to get screwed. Thanks Privacy!)\n\nIn a matter 1-2 days I had over $750 in fraudulent charges attempted against that card. It all got declined, of course, but it was interesting how fast and how varied the charges were. $6.83 here. $22.37 there. They just kept coming (heh) all day long. \n\nSo, yes, it’s a scam.",
   "created_utc": 1694439073,
   "score": 87,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03co0b",
   "message": "I played one that was a card game.\n\nBuild a deck, fight the enemy, win, upgrade your cards to make them more naked, gamble for more cards and repeat.\n\nIt was meh.\n\nDidn't have to buy anything though.",
   "created_utc": 1694428741,
   "score": 82,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03ctoi",
   "message": "Lol I know someone who did, who happened to be a girl which I found surprising. She said she almost immediately got a phone call from her bank said her account had been locked due to suspicious activity and they asked her about the charge and she is like \"oh gosh no I would never\" and was super embarrassed about the whole thing lol.",
   "created_utc": 1694428851,
   "score": 110,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k02q5mh",
   "message": "The game was 4 minutes long.",
   "created_utc": 1694411648,
   "score": 25,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k039x8c",
   "message": "I played one of them it was a terrible flash style game the story line was a joke and the art was garbage also some of them want your card plus it was like a goofy ass 8 minute play through with some dumb ass super heroes desperately needing to fuck each other💀💀",
   "created_utc": 1694426765,
   "score": 21,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03roua",
   "message": "I've played one similar, not porn, but with a weird ad. Characters were racing in a waterslide. Ad said \"99% can't reach the ocean\". That's because the end of the race was in a pool.",
   "created_utc": 1694437082,
   "score": 168,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k02gyg7",
   "message": "Bruh you have to pay for those? I've seen the ads, I just thought it made you pay in malware or something",
   "created_utc": 1694405836,
   "score": 200,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k031093",
   "message": "I DIDN'T BUY IT BECAUSE I HEARD IT PUTS A VIRUS ON YOUR DEVICE THAT CAUSES YOU TO ONLY TYPE IN CAPS, ABSOLUTE SCAM!\n\n\n\n\nEdit: my first viral comment! Thank you guys and thank you for the award!",
   "created_utc": 1694419899,
   "score": 116,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k02gsm4",
   "message": "I rarely last 5 minutes on my own anyways, don’t need a game for that",
   "created_utc": 1694405741,
   "score": 91,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03dbfn",
   "message": "Anybody else just here because you’re curious if anyone actually bought any of those things in the ridiculous ads?",
   "created_utc": 1694429184,
   "score": 239,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03js4u",
   "message": "Finally someone is asking the questions that need to be asked!",
   "created_utc": 1694433088,
   "score": 21,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k02kxnc",
   "message": "Played one out of curiosity, but got extremely offended at how poorly the vajaysjays were drawn. SO UPSET I didn't nut for the rest of the week.",
   "created_utc": 1694408207,
   "score": 84,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k02h3vs",
   "message": "Lasted a minute and got a trojan",
   "created_utc": 1694405923,
   "score": 93,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k036ghz",
   "message": "I recommend you put a condom on to avoid the viruses",
   "created_utc": 1694424153,
   "score": 170,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03k833",
   "message": "“Hey! You! Are you jerking off alone?”",
   "created_utc": 1694433326,
   "score": 28,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03ge9w",
   "message": "Most of those games are also on f95zone\n\nIt's just clickbait.",
   "created_utc": 1694431151,
   "score": 57,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03n217",
   "message": "I go to F95zone and get everything free.\n\nBest game’s are:\n\nDreams of desire \n\nShut up and dance \n\nTimestamp\n\nStraitened times \n\nWhere the heart is \n\nBang city\n\nMilfy city (when the dev gets off his lazy ass and finishes the final update)\n\nMidnight paradise \n\nAnd many more.",
   "created_utc": 1694434810,
   "score": 204,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03jv7b",
   "message": "Yeah OP, no. Every single one of them are scams, but I won't ruin your fun just yet. Lotta actual games like this exist, both on steam and other sites. For the top notch stuff and most effort/reward ratio, you gotta sail the 7 seas. Start on itch.io for a general idea.",
   "created_utc": 1694433134,
   "score": 2,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k033p9y",
   "message": "Bought it, only played it for 30 seconds, asked for a refund\n\n\"Sorry you have to atleast last 5 minutes for a refund\" and they hung up on me :(",
   "created_utc": 1694422008,
   "score": 126,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03aswo",
   "message": "It was so shit I uninstalled it and left a shit review.",
   "created_utc": 1694427417,
   "score": 69,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k035d5v",
   "message": "What about those ads telling me I have to fuck old ladies? I get them while watch gay porn. 🤦🏻‍♂️",
   "created_utc": 1694423311,
   "score": 124,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03o6rz",
   "message": "There's a few youtube / game reviewers who did it, IIRC the gist is:\n\n\u0026gt; It's basically a low budget shitty game you'd expect to cost $2 on steam. But porno-fied.",
   "created_utc": 1694435386,
   "score": 35,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k048wpm",
   "message": "There are two types of childhoods in this comment thread: \n\npeople that accidentally clicked on the AO section of Newgrounds as a kid \n\nAnd people that don't know what Newgrounds is...",
   "created_utc": 1694444202,
   "score": 31,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k046mb5",
   "message": "I got curious about this one day so I set up a \"fake\" but working debit card number I could freeze and burn.\n\nTo be clear, this was supposed to be \"free\" but used a credit card number for age verification.\n\nImmediately I got ALL KINDS of attempted bogus charges. Something to the tune of $100 within the first 10 minutes. Each charge was from a different merchant account with bogus contact info.\n\nFor the next three months they kept hammering it, four or five times a week for roughly $200 each week. Again, each contact info and merchant info was bogus. It would be a different account and info for each and every charge. \n\nEventually they stopped entirely. I then burned the card.\n\n\n\n\nAll of that and I didn't even get any access.\n\nAnd for our readers at home, you can do this with privacy.com. It links into your account and lets you create a new card for each merchant, single use if you want, spending limits, and even pause or close the card. It's the only thing I use any more.",
   "created_utc": 1694443329,
   "score": 28,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03uoj1",
   "message": "I always think about all of the developers of those games. Like they probably had big dreams of working at a company like PlayStation or something and now they’re programming pixelated buttholes and wieners for a shady scam company.  Living the dream.",
   "created_utc": 1694438442,
   "score": 50,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03csia",
   "message": "[removed]",
   "created_utc": 1694428827,
   "score": 43,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03srwg",
   "message": "Came before I could enter my card details.",
   "created_utc": 1694437591,
   "score": 20,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03rncy",
   "message": "I once had a visa gift card that was pretty much empty and I used it when I was like 16 on a few of those sites. \n\nI never got to play a game, every single time it would say “your state requires proof of age” and it would say I had to send my ID and SSN as proof. I never did that. \n\nI did buy a brazzers membership accidentally when I was 18. I got like the $1 trial and learned that they make it incredibly difficult to cancel your membership, so I was getting charged like $50 a month until I noticed it. (Like 4 months later) \n\nThe website they use to cancel it magically never works. So you have to call, which my anxiety filled ass couldn’t do, because who wants to call and say “hey I want my porn membership canceled” \n\nI just canceled my card and said the info got stolen and got a new one. It was easier that way. \n\nDuring that time when I was 18 I also spent way too much on onlyfans, and I can say their system is actually much better. It’s incredibly easy to cancel subscriptions, you can easily take a card off, and I’ve never had my info stolen from it. I don’t use of anymore as I no longer pay for porn as I’ve gotten smarter finically, but I definitely learned stuff the hard way. \n\nI will say the biggest scam on onlyfans is people saying that a message photo or video is something that it’s not and charging a shit ton for it. Usually your youtuber turned of models are the worst at this, it’ll always be shit like “omg this was my first sex tape, purchase to see me get fucked” and it’ll be like $75 for a 30 second video of them before they fucked with no nudity. Or people will resell the same video, porn stars are the worst at this. They’ll resell the sad thing but never tell you that it’s the same so you can purchase the same video multiple times",
   "created_utc": 1694437063,
   "score": 68,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03iq5r",
   "message": "Got the game. Didn't last 3.\n\nAlien Isolation is a b**** of a game and I loved to play every second of it.",
   "created_utc": 1694432507,
   "score": 17,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k04706r",
   "message": "Maybe not exactly what you’re asking but close enough.\n\nhttps://www.vice.com/en/article/wxeja5/i-tried-not-to-cum-while-playing-the-adult-games-advertised-on-pornhub",
   "created_utc": 1694443479,
   "score": 16,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03rheu",
   "message": "Anybody got an answer that isn't just a joke? I didn't realize this question needed the [SERIOUS] tag.",
   "created_utc": 1694436985,
   "score": 15,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k06fpyy",
   "message": "Turns out it was yet another rerelease of Skyrim. Todd Howard is getting sneaky with these.",
   "created_utc": 1694472823,
   "score": 13,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03pb6n",
   "message": "It's not a scam, half of the time it's Raid:Shadow legends",
   "created_utc": 1694435944,
   "score": 35,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03clzf",
   "message": "It was so shit I uninstalled it 4 minutes later, so it's true.",
   "created_utc": 1694428702,
   "score": 42,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k0470jv",
   "message": "Paying for p0rn is a psychopath move.",
   "created_utc": 1694443482,
   "score": 9,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k05n17a",
   "message": "Sounds like it's a better investment to drop $6.99 on Steam for [Genital Jousting](https://store.steampowered.com/app/469820/Genital_Jousting/). At least that game has a compelling storyline. And dicks.",
   "created_utc": 1694462223,
   "score": 11,
   "submission_id": "16flio5"
  },
  {
   "comment_id": "k03g98s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16flio5"
  }
 ]
}