{
 "submission_id": "16fqocv",
 "title": "What's the Scariest Disease you've heard of?",
 "selftext": "",
 "created_utc": 1694424127,
 "permalink": "/r/AskReddit/comments/16fqocv/whats_the_scariest_disease_youve_heard_of/",
 "score": 133,
 "url": "https://www.reddit.com/r/AskReddit/comments/16fqocv/whats_the_scariest_disease_youve_heard_of/",
 "comments": [
  {
   "comment_id": "k037ys4",
   "message": "ALS. You just get to chill while your body starts to fail you. You become more and more of a burden to those around you. Slowly lose the ability to walk, feed yourself, bathe.. then one day you can't get up at all. Then you can't talk. You barely move your head at all, but you can't still think. You can see your family suffering, watching you slowly deteriorate.   \nIt's a nightmare for all involved.",
   "created_utc": 1694425292,
   "score": 48,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k036z59",
   "message": "Dementia and because you basically sit back and watch as it slowly starts to eat away at you, but there's nothing you can do.",
   "created_utc": 1694424550,
   "score": 3,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k041c2v",
   "message": "Prion diseases can go back to the deepest pits of Tartarus where they came from.",
   "created_utc": 1694441261,
   "score": 235,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03tnsu",
   "message": "Locked In Syndrome\n\nFully conscious but can only move your eyes. \n\nJust fucking locked inside your own body with your mind",
   "created_utc": 1694437990,
   "score": 120,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03aj31",
   "message": "Alzheimer's disease. With memories effectively making you who you are to a certain degree, I can't begin to imagine losing them all, and not knowing who my family is.",
   "created_utc": 1694427221,
   "score": 160,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03cm67",
   "message": "CJD. Prions scare the fuck out of me.",
   "created_utc": 1694428706,
   "score": 163,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03rudf",
   "message": "Glioblastoma MTF killed my wife 16 months.",
   "created_utc": 1694437155,
   "score": 217,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k036res",
   "message": "Rabies\n\nFuck that\n\nEdit: how the fuck did I get 10 thousand upvotes for a 3 word comment that no effort went into?\n\nThere are some genuinely talented people out there, upvote them instead",
   "created_utc": 1694424384,
   "score": 213,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03tpus",
   "message": "My hypocondriac ass should NOT be reading this",
   "created_utc": 1694438016,
   "score": 0,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03p6rq",
   "message": "Since rabies has already been mentioned: HACE, or High Altitude Cerebral Edema, particularly on deadly mountains like Everest.\n\nThe idea that you get so confused and disoriented that some people just step off a ledge, or undress because they feel warm and die from hypothermia scares the hell out of me.\n\nOnce you get it, there's no way to get down by yourself and no one can help you.",
   "created_utc": 1694435883,
   "score": 52,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k039ib0",
   "message": "fatal insomnia and rabies",
   "created_utc": 1694426450,
   "score": 117,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k042mr7",
   "message": "DIPG isn’t mentioned here. It’s a type of brainstem cancer that most commonly impacts 5-7 year old kids but can effect anybody from toddlers to young adults.\n\nYou get it you die. There is no other cancer like it. It’s the only childhood cancer with a \u0026lt;1% five year survival rate and you slowly lose all function because of it.",
   "created_utc": 1694441784,
   "score": 36,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k042j8s",
   "message": "Cholangiocarcinoma.  Bile duct cancer.  I was diagnosed with it a year and a half ago at the age of 39.  It is a mast, aggressive, extremely deadly form of cancer.  The only way to treat it is if you catch it in its first stage, but it usually doesn’t manifest physical symptoms until late stage 2, early stage 3.  Even catching it early, the five year survival rate is 15-25%.  We caught mine in stage one, but it attached itself to my hepatic artery.  While I was off chemo, and getting radiation to try to shake it loose, it spread through my abdomen.  Now, my tumor markers have spiked, I’ve been in a lot of pain, which leads to painkillers and their side effects, and I’m waiting on a phone call with the results from the Ct scan I got Saturday.  Let’s just say, I’m not waiting on good news.  Could be weeks or months, but I probably don’t have much more to live than that. \n\nThis particular cancer is a gnarly one.  Only one way to cure it, and you have to get lucky to get there.  Nothing I did caused it, I just got hit with shit luck.  Never even heard of it until a year and a half ago, now I’m waiting to see how soon it will kill me.  I just want a little more time.  I don’t want to stop seeing my 8 year old son yet.  That’s my greatest fear is leaving him and my wife.  That’s why this is the scariest disease I have ever heard of.  Are there worse, more gruesome diseases out there?  Absolutely.  But this one is the one staring me down right now, and I’m running out of ways to fight it.",
   "created_utc": 1694441746,
   "score": 234,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03fjk8",
   "message": "munchausen by proxy\n\nEspecially in mothers, and I think it’s worse because of social media. I knew a woman who had a kid my sons age. She put this kid through hell all for likes and sympathy from strangers on the internet. She eventually killed the child… this was over a decade ago and it still bothers me. She was in our social circle, so not friends, but we knew her and her kid.",
   "created_utc": 1694430624,
   "score": 101,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03p9eq",
   "message": "Huntington's Disease. It's ALS, Alzheimer's and Parkinson's all wrapped up in one unavoidable and incurable disease once you have been diagnosed. Worst of all it's slow and hits you in the prime of your life usually around your 40s-50s.",
   "created_utc": 1694435920,
   "score": 116,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03tzhf",
   "message": "Addison’s disease.\n\nIt causes low cortisol levels and you could die from literally being stressed out or catching a cold. People who have it have to be on steroids for life. If something was to happen and they couldn’t take their meds, they can die within two days for extreme cases of adrenal crisis.",
   "created_utc": 1694438134,
   "score": 51,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03lmyk",
   "message": "Fatal familial insomnia is still the worst one I've heard of.\n\nOnly good thing you can say about rabies is that once symptoms develop, you'll die pretty quickly. With FFI it can take months (or even years) to die and you won't be able to sleep the entire time. \n\nAlzheimers/dementia scares me a lot too.",
   "created_utc": 1694434076,
   "score": 100,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03qb0r",
   "message": "Kuru disease\n\nYears ago, when cannibalism was a thing in Papa New Guinea, a lot of citizens were dying from this disease. Basically it's caused by the ingestion of an weird amount of folded proteins.\nIn Papa New Guinea they used to have the tradition to cook and eat deceased family members (i don't remember why). Women and kids were the ones most likely to have this disease since they were the ones who consume the brain (organ with a LOT of folded proteins). \nThis was almost epidemic since people who were infected would also, once they're dead, be eaten, spreading the disease to other people.\nIt was completely fatal.",
   "created_utc": 1694436429,
   "score": 245,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03xmxq",
   "message": "Trigeminal Neuralgia aka Suicide Disease. \n\nIt is nicknamed Suicide Disease because the pain is so allegedly so unbearable many opt for just killing themselves instead of living with it.",
   "created_utc": 1694439718,
   "score": 59,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k037qo7",
   "message": "Ebola scares the shit outta me",
   "created_utc": 1694425121,
   "score": 221,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03pcph",
   "message": "Sepsis. \n\nMy aunt got hit with sepsis about a year ago. Was totally fine, out having lunch and laughing with friends on Thursday. Was dead by Saturday morning. \n\nWe’ll never know what caused it. It happened so quickly they were never able to determine the source. It could be as simple as a cut on your finger that gets infected.",
   "created_utc": 1694435965,
   "score": 220,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03aphc",
   "message": "Anything with ameba in your head, turning the brain into mush.\n\nLike Granulomatous Amebic Encephalitis, but also shit like and Chagas Disease.",
   "created_utc": 1694427349,
   "score": 204,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k040rel",
   "message": "The one that doesn't let you reach rem sleep so you die of prolonged exhaustion",
   "created_utc": 1694441028,
   "score": 98,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03hn9i",
   "message": "Wasting disease for deer",
   "created_utc": 1694431888,
   "score": 186,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03u3dj",
   "message": "SIDS. I don’t even have kids but the idea that you can have a baby and then it just dies for no apparent medical reason is terrifying.",
   "created_utc": 1694438182,
   "score": 226,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03uggd",
   "message": "Batten disease \u0026lt;- just found out about this today when a child was diagnosed with dementia during a vision test at school",
   "created_utc": 1694438343,
   "score": 82,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03v2dk",
   "message": "Aneurysm, basically we are all at risk by it. Even healthy individual are known to die from it, still the highest risk are mostly from sedantary and dangerous diet and lifestyles. The scariest thing about aneurysm is you never know when it occurs, just imagine someone watches you with a Sniper Rifle pointing at you, hesitant to shoot you.\n\nI was used to drink Energy Drinks often and the pulsing feeling in my head scares me so much that I have to regulate myself consuming it, once a week I do for now.",
   "created_utc": 1694438609,
   "score": 24,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03mkhs",
   "message": "Naegleria fowleri. Brain eating amoeba. 97% fatality rate.",
   "created_utc": 1694434560,
   "score": 70,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03hocv",
   "message": "That disease that turns your bones to stone and you have to choose weather to sit or  stand permently for the rest of your life",
   "created_utc": 1694431906,
   "score": 251,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03ylgp",
   "message": "Necrotizing fasciitis - ever since I saw a documentary about someone with this and the disease had eaten the skin off his face to the degree that half his face was gone, leaving just his skull in some places. Could literally see the bones of his face, it was gnarly 😬\n\nIt had even eaten one of his eyes",
   "created_utc": 1694440125,
   "score": 128,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03x1te",
   "message": "Schizophrenia. Literally living in the matrix while matrix isn't real.",
   "created_utc": 1694439472,
   "score": 51,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k049l3y",
   "message": "My buddy got meningitis.  We had a party at work he was fine, dancing, smiling, no problem.  Work closed for December and reopened in January.\n\nFirst day we hear this guy is really sick.  Next day, he got worse and gone deaf.  Two days later, he's gone blind as well.  Next day he died.\n\nIt was so sad, he was the best guy.",
   "created_utc": 1694444458,
   "score": 59,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03r88p",
   "message": "Spinal Meningitis was terrifying to me when I was a kid for two reasons\n\n1. I was largely under the impression that sharing a soda with someone could lead to me potentially dying a horrible death\n2. I thought Zelda was the scariest part of Pet Sematary",
   "created_utc": 1694436863,
   "score": 104,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03oi9x",
   "message": "I forget the name but there’s a disease that just makes the proteins in your brain and nervous system just randomly stop forming correctly. And they self replicate. So within a year of ONE prion folding incorrectly to just completely fuck you for the rest of your short life",
   "created_utc": 1694435549,
   "score": 54,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03zejv",
   "message": "[Reston virus](https://en.m.wikipedia.org/wiki/Reston_virus) comes to mind. Its a similar relative of Ebola, which is already nasty in itself. RESTV can infect humans, but all recorded cases of that happening were completely asymptomatic. That's a massive relief, since RESTV is AIRBORNE. Imagine airborne Ebola. That thing is probably just a few chance mutations away from being able to screw up humans.",
   "created_utc": 1694440463,
   "score": 54,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k040c0v",
   "message": "Mucormycosis\n\nFungus invades your face, eyes, and sinus cavities and eats everything from the inside out, necessitating disfiguring surgery",
   "created_utc": 1694440850,
   "score": 52,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03jxdz",
   "message": "Contracting botulism",
   "created_utc": 1694433167,
   "score": 32,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03vqpz",
   "message": "My old man used to say: “what doesn’t kill you, makes you stronger. Except for polio”\n\nPolio scares me.",
   "created_utc": 1694438905,
   "score": 68,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03vtqt",
   "message": "Addiction. Because it doesn’t just effect the addict. It can devastate families, friends, community, the country \u0026amp; the world.",
   "created_utc": 1694438941,
   "score": 179,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k04c1dd",
   "message": "All these scary diseases, makes me wish assisted suicide was more normal. I can’t imagine having something like Alzheimer’s and just wasting away day by day. I would want my family to remember me and not have to worry about taking care of me or where to put me.\n\nEdit: was also thinking, assisted suicide would never happen in the U.S bc the healthcare system makes too much money off treating these patients.\n\nEdit: for clarity, I meant that it probably wouldn’t be legal in all 50 states. I know there are states in the U.S that this is legal.",
   "created_utc": 1694445380,
   "score": 116,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03btp2",
   "message": "bone cancer",
   "created_utc": 1694428151,
   "score": 102,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k03irfi",
   "message": "The one where your muscles slowly turns to bones...\n\nYou are turning into a statue and can't do anything about it.",
   "created_utc": 1694432527,
   "score": 107,
   "submission_id": "16fqocv"
  },
  {
   "comment_id": "k04h08c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16fqocv"
  }
 ]
}