{
 "submission_id": "16funu6",
 "title": "What's the grossest thing you've ever tasted?",
 "selftext": "",
 "created_utc": 1694437203,
 "permalink": "/r/AskReddit/comments/16funu6/whats_the_grossest_thing_youve_ever_tasted/",
 "score": 242,
 "url": "https://www.reddit.com/r/AskReddit/comments/16funu6/whats_the_grossest_thing_youve_ever_tasted/",
 "comments": [
  {
   "comment_id": "k045fxb",
   "message": "I work with my brother and I usually drive. He started chewing tobacco and I didn’t even know. He kept a water bottle to spit into in the cup holder where I usually keep my water bottle. Yep you know the rest.",
   "created_utc": 1694442875,
   "score": 146,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04uenb",
   "message": "I once took a nice healthy bite of blueberry coffee cake. Turns out it was regular coffee cake covered in mold. \n\nI couldn’t get the smell and taste out of my sinuses for hours.",
   "created_utc": 1694452061,
   "score": 17,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k03yli7",
   "message": "There’s a product that you can buy that’s meant to discourage dogs from chewing on stuff. It’s called “Bitter Yuck”.\n\nLet me tell you. It is both bitter _and_ yuck.",
   "created_utc": 1694440126,
   "score": 59,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04lv1d",
   "message": "Beer in a can that someone had used as an ashtray.",
   "created_utc": 1694448970,
   "score": 56,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04dt3h",
   "message": "Oyster flavored ice cream",
   "created_utc": 1694446034,
   "score": 34,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k03z6dz",
   "message": "Copper sulfate.\nBefore you judge, I was in 9th grade learning what makes a salt. In my mind, I was like yeah, sodium chloride is a salt we can eat, why not try this one. \nMy taste bud took a while to recover.",
   "created_utc": 1694440369,
   "score": 147,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04tpcq",
   "message": "The solution you drink before a colonoscopy.\n\nMaybe not the worst but the sheer volume of that vile shit you have to consume is disgusting",
   "created_utc": 1694451807,
   "score": 103,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k043w72",
   "message": "I bit into a persimmon like it was an apple. My mouth immediately went dry like if you’ve ever tasted a banana skin. Terrible. Lasted for most of an hour. My lips couldn’t even close bc they were stuck to my teeth. I guess it completely changed the ph of my saliva or something.\n\nI guess persimmons are good if you cook them? Idk. I don’t actually care, that was too rough of an intro for me lol",
   "created_utc": 1694442274,
   "score": 155,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04pqpk",
   "message": "Nintendo Switch game cartridge. They're made like that to discourage children eating them. I learned this and what can I say, I got curious.",
   "created_utc": 1694450372,
   "score": 58,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k0448w5",
   "message": "Gonna be real w you, I accidentally took a big swig out of the ash/spit/cig butts beer bottle. It still haunts me",
   "created_utc": 1694442412,
   "score": 95,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k0484sl",
   "message": "Not going to lie, someone else’s piss, at a party and someone decided to empty my can and piss in it as they where desperate to pee… and never told me… fml.",
   "created_utc": 1694443909,
   "score": 111,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04an2v",
   "message": "The vomit that came up after a night of chasing Jagermeister shots with orange Gatorade. I was young, thrifty, and entirely new to drinking.",
   "created_utc": 1694444858,
   "score": 105,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k044dgg",
   "message": "Bile. \n\nI was very surprised that it looks like green antifreeze. Absolutely bitter and it sticks to your mouth.",
   "created_utc": 1694442462,
   "score": 163,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k049uoz",
   "message": "my Cymbalta tablets when split reveal the bitter chemical hidden beneath the coating. it’s so nasty i have to chug it down as soon as it hits my mouth. fortunately i’ll be done tapering off them soon so i can deal with less disgusting things.",
   "created_utc": 1694444559,
   "score": 80,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04ciip",
   "message": "I microwaved a bag of microwavable greenbeans in college. I’d just melt cheese on it and eat the whole thing, had done so many times. This time I bit into something sort of hard and textured and it was the most bitter horrible thing ever. I spit it out and it looked like a KNEX rod, it was yellow and like ribbed. So so gross. The taste stayed in my mouth for hours. No idea wtf that was.",
   "created_utc": 1694445557,
   "score": 67,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04mg3w",
   "message": "A home-cooked dinner at a Southern relative’s house. Sounds good, right? Disgusting. Gray, overcooked, unidentifiable meat with mushy overcooked canned green beans. I’m past 60 now and it remains the worst meal of my life.",
   "created_utc": 1694449181,
   "score": 53,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04xenp",
   "message": "I have severe GERD and sometimes at night my stomach leaks it’s contents into my windpipe and it gets inhaled into my chest while I’m sleeping. I then spend an hour coughing it all back up",
   "created_utc": 1694453131,
   "score": 100,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04unsr",
   "message": "Tetracycline oral compound\n\n\nI got e coli at age 5, we were in a very remote area in my country, it was the first case in the city in over a decade, my mom had to bring me to the Naval Hospital because they keep dismissing my symptoms as stomach bug, a very important surgeon ordered my admission.\n\n\nI was very young but knew it was dangerous, my mom stayed with me those three days even when nurses told her I was going to be fine in their care.\n\n\nThe Tetracycline was brought by helicopter form the capital, the only dosage they had. Nurses tried to convince my mom to tell me it was candy, but my mom was adamant to tell me the truth: that it had an horrible taste, but if I wanted to get better and go home I had to take it, and also that it was the only bottle they had to I SHOULD NOT SPIT IT.\n\n\nWhen they opened the bottle the whole room felt the damn smell, it was bitter to no end.\n\n\nI did not spit it.\n\n\nA 8 years old kid with cerebral measles gave me orange soda afterwards.",
   "created_utc": 1694452152,
   "score": 90,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04vjpj",
   "message": "My first boyfriends semen.\n\nApparently if you subsist on fast food, smoke pot like it’s going out of fashion along with booze and diet soda, it’s going to taste bad.\n\nIt was so bitter it actually hurt my mouth (you how some wines give a pucker in the back of your jaw? Times that by 1000) and the taste was so vile it took all my strength to not immediately vomit.\n\nI ran and spit into the sink and started scrubbing my mouth and teeth with as much toothpaste and mouthwash as possible.\n\nThe worst part was the taste lingered for a full week. It wash fucking awful\n\nEdit: y’all it’s wild how different semen can taste. I had a next door neighbor who ate a lot of fresh fruit, he and I palled around a little and his was sweet, I didn’t mind giving him oral.\n\nAnother one of my exes was mostly vegetarian diet with poultry and fish. Hand to god his semen tasted like chicken consommé , it was weirdly delicious",
   "created_utc": 1694452471,
   "score": 148,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k0441ff",
   "message": "Got pizza and a burger at the drive-in. They both tasted like grill cleaning chemicals. Thought I was going to vom. Ended up eating sour skittles for dinner. Trrrible.",
   "created_utc": 1694442331,
   "score": 124,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04b56i",
   "message": "Hakarl aka fermented Greenland shark. Twice. The vomit I swallowed while choking it down was better than the fish.",
   "created_utc": 1694445046,
   "score": 88,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k048srv",
   "message": "Dog toothpaste. I was brushing a dogs teeth and as I was doing it, they shook their head and a glob of toothpaste landed right in my mouth.",
   "created_utc": 1694444160,
   "score": 43,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k0473rl",
   "message": "Ear wax",
   "created_utc": 1694443517,
   "score": 38,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k042j4t",
   "message": "Milk that had gone bad",
   "created_utc": 1694441745,
   "score": 66,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k040vxa",
   "message": "A durian, whoever was the first person to eat that must have been dying of hunger",
   "created_utc": 1694441080,
   "score": 234,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04dhdj",
   "message": "When the dentist reached in with that bent syringe and rinsed five days of food particle build-up out of my empty tooth socket🤢",
   "created_utc": 1694445911,
   "score": 57,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k03rz82",
   "message": "Meat jelly.",
   "created_utc": 1694437220,
   "score": 102,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04fz9f",
   "message": "mistaking Chinese 5 spice for cinnamon as a child trying to make toast before school",
   "created_utc": 1694446837,
   "score": 29,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04muqd",
   "message": "My uncle's chewing tobacco spit.",
   "created_utc": 1694449328,
   "score": 26,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04xgqu",
   "message": "I mean I guess it worked, but the stuff you can put on your nails so you won't bite them. One tiny touch to the tongue and I had to go wash my mouth and gargle mouthwash.",
   "created_utc": 1694453152,
   "score": 29,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04ffya",
   "message": "It’s a tie between bad mushrooms at work (I’m a chef) and the *ahem* of a guy who was very dehydrated.",
   "created_utc": 1694446642,
   "score": 47,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k0444px",
   "message": "This one girl who wiped back to front.",
   "created_utc": 1694442367,
   "score": 157,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k042e34",
   "message": "Malört",
   "created_utc": 1694441690,
   "score": 63,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04late",
   "message": "Hawthorn berry \"fruit leather\"; wife saw one on of these survival video's that these things are edible, so we picked some from a nearby tree and she made them into strips. She didn't want to taste them so I did...  \n\n\nYou know that feeling when you throw up so much that there is nothing left but bile, and that you can feel all your teeth when that happens? That's what hawthorn berries taste like.",
   "created_utc": 1694448765,
   "score": 22,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04o8ej",
   "message": "I worked nights with a guy who chain smoked cheap cigarettes. He came in one night saying he made chili and asked if we wanted some. Said sure… when I looked at it, it was like gray meat in water. Chili should be a nice reddish brown. But he was right there and being both stupid and polite, I took a bite. It tasted like stale cigarette soup.",
   "created_utc": 1694449825,
   "score": 23,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k050xe6",
   "message": "I'm sorry japanese reddit, but Natto. \n\nThat, and accidentally taking a sip of a soda can my dad was using to spit his tobacco in.",
   "created_utc": 1694454383,
   "score": 22,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04q6dc",
   "message": "Mudfish.\n\nLike burning tyres mixed with diarrhea in a jar",
   "created_utc": 1694450533,
   "score": 19,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k03yprw",
   "message": "Chicory and Radicchio. Vile, bitter salad leaves that have no place in a meal ever!",
   "created_utc": 1694440176,
   "score": 32,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04f5sw",
   "message": "After changing a diaper I made lunch. Thought I had peanutbutter on my knuckle, nope... not peanutbutter. Guess being sleepdeprived wasn't helping me remember to wash my hands afterwards...",
   "created_utc": 1694446538,
   "score": 58,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04isgp",
   "message": "Liquid charcoal",
   "created_utc": 1694447849,
   "score": 16,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k03sd64",
   "message": "Once we Ordered Pizza In a new place that replaced the one we used to eat to. When it came....Holy Shit, The Crust Looked like Burned Paper. The Pizza had more oil then Flavor and Tasted Blank Like The cheese had been there for Over 50 decades. Worst of all..the price, one pizza costed 12€ (The same Price as 12$ around that time)",
   "created_utc": 1694437402,
   "score": 45,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k03s10g",
   "message": "Once I accidentally took a big gulp of what I thought was apple juice, but turned out to be pickle juice. Let's just say my taste buds were in a pickle that day.",
   "created_utc": 1694437243,
   "score": 64,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04mn78",
   "message": "Whatever kind of bug that flew into my mouth while riding my bike. Tasted like pepperspray.",
   "created_utc": 1694449253,
   "score": 14,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k040oax",
   "message": "I had to have an endoscopy. They give you this numbing gel stuff to gargle first and it is truly awful. Just this slimy consistency with the flavor of anesthetic. You'd think they'd at least try with some synthetic flavor or something but nope, just goopy original lidocaine flavor or whatever.",
   "created_utc": 1694440993,
   "score": 34,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04xhwo",
   "message": "Nintendo switch cartridge is up there",
   "created_utc": 1694453163,
   "score": 14,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k063f2p",
   "message": "Tonsil stones",
   "created_utc": 1694468009,
   "score": 12,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04yaex",
   "message": "It's a tie for me. My partner LOVES black licorice in every weird variety. Recently they've been dabbling with double-salted licorice. It's black licorice coated in, not table salt, but salmiak salt, which is ammonium chloride. The second it got my tongue something deep in my lizard brain yelled \"POISON\". It truly did not taste like food.\nSecond is kratom. \"Oh it tastes like green tea!\" No, no it tastes like garbage water and makes my throat close up on contact",
   "created_utc": 1694453444,
   "score": 12,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k045yr4",
   "message": "I'd like to say that it was the scrambled eggs with radioactive beads I had to eat last week for a stomach emptying test...   \n\n\nBut it was frozen durian fruit.     \n\n\nI tried.   My Filipino American DIL had been to Malaysia on a Fulbright and had had the real thing while she was living there.   So when she saw some frozen at the 'local' Asian food store she grabbed some for us to try.    \n\n\nEWWWW... it was days before my taste buds.. and sinuses recovered.",
   "created_utc": 1694443079,
   "score": 24,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k05irp3",
   "message": "When I was a therapist intern, I had a client who was severely overweight. He wore flip flops year round, drank only monster energy drinks, smoked 3 packs of cigarettes a day and showered *maybe* once a week. When he was in the building, I could taste it. Sitting 3 feet in front of this man and his crusty toes, roadkill beard, smoke-infested clothing and body odor was so bad that I started putting clove oil in my beard before each weekly session. Even then, the rankness clung to my nostrils and taste buds the rest of the workday.",
   "created_utc": 1694460733,
   "score": 24,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04x120",
   "message": "Liquid iron supplement. Has the consistency of syrup and tastes like a rusted pole.",
   "created_utc": 1694452998,
   "score": 11,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04q6zc",
   "message": "Durian.\n\nTastes like fart.",
   "created_utc": 1694450539,
   "score": 11,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k05hipd",
   "message": "Arby's beef n' cheddar, but they forgot the cheddar.\n\nI don't know what I took a bite of, but I think it was 50% plastic. Never went back to Arby's ever again. For a place that prides itself on \"meats\" it probably has the lowest quality.",
   "created_utc": 1694460281,
   "score": 9,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04gp9v",
   "message": "Chitterlings (aka Chitlins) they taste like the smell.",
   "created_utc": 1694447100,
   "score": 18,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k05hkbr",
   "message": "the taste of when you have thrown up so much only bile comes out. it is the most foul taste.",
   "created_utc": 1694460297,
   "score": 8,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k05hns1",
   "message": "50 year old poppy seeds I found in someone's house. Their parents apparently kept buying spices and shoving the old bottles back into the cupboard, and couldn't reach them when cleaning out...\n\nSo I found these, they smelled bad but not too bad, so curious, I ate some, and wow... it was like ultra-concentrated moldy basement and it would not rinse out.",
   "created_utc": 1694460332,
   "score": 8,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k04xvpv",
   "message": "Duck blood soup. \n\nIt's a thing. Googe it. \n\nAnd it's made exactly like it sounds.",
   "created_utc": 1694453298,
   "score": 8,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k05i0f7",
   "message": "The drink they make you down to prep for colonoscopy.  Tried to put Mio water flavoring to it and made it 10x worse.  I had to gag it down.  If I smell it today, guarantee I’m puking.",
   "created_utc": 1694460459,
   "score": 8,
   "submission_id": "16funu6"
  },
  {
   "comment_id": "k05t3qy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16funu6"
  }
 ]
}