{
 "submission_id": "16g6lfe",
 "title": "How would you describe depression to someone who's never had it?",
 "selftext": "",
 "created_utc": 1694464719,
 "permalink": "/r/AskReddit/comments/16g6lfe/how_would_you_describe_depression_to_someone_whos/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/16g6lfe/how_would_you_describe_depression_to_someone_whos/",
 "comments": [
  {
   "comment_id": "k05xzk0",
   "message": "For me it was fatigue that was so intense I would avoid even going to the bathroom for as long as possible just to stay in bed.\nThe second thing was this dark awareness that there isn’t really anything that I’m longing for that would make a difference. For example, when you have a flu or something and you lay in bed feeling like crap, you know that in a couple days you will feel better. When I was depressed, there was no relief to look forward to. No light at the end of the tunnel. I couldn’t think of a single thing that would make me happy.",
   "created_utc": 1694466030,
   "score": 192,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k063epy",
   "message": "Imagine that you get up one day, and spend that day doing one of your favorite hobbies. You get to hang out with your friends, doing things you love. There's good food and nothing bad happens that day. Heck, let's even imagine the weather is perfect. And at the end of that day, doing all the things you love around the people you like in the best possible way you feel... average. OK. Not-awful. \n\nThat's one big part of depression. It's not that you \"feel sad\" more often, it's that the whole range of your feelings shifts downward. A normal person feels bad sometimes, feels good sometimes, and feels OK or average most of the time. Depression shifts that whole window down, so that your best day is \"OK\", your worst feels awful, and most of the time, you're hurting. \n\nAnd if you're like most people, your brain is this amazing pattern-matching thing with no off-switch. Normally, if you feel angry or tired, you start looking for a cause: \"Oh, I forgot to eat breakfast\" or \"I was really hoping my boss would like my proposal, and he didn't\" and then things make sense. But if you're depressed, you feel awful all the time for no clear reason at all, and over time, that alone is pretty distressing.\n\nI've said it before: feeling fucked-up when you're in a fucked-up situation doesn't mean you're a fuck-up, it means you're a human being. If your dad has dementia and your mom can't walk anymore and you just put down your dog, you *should* feel awful. But when dad's got caregiver and so does mom and you have a decent job and your spouse loves you and you *still* feel awful all the time... that's depression. And your tireless pattern-matching brain eventually says stuff like \"Hey, why don't you blow up your job/marriage/friendships, that way at least the way you're feeling right now will make sense!\" Or, if things go on long enough, your brain will say \"we're hurting all the time. We tried doing things we like, and we still hurt. We tried not doing things, and we still hurt. So clearly, the reason we're hurting is that we're still existing... what if we could change that?\"",
   "created_utc": 1694468005,
   "score": 197,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05uh2o",
   "message": "Like being more bored than you can possibly imagine but also not being able to imagine a single thing you actually want to do no matter how hard you try, including thinking and breathing.",
   "created_utc": 1694464807,
   "score": 246,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05us4p",
   "message": "It’s different for every one but for me it’s being tired all the time. You have moments when maybe you feel ok but as soon as you start something you’re tired. Just so tired.\n\nEdit: for spelling.",
   "created_utc": 1694464913,
   "score": 175,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k0691hs",
   "message": "Life is passing by and you don't enjoy the movie. You see yourself moving, talking, but it is not you. You do not feel but you remember that feelings exist. You can't sleep and you can't be awake. \nWindows and bridges are calling you and you have to put big effort not to follow this call.",
   "created_utc": 1694470133,
   "score": 9,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05v5st",
   "message": "It's not laziness. You feel so numb It's hard to even get out of bed to go to the toilet. You just feel numb all the time and get anger outbursts.",
   "created_utc": 1694465046,
   "score": 106,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05zmxd",
   "message": "The smallest task can feel impossible. The mere thought makes you feel worse.",
   "created_utc": 1694466630,
   "score": 198,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k069n61",
   "message": "Extreme apathy. Dream state. Everything is dull and heavy all at once.",
   "created_utc": 1694470371,
   "score": 166,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05zl87",
   "message": "1. Everything feels overwhelming. At my worst, something as simple as emptying the garbage - 60 seconds at most - felt like such an ordeal that I couldn't bring myself to do it. So I'd let it sit for weeks.\n\n2. On a scale of 1-10, most people wake up at a 5. Good things bring them up, bad things bring them down, but they're comfortably in that middle zone. When my depression was unchecked, my default state was 2. So even if something absolutely amazing happened, it still only brought me up to a 3 or 4, and only temporarily. Once the high wore off, I was back in the gutter. \n\n3. You lose interest in your hobbies. You lose the motivation needed to find new hobbies. You find yourself with a free evening, and you could spend the entire thing just spinning around in your office chair, staring at the ceiling, because you don't feel like doing anything.",
   "created_utc": 1694466613,
   "score": 101,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k067mgo",
   "message": "Sarah Silverman said it feels like being desperately homesick even though you’re home. I’d agree but modify it to feeling homesick for a home that doesn’t exist.",
   "created_utc": 1694469587,
   "score": 102,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k061jyj",
   "message": "I'd recommend reading this. \n\nhttp://hyperboleandahalf.blogspot.com/2013/05/depression-part-two.html",
   "created_utc": 1694467329,
   "score": 98,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k067g01",
   "message": "Everything matters too much and nothing matters.",
   "created_utc": 1694469519,
   "score": 75,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05vij1",
   "message": " It's like seeing life through a black and white filter while constantly feeling exhausted with everything around you. It's the utter and complete lack of hope that eventually turns to apathy. Your body hurts, and you know there is nothing physically wrong with you. You are so, so tired but sleep doesn't happen at all, or when it does it feels like you can't wake up, and at that point you don't even really want to. There is this nagging emptiness inside of you, kind of like hunger, but nothing can fill it up and eventually, you go numb.  If you do get sick, you don't bother going to a doctor because you hope whatever you have finally just gets worse and kills you in a way that you will feel guilt free over. \n\nThat's what it felt like for me, at least.",
   "created_utc": 1694465169,
   "score": 117,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k0648xw",
   "message": "It almost feels like a physical thing that's weighing down on you. Like being covered in a wet blanket of sadness, but there's no way to take it off. It's so heavy that you know you can't do anything about it, so you just let it suffocate you. And it makes everything you enjoy less impactful. Colors seem dim, food tastes bland, the song that meant the world to you now seems meaningless... Every positive thing is diminished.",
   "created_utc": 1694468322,
   "score": 51,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k0630cn",
   "message": "Having a constant liar in your head that’s telling you you’re shit, you’re a burden, you’re stressing people out, people are disappointed in you. Etc etc etc. At least that’s it for me. Sometimes less prevalent than other times. Therapy has helped me a lot with managing symptoms but when I go into a depressive wave, that liar is SHOUTING.\n\nCilantro tastes like soap to me; I wonder what it actually tastes like. That’s akin to how I wonder how people without depression feel. I’d never know",
   "created_utc": 1694467858,
   "score": 151,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k066kbk",
   "message": "It's a weight. A weight thats with you from the moment you open your eyes, til the moment you close them. This weight also whispers in your ear about everything you've ever done wrong, tells you everyone's hates you, and your worthless. My weights mad too. It's terrible and other than drugs and alcohol nothing helps lift it off you. I have bpd, aspd, and bipolar 2. To all that struggle with depression my hearts with you.",
   "created_utc": 1694469188,
   "score": 41,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05ybwm",
   "message": "You know the arc in Dragon Ball Z where Goku trains in 100x gravity and every little movement is extremely difficult for him?\n\nIt's exactly like that, but you're not Goku. You just lay on the floor for 6 months.",
   "created_utc": 1694466156,
   "score": 34,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k064ovz",
   "message": "It's a nothing-ness. Someone from my old school killed herself and my mom said \"I can't imagine it (life?) being so dark that suicide feels like the only option\". I wanted to tell her that it's not a darkness, it's just nothing and sadness all the time. Just clean apathy. And sometimes fear of getting in the car and having to drive somewhere alone.",
   "created_utc": 1694468488,
   "score": 34,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k0702is",
   "message": " a persistent and heavy cloud that hangs over your mind and heart, even on sunny days",
   "created_utc": 1694481002,
   "score": 30,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06bod6",
   "message": "It’s like being in a dark forest and you have a flashlight that doesn’t work. And you can make out the glimmer of light from other people in the distance wandering the forest with their flashlights working perfectly fine. And you try to hit your flashlight to make it work, try changing the batteries to see if that’s the problem, but you just can’t get the flashlight to work. so you’re left with seeing other people around you enjoying their surroundings with their flashlights—the trees, the rivers, the wildlife, while youre just left alone in the dark.",
   "created_utc": 1694471176,
   "score": 27,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06762r",
   "message": "I want to get up. I want to do the things I need to do. But something is sitting on me. I’m almost frozen. It hurts even to move my eyes. Everything is irritating and overwhelming. \n\nThank goodness for therapy, medicine, exercise, and weed.",
   "created_utc": 1694469416,
   "score": 65,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06e6ba",
   "message": "Living hurts",
   "created_utc": 1694472193,
   "score": 20,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06c4cj",
   "message": "Carrying a heavy suitcase full of sadness around all day, every day. Sleep is the only (non-drug) reprieve. I exercise to keep me strong enough to carry the suitcase… but it’s always there.",
   "created_utc": 1694471356,
   "score": 19,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06dudn",
   "message": "Driving to the grocery store and knowing you need to buy milk and bread and getting a great parking spot but not having the energy to go in. \n\nAnd by energy, it feels like there is a greater gravitational force on your body that is pulling you to the core of the earth. \n\nEvery step feels heavier. Moving your body is harder. \n\nNo one else is suffering from this gravity issue. They are all moving normally. This is painfully obvious. \n\nSo you go home.  Milk and bread can wait for another day.",
   "created_utc": 1694472058,
   "score": 21,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06k7hr",
   "message": "Like having your soul sucked right out of you then told to continue “as normal” despite being a shell.",
   "created_utc": 1694474663,
   "score": 20,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06sctl",
   "message": "Imagine that everyone walks around with a backpack. Everything they do, they do with their backpack on. You have your backpack, and it's filled with rocks. Everyone else is running around, up stairs, and you wonder how they can do it with so much weight. \n\n\nYou ask for advice and people say \"idk just do it!\" Or to exercise, or to get more sun. You try and while it can help, you still can't run as fast or do as much as others. You are too tired to care anymore,  the straps have dug into your shoulders, but when you complain, you are told you're exaggerating, being dramatic, or lazy. You try to push through and end up snapping at your loved ones because you are so exhausted and stressed and in pain. \n\n\nFinally, you go to a doctor. And they show you that you can take the rocks out of the backpack! They tell you that you don't have to carry rocks anymore! You just have to take them out every day. Some days there are more, some days less, sometimes you forget one and end up carrying it around for a bit. But life is infinitely better than when you were carrying around the rocks.",
   "created_utc": 1694478021,
   "score": 18,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05uyz8",
   "message": "Like wearing a suit made of bricks.",
   "created_utc": 1694464980,
   "score": 37,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k063sjb",
   "message": "It's like having a constant hangover",
   "created_utc": 1694468149,
   "score": 13,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06e13d",
   "message": "I would share Emily Dickinson's poem \"I felt a Funeral, in my Brain\" with them.",
   "created_utc": 1694472135,
   "score": 14,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06asl2",
   "message": "Walking through an endless tunnel by yourself, reducing the world to a speck of light in the distance that you can never quite bring into focus or arrive at",
   "created_utc": 1694470827,
   "score": 13,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06i14i",
   "message": "Imagine wrapping yourself in a bunch of room temperature wet woolen blankets, like a whole bunch, so you look like the snowsuit kid in A Christmas Story. Now go about your day. You're tired so fast because you're lugging this all around. It's hard to get food put together because you're lugging this all around. That's okay, you can just have a nap. Well, you're still in these wet heavy blankets so you just kinda doze. Finally fall asleep but that didn't make you feel rested. Now you have to get up. But you're still wrapped in all these wet woolen blankets. Your body is sore. You think about showering. But the idea of dragging all those blankets into there just seems exhausting. Maybe you'll just lay here until you absolutely have to pee. Maybe you'll just drink less so you won't have to pee as much. A friend calls you to go out and while you can remember what good times you had with your friend, you can't imagine having a good time in all these wet woolen blankets. You'd just be tired. You'd just be pretending for your friend. And that sounds exhausting. Maybe have another nap?\n\nAnd just keep wearing those wet, woolen, heavy, cumbersome blankets day after day after day after day. Food is just something you put in your body because your body is yelling at you, usually it doesn't make you happy but every now and again it'll taste good for a few bites. And that little tiny spark makes you feel even worse, because for just a second you remember life before the wet woolen blankets. But they wrap back around you and you lay back down for another nap.",
   "created_utc": 1694473772,
   "score": 14,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k0645v6",
   "message": "Playing the game of life on \"brutally hard\" mode.  It makes *everything* difficult.",
   "created_utc": 1694468290,
   "score": 13,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06ff6a",
   "message": "It’s like living someplace where it snows all the time.\n\nSome days it’s only a couple of inches. It’s a pain in the ass, but you still make it to work, the grocery store. Sure, maybe you skip the gym or your friend’s birthday party, but it IS still snowing and who knows how bad it might get tonight. (…)\n\nSome days it snows a foot. You spend an hour shovelling out your driveway and are late to work. Your back and hands hurt from shovelling. You leave early because it’s really coming down out there. Your boss notices.\n\nSome days it snows four feet. You shovel all morning but your street never gets plowed. You are not making it to work, or anywhere else for that matter. You are so sore and tired you just get back in the bed. By the time you wake up, all your shovelling has filled back in with snow. (…)\n\nSome weeks it’s a full-blown blizzard. When you open your door, it’s to a wall of snow. The power flickers, then goes out. It’s too cold to sit in the living room anymore, so you get back into bed with all your clothes on. (…)\n\nThe thing is, when it snows all the time, you get worn all the way down. You get tired of being cold. You get tired of hurting all the time from shovelling, but if you don’t shovel on the light days, it builds up to something unmanageable on the heavy days. (…)\n\nAlso, the snow builds up in other areas, places you can’t shovel, sometimes places you can’t even see. Maybe it’s on the roof. Maybe it’s on the mountain behind the house. Sometimes, there’s an avalanche that blows the house right off its foundation and takes you with it.\n\nThe neighbors say it’s a shame and they can’t understand it.\n\nHe was doing so well with his shovelling.",
   "created_utc": 1694472702,
   "score": 13,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06aval",
   "message": "Tired of life and being too tired to improve it. Everything becomes a chore and you feel as though there’s no hope and that your life is stagnant and will remain as shitty as it currently is. Isolation is where you feel safe and socialising becomes a chore (or you just avoid it completely). You live in your regrets and failures rather than living with them and learning from them. You let the smallest inconvenience of the day define you even if you cured cancer you’ll be thinking about how you came to work late that day and how much of an inconvenience you are.",
   "created_utc": 1694470856,
   "score": 10,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k062t7n",
   "message": "I thought it felt like living in a wet tent.",
   "created_utc": 1694467786,
   "score": 8,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k064fda",
   "message": "Imagine that everything you eat just tastes like plain oatmeal. Your favorite foods taste like plain oatmeal. You try speaking new and it tastes like plain oatmeal. You even try someone you used to hate, just to see if it's different: oatmeal.",
   "created_utc": 1694468389,
   "score": 10,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k068i8t",
   "message": "It's like seeing a kid get ran over right infront of you and can't even muster a \"meh\" in response.  You're dull to everything. Nothing gets you high, nothing gets you low.",
   "created_utc": 1694469927,
   "score": 10,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k0694dc",
   "message": "Imagine the week after your uncle you liked died. But it lasts months or years. And nothing bad had actually happened. Then you feel better for a few weeks, then back to how it was before.",
   "created_utc": 1694470163,
   "score": 9,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06cihs",
   "message": "It's all the things your phone does when your battery is getting really low only it happens in your brain instead.",
   "created_utc": 1694471517,
   "score": 10,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05wltr",
   "message": "Having my ears and mouth stuffed with cotton. Then a large rubber balloon is forcibly pulled over my head, my feet wrapped in chains and cemented into a cement block of immeasurable weight— and I am tossed into a shallow river where my nose is just an inch too deep underwater to breathe.",
   "created_utc": 1694465545,
   "score": 19,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k068ef6",
   "message": "For me it was a thick fog over my head. I was so bored and didn’t want to get out of bed. I couldn’t stand too much stimulation (my kid asking me 500000 questions in the span of 20 seconds) and then at the same time I needed stimulation so I would be on my phone looking for something to wake my brain up. Yeah, that makes zero sense even to me. \n\nI was so sad and mentally checked out even while doing fun activities with my family. I feel like I was just there watching the world happen around me.",
   "created_utc": 1694469886,
   "score": 20,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06fpl0",
   "message": "Like nothing ever is worth the effort, and that even includes waking up, eating, showering.",
   "created_utc": 1694472819,
   "score": 9,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05vbse",
   "message": "i'm dead inside",
   "created_utc": 1694465104,
   "score": 16,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k069o2u",
   "message": "Nothing matters anymore. You know that you should try to do the things that make you happy, but you don’t have the energy to even start them. You then feel like a failure because you can’t even make yourself get off the couch and grab your Nintendo Switch out of your room. You constantly want to cry and have no idea why. Your thoughts are jumbled, and you can’t control the bizarre ideas that pop into your head. You don’t want to eat anything because you are perpetually nauseous. It’s a truly awful disease that I wouldn’t wish on anyone.",
   "created_utc": 1694470380,
   "score": 9,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k069v07",
   "message": "For me it feels like helplessnes. Knowing I should be doing things, but I just can't get myself in gear. I'll slowly make it to second and third gear. It gets better for awhile and then Bam!! I'm back in neutral and the cycle starts all over again.",
   "created_utc": 1694470457,
   "score": 8,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06b5wo",
   "message": "Can't. Too tired.",
   "created_utc": 1694470972,
   "score": 7,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06cvwt",
   "message": "I’ve been force retired since 2016, but back dated to 2009. I’m 100% disabled. Total and permanent, and housebound. I cannot work, but still have to take care of a 9 month old. \n\nI have PTSD/anxiety/depression, moderate sleep apnea, a fractured neck, bone spurs in several places on my spine, arthrosis, thoracic/lumbar issues, peripheral neuropathy, and a host of other ailments… and the VA is atrocious. \n\nYou would think sleep could be a place of sanctuary, but even in my dreams I’m tormented… every single night. Weed or other drugs do not prevent me from dreaming. \n\nI’m only 37 without a job, career, or motivation. “Family” and “friends” either don’t care or stop caring. \n\nThat’s depressing.",
   "created_utc": 1694471670,
   "score": 9,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06ddbt",
   "message": "You can’t go on living like this, but you can’t tell anyone because you don’t want to waste their time.",
   "created_utc": 1694471863,
   "score": 8,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06k4bn",
   "message": "Before I ever had it I thought it was about being sad, crying, being irrational. Since I’ve experienced real depression/anxiety bouts, it’s really been the desire to do absolutely nothing. Doing a load of laundry, watering plants, taking a shower, etc. feels like a huge accomplishment. \n\nAnd for me, it’s compounded by the fact that I feel like a failure doing nothing but have no drive to put things into action and fix the shame and pressure I’m putting on myself mentally.\n\nHope that helps.",
   "created_utc": 1694474627,
   "score": 7,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06ac27",
   "message": "like you are super homesick..... but you are already home.",
   "created_utc": 1694470646,
   "score": 7,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06gqtq",
   "message": "You're always drowning, and everything you do to cope is just trying to get your head above the water.\n\nYou will panic at random times. That's when you lose energy to keep your head out of the water and dip below.\n\nYou will feel momentary relief when you find something to perch on and it gets easier. However those are temporary.\n\nYou will be always fighting not to drown. It gets tiring. So very tiring.\n\nJust replace the water with negative emotions.",
   "created_utc": 1694473243,
   "score": 8,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06k8m4",
   "message": "Like you’re fundamentally alone and different (in a bad way) from everyone around you. And they’d be way better off without you. Also sometimes a crushing sense of doom for no reason whatsoever",
   "created_utc": 1694474676,
   "score": 7,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k061okn",
   "message": "Atreyu in the swamps of sadness in never ending story",
   "created_utc": 1694467375,
   "score": 6,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06co8h",
   "message": "you have no motivation to do anything but sit and stare and brood/be sad",
   "created_utc": 1694471582,
   "score": 6,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06dlr9",
   "message": "The best analogy I’ve found is that depression feels like a dead tree.  It looks fine on the outside, but on the inside you feel completely dead, hollow and empty.  Depression to me feels like emptiness, hopelessness, the inability to experience any joy, feel any emotion or care about anything.  People often equate depression with sadness, but to me it’s not sadness but the utter impossibility to feel anything.",
   "created_utc": 1694471959,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06ewmo",
   "message": "like trying to swim in the middle of the ocean with a cement block chained to an ankle. it's so much effort just to keep your head above water. more effort gets you no better results. you can't see land and while you know it's there somewhere, you have no idea where to find it. all the while each wave threatens to pull under. you're trying to swim, but it's harder and harder to stay above as you just get more tired. at some point it seems easier to just stop and let yourself go under. after all, there's no land in sight, there's no one who will rescue you, and it's so painful to keep trying... it'd be so easy to just stop swimming.",
   "created_utc": 1694472490,
   "score": 6,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06fltl",
   "message": "Like being trapped in an abusive relationship, yet you are both the victim and the abuser.",
   "created_utc": 1694472777,
   "score": 6,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06glm6",
   "message": "Sadness, guilt, intermittent shots of adrenaline, pit in stomach, constant bleak outlook, things that used to be fulfilling don’t bring joy, constant racing thoughts, fear that the feeling is lifelong, need for comfort that never comes",
   "created_utc": 1694473183,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06jft4",
   "message": "Everything sucks all the time for years and years regardless of circumstance",
   "created_utc": 1694474351,
   "score": 7,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06k782",
   "message": "Depression knows no boundaries. Your thoughts and your brain go to the darkest places and your body shuts down. When it got really bad it started to actually give me physical pain. Then when the mental pain takes over your anxiety is so jacked that your hands shake and your heart beats so fast you start trembling begging for it to just stop. You beg your brain to stop. It gets worse when the person you are with doesn’t understand and hates you for it. So you stop wanting to be around them and you isolate yourself into a walking robot. \n\nLinkin Park - Papercut symbolizes how I felt when I was going through my worst times. It felt like someone else was inside my head creating paranoia and chaos.",
   "created_utc": 1694474660,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06pz3v",
   "message": "You’re tired all the time and still don’t sleep when you go to bed.",
   "created_utc": 1694477044,
   "score": 6,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06s2ib",
   "message": "When you have everything in your life to be happy about and thankful for, but you feel none of that. And you feel guilty for not feeling grateful. But you only feel sad and empty. You keep searching for something that will bring back legitimate happiness or balance but that lingering bad feeling just won’t quit, no matter what you try doing. At least this is what PPD felt like for me.",
   "created_utc": 1694477903,
   "score": 7,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k05z9f9",
   "message": "u dont explain it, i pray he never knows 🙏",
   "created_utc": 1694466493,
   "score": 10,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06b2bi",
   "message": "You can't. It's like trying to explain the ocean to somebody that's lived in the desert their whole life and has never seen a body of water. Or trying to explain addiction to somebody that's never been addicted to something. They just don't get it.",
   "created_utc": 1694470932,
   "score": 11,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06asn4",
   "message": "It's like being Frodo having to carry the ring.  It weighs you down, body and soul.  \n\nNothing that you would normally enjoy has any attraction and even if you try it is impossible to focus.  This is compounded by blaming yourself for everything, wishing that you could just break through this, make steps to fix things, but everything is now a mammoth task, impossible to face.",
   "created_utc": 1694470827,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06bpj6",
   "message": "Like a weird magnet almost that draws out your strength, motivation, clear thoughts.\n\nIt's basically kind of like kryptonite from Superman. I'd probably describe it like kryptonite you can't get away from.",
   "created_utc": 1694471189,
   "score": 4,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06cwaa",
   "message": "Heaviness.\n\nYou draw a blank when someone asks you your favorite anything.\n\nLife feels like it is just draaaaaging.",
   "created_utc": 1694471674,
   "score": 4,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06e7sf",
   "message": "It's doing the same thing over and over because the thought of trying something new sounds and feels vile. It's sitting so far inside the middle of your comfort zone that you can't reach the edges to pull yourself out or try something new. Boredom isn't even boring, the monotony is the only sense of comfort you have.",
   "created_utc": 1694472210,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06e98g",
   "message": "Do you not give a shit? Do you not give a shit about not giving a shit? Are you tired of feeling like you should give a shit but having no shits to give?\n\nThat's depression.",
   "created_utc": 1694472226,
   "score": 6,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06gqqn",
   "message": "I genuinely don’t think you can, you can’t understand it if you’ve never experienced it.",
   "created_utc": 1694473242,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06ho03",
   "message": "I’d try to relate it to an experience that the person has had. It’s like having the flu except without the congestion and fever, but the same level of tiredness and discomfort. It’s also the same feeling as heartbreak or grief, imagine feeling like you just got dumped or your dog died except that feeling doesn’t seem to have a cause and it never goes away.",
   "created_utc": 1694473620,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06k809",
   "message": "Depression is like a soggy wool coat…I want to take it off, it’s uncomfortable and can turn doing anything into a slog…but sometimes I don’t want to because I’m so used to it!!!!",
   "created_utc": 1694474669,
   "score": 6,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06k96j",
   "message": "It totally depends on the depression. Whether it’s major depression disorder or depression brought on by an event. Regardless both are awful. In my experience, as someone diagnosed, it is a pain that is so extensive you’d rather feel physical pain. It is a pain that brings you to your knees, twists your gut, and stomps out any light inside you. And worst of all you can’t get away from it, it follows you through everything, disabling you. For example, I was once stuck on my couch for an entire day, unable to move, I couldn’t bring myself to get up to go to the bathroom, get water, eat, absolutely nothing.",
   "created_utc": 1694474682,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k064l62",
   "message": "Like you’re strapped naked to a table that you can’t get up from in a freezing room as a fire alarm beeps nonstop",
   "created_utc": 1694468450,
   "score": 3,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k069tbx",
   "message": "https://youtu.be/wCd6LPzWscc?si=wvCBeNlftn7GJVy8\n\nThis helped me so much",
   "created_utc": 1694470439,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k069vl6",
   "message": "not wanting to live , hopeless , unhappy for life , sad,",
   "created_utc": 1694470464,
   "score": 4,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06bv49",
   "message": "At its peak. Basically like trying to do anything while being hungover with out being sick or dehydrated. No motivation to do anything. Even if you do it feels lile a heavy coat",
   "created_utc": 1694471252,
   "score": 3,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06c7kl",
   "message": "Constant feeling of dread and hopelessness, like there is no one to help you and you don’t know how to ask for help. Not knowing who to turn to or where to go. Just on verge of crying every single moment. Not wanting to take up. When you wake up you can’t wait for next bedtime.",
   "created_utc": 1694471393,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06d6oi",
   "message": "You are constantly tired and everything feels so…odd. You are literally not alive anymore and you walk around on autopilot all the time. You can never really do anything about it, and even if there is the mere thought of it makes you tired or burnt out. It is addictive. You contemplate everything in life and you realize that there is nothing you can do. The only thing that would solve your problems is offing yourself, and you know deep down that isn’t an option. You cannot enjoy anything, and I mean cannot. You wish you were dead. Depression also brings anxiety and stress and so much more.",
   "created_utc": 1694471789,
   "score": 4,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06fsrs",
   "message": "Like dying of hypothermia. You feel numb. After a while it can be almost comforting how numb you are. And getting better is like going from snow into a hot tub. You’d think it’d heat you up faster and make you feel better, but instead even the most normal sensations can hurt like wild because you’re not used to them anymore.",
   "created_utc": 1694472855,
   "score": 4,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06gf63",
   "message": "When I had the Mirena IUD for several months, and it gave me symptoms of depression. The symptoms set in very gradually. It was like a feeling of being completely numb. Nothing excites your or angers you, including activities that normally make you happy. Showering became a real chore, as in I had to force myself to get in the bathroom and clean myself. I was in my best friend’s wedding party and I really had to fake being happy, despite knowing I was happy for the couple. I missed another friend’s birthday party because I couldn’t bring myself to fake being happy that day. Once I had the IUD removed the symptoms went away after a week or two. It was shocking how much it changed some of my behavior when I had it.",
   "created_utc": 1694473111,
   "score": 5,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06jcls",
   "message": "Just grey. Nothing but grey.",
   "created_utc": 1694474315,
   "score": 3,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06jd74",
   "message": "Mind altering, can’t feel joy even in things you like to do. A feeling of hopelessness, everything seems negative",
   "created_utc": 1694474322,
   "score": 3,
   "submission_id": "16g6lfe"
  },
  {
   "comment_id": "k06le8c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16g6lfe"
  }
 ]
}