{
 "submission_id": "16gfmpq",
 "title": "What’s the scariest conspiracy theory you believe is 100% true?",
 "selftext": "",
 "created_utc": 1694486997,
 "permalink": "/r/AskReddit/comments/16gfmpq/whats_the_scariest_conspiracy_theory_you_believe/",
 "score": 29,
 "url": "https://www.reddit.com/r/AskReddit/comments/16gfmpq/whats_the_scariest_conspiracy_theory_you_believe/",
 "comments": [
  {
   "comment_id": "k09pjft",
   "message": "That arresting the people in Jeffrey Epstein’s little black book would bring this world to a grinding halt because of how many disgusting rich people there are in power.",
   "created_utc": 1694532795,
   "score": 27,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09do6i",
   "message": "[removed]",
   "created_utc": 1694528488,
   "score": 181,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0ahpvr",
   "message": "In the early 1980s, Coca-Cola deliberately removed \"Coke Classic\" (made with cane sugar) from production and introduced \"New Coke\" (a.k.a. \"Coke II\") as a ruse, knowing full well that people would complain that it \"wasn't the same as before,\" so they staged an apology commercial from Coke's CEO saying \"we're sorry; we hear you\" (when has a CEO ever said that??? LOL), and re-introduced \"Coke Classic\" with corn syrup instead of cane sugar, knowing that by the time it was re-released, the market's inventory of the original \"Coke Classic\" had largely been distributed and consumed, so very few people (if any) could actually compare them side-by-side to see if they tasted the same.\n\nBTW, the tariffs on cane sugar were increased ginormously just before they did this, which was a way to encourage domestic corn production.\n\nTL;DR - Coke pulled a switch-a-roo by changing sweeteners and lied saying that it was the exact same as before",
   "created_utc": 1694542613,
   "score": 119,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k097ctn",
   "message": "Insane wackjob conspiracies purposefully get propagated to detract from actual shady shit that goes on. \n\nWhat's more? It fucking works. If you see someone even mention something might be a conspiracy, that person is automatically determined to be a lunatic. Dangerous when you consider just how corrupt government, military, and corporations are.",
   "created_utc": 1694525999,
   "score": 171,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k07xtt1",
   "message": "The mattress mafia.",
   "created_utc": 1694496999,
   "score": 57,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09okvt",
   "message": "A small one:\n\nSamsung announced that the Galaxy Watch 4 would include a non-invasive continuous glucose monitor, which would allow you to monitor your blood sugar at any time while you wear it, for as long as you own it. \n\nA months before the 4 was released, that feature quietly disappeared from all of the marketing, without explanation, and now, years later, is nowhere to be found. \n\nI believe Abbott Laboratories, makers of the FreeStyle Light glucometer and the FreeStyle Libre continuous glucose monitor systems, panicked, fearing that a non-expiring, non-invasive glucose monitor would be hugely popular among diabetics, and devastate their death-grip on the market, paid a huge bribe to Samsung to drop the whole thing.",
   "created_utc": 1694532455,
   "score": 166,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09atsh",
   "message": "Big purse... that pocket book companies have strong armed, bought, or convinced women's clothing companies to make pockets ineffectual so that purses remain relevant.",
   "created_utc": 1694527391,
   "score": 220,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09pqom",
   "message": "Octopi are alien and you can't convince me otherwise. Mofos came from a meteor or something. Their brain development rate compared to all other species is off the charts.",
   "created_utc": 1694532866,
   "score": 82,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k07qkdf",
   "message": "That questions like this get posted online by Feds so they can aggregate popular or new conspiracies /s",
   "created_utc": 1694492609,
   "score": 106,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08r66l",
   "message": "NASA was behind the moon landings.",
   "created_utc": 1694518386,
   "score": 29,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09ios1",
   "message": "Elites create chaos and divide us so they can go on their merry way of exploiting everything.  They are stoking black vs. white, right vs. left, straight vs gay vs trans, etc.. to distract us from them pulling the strings.  We have to stop all this bullshit and get to the real problem, which is all driven by money.  Particularly where money and politics align.",
   "created_utc": 1694530347,
   "score": 120,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08otqj",
   "message": "The elites 100% believe in climate change, and their answer is to consolodate resources and foster infighting.",
   "created_utc": 1694517051,
   "score": 71,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09gwpo",
   "message": "Hot dogs and buns come in different numbers on purpose",
   "created_utc": 1694529699,
   "score": 255,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0acqf1",
   "message": "I believe J. Edgar Hoover was essentially the shadow dictator of the US.  I believe the reason Nixon was so insistent on recording his own office at all times was so Hoover couldn't threaten him the same way he had previous Presidents without going \"on the record.\"",
   "created_utc": 1694540868,
   "score": 68,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09uwna",
   "message": "My phone is always listening and paying attention to the things I say. There have been countless experiences where I have talked about something I have never even thought about before and then within the day I see a post on my instagram feed or an ad on google about it. Nothing on our phones are truly private and all of the information is shared and used in ways we may have simply unintentionally consented to.\n\nEdit: to those saying it isn’t a conspiracy theory, understand it is not common knowledge and most people (where I’m from at the very least) are completely oblivious about things like this and explain them away with other logic whether it be their own or logic they were deceived to have.",
   "created_utc": 1694534677,
   "score": 0,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09nu80",
   "message": "That the big food producers like Tyson, Nestle, and General Mills are in bed with big healthcare, keeping single payer Healthcare from happening. One profits by selling poison as food, the other profits from treating the poisoning.",
   "created_utc": 1694532193,
   "score": 171,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k093me7",
   "message": "Secret societies doing weird depraved shit because they're unhinged with all their power and wealth.",
   "created_utc": 1694524427,
   "score": 46,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k07gn7b",
   "message": "That corporations constantly undermine our rights, our democracy and our ecosystem just so they can have slightly larger quarterly profit margins.",
   "created_utc": 1694487803,
   "score": 231,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09rond",
   "message": "That the public school system sucks because it was deliberately designed to fail the kids, forcing them to shuffle off to the factories once their dreams are crushed at graduation.",
   "created_utc": 1694533548,
   "score": 251,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09lkft",
   "message": "The food we have been eating in the United States is a huge part of the mental illness going on today.",
   "created_utc": 1694531388,
   "score": 59,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k096pn9",
   "message": "All the genetic ancestry companies are government fronts. The point of which is to gather an enormous database of human genomes.\n\nAnd the rubes paid for it.",
   "created_utc": 1694525734,
   "score": 126,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09856y",
   "message": "Stevie Wonder can see a little",
   "created_utc": 1694526320,
   "score": 43,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k098aeb",
   "message": "Aliens infiltrated Earth long ago and are im hiding as printers to test our agression and patience before invading.",
   "created_utc": 1694526378,
   "score": 42,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k07gv0z",
   "message": "Epstein didn't kill himself.\n\nKnowing that he and Gislane Maxwell were both convicted of sex trafficking ask yourself this.  Who were they sex trafficking people to?  Who were the clients?",
   "created_utc": 1694487906,
   "score": 104,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08o3d3",
   "message": "The government lied about, and has something to do with, the JFK Assassination.",
   "created_utc": 1694516610,
   "score": 215,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08ap6i",
   "message": "Corporate Donations affect government policy. (State Capture is a term that is growing in popularity)",
   "created_utc": 1694506643,
   "score": 141,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0989l3",
   "message": "both RFK, JFK, and MLK ( i’m sure countless others) were victims of the cia. I mean with current evidence it’s basically true they just haven’t come out and directly said it",
   "created_utc": 1694526369,
   "score": 12,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09uudf",
   "message": "Nuclear Power. Climate change can be solved in a way that doesn't impoverish everyone if we use Nukes to make electricity. This solution was sitting there back in the 80's when we first started talking about global warming. It's almost 40 years later and we aren't building nuclear power plants.",
   "created_utc": 1694534654,
   "score": 133,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08q7a6",
   "message": "Bill Barr went to visit Epstein right before he died. This is unusual.",
   "created_utc": 1694517846,
   "score": 49,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0981uh",
   "message": "Hans Niemann did use a vibrator to cheat on chess.",
   "created_utc": 1694526282,
   "score": 191,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08ley4",
   "message": "I saw this on Good Morning America sometime around 2008 or 2009 - an NSA representative was *on national TV* talking about how much data is collected on US citizens, and described the huge server farm in Colorado, then followed up with \"there's no practical way to actually process it or make sense of it,\" sort of putting to rest any worries that *anyone cares what you ate for breakfast*.  Or, if the interview was to be trusted, there's so much data collected that it's even useless for purposes of law enforcement or \"pre crime\" or whatever.\n\nThis is, of course, years before Edward Snowden was charged with telling us the exact same thing.\n\nAll this points to Snowden being set up or made a patsy - if the NSA was, again, already on national TV telling us all this, why then was Snowden charged?",
   "created_utc": 1694514919,
   "score": 72,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08k6v2",
   "message": "The Darth jar jar theory. Scary stuff.",
   "created_utc": 1694514075,
   "score": 125,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0a35s3",
   "message": "That if there is a giant asteroid hurtling towards us the government won't tell us due to the fear that we'll tear each other apart. A few people will be given access to bunkers and the rest of us won't know until it's too late.",
   "created_utc": 1694537572,
   "score": 122,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k07wf6g",
   "message": "We live in a plutocracy",
   "created_utc": 1694496095,
   "score": 7,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0am7b8",
   "message": "\"Throwback Thursday\" #tbt just appeared one day out of the blue, with the distinct goal of being a silly internet craze to post pictures from the past and compare it to modern day photos. I believe it was a project created by 3 letter United States federal government organizations to encourage large portions of the population to post weekly photos of their past and present to enhance their aging and genetic algorithms. It would be hard to get access to everyone's old photos unless they had physical access to everyone's houses and snuck into each house to make copies of said photos. Why do all that when you could make it a fun new trend and let the people voluntarily give you the photos en masse?",
   "created_utc": 1694544176,
   "score": 77,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k07pebz",
   "message": "Micro plastics are making men infertile. Children of men otw",
   "created_utc": 1694491980,
   "score": 187,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09nf4x",
   "message": "That Reagan conspired with the Revolutionary Iranian government to not free US hostages until and unless he was elected in 1980. The Iranian hostage crisis was very damaging politically for Carter, who was a very likeable and decent man. Americans sitting in Iranian jail cells severely eroded Carter's political position going into the 1980 election, and Reagan knew it.\n\nThe hostages were released on the very day that Reagan took office, 20 Jan. 1981 -- literally, just **minutes** after he was sworn in. To this day, Iran has offered no formal explanation.",
   "created_utc": 1694532044,
   "score": 119,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k099hc1",
   "message": "Scientists have found a way to protect our teeth for plaque/ cavities years ago but because of the lobbying $$$$ they have been stopped from commercializing it.",
   "created_utc": 1694526856,
   "score": 74,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09mtnx",
   "message": "In the 1980s, US Attorney Rudy Giuliani was paid by the Soviets to go after the Italian mafia in New York to make way for Russian organized crime.",
   "created_utc": 1694531837,
   "score": 162,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09d7ie",
   "message": "The timeline split when Harambe was killed and we got the bad one. Things have been exponentially worse since 2016.",
   "created_utc": 1694528313,
   "score": 239,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0a9ix8",
   "message": "US education system knowingly underfunded to maintain a large unskilled labor force. \n\nOriginally this made sense as we needed people to work the worlds largest breadbasket and mine raw materials. Now those jobs are highly mechanized and automated. Combine this with a shift to main US exports being tech/chem based, and our intentionally woeful education system is coming back to bite us.",
   "created_utc": 1694539766,
   "score": 71,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k07yleu",
   "message": "Facebook and google are listening in on conversations to sell you shit. I noticed a drop in advertisement when I removed Facebook from my cellphone and disabled google timeline that was just creepy with how much information is gathered. How much time, I spent at places and tagged any photos I took at that place.",
   "created_utc": 1694497502,
   "score": 117,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09n2ph",
   "message": "I don’t 100% believe it, but Flight 93 was shot out of the sky. It’s the only real 9/11 conspiracy theory I think could be plausible (though still not likely). They knew the other plane was now on a suicide mission to hit a target so they shoot it down and tell everyone it was a passenger uprising. There was enough sadness that day without having to admit the government needed to kill 40 of their own people.",
   "created_utc": 1694531925,
   "score": 214,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08opho",
   "message": "The official story behind the Las Vegas shooting is filled with too much holes to be the real version of events.",
   "created_utc": 1694516981,
   "score": 89,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09af2u",
   "message": "We are being observed by intelligences not from this planet every day.",
   "created_utc": 1694527229,
   "score": 82,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0a3snf",
   "message": "Remember when we redirected that asteroid last year as a test, called DART. Yeah, I don't think that was a test.\n\nIt doesn't matter though. I'm glad it worked.",
   "created_utc": 1694537790,
   "score": 87,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0a10k5",
   "message": "Keeping people in debt and low wages is what makes society work. If everyone gets paid so much money most people will have enough savings to not work again so there won’t be enough people to work in fast food to take care of the other workers that need morning food to go to work and save time since cooking takes time. There won’t be enough people to clean the trash because there are other better jobs with a good pay. Many industries will not be sustainable.",
   "created_utc": 1694536821,
   "score": 225,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k08v40e",
   "message": "That billionaires have had a secret meeting and determined that the earth is doomed and so they hoard as much wealth as possible to live as lavishly as they can with the remaining resources and time before potential colonization of other planets becomes viable if at all.",
   "created_utc": 1694520458,
   "score": 197,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09yi43",
   "message": "Food quality is intentionally low to increase the \"need\" for medication \u0026amp; supplements.  Adequate heath care is unaffordable to keep the workers in the ACA gap from living long enough to benefit from the social security that they have contributed to for their whole working lives.",
   "created_utc": 1694535941,
   "score": 25,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09vjju",
   "message": "That JFK was accidentally killed by “friendly fire” when his secret service agents reacted to the not-fatal shot from Lee Harvey Oswald.",
   "created_utc": 1694534900,
   "score": 69,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09eks9",
   "message": "There is no gold in Fort Knox.",
   "created_utc": 1694528829,
   "score": 46,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k080v70",
   "message": "Hitler's body was burned to ashes and his ashes were spread somewhere inconspicuous.",
   "created_utc": 1694499045,
   "score": 62,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0aazdw",
   "message": "That there are no real criminal or conspiratorial masterminds and that everyone is just incompetent to a certain degree, but the illusion of power let’s things go unchecked and unquestioned to the point that you can’t fathom our existence resting on large swaths of incompetent chunks that you actually HOPE there is someone really really smart at the helm.",
   "created_utc": 1694540263,
   "score": 22,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09bqz0",
   "message": "Oligarchs and corporations run America  \n\n\nUnited States of Corporate America",
   "created_utc": 1694527752,
   "score": 135,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09qg0d",
   "message": "[The Dark Forest Hypothesis](https://en.m.wikipedia.org/wiki/Dark_forest_hypothesis)",
   "created_utc": 1694533115,
   "score": 41,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k09tvct",
   "message": "The CIA killed JFK",
   "created_utc": 1694534309,
   "score": 38,
   "submission_id": "16gfmpq"
  },
  {
   "comment_id": "k0bt7al",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16gfmpq"
  }
 ]
}