{
 "submission_id": "16goqup",
 "title": "What historical fact does no one like to talk about?",
 "selftext": "",
 "created_utc": 1694517867,
 "permalink": "/r/AskReddit/comments/16goqup/what_historical_fact_does_no_one_like_to_talk/",
 "score": 224,
 "url": "https://www.reddit.com/r/AskReddit/comments/16goqup/what_historical_fact_does_no_one_like_to_talk/",
 "comments": [
  {
   "comment_id": "k09th5b",
   "message": "[removed]",
   "created_utc": 1694534171,
   "score": 15,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09tir8",
   "message": "During the battle of Waterloo, one of the most treasured pieces of \"loot\" was the teeth of the deceased soldiers. ~200 years ago, it was rather common to use the teeth of dead people in the creation of dentures",
   "created_utc": 1694534187,
   "score": 99,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0aa6bs",
   "message": "One of the darker reasons the Western Slave trade gets talked about more than the Arab Slave Trade is due to the fact male African slaves were regularly **castrated**.\n\nThey didn't breed slaves like the West did, as it was seen as a sign of opulence that you could just buy a new one.\n\nNo descendants = No one around to speak of the atrocities. Horrifying.\n\nEdit: also just to add more horror on to it, it started **700 years before** the Atlantic Slave Trade and the practice still survived up until **1960**.\n\n**Now imagine how many victims and generations got wiped out over that length of time.**",
   "created_utc": 1694539989,
   "score": 79,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09tk0v",
   "message": "Native American tribes like the Cherokee, Chickasaw, Choctaw, Creek, and Seminole Nations owned black slaves and were some of the last slave owners in North America. As they were sovereign nations, the emancipation proclamation didn't affect them, and new treaties needed to be made to stop the enslavement.",
   "created_utc": 1694534199,
   "score": 213,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k08xmfu",
   "message": "Modern postural yoga-- the type and style  predominantly practiced in Western countries-- is about 100 years old.  It was invented in India by Indians and is derived mostly from British calisthenics and Swedish gymnastics.  It was *specifically marketed to affluent westerners by Indians* as a superior form of spiritual and physical exercise.  It's working as designed for its target market.\n\nHere's a [short article](https://www.yogajournal.com/yoga-101/philosophy/yoga-s-greater-truth/) on it.\n\nHere's a [much longer book](https://www.amazon.com/Yoga-Body-Origins-Posture-Practice/dp/0195395344/ref=sr_1_1?crid=EHYVG0NIBYXH\u0026amp;keywords=yoga+body+singleton\u0026amp;qid=1686144958\u0026amp;sprefix=yoga+body+singleton%2Caps%2C118\u0026amp;sr=8-1), fully accredited and sourced and vetted by Indian scholars and historians.",
   "created_utc": 1694521687,
   "score": 27,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09clrz",
   "message": "That historians are just as catty and petty as any other profession.. I'd have to dig to find it, but one of my Masters college classes was about the historian perspective over the eras and how they write history or whatever: and the text book  really made historical fact become visible as this \" thing \" that people really have argued about for all time... fact is broken down to perspective... and personal philosophy plays more a part in history writing than you'd like to think.",
   "created_utc": 1694528083,
   "score": 83,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k098kcs",
   "message": "Augustus lost *two whole legions* at Teutoberg \n\nThat’s about 20,000 troops, and that’s terrible",
   "created_utc": 1694526492,
   "score": 242,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0906or",
   "message": "The Armenian genocide by the Ottoman Empire.",
   "created_utc": 1694522902,
   "score": 102,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09qxwi",
   "message": "That US spy agencies hired Nazis to work as spies during the Cold War. \n\nI learned about this reading a biography of Virginia Hall. It meant that she, as an employee of the CIA, was now working side-by-side with the same men who had tried to disrupt her operations and kill her during WWII. Ms Hall certainly wasn’t the only one put into this extremely dubious and awkward position.",
   "created_utc": 1694533287,
   "score": 48,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09907t",
   "message": "Napoleon didn’t invade Russia in winter. He invaded in June",
   "created_utc": 1694526670,
   "score": 120,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0aixyq",
   "message": "Churchill and India are often not seen together in the best of lights and thats putting it lightly.\n\nBut when the Jallianwala Bagh Massacre happened, Churchill was the one of the only politicians who stood in defense of the victims.\n\nGeneral Reginald Dyer had ordered his men to fire on an unarmed protest which killed 400 Indians and injured 1000 more. There was a debate in The House of Commons as to what to do with Dyer, as British army personnel were often afforded protections from actions like this and he very nearly got off with it.\n\nUntil Churchill, who was Minster of War at the time, stood to give a speech that condemned Dyer. Stating he should have his employment and benefits of it stripped from him and he heavily implied if it was within his power to do so, his punishment would be more severe. \n\nBasically implying he would have been happy to see Dyer hanged.\n\nThe Conservative Party was outraged at Churchill for breaking ranks and many of their number said he was a traitor and implied Churchill should be charged with treason. A penalty which carried the sentence of death.\n\nChurchill's speech did work however and while Dyer unfortunately couldn't be charged more severly due to Army regulations blocking such actions. He was stripped of his employment and benefits that came with it. This was one of the first times an event like this had ended up with a higher up receiving accountability in The British Empire.",
   "created_utc": 1694543038,
   "score": 241,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09e2e9",
   "message": "The French military has a terrible reputation thanks to their performance in WWII. But if you actually pick up a book, France or the people of Francia in general have one of if not THE most prestigious military reputations in mankind's history. Even excluding their Celtic predecessors. French military victories are prolific.",
   "created_utc": 1694528635,
   "score": 194,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k098wlw",
   "message": "I'm a big fan of Franklin Roosevelt and a big World War Two history buff. I think the American accomplishments in logistics and manufacturing were the eighth wonder of the world in the 1940s, and I'm proud of what my country did in the war.  \n\n...and then someone brings up the Japanese-American internment camps and I'm like, \"Oh, yeah...there was also that.\"",
   "created_utc": 1694526630,
   "score": 219,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k095cii",
   "message": "Ultimate unpopular historical fact: there are no land claims. There's only the land you can either militarily defend and/or have your allies defend for you. It doesn't matter what agreements were drawn up or how long people have lived on any lands. It's all about your ability to defend your land. All borders of all countries in history are proof of this.",
   "created_utc": 1694525164,
   "score": 99,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k095oe2",
   "message": "Unit 731. At least I don't like talking about it since it's so vile and evil",
   "created_utc": 1694525301,
   "score": 34,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0a3p5h",
   "message": "For Germany: No, its NOT the Nazis. Everybody Talks about those. But the shit we did in our african colonies.... before Hitler rose to Power...\n\nIt took until 2021 that we accepted our wrongdoing openly and called it ourselves Genocide on the Herero and Nama.",
   "created_utc": 1694537757,
   "score": 113,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09o2rc",
   "message": "The Egypt Empire last nearly 4000(!!!!) Years. Today we speak of \"Old things\" when its a 100 Year old House or Item. In 4000 Years they achiev so much and still we got so far in just 300 Years from 1800 to now. I always wonder what was the difference ...",
   "created_utc": 1694532277,
   "score": 104,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0auhje",
   "message": "Canada had prision camps from German soldiers back in the WWII. They were treated so nicely and with so much trust that many of the POW were given jobs outside of the prision, and they always returned voluntary, even if it took more than one day. Some were even trusted weapons for hunting, in front of the guards.\n\nThe worst punishment they could receive? When the war ended, they were obligated to return home. Imagine having such \"nice life\" for so long and then having to return to a home destroyed.\n\nMany years later, this formers member of the German army decided to return to Canada as tourists or even buying land and starting families and business.",
   "created_utc": 1694547024,
   "score": 30,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0956di",
   "message": "We treated German prisoners of war (nazis) better than we treated interned Japanese Americans",
   "created_utc": 1694525093,
   "score": 141,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k08qkml",
   "message": "Ustashe had torture camp for children operated by the catholic church",
   "created_utc": 1694518054,
   "score": 86,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09xl0e",
   "message": "Switzerland operated a concentration camp for allied POWS during WW2 and treated them massively contradictory to the terms of the Geneva conventions",
   "created_utc": 1694535617,
   "score": 68,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09qvo0",
   "message": "Polish nazi collaborators. They were responsible for many jewish deaths during and after WW2.",
   "created_utc": 1694533265,
   "score": 104,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09r9ix",
   "message": "unit 731.\n\nand the worst part:  america gave them immunity in exchange for their biological weapons data.",
   "created_utc": 1694533402,
   "score": 82,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0afk5a",
   "message": "Egyptians were not interested in their own pre-islamic history until foreigners developed the field of Egyptology.",
   "created_utc": 1694541855,
   "score": 82,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0ayhpp",
   "message": "American support in politically destabilising countries across Latin America.",
   "created_utc": 1694548396,
   "score": 61,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0atdut",
   "message": "Inca empire lasted less than a century, starting in 1434 (around the same time modern printing started), they were conquerors that eliminate other natives for territory, some of this cultures were pretty much erase from history, others did survive and some of their deities and people were adopted by the Incas.\n\nThey also had a \"tax system\", when most of the crops went to the Inca (\"The leader\" that was seem as the son of the Sun, a demigod basically) and his family, the leftovers were for the population (contrary to the Aztecas, when it was the other way around).\n\nWhen Spanish conquerors arrive (less than 200 men), they received the help from this other natives against the Incas, as warriors or translators. \n\nHeck, before independence in 1821, many Peruvians were against it, they were forced to become independent from Spain with the combination of argentines, chileans, venezuelans and more.",
   "created_utc": 1694546645,
   "score": 52,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0983n8",
   "message": "Hitler was very popular in the West prior to WW2. \n\nHe was voted greatest living person at Princeton University in 1939 ahead of Albert Einstein who was teaching there at the time.\n\n\nhttps://www.nytimes.com/1939/11/28/archives/hitler-is-greatest-in-princeton-poll-freshmen-put-einstein-second.html",
   "created_utc": 1694526303,
   "score": 164,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09q99u",
   "message": "One of the last known anti-Jewish pogroms in Poland took place in the summer of 1946.",
   "created_utc": 1694533049,
   "score": 86,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0a57w7",
   "message": "The Armenian Genocide",
   "created_utc": 1694538284,
   "score": 30,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0a5y27",
   "message": "The US kept a bunch of Japanese Americans plus other Asians that they deemed suspicious in concentration like camps where women and children were beaten, starved (not to death tho), or sexually exploited until WW2 was over.",
   "created_utc": 1694538538,
   "score": 33,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0a3g4l",
   "message": "the Dutch once cannibalized their Prime Minister",
   "created_utc": 1694537671,
   "score": 46,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0b2p93",
   "message": "That every country, continent, land, people, race and religion has some absolutely shitty things in their history. Nobody is perfect.\n\n\"Every saint has a past and every sinner has a future.\" - Oscar Wilde.",
   "created_utc": 1694549819,
   "score": 16,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09rznp",
   "message": "I’m American, in my early 60’s, but I hadn’t heard of the [1921 Tulsa race massacre](https://www.nytimes.com/interactive/2021/05/24/us/tulsa-race-massacre.html) until last year. I mean, we bombed black people in our own city! Just horrible. \n\nTo people who want to whitewash American history, I ask you this - how is it that we are to form a more perfect union if we don’t admit, analyze and correct our mistakes?",
   "created_utc": 1694533656,
   "score": 204,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k08w4ml",
   "message": "European Chinese relations in the 19th century.",
   "created_utc": 1694520962,
   "score": 143,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0avw27",
   "message": "More than half of these are about either WWII or slavery. I’d say those are topics that actually capture cultural attention in Western societies, to the point that even people who are historically ignorant know factoids about both.",
   "created_utc": 1694547506,
   "score": 15,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09q8sc",
   "message": "The British made the first large-scale concentration camps (for the second Boer war), and although they didn't deliberately try to kill the occupants they also didn't do much to alleviate the awful conditions - particularly in the camps holding coloured people, where 1 in 6 died.\n\nThe vast majority of inmates were women and children - those with male relatives still fighting were given smaller rations as an incentive for their relatives to surrender.",
   "created_utc": 1694533044,
   "score": 29,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k08xkmo",
   "message": "The Aztecs were utterly horrific people who did stuff like flay people alive and wear their skins as a form of worship in their religion. When Cortez invaded the reason he was so successful was because the local tribes wanted the Aztec gone THAT BADLY!",
   "created_utc": 1694521663,
   "score": 137,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0b0i9g",
   "message": "Austria was WAY more into Nazi stuff than even the Germans were.  And the Nazis didnt even have to ask where the Jews were half the time.  When they rolled into most countries the locals were more than happy to tell them who to take away.  IN some places by the time the SS got there the Jews were already dead and the locals were asking to be paid for their efforts. \n Also, more than a few Americans were mad about which side the US picked in WWII.  The \"America First\" movement was quite vocal that if we were going to go to war we should be going to war WITH Germany, not against it.",
   "created_utc": 1694549080,
   "score": 12,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09hvv8",
   "message": "UK outlawed slavery 60 odd years before the American Civil war.",
   "created_utc": 1694530058,
   "score": 101,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0b1jvk",
   "message": "The British use of concentration camps in Africa.",
   "created_utc": 1694549435,
   "score": 11,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0ab69g",
   "message": "The fact that jewish people were still killed after WW2 because other people had moved into their old spaces",
   "created_utc": 1694540329,
   "score": 35,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0apmdz",
   "message": "The slavery practice of coverture. And the slave trade of the Ottoman Empire that continued into the 20th century.\n\nThat was predominantly done to women and children so........pfft unimportant apparently to the topic of slavery.",
   "created_utc": 1694545357,
   "score": 10,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0by98j",
   "message": "How many coups the US has done to other nations.. even democratic ones",
   "created_utc": 1694561381,
   "score": 11,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0ak501",
   "message": "While known about here in Ireland, a lot of British people don't seem to be aware of the atrocities that were Carrie out under Oliver Cromwell. Church burning, kids and women being locked up in a burning church and just genocide of Irish people. It's insane that some British people will put him up on a pedestal, regardless of the amount of evilness he had.",
   "created_utc": 1694543460,
   "score": 48,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k09yfqv",
   "message": "When the allies liberated Nazi concentration camps, the homosexuals that were 'liberated' were sent right back to the same camps as it was logistically easier than transporting them to an allied prison. This was because homosexuality was still illegal.",
   "created_utc": 1694535919,
   "score": 35,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0adycy",
   "message": "The Spanish did far more to *intentionally* destroy natives in the new world than the u.s. and an equal or potentially higher number of black slaves were sent to the east but because the u.s. capitalized on both of those things and became so powerful, they get a disproportionate amount of the blame for these two particularly nasty events. As few as 1 in 25 slaves taken from Africa went to the u.s. Incoming down votes because I dared say the u.s. isn't the sole dealer of death and terrible shit.",
   "created_utc": 1694541290,
   "score": 33,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k08ro06",
   "message": "The allies also committed genocide (bengal) and had concentration camps (Kenya)",
   "created_utc": 1694518656,
   "score": 107,
   "submission_id": "16goqup"
  },
  {
   "comment_id": "k0bi95n",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16goqup"
  }
 ]
}