{
 "submission_id": "16hrdcm",
 "title": "People with addictive tendencies, what do you avoid because you suspect it would consume/destroy your life?",
 "selftext": "",
 "created_utc": 1694621985,
 "permalink": "/r/AskReddit/comments/16hrdcm/people_with_addictive_tendencies_what_do_you/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/16hrdcm/people_with_addictive_tendencies_what_do_you/",
 "comments": [
  {
   "comment_id": "k0f9sic",
   "message": "Gambling. It's not a fun answer but it's a real one. It would fucking own me.",
   "created_utc": 1694622182,
   "score": 129,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fcpmp",
   "message": "I'll never try drugs harder than pot and alcohol.  I know I'll like them, and like them too much, and then have to struggle with using or not using every day.  I do this already with nicotine and at least that's legal.",
   "created_utc": 1694623211,
   "score": 211,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0flbp5",
   "message": "As someone who did a lot of coke in college... The Sims. That game is the worst addiction I've ever had. I can't even start playing it.",
   "created_utc": 1694626359,
   "score": 104,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fkdcy",
   "message": "Everything. I stay away from everything. I was in active addiction for 24 years. I've gotten clean from my DOC numerous times but still did other drugs. That always led me right back to hell so I don't touch anything. I've been clean now for over 8 years",
   "created_utc": 1694626000,
   "score": 159,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fh5ld",
   "message": "Opiates. I went down that road once and came pretty close to ending up a bonafide dope fiend — thank god I didn’t. A few mid level pharm grade opiates and a bad breakup will shoot me straight down toward heroin.",
   "created_utc": 1694624785,
   "score": 180,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fdwtk",
   "message": "I drink all kinds of alcohol except whiskey. Not because I don't like it, but because I *really* like it.",
   "created_utc": 1694623632,
   "score": 41,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fb73f",
   "message": "Reddit. I'm off the wagon now but I was so good for so damn long!",
   "created_utc": 1694622677,
   "score": 79,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g9wdc",
   "message": "I quit booze, weed, cigs, vape, and pills on June 1, 2020.",
   "created_utc": 1694635021,
   "score": 137,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0faohv",
   "message": "Cocaine. I know myself well enough to know that massive amounts of unearned confidence would be a very bad thing.",
   "created_utc": 1694622495,
   "score": 168,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ffc5y",
   "message": "Alcohol. Too much of that addiction from both sides of family .",
   "created_utc": 1694624131,
   "score": 107,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fjukn",
   "message": "There is a chocolate bar in the UK called a 'Breakaway'. They really aren't anything special. Just a chocolate coated biscuit bar.\n\nI cannot be allowed to have them in the house.",
   "created_utc": 1694625803,
   "score": 51,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0foh4g",
   "message": "Alcohol.  If I have 1 drink, I'll have 100.",
   "created_utc": 1694627529,
   "score": 90,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fd47h",
   "message": "MMOs, gambling, pretty much all drugs. And I drink alcohol carefully. I never keep it in my house if I live alone and I don't drink on my own.",
   "created_utc": 1694623354,
   "score": 81,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0f9fgd",
   "message": "Nutella. I've said it before, 100 calories/tbsp. And I'll go through that jar in 2-3 days.\n\nI avoid it like I avoid gambling and my ex. Because if I didn't it would **LITERALLY** destroy me.",
   "created_utc": 1694622055,
   "score": 44,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g8kgf",
   "message": "Alcohol. 350 days today",
   "created_utc": 1694634564,
   "score": 251,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0f9k1o",
   "message": "My ex. She’s evil and addictive and I’m a sucker for her.",
   "created_utc": 1694622101,
   "score": 245,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0flndj",
   "message": "A weird one for me is t.v shows. If I started game of thrones or something similar you wouldn’t see me for a week",
   "created_utc": 1694626482,
   "score": 131,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fid4r",
   "message": "In reality it's a constant cycle of avoiding one thing over another.",
   "created_utc": 1694625239,
   "score": 171,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fdyuh",
   "message": "Gaming. I know it would consume me if I started with that, I wouldn't sleep, I wouldn't eat",
   "created_utc": 1694623652,
   "score": 103,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fes4b",
   "message": "Gambling. I never had a problem with gambling, but I suspect I could. I hate all the ads, especially the celebrity endorsements. \n\nMy view is that gambling should be legal, but not advertised. Sort of like how cigarettes are.",
   "created_utc": 1694623937,
   "score": 53,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fclte",
   "message": "hard drugs, porn, and computer gaming.",
   "created_utc": 1694623173,
   "score": 171,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fsvgz",
   "message": "Alcohol. Both my parents were alcoholics. In my teens I drank a lot. I don't anymore. I don't judge anyone for it or lecture anyone, it's just not right for me.",
   "created_utc": 1694629097,
   "score": 40,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ftn1z",
   "message": "Benzodiazepines",
   "created_utc": 1694629367,
   "score": 42,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fl973",
   "message": "Nicotine.",
   "created_utc": 1694626332,
   "score": 35,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fp85y",
   "message": "The food delivery apps ☠️ my CC statement is mostly this and im now in debt.",
   "created_utc": 1694627795,
   "score": 68,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fs1fe",
   "message": "I have an opioid addiction that I currently have under control and recently NyQuil just about kicked me right back in. Now my spouse controls any cold medicine that comes through our door.",
   "created_utc": 1694628800,
   "score": 71,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fp8gg",
   "message": "Food.  God, I love to eat. I could eat and eat and eat and eat and eat",
   "created_utc": 1694627798,
   "score": 56,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g31f3",
   "message": "I tried cocaine once and knew I could never do it again. It was better than anything I’d ever felt and I knew that ever going near it again would probably ruin my life. Like I just had a feeling it couldn’t be a two or three time thing. Like it was either a one time thing or a lifelong battle. 12 years later I’m really glad I made that choice.",
   "created_utc": 1694632654,
   "score": 52,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fcj42",
   "message": "Meth.",
   "created_utc": 1694623147,
   "score": 28,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ffalj",
   "message": "Hard drugs, tattoos, TikTok, mmorpgs",
   "created_utc": 1694624116,
   "score": 26,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fn5gl",
   "message": "Marijuana, in any shape or form. \n\nA lot of people say they find it helpful, for anxiety, enjoyment, or even work. However there’s a whole other sect of people who do very poorly with marijuana. This part of the population, which I’m included in, are prone to escapist tendencies amongst other things. Marijuana is dangerous enough to mess you up in the long term, but slow enough for you to not have the urge to fix yourself.",
   "created_utc": 1694627049,
   "score": 76,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fjbw8",
   "message": "Soda. Destroy might be a bit much, but I would definitely be a lot less healthy if I hadn’t severely cut back on it a long time ago. I was having about a liter a day for a while in my mid twenties. Now I very rarely have it. Like maybe a cup or two per month.",
   "created_utc": 1694625607,
   "score": 23,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fsojf",
   "message": "Too many horror stories of people getting addicted to World of Warcraft makes me afraid I'm going to get sucked in if I start playing.",
   "created_utc": 1694629029,
   "score": 22,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ftw60",
   "message": "Well, I would say drugs in the stimulant family. Things like amphetamine, methamphetamine, and cocaine. I already have slightly high blood pressure, and they would only make that worse. Also, I could see myself becoming dependent on them in order to maintain any level of productivity, which could definitely be dangerous. I had my wild days in my late teens/early twenties, and saw just how useful they can be. Becoming reliant on them would ultimately be counterproductive I think.\n\nHowever, drugs like LSD, mushrooms, and MDMA are much more difficult for me to do frequently, due to the rapid tolerance I develop when I do them, even after one dose. Also, they’re too intense an experience to function while on them, at times to the point of discomfort, so I have never had difficulty using them very sparingly. Like, once or twice a year at the absolute maximum.",
   "created_utc": 1694629457,
   "score": 20,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0glt98",
   "message": "Sugar, porn, gambling, stock market, crypto, collecting.  Try and focus addictions on reading, exercising, eating right, working on things iny life that brings a net benefit, slow crawl rather than quick payouts.",
   "created_utc": 1694639177,
   "score": 17,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0gqdr8",
   "message": "The 24/7 world news cycle. \n\nI used to stream news every waking hour, it filled me with stress yet gave me dopamine hits to keep following.",
   "created_utc": 1694640835,
   "score": 16,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fqygi",
   "message": "Honey roasted almonds",
   "created_utc": 1694628416,
   "score": 37,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ft5gt",
   "message": "Nicotine",
   "created_utc": 1694629194,
   "score": 17,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0gmp2a",
   "message": "Used to smoke cigarettes, tried quitting so many times, and one day I was just done. Smoked a single cigarette the next day with a friend, gave him the rest of my pack. Did nicotine gum for a week and quit that. 11 years later and I still get the urge (very small after all these years) when I get really stressed. Because of this I avoid alcohol. \n\nWeirdly enough sugar has been so much harder to quit than cigarettes. Sounds bizarre but that's the case for me at least!",
   "created_utc": 1694639496,
   "score": 15,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fqp3f",
   "message": "Stopped self harm a while ago but if i start again i know itll get worse than it’s ever been",
   "created_utc": 1694628322,
   "score": 45,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g0hg3",
   "message": "Heroin/morphine. My brother, when he was addicted, described the latter like “god wrapping you up in a warm blanket.” Almost made me cry. I knew instantly I’d OD if I ever dabbled. Too much unprocessed trauma and abandonment issues, I would gladly lose myself to that ‘godly love’ and never look back.",
   "created_utc": 1694631765,
   "score": 29,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fmfum",
   "message": "Tiktok",
   "created_utc": 1694626781,
   "score": 14,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fc4y7",
   "message": "RPG video games.",
   "created_utc": 1694623009,
   "score": 14,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fd7rb",
   "message": "Cigarettes. I know how it would turn out.",
   "created_utc": 1694623388,
   "score": 12,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g90mm",
   "message": "Alcohol 150%\n\nI used to be an alcoholic many years ago. I've been sober from alcohol for 10 years just about. I know for a fact that, even though I've changed and matured as a person, if I had even 1 drink I risk relapsing right back into an addiction that almost ruined my life.",
   "created_utc": 1694634717,
   "score": 11,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fm4vh",
   "message": "Cocaine and opiates. I know for a fact I would love it, and for this reason I’m out.",
   "created_utc": 1694626665,
   "score": 10,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0gti98",
   "message": "Didn’t expect it, but I would not recommend Reddit or any other social media to anyone.  Despite trying to quit and blaming it for making my life worse, I’m still here.",
   "created_utc": 1694641985,
   "score": 10,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ggpnq",
   "message": "Porn. Not because I suspect it would destroy my life, but because it was destroying my life for a while. It completely changed the way I looked at people and I never want to go back to that.",
   "created_utc": 1694637381,
   "score": 20,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fi7tc",
   "message": "Alcohol is really messing me up",
   "created_utc": 1694625184,
   "score": 9,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ftkru",
   "message": "Everything. Alcohol, Pot (even though i have dabbled with it before), Opiates, Narcotics (Ironic since I'm on some now for a surgery I'm recovering from), Gambling.. The whole shabang.",
   "created_utc": 1694629345,
   "score": 9,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fojz4",
   "message": "Valium.\nTried it once and had the best sleep of my life.\nI don’t dare do it again.",
   "created_utc": 1694627557,
   "score": 9,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0ftv7n",
   "message": "Going to vegas. I self-banned myself almost 20 years ago. Never been back.",
   "created_utc": 1694629447,
   "score": 6,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fzo3o",
   "message": "Hard drugs including alcohol.",
   "created_utc": 1694631479,
   "score": 7,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g1ivf",
   "message": "Serious pain pills. Or any downer medication really. Including pills like Xanax or vicodin. I have a feeling I’d become very comfortable taking them very fast. So I don’t.",
   "created_utc": 1694632126,
   "score": 7,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fcbfw",
   "message": "Coke.",
   "created_utc": 1694623073,
   "score": 6,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0fusz7",
   "message": "I have a couple addicted family members to alcohol mainly. Soo I know I have a genetic pré disposision to addiction. Soo I just avoid \"unhealthy\" addiction prone substances like alcohol, drugs, cigarettes, gambling, stuff like that. Obviously I still have the occasional drink, but limit myself as much as possible, Also because I know I like to be drunk, which is a strong indicator for future substance abuse.",
   "created_utc": 1694629779,
   "score": 7,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g98hg",
   "message": "Also dieting, I limited myself to half a ton of watered down soup a day and was euphoric for a lot of the time until I absolutely crashed and would cry with hunger",
   "created_utc": 1694634792,
   "score": 6,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0g9igr",
   "message": "I won't touch drugs beyond marijuana.  My brother died of an OD after years of addiction.  I opted to learn from his mistakes rather than make my own.",
   "created_utc": 1694634887,
   "score": 6,
   "submission_id": "16hrdcm"
  },
  {
   "comment_id": "k0h0tdy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16hrdcm"
  }
 ]
}