{
 "submission_id": "16hyw7s",
 "title": "Redditors who have dated celebrities, how’d it go?",
 "selftext": "",
 "created_utc": 1694639305,
 "permalink": "/r/AskReddit/comments/16hyw7s/redditors_who_have_dated_celebrities_howd_it_go/",
 "score": 48,
 "url": "https://www.reddit.com/r/AskReddit/comments/16hyw7s/redditors_who_have_dated_celebrities_howd_it_go/",
 "comments": [
  {
   "comment_id": "k0i46rq",
   "message": "I dated an actor who played the lead in an oscar nominated movie. He was charming at first but turned out to be the most self-centered and insecure person I've known. He needed constant attention and praise. He would call me at least five times a day to talk about himself. He constantly wanted me to confirm his dick was huge (it wasn't), complained about not having a prettier face, tore himself down as an actor but got angry if I didn't contradict him etc etc\n\nUtterly draining, like an energy vampire or something. I called it quits after one month.",
   "created_utc": 1694661702,
   "score": 21,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hm0fj",
   "message": "D lister and most insecure and narcissistic person I know. I really did care about him but I couldn't handle the lack of accountability and them always having to be right or the center of attention. Too much. I will stick to my non-celebs.",
   "created_utc": 1694653563,
   "score": 231,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i97xo",
   "message": "RJ Mitte (Walt Jr. from Breaking Bad) hit on my daughter at a poker tournament and bought her a drink, she had to gently tell him she was waiting for her hubby who was in the tournament. She said he was super nice and laid back. LOL.",
   "created_utc": 1694664314,
   "score": 191,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hm6pt",
   "message": "It was surreal with verrrry little private time for him to be himself. I knew him from high school before fame so he liked being himself around me. Ultimately, he became very controlling (no one tells them no) and upset so would drop my life for his. \n\nThe social and financial power imbalance is always present.",
   "created_utc": 1694653635,
   "score": 64,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hr9g2",
   "message": "She was famous in another country.\n\nWe met when she was visiting friends in my country. I met her at a group outing and didn't know who she was. I asked her out and she said yes because she thought I was funny.\n\nI didn't clue in that she was famous until our third date and only because, on a few occasions, expats from her country recognized her out in public. She was really hesitant to explain but when she finally did, I was just like, \"Oh, that's cool.\" I didn't make a big deal out of it, which in retrospect I think preserved our relationship.\n\nI've never showed her off as a my celebrity girlfriend because, well, I'm not a fan, haha. I think if I did, that would've been a dealbreaker.\n\nShe has a weird relationship with fame. She didn't enjoy being famous at all. To her, fame was the price she had to pay to do the thing that she loved and was really good at.\n\nWhen we were together in my country, we could be more normal, occasionally being approached by fans notwithstanding. The couple times I visited her in her country, we spent most of our time in the hotel or in places where her privacy could be guaranteed. \n\nEventually, she just quietly withdrew from the public eye and moved to my country. We've been married 7 years now and I'm constantly on the lookout for signs that mommy's talents got passed on to either or both of our kids, haha.\n\n\u0026amp;#x200B;\n\nEdit: She gave me permission to share some more info.\n\nHonestly, I kinda expected us to fall apart so this was a happy surprise to me too haha. None of my friends or family thought it would last because she's Chinese and I'm not. (I'm from Canada.) My Mandarin was functional at the time and so was her English so we communicated through a Chinglish hybrid and Google Translate. My Mandarin has improved a lot because of her and her English has improved because of our kids.\r  \n\r  \nShe was an actress on Jiangsu TV. Her big break (and the thing that fans approach her for most often even today) was having one of the starring roles on an extremely popular TV drama back in the early 2010's. One of the things she hated about fame was how people who met her in public would talk to her as if she was actually that character. After that show, she continued working with relative success but nothing ever as big as that one show. I imagine it's like the guy who played Joffrey on Game of Thrones today if he only kept acting.\r  \n\r  \nA lot of people in the comments talked about celebrities being self-centered and catered to, and to be honest, she was the same way to an extent. I asked her once why she would choose me over her career and she said that she knew she had a quick temper but when she would get angry or frustrated, I would try to cheer her up (which apparently no one did; they would all just duck and hide, even her parents) but not give in to her (which apparently ALSO no one did), which her best friend told her she needed in life.\r  \n\r  \nShe hadn't intended to leave China or the entertainment industry forever. Her original plan was to get married, get Canadian resident status, take a break for a year or two, and then go back to work.\r  \n\r  \nBut during those couple of years, I guess she got used to the peace and quiet and just never went back. Once we had our first child, she put everything into being a mom.\r  \n\r  \nAs time has gone by, people make less and less of a fuss about her former career. Sometimes, she'll meet someone new and they might be like, \"Holy shit, you're so-and-so from whatever!\" but that's about it. After 7 years away and 2 kids, she looks different from how she used to. She's still beautiful though! At least I think so. :)\r  \n\r  \nAnd she still has acting and singing in her. Storytime at our house is fuckin epic, lemme tell ya, haha.",
   "created_utc": 1694655779,
   "score": 243,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0ht1y6",
   "message": "i dated a hollywood actor, he took me to a hollywood party, where ALL the other celebrities were...he left with a hollywood actress...i met enough celebrities that night not to care(although i do like to say THEY all got to meet me)did get invited to more hollywood parties and was blown away that it was all the same people at every single party.",
   "created_utc": 1694656549,
   "score": 145,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i79bx",
   "message": "My mom dated the guy who invented Crazy Bones.  I had all of the original ones. We used to go to schools and do demonstrations. Back then he struggled but eventually after my mom broke up with him his company blew up an was bigger than pogs.",
   "created_utc": 1694663265,
   "score": 35,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i8mgu",
   "message": "He was a D lister; very charismatic, handsome but he wasn’t getting much work so he was bitter \u0026amp; he knew how much I was into him. So much so I gave him money to help with bills etc. I was fucking stupid. He used me \u0026amp; now he’s back in the circuit with a new young woman doing all the things he promised to do with me. So I guess I’m bitter now but the experience helped me learn to be tougher. He may be doing well but he’s always going to be a nasty person on the inside \u0026amp; karma will get him.",
   "created_utc": 1694663990,
   "score": 252,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0iind4",
   "message": "I dated (and am still close friends with) a retired model. In his early career, he was a model for A\u0026amp;F, was on the bags, huge posters in the stores, the whole early 2000s shebang. He’s real nice to look at, especially now in his 30s. \n\nHe’s such a lamb, the sweetest man on the planet, thinks the best of others, genuinely kind hearted … and he is completely ignorant to being fawned over. He just thinks all people are really nice! He gets hit on left and right and doesn’t even clock it. My theory is that he’s one of those rare people who has been attractive since birth, so he doesn’t even realize he’s playing on god mode instead of hard mode like the rest of us. \n\nWe didn’t make it as partners long term because massaging his ego is a full time job. He’s cripplingly insecure, needs a constant cheerleader to amp him up and compliment his appearance/workout/etc. As his bestie (and occasional FWB when we are in the same city), I can bust his balls and tell him about himself in a way he would never be able to handle from a romantic partner. Far superior, I’d say.",
   "created_utc": 1694669957,
   "score": 16,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0imi66",
   "message": "I was working as a waiter in a fancy restaurant in a Napa winery, paying my way through college. She and her extended family of 10 came in for dinner and drinks, with her extremely wealthy grandfather at the head of the table for his 70th birthday dinner. I’d served him before and knew to have his favorite ashtray for his cigar waiting at his seat. \n\nAt the end of the night, he tipped me extremely well and complimented my intelligence and work ethic profusely. After I told him it was always a pleasure and wished him and his family an excellent night, he turned to his granddaughter and said something like, “Those boys you’ve been casting aside have nothing on a young man like this. In fact, you should take him to the ball next week, since you haven’t chosen a date. He already knows how to dress and more about wine than that Humphrey who’s been making eyes at you.” Old man was very used to getting what he wanted. “OK, Grandpa,” she smiled and then looked at me with apologetic eyes. Her father gave me his card, thanked me for, “being a sport about all this,” and then the young lady and I introduced each other briefly and exchanged personal cards. It surprised her that I had one. \n\nThe ball was a Yacht Club thing filled with people who could afford yachts bigger than my dorm building and amazing food. She knew that she had never had a ‘normal’ life because both of her parents were wealthy former celebrities and her grandparents were just wealthy. We had nothing in common except for a taste for chocolate and attraction to women.\n\nI got dropped off at the dorms in a limo, wearing a tux and drunk on the limo’s single malt. Next time I served her grandfather, I assured him that she’d find, “The right person for her.” She came out of the closet a few years later and is now happily married. Her IMDB filmography has 12 credits before that ball and 31 after. I sometimes see her on screen.",
   "created_utc": 1694672567,
   "score": 0,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hxjw6",
   "message": "Not a celebrity, but a real deal model.\n\nI was in college and this woman was in my class. She kind of had an exotic, funky look to her and laughed at my jokes. So we hung out.\n\nMe? I was a total nerd, so it never occurred to me that there was anything between us. I mean, here she was, tall, lean, elegant, perfect face, and kind of an edgy look to her. Me? Glasses and I was skinny enough that I could have been a trellis for vericose veins.\n\nSo imagine my surprise when eventually she asked me out.\n\nOn our third date, I went over to her place. As it turns out, she had lived in Europe for three years and 'oh, had done some modeling.' She moved home when her mom died to be with her dad and figured she'd finish her degree.\n\nSo she asked if I'd like to see her portfolio. \"Sure,\" I said, thinking it would be the usual catalog stuff.\n\nNope. Elle, Italian Vogue, and a number of other fashion mags. About ten total. I was dating a cover girl and didn't even realize it. And to her credit, she had never really mentioned it. Always low-keyed it. \n\nHowever, I didn't really tell anyone, because I figured she'd dump me sooner and later and didn't want to be embarrassed. Finally, one Saturday night, she asked my Sunday plans. When I mentioned my family was going to have the usual Sunday dinner, she asked, \"Well, what time?\"\n\nWell. So I mentioned that a girl I was dating was going to come by for dinner. My two brothers and my sister kind of ribbed me about it and my mom was thrilled that I was actually dating someone. I actually had a dating life but I kept it completely from my family because quite frankly, my brothers and my sister could be snide assholes.\n\nSo the door bell rang, I opened it, and she strolled in. Black leather pants and jacket, some edgy looking blouse, and her hair kind of with a funky early-80s Pat Benetar look (I did mentioned it was the 80s, right?). You could have heard a pin drop.\n\nDinner went on for a couple of hours and I left with her. The next day, my oldest brother said, \"So there's a side to you we don't know about, isn't there?\"\n\nIt lasted about six months. But, truthfully, dating her was kind of exhausting after awhile, because she was so insecure about what she looked like, what she ate. Dinner was always kind of an ordeal. Nobody could believe that I was the one who let the relationship slide.",
   "created_utc": 1694658541,
   "score": 173,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i8iht",
   "message": "Courtney Love flirted with me at a bar in Indianapolis in 1995. The following pathetic story is as close as I can come to relevantly participating in this thread. \n\nIt was late night after her concert (Hole) at a nearby arena. She stared daggers at me when I walked in, like I thought she somehow hated me?  It was a little odd, but she was a little drunk.. so whatever. \n\nShe walked up to me at the bar with a couple of very large guys who I assume were security. She loudly ordered me a drink, and made a big deal of standing very close to me and touching my shoulder and chest repeatedly. I kind of fumbled through the conversation as the experience was pretty jarring overall. At some point she told me that I reminded her of the character Linus from Charlie Brown. I dunno what that meant, but eventually I kind of weaseled my way to the bathroom and then just left. \n\nThis was at the now defunct “The Patio” nightclub in Broad Ripple. \n\nCourtney Love was a lot more attractive than you’d think in real life, and also a lot shorter than she looks like on tv.  Not really short, but she definitely did not look 5’ 9” like google says she is.",
   "created_utc": 1694663929,
   "score": 168,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hv5n9",
   "message": "About 8 years ago, I met Corey Feldman at a comic con. He proceeded to ask me out. I respectfully declined. Then he tried to get me to go to a haunted house with him (?). I’m much younger than he is haha. My parents say I could’ve been with a D list celebrity every time we watch a movie he was in.",
   "created_utc": 1694657466,
   "score": 101,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hs953",
   "message": "I dated a fairly famous female heavy metal musician for a while. The long distance/constant travel thing ended up being very much not for me so we ended things\n\nEdit: Jesus I did not think this would get that much attention. No I will not say who she was lmao",
   "created_utc": 1694656205,
   "score": 188,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i1gsh",
   "message": "I met Hugh Jackman on the streets of New York, drinking a Pilsner out of a paper bag and eating a slice of pizza. I was on my way to see the Violent Femmes at Roseland Ballroom. I totally asked him to come with me. He said no, but I took it as a win. It’s not every day you get to ask out Hugh Jackman!\n\nEdited to add: I was the one drinking beer and eating pizza…Hugh was just out for a stroll. And it was the last show ever at the Roseland Ballroom.",
   "created_utc": 1694660372,
   "score": 4,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hr8vx",
   "message": "Not me but a coworker's sister in law. She hooked up with TJ Miller in the late 00s before he hit Hollywood and was still a traveling stand-up comic.\n\n My coworker, his wife, and sister in law all went to a comedy show where TJ hooked up with the SIL and they all went back to their house to presumably drink and hang where he spent the night. In the morning they found the front door open and the cookies the wife had cooked the night before were gone. He wouldn't shut up about it for years until he finally saw the guy and realized it was the same person.\n\nTLDR: TJ Miller is an alleged cookie thief",
   "created_utc": 1694655772,
   "score": 248,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i930i",
   "message": "I went on a date with a well known actor's daughter (who had done some roles herself).  We hung out a few times casually but through our chats it was apparent that she was growing more interested - so I asked her out.  It went well and we went to a jazz club and bar with more drinks after...got up to the point of holding hands.  \n\nAs I drove her back to her place hoping it was going to go where it goes...she gave me the \"talk\".  She said she was interested but it wasn't a good time in her life to be dating as she was trying to find a career outside of acting and outside her father's shadow.  Ended with a simple peck on the cheek.  \n\nThe sad part was that I was supposed to originally pick her up at her dad's house and she was going to introduce me to him which I was super excited about.  But she was running late so I picked her up from her apartment instead.  We stayed friends for a bit after and she asked me to help her move to new house, but never set a date for that and that was pretty much the last time we spoke other than an email for her new acting classes.",
   "created_utc": 1694664239,
   "score": 151,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hp8tz",
   "message": "He was an NHL player. We dated for about eight months and actually were engaged. I broke it off and give back the ring when I realized being a hockey wife would make me go insane in the long run.",
   "created_utc": 1694654924,
   "score": 188,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0h8i1d",
   "message": "My friend almost dated Marisa Tomei, apparently she has a thing for balding men",
   "created_utc": 1694648002,
   "score": 42,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hngcp",
   "message": "My friend’s friend hooked up with John Mayer after one of his concerts in his tour bus. She said he was a horn dog and was into butt sex.",
   "created_utc": 1694654168,
   "score": 198,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i89y5",
   "message": "I sat next to Natalie Portman on a plane once. We talked all about designer handbags, and then were there for each other through some bad turbulence. She was already taken, and I’m gay, but…it was still a relationship I’ll never forget.",
   "created_utc": 1694663800,
   "score": 214,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i1pjj",
   "message": "Never dated, but once had dinner with Nichelle Nichols. She was the most amazing person I ever met. Full of great stories and would sing at the drop of a hat. \n\nShe was a true American treasure.",
   "created_utc": 1694660489,
   "score": 196,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i57w2",
   "message": "I got set up on a blind date with a very famous dominatrix (famous in whatever circle that is).\n\nShe was very pleasant. The restaurant my acquaintance was high end and overpriced. Apparently the dom was accustomed to her clients treating her to 5 star places all of the time.\n\nWe talked about our jobs, and normal stuff. At the end of the date she said she was interested in me, and I told her that would never have chosen that place, or the club we went to after.\n\nShe agreed to another date where we dressed down and went out. I took her to a hole in the wall that makes some of the best fried chicken you've ever had. We bar hopped, and went to some cool secret spots like Crif Dogs secret backroom bar, before everyone found out. We had a great time. She said it was the most fun date she's ever been on, but we realized we lived in two different worlds.",
   "created_utc": 1694662219,
   "score": 160,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i2lwh",
   "message": "Well he wasn't a celebrity when I dated him. I got pregnant and he was just talking to somebody about moving to the west coast and playing in their band. He didn't want me to have the kid but I did anyway and told him I wouldn't bother him. I knew it would screw him up because almost 30 years ago they would make guys get a job and working gigs playing guitar wasn't going to cut it. So I never went for child support and we only rarely spoke after that.\n\nChild turned 15 I think and something went on with my husband and I had to file child support for the first time. That's when I found out that he was a full-blown rock star! He pulled the whole that's not my kid thing. We got the DNA test, 100% you are the father! Kid got to know him in between his concert tours. He's definitely a different person now and I'm kind of glad I didn't know that person way back when. \n\nNot exactly what you asked but that's my celebrity story.",
   "created_utc": 1694660922,
   "score": 111,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hpfuv",
   "message": "Once I found myself in one of those one-seater restrooms in a Starbucks in Manhattan right in front of the ABC studios . I think it was like 74th st and Colombus. Anyway I had run in because I had to take a giant shit and it took a couple of minutes to get it all but it ended up to be a big mountainous triple flusher and it was rank. By the time I got out there was a line for the restroom and  Rosie O'Donnell was in the front of the line. I smiled at her because I recognized her and she smiled back I think. Then she went in there... This isn't at all like dating a celebrity but it's a pretty intimate experience I think.",
   "created_utc": 1694655007,
   "score": 183,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0ia94p",
   "message": "My moms cousin married an NFL player. We visited when they lived in Colorado (not anymore) and he was a hella nice dude. Their kids are beautiful. It’s been nice to see them grow up thanks to Facebook.",
   "created_utc": 1694664882,
   "score": 88,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hc9e8",
   "message": "My wife was on Delicious Destinations. Does that count? She's my celebrity lol\n\nEdit - wife corrected me\n\nBizarre Foods: Delicious Destinations",
   "created_utc": 1694649550,
   "score": 41,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hpqo8",
   "message": "I dated a male model who did runway and photo for Ralph lauren and Calvin Klein.  Does that count? He was super pretty and absolutely zero chemistry. He went on to be in a HGTV show.",
   "created_utc": 1694655134,
   "score": 18,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i8k9h",
   "message": "Didn’t date but hooked up with Miley Cyrus after Lollapalooza. I was working one of those big ass beer tents at one of the many stages, had to stay late to clean after the show was over and guess who comes over (after we stopped selling) to buy a drink. I offered to buy her one, just not at Lolla and the rest is history (for me lol).",
   "created_utc": 1694663956,
   "score": 213,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i8h2t",
   "message": "My cousin dated Josh Hartnett for a little bit during college. This was before he got his big break in ‘Pearl Harbor’ and became famous.\n\nETA: my cousins a lot older than me, but from what she said he was a sweet guy. I think they met at her friend’s high school reunion and hit it off.",
   "created_utc": 1694663908,
   "score": 253,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i65hs",
   "message": "My grandmothers ex husband dated Marlyn Monroe. His family helped my great great grand parents escape from Germany at the start of World War 2.",
   "created_utc": 1694662689,
   "score": 246,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0idaq3",
   "message": "Dated an actress for a while. Not a household name, but one of those \"oh yeah, I think I know her from X\" kinda people. Very respected and won some credible awards. Met a lot of her friends, many also I guess b-list actors similar to her, and one or two a-listers (whose names Reddit WOULD know for sure). \n\nThe main thing I found was her, and her friends, were all super insecure. I think it's just the nature of the work/the industry that breeds that. \n\nApart from that, was a pretty regular relationship. We broke up, largely due to her insecurities. She's married with a kid now, hope she's happy.",
   "created_utc": 1694666631,
   "score": 15,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0gurfs",
   "message": "[deleted]",
   "created_utc": 1694642455,
   "score": 63,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hri4w",
   "message": "Didn't date, really. Went to a party and ended up bringing a chick home that got fucked up and was getting circled by sexual predators. I might be exaggerating a bit, but there were some rapey vibes when some dudes noticed she was nodding out, and the creepiest dude there recommended we move her to a bedroom to \"not be disturbed.\"\n\nThe next morning, I cooked breakfast, and we chatted a bit and kinda hit it off. She stayed for 3 days because she was staying in her childhood home and was fighting with her parents. There was sex, but not as much as you'd think. I went out to get us Jack in the box on the third evening, and when I got home, she was in the middle of a heated argument. She saw the food, grabbed all my damn mini tacos, my ultimate berry shake, and left. \n\nShe was a local \"celebrity\" due to her father putting her on commercials with himself. So I had seen this chick on the TV trying to sell hot tubs for years. To be honest, the most recent commercials had been running for a few years at that point, and she wasn't obviously recognizable. I didn't put two and two together until the end of the second day.\n\nEDIT: People keep guessing, and I will not confirm if anyone guesses correctly. No one has yet. Hot tub chick would be in her 40s now. This was some time ago.",
   "created_utc": 1694655882,
   "score": 250,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hvtgp",
   "message": "I once banged Eartha Kitt in an airplane bathroom",
   "created_utc": 1694657765,
   "score": 11,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0he3fk",
   "message": "It was fairly difficult. For us it was too much traveling on her obligation for work me not being able to accompany her because of my obligation for work. She was faithful she never cheated but constant attempts from coworkers and others to get her. But she was in my opinion very respectful that way. For us through other issues not being able to do holidays or plan them just normal things couples do. But it was otherwise a good relationship we actually parted as friends. Stay in contact once in awhile. After we dated I got was married for 23 years and her and my wife we're friendly. Never disrespectful to our marriage she ended up actually marrying and divorcing more than once. But she's been in a relationship for the last 12 years and happy. He's in the industry. And they're actually pretty famous couple not Superstars but definitely recognized.",
   "created_utc": 1694650314,
   "score": 90,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i77my",
   "message": "One of my best friends dates and married into a wealthy famous foreign family. Luckily, he was also famous for a time. He’s controlling himself but he married the one women who can out control him and tell him what to do and it made him a much better man. He needed someone more dominant then him. Funny how that works. They have a  great marriage.",
   "created_utc": 1694663240,
   "score": 33,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i4ime",
   "message": "Had dinner with Terri Hatcher when we were in our late 30s. Got a hug goodnight. That is all I have to report",
   "created_utc": 1694661863,
   "score": 121,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0idjmx",
   "message": "I dated a world famous fitness model. It seemed like every time I went to the grocery store for years afterwards she would be on the cover of a women's or women's fitness magazine in the checkout lane. I know she had 8 different covers of one magazine specifically (at last count when we were dating). \n\nI met her at the gym - I was doing a really intense baseball training workout on the indoor turf field and there was this spectacularly fit, beautiful woman working out hard too. I walked over to talk with her and had a great conversation before we went back to our workouts. Later on she was in the very busy free weights area and I walked up to ask her out - it was one of those moments where you are suddenly aware that everyone is staring at you and you don't know why. \n\nI had absolutely no idea who she was and the weekend before our first date she flew to a fitness event; when I texted her she said \"I was busy signing autographs\". I still had no clue and said, well ok, \"I hope your hand doesn't get too tired.\" She laughed at that, and later on I realized she wasn't kidding.\n\nOur dating was amazing, and she was incredibly sweet, kind of country, and totally feminine. Unfortunately it was the time in my life where I had the biggest amount of work stress imaginable and it didn't work out, I just didn't have it together. \n\nI still run into her from time to time and we still smile at each other.",
   "created_utc": 1694666776,
   "score": 62,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i7lha",
   "message": "Started getting recognized with her and separate from her. Felt like I had to look exceptional everywhere I/we went. Also had to mentally prepare for people recognizing us wherever we went.\n\nThankfully, we started realizing a lot of it was self-imposed pressure and now we’re just back to being normal. Still gotta read rooms though just so we’re aware of how many people have spotted us and how they’re reacting to it.",
   "created_utc": 1694663442,
   "score": 117,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i91ni",
   "message": "I once had a patient while I was working at the rural hospital.\n\nShe was an elderly female with heart failure and worsening kidney disease that were in the late stages of kidney failure. I could barely wake her up even with rubbing her sternum. Her husband was bedside, as well as a nephew. \n\nI had a discussion with her daughter as I was preparing palliative care and comfort measures. She’s very pleasant in the face of reality, and she expressed to me that it was very scary for her mother to consider death so would be best if the doctor told her. I had just seen that she was not even waking up to me rubbing her chest, but I told her that I would try. \n\nI went back to the room and the patient was sitting up completely normal, and she says “I’d like to have salad !” I was in awe seeing her go from the state I had just seen her in, with worsening blood levels. I justified it as delirium that is fluctuating.\n\nShe then tells me that she would like to drink some water as well. The nephew that was bedside, says that she had, and that time just read the album that was sitting in front of her from start to finish. \n\nI said ‘wow that’s impressive’. Confused, my medical mind saying it all must be long-term memory contact if she’s delirious; she might be accessing memories that have long solidified.\n\nThe nephew continues on saying it is very interesting, I should take a look. \n\n i’m kind of confused by it all, but did tell me to open up the album. \n\nI open the album, and there it is. Luciano Pavarotti. Every page. \n\nLetters from him from years ago, his signature, all over the paper pictures of them together, tickets from his shows, letters. She begins to tell me the story of what happened and how they connected. Her Recollection was meticulous!\n\nI asked her husband, I said, are you OK with this, he said oh, ‘it was Luciano’! \n\nThis wasn’t delirium. It was storytelling of how experience is grand in the opera of life.",
   "created_utc": 1694664219,
   "score": 182,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hrm5a",
   "message": "On and off 7 years.  Currently in the off.  She was a homebody so that was nice.  Going out and her getting hit on constantly was a bit draining for us both.",
   "created_utc": 1694655931,
   "score": 88,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hv5gj",
   "message": "Liv Tyler and I were on the same plane once and stood somewhat close to each other in the baggage claim in Nice, France while we both waited for our luggage. It was amazing.",
   "created_utc": 1694657464,
   "score": 144,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0gpcqn",
   "message": "That Veronica Vaughn is one piece of ace, I know from experience, dude.",
   "created_utc": 1694640459,
   "score": 117,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i7iz6",
   "message": "He's done a lot of cool things in his career but isn't super well known, but I think most people in North America will know his face. We hooked up after one of his wrap parties where I was bartending. He was super nice, went out to 7/11 cause he didn't have condoms and his dog was super cute and chill. Was also sober and ordered me food which was nice. We talked for months after and he tried to fly me out and wanted to take me on set and stuff but I didn't really think he wanted anything serious so I passed it up so I could spend time with a guy where I live. In hindsight, while it would have been cool to go to LA, I'm still with the guy I ditched him for 6 years later and am madly in love, and he's married with a kid now. It's a good story and I have so much respect for his talent and career and even him as a person cause he treated me so well, but I think we would have been way too different to have worked out.",
   "created_utc": 1694663407,
   "score": 180,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i1qq8",
   "message": "Slept a few times with a famous porn star.\n\nIt was just like sex with a normal person, aside from her massive juggs.",
   "created_utc": 1694660505,
   "score": 23,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0ifdsm",
   "message": "In the middle of a divorce from a Hollywood D-lister who still gets recognized often for his roles in cult classic comedy films. I’ve always said he’s sort of like the real life Wooderson from “Dazed and Confused”, in that “he gets older, but his fans stay the same (college) age”.",
   "created_utc": 1694667896,
   "score": 44,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0igw5j",
   "message": "Had a scene partner from Mexico in an acting class in LA. Developed a crush and asked her out. She said yes. Learned she had 2 million Instagram followers and was very famous in Mexico. Halfway through our first date, she got a text and asked me if I wanted to go with her to a party with the daughter of the president of Mexico. Was a very surreal evening. We’re still friends.",
   "created_utc": 1694668834,
   "score": 49,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hkj9m",
   "message": "Friends mom dated Tony Hawk back in the day. She apparently barely ever saw him. A little TOO committed to the sport.",
   "created_utc": 1694652956,
   "score": 196,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0hzhne",
   "message": "I dated a girl in high school for about two months who went on to be a fairly famous model. She was very busy and driven with her budding modeling career. She also was very into all the attention she got from guys. All in all id say it was very vanilla and she was nice to look at. Also her dad was scary af. He was a huge Tongan guy who had gotten out of prison recently and looked at me like I took the last piece of corn bred at the cafeteria 😂",
   "created_utc": 1694659434,
   "score": 124,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i1lpa",
   "message": "We met in a random club when he showed up for a surprise performance. I happened to be dancing on stage and was told to keep dancing as all but one or two other girls were kicked off the stage. We danced on stage for a couple of songs after his performance and then asked me to give him a ride to the studio. He was really down to earth and signed a bunch of autographs.\n\nThe weekend after he left town he flew me to his hometown and we spent like 3 days together, which ended in me meeting his mom and sisters. Before I left he asked me to stay with him, quit my job, and commit to a relationship (I would have to travel with him nonstop as he was promoting a new album). I liked him, but couldn’t hand over my financial security for a guy that I barely knew. I tried to slow things down and he took it super personal. Then he wrote a song about me (which made me sound like a bitch) and it played on the radio constantly for the next few months. I know he wrote it about me because he left a voicemail of recording it in studio.\n\nEdit: OMG Reddit sleuths. Yes, I cheated on my husband (then boyfriend) with a celebrity in my early 20s. Congrats, you did it. Lives are messy and it didn’t seem relevant to the question at hand. As for it sounding like a movie, I literally don’t know what to tell you? This isn’t even my most interesting anecdote.",
   "created_utc": 1694660437,
   "score": 143,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i5qhq",
   "message": "I was pretty good friends with someone who had been in a long term relationship with an NFL player. You’d know his name. \n\nHe was a good dude and very generous to her, but their lives were just going in very different directions. It ended as well as anything ends. \n\nShe has lots of good things to say about him but doesn’t regret her decision to leave.",
   "created_utc": 1694662480,
   "score": 181,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i60ki",
   "message": "Not dating and never will, but a very good friend of mine is a top level commentator in the sporting industry, mostly based here in Australia but also has contracts in the US.  \n  \nSo for the most part he would be considered a Z-list celebrity and absolutely not a household name. For 99% of the general public he’s just a great dude with a cool job, but that other 1% of die hard fans absolutely love and idolise him.  \n  \nEven after years of knowing him it still makes me laugh when a fan recognises him in public, because he’s about as humble as you can get.  \n  \nAnother novelty is hearing him on the radio out in public or seeing him on my TV out of the blue.  \n  \nEveryone knows everyone in his particular sport, so he counts many of the top, more widely well known athletes among his good friends.  \nHe’s a very cool dude with some very cool stories to tell.",
   "created_utc": 1694662620,
   "score": 107,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0i5m71",
   "message": "Michael Kors is my buddies neighbor in Fire Island. Caught him starting at my ass once. He smiled and I cringed, this counts.",
   "created_utc": 1694662420,
   "score": 217,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0ic5gj",
   "message": "I was working for a record company and dated a woman who had a hit record at the time.  She was batshit crazy, but a nice person.\n\nEverything was fine until the fame died down and she had to be 'normal' again.  She couldn't quite get used to not being in hotels and planes and having people scream her name... which was weird because she didn't really like those things to start with.\n\nOne day as I was getting ready for work I asked her if she could drop something off at the Post Office for me... and when I came home that night she was gone.",
   "created_utc": 1694665961,
   "score": 73,
   "submission_id": "16hyw7s"
  },
  {
   "comment_id": "k0ifllz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16hyw7s"
  }
 ]
}