{
 "submission_id": "16ib8n4",
 "title": "what is the most unsettling unsolved mystery that you're aware of?",
 "selftext": "",
 "created_utc": 1694674549,
 "permalink": "/r/AskReddit/comments/16ib8n4/what_is_the_most_unsettling_unsolved_mystery_that/",
 "score": 43,
 "url": "https://www.reddit.com/r/AskReddit/comments/16ib8n4/what_is_the_most_unsettling_unsolved_mystery_that/",
 "comments": [
  {
   "comment_id": "k0j4q5l",
   "message": "How Scientology still has tax free status in the USA.",
   "created_utc": 1694686652,
   "score": 58,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ixuh7",
   "message": "At what point did the brain realise its own consciousness\n\nI find it fascinating",
   "created_utc": 1694681326,
   "score": 32,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0itv16",
   "message": "Ghislaine Maxwell was found guilty of sex trafficking but somehow all the people she trafficked to are free to go.",
   "created_utc": 1694678113,
   "score": 232,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0itvkx",
   "message": "another one is of the springfield three. a woman, her daughter and daughter's friend went missing from their home in the middle of the night with no signs of struggle or major evidence left behind. it's been so long since it happened so the chances of this case ever being solved is meagre",
   "created_utc": 1694678126,
   "score": 224,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0izvhl",
   "message": "The Australian prime minister that went for a swim and was never seen again",
   "created_utc": 1694682961,
   "score": 58,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iwxcg",
   "message": "The beamont children, three young siblings that disappeared in 1966 from glenelg Beach.",
   "created_utc": 1694680584,
   "score": 165,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0itl7z",
   "message": "the murder of missy bevers. investigators haven't even been able to discern whether her killer was a male or a female when the killer was caught on cctv footage roaming around the church where missy was murdered. his/her car was caught on footage as well but there has been little to no development in this case. it's terrifying to know that her killer is still out there and might never be caught\n\nedit: \nhttps://www.youtube.com/watch?v=ESI68Z6Qo-o - just putting this link here for anyone who wants to know more about missy's case. it's a really well-researched analysis of the case",
   "created_utc": 1694677898,
   "score": 134,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ipiku",
   "message": "[deleted]",
   "created_utc": 1694674767,
   "score": 241,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0irvgo",
   "message": "MH370 will always be top of that list for me. I want to know where it is and what really happened to it.",
   "created_utc": 1694676541,
   "score": 70,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jcg9q",
   "message": "Where Shelley Miscavige is",
   "created_utc": 1694691485,
   "score": 254,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j7duu",
   "message": "I can't remember exactly what star it was, but there was a star deep in space that astrophysicists saw as relatively unremarkable. Just another star they were monitoring.\n\nAnyway, one day, all was normal, it was in the correct position. The next day, they were monitoring all the stars, and this one star had just disappeared. Poof.\n\nNo one could figure out why. It could have been that it went supernova, but if it had, they would have seen the residue and the massive explosion, plus all the gaseous residue. So it can't have gone bang. They also hypothesised that maybe a civilisation had constructed a Dyson sphere (a large construction made to harvest all of a stars potential energy), but if so, it would have been more than likely that we would have seen the star slowly disappear, the light fading as the civilisation constructed the Dyson sphere. Now, of course, according to the Kardashev scale, there could well be a civilisation so advanced that they could have just constructed the entire sphere in a matter of seconds, but we'll never know.\n\nOn that subject, that same civilisation could have just absorbed the star instantly to use its power.\n\nThey thought that maybe, other extrasolar objects were just blocking its view somehow, so they continued to monitor its location. It never came back.\n\nSomewhere, out there, a star just miraculously disappeared without a trace. And we will never know how or why.\n\nThat's what's so disturbing to me. We have such amazing technology to monitor objects millions of light years away, yet we cannot figure out why a star just disappeared without a trace. And we may never know.",
   "created_utc": 1694688468,
   "score": 144,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ixdd3",
   "message": "Mr. Cruel, attacked 3 kids in Melbourne in the 1990’s with two dead if I can recall, vanished after killing his last victim, presumably out of fear he’d be found out.",
   "created_utc": 1694680942,
   "score": 32,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j0lcn",
   "message": "The murders in the Codru Psychiatric and Mental Illnesses Children’s Hospital. The horrors that went inside that hospital will always haunt me. Knew a guy who went there. Before this he was young and cheerful, had a few loose screws but nothing too serious, just your average eastern european. He was there for one year from the age of 16 till 17. When he came out he looked 10 years older. He was always mumbling something in the lines of “they killed him.. he was only 7.. they killed him”. It’s been 20 years since then, haven’t seen the guy for about 10. Heard from a close friend of his that there was no bringing him back. Hope someone makes a documentary about it one day, at least to bring those animals to justice. Doing this to kids just ain’t right.",
   "created_utc": 1694683523,
   "score": 204,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0is6jz",
   "message": "The universe. Like why? Why are we here? Why anything? Like you could break it down to the laws of physics say this and that will take place. But why? What is the reason behind everything? 🤷🏻‍♂️",
   "created_utc": 1694676788,
   "score": 16,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iyhl9",
   "message": "At some point a creature on the planet Earth had the first idea. \n\nNot just a reaction to stimuli, but a literal idea to act.\n\nWhen and what, we will never know.",
   "created_utc": 1694681839,
   "score": 24,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0itl6r",
   "message": "How the fuck the guy from the counting crows got so many hot 90’s stars to date him",
   "created_utc": 1694677897,
   "score": 142,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0itxag",
   "message": "Who put Bella in the wych elm?",
   "created_utc": 1694678163,
   "score": 210,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j4653",
   "message": "When I was 6 or 7 I had a very soft cushiony house slippers. I only got to wear them a month or so and one of them disappeared. \n\nMy poor mom and I checked every corner around the house and couldn't find it. It just vanished and I was devasted because I was well aware we couldn't afford a new pair.\n\nFor years I mourned for it and when I was 13 we moved out. Even then I was hopeful to find it I searched around the empty apartment but no luck.\n\nI don't know where it went and still at the age of 26 I try to figure it out the mistery of lost slipper. Probably aliens abducted it idk",
   "created_utc": 1694686252,
   "score": 244,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iq7lu",
   "message": "Who actually killed Elizabeth Congdon in the Glensheen Mansion murders? And did her daughter Marjorie have a hand in it?",
   "created_utc": 1694675272,
   "score": 191,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iu28c",
   "message": "what's below the ocean. we only discovered 4% of the ocean waters iirc",
   "created_utc": 1694678275,
   "score": 51,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iwaj7",
   "message": "Madeline McCann’s disappearance",
   "created_utc": 1694680076,
   "score": 8,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jlny5",
   "message": "Malaysia Airlines flight 370 disappearance",
   "created_utc": 1694696016,
   "score": 104,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ivi45",
   "message": "There is a mystery jar of spaghetti that showed up in the lunch room at work. We reckon it might have been left behind by a contractor, but can't be sure.",
   "created_utc": 1694679445,
   "score": 85,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j4i4d",
   "message": "Anyone from Adelaide would say [the disappearance of the Beaumont Children](https://en.m.wikipedia.org/wiki/Disappearance_of_the_Beaumont_children).\n\nThree kids vanished from a busy public beachfront suburb on Australia Day and still haven’t been found. It happened 57 years ago",
   "created_utc": 1694686495,
   "score": 146,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iz505",
   "message": "I have three I'm very invested in: one, who murdered Joseph Zarelli (aka the Philadelphia boy formerly known as the \"Boy in the Box\"); two, what happened to missing Oklahoma teenagers Ashley Freeman and Lauria Bible and who murdered the rest of the Freeman family; and three, who murdered the Short family of Henry County, Virginia.",
   "created_utc": 1694682368,
   "score": 23,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j3p0j",
   "message": "Mark Dutroux easily. \n\nThis MF acted not alone. Judges swapped, witnesses murdered you name it.",
   "created_utc": 1694685910,
   "score": 87,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iqria",
   "message": "What happens when we die lol",
   "created_utc": 1694675688,
   "score": 168,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iuoad",
   "message": "The Dyatlov pass incident, the way the bodies were found, the injuries, two bodies were missing eyes and one without tongue.",
   "created_utc": 1694678769,
   "score": 238,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ixeug",
   "message": "Chris Kremers and Lisane Froon …. This case give’s me chill’s everytime….",
   "created_utc": 1694680975,
   "score": 47,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ixv80",
   "message": "i have to say Emanuela Orlandi",
   "created_utc": 1694681342,
   "score": 28,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0izvi9",
   "message": "MH370, Asha Degree \u0026amp; Andrew Gosden",
   "created_utc": 1694682962,
   "score": 54,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j0e5h",
   "message": "DB Cooper",
   "created_utc": 1694683366,
   "score": 100,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ivqwr",
   "message": "That we're either alone in the universe, or we're not.",
   "created_utc": 1694679642,
   "score": 75,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iw17h",
   "message": "There are tunnels under the city, most are small leading to a very important river, while other just go to closed off buildings for maintenance. As a kid I explored just a few and they're too small to be of any real use while being as old as the city itself.   \n\n\nI've heard a lot of shit going down there but I've never heard anything at all while in them because I just didn't got too far. I wonder what they're used for and why the city doesn't promotes tourism with them. Sometimes people living nearby don't even know they're above them!   \n\n\nLocal talk says any kind of illegal shit went down there but idk, no human activity near.",
   "created_utc": 1694679864,
   "score": 53,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j7dc2",
   "message": "This is a fake mystery, one of my own imagination but still creepy. I worked in a prison, there was a singular inmate who always gave me weird vibes. I had a very vivid dream he slit my throat and I could feel the blood running down my throat, feel it gurgling, I felt how it feels to be murdered. In the dream he mad a shank made out of a toothbrush and a singular razor blade. Well the mysterious part is, we found that exact same blade the next day during a routine cell search. I don’t remember going home the night before my dream, so am I dead? No matter what the comments say I’ll never be 100% convinced, because what if the after life is just a parallel of the universe. So what if, in my original universe my family is still mourning my death?",
   "created_utc": 1694688458,
   "score": 169,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j7kr7",
   "message": "Old neighbours of ours had their 18 year old daughter disappear.  She left work one evening and never made it home.  No body was ever found either.  I heard the police have a suspect but not enough evidence to do anything more.",
   "created_utc": 1694688593,
   "score": 61,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iwu80",
   "message": "Why I can’t sleep.",
   "created_utc": 1694680515,
   "score": 24,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0itleu",
   "message": "technically the idaho 4 murders are still unsolved",
   "created_utc": 1694677902,
   "score": 37,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j2yzv",
   "message": "1. MH 370\n2. Andrew Gosden\n3. Lars Mittank (arguably, not as unsettling as others, but it still gives me goosebumps. It's widely believed that he was last seen alive, a few months after he disappeared. He most likely reacted badly to the antibiotic and, as a rare side-effect, suffered from a psychosis)",
   "created_utc": 1694685364,
   "score": 14,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j6q9o",
   "message": "The black dahlia… it’s always haunted me",
   "created_utc": 1694688030,
   "score": 85,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j92tx",
   "message": "[Bryce Laspisa ](https://thecrimewire.com/true-crime/the-unexplained-disappearance-of-bryce-laspisa) : disappeared in 2013.\n\nI have heard of him multiple times in multiple formats, so nothing I can type here will do him justice. But the sparknotes are: \n\n- alcohol and drugs may have been involved\n- abrupt personality shift/started giving his stuff away to friends\n- decided to drive from his college campus back to his parents' house a few hrs away\n- tow truck (?) driver gave him gas on the side of a highway\n- about 8 miles up the same highway, police found him still in his car. Bryce passed a field sobriety test, and they informed him to continue heading home after his parents called, stating he was missing\n- the same tow truck driver found him in the same spot the police left him in and followed him as he drove away for a few miles to make sure he was okay\n- car was later found in an embankment with no signs of Bryce\n- K9 unit traced his scent to the main road from the embankment before losing it\n- all of this happened within 30-ish hours. \n\nI think he most likely had a mental breakdown. Doesn't negate that he's still missing. Really hope he's okay, but no one knows what happened or why. I recommend reading up on it from sources who better cover the story.",
   "created_utc": 1694689542,
   "score": 210,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jh7q5",
   "message": "The disappearance (and short lived reappearance) of Johnny Gosch.\n\nHe disappeared one day while delivering newspapers. Police did very little to try to solve the crime.\n\nNine years later his mother reports that Johnny showed up on her doorstep and explains that he had been held in slavery for the last 9 years. Authorities basically say she's making it up and have done no investigating.",
   "created_utc": 1694693933,
   "score": 224,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jj2uj",
   "message": "JonBenet Ramsey.",
   "created_utc": 1694694828,
   "score": 71,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ipdl2",
   "message": "The Cave Poganica knife mystery.",
   "created_utc": 1694674665,
   "score": 25,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0iqaxi",
   "message": "Why I’m single",
   "created_utc": 1694675342,
   "score": 59,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ivz0l",
   "message": "Who killed Missy Bevers",
   "created_utc": 1694679817,
   "score": 29,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jcnmm",
   "message": "Not \"most unsettling\" per se, at least compared to when a child like Asha Degree or Andrew Gosden goes missing, but certainly mysterious: Brian Shaffer's disappearance. It would be good for his people to finally have some closure.",
   "created_utc": 1694691594,
   "score": 50,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0ivicg",
   "message": "What happens at the end of the universe? What’s beyond it? What was before it? What happens after it? These questions lead you down an infinite rabbit hole that will leave you so unbearably existential.",
   "created_utc": 1694679450,
   "score": 18,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jgw0t",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jd4cz",
   "message": "Someone keep shitting in the holes at the local golf course been going on for the last twenty years bastard has never been caught",
   "created_utc": 1694691846,
   "score": 245,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jamep",
   "message": "This guy broke into a house, killed the single mom, mom's friend, the son, the family dog, and kidnapped the teenage daughter. Dismembered the bodies and hid them.\nThe girl didn't need to testify in his trial (he pled guilty), but read a letter during his sentencing saying that she knows he had help disposing of the bodies of her family because while she was still tied up in their house, she heard him making phone calls and heard at least one other person show up. She heard this person(s) talking, walking around and helping him with the bodies\n\nLocal pd \u0026amp; prosectutor just wanted a quick \u0026amp; easy trial and conviction, so they swept a lot of details under the rug \u0026amp; the girl's claim in court that this guy had help was very quickly forgotten.",
   "created_utc": 1694690460,
   "score": 29,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j5yyn",
   "message": "the author of My Immortal",
   "created_utc": 1694687519,
   "score": 84,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0keepz",
   "message": "One night my husband and I woke up hearing a woman screaming, “Help me!” He rushed to the window (we’re on the second floor) and saw a car drive past with a woman in a dress hanging on the hood. The car sped through the intersection by our place and careened off with her screaming on it. We called the police and told them which way it was going and then jumped on our bicycles and rode around the neighborhood to see if she’d fallen off. Never found her. Never found any news of her. I’ve always wondered what happened to her. That was over a decade ago.",
   "created_utc": 1694706967,
   "score": 170,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jcwh7",
   "message": "The Villisca Axe Murders. An entire family and 2 girls who were friends with their children got massacred within about 10 feet of each other. Then the killer covered all the mirrors and had a meal in the kitchen before leaving. Also left a slab of pork at the foot of one of the beds. Still not been solved.",
   "created_utc": 1694691729,
   "score": 80,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jaxy7",
   "message": "West Memphis Three murders. I feel so bad for those kids. Damian has been trying to get the state to test DNA to prove who the real killer is, and the state is fighting it. Sad that the kids died and in such a brutal way. And the three kids that grew up serving time in prison, for nothing. Luckily the three are out of prison, but the murderer is still out there. The HBO documentaries were amazing.",
   "created_utc": 1694690641,
   "score": 92,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0kce0a",
   "message": "Why did the Zodiac Killer and Jack the Ripper stop killing? They were never caught. They could have kept at it. So what made them stop?",
   "created_utc": 1694706267,
   "score": 41,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0izmsp",
   "message": "What’s the real reason pope Benedict XVI resigned?",
   "created_utc": 1694682765,
   "score": 31,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jq1ad",
   "message": "The Oklahoma City Jane Doe.\n\nAn unidentified left leg was found in the rubble after the Oklahoma City Bombing. Investigators thought it belonged to a woman named Lakesha Levy and was buried with her. However, Levy's actual leg was found later and then buried with her. All of the other (known) victims had their correct left legs buried with them. To muddy the waters further, DNA testing was impossible due to the embalming the body went through.\n\n...So, whose leg was it? Almost thirty years later, we still have no idea.\n\nThis is where the conspiracies come in. Timothy McVeigh swore there wasn't a third accomplice. His lawyer, however, insisted there was. Various conflicting eyewitness accounts state there were unidentified people in McVeigh's company in the days leading up to the attack, but these are tenuous at best. There's been accusations of a cover up after one of the suspects committed suicide in custody and the Feds seemed to drop the case entirely afterwards. Did they cause a man to commit suicide after wrongfully accusing him and then try to hush everything up afterwards?",
   "created_utc": 1694697881,
   "score": 31,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0kh9f9",
   "message": "If we’re going to talk about some real unsolved mysteries, here’s a couple that I find unsettling, unusual and disturbing. \n\nThe Setagaya Family Murders - \nOn New Years Eve in 2000, a family of four is attacked and murdered by a home invader in the Setagaya ward of Tokyo, Japan. After brutally killing the parents and two children, the killer remained in the house for hours, eating their food, using the bathroom, logging into the family computer and even taking a nap. Despite leaving tons of evidence, they’ve never been able to trace it to anyone. \nhttps://en.m.wikipedia.org/wiki/Setagaya_family_murder\n\nKurt Sova - \nAfter attending a house party in a suburb of Cleveland, Ohio, 17 year old Kurt Sova disappeared on October 28, 1981 and was missing for five days before his body was discovered in an area believed to have been previously searched. The coroner determined he had died 24-36 hours before he was found, nor could they verify his cause of death. There are multiple conflicting reports and even an eyewitness account from a friend claiming to have seen Kurt walking down a busy street three days after he disappeared and getting into a van and driving away. \nhttps://unsolvedmysteries.fandom.com/wiki/Kurt_Sova\n\nThe Boys on the Tracks -\nTwo teenagers, Don Henry and Kevin Ives were struck and killed by a freight train on August 23, 1987 in Alexander, Arkansas. While initially blamed on them being high and sleeping on the tracks, it was discovered they were murdered before hand and placed there. There is a ton of corruption and coverups involved with this story to get into, I recommend you look into it for yourself because there’s a ton of layers to it. One of the most interesting theories is the boys stumbled onto a drug drop operation run by the local police department and were killed for it. \nhttps://unsolvedmysteries.fandom.com/wiki/Don_Henry_and_Kevin_Ives\n\nThe Bombing of Flight 21 - \nOne of the lesser known aviation mysteries that has taken a backseat to more famous ones like MH370 is the mysterious terrorist attack that occured on board Canadian Pacific Airlines Flight 21. The domestic flight headed from Vancouver, British Columbia to Whitehorse, Yukon was destroyed by a bomb that exploded on July 8, 1965 near 100 Mile House, British Columbia and killed all 52 people on board. Nobody took accountability for it. Nobody was officially named as a suspect. Either someone covered their tracks really well or were on board the aircraft and killed alongside the others.\nhttps://en.m.wikipedia.org/wiki/Canadian_Pacific_Air_Lines_Flight_21\n\nTara Calico -\nWhile on a bike ride on September 23, 1988 in Belen, New Mexico, 19 year old Tara Calico vanished, never to be seen again. There was a disturbing update to this case on June 15, 1989 when a woman discovered a Polaroid photograph in a parking lot in Port St. Joe, Florida of a young woman and a younger boy bound and gagged in the back of a van, the young woman bore a striking resemblance to Tara, who was missing for nine months already. Tara’s mother believed it was her, Scotland Yard concluded it was Calico based on a scar on her leg, FBI results were inconclusive. \nhttps://unsolvedmysteries.fandom.com/wiki/Tara_Calico",
   "created_utc": 1694707977,
   "score": 33,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0j7x3z",
   "message": "Italian history has several unsolved mysteries that I would like to see solved. Here are some of them\n\n[Manuela Orlandi](https://en.wikipedia.org/wiki/Disappearance_of_Emanuela_Orlandi)\n\n[Ustica](https://en.wikipedia.org/wiki/Itavia_Flight_870)\n\n[The death of Roberto Calvi](https://en.wikipedia.org/wiki/Roberto_Calvi)\n\n[The monster of Florence](https://en.wikipedia.org/wiki/Monster_of_Florence)\n\n[The red book (agenda rossa) of Borsellino that disappeared from the place of his execution.](https://www.reuters.com/article/uk-italy-mafia-idUKBRE96O04C20130725)\n\n[Pasolini's death](https://en.wikipedia.org/wiki/Pier_Paolo_Pasolini#Death)",
   "created_utc": 1694688810,
   "score": 51,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jtcni",
   "message": "The Phoenix lights. A set of lights moved across the sky in silent V formation on Mar 13,1997 in Phoenix, Arizona. Thousands of people saw the phenomenon. The military initially said that it was caused by flares released during an air force operation but they later withdrew this explanation, admitting that no military exercises were taking place in the area.",
   "created_utc": 1694699226,
   "score": 48,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jx11z",
   "message": "What happens after we die. Near death experiences are the closest we have to an answer, but near death experiences could simply be the subconscious recognizing what is about to happen and creating a dream like hallucination of what you feel the afterlife is going to be.",
   "created_utc": 1694700671,
   "score": 24,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0k2289",
   "message": "For me, it's the disappearance of Michael Dunahee. \n\nHe disappeared from a playground in Victoria BC in 1991, only a few yards away from where his mom was playing football, without so much as a trace and still remains missing.  He was 4 years old.\n\nhttps://en.wikipedia.org/wiki/Disappearance_of_Michael_Dunahee",
   "created_utc": 1694702568,
   "score": 19,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jqvj3",
   "message": "Elaine Park, a girl that went missing from my high school. She disappeared one day and nobody ever saw her again. Police found her car with all her belongings on PCH, but never found her. pretty F’d",
   "created_utc": 1694698224,
   "score": 40,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0klh1o",
   "message": "Why prestigious positions are mostly filled with idiots and people listen to them without a simple logic check.",
   "created_utc": 1694709458,
   "score": 43,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0jlvl1",
   "message": "I'm from Malaysia, around 2020 Jan, I read an article on Facebook, titled - Bad People Become Old Too. The story goes - 2 kids, boy and girl, and their parent was walking around the street and is going back home, the girl wanted to go back to where they came from to take something, it's stated that back then it's very safe, so the parents let their son walked with their daughter. When the 2 arrived, the boy merely turn his head around, and his sister's gone. The boy ran all the way back to his parents, and the news spread across town, everyone helped looking for her. At the same day, not long after, she was spotted, dead, bruised, and the police found out that she was possibly raped by 8 adolescent/adult, there r 8 bite marks, 4 on each girls arm. What's worst? They piece a long wood down the girls vagina, piecing through her lung, not the ordinary wood, is the wood with iron rose kind of thing wrapped around it. Do u guys know The Rose Crown on Jesus's head when he died, yeah the kind but its metal. That's wat pierced through her body. She had tears, blood all around the floor. She died with her eyes wide open...\n\nIt's estimated that those animals are around 50~60 yrs old now. To this day, we still dk who r the murderers, police even put a bounty price of RM 50k on them. For Malaysians, myb they r sitting next to u on ur way home on Public Transport as u r reading this, myb they r ur friendly uncle next door, myb they r the person who smiles at you everytime u meet them, they r around us, living guilt free life after wat they did to an 8 YRS OLD GIRL",
   "created_utc": 1694696109,
   "score": 52,
   "submission_id": "16ib8n4"
  },
  {
   "comment_id": "k0js07c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16ib8n4"
  }
 ]
}