{
 "submission_id": "16ib663",
 "title": "[Serious] what stopped you from killing yourself ?",
 "selftext": "",
 "created_utc": 1694674297,
 "permalink": "/r/AskReddit/comments/16ib663/serious_what_stopped_you_from_killing_yourself/",
 "score": 74,
 "url": "https://www.reddit.com/r/AskReddit/comments/16ib663/serious_what_stopped_you_from_killing_yourself/",
 "comments": [
  {
   "comment_id": "k0iovm2",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1694674298,
   "score": 1,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iqii8",
   "message": "The thought of screwing it up and ending up in a worse situation.",
   "created_utc": 1694675500,
   "score": 175,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ir8pq",
   "message": "My daughter called and said how excited she was to see me tomorrow.",
   "created_utc": 1694676048,
   "score": 25,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipptn",
   "message": "Can't hurt the family and friends connected to me. Things would just be left too messy. A sweet dog would be left unattended. Some people would grieve and potentially go down the same path as I. No good way to settle things yet. Still. A guy can dream, can't he? It might be a ways off, but my eyes are still on the prize.",
   "created_utc": 1694674916,
   "score": 230,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iusro",
   "message": "My dog came up to me while I sat on my bed. I was ready and prepared. She put her paws on my chest and pushed me over. She laid on my chest and licked my face until I was sobbing, until all I could do was sob and hold her. She is such a precious puppy and I am so scared of what is going to happen when I lose her.",
   "created_utc": 1694678872,
   "score": 209,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itaaj",
   "message": "I wish I didn't exist. But I would never do that to the people I love.",
   "created_utc": 1694677658,
   "score": 241,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ivq77",
   "message": "My dog brought her toy to me",
   "created_utc": 1694679627,
   "score": 183,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ip7v9",
   "message": "Fear of the unknown and unknowable.",
   "created_utc": 1694674549,
   "score": 28,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iu74b",
   "message": "well, the paramedics",
   "created_utc": 1694678384,
   "score": 82,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iw3wo",
   "message": "My dog. It was nighttime \u0026amp; I was sitting on a beach where I would regularly walk my dog off leash. \n\nAs I sat there I looked out into the dark water \u0026amp; all I could think was that was where I wanted to be - out there in the dark water, in a place where there was no turning back.\n\nBut my dog started barking \u0026amp; barking \u0026amp; barking \u0026amp; barking. Finally the barking got so damn annoying I got up \u0026amp; we went home.",
   "created_utc": 1694679924,
   "score": 82,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ip22c",
   "message": "[deleted]",
   "created_utc": 1694674429,
   "score": 2,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0isryy",
   "message": "I’ve heard before that the misery doesn’t end, it just gets transferred to the people who love you and who now have to cope with your death for the rest of their lives. That one stays with me",
   "created_utc": 1694677254,
   "score": 228,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irspd",
   "message": "I thought about how sad my cat would be if I suddenly didn't come home one day. I now always have a pet.",
   "created_utc": 1694676480,
   "score": 117,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0isaag",
   "message": "My dogs and cats. The thought of abandoning them crushed me more than the pain I was in.",
   "created_utc": 1694676870,
   "score": 161,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iq8h6",
   "message": "Having a roommate/best friend and cat who would both have to live with that trauma. Plus family and my other friends deserved better.\n\nAfter enough time I realized I deserved better too.\n\n(I was never close to it like gun-to-my-head but I did think about it pretty regularly)",
   "created_utc": 1694675291,
   "score": 45,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j11bq",
   "message": "Anger issues. I got bullied in School and was depressed, but one day instead of being depressed I was very angry about that and decided to beat the shit out of everyone who was bullying me. I was the tallest guy in class so I didn‘t had any problems doing that. The Teachers didn‘t do anything against the Bullying so I had to change it myself. After 2 weeks fighting everyone who insulted me, it finally changed.",
   "created_utc": 1694683869,
   "score": 49,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ivgxh",
   "message": "Procrastination. Two times I wanted to kill myself I was like \"NAHHHH Let's cherish the last five minutes of my life.\" And when I would finally get up, either a member of my family would come into my room or some other thing would make my suicide impossible in that moment.\n\nLuckily I am better now.",
   "created_utc": 1694679418,
   "score": 43,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iw89r",
   "message": "Met a guy who effed his attempt up. He was left a paraplegic. \n\nThat would be a whole different level of hell as I would be left to the care of my narcissistic family. \n\nInstead I moved away and went low/no contact. My life became so much better. So very very very very very very much better.",
   "created_utc": 1694680025,
   "score": 40,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irbpx",
   "message": "Nothing. I'm just too scared of death.",
   "created_utc": 1694676111,
   "score": 72,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j88fa",
   "message": "Saw some ants on my balcony and decided to feed them a grape because I felt bad for some reason. Just stayed and watched them surround the grape for two hours and felt better.",
   "created_utc": 1694689009,
   "score": 40,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipjkm",
   "message": "Nothing! I tried pretty hard 😊\n\nTurns out your body doesn't just let you overdose though. It vomitted everything up. I was unconscious for a while and ended up in hospital but no lasting effects otherwise 🤷‍♀️\n\nThe right medication, therapy, and a better support network keep me from doing it again though. You CAN get better!\n\nAnyone that's thinking about suicide and wants to chat with someone that's been there is welcome in my DMs.",
   "created_utc": 1694674789,
   "score": 100,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ir6g7",
   "message": "LSD and a few good friends.",
   "created_utc": 1694676000,
   "score": 28,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j2t4b",
   "message": "My brother did it first and I couldn’t let that happen to my mom twice.",
   "created_utc": 1694685237,
   "score": 27,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iurq0",
   "message": "Lack of courage -- the only keeping me alive",
   "created_utc": 1694678848,
   "score": 70,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipdtt",
   "message": "failing multiple times, realizing how much money my parents already spend on and that I'd waste their money on purposeif I end myself, and accepting the fact that I'll die when my time comes and I can't change that. I'm just lucky I don't have any major injuries :)\n\nand also learning to accept/love myself. sometimes we can't get the love we desperately need, so we have to take it into our own hands. we deserve love, no matter what our thoughts and surroundings tell us. stay strong 💜",
   "created_utc": 1694674670,
   "score": 20,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itrfg",
   "message": "A friend of mine noticed that something seemed off when I'd been talking to them and some others in discord earlier and she messaged me a bit after I left for the night to see if I was ok. If she'd waited about 5 seconds to send the message I wouldn't be around any more.",
   "created_utc": 1694678034,
   "score": 23,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iur58",
   "message": "Fear of failure",
   "created_utc": 1694678834,
   "score": 24,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j1050",
   "message": "Cowardice. Just couldn’t do it.",
   "created_utc": 1694683843,
   "score": 22,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ip8pu",
   "message": "I gave birth to the most beautiful and important thing in my life",
   "created_utc": 1694674566,
   "score": 42,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iql96",
   "message": "To name only a few times \nOnce I was at the top of a building, and of course the suicide hotline didn’t help and hung up again, so I was left with my thoughts. Jumping was very alluring, but I realized that people had tried and failed to kill me so many times before, and situations had turned near fatal yet I’d gotten away, and to end it all because my brain wasn’t working with me would be to help them, so I spited them all and left. \nAnother time, I was on my way to a pier that I was planning on driving off, and I called my “best friend” at the time. I explained the situation and how I felt, and instead of helping he told me “nice crocodile tears” and said he’d tell my parents and hung up on me. After all my experiences of being in his place, I realized my kind of support was not the norm and decided that for my friends that did treat me well, I should try to stick around so they could have the kind of support that a suicidal/traumatized/depressed person should.\n\nLast but definitely not least, the day my (now ex) girlfriend attempted (sorry it’s long)\nI lived with my girlfriend while we were both 20, and had just become independent. There were a lot of things wrong with the relationship, but in this case the important bad part was that she had fallen in love with another guy who had the same name as me, and admitted it to me. All I did in response was say that I wanted to think about how to handle this, never said anything about a breakup, still slept next to her that night. The next morning, we wake up together, she leaves bed to go to the bathroom, I stay put on my phone. About 10-15 minutes later, I hear *boomboomboom* “____ Sherriffs Office, open up!” I went to the door to find a whole team of emergency response personnel, from sherriffs to EMS to firefighters, police kinda pushed me to the side and asked me about her after I said she was in the bathroom. I somehow immediately spotted her suicide note, which of course was only half written. They forced the door open I think, then pretty much dragged her to the ambulance. It was only after that I realized what had really happened. She hadn’t said a word to me, but did text one friend on the other side of the US what she was planning to do. Luckily, this friend had our address and called 911. My girlfriend got held under a 5150, and couldn’t make it to her sisters wedding, which I of course had to be the one to let them know she wouldn’t be there and they’d need a new photographer. Plus she got very mad that I saw friends that wanted to help me out and talk me through all this, and held it over my head for months. As you can imagine, this lead to many attempts of my own, some of which I’ve talked myself out of by remembering how much of my time I already gave to people that weren’t worth it, and now it’s time for me to do better, not stop and give up.\n\nSorry I know that’s a long post, but I hope my experiences can help someone else.",
   "created_utc": 1694675559,
   "score": 20,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iurk4",
   "message": "My parents. I decided to spare them from burying their own child. I’ll wait until after they pass, or at least until after my mom passes.",
   "created_utc": 1694678845,
   "score": 19,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iw2sa",
   "message": "Mom would be sad",
   "created_utc": 1694679899,
   "score": 17,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iuon6",
   "message": "My roommate stopping me. I was home alone for the night, my roommate was out on a lil tinder date and wasn’t going to be home for a while. I got drunk as hell and the feels took over, I had been distraught for months at this point but no one I felt comfortable enough to talk about it with. Got to the point where I took my ak pattern rifle and loaded it up, sat at the top of the stairs and waited for the right moment to go through with it. Had music blasting so any noise was drowned out pretty well. So around comes like 2-3am and roommate gets home early for reasons I forget, and his account of the situation is seeing me at the top of the stairs with my eyes closed, rifle under chin and thumb on the trigger. He bolts up the stairs and knocks the rifle to my left side, either causing it to fire or as I pulled the trigger. This spurred me to go off on him trying to fight him for my gun back so I could actually go through with it. This lasted long enough that he got tired enough to resort to hitting me with a bat to put me down, so the next morning I wake up massively hungover, back so sore I can hardly move, and major hearing damage in my left ear. All in all, bat or not, he saved my life that night four years ago. I e since been doing significantly better and I’m grateful for his actions that night. Gonzo, if you’re out there, Thank You.",
   "created_utc": 1694678777,
   "score": 14,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ixlv7",
   "message": "Had the gun to my head and my dog walked in and just stared at me. Broke down and just layed there petting her for a bit after that",
   "created_utc": 1694681132,
   "score": 16,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j22g1",
   "message": "The suicide hotline put me on hold and then hung up before anyone even spoke to me. Found it really funny.",
   "created_utc": 1694684671,
   "score": 17,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j70vn",
   "message": "The thought of surviving it",
   "created_utc": 1694688229,
   "score": 14,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irxnn",
   "message": "My family who relies on me",
   "created_utc": 1694676591,
   "score": 13,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itc6c",
   "message": "The aftermath. Someone needs to clean up my mess. Someone needs to fix my funeral, someone needs to deal with the trauma. I cant burden someone with that.",
   "created_utc": 1694677697,
   "score": 13,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipm6p",
   "message": "I havent lived all my happy days yet. Also, I believe that everything will be ok in the end, and if it’s not ok, it’s not the end.",
   "created_utc": 1694674842,
   "score": 24,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irevz",
   "message": "i thought my family (but mostly my dogs and my cat) would be sad. plus i didn't want people i barely knew showing up to my funeral trying to act like we were besties, which is so stupid but the thought of it pissed me off lol",
   "created_utc": 1694676178,
   "score": 11,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iqjcm",
   "message": "Cute answer: I fell in love with my SO. Still living together after four years. He gives me hope and love I never received from my family.\n\nNot-so-cute-answer: I tried to end my life seven times and, like you may guess, every time I failed. I realized that I’m even shitty at killing myself so why even try again? How stupid can man be to fail taking an overdose or hang himself? At 8th time I’ll fail again and become bigger loser. So maybe I’m just planned to live my miserable life. At that point I stopped trying and decided to do something else than harm myself.",
   "created_utc": 1694675518,
   "score": 30,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipkqm",
   "message": "I'm not afraid to kill myself. I can't do it just thinking about my family.",
   "created_utc": 1694674812,
   "score": 11,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ir2cm",
   "message": "Honestly, my nieces and nephews, and my dogs. I have struggled with suicide ideation for a good many years. It went away for a while but this year came back with a vengeance. I don’t have much of a family life at all, and due to a recent move for work I don’t really have a social life either. It’s kindof sad that if I were to die right now, the only reason anyone would know would be because I’m a store manager and if I stopped showing up to work that would be the giveaway that something was wrong. Otherwise, no one would notice for a long time probably.",
   "created_utc": 1694675915,
   "score": 12,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipc9a",
   "message": "I think i'm too arrogant to ever willingly kill myself.",
   "created_utc": 1694674637,
   "score": 9,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irrjo",
   "message": "Scared of pain",
   "created_utc": 1694676455,
   "score": 8,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ivdqb",
   "message": "I bought some DJ decks and started mixing drum and bass. Now, I am very popular and do shows all the time. I'm glad I found djing when I did, honestly changed my life.",
   "created_utc": 1694679347,
   "score": 11,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ivoa1",
   "message": "revenge, a knowledge that if i killed myself someone would get rid of me, whereas if I didnt I could exist and enact my revenge to those who wronged me",
   "created_utc": 1694679585,
   "score": 8,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ixfoo",
   "message": "I was sitting in a kids playground late at night and I had my pills and my water bottle in hand. I thought to myself ''I will close my eyes and pick a number on my phone. If they answer I will stop and if they wont I will do it'' don't ask me why I chose this but I did. It ended up falling on an old friend that I wasn't very close with. He ended up answering my call and in a calm manner told me to stop and talked to me. He still doesn't know how bad of a state I was in and the circumstances into why I was calling him but he saved my life.",
   "created_utc": 1694680995,
   "score": 9,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j0ym8",
   "message": "Knowing that my cat would either starve in the flat or be taken to the shelter. I was off to get myself situated on some train tracks right after a curve, where the trains went insanely fast and looked at her... I could not just throw away the one best thing that I've ever had, the only being that loved me no matter what.",
   "created_utc": 1694683811,
   "score": 8,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j14hj",
   "message": "My pet birds would be sad",
   "created_utc": 1694683938,
   "score": 10,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipq3h",
   "message": "Having a reason to not do it is part of why I make a lot of short term future plans to go to things (usually buying concert tickets). It makes me feel like 'I can't do it yet, I still have that thing I was looking forward to next month'.",
   "created_utc": 1694674921,
   "score": 18,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iussj",
   "message": "I’m fat and I don’t want my fat body to be seen by anyone (like coroner, embalmer, etc)",
   "created_utc": 1694678872,
   "score": 21,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irnnk",
   "message": "Couldn't pull the trigger while my dog was watching. Couldn't shoo him away because he loved me enough to stay by me in my sadness.",
   "created_utc": 1694676370,
   "score": 7,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iym2p",
   "message": "I wanted to slit my throat, but the instructions were too confusing \u0026amp; it said that I would have to wait 2 minutes or so to die + it would be painful.\n\nI ended up just cutting myself lol",
   "created_utc": 1694681940,
   "score": 8,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j0ysj",
   "message": "I don’t want my loved ones to hurt",
   "created_utc": 1694683814,
   "score": 6,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j3fko",
   "message": "So I've attempted before. I was having another bad episode. My mom came in my room one night, I was depressed, she was depressed. We talked. She told me if I were to kill myself, she'll consider it as well, because she had suicide thoughts from time to time too. I was shocked, I don't know if she said that so I wouldn't off myself or if she was serious, but it's something I wouldn't want to risk. At the time, my little sister was 7. I do not want to put her through that trauma, she looked up to me, ya know. So my mom and I promised to live for each other. \n\nIt's been 3 or 4 years and we're doing better now.",
   "created_utc": 1694685714,
   "score": 7,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j6wkm",
   "message": "My mother. I couldn’t do that to her",
   "created_utc": 1694688148,
   "score": 6,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j87xu",
   "message": "My stuffed animals as a teenager I didn’t want to leave them behind and lonely with nobody. I know dumb reason.",
   "created_utc": 1694689000,
   "score": 8,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipgzb",
   "message": "I dug deep into the deepest parts of my desires. I thought it was sad I'd probably never get to have a family or a child. To be a father.\n\nWhen my mother got pregnant I figured I'd stay alive long enough to witness her birth and welcome her to this earth. I was so depressed that prospect really never bothered me. What saved me then was, 3 days after staying at the hospital, I woke up to my crying sister. I rocked her to sleep and looked up in the mirror. I saw something I never thought I'd see. Wasn't how I wanted it but it was the same thing. I fell in love with my little sister and stayed alive.\n\nIt was no peace of cake afterwards. What she did was essentially disarm my ability to commit. I allowed her to drag me through hell's fires essentially. 2 years later I had my first date, a week later my first kiss. It all slowly added up to the point I'm at now. A shit ton wiser and far more desire to live.",
   "created_utc": 1694674735,
   "score": 24,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iws5b",
   "message": "My kids and my religion (Catholicism) for a small part. \n\nThe belief that I'm like a cockroach who will survive no matter what happens is the big part.",
   "created_utc": 1694680469,
   "score": 7,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j6zpp",
   "message": "It once crossed my mind. My son was about 2 months old at the time and he was in my arms. \nI knew that if he had a mum that did that, I’d be ruining his life before it even started. \n\nIt took a couple more months but I finally mustered up the strength to call the GP any it was one of the best things I ever did.",
   "created_utc": 1694688207,
   "score": 6,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jhke5",
   "message": "No matter how bad of a loser I am, but I'm a fighter and wanna die like one.",
   "created_utc": 1694694102,
   "score": 6,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iu989",
   "message": "If you have ever seen what the loss of person to suicide does to the survivors.  No pain you are going through is worth the pain you will inflict on your loved ones.",
   "created_utc": 1694678432,
   "score": 14,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ipgb8",
   "message": "I read a book once where the character commits suicide by jumping off a bridge and regrets it after he jumps but it’s too late, always stuck with me",
   "created_utc": 1694674721,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itlgt",
   "message": "The realization of knowing  I only have one life. Pain can be horrific. There was little hope in where I was, but things change. Suicide doesn't change. Please, Please reach out. Even if you feel nobody cares, this stranger on Reddit cares. Call a hotline, call 911, get help. I understand pain. Life may seem like nothing but pain, but there is good stuff out there. Just live day to day.",
   "created_utc": 1694677903,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itt31",
   "message": "Sheer stubbornness honestly. I was tempted to try killing myself in a lot of ways, but in the end I wouldn’t give my crappy family that victory.",
   "created_utc": 1694678069,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iuz7p",
   "message": "I kept telling myself I had to figure out how Kingdom Hearts ended and promised not to kill myself until after I played 3.\n\nAfter finishing 3, I stepped onto my balcony and realized in that moment, I probably should have just fucking killed myself.\n\nI'm good now though.",
   "created_utc": 1694679018,
   "score": 4,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iv8ns",
   "message": "Hope",
   "created_utc": 1694679231,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iwina",
   "message": "the berserk manga, it made me feel like I have value and a purpose",
   "created_utc": 1694680257,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iwj2e",
   "message": "I wanted to hang in there long enough to find out what happened to Han Solo after Empire Strikes Back. By the time Return of the Jedi came out, I was no longer as depressed as I had been previously.",
   "created_utc": 1694680265,
   "score": 6,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iyf4j",
   "message": " I was so not in the mood to do anything that i couldn't do even that",
   "created_utc": 1694681783,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j0nr6",
   "message": "Had a gun to my head ready to pull the trigger numbing the pain with heroin my door was locked (cheap hook latch) and somehow my dachshund that was my doggo at the time pushed it just enough to squeeze through and jumped in my lap barking like crazy. I miss that dog, any time I went to a dark place he was there in my face reminding me that someone had to feed him and if I left he wouldn’t get enough treats to survive.",
   "created_utc": 1694683574,
   "score": 4,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j109q",
   "message": "I knew how sad my Mum would be.",
   "created_utc": 1694683846,
   "score": 6,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j172v",
   "message": "I wasn’t quite at the stage of nearly acting on it, but thought to myself that it wasn’t a bad idea. However, these things really stopped me from the whole idea altogether.\n\n- Adopted two cats. Gifts from the angels above. Took care of them and became my best friends.\n\n- Friends and family. Of course, they were there to  support and I can’t just leave them behind.\n\n- Quarantine. I despised high school, so this was such a refresher and it let me breathe.",
   "created_utc": 1694683995,
   "score": 4,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jd0jo",
   "message": "Cowardice.",
   "created_utc": 1694691790,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jdlh9",
   "message": "I made a deal with myself at around 15/16 that death was a separate entity trying to beat me, and you cannot beat me, I mean really, I'm unbeatable mentally. So now everytime I feel down and hate life, I see that as a separate entity messing with my brain, and then my competetive arrogant brain kicks in telling myself they're not going to beat me. I decide when I die, and it will be old age, no one else.",
   "created_utc": 1694692099,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itcsx",
   "message": "I am a chicken! I am afraid that if I try to do it I would not do it correctly and I would suffer.",
   "created_utc": 1694677712,
   "score": 9,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ip1ni",
   "message": "The hospital and seeing how upset I made my loved ones.",
   "created_utc": 1694674420,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iqu4v",
   "message": "I was reaching for the bottle of pills I was going to take (I sat there for a while contemplating it and crying) and as soon as I reached for the bottle one of my friends called me and I talked to him about what was bothering me.",
   "created_utc": 1694675743,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itvoj",
   "message": "My dog. I was extremely depressed (undiagnosed bipolar disorder at the time) and debating it when he came up to me and licked my face and leaned on me. It was the most perfect moment.",
   "created_utc": 1694678128,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ivg36",
   "message": "My brother is in recovery from opioid addiction that came literal fractional inches from killing him. He’s been sober for 9 years now. I can’t do it to him and I certainly can’t do it to my mom after she came so close to losing him. My family has been through enough.",
   "created_utc": 1694679399,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ixrys",
   "message": "too lazy but ill get around to it someday",
   "created_utc": 1694681268,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j0y17",
   "message": "Honestly I can't put a finger on it but I guess I just kinda hope for better. My family is toxic, my friend stopped communicating,  my partner left me and I can't even make something of myself because I've trapped myself in addiction to gaming just trying to escape from the reality of being a failure and having everything against me. But I remain hopeful that maybe someday I can actually do something,  be something.",
   "created_utc": 1694683798,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j102k",
   "message": "My pets. I was super depressed and untreated. I wasn’t feeling suicidal in the moment but looking back, I was a bad day or two away away. I had no one in my life who I thought could care for my pets if I was gone. I got on anti depressants, got therapy, reduced my animal collection so I wouldn’t be so overwhelmed, and got better! My cat Jim is sitting right next to me and I love him so much it makes my tear up when I think about what might have happened to him. He’s an extremely anxious and neurotic cat so I imagine he would’ve spent his remaining years miserable.",
   "created_utc": 1694683842,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j6zqn",
   "message": "The thought of my best friends and how much it'd hurt them. How much it would hurt my parents.",
   "created_utc": 1694688207,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jbzm3",
   "message": "Video games stopped me from killing myself",
   "created_utc": 1694691235,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jhdpy",
   "message": "i know several people better than me who died young. i have to be the good old person they didn't get the chance to be",
   "created_utc": 1694694013,
   "score": 5,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jhu8m",
   "message": "The pain my family would suffer, knowing no one would be there for my furbabies. That's what stops me.",
   "created_utc": 1694694233,
   "score": 4,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iw0s0",
   "message": "My 4 year old daughter.. she’s got absolutely no idea how much she saved me and how much I need her.",
   "created_utc": 1694679855,
   "score": 6,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ip9sc",
   "message": "My mom and the thought of letting my family and myself down. AND I’ve come too far to stop now",
   "created_utc": 1694674587,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iqfa1",
   "message": "The idea of my family, specifically my parents, in mourning. Leaving a mess for them to clean up. I love my parents. My cat Zelda. I love her so much. I have a lot of love to give, I just don't always love myself, and it gets really hard sometimes. \n\nI'm great now, but I've had some really challenging times that have resulted in the need for a safety plan. I am lucky to have a supportive family. I'd say I'm alive because I have a supportive family.",
   "created_utc": 1694675433,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iqhed",
   "message": "While I don't think unaliving yourself is inherently selfish unless you are trying to control or punish people, I realized that all of my attempts have been done with the intent to control or punish people. So I vowed never to try again.",
   "created_utc": 1694675478,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irbgr",
   "message": "knowing what it feels like to be left behind by 5 family members and being a Mom. But every day I wish it was over.",
   "created_utc": 1694676106,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0irk1n",
   "message": "Well, I had developed depression at the age of 9 due to all the things I was going through. I think I had 11 maybe 12 suicide attempts until the age of 16. I went through a pretty rough breakup but I found someone who is literally a beam of light. She is teaching me how to see the world in a better way. I discovered my passion which gave me something to live for.\n\nI have gone around 3 years without self harming or attempting. Even though I get extremely depressed, I do what I’m passionate about and eventually I get through it.",
   "created_utc": 1694676289,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0isfhk",
   "message": "I can't put my mom through that much pain. I have a brother who died in a car accident and that loss almost destroyed us. I can't put my mom through another.",
   "created_utc": 1694676982,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0it871",
   "message": "A couple who didn't even speak English stopped me from jumping to my death. I'm not sure if they realize they did this. They were there and seemed just kind in general. I was a mess and knew I couldn't scar people like them for the rest of their life. I'm glad I didn't do it. Still extremely depressed. But not alone anymore.",
   "created_utc": 1694677612,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itadh",
   "message": "My aunt died of cancer and left 6 young kids without a mom. As much as I wanted to be done, I kept living for my daughter both because I love her and because I knew my aunt would do anything for more time with her babies.",
   "created_utc": 1694677659,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itdsj",
   "message": "I’ve spent my entire life battling depression. I’ve had many brushes with suicide. I have no idea what stopped me. It wasn’t family, friends, pets, careers, fear of death, or anything like that. I just… stopped. I got the bottle from the cabinet (a medication that would do the job pretty easily, not much chance for a screw up) stared at it for a long time, and a little voice of logic in the back of my head said: “No. Go get help. Call the doctor.” I called my family physician because I didn’t know who else to call. He helped. Got me back on my feet. It wasn’t the first time; it wasn’t the last time. But every time, I said, “No. This isn’t it.” It’s a permanent solution to a temporary problem. Yes, depression has been with me all of my life, so it’s not really a “temporary” problem, but I am glad I hung on, because times got better. Then they got worse, but then they got better again… and I hold onto that hope.",
   "created_utc": 1694677735,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itjus",
   "message": "Knowing that my dog would be sad and confused about where I went",
   "created_utc": 1694677868,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itqsw",
   "message": "I was close. The sweet scrunched nose smile from my daughter wouldn't let me try. Have to be better than that. It worked out well.",
   "created_utc": 1694678020,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itxrv",
   "message": "Fear. I just couldn't do it.",
   "created_utc": 1694678175,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0itzaj",
   "message": "Realizing it’s a selfish thing to hurt my family and everyone that cares about me. I changed my mindset to where I believe one day everything will be better if I work hard for what I want and who I love.",
   "created_utc": 1694678209,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iu12g",
   "message": "Not sure I ever really wanted to kill myself. Might of thought about it a few times. But never been one to act on negative thoughts or feelings in that manner.",
   "created_utc": 1694678249,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iu4eo",
   "message": "My rational thoughts. Always over thinking everything.\nThe though is there constantly, the rational thinking wins every day.\n\nI wonder what would tip me over, enough has happened in my life. If something ever does, it will not take long to to take effect.\n\n\nDon't worry people I am okay, I don't think there is anything able to seriously push me over the edge.",
   "created_utc": 1694678324,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iu904",
   "message": "Our pets and reading",
   "created_utc": 1694678427,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iub7y",
   "message": "When I found out that I don't want to kill myself, but I'm just looking for an escape from situations that I can't change/solve.  I have to do my tasks and stay sober, then I will stay alive.  Every day is a battle.",
   "created_utc": 1694678476,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iugr1",
   "message": "A girl",
   "created_utc": 1694678599,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iujnc",
   "message": "100% my cats. Now one's missing and the other one died this year. But I'm in a much better place now!",
   "created_utc": 1694678664,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iuo8s",
   "message": "I have family that loves me. I wouldn't want to put them through that. But sometimes that thought still crosses my mind....",
   "created_utc": 1694678768,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iuosz",
   "message": "Don’t want to leave people behind… I feel like people might depend on me for certain things so I don’t want to cause them a inconvenience… sounds really sad when you write it down.",
   "created_utc": 1694678780,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iv22h",
   "message": "Hm. I've got a couple, actually.\n\nOMORI. The game. Changed my life. Saved it, too.\n\nMusic, in general. A few good friends of mine as well.. shame we're not friends anymore. Still. And, I lost family at a young age. I have a little brother who would be destroyed if I disappeared. I honestly don't really like him but I know that pain. I couldn't kill myself knowing he would never be the same.",
   "created_utc": 1694679082,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iv3h2",
   "message": "Because someone needed me, and if I killed myself it was very likely they would as well.",
   "created_utc": 1694679114,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iv6eo",
   "message": "Knowing that my brother passed already and I’ll be leaving my younger sister to deal with the same pain that experienced before she was even born.",
   "created_utc": 1694679180,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iwbtv",
   "message": "When I read. \"When you die from suicide, you don't end the pain, you transfer it to someone else\" ... and I couldn't ruin my daughter's life like that, and I've been on the up swing ever since. Doesn't mean it's not hard sometimes, but after reading that, well that pretty well disengaged the feelings of that being a possibility. If you're reading this, I love you too, you are loved.",
   "created_utc": 1694680105,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0iwfel",
   "message": "My loved ones, especially my mom.\nI couldn't do that to them",
   "created_utc": 1694680184,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0ixlg3",
   "message": "I was working on a farm in outback nsw and you see dead sheep with their eyes and ass eaten and pulled apart by crows I didn't want that to happen to my body I don't really suffer from depression I was in psychosis at the time from taking a new prescription steroid for another issue",
   "created_utc": 1694681123,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j06ym",
   "message": "I heard a lady on the radio who always found a reason not to. Reasons like: I still have some milk left, I will finish that today and do it tomorrow. On the day she planned to do it she heard that a new season of South Park was coming soon and she genuinely felt that South Park was the only thing that made her happy, so she waited for the new season. In the meantime she was able to work on herself and she eventually didn’t do it.",
   "created_utc": 1694683213,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j0yu4",
   "message": "My partner \u0026amp; parents\n\nThe only thing right now stopping me from taking an ungodly amount of sleeping pills is knowing how much it would hurt them",
   "created_utc": 1694683816,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0j5oou",
   "message": "Lack of courage.",
   "created_utc": 1694687322,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jjxrm",
   "message": "Easily, the one thing that stops me from killing myself is how much it would absolutely devastate the people that care about me. I think about it almost every day; how the people I love would react if they walked in on my corpse. Or how they would react to the news of my death. It makes me cry every time, too lol.\n\nI know that I’m so so fortunate to have people in my life that worry about me like that, because not everybody is *nearly* that lucky. And I always feel so selfish whenever I feel that way.\n\nLuckily I’m out of that funk, and in a much better state currently.",
   "created_utc": 1694695232,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jk1x8",
   "message": "The idea of leaving my dog alone.",
   "created_utc": 1694695286,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jk23w",
   "message": "Pets. If I did not have my pets I would of long been gone.",
   "created_utc": 1694695288,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jk59v",
   "message": "I don't know. I remember I had it planned out. My parents were at work so no one would be home but me for over 8 hours. I knew exactly where in the house the chemicals I needed were. Right underneath the kitchen sink. I saw no future for me. I had no reason to believe that anything would get better. I hated being alive. But when the time came, I sat on the floor with the chemicals in front of me and I.... I couldn't do it.  And I don't know why.  I didn't feel fear. I didn't care if death impacted anyone. \n\nBut I couldn't do it. No voice in my head. I don't pray to any Gods. But I just sat there looking at these chemicals. I didn't question myself but I just at there. And eventually just put them back.  To this day, my parents have no idea.",
   "created_utc": 1694695328,
   "score": 3,
   "submission_id": "16ib663"
  },
  {
   "comment_id": "k0jes24",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16ib663"
  }
 ]
}