{
 "submission_id": "16ik1jn",
 "title": "What's something people do that you've never been able to understand?",
 "selftext": "",
 "created_utc": 1694701993,
 "permalink": "/r/AskReddit/comments/16ik1jn/whats_something_people_do_that_youve_never_been/",
 "score": 216,
 "url": "https://www.reddit.com/r/AskReddit/comments/16ik1jn/whats_something_people_do_that_youve_never_been/",
 "comments": [
  {
   "comment_id": "k0k1an0",
   "message": "Talk bad behind people's back and then later on laugh with them when they are together",
   "created_utc": 1694702284,
   "score": 70,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kqpyb",
   "message": "Talking in public on the phone with the speaker on. I really don't want to know your business.",
   "created_utc": 1694711299,
   "score": 225,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ki2kl",
   "message": "Cheating.   Either work on your relationship or leave.  It is pretty simple.",
   "created_utc": 1694708261,
   "score": 104,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k940d",
   "message": "People who start drama just to start drama. I mean, I know why the do it. I just don’t understand it. I hardly talk, much less start arguments.",
   "created_utc": 1694705100,
   "score": 33,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kkd21",
   "message": "I've never understood the habit of leaving shopping carts randomly in parking lots instead of returning them to designated areas. It takes so little effort, yet some choose not to do it, creating chaos in parking lots.",
   "created_utc": 1694709066,
   "score": 246,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0knvmt",
   "message": "People treating arguments like there’s a Winner and a Loser is the primary reason for the state our social structure is in nowadays. It drives people to double down on their insane ideas because we as a whole have shown that we give winners absolutely everything, and we socially bury losers; so why admit when you’re wrong when the other side has shown you that they’ll leave no ground for you to stand on?\n\nArguments don’t have Winners \u0026amp; Losers, they’re an opportunity for one person to teach something to another, and for that other person to learn something. There should be no shame in admitting when you’re wrong, and there should be no gratification when knowing you’re right.",
   "created_utc": 1694710303,
   "score": 216,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k0sxm",
   "message": "Why do people make things purposely worse for other people..... It's the biggest mystery of my life to me.",
   "created_utc": 1694702104,
   "score": 76,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0l0txn",
   "message": "Anyone that can hurt a child or an animal.  Like I don't know how any one could get mad enough to ever justify it.\nSo maybe I don't understand mental illness....",
   "created_utc": 1694714820,
   "score": 143,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kflyp",
   "message": "Change their phones every other year. While those \"first\" phones are in totally working condition with no issues, just because \"this one just released recently with new specs\"",
   "created_utc": 1694707388,
   "score": 154,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kr90m",
   "message": "Spending thousands to turn a perfectly normal truck into a brodozer. What an expensive way to tell everyone you're an asshole.",
   "created_utc": 1694711470,
   "score": 156,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kd9mk",
   "message": "Littering, especially where you live. Not that I understand why anyone litters in the first place but my wife grew up in section 8 housing (which her parents still live in).\n\nI realize it's a poor neighborhood but anytime we visit it's just so full of trash everywhere. The parking lots, the yards, etc. Broken glass, garbage,  just everywhere.\n\nLike I don't understand why people don't have any pride about where they live. Why do you want to live in trash? I find a piece of trash that the wind blew into my yard and I immediately pick it up. I just can't picture walking up to my house and being like \"this is fine\" while I navigate around trash.\n\nI suppose in that case is more a matter of more people that don't care vs. people that do. Organize a cleanup and it'll just be trashy again in two weeks I'd imagine.",
   "created_utc": 1694706575,
   "score": 95,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kaj4y",
   "message": "This isn't earthshaking or anything but I saw it yesterday again so it was on my mind. \n\nI don't understand why some people will lean halfway out their car window when they drive. I'm not talking just their arm; it's their arm, shoulder and half their head. I understand trying to cool off but it looks incredibly awkward and possibly dangerous. It seems to be mainly people that drive full sized trucks that I see do this but the one yesterday was a Toyota Echo.",
   "created_utc": 1694705606,
   "score": 37,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0lbgu1",
   "message": "hurt any vulnerable or innocent being. animals, the elderly, children, people with disabilities whether it be physical or mental… i could go on.\n\n##who you are as a person can easily be shown depending on how you treat those who might not be able to do a thing for you in return.",
   "created_utc": 1694718559,
   "score": 35,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0l9kio",
   "message": "Video themselves crying/posting a depressing looking profile picture\n\ngiving food to the homeless but having a camera out so you can virtue signal to the world\n\nbeing someone you're not, whether it's irl or on the Internet",
   "created_utc": 1694717893,
   "score": 49,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0l83zc",
   "message": "Minding other people's business. Worrying about whether somebody else's grass is too tall, or if they're dressed appropriately for church/work/whatever.\n\nLike who cares? Tend to your own business, that's not enough for you to deal with?",
   "created_utc": 1694717384,
   "score": 16,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kox8h",
   "message": "My friend steals. \n\nShe has a job, a large savings, yet she steals. She is not poor by any means. And it’s always small stupid stuff like polaroid film or some clothing. I always ask her- is it worth ruining your life to get something that’s $60 for free? She steals from places like target where they most likely know she is stealing and probably going to catch her at some point. I’m done lecturing her about it, I really don’t care anymore if she gets caught.",
   "created_utc": 1694710667,
   "score": 51,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k8ntl",
   "message": "I have a friend who has been with 45 guys (she's started going back to her exes because she doesn't want to hit 50). This girl has NEVER gotten off in her life. I don't get why she's hooking up with these guys. It's not for any sort of emotional connection because she barely knew most of the guys. It's not for any sort of physical satisfaction. What is it?\n\nAnd while her situation is extreme, I have other friends who hook up with random guys and, more often than not, they don't get off either.\n\nWhat is the appeal of fucking randos if you're not getting off most of the time?",
   "created_utc": 1694704942,
   "score": 170,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0mxz8p",
   "message": "People who uses AI girlfriend apps (Like MUÄH AI), why can't they just get a real girlfriend thats actually real?",
   "created_utc": 1694741225,
   "score": 52,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ksppd",
   "message": "Spend more than $5k on a wedding. Best weddings I’ve ever been to were simple backyard parties.",
   "created_utc": 1694711980,
   "score": 76,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0khdi3",
   "message": "Continuously voting against their own interests in favor of feeling accepted in an echo chamber/cult. Also the need to have a scapegoat for anything rather than accepting any form of responsibility.",
   "created_utc": 1694708017,
   "score": 56,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kqj1c",
   "message": "Not follow the most basic rules of the road. Or wear seatbelts.",
   "created_utc": 1694711233,
   "score": 26,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ke3xz",
   "message": "Meth and heroin. I understand addiction, but just trying these two things I just don't understand.",
   "created_utc": 1694706863,
   "score": 64,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kk1zv",
   "message": "Willful ignorance.\n\nLike, I guess I understand why people practice it? But I don't really understand *how* they practice it, or how or why they would deny practicing it when it's pointed out that they do.",
   "created_utc": 1694708958,
   "score": 11,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kyixm",
   "message": "\\-play the lottery multiple times a week.  i live in a shitty neighborhood and all the gas stations i go to, i always have to stand behind at least 2 or 3 people buying like min $20 in lottery tickets.  all these people are poor as fuck, it's just sad to see.  also i have a family member addicted to the lottery. dude is literally homeless because he spends his WHOLE paycheck on the fucking lottery.  its SOOO stupid. \n\n\\-buy doordash, ubereats, etc multiple times a week.  the food is always shitty and waaaay overpriced.  i just don't get it. \n\n\\-buy a new phone every year, or 2.  phones last 3-4yrs no problem these days.  if the battery is shit, then just get the battery replaced.  no reason to buy a whole new phone. \n\n\\-buy a new car every few years.  cars should also be able to last you at least 10 years, replacing them ever few years, like people that lease cars.  i just don't get it.  nobody cares if your car is a 2020 or a 2018 or a 2023.",
   "created_utc": 1694714013,
   "score": 43,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k6mrb",
   "message": "I actual posted this question a couple days ago on another thread, I do not understand why people get angry, vindictive, nasty, and mean whenever they're caught in a lie.  It makes no sense, they should be angry with themselves, not who they lied to.\n\nWhile I did get good answers I still don't really understand it though.  I may not ever.",
   "created_utc": 1694704213,
   "score": 19,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kq7t4",
   "message": "How do people seriously not know how to follow the rules of the road. THERE ARE RULES. its not like a big guessing game where we dont know what tf to do they literally give us an instruction book and 2 tests before we start driving and people STILL DONT GET IT!!",
   "created_utc": 1694711124,
   "score": 9,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k36mp",
   "message": "People who force their beliefs on others.  You have a right to have your own opnion no matter how counter to facts and science it is, but you have no right to impose your christo-fascist views on others through laws just because your politicians used gerrymandering to stay in power",
   "created_utc": 1694702971,
   "score": 56,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0koffc",
   "message": "Get \"invested\" into sports as if they're part of the team.\n\nNo, Jerry, \"we\" did not win last night. The team, who has no idea who you are, did.",
   "created_utc": 1694710494,
   "score": 54,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kbimt",
   "message": "casual conversations, small talk.\n\nmy brain literally shuts down and is unable to form responses when I get put into social situations.",
   "created_utc": 1694705955,
   "score": 22,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kjljf",
   "message": "Hate people just because they are different than themselves.",
   "created_utc": 1694708798,
   "score": 24,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0lqm0z",
   "message": "i dont get how people torture other people. Inflict physical pain for pleasure. That shit is just wild to me.",
   "created_utc": 1694723894,
   "score": 7,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0md7uw",
   "message": "Someone that watches something on their smart phone at full volume in the middle of a restaurant.",
   "created_utc": 1694732549,
   "score": 7,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0me2b9",
   "message": "Pedophila",
   "created_utc": 1694732911,
   "score": 6,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kv2nu",
   "message": "Complain about xyz being terrible in their life (bad relationship, shitty job, toxic family members/friends, etc) then do nothing to fix it just to keep complaining about the same stuff for years and years.",
   "created_utc": 1694712804,
   "score": 12,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0l34qy",
   "message": "Be mean to innocent people",
   "created_utc": 1694715636,
   "score": 7,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0lf4ti",
   "message": "Not wasting your hands after using the bathroom. Even post pandemic",
   "created_utc": 1694719858,
   "score": 6,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k0o31",
   "message": "Start fights with people much taller and heavier than they are.",
   "created_utc": 1694702054,
   "score": 18,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k7ir5",
   "message": "Look a person straight in the face and lie. I've never done it, never will, and I don't understand how people can without guilt swallowing them on the spot.",
   "created_utc": 1694704536,
   "score": 20,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ki2og",
   "message": "I do not understand why people by pants that already have significant holes in them.  There are some jeans I see that are 40% missing.  That's just crazy to me.",
   "created_utc": 1694708262,
   "score": 17,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kr4sc",
   "message": "Watch reality tv.",
   "created_utc": 1694711429,
   "score": 16,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ktgly",
   "message": "Bagging up the dog poop and then leaving it on the ground. There is no poop clean up team people, now you have just added litter to the poop.",
   "created_utc": 1694712241,
   "score": 19,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kz1se",
   "message": "Buy a vowel on Wheel of Fortune. Never understood that. I mean there are only five vowels so it would be easy to guess where they are. Why spend your money on that?",
   "created_utc": 1694714193,
   "score": 11,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ke6ti",
   "message": "Coming to a complete stop in the exit of a store to look at their phone, check their bags, talk to their kids, etc.",
   "created_utc": 1694706890,
   "score": 6,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0l5h36",
   "message": "I used to understand being afraid to get older, but once I turned 30 that disappeared. I’ve known a few people who died young as well, and some of them didn’t make it to 25. \n\nIt’s a privilege to get old.",
   "created_utc": 1694716455,
   "score": 5,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0lfq9i",
   "message": "Leave trash everywhere. It really isn't that hard to wait until you find a trash can.",
   "created_utc": 1694720071,
   "score": 6,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ltb36",
   "message": "Littering. Don't be a cunt. Put it in the bin",
   "created_utc": 1694724843,
   "score": 5,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0mdyx4",
   "message": "Drive and look at their phone.",
   "created_utc": 1694732872,
   "score": 4,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0mhluo",
   "message": "General lack of situational awareness, whether it's stopping as soon as you step off the escalator, or rushing the door before people have a chance to leave the train, or walking 4 abreast on a sidewalk, or blocking a crossing intersection while stopped at a red light. Literally everyone's day - including your own - will go more smoothly if you just pay attention to your surroundings.",
   "created_utc": 1694734431,
   "score": 5,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kosbw",
   "message": "Support Russia in its overt war of conquest.",
   "created_utc": 1694710620,
   "score": 12,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k250e",
   "message": "Complain about not having money then the next pay cheque hits and they spend it all just to complain again about not having money",
   "created_utc": 1694702596,
   "score": 22,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k8kd1",
   "message": "Being racist, I get it that there are shitty people but is not due to their skin color dude, they're just individually shitty.",
   "created_utc": 1694704907,
   "score": 15,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ks36u",
   "message": "Getting back with exes. All my exes no matter how good of terms we left on im not taking you back go the fuck away",
   "created_utc": 1694711763,
   "score": 11,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kk9on",
   "message": "At this point? Buying crypto/NFTs - though I do think there are potentially legitimate applications when it comes to the general blockchain technology.",
   "created_utc": 1694709033,
   "score": 8,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kmpb3",
   "message": "How a mom can hate their ex more than they love their kids. Usually by denying access to their children knowing it’s the only thing that will hurt them. \n\nI want to tell my nieces mom. I hate my brother too. I understand why you hate his stinking guts. He’s an asshole. I hate him but I put it aside for the benefit of the kids. My brother and I don’t speak to each other but guess what when the kids are around we put that aside for the two days they are with us and act like a normal family. As soon as they leave we don’t talk to each other. It’s not hard. \n\nYeah, he broke your heart. I get it. But that was 14 years ago. Let it go. There are two more important things (your kids) that need to be attended to.",
   "created_utc": 1694709893,
   "score": 8,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kmuqj",
   "message": "Dream about their wedding and what dress they will wear \" all of (their) lives\".\n\nNot judging but I sincerely just don't get it.",
   "created_utc": 1694709945,
   "score": 8,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kxcd9",
   "message": "Just playing with people’s emotions for tf of it.",
   "created_utc": 1694713602,
   "score": 7,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0l3avi",
   "message": "Be mean to innocent people",
   "created_utc": 1694715696,
   "score": 4,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0lnwum",
   "message": "Believe everything they're told without question.",
   "created_utc": 1694722944,
   "score": 5,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0lo473",
   "message": "Stand behind you to the point you can feel their breath,  ride your bumper when driving, have your phone on speaker when talking to someone in a store or out and about, not using their turn signal, walk through other peoples yards",
   "created_utc": 1694723016,
   "score": 4,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0mbazw",
   "message": "Be mean to their children. I just don’t understand why you wouldn’t want to be Mr. Rogers all the time",
   "created_utc": 1694731744,
   "score": 4,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0mbikz",
   "message": "cheat. just leave the person if you dont want to be with them",
   "created_utc": 1694731832,
   "score": 3,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k1922",
   "message": "victim blaming.\n\nnow im aware that society is getting better with this and learning not to do it, but the fact people do it at all period anyway to begin with.",
   "created_utc": 1694702268,
   "score": 19,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kjnqw",
   "message": "Talk on speaker phone when in public",
   "created_utc": 1694708819,
   "score": 9,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k53o3",
   "message": "Clapping when the plane lands and standing up asap",
   "created_utc": 1694703658,
   "score": 12,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0ka97i",
   "message": "Injecting hard drugs",
   "created_utc": 1694705509,
   "score": 10,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0k8ekk",
   "message": "Working class people voting Conservative",
   "created_utc": 1694704849,
   "score": 49,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0kqe9y",
   "message": "Smoke cigarettes",
   "created_utc": 1694711187,
   "score": 3,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0l39pa",
   "message": "Smoke cigarettes.",
   "created_utc": 1694715684,
   "score": 3,
   "submission_id": "16ik1jn"
  },
  {
   "comment_id": "k0llu2a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16ik1jn"
  }
 ]
}