{
 "submission_id": "16ip2yq",
 "title": "What negative aspects of being a male exist?",
 "selftext": "",
 "created_utc": 1694714033,
 "permalink": "/r/AskReddit/comments/16ip2yq/what_negative_aspects_of_being_a_male_exist/",
 "score": 40,
 "url": "https://www.reddit.com/r/AskReddit/comments/16ip2yq/what_negative_aspects_of_being_a_male_exist/",
 "comments": [
  {
   "comment_id": "k0l84fv",
   "message": "There's more pressure to always be strong and in control.",
   "created_utc": 1694717388,
   "score": 133,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lcgwo",
   "message": "Even if you wouldn't hurt a fly, bad men have made others feel unsafe around you in certain contexts.\n\nLike I'm a 6'3\" dude, so if I'm walking down the street at night and there's a woman a short ways ahead, I know damn well she's both aware, and slightly paranoid of, my presence. You can't say some crazy shit like \"Oh don't worry, I'm one of the good ones\" though, as that gives seriel killer vibes.\n\nSmall stuff like that really sucks, as there's not really a solution.",
   "created_utc": 1694718917,
   "score": 86,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l6edu",
   "message": "I brought my niece to the park once and was asked by a woman how old my daughter was, I laughed and said \"oh she's almost 5 - but she's not my daughter. \" She got  a weird look on her face and then walked away, police showed up 10 minutes later and started giving me the gears - assuming I had kidnapped her.",
   "created_utc": 1694716782,
   "score": 173,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l3a95",
   "message": "Opening up and being vulnerable gets used against you unfairly at some point",
   "created_utc": 1694715690,
   "score": 82,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0larxv",
   "message": "First choice to be sent to a war, last choice for spot in a life boat of a sinking ship.",
   "created_utc": 1694718318,
   "score": 195,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l30sv",
   "message": "Inherent distrust, or, the automatic assumption that you're a bad person.",
   "created_utc": 1694715599,
   "score": 95,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l3i97",
   "message": "Physical affection. Older men are piriahs. Yet we still need touch. The older you get, the less anyone will touch you. A hug. An arm around a shoulder... All gone.",
   "created_utc": 1694715769,
   "score": 175,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0kyrz6",
   "message": "Wouldn't you like to know, weatherboy?",
   "created_utc": 1694714098,
   "score": 251,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l26in",
   "message": "I wonder if life would be a little better if the g-spot weren't up my ass.",
   "created_utc": 1694715299,
   "score": 127,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lapuc",
   "message": "- Everyone think you like Cars, Sport, Slutty Girls. You are always \"a man\". Real man do that and this. What you like Romantic Movies? You are gay i guess.\n\n- No compliment in my whole 35 Years from a Girl. I got 2 from other Man and i still remember Them deeply.\n\n- A man is only something worth if you provide a worth to others. You dont love a man for him just be a man. And i dont just mean it in a romantic way. Your Family say it to. Work, work, build a house, get a wife, get children and work for them. Never just work just for you. I told my father that i work now 4 days to have more free Time and he thinks i am crazy. I love him but the first think he ask me when i meet him is how is work doing. Not how i am doing. \n\nI think both genders have there ups and downs but sometimes i just feel so bad just becouse woman look at me and think i am just a man that look at there ass or something. I dont do that. I onow most man do it and i think it is not cool. If i walk home in the dark and a woman is infront of me i sometimes take a longer route just that she is not scared that i walk behind her. But as a said... a woman also has a lot to carry. You all should judge more on ppls action and less on there Gender or Skin Colour or what ever.",
   "created_utc": 1694718297,
   "score": 77,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l7kmk",
   "message": "I mean, to be totally blunt, men by and large are considered the “disposable” gender. And it hurts.",
   "created_utc": 1694717194,
   "score": 118,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l9nj7",
   "message": "You run into a ton of guys who think they're alpha males and everything is a competition. You can't just exist in a space with some men without it being a who's manlier competition. A women enters the room and suddenly he's pointing out every flaw about you \"as a joke\" at every opportunity. \n\nIt's best to just ignore the childishness but if you have too many of them around you in your life or workplace it can be fucking exhausting.",
   "created_utc": 1694717923,
   "score": 216,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l2omn",
   "message": "Having limited choice of clothing/shoes/accessories\n\nEdit: Even if there were \"unlimited\" choice, will shoe and clothing designers make and sell items for bigger sizes more often? For example some designer shoe makers end their women's shoe size at women's 10. Some of the men are very tall and have very big feet while others have moderate height and foot size.",
   "created_utc": 1694715478,
   "score": 108,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l5458",
   "message": "- We have draft cards\n\n- There is a societal expectation to be a bread winner / pay for things \n\n- much higher Suicide rate\n\n- Much higher incarceration rate\n\n- male pattern baldness\n\n- shorter life spans\n\n- We always get the short end of the stick in child custody court cases\n\n- we never get complimented \n\n- constantly being told by young people that we are the problem with the world\n\n- when we watch our own kids it’s “babysitting”\n\n- when women have jobs that are primarily male, it’s empowering.  When men have jobs that are primarily female, it’s emasculating.",
   "created_utc": 1694716328,
   "score": 72,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l3yvx",
   "message": "Loneliness, people care less for you, you don’t really get complimented unless you’re super attractive, greater expectations from women especially, some people look at you strangely if it’s just you out with the kids, nobody loves you unconditionally.\n\nAlso your balls itch, like, a lot. Did you know you can even crush them by sitting on them accidentally?",
   "created_utc": 1694715928,
   "score": 176,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lazjv",
   "message": "Loneliness.",
   "created_utc": 1694718392,
   "score": 118,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l1iq1",
   "message": "Everyone expects you to \"man up\" and push through",
   "created_utc": 1694715065,
   "score": 157,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lvlan",
   "message": "Any general kindness to anyone is taken as an attempt to have sex with them. If you are large, people are afraid of you. So if you're big, be kind, right? See my first point. It's a negative cycle. \n\nUntil people have had a genuine conversation with me, they assume I'm either violent or a predator, based entirely off of the actions of shitty men.",
   "created_utc": 1694725665,
   "score": 36,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l1pzf",
   "message": "No one trusts you around kids. You can't just go to a playground as a single man and watch kids play because you think they're interesting to watch. And good luck getting work as a babysitter or in any sort of childcare. Even just being something like a Kindergarten teacher would be an uphill battle.",
   "created_utc": 1694715137,
   "score": 155,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0kzist",
   "message": "the loneliness \n\nit’s crazy to see trans people FtM completely lose their mind about how people treat them now",
   "created_utc": 1694714357,
   "score": 234,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lw9z6",
   "message": "The gender equality conversation never acknowledges the manual labor that is 90-95% male dominated. With respect to women's rights and workplace equity, the conversation is extremely selective to the detriment of men.",
   "created_utc": 1694725915,
   "score": 79,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lsmcu",
   "message": "The fact that too many people deny misandry exists.\n\nYou're defaulted as a sexual predator.\n\nYou're considered worthless if your income's low.\n\nSociety has no empathy for your suffering.",
   "created_utc": 1694724603,
   "score": 56,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lnfls",
   "message": "It generally takes much longer to get into relationships, especially over online dating. (For 15/17 women in my social circles who were looking for potential long-term partners over online dating since 2020, it took between one and two weeks to find partners. This is true regardless as to body shape, income, employment status, etc. For the men I know, it takes much longer.) I'm an ugly but awesome dude who had no real problem dating when I could get to know people over months-to-years, but, post-university, I've had to rely on online dating and it has been just brutal. I've been single for most of the last eight years and nearly checked out over it multiple times.\n\nAlso, relatedly, incredible loneliness and the lack of physical touch.",
   "created_utc": 1694722779,
   "score": 25,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lcdaj",
   "message": "Just general physical intimacy (not just for sex). It's nice to be hugged and touched too, not in a sexual way. Men don't have licence to do that generally and that's just sad. I think a lot of angry men out there would benefit from a hug once in a while.",
   "created_utc": 1694718882,
   "score": 75,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lafl7",
   "message": "Specifically being a middle aged white male:\n\nHighest rates of suicide. \n\nWatch out for your friends folks.",
   "created_utc": 1694718195,
   "score": 70,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0ly832",
   "message": "I'm not sure how many people experience this but it almost feels socially dangerous to be attracted to a female? \n\nExample: Before I met the girl I am with now, I would go to my local barcade(I still do. But just to drink and game with friends) and sometimes would meet a really cool girl and she would join our group for the night and we would all just hang and be people. Yadda yadda. There's been times when I kinda developed an interest in someone and wanted to ask for their number or whatnot. But I feel like it would be weird by today's standards. I'm not awkward, i'm not insecure, but when I had the thought to ask, something in my mind would tell me that it is a terrible idea. I'm not even afraid of being turned down. I just felt like if I were to ask, I would immediately be treated like a creep and the night would be ruined for everyone. \n\nThankfully I am happy and I have someone to love and who loves me. But I think that's something that some men may experience. (Maybe some women. Idk. I am not female).",
   "created_utc": 1694726626,
   "score": 45,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0ld765",
   "message": "Peeing with a boner",
   "created_utc": 1694719175,
   "score": 65,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0kyztz",
   "message": "No one likes us",
   "created_utc": 1694714174,
   "score": 74,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lxmmk",
   "message": "Loneliness is being mentioned a lot in here and I agree.\n\nI have a decent amount of friends and I do keep myself busy. But as time goes on, people care less and less, grow have lives, and for the most part it’s just a slow start towards what I see as being very lonely. At the lowest points it’s pretty anxiety inducing and sad",
   "created_utc": 1694726409,
   "score": 22,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lq4dt",
   "message": "More likely to have to pay for things. More likely to get kicked out of the house or charged rent by your parents at 18 'to be a man'.\n\nMy university had notably less scholarships and bursaries for male students (in humanities) than for females despite having about 10% higher female enrollment in those programs.\n\nLower availability of mental support or emergency services for males being domestically abused. \n\nIts certainly not that men get the short end stick on everything. We don't. But some people have drank so deeply from 'male privilege' talk they've forgotten that men, just like women, have their struggles too.",
   "created_utc": 1694723722,
   "score": 18,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l2axe",
   "message": "Getting scapegoating for everything.",
   "created_utc": 1694715342,
   "score": 68,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0ldccb",
   "message": "People don't care about your feelings or mental health",
   "created_utc": 1694719225,
   "score": 37,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l9h5z",
   "message": "Short answer.   No one cares about you.   \nLonger answer.   No one really cares about you.",
   "created_utc": 1694717861,
   "score": 49,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lam12",
   "message": "for me the body hair",
   "created_utc": 1694718260,
   "score": 44,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lrp41",
   "message": "Being told masculinity is toxic, getting accused of sexual harassment because you happen to glance in a woman's direction, oh and sitting on your balls. That shit is the worst.",
   "created_utc": 1694724276,
   "score": 45,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lqu6n",
   "message": "Trying to befriend other males who don’t know how to carry on a conversation.\n\nDude, I can’t interview you all night. Ask me something about me and then follow up my response with a question.\n\nAnd don’t always talk about work for fuck’s sake.",
   "created_utc": 1694723975,
   "score": 15,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0kz499",
   "message": "You sweat and smell quickly",
   "created_utc": 1694714216,
   "score": 42,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lya5a",
   "message": "“It is what it is”",
   "created_utc": 1694726645,
   "score": 15,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lherh",
   "message": "Being asked to open up about negative aspects of your life, just to then be reminded that it's all your fault. \n\nLike the sole purpose of this thread. Fuck off.",
   "created_utc": 1694720661,
   "score": 37,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0kz6yp",
   "message": "Responsibility, leadership, life, pressure, sensitive organs that hang out of the body, etc",
   "created_utc": 1694714242,
   "score": 30,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l42p3",
   "message": "You can’t take your kid(s) alone *anywhere* without getting looks - even though your kids are the love(s) of your life.",
   "created_utc": 1694715965,
   "score": 33,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lcrh8",
   "message": "The chances of non-attractive man to find a partner are much lower than those of a non-attractive woman.",
   "created_utc": 1694719022,
   "score": 30,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0kzsf5",
   "message": "Negative aspects of being male can include societal pressure to conform to traditional stereotypes, limited emotional expression, higher risks of specific health issues, potential limitations in parenting roles, work-related stress, underrepresentation in non-traditional fields, and pressure to display aggression in certain situations.",
   "created_utc": 1694714448,
   "score": 49,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0llpaf",
   "message": "That other men are over really competitive, im just not a very competitive person, and people try to tell me that's a bad thing? ofc sometimes im a little competitive who isnt. But overall im a pretty laid back guy and a lot of dudes just cant go 30 minutes without a pissing contest and i just dont care.",
   "created_utc": 1694722168,
   "score": 11,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lh0m3",
   "message": "The fact that people actually dare to or have to ask this question to start out with.\n\nNobody would have to think a second to think of issues women could potentially have, but men have to spell them out every time.\n\n(Don't get me wrong, women have unacknowledged struggles too, but at least they have some base problems that éveryone understands and at least supports them on.",
   "created_utc": 1694720522,
   "score": 27,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l8xd5",
   "message": "Modern boys and young men are at a massive disadvantage because they are paying for the sins of their fathers, and society is attempting to correct that with the younger generations. For example, schools and employers falling all over themselves to get women in STEM positions because, at the senior level, it’s highly male dominated. None of those senior level people are giving up their OWN jobs, they are just “fixing the problem” by hiring disproportionately high number of women in those junior positions, making it harder to be a young man coming out of college and getting into those fields. Any time you prioritize hiring one group you invariably deprioritize another. \n\nAlso something like 65% of college attendees are women but no one is talking about the need to get more boys on track for college or higher education.",
   "created_utc": 1694717669,
   "score": 49,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lgft5",
   "message": "Much higher chance to be lonely",
   "created_utc": 1694720321,
   "score": 10,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lppmc",
   "message": "A big one for me is kids. I’m a tall and muscular guy and people see me in public with my nieces, or little cousin and even my own kid and I get the wooooooorst looks. \n\nI had a lady walk up to me and ask, “Are you their babysitter, or?” The amount of verbal restraint I demonstrated should’ve landed me an award. I’d never say this to someone, but no bitch.. I’m their adult male family member guardian.\n\nThey look at me like I’m a kidnapper for walking the kids to the damn park 😒",
   "created_utc": 1694723577,
   "score": 10,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lr05c",
   "message": "How much time do you have? Haha. Mainly dating imo, unless you’re insanely good looking.",
   "created_utc": 1694724033,
   "score": 9,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lswft",
   "message": "Having to carry this huge third leg around all the time. I usually just throw it over my shoulder and carry it that way, but people still point at it.",
   "created_utc": 1694724701,
   "score": 8,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l2wm8",
   "message": "When you’re sitting on the toilet and your dong touches the bowl.",
   "created_utc": 1694715556,
   "score": 30,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lsaeo",
   "message": "I was raised to be an emotional and empathetic person. I like those aspects about myself, but I feel like people don't like emotional and empathetic men as a general rule (or look down on them). I don't want to stop being emotional and empathetic, but I feel like it just makes me look like a loser to others and I don't know what to do about that.",
   "created_utc": 1694724485,
   "score": 9,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lssvg",
   "message": "The onus is still very much on the man to initiate courtship.\n\nWhich is why socially anxious dudes like me will never marry.",
   "created_utc": 1694724666,
   "score": 8,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l7y5s",
   "message": "Being a man that’s the negative part and let’s not forget most of the males make up the statistics of yk what",
   "created_utc": 1694717327,
   "score": 15,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l54mt",
   "message": "Chasing",
   "created_utc": 1694716333,
   "score": 7,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0li38u",
   "message": "Just because you're a big guy ppl expect you to carry heavy shit when you're not busy.",
   "created_utc": 1694720902,
   "score": 7,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lm1ya",
   "message": "Your way of expressing yourself through clothing/fashion are way more limited. There is a pressure to conform to a male standard (both women and men uphold this). This system doesn't teach men to develop support networks where they can be vulnerable, it mostly leads to support networks of men who support each other in silence through a mutual activity. A man is expected to be the one moving things forward, if not they are a loser.",
   "created_utc": 1694722294,
   "score": 6,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lxiec",
   "message": "Testicles are the real life equivalent of a glowing weak spot on a video game boss.",
   "created_utc": 1694726366,
   "score": 8,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l47n4",
   "message": "Women not knowing the need to “manspread.” Extreme is ridiculous, but a minor manspread is fairly necessary.",
   "created_utc": 1694716014,
   "score": 25,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0l8nkx",
   "message": "being alive",
   "created_utc": 1694717574,
   "score": 14,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lrlt7",
   "message": "Double standards in regards to sexual and physical assault.",
   "created_utc": 1694724244,
   "score": 12,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0lho47",
   "message": "Society doesn't trust you around children (even your own), you smile at a kid or talk to them people see you as a pedophile.",
   "created_utc": 1694720752,
   "score": 6,
   "submission_id": "16ip2yq"
  },
  {
   "comment_id": "k0m4e1u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16ip2yq"
  }
 ]
}