{
 "submission_id": "16isq9p",
 "title": "Guys of Reddit, what are some things girls do that you secretly despise?",
 "selftext": "",
 "created_utc": 1694722756,
 "permalink": "/r/AskReddit/comments/16isq9p/guys_of_reddit_what_are_some_things_girls_do_that/",
 "score": 131,
 "url": "https://www.reddit.com/r/AskReddit/comments/16isq9p/guys_of_reddit_what_are_some_things_girls_do_that/",
 "comments": [
  {
   "comment_id": "k0mexg6",
   "message": "Sharing every detail of my personal life that I shared in confidence with them, with all their friends.",
   "created_utc": 1694733284,
   "score": 198,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lrhk9",
   "message": "Talk about our sex life in detail with her groupchat.",
   "created_utc": 1694724201,
   "score": 231,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0ma6ni",
   "message": "Volunteering me and my skills to your family and friends. I don't want to spend my weekends/time after work playing mechanic or handyman for your family and friends.",
   "created_utc": 1694731277,
   "score": 119,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m1pw2",
   "message": "Might just be me, but women don't know how to be gentle with balls",
   "created_utc": 1694727928,
   "score": 128,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mco5s",
   "message": "This goes for men too but wear way too much fragrance. If I can still smell you 5 minutes after you were in the elevator, you need to tone it down. 1 maybe 2 spritzes, but I swear people are out here practically bathing in perfume",
   "created_utc": 1694732317,
   "score": 235,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lzsro",
   "message": "Being as my fiancés friend brought up my “big anteater penis” out of nowhere I’m going to say sharing private details with friends. Led to one our worst fights between my fiancé and I.",
   "created_utc": 1694727210,
   "score": 50,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lp89u",
   "message": "Playing games when it comes to dating. Like playing hard to get when men are clearly taught no means no. Women need to be honest with intentions.",
   "created_utc": 1694723405,
   "score": 234,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lnjmj",
   "message": "Collagen lip injections aren't hot, they look horrible",
   "created_utc": 1694722818,
   "score": 194,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m11hz",
   "message": "I despise people acting stupid in public doing Tik Tok videos. I ignore them but secretly its really annoying",
   "created_utc": 1694727673,
   "score": 180,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lv48z",
   "message": "Playing hard to get when they want to get got.\n\nOr so I’ve been told.",
   "created_utc": 1694725494,
   "score": 92,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m34br",
   "message": "Girlfriend's best friend sending me seductive photos while simultaneously trying to get her to break up with me. Like, you realize I can just show my girlfriend the photos?",
   "created_utc": 1694728455,
   "score": 235,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m0ccj",
   "message": "Don't touch OUR fucking French fries!\n\nEDIT:  Apparently those are OUR fries, sorry for the confusion. 🤣",
   "created_utc": 1694727413,
   "score": 183,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m536d",
   "message": "Long talon like fingernails",
   "created_utc": 1694729209,
   "score": 206,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mgarq",
   "message": "Seeking attention from other guys when they already have a partner...\n\nI absolutely hate it and it's not a secret",
   "created_utc": 1694733869,
   "score": 146,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lz3o6",
   "message": "Trashing public restrooms.\n\nI've worked as a janitor at a grocery store, and there is a marked difference between how messy women's public restrooms get compared to men's. Paper products all over the floor, piling used toilet paper behind the toilet instead of flushing it, stuffing trash that doesn't fit (adult diapers, empty alcohol containers, etc. ) into those rectangular trash dispensers for feminine-products, leaving blood or poop on the seats, using too many toilet-seat covers and clogging the toilet. It's frustrating when your trying to clean it, but a line of impatient women is building up because you've had to close the restroom to clean their mess.",
   "created_utc": 1694726949,
   "score": 14,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mgnqz",
   "message": "1. Complain about us not opening up, while simultaneously not telling us when you're upset. \n2. Thinking we're upset when we're quiet. Sometimes we just like to be quiet and chill. \n3. After an argument bringing something up days, weeks, or months later related to said argument that we did all we could to resolve.",
   "created_utc": 1694734022,
   "score": 123,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lwm49",
   "message": "Passive aggressiveness. If you have something to say just say it. Don't throw shade or walk into the bathroom after me and put the toilet seat down. Just say \"could you put the toilet seat down please?\" Also saying \"You're just like my father/ex\" That makes my blood boil.",
   "created_utc": 1694726039,
   "score": 18,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m5yjc",
   "message": "That weird duck face some do in photos",
   "created_utc": 1694729556,
   "score": 212,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mglob",
   "message": "Overanalyze shit and not communicate directly. Passive aggression included.\n\nIf you're upset that I did something, TELL ME SO I CAN CORRECT IT",
   "created_utc": 1694733997,
   "score": 43,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mhe69",
   "message": "Bully other girls. It’s a huge Red Flag 🚩. \n\nDon’t date or mate with bullies no matter the gender.",
   "created_utc": 1694734338,
   "score": 91,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mcpir",
   "message": "Just tell me what you want to eat.",
   "created_utc": 1694732332,
   "score": 74,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mihlj",
   "message": "As an autistic person: not saying what they want directly. This seems to mostly only affect young women, or at least young women I was attracted to in my youth.\n\nIn my early 20s I swear every girl I was interested in would say shit that I would figure out was really aggressively sexual like a month later but at the time I would just be so fucking literal about it. They'd then assume I picked up on it and rejected them, and then they'd ghost me. Months later we'd reconnect as friends and they'd be like \"remember that one time that I said X\" and I'd be like \"yeah and I assumed you *actually meant* X...ahaha ha ha\"\n\nDating since my late 20s or so women are usually more like \"so you wanna go somewhere and fuck?\" This is better.\n\nAs an example, a girl I had a severely painful crush on when I was 23 and I were at the bar and I mentioned I had an old school nintendo at my apartment. She said \"do you have Tetris?\" and I was like \"fuck yeah I have Tetris it's my favorite fucking game ever\" and she said \"I'm really good at making pieces fit\" and I said \"prove it, let's go to my place.\" We actually played Tetris. After a few matches she got mad and left. Took me like two weeks to figure out why.",
   "created_utc": 1694734807,
   "score": 65,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lztgu",
   "message": "This one’s going to be somewhat mean-spirited, only because I’m in a bad mood. Here goes. \n\n***\n\n“Why don’t you spend more money on clothes, haircuts, doctor’s trips and therapy?”\n\n-Woman who has the financial support of a wealthier partner or parents, which I do not",
   "created_utc": 1694727218,
   "score": 222,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0me79f",
   "message": "Me: \"Where do you want to go for dinner?\"\n\nHer: \"Dunno, you pick.\"\n\nMe: \"Let's get Thai.\"\n\nHer: \"Naaaah. Not in the mood for that.\"\n\nMe:  *internal thoughts* \"I should just leave right now and go eat some Thai by myself.\"",
   "created_utc": 1694732971,
   "score": 43,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lnk8g",
   "message": "👀I'm waiting to see what boys say so I can get some knowledge 👀",
   "created_utc": 1694722824,
   "score": 91,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0miczs",
   "message": "Acting stupid on purpose",
   "created_utc": 1694734751,
   "score": 23,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lz6qo",
   "message": "Double standards. Like girls can do anything guys can do, and we shouldn't be treated differently, but then taking out the trash or whatever is still the guy thing because they don't want to do it.\n\nSomething my own gf does that bothers me is when she volunteers me to do stuff because of my guy status. Like when we went to the club she was pissed at me because I wasn't comfortable being used as a shield for her and her friends to keep stray males away. \"You should WANT to do it because you're a GUY!\"",
   "created_utc": 1694726981,
   "score": 172,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lzcsj",
   "message": "Being passive aggressive, it's unattractive in the worst of ways.",
   "created_utc": 1694727044,
   "score": 33,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mj1j5",
   "message": "“Breathe and stuff” - Ted Bundy probably",
   "created_utc": 1694735046,
   "score": 8,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0ly4lf",
   "message": "Playing the victim when they aren't",
   "created_utc": 1694726590,
   "score": 120,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mffm5",
   "message": "This is by no means something only women do, but I have encountered it with women a lot more.\nIf you're in a debate they will argue the point until they run out of counterarguments and once they realize they can't win they instead say the most hurtful thing they can think of.\nCall me crazy but hurting people you love intentionally is fucked up, no matter how \"mad and stressed out\" you were. Your emotional state is no excuse for shitty behavior.",
   "created_utc": 1694733501,
   "score": 41,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lp68m",
   "message": "Playing games, seeking attention, playing the victim. Not saying all girls do this or anything like that. I have zero problems with the vast majority of women I meet.\n\nEdit: Oh yeah, believing in dumb shit like healing crystals and astrology.",
   "created_utc": 1694723386,
   "score": 155,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lpmhd",
   "message": "This only applies to a minority **of** women, but I’m put off by the “All men suck. I don’t need a man” mentality. Fair enough if you feel that way, but don’t complain when men don’t pursue you and you wind up alone, because, like it or not, that’s what will happen.\n\nEdited to clarify.",
   "created_utc": 1694723546,
   "score": 248,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lxnaw",
   "message": "So I know that not drinking water might not be what’s causing the headaches but goddamn being very hydrated helps with inflammation, so I only ask because it could great reduce your chances of getting a headache or help reduce the pain.\n\nEDIT: Sorry, when they get mad at us for asking if they’ve had water because they have a headache, I know you don’t want me to fix it but damn, just trying to help. Why even say you have a headache?",
   "created_utc": 1694726415,
   "score": 73,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0ma6j8",
   "message": "They leave hair everywhere. I vacuum and next thing you know there’s fucking hair EVERYWHERE.",
   "created_utc": 1694731276,
   "score": 74,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m2qow",
   "message": "That they can say they want a guy who is six feet, with a six pack,six figures,and 6 inches.But I say I dont prefer chubby women,suddenly Im a misogynistic asshole.",
   "created_utc": 1694728312,
   "score": 95,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0luewl",
   "message": "Some women don’t want to give a man the wrong impression by sleeping with them too soon in the dating process. But they will still sleep with other guys at that same time period. I fail to see the logic",
   "created_utc": 1694725238,
   "score": 75,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0m2or4",
   "message": "Come over and get comfortable on the couch and spend about an hour on there phone without talking to me the whole time.",
   "created_utc": 1694728292,
   "score": 32,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mnpgu",
   "message": "This is me specifically being bitter about a couple of exes, but, having zero hobbies or interests and getting pissed because “we never do anything together”. Like okay, what do you even do? Getting mad because I’m out playing sports, going to the gym, hiking, or really content just playing an old video game. You’re welcome to participate in ANY of these things with me, but you choose not to and suggest zero alternatives. Sorry I don’t just stay at home and look at my phone.",
   "created_utc": 1694737081,
   "score": 7,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0mqryd",
   "message": "Leave those eyebrows alone",
   "created_utc": 1694738368,
   "score": 7,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0ms0mh",
   "message": "Duck lips.",
   "created_utc": 1694738832,
   "score": 6,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lrfxz",
   "message": "\"Despise\" is a strong word but it kind of irks me when so many women on dating apps complain that guys only want to hook up, but provide nothing on their profile about their interests, personality, or what they bring to a relationship beyond a wet, warm hole. Like I'm supposed to be the initiator while getting nothing to work with but \"I go crazy for: snacks!!\"",
   "created_utc": 1694724186,
   "score": 120,
   "submission_id": "16isq9p"
  },
  {
   "comment_id": "k0lw0y7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16isq9p"
  }
 ]
}