{
 "submission_id": "16iws5o",
 "title": "[Serious] What ruined your innocence?",
 "selftext": "",
 "created_utc": 1694732411,
 "permalink": "/r/AskReddit/comments/16iws5o/serious_what_ruined_your_innocence/",
 "score": 168,
 "url": "https://www.reddit.com/r/AskReddit/comments/16iws5o/serious_what_ruined_your_innocence/",
 "comments": [
  {
   "comment_id": "k0mcwd7",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1694732412,
   "score": 1,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mf9rw",
   "message": "Little me was like 12 or so.  I was browsing files on the family computer and in the music folder was one titled 'Bambi'.\n\n\u0026amp;#x200B;\n\nIt was not related at all to the cute classic movie with the deer.",
   "created_utc": 1694733430,
   "score": 189,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mdy3i",
   "message": "Asking too many questions too early in life and having an honest mother.\n\n**EDIT:** To be fair to my mother, had she been less honest, I would have found a way to get my answers, anyway.",
   "created_utc": 1694732862,
   "score": 149,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mll8k",
   "message": "Being molested in first grade by an older kid. Then having to testify in court. Had to go to mandated therapy and counseling afterword. Became an outcast at school. I went from being a confident and vibrant child to the withdrawn and quiet person I am today.",
   "created_utc": 1694736163,
   "score": 39,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mi2lw",
   "message": "Farting blood and parents thinking I was ass raped then learning what ass rape was and having to convince them I was not, and learning it was just from bad fissures from wiping too hard",
   "created_utc": 1694734629,
   "score": 86,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mej96",
   "message": "Being huddled under my bed late at night as a young child while hearing my parents scream and beat each other in arguments over bills, loans, and all the consequences of their stupid decisions",
   "created_utc": 1694733115,
   "score": 251,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mh1sm",
   "message": "My deployment to Afghanistan.",
   "created_utc": 1694734191,
   "score": 179,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mu6mc",
   "message": "The day my own father called me \"fucking stupid\", asked if I needed meds, and then my mom came to defend me which resulted in her being slammed to the floor.\n\nI remember going to the garage and getting his metal rake while my two sisters and brother cowered in the corner. My dad was always verbally and emotionally abusive, but that was the one (and only) time he ever laid hands on anyone. I walked back in the door screaming with tears in my eyes welding a giant metal rake I could hardly carry. I remember it was the first time I ever felt a cussword just roll off my tongue.\n\n\"I will fucking kill you if you touch mom one more time.\"\n\nRealistically I was 11 and couldn't do shit, but his demeanor changed.\n\nMy sister's and mom came to hold me back. I remember the look in my dad's eyes. It was a mixture of \"the fuck are you going to do\" slowly followed by \"oh shit I fucked up.\" He just walked out the door, got in his car, and went to work. Just. Like. That. As all his kids were screaming in terror around their mother and his reaction was to run instead of stick around and resolve things.\n\nThat's the day I vowed to never be a father like him. Now I got 3 happy kids - one of whom is a year from college - whom I vow to raise with nothing but love, respect, and understanding.",
   "created_utc": 1694739689,
   "score": 116,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mgmze",
   "message": "Hearing on the news that my surf life saving coach just got 30 years in jail for being a pedo.\n\nNever touched my brother and I but I kept asking questions to my mother until I found out what it all meant ...  \n.... Oh my.",
   "created_utc": 1694734012,
   "score": 230,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mmef7",
   "message": "unsupervised access to the internet from a very young age",
   "created_utc": 1694736514,
   "score": 109,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mjedp",
   "message": "Probably my Auntie being murdered in her front lawn by a jealous ex. I wasn't a witness. Attended the funeral tho and was not prepared for that amount of grief. I wasn't traumatized towards funerals,  but absolutely lost innocence. I was about 5 or 6.",
   "created_utc": 1694735202,
   "score": 94,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mpymd",
   "message": "20 year old me getting shot at by an 11 year old Afghan kid.",
   "created_utc": 1694738034,
   "score": 79,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mdny6",
   "message": "I guess my parents divorce. There is a definite before memories that seem bright and happier and after memories which feel like reality. They also divorced when I was almost 11 so that was already formulative and maturing years.",
   "created_utc": 1694732742,
   "score": 224,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mflbo",
   "message": "My mothers cancer diagnosis. Happened when i was around 13 i think, i can't remeber of the top of my head",
   "created_utc": 1694733570,
   "score": 126,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mh876",
   "message": "Back before liveleak there was a website called Ogrish. It had a banner with hands that had the fingers blown off with the tagline \"can you handle reality?\" A link on the side said \"click here for sample video.\" I think I was 12, so somewhere around 2002. I'd already seen porn, but this was on another level. Beheadings, suicides, just a bunch of graphic horrible death. I didn't sleep for a few days and I was pretty traumatized. Wound up seeking this sort of content out for the next few years and it really desensitized me to violence. Super unhealthy, I don't think I \"got over it\" until I was about 17 or 18.",
   "created_utc": 1694734267,
   "score": 249,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mjwcx",
   "message": "The US Marine Corps.",
   "created_utc": 1694735419,
   "score": 54,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mhg5r",
   "message": "Being emotionally abused at a very young age.",
   "created_utc": 1694734362,
   "score": 135,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mj8pd",
   "message": "Being homeless at 14 but honestly probably way before that. Grew up quicker than a child should have to",
   "created_utc": 1694735133,
   "score": 49,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0minxb",
   "message": "Getting raped when I was 17",
   "created_utc": 1694734882,
   "score": 40,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mgzpl",
   "message": "When I was a kid my mum met this really cool guy. They dated for a while and everything was fine. After a few months he introduced her to drugs and she got hooked. One night I wake up by a strange feeling that something is wrong. I remember running into the kitchen and seeing him, standing over my mum, beating her up. In disbelief and confusion I grabbed a pair of scissors and stabbed him in his eyes.",
   "created_utc": 1694734167,
   "score": 99,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mog98",
   "message": "When I was 23 my father blew a hole through his chest and I found him in the woods.\n\nMy dad did well for himself financially, and consequently I lived a pretty sheltered and privileged life; I assumed the world's problems were things that could be easily solved or were caused by simple issues, I looked down on people that disagreed with me, and looked at the world through a black-and-white lens - I believed there was right and wrong, that they were easy to discern, and that bad things happened to people because they did bad things.\n\nMy father was claimed by alcoholic dependence that eventually led him to suicide. All of our prayers to him and god for healing fell on deaf ears. We watched his decline over 3 or 4 years until eventually he didn't find any happiness outside of the bottle.\n\nWhen everything that happened happened, I was given a rude awakening to the reality of the world. Morality is complicated. Pain and grief are not distributed to everyone fairly. Every person has a story and a why. Everyone is doing the best they can with what they have and to assume that I knew better than them all was nothing short of pure arrogance. Additionally, my relationship with God and religion were shattered entirely - due to the circumstances I grew up in I believed that God took care of us and God's way was the best way. Either that God exists or doesn't, but if He does I was faced with the reality that sometimes He will look you in the eye after your most desperate plea and tell you \"no\".\n\nIt has been a long road that is far from over, but I am grateful that I can look at the world now and better accept it for what it is, rather than what I'd like for it to be.",
   "created_utc": 1694737400,
   "score": 129,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mkkbe",
   "message": "Having the neighbor shoot my dog and not being able to do a dam thing about it except cry and come to realize the world was mean 😔 I still miss my Sasha",
   "created_utc": 1694735712,
   "score": 68,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mnpws",
   "message": "unrestricted internet access",
   "created_utc": 1694737086,
   "score": 31,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mfrv4",
   "message": "being brutally beaten (a few times unconscious) when i was 4, 5, 6",
   "created_utc": 1694733647,
   "score": 59,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mmc26",
   "message": "Liveleak and company, the late 90s were a very lawless time on the internet that a preteen shouldn’t have unrestricted access to.",
   "created_utc": 1694736486,
   "score": 55,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mkhna",
   "message": "The death of my mother when I was only 8",
   "created_utc": 1694735678,
   "score": 25,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mn7q3",
   "message": "I posted the story in another subreddit a while back about a sledding accident I had with 10 Friends along where I flew up in the air and landed on a barbed wire fence and pierced the head of my penis with Rusty barbed wire and everybody that I thought I could count on stood there and laughed at me and nobody would help. That was the day that I knew for a fact that there was nobody on this planet that I could count on, I'd say that counts as losing my innocence.",
   "created_utc": 1694736870,
   "score": 24,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mik6s",
   "message": "I was groomed and SAd for years. I was kidnapped, and returned. I was r*ped. \n\nBut I’m good now. I’ve done the work.",
   "created_utc": 1694734837,
   "score": 93,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0ml2yl",
   "message": "The 2000 presidential election in the U.S. kickstarted a painful process of shedding my naive childhood patriotism. The shocking, racist fallout after 9/11 sped that process along mightily. It was a very, very weird time.\n\nSlight tangent: there comes a time in everybody's life when it really hits home that the adults ostensibly \"in control\" of things really, fundamentally *do not have their shit together,* not just within one's own family, but on a national or even global scale. This was mine, and was for many people my age. But I've had the heart-wrenching realization that the whole covid debacle has been that for a lot of today's kids.",
   "created_utc": 1694735940,
   "score": 83,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0moz3j",
   "message": "Being raped and beat as a child",
   "created_utc": 1694737624,
   "score": 21,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mpnqc",
   "message": "I’d have to say my old man trying to get me hooked up to lose my virginity when I was 12. He had always tried to live vicariously through me and the people we knew and were around were for the most part questionable people. I was already big for my age and looked a lot older than 12.\n\nMy best friend’s older sister was 18, had a lot of screws loose, and was reputed to be a bit of a ho. And unfortunately for me, she looked really good in a pink two piece bikini. And apparently she found me “cute.”\n\nSo while her parents and my parents were with my best friend in the ER (he’d caught food poisoning), she stayed at the house with me. Also unbeknownst to me, she’d gotten the directive from my Dad.\n\n…and the rest is history.\n\nNo, I’m not proud of it. But because of my father’s shitty decisions I was someone with a lot of self-loathing. \n\nI like to think I’m better now. I like to think I’ve found peace these days.",
   "created_utc": 1694737908,
   "score": 22,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mkxgm",
   "message": "My parents gambling addiction. We lost our house and it forced me to leave school to get a job to help support them. I left when they continued to gamble and my sister started too. They deserve each other.",
   "created_utc": 1694735874,
   "score": 20,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mgl2f",
   "message": "A judge and jury.",
   "created_utc": 1694733990,
   "score": 18,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mjcjg",
   "message": "2 girls 1 cup",
   "created_utc": 1694735180,
   "score": 50,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0meofc",
   "message": "Being raped.",
   "created_utc": 1694733175,
   "score": 97,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mkhkr",
   "message": "Tumblr. Back then porn was allowed on it and more importantly there were hella erotica stories (still are). I learned about bdsm and all that too young.",
   "created_utc": 1694735678,
   "score": 29,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mlp9f",
   "message": "I think realizing the innocence of my parents and how they are just people, themselves. They, just like young me, had doubts, fears, urges, and make big mistakes. I love my parents, but it makes me sad to know their perspective on the world and how it works. They divorced and stayed together, but never remarried. Throughout the years, as I graduated and got a bit older, more mistakes would be made. My dad set the barn on fire for insurance money, would tell my depressed mom to kill herself, mom’s viewpoint on the world would bring my sister down and lessen her hope, etc. Although, I’m very grateful for the life I have. I just want to be a good version of myself and realize that I’m not pre determined to be a certain person, just because I was raised a certain way.",
   "created_utc": 1694736213,
   "score": 12,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mn80j",
   "message": "I was molested by my grandmothers boyfriend when I was in elementary school. Told her and my mom when I was 15 and they told me she was gonna send me to mental facility for lying. Well 10 years later, in January. Apparently he has also molested my little sister who is 11. My grandmother still thinks we are lying and believes him 100%.",
   "created_utc": 1694736873,
   "score": 13,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mdd4c",
   "message": "The internet literally I remember the first time i was sexually aroused \n\nI searched for google on google images, no idea why.. innocently tho.. i was 10\n\nAnd a naked girl her tits replaced the two Os in gOOgle",
   "created_utc": 1694732613,
   "score": 38,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mk3jh",
   "message": "Being physically and sexually abused by my father",
   "created_utc": 1694735507,
   "score": 12,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0ml7mq",
   "message": "Being bullied my teachers.  Realized at a young age that adults are just as shitty as kids.  Was a significant factor in my decision not to have children because I know if I saw a child going through what I did I’m not sure I’d be able to keep my cool.",
   "created_utc": 1694735998,
   "score": 12,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mmsuc",
   "message": "Rotten.com",
   "created_utc": 1694736688,
   "score": 12,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mnytd",
   "message": "Porn and bad friends",
   "created_utc": 1694737194,
   "score": 12,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0msl6p",
   "message": "My nephew passing away from SIDS while I was babysitting him, I was 13",
   "created_utc": 1694739053,
   "score": 13,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0ml60z",
   "message": "Being molested at 7.",
   "created_utc": 1694735978,
   "score": 10,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mggxt",
   "message": "I recently hooked up with a closeted man who told me the story of his wedding night:\n\nHe was gay and pressured into marrying his wife, but hooking up with men throughout dating her. He let it happen for sake of convenience and because he was somewhat of a psychopath and liked being DL. The night before his wedding he was with a fuckbuddy who his fiancee personally hated (coworker), they hooked up and the fuckbuddy suggested the groom do a really fucked up thing: wear a pair of the fuckbuddies cummed-in underwear to his own wedding. Well, he went along with it and the whole wedding day the guy was getting off to the deception and taboo of what he was doing. Told me it was the biggest rush he'd ever gotten. The whole story made me shiver though and ruined my innocence.",
   "created_utc": 1694733942,
   "score": 41,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mhubh",
   "message": "Watching someone I perceived as an \"Uncle\" (My uncle's good friend) die of a heroin overdose in my house, and being 7-8 years old.",
   "created_utc": 1694734530,
   "score": 11,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mkaf9",
   "message": "Everything.\n\nI think what hit me hardest was William Goldman, writing in The Princess Bride.\n\nDread Pirate Roberts: “Life is pain, Highness.  Anyone who tells you differently is selling you something.”\n\nHurt then, hurts now, and I still cannot refute it.",
   "created_utc": 1694735590,
   "score": 10,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mtbdn",
   "message": "Being forced to make the call to pull the plug on my own mom after she shot herself in the head. She was my everything, I lived a very sheltered life before that. That night has forever played over and over with no change to the outcome. It definitely shattered me as a person. Approaching 5 years this October and still not a day I haven’t thought of it. If anyone else is a sos or considering please know you are so loved and wanted. It’s a permanent solution to a temporary problems.",
   "created_utc": 1694739336,
   "score": 10,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mlfan",
   "message": "When I was about 12 years old, I was an altar boy at our Catholic church. The priest went on a rampage during Mass about how bad gay people were; and how they were to be avoided at all cost. He continued by explaining that they were running society.\n\nI went home and explained to my mother what happened in church, and what I heard from the priest. I also told her I never wanted to return to that church again.  She knew that as a young teenage gay kid, I was suffering enough without the church hurting me more.  \n\nThat was decades ago.  Never went to church again.",
   "created_utc": 1694736093,
   "score": 30,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mnj3p",
   "message": "Being sexually abused at a young age, parents alcoholics and mentally, emotionally and physically abusive.",
   "created_utc": 1694737005,
   "score": 9,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mpv2x",
   "message": "When my dad threw me at a door for the first time as a kid",
   "created_utc": 1694737993,
   "score": 9,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0msse7",
   "message": "There’s a lot of things that happened when I was young that chipped away at it but really got me was going to Haiti after their huge earthquake when I was like 14-15. It was the first time I smelled death and I didn’t talk for three days.",
   "created_utc": 1694739130,
   "score": 10,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0miqr0",
   "message": "My cousin having lesbian sex with my sister in front of me.",
   "created_utc": 1694734916,
   "score": 16,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mheva",
   "message": "Creepy pasta had a theory on “The Rugrats” and it messed me up ever since",
   "created_utc": 1694734347,
   "score": 15,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mksd6",
   "message": "Moving from Nebraska to NYC",
   "created_utc": 1694735811,
   "score": 8,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mmocb",
   "message": "Unsupervised access to the internet as a child :) \n\nAlso my dad beating my mom in front of me a few times.",
   "created_utc": 1694736633,
   "score": 8,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mjrfr",
   "message": "Seeing my dads penis when I was very young. Grossed me out",
   "created_utc": 1694735359,
   "score": 14,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mogfn",
   "message": "My best friend’s dad’s playboy magazines",
   "created_utc": 1694737403,
   "score": 7,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mtnf6",
   "message": "Unrestricted access to the internet in the early 2000's.",
   "created_utc": 1694739473,
   "score": 8,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mu1lh",
   "message": "Being abused for 8yrs of my life by my drug addicted father. I was exposed to so much because of his addiction, but I will thank the heavens everyday that rehab actually worked for him and he came back a completely different man and was a goodo father from then on. That man taught me a lot early, but then came back and not only made up for how he was, but continues to be the best dad and grandfather. He taught me one of the most valuable lessons that I desperately needed to learn: sometimes you need to sacrifice what I love most for those I love most. It could make all of the difference.",
   "created_utc": 1694739633,
   "score": 7,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mgz05",
   "message": "Porn",
   "created_utc": 1694734159,
   "score": 12,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mibcq",
   "message": "13, Dad broke up with me and ended our relationship",
   "created_utc": 1694734732,
   "score": 6,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mo8zh",
   "message": "My Mamaw passed away when I was 7, and life took a nosedive almost immediately after. I was molested by two family friends in their late teens, my parents divorced. At 9 I came home to cop cars outside because my moms second husband was a convicted child molester and did not register their new address for obvious reasons. My younger sister and I lived with our verbally abusive dad after that, and for a decade I was called fat, useless, fucking stupid, lazy, etc. I was also relentlessly bullied from grades 4-10, I don't remember if it fizzled out my junior year or if I just stopped caring because literally no one could've hated me more than I hated myself at the time.\n\nMy childhood and innocence died when my mamaw died.\n\nSide note: my dad could be a very good dad and was a very good provider. The day my moms 2nd husband was arrested, my dad found a townhouse close by and moved that weekend so we wouldn't have to change schools or anything. After he came out as gay shortly after I graduated high school, he slowly began healing his own trauma, including being raped by a close family member growing up. Therapy helped a lot and we have a very good relationship.",
   "created_utc": 1694737314,
   "score": 6,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mq5p7",
   "message": "The internet. I saw way too much shit I should have never seen when I was really young",
   "created_utc": 1694738117,
   "score": 5,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mr3g6",
   "message": "Porn too early in life, at 9 y old i think",
   "created_utc": 1694738490,
   "score": 7,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mtj5q",
   "message": "Being told I was possessed by a demon and brought to a clergyman for hearing voices, feeling dull, and anger fits. (Surprise! It was onset childhood bipolar depression)",
   "created_utc": 1694739424,
   "score": 7,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mhnih",
   "message": "Being let loose with unrestricted internet access as a kid.",
   "created_utc": 1694734449,
   "score": 9,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mgndw",
   "message": "idk i was losing gradually, and i think thats is kinda the ideal.",
   "created_utc": 1694734018,
   "score": 6,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mkwue",
   "message": "Anime.",
   "created_utc": 1694735866,
   "score": 5,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mlswe",
   "message": "Marine Corps service and deploying to a country that I had one idea about, but left with a completely different one (as well as a different idea of what *our* country's government is made up of. That opened the door to limitless questions that allowed me to learn something new every day about the world. Geopolitics, power and control, humanity itself, and then Spirituality more or less in that order. \n\nIt can make you jaded and cynical, but it doesnt have to, because it isn't the final step to getting a grip on our shared reality. That's all I'll say",
   "created_utc": 1694736256,
   "score": 6,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mopdc",
   "message": "My own grandfather molesting me, my grandmother (his remarriage) covering for him when I told her in tears. An hour later I'm in the car with him being scolded for almost getting him in trouble. He took me into the forest for camping, I don't think I need to finish my story for you to put it all together.\n\nI was about five.",
   "created_utc": 1694737509,
   "score": 6,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0msx7k",
   "message": "My all girl elementary school was next to a construction site, a residential building that has been sitting unfinished for some months. The site became home to junkies. One day while my friends and I were outside for recess one of them stood outside facing us as he masturbated to completion. I had no idea what the white stuff coming out of him was, it scared me and scarred me, couldn't get the image out of my head for years.",
   "created_utc": 1694739183,
   "score": 5,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mhmh5",
   "message": "idk man, a lot",
   "created_utc": 1694734438,
   "score": 8,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mgwqt",
   "message": "Truth or dare with a friend",
   "created_utc": 1694734131,
   "score": 3,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mgx22",
   "message": "When I was about nine, I Snuck out of my room, was watching the tv my parents were watching, and coincidentally, the documentary playing explained EVERYTHING in detail.",
   "created_utc": 1694734135,
   "score": 4,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0ml84i",
   "message": "social media.",
   "created_utc": 1694736005,
   "score": 3,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0ml923",
   "message": "9/11. I was in 8th grade.\n\nAlso being SAed at school by a fellow student shortly after that event and being told by the principal that it was my fault \"for being too pretty and tempting.\"",
   "created_utc": 1694736015,
   "score": 5,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mlfji",
   "message": "My cousin",
   "created_utc": 1694736096,
   "score": 4,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mmmqo",
   "message": "Raped at 3, I'm in my mid 20s. I'm just starting to be well adjusted",
   "created_utc": 1694736613,
   "score": 3,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0moep8",
   "message": "Abuse throughout my entire childhood and teenage years, emotional, physical, sexual. From more than one place. Never from either parent, but from the people they surrounded themselves with. Step mother \u0026amp; her shitty son, Step father abusing my mother within earshot. \"best friend\" taking advantage of things that I'm not going to say here, bullied at school, etc. I can't say for sure the turning point was but I'm 30 now and still struggle to feel anything towards anyone.\n\nCats are lit tho",
   "created_utc": 1694737382,
   "score": 3,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mozhx",
   "message": "The internet",
   "created_utc": 1694737628,
   "score": 4,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mpfyx",
   "message": "Not pleading the fifth.",
   "created_utc": 1694737821,
   "score": 4,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mru8t",
   "message": "SA as a child from a close family member for years.",
   "created_utc": 1694738768,
   "score": 4,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0muksq",
   "message": "Watching my Mother lose the ability to walk when she got MS. She was 36. I was 10. She died 8 years later.",
   "created_utc": 1694739848,
   "score": 3,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0n1gbr",
   "message": "   When i was 6  years old i was sexually assaulted (twice) by a cousin who was like 16 years old at the moment. Both times happened in the living room of my grandma's house while i was playing by myself with dolls and my grandma who supposed to be taking care of me was asleep in a nearby room. I never told anybody because this was a close cousin who is also my brother's best friend (since they both are the same age and grow up together) and also my father's love-you-like-a-son nephew.\n   No only ruined my Innocence as a child but the experience fucked me up for the rest of my life and still haunt me even now 14 years later. Never told anyone in my family since i know no one would ever believe me and have to see this cousin every single year on holidays cuz my parents love him.",
   "created_utc": 1694742596,
   "score": 1,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0n2u1b",
   "message": "Getting molested at 5. My dad is alcoholic. My brother died horribly when I was 6. The rest of my family abandoned me in their own grief. And I was bullied, and raped. I'm still messed up, but I'm still kicking and I still have the ability to love and laugh and forgive, so maybe I have a little innocence left in here somewhere.",
   "created_utc": 1694743139,
   "score": 1,
   "submission_id": "16iws5o"
  },
  {
   "comment_id": "k0mqthm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16iws5o"
  }
 ]
}