{
 "submission_id": "16jdoi7",
 "title": "What is the most humiliating thing a person can go through?",
 "selftext": "",
 "created_utc": 1694785070,
 "permalink": "/r/AskReddit/comments/16jdoi7/what_is_the_most_humiliating_thing_a_person_can/",
 "score": 234,
 "url": "https://www.reddit.com/r/AskReddit/comments/16jdoi7/what_is_the_most_humiliating_thing_a_person_can/",
 "comments": [
  {
   "comment_id": "k0pmvto",
   "message": "You hear about the guy who shit himself so bad the plane had to turn around the other day?  I'm guessing that was pretty bad.",
   "created_utc": 1694792961,
   "score": 71,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0plq9m",
   "message": "If you've never been in a situation that caused you to be unable to wipe your own butt, let me tell you the first time is awkward and humiliating.",
   "created_utc": 1694792546,
   "score": 76,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pzeou",
   "message": "Having something posted of you online that you can't get rid of. My mum put youtube videos of me as a child up with the channel name as my full name. Whenever someone types up my name into google, the channel comes up. I've tried to take it down so many times but nothing works. I got teased relentlessly for it back in school.",
   "created_utc": 1694797471,
   "score": 178,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pjxja",
   "message": "Your wife cheating on you, multiple times, then pulling you onto her podcast to talk about how it made you feel.",
   "created_utc": 1694791899,
   "score": 13,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q1oat",
   "message": "Probably that thing where your partner is cheating on you and everyone knows it except you, but nobody tells you because they all consider you too fragile to handle the news and nobody wants to be the one to break it. Then you find out and start asking everybody you know, and they all confirm like it’s common knowledge. What happens after this is…you end up thinking anyone you are with is cheating on you and everyone else is in on it and keeping it from you. Even when you flat out ask, you assume they’re lying. I think that entire situation would be a pretty humiliating hell for me.",
   "created_utc": 1694798291,
   "score": 56,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pgx8p",
   "message": "I get a serious case of secondhand embarrassment when I see a person who is desperately, foolishly, and pathetically in love with another who is just using them and treats them blatantly like garbage.  Ugh.",
   "created_utc": 1694790805,
   "score": 212,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q4zk7",
   "message": "Growing up with a stutter.  Trying to maneuver through adulthood with it always lurking in the background, popping out at the worst times.",
   "created_utc": 1694799470,
   "score": 226,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pi9i2",
   "message": "Child having a parent mock them in public.",
   "created_utc": 1694791295,
   "score": 52,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pctsi",
   "message": "[I am going with the kid that who tried to sucker punch someone, but he ended up getting rocked and pooping his pants.](https://www.youtube.com/shorts/6ViK1OdkEaA)\n\nIf it happened in a movie, it would feel too over the top to be realistic.",
   "created_utc": 1694789292,
   "score": 81,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q5r0j",
   "message": "For me personally\n\nI was making out with a woman I was so attracted to that when she put her hand on my chest while kissing me, I came in my pants.\n\nMood immediately killed and she said, \"it's late and we're both kinda drunk, call me tomorrow okay?\"\n\nThis happened less than 24 hours ago and I'm 49.  I want to call her and I'm going to but  goddamn I wish last night went completely different.",
   "created_utc": 1694799744,
   "score": 46,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pfhp3",
   "message": "[removed]",
   "created_utc": 1694790272,
   "score": 18,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pqnru",
   "message": "Having to explain to all your co workers, bosses, friend, family, that you cannot work because of pain and need surgery to fix your anal fissure at 28 years old.",
   "created_utc": 1694794317,
   "score": 133,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q2960",
   "message": "Girlfriend and I broke up and went into no contact for 3 months.\n\nI got through it. I worked on myself. I became a better person.\n\nHad to start going back to the office where she works.\n\nI gritted my teeth. I got through the days. I found joy in things again. I found peace and happiness.\n\nWe started talking. Hanging out. Going for coffee. Becoming friends again. Becoming close.\n\nOne night, in February, I picked her up and we drove to a work function together. At a bar.\n\nThe night got longer, she got closer.\n\nShe expressed her feelings for me. She held my hand. She kissed me. I kissed her.\n\nMy dream was coming true. She was the love of my life. It was actually happening.\n\nWe sat at the bar, talking to a guy next to us. She was holding my hand. Squeezing my leg.\n\nIt was last call. I said we should leave.\n\nShe asked me to go and warm up the car.\n\nMy heart sunk. Somehow I knew what was about to happen. I stared at her. She stared at me.\n\nShe went to the washroom. I went to the car. Started it.\n\nTen minutes pass. I get out. Look through the window.\n\nShe’s sitting at the bar leaning into the guy we were talking to.\n\nI walk in. Up behind them. I can see her phone. It was a text conversation. He had texted her his name so she would have his number.\n\n“Seriously?” I say. She looks up. Doesn’t know what to say.\n\nI leave.\n\nI can’t tell you how humiliated and pathetic I felt in that moment. I’ve since accepted that this person isn’t someone I want in my life, but the resentment and anger I feel over that night haunts me. I know the key is finding a way to forgive her, for my own sake, but it struck me to my core.",
   "created_utc": 1694798497,
   "score": 31,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q7rku",
   "message": "I guess distribution of revenge porn must be utterly traumatizing and humiliating",
   "created_utc": 1694800469,
   "score": 86,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q55xh",
   "message": "As a person living with MS the most humiliating things I have been through are falling flat on my face while strangers laughed at me instead of helping me, not making it to bathroom in time is second to that, third is the questions about the way I move, fourth is when my legs start shaking uncontrollably and I’m stuck and people look at me like I’m on drugs or something. I hate multiple sclerosis.",
   "created_utc": 1694799534,
   "score": 200,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pkh4i",
   "message": "[deleted]",
   "created_utc": 1694792098,
   "score": 89,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pyzx5",
   "message": "I had a friend in high school who snuck two older guys into her basement one night while her parents were asleep.   They dared her to stick a couple carrots up her *lady purse* and one took a picture.  My entire high school found out and dubbed her Carrot Girl.  One day steamed baby carrots were served at lunch and a bunch of the obnoxious “popular” kids all started throwing their carrots at her her and laughing and chanting “Carrrrrrooottttt Giiiirrllll”.  \n\nI thought that was pretty humiliating.",
   "created_utc": 1694797322,
   "score": 33,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pqdph",
   "message": "A mental breakdown. The whole world laughs and your powerless to stop it.",
   "created_utc": 1694794215,
   "score": 170,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q1p4c",
   "message": "Being the target of revenge porn, especially if the perpetrator sends the pics to coworkers and family.\n\nOne story from Reddit I’ll never forget:\n\nSome guy’s ex girlfriend told all his family (including extended) and friends about his diaper fetish. There’s simply no undo button on that.",
   "created_utc": 1694798299,
   "score": 188,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0ptbqo",
   "message": "Having the psych ward take you to court.  Also IEP meetings.",
   "created_utc": 1694795276,
   "score": 3,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q3slh",
   "message": "Having your child eaten by wild dingoes only for you to be thrown in prison for 3 years under suspicion of murdering said child because no one believes your story. You become the laughing stock of the world with people mocking the death of your child for decades to come even after it was proven that dingoes did, in fact, eat your baby.\n\nhttps://en.m.wikipedia.org/wiki/Death_of_Azaria_Chamberlain#:~:text=On%2012%20June%202012%2C%20at,causing%20injury%20and%20even%20death.",
   "created_utc": 1694799045,
   "score": 109,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pmfbz",
   "message": "Losing your job and having to simp to hundreds or thousands of potential employers begging/pleading for a job",
   "created_utc": 1694792796,
   "score": 48,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pmvxw",
   "message": "Homelessness. Getting abused sexually. Being abused and then getting gaslit.",
   "created_utc": 1694792962,
   "score": 188,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0p41q0",
   "message": "Getting your foreskin caught in a Pez dispenser, while in church.",
   "created_utc": 1694785926,
   "score": 76,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q63xl",
   "message": "Being an absolute jerk to your kid in public. \n\nI wanted to punch a lady in the face the other day for being mean to her daughter in the dressing rooms. Trying to make her try on sizes obviously too small and acting like she wouldn't look good in anything she liked, pushing her to get a colorless dress, pushing her to come out of the dressing room and show them the clothes that she said really didn't fit. She sounded so embarrassed. Her tone just felt like she was trying to make her kid feel fat. But she wasnt!!! And she was like 13!!! I was pudgier than her at 13 and grew up to be super f-ing skinny by 16. It's common and normal!",
   "created_utc": 1694799874,
   "score": 203,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qfn8a",
   "message": "As a child, being made fun of for things that are completely out of your control. If your family is poor and having someone point out to the class that you’re wearing the same clothes as yesterday, or that your clothes don’t fit right is such a pointlessly humiliating thing for a kid to go through, and affects them for years",
   "created_utc": 1694803334,
   "score": 134,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0ps4u3",
   "message": "Finding out everyone knew you were being cheated on but you.  Everyone...",
   "created_utc": 1694794850,
   "score": 248,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pzimh",
   "message": "I mean that poor person who shit themselves on the plane was pretty bad",
   "created_utc": 1694797510,
   "score": 67,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qsbec",
   "message": "Being forced for apologize when you are the victim",
   "created_utc": 1694807929,
   "score": 67,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q4fms",
   "message": "Be abandoned by your abusive drugged mother at 7 years old. Since I wasn't registered for school. No one knew I was missing for years. Finally picked up by police to be sent to your dad. Your dad says he knows I'm going to be a criminal and proceeds to beat for almost 10 years. Finally get free of him to find out the whole time I was supposed to be learning social ques. I try and try but no one talks to me. Btw I'm over 50 now just now learning to speak to people. I get embarrassed when people look at me like I'm a freak because of it",
   "created_utc": 1694799273,
   "score": 106,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pgbv8",
   "message": "Waitstaff: Enjoy your meal.\n\nMe: You too.",
   "created_utc": 1694790583,
   "score": 95,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pt9sn",
   "message": "Watching your child pick their nose and tug at their crotch during the Christmas presentation at school.",
   "created_utc": 1694795257,
   "score": 7,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pz2qa",
   "message": "Anything Involving involuntary body fluids and ostracism",
   "created_utc": 1694797350,
   "score": 54,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pnicm",
   "message": "The military is pretty good at using humiliation for behavior correction. I'm sure someone can chime in with some examples.",
   "created_utc": 1694793182,
   "score": 168,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qd5xc",
   "message": "Grandparents caught me cranking it on vacation. Yes both of them. But I was on vacation gimme a break.",
   "created_utc": 1694802434,
   "score": 87,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q5zx1",
   "message": "Being completely stripped of your identity and material possessions, paraded naked through the streets in front of a jeering populace, then dropped in a deep dark hole for the rest of your meager remaining life.",
   "created_utc": 1694799834,
   "score": 37,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pjdsy",
   "message": "The wonder of pregnancy. There are so many tests, fluids, and heads between your legs. \nIn fairness, by the end of it you don't give a shit because that came out when you crowned.\n\nEdit: spelling",
   "created_utc": 1694791702,
   "score": 102,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pdfuj",
   "message": "Being falsely accused of something they didn't do, especially if they're convicted of it and spend a lot of time clearing their name.  But their reputation and life will forever be tarnished",
   "created_utc": 1694789514,
   "score": 185,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pb1yn",
   "message": "Pantsed in front of girls in junior high. Not the worst but not good.",
   "created_utc": 1694788632,
   "score": 100,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q1m1k",
   "message": "Rape",
   "created_utc": 1694798269,
   "score": 94,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0q34z0",
   "message": "I got to sit down with my incredibly religiously conservative parents (they’ve grown up now so don’t worry) to discuss what type of porn I ruined the family computer with (thank you limewire). So there’s that.",
   "created_utc": 1694798812,
   "score": 81,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0purvm",
   "message": "Divorcing a narcissist",
   "created_utc": 1694795798,
   "score": 58,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0ph0m0",
   "message": "Flashing other race running participants with your butt cheeks because the porta potty door doesn't lock.",
   "created_utc": 1694790839,
   "score": 24,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pivbq",
   "message": "shitting himself while cameras face him and going viral",
   "created_utc": 1694791514,
   "score": 28,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pqplf",
   "message": "Getting on stage to speak/perform in front of an audience, and completely bombing.  (I think it's the reason so many people are afraid of public speaking).",
   "created_utc": 1694794335,
   "score": 27,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qrwfa",
   "message": "To have an unfaithful partner who openly betrays you while pretending to genuinely love you",
   "created_utc": 1694807776,
   "score": 29,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0r72g2",
   "message": "Being made fun of for something you do out of genuine joy or love-- like having your laugh made fun of, or your art.",
   "created_utc": 1694813425,
   "score": 27,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qimvn",
   "message": "Probably gang rape",
   "created_utc": 1694804412,
   "score": 43,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0pt93o",
   "message": "You plan something like a birthday party or hang out and no one shows up. Your left there alone while people walk by pitying you.",
   "created_utc": 1694795250,
   "score": 24,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qiikb",
   "message": "I was having some medical issues in my mid 20s, and they wanted to do an ultrasound on my prostate. At least then, the way to do that was from the inside. So, you’re basically getting a giant, ultrasound-containing dildo stuck up your butt. It turns out that the only hospital in my University town was a teaching hospital. I got to get violated by this monstrous machine in front of six medical students, four of whom were women. A couple even got to try their hand at getting the ultrasound machine into the correct position. Good times.",
   "created_utc": 1694804368,
   "score": 21,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qm996",
   "message": "Ex drug addict specifically opiates (heroin then everything turned to fentanyl) I bought dope the night of Christmas Eve at my grandma's house cause all the cousins/grand kids would get $50 cash. My uncle saw me outside of an all tinted car in the street outside of the house, spent the whole $50.. Came back in and sniff some then nodded out in front of my whole family mind you thats 7 aunts/uncles plus my mom, dad, and sister and easily 20+ cousins. This happened alot where it became nothing to people, I still kick myself in the ass about all the BS I did and what people saw of me. 3 years off that shit this month. STAY AWAY FROM POWDERS NOW A DAYS ANYONE.",
   "created_utc": 1694805727,
   "score": 19,
   "submission_id": "16jdoi7"
  },
  {
   "comment_id": "k0qgcid",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16jdoi7"
  }
 ]
}