{
 "submission_id": "16jq1fz",
 "title": "What is something that screams “this older person is trying to seem cool and young”?",
 "selftext": "",
 "created_utc": 1694814708,
 "permalink": "/r/AskReddit/comments/16jq1fz/what_is_something_that_screams_this_older_person/",
 "score": 104,
 "url": "https://www.reddit.com/r/AskReddit/comments/16jq1fz/what_is_something_that_screams_this_older_person/",
 "comments": [
  {
   "comment_id": "k0s9zek",
   "message": "One thing you realize as you get older is no matter your age, mentally most of us feel much younger than we are. Seeing a dude in his 70s wearing cool shoes and a black T-shirt tells me a lot about them. You should cut older people some slack.",
   "created_utc": 1694830421,
   "score": 165,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sc8fo",
   "message": "83 here. Birthday today. Just trying not to die",
   "created_utc": 1694831487,
   "score": 103,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rfaxy",
   "message": "Just about everything I do, probably.",
   "created_utc": 1694816731,
   "score": 248,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rgloz",
   "message": "Wearing a red jacket over a gray shirt and a red cap, carrying a skateboard, and asking his fellow kids how they're doing.",
   "created_utc": 1694817288,
   "score": 234,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rznux",
   "message": "As a 38 year old I can tell you that with age comes this combination of confidence and not giving a fuck that allows us to not worry about being cool and young. I know that’s not true for everyone but I really think it’s true for most of us. And it is so freeing. I would not want to be 20 again.",
   "created_utc": 1694825676,
   "score": 131,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0s1yyu",
   "message": "Aging is mandatory, maturity is optional.",
   "created_utc": 1694826718,
   "score": 38,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rq2w0",
   "message": "The mom from Mean Girls \n\nKris Jenner",
   "created_utc": 1694821435,
   "score": 177,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0s64e7",
   "message": "There are loads of cool old people. Difference between them and the uncool ones is they're not desperately trying to be something they aren't, they're secure with themselves and who they are.",
   "created_utc": 1694828634,
   "score": 176,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rnla6",
   "message": "I'm 48.  I don't \"try to seem\" anything.\n\nI simply am.",
   "created_utc": 1694820339,
   "score": 2,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0so2mf",
   "message": "To annoy my daughter, I REGULARLY use the latest slang. Told her my hamburger SLAPS….her eye began to twitch. On the OTHER side of that I make up “old slang” words. Told her something cool was “the bees knees” and I said it’s the BIV WIV,the same as the bees knees and she bought it.",
   "created_utc": 1694837636,
   "score": 48,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rvi0c",
   "message": "Almost everything Madonna has done in the last 10 years to desperately remain relevant.",
   "created_utc": 1694823831,
   "score": 249,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rbvcz",
   "message": "That’s cap dude",
   "created_utc": 1694815313,
   "score": 124,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rbpce",
   "message": "Getting drunk and stoned with her kids and their friends.",
   "created_utc": 1694815245,
   "score": 137,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sipz8",
   "message": "Jokes on the young people. \"Older\" folks don't give a shit",
   "created_utc": 1694834714,
   "score": 146,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0snh9p",
   "message": "I’m 63. And it is great! The older  I get the happier I get. And I don’t give two solid poops about if I’m cool or not. Which ironically makes me kind of cool.\n\nIf you don’t believe me, that’s cool. I don’t care.",
   "created_utc": 1694837299,
   "score": 71,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sfb5p",
   "message": "Buying Twitter",
   "created_utc": 1694833003,
   "score": 72,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sgisg",
   "message": "I say stuff inaccurately all the time because I’m a middle school teacher and know I’m saying it wrong. It is just incredibly fun to watch my students think I mean it the way I said it.  Oh yeah and I’m 59 so I don’t really care if it makes people who are younger cringe.  Im just happy being me.  They can get over it.",
   "created_utc": 1694833603,
   "score": 46,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0shbxn",
   "message": "Pink tracksuit and no rules in their house",
   "created_utc": 1694834004,
   "score": 46,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sfknz",
   "message": "I was standing in line at a retail store and started to get self conscious about how my booty looked in my jeans. Then I realized Im a 57(m) and said fuck it, dont care",
   "created_utc": 1694833133,
   "score": 23,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rk8sk",
   "message": "Buying alcohol or weed for people who are underage. No dude, you're not cool. Its weird you're still trying to get into high school parties when you're almost 30",
   "created_utc": 1694818867,
   "score": 1,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0shyy7",
   "message": "Ugh, my kids every time I pull a sick move on my skateboard.",
   "created_utc": 1694834331,
   "score": 17,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0spycx",
   "message": "I recently suggested that my husband and I get tshirts that say \"Based Mom\" and \"Chad Dad\". My kids were not impressed.",
   "created_utc": 1694838726,
   "score": 20,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0soh9i",
   "message": "It's weird..I'm finally at the age of 46 not giving a fuck. I started doing pottery, joined a coven and smoke weed again.  I'm inappropriate and wear what I want. And ALL my daughters (21F) sorority sisters want to hang out and ask me for advice about shit I couldn't be bothered to care about.\n\nSo I guess that? Just not caring?",
   "created_utc": 1694837866,
   "score": 52,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0riukm",
   "message": "Shaking your fist at clouds",
   "created_utc": 1694818260,
   "score": 106,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0swdtb",
   "message": "Stop judging people by what they wear. Judge them on how they treat wait staff and service people.",
   "created_utc": 1694842735,
   "score": 18,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rvaft",
   "message": "I'm Gen x. We give no fucks, if it's comfortable we'll wear it. If we can, we'll do it.",
   "created_utc": 1694823741,
   "score": 180,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0shdsk",
   "message": "hey, getting old is tough so give people a break.",
   "created_utc": 1694834030,
   "score": 15,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0ragu5",
   "message": "the everything about drake",
   "created_utc": 1694814750,
   "score": 62,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0tghwo",
   "message": "Hey younger folks: We are always 25 in our hearts. I work in elder care. I watch 90 year olds do the walk of shame, and fall in love. I cheer them on. I am 50-something. When I was 20\\*something, old people found me repulsive. Now young people do.  \n\n I don't understand why you feel like you have a right to get  all judgy-McJudgeface about my self expression, because I don,t give you shit about yours. You can pierce and tattoo every Goddam inch of your body, and I won't say a word. But If I wear skinny jeans, it's a problem?\n\nI'm gonna wear what I want, and do what I want, and be who I want, because I have earned the right to do so. In fact, I was BORN with the right to do so. If that is a problem for you, then fuck you. Youth has no business defining elder-hood.  \n\nDo you have a particular age in mind where I no longer get to express myself? If not, the question is moot. If so, then Fuck. You...",
   "created_utc": 1694858211,
   "score": 11,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0su7jh",
   "message": "the thing that annoys me the most about reddit is hearing people in their 30s act like they are pretty much on their deathbed, quotes like \"everything hurts\", \"can't teach old dog new tricks\", \"i just don't give a shit about anything anymore\", they act like they're already dead.  dude, wtf happened to you? i know people in their 60s running marathon and sharp as hell, both physically and mentally.  who did this to you???\n\nso yeah, fuck reddit.  stay young as much as you can, however you can, if it makes you feel good.  act as young as you feel like it.",
   "created_utc": 1694841303,
   "score": 40,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rc4nn",
   "message": "As long as they’re not hurting anyone else…who fucking cares?",
   "created_utc": 1694815419,
   "score": 186,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0siexi",
   "message": "I saw a guy have an affair, he was late 40’s to early 50’s. Started wearing skinny jeans, got his ear pierced and shaved the sides of his head with hair longer on top so it swished around…. Complete bozo",
   "created_utc": 1694834555,
   "score": 11,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sms7e",
   "message": "Thinking that you still need to seem cool and young lol I'm about to be 40 and officially no longer give a single flying F if kids think I'm cool or not, cuz I know in my own heart I am fucking awesome and have a small tribe of people who feel the exact same way.",
   "created_utc": 1694836911,
   "score": 12,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0t2p2h",
   "message": "Turned 48 yesterday, I am just trying to not be a dick and say hello.",
   "created_utc": 1694847235,
   "score": 10,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sz426",
   "message": "Sometimes it's not about us trying to be cool and young and more about we have more time now, more  extra funds to do fun stuff, and we no longer care what others think .... So that stuff we're didn't do when we were younger and trying to grow a career, raise a family, be responsible..... Now we're like f-it.... Let's try it!",
   "created_utc": 1694844620,
   "score": 10,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rzt87",
   "message": "Where the hell is that Steve Buscemi gif!?",
   "created_utc": 1694825744,
   "score": 26,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sonwc",
   "message": "It doesn’t matter. The older I get the more I realize it’s just living your best life.",
   "created_utc": 1694837972,
   "score": 10,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rml7g",
   "message": "dying their hair jet black with printer ink\n\n\"i'm 30... well, in november i'll be 30\"",
   "created_utc": 1694819899,
   "score": 44,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rx2qb",
   "message": "when they harsh on my mellow",
   "created_utc": 1694824528,
   "score": 16,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0s7iuw",
   "message": "There are no rules here! I’m a cool mom 😉",
   "created_utc": 1694829276,
   "score": 18,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0saxu3",
   "message": "Being a victim to all the fashion trends--I used to work with someone like that.  Part of the fun of getting older is find your own style and not having to worry so much about what's cool and what's not, and picking and choosing what new items you actually like.  \n\nFor example, I'm not giving up skinny jeans/jeggings anytime soon, but my nap dress got me through the sticky days of August!",
   "created_utc": 1694830870,
   "score": 16,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sl034",
   "message": "Apparently the way I dress. Im 34. I wore joggers and crewneck to a gathering the other night and when I walked in, my friend a few years younger said “you look so fuckin old”. Fortunately, several of my female friends complimented my looks but still what the actual fuck. I just put clothes on. Asshole.",
   "created_utc": 1694835918,
   "score": 16,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sgzkf",
   "message": "Teachers putting memes from 2010 and dead trends from the late 2010s into their slideshow",
   "created_utc": 1694833833,
   "score": 9,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0smcrq",
   "message": "Buying a : \n\n- corvette\n- mustang \n- motorcycle \n- monster 4x4 dual exhaust diesel pick up truck with 56 miles of chrome accents, a lift kit and a vanity plate along the lines of “MUFFDVR”",
   "created_utc": 1694836663,
   "score": 8,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sobzx",
   "message": "I’m a kindergarten teacher with purple hair. Five year olds think I’m cool.",
   "created_utc": 1694837784,
   "score": 9,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0t9xym",
   "message": "What screams \"this younger person seems obsessed, biased, and ignorant?\"",
   "created_utc": 1694852922,
   "score": 8,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0tf66j",
   "message": "Inside most/all old people, there is a younger person. But sadly, people don't learn this until they are old themselves.\n\nI'm almost 50 and still ride my bike with now hands. I've always done this and now that my back and neck is starting to not be as limb and cooperative, it helps a lot to be able to sit upright while i'm riding. Also, i got better view. :-)\n\nI can ride past 16-year olds doing the same, that golf-clap me. They don't understand that if they continue doing it as well, and become/stay good at it, one day they will be almost 50 as well.\n\nI just never stopped doing it.\n\nI still wear baggy cargo pants. I like the ability to have pockets. This year i got really sun burnt on my scalp, so i bought my first cap for 30 years. And i liked it.\n\nSo yeah, i'm a 50ish guy, riding with no hands, wearing cargo pants, a hoodie and a cap. Oh, and i got a shoulder bag for my vape, phone, keys, etc.\n\nWhy do we care so much about what other people do, as long as it doesn't hurt anyone? Is it because you think people aren't too busy in their own life to not notice what you do or wear?",
   "created_utc": 1694857149,
   "score": 7,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0ryv3s",
   "message": "Jeff Bezos in his hip hugging pants.",
   "created_utc": 1694825323,
   "score": 25,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sc3ml",
   "message": "I know a lot of you guys are lookin at me and saying “Hey there’s a dude that’s my same age” but truth be told I’m a grown up real person.",
   "created_utc": 1694831424,
   "score": 8,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0shh1b",
   "message": "I'm 60 and I don't GAF anymore. I wear tshirts and shorts with my butt-white legs. I say \"groovy\" in meetings just to piss people off.",
   "created_utc": 1694834076,
   "score": 7,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0sx9hs",
   "message": "The good thing about being older (64) is that I feel zero need to seem cool. It’s a benefit of aging. Anything done to seem cool is unintentional.",
   "created_utc": 1694843343,
   "score": 7,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0tsjrv",
   "message": "Omg you are all going to get old one day. Maybe we aren't trying to be young. Maybe we are being ourselves.",
   "created_utc": 1694866321,
   "score": 6,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0svz0s",
   "message": "I shop for clothes in surf shops and skateboard shops. I’m in my 50’s.",
   "created_utc": 1694842453,
   "score": 7,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0texrk",
   "message": "We get to a certain age age and give zero fucks about what you or anyone else thinks of what we are wearing or doing.",
   "created_utc": 1694856959,
   "score": 6,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0s2a6b",
   "message": "Being 54 and dating people in their 20s. Ew.",
   "created_utc": 1694826858,
   "score": 49,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0rciuc",
   "message": "Using teenager slang. They always make it sound so weird and awkward",
   "created_utc": 1694815580,
   "score": 57,
   "submission_id": "16jq1fz"
  },
  {
   "comment_id": "k0tq58v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16jq1fz"
  }
 ]
}