{
 "submission_id": "16k2hhc",
 "title": "People who are opposed to marijuana, why?",
 "selftext": "",
 "created_utc": 1694854114,
 "permalink": "/r/AskReddit/comments/16k2hhc/people_who_are_opposed_to_marijuana_why/",
 "score": 56,
 "url": "https://www.reddit.com/r/AskReddit/comments/16k2hhc/people_who_are_opposed_to_marijuana_why/",
 "comments": [
  {
   "comment_id": "k0u2oc5",
   "message": "This by Randy Marsh from South Park:\n\n\"Well, Stan, the truth is marijuana probably isn't gonna make you kill people, and it most likely isn't gonna fund terrorism, but… well, son, pot makes you feel fine with being bored. And it's when you're bored that you should be learning some new skill or discovering some new science or being creative. If you smoke pot you may grow up to find out that you aren't good at anything.\"",
   "created_utc": 1694871296,
   "score": 242,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tvuh8",
   "message": "For all the folks saying \"I don't care about other people, but it's not for me\", I'm not sure if that was OP's intent because \"not interested\" or \"I don't like\" is different than \"opposed\".",
   "created_utc": 1694868073,
   "score": 129,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0to68g",
   "message": "I saw a couple of mates become massive stoners at a young age and pretty much write off their 20s.",
   "created_utc": 1694863776,
   "score": 32,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0twtun",
   "message": "Outside of the smell being awful, I just wish it was taken more seriously. Many people act like it can’t have negative effects on your mental and physical health just because it’s not as bad as other drugs.",
   "created_utc": 1694868570,
   "score": 66,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tbi1b",
   "message": "I have seen the negative effects on the people around me.",
   "created_utc": 1694854173,
   "score": 144,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tzhft",
   "message": "as a former marijuana user, i am not opposed to it, but i do have caveats about it.\n\nfirst of all, keep it away from anyone under 21\n\nsecond of all, smoking is still harmful to lungs, this needs to still be advertised. encouragement needs to be applied for edibles and low smoke options like dabs.\n\nthird of all, smoking weed absolutely stinks. i don’t mind the smell of weed walking around a city downtown at night. i don’t want to smell weed near playgrounds or in apartment complexes. this needs a compromise of some kind.",
   "created_utc": 1694869868,
   "score": 60,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u4ed5",
   "message": "Inhaling smoke is bad for you. Doesn’t matter what you’re burning",
   "created_utc": 1694872051,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0trbsn",
   "message": "The smell.",
   "created_utc": 1694865640,
   "score": 87,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0toju7",
   "message": "I wouldn’t say opposed to it, I’d rather say something along the lines that I wish it was kept more in line with the rules and regulations of drinking. Now I understand every state and city have different rules around drinking, but aligning with those that keep it to bars and your own residency. Not on the streets or public places where people can be with their children, children out recreating on their own, etc. I think you get the picture. I don’t want to go to my local national park to enjoy the scenery, the outdoors and all I smell is pot. And I think those specific instances have soured my idea of marijuana because the smell is everywhere.",
   "created_utc": 1694864011,
   "score": 74,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u3s9f",
   "message": "Marijuana has a load of issues that people who smoke Marijuana don't like talking about. \n\n1. Its addictive habitually. Not physiologically, but psychologically in a similar way to tobacco. Once you start going out and doing stuff while high, its difficult to find a reason not to. \n\n2. It makes (some) people generally content with being bored. Being bored is a crucial part of the human experience, where one can find a reason to be. If you're bored, it sparks motivation to seek hobbies, interests, and flesh your personality out. \n\nMarijuana does not allow for this type of personal growth. Being stoned for hours means you're quite content doom scrolling, doing nothing, and jerking off. \n\n3. There are a number of mental health conditions that CAN BE worsened with constant Marijuana use. With the legalization of Marijuana in Canada, there's been a rise in what can be described as cannabis-induced-psychosis. \n\n4. Its reputation as a \"safe drug\" means that THERE IS THE POTENTIAL that people are more likely to start doing it, abusing it, and eventually reach into other substances to abuse. Its happened to literally me and literally all of my stoner friends from high school with varying degrees of severity. \n\nWhile every substance from music, coffee, heroin, and potato chips *can* be enjoyed in moderation, the fact that my response is going to be buried or down voted cause so many people do not want to admit that Marijuana can be detrimental to peoples lives indicate a larger issue of straight of denial that being on dependent on substances can be bad.\n\nI am a stone-cold murderer of the bud. I blaze every day. I am actually relatively successful for being a stoner, and I am the first to admit that hey, this substance has problems. \n\nIts stunted some of my personal development, ignited and exacerbated mental health issues, and 100% acted as a gateway drug into my cocaine and degen phase that caused me a lot of pain and suffering. Marijuana HAS PROBLEMS and people should TALK ABOUT IT. \n\nIf you really are anti \"war on drugs\" and promote \"harm reduction\" then include weed in the list of things that has potential to harm. THEN you can find ways to reduce that harm like you would with anything else.",
   "created_utc": 1694871784,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tt2di",
   "message": "Because of its common abuse that goes overlooked. If you are using everyday, you are most likely addicted to and abusing it. \n\nIt is not a harmless drug. I smoked daily from the ages of 16-22. It triggered a month and a half long psychosis that landed me in the psych ward. \n\nNo previous symptoms, no changes to my lifestyle, it was 100% caused by my marijuana use. It’s been almost a year now since the psychosis and my abstinence. No negative symptoms since.",
   "created_utc": 1694866604,
   "score": 74,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tdvjj",
   "message": "Smells absolutely awful.",
   "created_utc": 1694856089,
   "score": 109,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u3xtj",
   "message": "I think the issue is that stoners have convinced themselves that it's not harmful in any way. They make it their personality, and their life. They also seem to think it's ok to smoke and the drive \n\nIf you replaced alcohol, with pot, in a stoners defense statements, they are addicts at their core who refuse to admit they have an issue.\n\n\n\nYes these are generalization, but like most things, the loudest group gets the most attention, even if they aren't the majority. \n\nIMO, smoke if you want, I don't really care. Don't fucking smoke and drive",
   "created_utc": 1694871851,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tkymt",
   "message": "I don't care if anyone else does it but personally it's of no benefit to me. I don't see it as a good reliever of stress and other things like many do. I've also seen people who are addicted to it and have to have it every day. I see the negative effects of long term use. I think many who use it regularly will deny this of course.\n\nAs for short term medical use, yes I believe that can be a good thing for many medical problems like cancer and many diseases relieving pain and whatnot.",
   "created_utc": 1694861626,
   "score": 38,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tv1nk",
   "message": "As others have said, it’s honestly the smell and your lack of attention if you’re doing it in the job.\n\nThe smell is an issue. It’s everywhere. Imagine a smell you don’t enjoy and half the people you pass you smell it on. In stores. Outside. Sitting on your porch and the wind blows. Deliveries.\n\nThe lack of attention can be frustrating. Messing up orders, forgetting things, literally just not caring. \n\nIf you’re doing it via edibles etc, and on your own time, I legitimately don’t care. \n\nBut like the root cause for many issues we have with each other, it comes down to lack of self control and lack of consideration of others. \n\n\nOtherwise Enjoy!",
   "created_utc": 1694867654,
   "score": 37,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tx1lb",
   "message": "It's stinks.\n\nI'm not saying you should go to jail for it, but keep that disgusting smell away from me.\n\nBTW, your clothes stink too, but you are too nose blind to notice.",
   "created_utc": 1694868676,
   "score": 36,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tgcf4",
   "message": "I’m opposed to marijuana for my self, why?  No, specific reason, I just have zero interest in it.",
   "created_utc": 1694858091,
   "score": 76,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tthiz",
   "message": "The smell is absolutely vile. If there was a way for people to smoke it fragrance free, then I wouldn't care.",
   "created_utc": 1694866831,
   "score": 22,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tj2xg",
   "message": "Fucking stinks",
   "created_utc": 1694860222,
   "score": 51,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tis1w",
   "message": "[removed]",
   "created_utc": 1694859987,
   "score": 20,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tbfyj",
   "message": "Because I already have an irrational fear of couches.",
   "created_utc": 1694854126,
   "score": 13,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u54be",
   "message": "I know people who couldn't function unless they packed a bowl, wake up pack a bowl, do laundry pack a bowl, go to work, guess what? pack a bowl and to top it off would get absolutely butt fucking angry and pissy if they didnt.",
   "created_utc": 1694872365,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u6q1o",
   "message": "Both my parents died from injecting 2 whole marijuanas",
   "created_utc": 1694873060,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tu53h",
   "message": "Because I've seen potential get brain damage, develop psychosis, depression and a host of other issues because of it.\n\nI would say all things in moderation - but the people who are say things like 'weed has no damaging effects' bro you have NO clue. I've seen people's lives FUCKED from smoking too much weed. And yes - it was the weed. Certain personalities are more amenable but thats the same with everything lol. It starts off with generally being more introverted, staying in more, then they start smoking alone. From here I've seen it range from depression to full blown psychosis.\n\nIf you can balance consumption alongside other things that its fine I guess - but from what I've seen that rarely happens. Plus in my country people start smoking in their teens, so it they have full-mental health crisis at the age of 16-17 purely because of smoking weed everyday.",
   "created_utc": 1694867175,
   "score": 30,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tdqv5",
   "message": "Marujuana is bad, mkay?",
   "created_utc": 1694855984,
   "score": 29,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tqbxu",
   "message": "I'm opposed to using any substance that effect my decision making or are harmful to me, don't like the idea of being high or drunk or hyperactive. I already have ADHD I don't need more",
   "created_utc": 1694865074,
   "score": 31,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tbzy8",
   "message": "I am not opposed to marijuana completely. Others can use it if they please (just try not to stink up my house with it, thank you Alex!).\n\nHowever, it can be addictive. I'm unclear about whether that is physically or mentally, but I have seen it happen. It has been described to me as a good solution to 'calm your head', which is something I'd like. I do worry I would like the result a bit too much, and as moderation has never been my best quality, there's a real risk of me using it when I shouldn't (such as when I can't afford it, or when I'm supposed to have a clear head for work etc.).\n\nAlso, it has a link to psychosis. I have seen people go down that drain, and it scares the crap out of me. Especially as I am likely more prone to that than average.\n\nSo I oppose using it myself.",
   "created_utc": 1694854567,
   "score": 29,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u3a8u",
   "message": "I think it stinks.",
   "created_utc": 1694871563,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u3oiy",
   "message": "The smell. So many of my neighbours smoke it so much that I can’t open a window without smelling it. It’s quite irritating.",
   "created_utc": 1694871738,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u3s0n",
   "message": "Not opposed to it for others however I am opposed to people claiming it’s “not a drug” and “just a plant.” No, you still shouldn’t get in a vehicle high as hell and no you are not a “better parent” for being perpetually stoned around your kids. Not to mention it’s a major SIDS risks for babies. I view it as medicinal for certain conditions OR recreational only at the right time and in the right place.",
   "created_utc": 1694871781,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u5z3d",
   "message": "Some people use that as their whole personality and get mad when they can’t smoke. I used to date a guy who would get high then forget I existed.",
   "created_utc": 1694872735,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u7baw",
   "message": "Ex stoner here. (4+ years). Starter with a joint or two at the weekends then became an everyday sort of deal. Fucked up my lungs and developed asthma, my memory went to shit and my apartment was a shite hole. Mentally I developed anxiety both on and off it   Gained so much weight thanks to the munchies etc. \n\nSince being sober i have really taken control of my life. Lost weight, more productive and happier in general. Still an anxious mess but getting there.",
   "created_utc": 1694873313,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u9g24",
   "message": "This thread is hot garbage. It might as well be quoting “Reefer Madness” as their reasoning.",
   "created_utc": 1694874189,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tdlex",
   "message": "Smells like skunk, advertised for people it can harm, and pointing out that you shouldnt do things like drive or watch children alone while high gets you hate online.",
   "created_utc": 1694855861,
   "score": 15,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tit66",
   "message": "I know it's unfair, and based on a pretty small sample size, but every marijuana user I've known has been a loser.  So I associate pot with slobbish, uninteresting and unmotivated people.",
   "created_utc": 1694860011,
   "score": 26,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tmgwj",
   "message": "It smells awful, makes people lazy when taken in excess / abused and unfortunately the age at which many begin the cycle of abuse is so young that I don’t think they realise how much harm they are causing themselves in the long run before they become socially or psychologically addicted.\n\nI have no qualms about an older adult consuming it for health reasons or pleasure, in the privacy of their own home / away from the public, using a pure form which has not been laced with other ingredients they don’t know about in order to reduce the risk of harm to themselves and the impact on their family of their early demise and consuming it within acceptable limits in order  to reduce the risk of psychological issues which could potentially have an impact on wider society.",
   "created_utc": 1694862674,
   "score": 5,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tmu15",
   "message": "In the same way that there's a difference between having a drink, being drunk and being a drunk. That line is still there for marijuana. \n\nDon't mind people using it, and there's a time and a place for being stoned as there is for being drunk (like not at work or when driving), but if you're a stoner and it's your whole life, you've gone too far.\n\nAlso it does stink.",
   "created_utc": 1694862917,
   "score": 5,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tfax8",
   "message": "Im opposed to smoking",
   "created_utc": 1694857256,
   "score": 9,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0ttbuq",
   "message": "Because literally every person I know who smokes a lot of marijuana has turned into a paranoid conspiracy theorist.",
   "created_utc": 1694866747,
   "score": 8,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0td83w",
   "message": "I am pro using medical marijuanna where it is proven to help...\n\nMy problem is the same as with alcohol, the dumb fucks that over use it, because as I saw with some friends, smoking a lot is not good for you...\n\nI for one drink a couple of times a year, and never get pissed drunk.",
   "created_utc": 1694855559,
   "score": 11,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u3unw",
   "message": "It’s great if you can respect it.  But it is such an easy drug to abuse, so many friends including myself just stay stagnant because it’s all we did in our off time from work or school.  Ruins your sleep.  Just like anything it’s okay if you can manage in moderation",
   "created_utc": 1694871813,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u47fr",
   "message": "I don't like the smell and I don't like getting buzzed by it when I don't want it.\n\nI had to deliver pizzas to a house party once and then had to drive with a buzz on delivering pizzas for a couple more hours.  You might say that's not so bad, but it makes me a bit paranoid, sometimes really paranoid, and then I have to see people I don't know and change money and then see my manager, who would probably understand why I'm acting funny, but it sure isn't pleasant.\n\nIf people want to chew it up in gummies, I'm all for it.",
   "created_utc": 1694871969,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u4hv2",
   "message": "I'm not opposed to it as an occasional substance, but I don't understand how everyday users don't see that as a problem. Especially the ones that use it all day every dau.",
   "created_utc": 1694872094,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u4mg1",
   "message": "I used to smoke every day for almost 10 years. Realised it creates a dependency as bad as other drugs - not chemically addictive, but it’s 100% habitual. Not a single person I would smoke weed with would have a healthy relationship with it. I accept and love the positives it can bring, but people pretend it’s a miracle plant that can do no wrong - I used to be one of them. I see through it. It can do good, it can help with various medical conditions. But let’s stop pretending that getting stoned all day every single day of your life is healthy.",
   "created_utc": 1694872150,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u64xe",
   "message": "I get mildly annoyed when people are smoking it literally everywhere and make their whole personality about it, but then I get annoyed when people do that about anything.",
   "created_utc": 1694872804,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u6jrb",
   "message": "1) it can become an addiction and no addiction is good\n\n2) if you need a drug to \"feel good\" then there is something wrong with your life and you should be addressing those issues instead of running from them",
   "created_utc": 1694872984,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u6ox3",
   "message": "It’s so much stronger than it used to be and adolescents who use it while their brain is developing are experiencing psychosis and other mental disorders at an alarming rate. Don’t kid yourself, THC is a serious drug…",
   "created_utc": 1694873047,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u7259",
   "message": "I am not against marijuana per se but here are few reasons i am against it.\n1. Many people have said the smell. I have lived with the smell my entire life (parents were and still are potheads). Still not a fan of the smell.\n2. Too many people make weed their entire personality. I know that's not exclusive to marijuana but most of the time it's more on the nose than other things \n3. A common argument is that marijuana is not addictive. While you may not develop a chemical dependency, there are people who definitely develop a dependency on it mentally. I have had multiple friends spending their money primarily on weed and living off ramen for a month because they \"need\" it to be normal. \n4. Plain and simple the argument of \"it's a natural substance so it's not bad\" is a logical fallacy. There are many things that occur naturally in our world that are bad for us.",
   "created_utc": 1694873206,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u8xcs",
   "message": "Our government paid over 1 billion dollars to Fauchi's NIH for research into abuse of cannabis.  Why are we researching abuse of a plant used safely for thousands of years? https://www.thelancet.com/journals/lanam/article/PIIS2667-193X%2822%2900142-9/fulltext",
   "created_utc": 1694873979,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u9w17",
   "message": "It melts your brain. I don't want to live around people with melted brains.",
   "created_utc": 1694874372,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u9ymk",
   "message": "I hate the culture around it. \n\nI hate people who make excuses for it. I hate people who say it's harmless and \"not addictive\" yet can't seem to wake up, sleep, eat, watch a movie, or drive without it. I hate the smell of it. I hate that it turns you into a *fucking moron*. \n\nThere are uses for it, like cancer patients for example. But I associate it with people in wife beaters and shitty tattoos they've had since they were 14 and people who use it to cope with their own miserable existence that they could do something about if they weren't so fucking addicted to weed.",
   "created_utc": 1694874401,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0ua9fk",
   "message": "I’m not particularly opposed to it, but there are people who can smoke up recreationally and there are those who let it control their lives. \n\nAnd more often than not, those who let it control their lives end up not being worth my time…",
   "created_utc": 1694874525,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0uafv6",
   "message": "People can be obsessed by anything. How hard is it to understand that something that, upon smoking, makes everything, - well, just fine actually - triggers it?",
   "created_utc": 1694874598,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0trngw",
   "message": "I just want to relax in my living room without the smell of weed seeping through from the neighbors apartment. Or walk down the street and smell it from cars all the time. Make the neighborhood feel cheap and dirty",
   "created_utc": 1694865822,
   "score": 6,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0twrsz",
   "message": "I am not opposed to it but I think we as a society has a huge problem with people seeking out substances as a way to deal with deeper issues. Be it alcohol or drugs.\nI fear that by legalizing more we use it as excuse for self medicating and avoid looking at the deeper issues of mental health in our society.",
   "created_utc": 1694868540,
   "score": 5,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tpio6",
   "message": "I always feel dumber after having some. I do notice regular users are kinda dumbasses",
   "created_utc": 1694864591,
   "score": 9,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tgfdb",
   "message": "Ronald Reagan convinced everyone that marijuana was the devil.",
   "created_utc": 1694858156,
   "score": 7,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tejpw",
   "message": "I am not opposed to it, I myself use it but I feel like smoking it is bad, now a days there are so many alternative products where its legal like edibles and candies even butter etc. Marijuana changed my life, it really helped me with anxiety, insomnia and depression. I would rather take weed than take anti depressants.",
   "created_utc": 1694856639,
   "score": 3,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0th7y7",
   "message": "I’m not opposed to it per say….. I just physically get sick over the smell and the antidepressants that I’m on are GUARANTEED to hurt my brain chemistry if they interact with weed.",
   "created_utc": 1694858776,
   "score": 4,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tnob5",
   "message": "I'm not really against it myself but my teacher is super against it because she thinks it makes you age backwards.",
   "created_utc": 1694863458,
   "score": 3,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0thplh",
   "message": "i just dont like using drugs to make myself feel better. it doesn't feel morally right. i have the same opinion about alcohol.",
   "created_utc": 1694859160,
   "score": 3,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tu1ae",
   "message": "It’s a recreational drug that has negative effects. Should be obvious.",
   "created_utc": 1694867119,
   "score": 7,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tdml3",
   "message": "Same reason as alcohol",
   "created_utc": 1694855888,
   "score": 4,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0toag9",
   "message": "It’s not good for the brain to be put in that state of being. It has medical uses, sure, but marijuana is mentally harmful.",
   "created_utc": 1694863849,
   "score": 2,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0txfzt",
   "message": "There’s a lot of comments on smell, but there’s multiple ways to consume it, Edibles and Oils being two common ways.",
   "created_utc": 1694868872,
   "score": 2,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tc9ei",
   "message": "Life is beautiful, no reason to numb yourself.",
   "created_utc": 1694854782,
   "score": 2,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tc062",
   "message": "I’m not against it, but I used to smoke. Waste of time and money. Do a real drug people",
   "created_utc": 1694854572,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tgc8y",
   "message": "Opposed to it in the sense that I'd never smoke it, or that I don't want it to be legal? Personally, I don't really care what other people do with their own health. They could be doing heroin or meth for all I care, I'm not going to oppose that.",
   "created_utc": 1694858088,
   "score": 2,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tnw55",
   "message": "A: it smells like shit. B: my salary is better than any drug induced high",
   "created_utc": 1694863597,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u42lm",
   "message": "People in this thread don't know enough about weed to know why they would be opposed to it. Complaining about the smell when you have car exhaust clogging the air in the world is high comedy. \n\nI swear someone on here was cheated on by their partner that smoked weed and now they hate it, getting those vibes from some replies.",
   "created_utc": 1694871910,
   "score": 1,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0tpp7i",
   "message": "Becous of an efect it has on individuals and comunitis. How it destroys productivity and prevents normal speak and thinking in people. \nHow it instantly changed normal and productive people I used to know in selfish, hedonistic and useles burdon to our community.",
   "created_utc": 1694864701,
   "score": 3,
   "submission_id": "16k2hhc"
  },
  {
   "comment_id": "k0u9k86",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16k2hhc"
  }
 ]
}