{
 "submission_id": "16kdqgp",
 "title": "What do women want during oral sex but will never say?",
 "selftext": "",
 "created_utc": 1694887074,
 "permalink": "/r/AskReddit/comments/16kdqgp/what_do_women_want_during_oral_sex_but_will_never/",
 "score": 75,
 "url": "https://www.reddit.com/r/AskReddit/comments/16kdqgp/what_do_women_want_during_oral_sex_but_will_never/",
 "comments": [
  {
   "comment_id": "k0vifnf",
   "message": "For u to keep doing that same thing and not switch it up",
   "created_utc": 1694891176,
   "score": 187,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vk62b",
   "message": "When I say lighter I fucking mean it stop trying to push my clit inside my body pls 😭",
   "created_utc": 1694891842,
   "score": 170,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vt6go",
   "message": "If you spend enough time teasing, kissing and licking over panties, hot breath , caressing, nibbling and licking all around- but not going straight for the clit- you will really only have to invest a few minutes on actual oral to get me off. Honestly the anticipation is the best part- drag it out. (And don't forget suction when the time comes)",
   "created_utc": 1694895218,
   "score": 132,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vkauw",
   "message": "Don't go down there so quickly!! I mean we need more foreplay, more thighs touching and kissing, and more importantly tease the pussy. you can touch it without undressing her. And when you go down there, start slowly with passion and take your time before completely eating it🦋",
   "created_utc": 1694891894,
   "score": 159,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vedjd",
   "message": "To quote our male counterparts, enthusiasm and perseverance. We want you be super amped about giving us oral, not just pretending to be. 😏\n\nAlso, when we say “don’t stop”, don’t fucking stop or start doing something totally different.",
   "created_utc": 1694889626,
   "score": 85,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0v8m0t",
   "message": "Perseverance 😛",
   "created_utc": 1694887436,
   "score": 130,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vsqsq",
   "message": "Eat it for awhile *before* you add the fingers . It all feels good but, I like the build up.",
   "created_utc": 1694895055,
   "score": 103,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vb3gz",
   "message": "To be touched and teased everywhere, not just immediately nose dive to the clit. Lick, kiss, bite--pretend like my whole body is a meal you want to savor. And add some fingers once in a while.",
   "created_utc": 1694888394,
   "score": 213,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vp0zv",
   "message": "It’s easy to rush in and just go 0-60 with no buildup. Definitely slow play the encounter, savor the moments and make a tantalizing approach (like physically as you move in closer and closer— kisses down the inner thighs, run your hands up and down her outer thighs, etc). Treat the encounter as a chance to savor the most private and personal essence of a partner, and keep your own feedback to yourself (IE, don’t whine if you happen to catch a hair or if she doesn’t taste like a pina colada). \n\nFor those of y’all out there who genuinely don’t like doing it, I’m sorry. Soldier on as best ya can. \n\nOh, also, totally underrated aspect: get comfy and just relax. It’s so easy to zero in and focus so hard that you don’t even realize you’ve been tensing neck and face muscles for 6 minutes straight and now it hurts. Pillow under her hips can help reduce neck strain big time, plus it makes it a lot easier to get fingers involved.\n\nShit I didn’t answer the question, guess I can’t really. Hopefully that’s some useful info for anyone floundering down there 😂",
   "created_utc": 1694893663,
   "score": 127,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vlc8h",
   "message": "Smooth face and chin please (or full on beard) the stubble rubbing anywhere on my vulva totally overrides the ability to feel your tongue",
   "created_utc": 1694892282,
   "score": 22,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vgr5b",
   "message": "Bisexual woman here who loves eating pussy. \nDo it without being asked.\nUse anticipation to flirt, wispering to her how much you want her pussy in your mouth. \nMake it obvious you enjoy it.\nBig slow licks to get them warmed up and slow focused licks and sucks on the clit when its obvious theyre warmed up. \nDon't stop unless she tells you to.\nIm very direct and will give my partner pointers, if they don't do that then ask what they like or don't like.\nKiss, suck, tell them they smell good, treat it the clit like a small but more sensitive penis.\nTouch their thighs or massage labia gently during or defore. \nDon't be arrogant, every woman is their own rubix cube.\nUse different positions if she is open to it. I like her seated on a chair, legs spread, me kneeling and licking slow with lots of eye contact. Tell her how sexy she looks from down there.",
   "created_utc": 1694890527,
   "score": 48,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0v94ex",
   "message": "I’m never comfortable doing it bc I’m thinking more about him getting tired or uncomfortable and me taking too long.",
   "created_utc": 1694887630,
   "score": 167,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vm1qx",
   "message": "Finish what you started? Don’t just lick for a few minutes and then mount me like a deers head on the wall?",
   "created_utc": 1694892549,
   "score": 128,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vo64b",
   "message": "Frankly this comment section is turning me on. Husband will be so pleased to have sex 10 minutes after getting home from work.",
   "created_utc": 1694893342,
   "score": 52,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vums3",
   "message": "if we say it feels good, don’t fuckin speed up or change anything you’re doing! ruins the buildup of an orgasm. just be calm, patient, and keep doing exactly what you are doing.",
   "created_utc": 1694895753,
   "score": 178,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0w3b1t",
   "message": "To watch him jack off while he eats you out",
   "created_utc": 1694898989,
   "score": 168,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vuu0q",
   "message": "More passion. More passion. More passion. More energy. More energy",
   "created_utc": 1694895829,
   "score": 214,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0w2acd",
   "message": "The same thing they want in relationships. \n\nConsistency, gentleness and commitment to a positive outcome!",
   "created_utc": 1694898599,
   "score": 64,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0wjo41",
   "message": "Sure there's nerves everywhere but FOCUS ON THE CLIT.\n\nAlso, porn is not sex school. Stop being so damn extra down there, straight cunnilingus porn is trash lol.",
   "created_utc": 1694905577,
   "score": 65,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vu5h1",
   "message": "Suck the clit! Not just lick it",
   "created_utc": 1694895579,
   "score": 65,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vr4pz",
   "message": "When you feel us getting nearly there, for the love of all the Pokémon, do not stop what you are doing. \nDo not change it up, keep at that speed, pressure and tempo.",
   "created_utc": 1694894461,
   "score": 128,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vmnjx",
   "message": "Don’t go too hard!! It can start to hurt",
   "created_utc": 1694892775,
   "score": 171,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0v827r",
   "message": "Commitment",
   "created_utc": 1694887223,
   "score": 138,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vftsb",
   "message": "Hold her hand.\n\nUse your voice to create vibration.\n\nEnjoy yourself and she will enjoy you.",
   "created_utc": 1694890174,
   "score": 121,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vo4ad",
   "message": "more time…. more than 2 minutes..\nI can only cum from head or fingers, not penetration. so stopping before I finish is so frustrating\n\n(I do tell my man this tho and he’s good about it usually lol)",
   "created_utc": 1694893323,
   "score": 163,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vr4ao",
   "message": "Trim your fingernails.",
   "created_utc": 1694894457,
   "score": 29,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vwakz",
   "message": "How bout actually receiving it to begin with. I haven’t been eaten out in almost a year. I just want someone to tell me to get on the bed and then have their way with my pussy.",
   "created_utc": 1694896362,
   "score": 0,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vab4t",
   "message": "CONSISTENCY WHEN WE SAY \"DONT STOP\"",
   "created_utc": 1694888091,
   "score": 195,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vm2qm",
   "message": "Look up the 7 erogenous zones on a woman and memorize them",
   "created_utc": 1694892559,
   "score": 127,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0wacpg",
   "message": "Play with her balls",
   "created_utc": 1694901720,
   "score": 130,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vbkgu",
   "message": "About 20 more minutes",
   "created_utc": 1694888571,
   "score": 122,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vf76o",
   "message": "They want you to find the spot and then don’t change a thing.",
   "created_utc": 1694889933,
   "score": 213,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vo5kk",
   "message": "If you can make it to the first orgasm, the next few will come much easier. Multiple orgasms during oral leads to amazing intercourse.",
   "created_utc": 1694893336,
   "score": 102,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vttzb",
   "message": "Don’t just lick, suck",
   "created_utc": 1694895460,
   "score": 73,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0v7qjq",
   "message": "More cowbell",
   "created_utc": 1694887099,
   "score": 133,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vdbtu",
   "message": "Idk but my gf grabs my head and humos my face or she'll wrap her legs around my head while moaning so I'm doing something right lol",
   "created_utc": 1694889235,
   "score": 60,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vq8wo",
   "message": "Start out like a butterfly and land softly everywhere. Finish like a Bulldog eating oatmeal",
   "created_utc": 1694894123,
   "score": 39,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vnmtc",
   "message": "Keep going \n\nDon’t change what you’re doing when you can tell it’s working \n\nUse your hands from behind \n\nTouch my butthole a little while your back there \n\nBlowing him at the same time helps get me there too.  \n\nI don’t know if cause I like it, or I have more hip freedom when I’m sitting on his face.",
   "created_utc": 1694893140,
   "score": 35,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0w3f8e",
   "message": "Don't even bother using your fingers unless your nails are trimmed.",
   "created_utc": 1694899035,
   "score": 29,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0wbc7i",
   "message": "A lot of us prefer the build up versus you going straight for the clit. \n\nLike, we kinda need to actually get turned on first before that's pleasurable. Otherwise it's way too much stimulation and just feels invasive.",
   "created_utc": 1694902120,
   "score": 35,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vgpn8",
   "message": "An orgasm……multiple orgasms",
   "created_utc": 1694890511,
   "score": 88,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0w9pr2",
   "message": "Talk to me with my puss in your mouth. A like “mmhm mmhm good girl cum for me” goes a loooong way. Push my legs up over my head and bury your face in it. 🥵",
   "created_utc": 1694901461,
   "score": 154,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vsymc",
   "message": "Light pressure is best (at least for me, anyway). The clitoris is extremely sensitive and you don’t need to apply much pressure to make us orgasm, and too much pressure either does nothing, or hurts.",
   "created_utc": 1694895138,
   "score": 56,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0voy9z",
   "message": "If I’m moaning, I want you to carry on doing what you’re doing. I shouldn’t have to say “don’t stop” or “just like that”. I feel like when I say “just like that”, they change what they are doing, so I find it better to say nothing at all.",
   "created_utc": 1694893634,
   "score": 26,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0v8b96",
   "message": "The orgasm. Not sure why, but most men aren't able to stay long enough to get the girl to pop using just their mouth.",
   "created_utc": 1694887320,
   "score": 253,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vlkle",
   "message": "Listen to us for god sake. We will tell you what to do. I don’t want you to try to penetrate me with your tongue, just circle the the clit. I’ll say that, though.",
   "created_utc": 1694892369,
   "score": 75,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vexrs",
   "message": "Lol so many PhD Pussy lickers here and so few women commenting. I have been with enough women to lose count (not a brag just a fact) and every single one had different preferences. What women want is for you to pay attention to their reactions until you find something that pleasures them, then keep doing that. Basically.",
   "created_utc": 1694889834,
   "score": 97,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vvrpl",
   "message": "I want a man to make it known much they love it, how good it tastes, how much he loves my pussy.. the foreplay leading up to it is crucial.... Some sensual touching, fingering... I gotta be excited first or it will take to long to finish..",
   "created_utc": 1694896173,
   "score": 18,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vcyzf",
   "message": "Less teeth",
   "created_utc": 1694889098,
   "score": 32,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0w8250",
   "message": "I wish I could answer this. When guys go down on me it does literally nothing for me. Am I alone in this??\n\nI’ve had sex with a fair amount of people and every time they do this I’ll be laying there thinking “meh I’m bored. let’s do something else.” Seriously. Seems like every woman loves it so I feel really left out",
   "created_utc": 1694900821,
   "score": 32,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0wh410",
   "message": "Kissing, kiss my neck, play with my tits, suck on my tits, hands play with the clit, and then finally eat me out, keep playing with my hits and I’ll get wetter…",
   "created_utc": 1694904515,
   "score": 16,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0v9ics",
   "message": "I don’t wanna have to ask, I want to be fingered, I want you to be passionate and enjoy that shit, damn son moan a little, shit don’t go DIRECTLY on the clit, have some manners jesus",
   "created_utc": 1694887782,
   "score": 50,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vx1pe",
   "message": "I want my boyfriend to actually give me oral 😒",
   "created_utc": 1694896640,
   "score": 31,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vzc3k",
   "message": "Personally I don't like it at all. \n\nEvery single time I get a yeast infection or BV. I don't know what the problem is but I've been traumatized to the point I don't want anyone's mouth anywhere near me down there.",
   "created_utc": 1694897492,
   "score": 32,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0vyzt1",
   "message": "For you to stay and appreciate it longer.\n\nMy partners would only stay down there for a few minutes to tease, and that was it. Then, onto their pleasure: penetration.\n\nNever found someone who likes oral...",
   "created_utc": 1694897364,
   "score": 15,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0w7ane",
   "message": "When they say don’t stop they really fucking mean it. We’ve all been there, the jaw hurts, we are quickly running out of steam, unsure if that thing we’ve been doing for the last few minutes will be the one to get her over the top.  She drops the “Don’t stop” and what that means for you is it could be another 10 seconds or 10 minutes, you’ll never know but you absolutely cannot stop.",
   "created_utc": 1694900528,
   "score": 13,
   "submission_id": "16kdqgp"
  },
  {
   "comment_id": "k0wcwrx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16kdqgp"
  }
 ]
}