{
 "submission_id": "16kmj7i",
 "title": "Whats the worst (physical pain) you've ever felt?",
 "selftext": "",
 "created_utc": 1694909806,
 "permalink": "/r/AskReddit/comments/16kmj7i/whats_the_worst_physical_pain_youve_ever_felt/",
 "score": 158,
 "url": "https://www.reddit.com/r/AskReddit/comments/16kmj7i/whats_the_worst_physical_pain_youve_ever_felt/",
 "comments": [
  {
   "comment_id": "k0wv4dn",
   "message": "Sciatica pain. One morning getting out of bed it literally dropped me to the floor.",
   "created_utc": 1694910443,
   "score": 195,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wv5gu",
   "message": "compacted and infected wisdom teeth- they had to partially crack my jaw to get it out. couldn't chew solids for 12 days",
   "created_utc": 1694910456,
   "score": 123,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wyevg",
   "message": "I suffer from chronic headache/migraines. At least two occasions I literally couldn’t care if I died or not because the pain from a migraine was so bad. I had a broke arm with a compound fracture skateboarding as a teen, that pales in comparison. Not saying I’d rather break my arm again but at no point was I thinking i wanted to die because of the pain like I do when I get a really bad migraine.",
   "created_utc": 1694911860,
   "score": 89,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wxfia",
   "message": "I broke my back... doing a backflip... at a gymnastics gym... into the 3m deep foam pit x.x\n\n\nWent to do an inverted backflip (done many times on the ground even). Was too excited at the height of my jump from the trampoline run up to the foam pit I forgot to tuck. I noticed when I was already coming down from the height.\nThrew my arms and legs up and around in panic. Fell straight down into the deep pit, followed by my legs crumpling down on me.\n\n3 discs shot out my back at once.",
   "created_utc": 1694911426,
   "score": 67,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x750f",
   "message": "Being on fire felt awful\n\nBonus: the smell",
   "created_utc": 1694915801,
   "score": 63,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wz649",
   "message": "You ever piss a bloody rock out of your peehole?\n\nOr have a rock get stuck and block your pee tube? Just get hit in the back with a sledgehammer and kicked in the balls. Over and over.",
   "created_utc": 1694912189,
   "score": 111,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x09q7",
   "message": "Acute pancreatitis. It was so painful, three vials of IV Dilaudid (hydrocodone) wasn’t enough to quell it",
   "created_utc": 1694912674,
   "score": 39,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x1n1x",
   "message": "Shingles, man. God damn what the fuck was that shit?",
   "created_utc": 1694913291,
   "score": 35,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wu7bm",
   "message": "I got stung by a tarantula hawk once. I suppose if I had to describe the pain, it would be kinda like getting stabbed by an electric knife. Or what I imagine that would feel like, anyways.",
   "created_utc": 1694910048,
   "score": 35,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x5gfm",
   "message": "Massive esophageal bleeding due to my alcoholic ass drinking hand sanitizer and rubbing alcohol for a week. Yeah, I know. It felt like I’d swallowed hot coals; I was vomiting what looked like runny coffee grounds and the pictures from the endoscopy looked like someone had taken a steel wool to my insides. A week in the hospital. This was years ago but I still need to take Prilosec every day.",
   "created_utc": 1694915038,
   "score": 30,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wug45",
   "message": "Tossup between a bad UTI and really bad road rash from a fall. \n\n(Obligatory, I've birthed kids unmedicated and that wasn't as bad)",
   "created_utc": 1694910151,
   "score": 27,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x57ko",
   "message": "Ovarian cysts",
   "created_utc": 1694914929,
   "score": 24,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wvfn6",
   "message": "labor and child birth. don't wanna go through that again",
   "created_utc": 1694910577,
   "score": 45,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x02zs",
   "message": "Kidney stones",
   "created_utc": 1694912591,
   "score": 22,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x3di3",
   "message": "Stabbed in the stomach (didn't hurt that much) but when my bowel started leaking I wanted to die",
   "created_utc": 1694914087,
   "score": 21,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x739v",
   "message": "I was recovering from having my gallbladder removed and my cat jumped from the headboard and landed directly on one of the incisions.\n\nI thought I had died",
   "created_utc": 1694915779,
   "score": 22,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wuh8t",
   "message": "Ear infection, such immense pressure while so much pain, threw up of because of the intense pain, and also my ears were pretty much a soup",
   "created_utc": 1694910165,
   "score": 20,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x4xv3",
   "message": "First IUD insertion…I almost passed out then vomited from the pain.",
   "created_utc": 1694914805,
   "score": 19,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wtx9q",
   "message": "Personally for me, after a biking venture about a year or two back I got a really bad migraine while laying on my sofa bed. I had LED lights and I couldn't walk to the remote since standing up would mean opening my eyes and seeing light, I was home alone and couldn't look at my phone to call anybody really so I threw myself facing down on the floor with a pillow, vomitted, fell asleep, and woke up on my bed courtesy of my mom",
   "created_utc": 1694909931,
   "score": 18,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wu5yb",
   "message": "Cellulitis infection in my leg.  It was so bad I couldn't even bear to have the wind blowing on it.",
   "created_utc": 1694910031,
   "score": 32,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x4zq2",
   "message": "Slept with someone who said they contracted a venereal disease somewhere along the way so I had to get tested.  A young female nurse, of all people, stuck a cotton swab into my dick, and it felt like being struck in the pee hole by lightning.  I had to be peeled off the ceiling.\n\nFortunately, I had a clean bill of health.",
   "created_utc": 1694914828,
   "score": 16,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xbuad",
   "message": "Ovarian torsion. Morphine didn't touch the pain",
   "created_utc": 1694917943,
   "score": 14,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x1ouc",
   "message": "Kidney stones.",
   "created_utc": 1694913314,
   "score": 13,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wzs7t",
   "message": "Childbirth. And to think I’m about 3 weeks from doing it again…",
   "created_utc": 1694912459,
   "score": 25,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x1yue",
   "message": "Had a kidney stone that got stuck on its way down to the urethra.  Felt like I was getting a gas buildup at first but couldn't get it out.  After an hour I was on the bathroom floor in excruciating pain and finally left for an ER.  Took 30 min to get there and another hour to get any pain meds in me.\n\nTotal time was about 3-4 hours of the worst pain I've ever felt.  Was doubled over and wife said my face was white the entire time.\n\nI'll never forget the first 8 seconds the pain med kicked in and relieved the pain.  That feeling of ecstasy will never leave my memory.",
   "created_utc": 1694913443,
   "score": 10,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x37h6",
   "message": "I once had a migraine, a kidney stone and my period all at the same time. Totally made me reevaluate my pain scale.",
   "created_utc": 1694914009,
   "score": 10,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wyrns",
   "message": "Vascular 'cluster' headaches.  Oof.  Glad they stopped but had them for 15 years.",
   "created_utc": 1694912014,
   "score": 9,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x3z0l",
   "message": "I have a tie\n\nSpinal surgery to repair a ruptured disc. (That did not work). This was the longest amount of pain l, several weeks of terrible pain. \n\nA 22mm kidney stone. It had to be removed surgically. That was more pain but for a shorter amount of time.",
   "created_utc": 1694914365,
   "score": 8,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wz5vn",
   "message": "Ulcer on my eyeball. That suuuuuuucked.",
   "created_utc": 1694912186,
   "score": 7,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wwnw8",
   "message": "Not as bad as some of the ones I've read here, but I once had a 3 hour long nosebleed that only ended when the doctor chemically cauterised the inside of my nose without anasthesia. On the bright side, it marked an end to my regular nose bleeds",
   "created_utc": 1694911097,
   "score": 7,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wxv0k",
   "message": "Cracked or broken ribs.  I actually have a very high pain tolerance but this lasted for several weeks and that was a bit much for me.\n\nLong story on how this happened to, but I've told it before",
   "created_utc": 1694911613,
   "score": 6,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xeb29",
   "message": "I recently got a Pilonidal cyst and it freaking sucks. The very uncomfortable and slightly painful.\n\nThe extremely painful part came when i went to the doctor to cut it and drain it. They numbed the area ( supposedly) and cut and drained it. Holy mother is God it hurt. I was screaming and grunting. I've had COVID and I've broken a wrist so far in my life and this was the worst so far.\n\nI still need to go get a surgery to remove it soon so please pray for me Reddit. 😭",
   "created_utc": 1694919076,
   "score": 4,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xemgl",
   "message": "Gout in my left big toe *and* a kidney stone at the same damn time.",
   "created_utc": 1694919220,
   "score": 7,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wu41y",
   "message": "Leg cramps, which usually happens in one leg.  However, sometimes both of my legs have cramps at the same time.",
   "created_utc": 1694910009,
   "score": 10,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wzdzk",
   "message": "Slipped disc is no fucking joke.",
   "created_utc": 1694912284,
   "score": 9,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x29wz",
   "message": "The pain after an open adrenalectomy, splenectomy, nephrectomy and large tumor removal. I'd rather have had another child.",
   "created_utc": 1694913584,
   "score": 4,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wziju",
   "message": "Sex induced headache. It sounds like a made up thing (but you can google it). Painful enough that I literally got up and fell on the floor. It was amazing and I was convinced I was about to die.",
   "created_utc": 1694912341,
   "score": 4,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wztrr",
   "message": "Had muscle spasms in my neck. Needed both steroids and painkillers.",
   "created_utc": 1694912477,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x3qkk",
   "message": "Kidney stone that ultimately caused kidney infection and emergency surgery.",
   "created_utc": 1694914257,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x8lbo",
   "message": "Period cramps.",
   "created_utc": 1694916459,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xbaxf",
   "message": "Having endometriosis that gets slightly worse each month.\n\nI've passed out from the pain before as well as throwing up from the pain.\n\nIt ain't fun. Id rather my toe turned black (again) than this.",
   "created_utc": 1694917695,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xbuwp",
   "message": "SEVERE PERIOD CRAMPS",
   "created_utc": 1694917951,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xmjy2",
   "message": "Getting a copper IUD put in while not on my period. (They recommend, or at least my doctor did, to get the IUD inserted while on your period so it’s “easier” to go in). I have a high, high pain tolerance. I almost blacked out. I remember looking up at the ceiling that was painted like a sky and the doctor and nurses telling me they can’t believe how well I’m “handling” it, and I just remember almost blacking out. It was on my birthday, and I drove myself home after. Never again.",
   "created_utc": 1694923180,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xml1z",
   "message": "This one hangover from college. I could not move for 24+ hours. If I literally moved my pinky finger I would begin violently throwing up. \n\nIt was THAT bad, I elected to just piss myself all day and night rather than go to the bathroom. \n\nChills, fever, stomach and unrelenting nausea and throwing up",
   "created_utc": 1694923197,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xn1qr",
   "message": "Having an IUD implanted. You don’t get any anesthesia, and your uterus goes into major cramps as it reacts to the foreign object being stabbed into it. I went home afterwards and just curled up in the fetal position in my bed.",
   "created_utc": 1694923441,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xtj1u",
   "message": "Heart break(yes it does things to your body physically). Endometrisos. Osteoarthritis. 2nd degree burns. Dental infection. Improperly inserted Iud.  Each were so bad in the moment I would've rather been dead.",
   "created_utc": 1694927019,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0ybnaz",
   "message": "One time I ate a big bowl of rice crispies and drank aaaaallll the milk. I legit thought I was dying and tried to go to the hospital. On the way there I threw up all the milk out of the window (after several hours of agony) and went from dying to just on my death bead. It all subsided by the end of the day",
   "created_utc": 1694938658,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0ykll3",
   "message": "Period cramps.\n\nPilonidal cyst comes a close second, but at least that didn't make me spew stuff out of both ends in desperate vain pleas to relieve the pain and leave me curled up in the fetal position on the bathroom floor for two days straight.",
   "created_utc": 1694944852,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x7a9s",
   "message": "When I was about 12 years old, I fell off my bike and half of my nail was ripped off, diagonally. Unfortunately, the other half got infected, so I went to the pharmacist and asked them what I should do, as per my mother's instructions. The pharmacist said that I needed to have the rest of the nail removed and then apply this cream. Unfortunately, the pharmacist did not clarify that I should go to the doctor's office and have it removed, so I went home, grabbed a pair of pliers, and ripped my nail off. Initially I felt nothing beyond a bit of a tug, and then this extreme pain just ripped through me.",
   "created_utc": 1694915868,
   "score": 4,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0wvk7h",
   "message": "Being shot in the middle part of my chest from a dream and physically feeling it when i woke up",
   "created_utc": 1694910633,
   "score": 3,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x0o6e",
   "message": "Extreme nerve damage, I would take a million broken bones over the amount of pain I am in, and doctors can't do shit about it.",
   "created_utc": 1694912853,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x2gne",
   "message": "I completely tore my left hamstrings and glutes in a sports injury this past January.\n\nMuch worse than passing a stone.",
   "created_utc": 1694913672,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x2jvd",
   "message": "Breaking my leg. Couldn't take the pain so I did wim hoff breathing until it went numb. Its a great life hack",
   "created_utc": 1694913713,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x3gqg",
   "message": "Sneezing after having a hernia surgery",
   "created_utc": 1694914129,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x3vqf",
   "message": "Ruptured spleen",
   "created_utc": 1694914323,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x4dru",
   "message": "I broke my arm in the 6th grade at school. Rather than tell my mom, I hid the injury from her for over a day. She eventually saw my very swollen arm after reaching for a plate at the dinner table. The pain was excruciating.",
   "created_utc": 1694914550,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x4g7k",
   "message": "Kidney stone for sure.",
   "created_utc": 1694914580,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x5qej",
   "message": "Tib/fib compound fracture, got crushed by a forklift :)",
   "created_utc": 1694915165,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x60un",
   "message": "Fractured my wrist , and decided to not go to doctor ( because the pain will fade ) the most painful 12 hours .",
   "created_utc": 1694915297,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x6a1c",
   "message": "I was stung by a bunch of yellow jackets. The pain was awful and lasted for almost 2 days.  I've read that they're beneficial, so i decided to just leave them alone.  But all I wanted to do at the time was kill them.",
   "created_utc": 1694915410,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x6jd2",
   "message": "Dry socket after wisdom tooth removal. Worse than natural childbirth. Which was actually not as painful as medicated childbirth where the baby was Sunny side up instead of face down like they’re supposed to be. 17.5 hours of back labor was definitely second worst pain of my life. \n\nAnecdote: I once had a toenail ripped cleanly off completely and it was like 20th on my list of most painful stuff. Nowhere near what you would think.",
   "created_utc": 1694915527,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x7pap",
   "message": "Reddit mods doing biased bans",
   "created_utc": 1694916057,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x7ws3",
   "message": "Before breast cancer surgery. They injected radioactive die into my nipple so they could trace lymph flow to the sentinel lymph node to check it for cancer.  I wrote another comment about back pain that was extreme.  That was the most prolonged pain. The shot into my nipple was the most excruciating 90 seconds or so of my life.  Thankfully it didn’t last but it did help them find cancer in my sentinel node and 1 other, so there’s that.",
   "created_utc": 1694916152,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x84rc",
   "message": "It might be common and pretty damn lame but the morning I woke up with a stabbing pain on the lower right of my torso. \n\n\u0026amp;#x200B;\n\nYes it was my appendix (doctors said it was pretty close to bursting) and to this day (23 years ago) is the worst physical pain Ive ever had",
   "created_utc": 1694916251,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0x9k4g",
   "message": "C-section, my epidural failed to work and I could feel my entire c-section. I was screaming in pain and I had to be held down until the anesthesiologist could gas me. My heart stopped for almost 30 minutes and they came out and told my kids father “here’s your new child, but your wife might not make it… congrats” yeah, very fucked up situation… congrats, but here’s some bad news.",
   "created_utc": 1694916901,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xaddb",
   "message": "i had a 2cm ovarian cyst rupture",
   "created_utc": 1694917271,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xaxsp",
   "message": "Kidney stones or else diverticulitis.  Both pretty similar. Has you screaming in pain until they get you on meds and fix the issues. Can't even stand up straight.",
   "created_utc": 1694917529,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xekkd",
   "message": "Abdominal pain from Passing a chipped tooth\n\nTooth abcess\n\nHeart attack\n\nThrowing out my back at the bottom disc",
   "created_utc": 1694919195,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xeq3z",
   "message": "Shingles on my face and in my mouth and ear.",
   "created_utc": 1694919267,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xg36l",
   "message": "Contractions after my water broke 🥲\nI was fine dealing with them until my water broke, and then it did. I sat down on the toilet and literally could not get back up without help from the nurse. Fentanyl didn't touch it. I could barely breathe. It literally was causing all my other muscles to go stiff and my back locked up. I had to deal with this for two hours until the midwife could confirm my water broke and call the anesthesiologist for the epidural. I could barely sit up straight and still to get the epidural.\nMakes me never want to have another child. I will, of course, because I want more than one child. But goddamn was that pain like no other. And I've pushed out kidney stones before.",
   "created_utc": 1694919922,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xgnaf",
   "message": "Was drunk walking in some train tracks with friends and I tripped hard, smashed both my knees into the rocks slammed my jaw off the rail and tore my shoulder apart. Next day I woke up un able to move and crying it hurt so fucking bad",
   "created_utc": 1694920188,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xke2y",
   "message": "I had a uterine biopsy with no painkillers and no idea of how bad it was going to hurt. I almost passed out.",
   "created_utc": 1694922060,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xkpoj",
   "message": "Well it's hard to pick just one.\n\nTheres the Gout episode that got me an ambulance ride years ago cuz it crashed my blood pressure to 80/40. blowing air over my big toe felt like someone had split the knuckle open and scrubbed the joint insides with a steel wire bristled brush.\n\nThen there was the flair of my chronic intestinal condition that had my body acting on it's own  in some surreal idiotic panic to escape the pain, I'd left my body and was watching from outside myself as I grabbed giants wads of toilet tissue in both hand dabbing at my stomach and not understanding why it wasn't helping, and then bolted for the door trying to escape the pain. I don't remember anything past the door but a loud bang at one point. I know I navigated through 4 rooms, two of which had been under renovation and I had scrapes and a sprained ankle after. I woke on the floor next to my bed amid the debris of the flimbsy night table beside the bed. I staggered up into bed onto my back with my arm draped over my forehead... woke 2 hours later, sat up and found my arm and face were covered in blood. I'd spained a wrist (on top of the ankle) and bruised all over, scrapes an splinters and had split my eyebrow open. It really should have gotten stitches, but two hours of pressure from my arms dead weight on it did the job of stopping the wound. That was a preety bad level of pain all around.\n\nBut then there when the gallbladder tried to kill me. good lord that was like nothing I've ever felt before. You ever swallow too big a jagged bit of cookie or cracker? Imagine that scraping bit of hard jagged feelling but from the right side ribs toward your solar plexus, where it thunks into place and everything cramps up, I couldn't even get breath. I was just making feeble gasps like mini hickups to try and get air. an ambulance ride where they gave me some heaviest of pain killers they had and it cut the pain by 1/5. In the emergency room they had me waiting for what seemed an eternity, during which the drugs wore off twice, and all I could do was squirm, gasping out questions about why I hadn't passed out yet, shouldn't I pass out. which became why haven't I died yet... 4.5 hour surgery (instead of 45 mins like most), 7 days in hospital (and if you've never had an abdominal drain pulled out while you are awake you are blessed to never know what it feels like to have plastic tubing scraping across the surface of your internal organs) and some vomiting bile and food I'd eaten 5 days ago with fresh surgery incisions throbbing with every heave. Voiding blood, and a second return to surgery to solve that. turning yellow like a minion. and a double sized gallbladder and two bile ducts (yup, two of the f-ers) with stent and cauterized opening. leakage into the abdominal cavity and maybe some lost stones. and a medical system that left me with little other then tylenol for most of the pain after surgery.\n\nFrankly I'd like to never experience any of these ever again.",
   "created_utc": 1694922225,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xn3b4",
   "message": "oh I also got ate up by this mysterious brand of ants 🐜 in south carolina…. my arm went numb and limp and I couldn’t move it. the pain was insufferable I was writhing and crying for a full 24 hours",
   "created_utc": 1694923463,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xnqfg",
   "message": "Cutting my big left toe off with a push mower. July 4th 1987 at 4:30 pm",
   "created_utc": 1694923802,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xt0ub",
   "message": "I’ve had shingles, gout, and torn my ACL. Pick one.",
   "created_utc": 1694926740,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xtba0",
   "message": "Removing Cyst in armpit. Legitimately wanted to punch the doctor who was cutting it. So many nerves the numbing medicine didn’t help at all",
   "created_utc": 1694926897,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0y0vku",
   "message": "I had a kidney stone once. I could feel pain even with morphine.",
   "created_utc": 1694931433,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0y2jx1",
   "message": "separate",
   "created_utc": 1694932488,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0y2kew",
   "message": "Pancreatitis...",
   "created_utc": 1694932497,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0y51ez",
   "message": "Broke my collar bone into 3 pieces. Yeah that sucked.",
   "created_utc": 1694934162,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0ycvok",
   "message": "The aftercare of when I got my butthole cut open for a perianal abscess surgery. For 17 days I needed to have direct stimulation of the nerves between my balls and butthole with gauze to keep the wound open. The worst part was that the abscess came back and it was all for nothing.",
   "created_utc": 1694939473,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0yhwjp",
   "message": "My body rejecting an IUD",
   "created_utc": 1694942933,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0yhzbu",
   "message": "IUD, I will never get one again.",
   "created_utc": 1694942986,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0yju05",
   "message": "It’s a toss up between sepsis caused by a renal abscess (two weeks in intensive care and two operations), and a 28 hour labour with no pain relief.\n\nBoth utterly horrendous.",
   "created_utc": 1694944292,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0yutb7",
   "message": "Probally child birth. If I could remember what it felt like.",
   "created_utc": 1694950730,
   "score": 2,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0zak11",
   "message": "Migraines, so much pain you puke.",
   "created_utc": 1694957924,
   "score": 1,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0zchm2",
   "message": "Broken/wired jaw. You can’t chew due to the intense pressure, liquids only. Yeah that was probably the worst physical pain I’ve ever experienced. Second worst was waking up in a hospital and having the nurse remove my catheter.",
   "created_utc": 1694958688,
   "score": 1,
   "submission_id": "16kmj7i"
  },
  {
   "comment_id": "k0xhsu9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16kmj7i"
  }
 ]
}