{
 "submission_id": "16kxri5",
 "title": "Are there women out there that genuinely love their husband yet have zero desire for sex? How do you maintain your relationship?",
 "selftext": "",
 "created_utc": 1694948455,
 "permalink": "/r/AskReddit/comments/16kxri5/are_there_women_out_there_that_genuinely_love/",
 "score": 88,
 "url": "https://www.reddit.com/r/AskReddit/comments/16kxri5/are_there_women_out_there_that_genuinely_love/",
 "comments": [
  {
   "comment_id": "k0z7p76",
   "message": "SSRIs for both of us throw our libidos all out of whack and we barely have sex because of it.  Not for a lack of wanting or attraction; not at all, just kinda never seems as interesting as a good nap or watching something together.  We are madly in love, have been for years, and it all comes down to communication, honesty, and understanding.",
   "created_utc": 1694956677,
   "score": 141,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zbq6k",
   "message": "It's not just women who experience this. I'm absolutely head over heels, in love with my girlfriend, and on top of that, she's drop dead gorgeous. But for some reason, I don't have the same need for sex as I did at the start of our relationship. It's always been an issue in all the relationships I've been in.\n\nI hate it. It makes her feel unwanted, and I think she feels it's something her fault. I wish I could prove to her that it's not.",
   "created_utc": 1694958416,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z04or",
   "message": "I know someone who's wife adores him but won't have sex with him. He basically cheats at every opportunity. Point blank refuses to leave her because except sex everything's perfect. She has no idea he Cheats. He's the perfect husband. \n\nGuess It works for them.",
   "created_utc": 1694953347,
   "score": 15,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z1udy",
   "message": "I have that same situation right now.",
   "created_utc": 1694954115,
   "score": 36,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z7u7s",
   "message": "I adore my husband, and I have 100% high sex drive. He has little to no drive. I take the good with the bad, honestly. I'm so in love with him that I'll wait months without sex and it hurts me physically, ngl. But we keep up constant communication. \n\nWe still make time for each other and love each other. We talk and have fun. We cuddle. He knows I need to be touched, so he does little things for me. Like tuck me into bed. Give me all the kisses I desire. Gives me attention. \n\nI do the same for him. I give him love and respect. He doesn't really like to be touched all that often, so I tend to maintain my distance on my side. \n\nHowever, our biggest savior. Consent.... if he tells me no I stop. I'll try feeling him up, and he'll tell me no, and I'll stop cold turkey. If he doesn't want a kiss, I stop. Consent is so important. That's probably the biggest thing that keeps our relationship strong.\n\nHe's my husband. Not my sex doll.",
   "created_utc": 1694956731,
   "score": 28,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z84es",
   "message": "I would say this post describes a large portion of women who are married and have children.",
   "created_utc": 1694956851,
   "score": 188,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zb5gs",
   "message": "Sounds like my mom who was pumped full of every psychotropic drug known to man in order to stay sane but entirely killed her sex drive. The last ten years my dad was alive he had girlfriends on the side. It was my mom's idea and the three of them would hang out and go to dinner together and shit.  My sisters thought it was weird and fucked up but it wasn't my life or relationship so I didn't care.",
   "created_utc": 1694958178,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z8i2b",
   "message": "I’m afraid to ask because I might get yelled at. I’m starting to feel afraid when she does decide I can’t perform. I starting to forget how to be passionate. Yet she rather please herself.",
   "created_utc": 1694957018,
   "score": 193,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0yxjmf",
   "message": "The guy has to masturbate in the shower",
   "created_utc": 1694952115,
   "score": 194,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zdq41",
   "message": "I don't like to play the age card, but here it goes.\n1. Poor health\n2. Libido greatly reduced\n3. Body image due to ageing \n4. Don't sleep together. \n\nBut\nWe've been together 38 years and have had a fabulous life together.  We love each other and have fun being daft!",
   "created_utc": 1694959106,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z65r7",
   "message": "I am in that situation right now. \n\nMy wife refuse to have sex with me or any type of contact(intimacy). She have depression, the pills take out her sexual drive. \n\nOur marrige is not good also. She refuse to accept any form of criticism or any opinion that is different from hers.\n\nWe have a beautifull child, and is for her that i struggle to mantain this relationship.\n\nI feel like that i am not worth of any love.\n\nHelp.\n\n(Sorry if i go off topic a little bit)",
   "created_utc": 1694956015,
   "score": 190,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z9i2h",
   "message": "Yup. PIV hurts me so much. I just give him a lot of blow jobs 🤷‍♀️",
   "created_utc": 1694957471,
   "score": 78,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z7fe7",
   "message": "I think this happens with elderly couples sometimes. After decades together, I’m sure there is deep love, but no libido. Intimacy doesn’t have to involve sex. They could cuddle for example.",
   "created_utc": 1694956561,
   "score": 92,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zb30a",
   "message": "I am that kind of woman (thanks PCOS!), if it were for me I would have sex maybe once every 3 or 4 months and just because it's weird being in a relationship without having intercourse... I just accept the fact that I need to give something back to my partner (of 4 years, 2 years living together). \n\nWe have sex once a week, sometimes twice or more (mostly on vacation), sometimes less if I'm on my period but on average it's once a week, on the weekend since I'm more relaxed and I don't come home from 9 hours at the office. \n\nI do enjoy the act and orgasm I'd say 70% of the time, it's just the thought of starting to have sex not appealing to me compared to do something else I enjoy instead.\n\nMy partner does ask for sex more times than I usually accept, but respects my needs and if I say no he doesn't insists, he also never showed signs of distress with this situation so I'd say we're fine. He has sex toys and a couple of onlyfans subscriptions to entertain himself when I'm not down to it.",
   "created_utc": 1694958150,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zh6tw",
   "message": "Works until it doesnt ;)",
   "created_utc": 1694960290,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zc69s",
   "message": "Me and my fiance have been together for four years now. We had sex in the beginning but the more we spent time together (attended the same college, started living together, share the same hobbies), sex just became something redundant, we don't really think about it.\n\nWe enjoy each other's company while doing our hobbies and spending time with each other much more than sweating our butts off in bed haha\n\nWe still have sex, but it's like once every four months probably.\n\nNo one has ever cheated, no one is unhappy. Sometimes the intrusive thoughts creep in, am I good enough? Is he happy? Am I happy? But we talk it through and if there ever was an issue, we would fix it. So far we are doing good :) And I indeed love him very very much!",
   "created_utc": 1694958583,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zei6j",
   "message": "Asexual here married to a non asexual person. Mutual respect, communication and understanding. I have near zero desire and a condition that makes piv painful. So we talk about it, try alternatives and don't give up. We love each other and are each other's best friend. Thankfully sex isn't a conflict in our relationship.\n\nThat said, for the things we can improve, we work on it. For example I'm getting physiotherapy and counselling with a sex therapist for my condition to hopefully one day be able to have piv (among other reasons). We read books on sexual desire and how to support one another. We are currently exploring toys.\n\nI love my partner and as I'm not repulsed and sex isn't a dealbreaker for him, we are able to compromise and find things that work for us.\n\nHonestly it blows my mind a bit how much emphasis is put on spontaneous sexual desire and piv in our society as someone who doesn't \"get it\". But as they say different strokes for different folks.",
   "created_utc": 1694959374,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zabtp",
   "message": "I’m in this situation. Everything is perfect apart from the fact she doesn’t like to have or enjoy sex. It’s down to the fact she has been assaulted in the past. Now I’m probably not going to have sex again which is sad for me but she means so much to me that I’m willing to do it.",
   "created_utc": 1694957829,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z9bjw",
   "message": "For my wife and I, it's usually when she is stressed and sex is the last thing on her mind.",
   "created_utc": 1694957390,
   "score": 24,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0yqn6x",
   "message": "Honestly, a Costco-sized stock of batteries and a really understanding husband.",
   "created_utc": 1694948526,
   "score": 59,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zcis8",
   "message": "r/Asexuals, it's our time to shine!\n\n\nEdit: okay but in all seriousness, there are asexuals that do have sex, enjoy it, and are more hypersexual than most allos. Some, not all. Most are repulsed though.",
   "created_utc": 1694958699,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zbss3",
   "message": "Have him go to an endocrinologist. If he resists, just ask him if he can try for you. There are a lot of people just walking around with shit thyroid issues and they ignore it. He might feel better and you might get a lot more pp",
   "created_utc": 1694958445,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z9tf2",
   "message": "Marriage with kids is difficult, but always remember that those kids grow up and move away, and the two of you are left together. Marriage should always come before kids. It's a bond nothing should break",
   "created_utc": 1694957606,
   "score": 24,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z17e1",
   "message": "I mean, I thought I loved my boyfriend, but had exactly 0 desire to have sex with him. Was sure I was asexual. Turns out I'm just a lesbian 🤷🏼‍♀️\n\nPs: and turns out I didn't actually love him either",
   "created_utc": 1694953835,
   "score": 91,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zb3za",
   "message": "Pssst…men too.",
   "created_utc": 1694958161,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zfvmk",
   "message": "Reading these responses to get a better understanding of my wife’s approach to sex. I need physical intimacy, and I’m INSANELY attracted to her.\n\nBut we’ve only had sex twice this year.\n\nYes, we have three kids and while I’m the bread winner, she keeps the paperwork and everything running to keep the homefront going so yeah, she busts her ass probably harder than I do.\n\nNo, I have no intent or interest in cheating on her. I love her. I married her. I’ve built a beautiful home and family with her. She’s my partner. She’s my wife. My better.\n\nSo for what it’s worth, some of the responses on here are helping me out here and giving me a bit of peace. Makes me feel better to know it really isn’t me (I don’t have a high self esteem and general consensus among my coworkers and others is that somehow a goofy-looking fucker like myself married an absolute baddie - doesn’t help my confidence at all).\n\nSorry for the side story.",
   "created_utc": 1694959844,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z73ry",
   "message": "It’s more common than some people think (perhaps not to this extent). There’s a reason lots of jokes circulate about married people only having sex 4 times a year, etc. \n\nHot take: lots of women don’t have nearly the sexual appetite they portray themselves to have when dating. They crank up the volume to match their partner’s wants/needs purely out of desire to secure a partner’s sole interest. After marriage, the volume gets turned back down to normal… no need to try and out-fuck the competition. When that happens it produces a lot of stress for both parties.",
   "created_utc": 1694956425,
   "score": 90,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zboew",
   "message": "the proper translation in my language is called \"OPEN\" gas. or \"Open friend\" i think, since if he can't \"pump\" his gas at one port hole, he will just visit another open port hole. \n\nand for the sake of the kids they maintain the relationship.",
   "created_utc": 1694958396,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zbqtm",
   "message": "There are probably some out there. Just like anything and everything relating to humans it depends. If she doesn't care, then yeah. If she does, then nay.\n\nJust like all things in life, relationships are gambling. You may win, you may lose. There are 8 billion people crammed onto this rock, so it's statistically impossible there is no one who would stick with you all the way to the end of your life.",
   "created_utc": 1694958423,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zdp12",
   "message": "I love my husband more than everything. But, due to medical issues and medication, I have a pretty low libido. We have sex maybe once or twice a month. Sometimes, it's longer between. We kiss, we cuddle, we spend time doing things together, we have a lot of affectionate talk, etc. My hubby is a bit of a sex friend, so I am lucky that he is super patient with me. We just communicate a lot and it keeps us in love.",
   "created_utc": 1694959095,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zeavx",
   "message": "I think you can still maintain your relationship even if there's no sex:\n\nExplore intimacy beyond sexuality. Sharing interests (beyond the kids and house and pets) can open up new avenues of intimacy. If it's been years since the two of you did more than just have dinner or see a movie together, it's time to develop new interests as a couple. That could be something athletic, like tennis, golf, skiing or biking; something intellectual, like taking a class together, joining a couples-only book club or signing up for a series of lectures, concerts or plays; or something creative, like taking a painting or cooking class together. The benefits of such activities extend beyond the immediate pleasure of being together; the new interests will stimulate your brain and provide numerous new opportunities for conversation. And make a date with your partner to be alone together once a week. Go out to dinner or to a movie and spend quality time with just the two of you",
   "created_utc": 1694959304,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zf7it",
   "message": "1) Hit the gym.\n2) Open up your relationship or swinging.\n3) Enjoy.",
   "created_utc": 1694959617,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zfwab",
   "message": "He has PE and ED issues, gone thru years trying to help, just finally learned to cope and focus on building a good relationship instead and not focus so much on sex. I think about cheating sometimes just so I can have sex for longer than 60 seconds bc it's been 5 years now. We talk about it. Meh. I maintain by focusing on my hobbies and my own personal life as well as our life and family together. And being grateful I guess.",
   "created_utc": 1694959851,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zgw0h",
   "message": "Ill ask my wife....",
   "created_utc": 1694960189,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zd1fo",
   "message": "My cousins husband is like this, he definitely dotes on her. But it's weird that apparently they don't have sex at all anymore, despite her wanting it. \n\nI understand not being 100% compatible. But I'm convinced he's asexual since he doesn't seem or appear to be depressed.",
   "created_utc": 1694958873,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0za8lb",
   "message": "The only times I felt that way was when I was on SSRIs that impacted libido, and during periods when the connection between me and my SO was suffering, even if I loved him dearly. Now that I changed meds AND we communicated our needs and took actions to improve our connection, we're closer than ever and wanting sex is not an issue, we do it regularly. Tbh, I really don't think not wanting to have any sex with your partner is normal unless you're truly asexual, and it might make them feel unwanted. It can be a symptom of something lacking in your relationship or health-related and deserves to be addressed by both partners.",
   "created_utc": 1694957790,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zfd2y",
   "message": "Christ, this ask Reddit has some of the worst, least informed replies I've seen in a long time. It reads like 14 year olds giving 13 year olds advice.",
   "created_utc": 1694959671,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z7w5c",
   "message": "Either the husband puts up with it or he cheats, but I highly doubt the husband would be happy",
   "created_utc": 1694956753,
   "score": 21,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z8cjl",
   "message": "Wife is ace. She is willing to let me step out if I give her a heads up. Not just some behind her back type shit. \n\nSince I’m bi, it’s more about my slut side coming out to get off and that’s it. I like men, but I love my wife",
   "created_utc": 1694956948,
   "score": 15,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zcke4",
   "message": "I assume so, dead bedroom reltionships\nOrimarily exist because everything surrounding the relationship is good but one parters lack of sex drive creates a massive problem.\n\nLove is not the issue here",
   "created_utc": 1694958714,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0z7dv0",
   "message": "I think they are out there, but that doesn't sound like a good deal for the husband. Unless both people in the relationship are asexual, she would feel more like a roommate.",
   "created_utc": 1694956542,
   "score": 7,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zcmbc",
   "message": "There are lots of ways to satisfy a partner without having sex.  My wife has a much higher sex drive than I do, but I love going down on my wife because it feels good to make her feel good.    I also enjoy lots of other things that are sex adjacent, but don't require me to actually have sex when I'm not feeling horny or don't have enough energy.",
   "created_utc": 1694958732,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0ze0c0",
   "message": "It’s strange cos sometimes my gf won’t instigate so I will, but then she’ll say she’s too tired etc but then if she does go for it she enjoys it. \n\nIt’s almost like the effort of having sex is what puts people off rather than them not wanting to be pleasured / pleasure their partner. \n\nWhich with busy lives I get. But I think for no one to try is very selfish personally of that other persons needs too",
   "created_utc": 1694959204,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zetga",
   "message": "My sister is like this. She loves her husband to death but there’s parts of her marriage where I feel she caretakes for him to the point that he’s almost like another child? So all the sexual desire is out the window. Other than that they’re marriage is great from my perspective but I don’t understand how it’s sustainable without sex.",
   "created_utc": 1694959483,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zeuac",
   "message": "I'm curious of the other side as well, I know some ace males with wife's and husbands",
   "created_utc": 1694959491,
   "score": 1,
   "submission_id": "16kxri5"
  },
  {
   "comment_id": "k0zigjk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16kxri5"
  }
 ]
}