{
 "submission_id": "16lxdq2",
 "title": "What’s the most vengeful thing you've ever done?",
 "selftext": "",
 "created_utc": 1695048002,
 "permalink": "/r/AskReddit/comments/16lxdq2/whats_the_most_vengeful_thing_youve_ever_done/",
 "score": 94,
 "url": "https://www.reddit.com/r/AskReddit/comments/16lxdq2/whats_the_most_vengeful_thing_youve_ever_done/",
 "comments": [
  {
   "comment_id": "k14r1yj",
   "message": "A girl, named Bridgit, would bully all the awkward/bookish girls in junior high. I wrote \"Bridgit is fat\" on the bathroom wall.\n\nNot two hours later I heard her friends reassuring her she wasn't fat (she wasn't). She was paranoid about her weight for years afterwards.\n\nI felt bad but at the same time she was a evil bitch.",
   "created_utc": 1695048118,
   "score": 198,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k153wl8",
   "message": "I have an old boss that was a truly insufferable dick head. I had his personal email and address and I still use it to this day to sign him up for shit he doesn't want. Oh you want to stop and ask me about solar panels? Sure I'll make an appointment",
   "created_utc": 1695052797,
   "score": 14,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15buuq",
   "message": "I saw my ex on Crime stoppers for breaking into storage buildings. I called and turned him in.",
   "created_utc": 1695055616,
   "score": 148,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15stbp",
   "message": "One time in third grade I had gotten lice. \n\nNow, I knew I had it, but I went to school anyway. I mean, we thought we got rid of it, but I knew I still had it and just didn’t say anything because my mom had gone through so much trying to get it out I felt bad telling her I still had it. \n\nThat day when I went to school, I was at the playground during recess. This girl Izzy/Isabella was super annoying, and a bully to me. She was really, really mean. \n\nMy target had been acquired. \n\nWe were on the slide, and when we slid down and got to the bottom, I moved my head towards hers, and hoped that the lice would jump over. \n\nI knew this would be pretty surprising if it actually worked. But, it did. A week later she was out of school with lice. Even her family got it, her brother came to school with a shaved head because she gave it to him. \n\nI felt bad, but it also felt good that I got back at the bully. So, I don’t really feel bad.",
   "created_utc": 1695061664,
   "score": 206,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14wsh8",
   "message": "Currently at court waiting for trial to begin on the guy that stole my car. I drove two hours to testify, so thats probably the most effort I’ve put in.",
   "created_utc": 1695050248,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k154tne",
   "message": "I once set up a fake dating profile, and messaged my ex-wife. Of course I knew just what to say to hook her. I set up a coffee date and then no-showed by messaging her that I had walked in, saw her, and left because she was so unattractive. \n\nYeah, I'm not proud of it. In my defense, she was doing everything in her power to make my life a living hell at the time, and she was succeeding",
   "created_utc": 1695053125,
   "score": 86,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14rhjf",
   "message": "I was invited to a sleepover at the home of a girl whose older sister had bullied my older sister for years. I didn't know the girl who invited me too well but I went anyway, snuck away, went to the older sister's bathroom (she was out) and poured Nair in her shampoo.\n\nShe didn't lose all her hair but she lost a lot of it.",
   "created_utc": 1695048280,
   "score": 134,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15pffy",
   "message": "On one ranch we worked on there was one ranch hand (M) who would always say nasty, sexual things to both me and my daughter who was 15 at the time. He always tried to get physically close to us so he could 'accidentally' touch or brush by us and push his crotch against us. We were hesitant to tell my husband because we didn't want him to go to prison for murder.\n\nI was heading home one evening after having gone to town that day. I saw M in one of the ranch trucks parked on the side of the road by another truck, they were transferring what looked like a fresh butchered deer hindquarter from the ranch truck into the other one. \n\nNow, the interesting part was that it was **not** deer season, so I knew he had been poaching. The next day I tossed off a little anonymous note to the BLM(Bureau of Land Management) letting them know about the poaching. About two weeks later we hear that M has been arrested for poaching deer. Apparently, they found numerous carcasses of does and older fawns and a couple carcasses of smaller calves as well. I'm glad they found out...*somehow*. ;)",
   "created_utc": 1695060447,
   "score": 25,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k168nbj",
   "message": "A roommate just ghosted me after falling several months rent behind (the lease was in my name).  I had randomly come across his social security card and I had all of his information.  I thought about being very devious.\n\nBut in the end I think I picked the most effective method.  I showed up at his mother's house where I assumed he'd moved back to.  He answered the door looking all uncomfortable.  I asked if his mother was home, I needed to talk to her.  He asked why and I just repeated my request to speak with his mother.  I explained to her that he owed me X amount of money and would she be kind enough to pay his debts for him.  She did.  I bet he still cringes thinking about that conversation.  It sure makes me laugh.",
   "created_utc": 1695067201,
   "score": 136,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14rfsd",
   "message": "My cousin stole from me so reported her address as maintaining a drug dwelling to the police tip line. As a bonus they also discovered they were selling drugs too, which I hadn’t known.\n\nEdit: I already knew she was a thief too, so I didn’t allow her in my home. She asked for a ride to take her daughter to a doctor’s appointment so I caved, but was stupid enough to leave my purse unattended. She stole $250 out of my purse, along with a bottle of 30 oxycodones that I had just filled for my son after he broke his arm.",
   "created_utc": 1695048261,
   "score": 180,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16ekzd",
   "message": "My biology professor in community college had a policy for her exams where she wouldn’t allow makeups or rescheduling if you couldn’t be in class for the day printed in the syllabus.\n\nI got a really nasty flu a bit before a midterm exam and emailed her telling her, begging her, for a rescheduled exam. I sent photo evidence, a doctors note (since I needed an inhaler and had gone that week), and no. “If you’re not here it’s a 0”.\n\nClasses are expensive. That class was offered once a year, and if I didn’t pass it, I couldn’t transfer to my university next year. This exam was also 40% of my grade.\n\nSo I showed up. I took the exam and made sure to smear boogers and that each sneeze landed directly on my papers. I made a whole scene honestly, with my loud coughing and sneezing and blowing my nose. But I took the exam. \n\nShe then had to cancel class for three weeks because she became incredibly sick and couldn’t come in to teach. I was so happy. I hated her. I do feel bad that half the class also got sick though.\n\nI got an A still and left that hellhole the next year.",
   "created_utc": 1695069291,
   "score": 95,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14sl33",
   "message": "Shoveled cow manure in his car.",
   "created_utc": 1695048690,
   "score": 124,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15u5sr",
   "message": "There was this one girl in high school that was so mean to me. I triggered her for some reason and she would go out of her way to try and humiliate me. Even once in class when we were playing this game to practice for a test. The teacher put us against each other and I won. She turned to the whole class and said “well it doesn’t matter if you won, you’re still ugly” \n\nI was so embarrassed that I went into the bathroom to cry in between periods. While I was in the stall I noticed someone had started to write “I hate M” but never finished the name. I knew who’s handwriting it was and it belonged to a girl that the mean girl desperately wanted to be friends with. I can copy handwriting pretty well so I added the rest of her name after the M and wrote some other dumb shit. \n\nDidn’t take long for her to hear about it. She started accusing the girl, who wasn’t nice either, of writing it and they both were yelling at each other. I sat back and watched and never told a soul until right now. It was incredible",
   "created_utc": 1695062153,
   "score": 124,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16boqr",
   "message": "I played dumb to the comments from a mean person. They would say mean things about me, I wouldn't react accordingly, she would then escalate her comments. My reaction was to be placid and kind. If anything, I became kinder and would sometimes agree with her. \n\nEventually, our friend group dropped her, and even a 2-yr boyfriend broke up with her. \n\nWhy was she being mean? I lost weight and looked good. She was the pretty one in the group and wanted the spotlight again.",
   "created_utc": 1695068262,
   "score": 40,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15tb4z",
   "message": "An Airbnb host tried to screw me over by making false claims of damage to an apartment I reserved from her. She even went as far as to send me a fraudulent invoice for HVAC repair from a company that doesn't even do HVAC.   She threatened me with physical violence and sent me texts (not sure how she got my personal number) proving she knows my home address, etc...  I collected all of the evidence I could, including messaging logs from the Airbnb app, fraudulent documents she sent me, evidence that the apartment she was renting out on Airbnb was actually subsidized housing, etc., submitted it all to not only Airbnb, but the property manager of the building.  She was banned from Airbnb, and I'm not sure what happened to her status at the apartment. I think she and her mother had two separate subsidized apartments and were probably living together with a scheme to Airbnb the other one, but they screwed themselves by trying to scam me.  They probably could have made some good money if they would have just been good hosts!",
   "created_utc": 1695061845,
   "score": 109,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15xawz",
   "message": "In my second year of uni I had the misfortune of living with two other girls who were, for lack of a better word, bullies. I knew how to login to the router and see what devices were connected. So some days when they had been particularly awful towards me, or were being obnoxiously loud playing video games into the early hours of the morning, I'd login and kick them offline. Sometimes long enough for them to give up trying to fix the problem, but usually just enough for it to be annoying.\n\nThe first time I did it was a spur of the moment thing, because I felt helpless and had no way of fighting back. They were both quite geeky so I assumed they'd figure it out soon enough, but once I realised neither of them twigged I was behind it all, it gave me a small sense of control back.\n\nMight've been petty af, but at the time it was a minor victory listening to them both freak out about it.",
   "created_utc": 1695063264,
   "score": 33,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k167roq",
   "message": "Hated a roommate in college because she was a massive bitch. Dedicated my entire year to sneakily stopping the washer and dryer very time she put clothes into them. She thought they were broken for the longest time. Took her like 8 hours to do laundry each time.",
   "created_utc": 1695066902,
   "score": 31,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15e87p",
   "message": "A guy in my college study group, who never did any work, was cheating off me in the final.  I let him peek, and copy my answers down on his sheet.  He stood up, winked at me, and turned in his exam.\n\nThen I corrected all of my answers ;)",
   "created_utc": 1695056440,
   "score": 210,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15lcrq",
   "message": "Superior shit talked me in a meeting with other colleagues. I could not say anything. Work day ended. I walk out to his car and pulled 1 valve stem out of his tire. He put his spare on and went to a tire store with me following f a r behind. After he got a new tire he went to a shopping mall. I pulled another valve stem. He got to the car and started cursing. He put on his spare. For whatever reason, he walked back inside. I pulled the valve stem on the spare. The shopping mall had a tire store on the outskirts. He got a tow truck to bring his car to the nearby tire store. After getting the issue fixed, he went home. I followed him at an extreme distance to get his address. O' Dark thirty in the morning, I pulled all 4 of his valve stems. I know he spent some good money that day. He still had no idea.",
   "created_utc": 1695058992,
   "score": 161,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14rg6c",
   "message": "Live well and stay happy and healthy.\n\nA big fuck you to the teachers in high school who predicted that I would end up a gay heroin addict and dead in a gutter somewhere. I am none of those things and in reality, was in no danger of becoming any of those things.",
   "created_utc": 1695048265,
   "score": 113,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15nghk",
   "message": "Not proud of it really, I think it was over the top looking back but..\nWhen my mom remarried, she and her husband’s wedding was a family vacation at a nice resort in another country.  Mom and her husband paid for everyone to have a good time, and they were far from wealthy, but they saved up and put off the wedding so that everyone could be included.\n\nMy mom’s narcissistic mother (my grandma) kept trying to be the centre of attention, as she always does, and made things extremely difficult for the family any chance she got. Everything we did had to be about her. She took photos of herself with her “fancy” new digital camera (this was before smartphones) and demanded we take pics of her when she did anything (posing in front of an attraction, etc) as if she were a bratty highschool influencer, made a scene when waitstaff or employees didn’t read her mind, was passive-aggressive and laid traps to find reasons to be angry or whatever. Just the works.  It reached a new low during the wedding day dinner, with grandma being obscenely rude and theatrical to the point my mom had to leave the dining hall to cry in the bathroom, while her husband did his best trying to do damage control. My sister and I were FED UP. We had been unofficially in charge of wrangling grandma the entire trip (this was about a week into it) just to keep her from hurting mom with her behaviour.  \n\nI picked up grandmas camera. I deleted everything on it.  And then I recorded her, right as she was reaching the crescendo of her ego trip. Breaking plates, screaming, cursing, accusing, jumping up and down. The *works.*\n\nI put the camera back in grandma’s bag. Eventually whatever her problem supposedly was was resolved for the sake of everyone’s sanity (I think it was all because she didn’t like her seating plan) and dinner continued without much more of a hitch.  \nLater in in the week, grandma paid for her own ticket to go home early. The rest of the vacation was a lot of fun and mom had a great time once she was able to relax.",
   "created_utc": 1695059738,
   "score": 87,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15d99j",
   "message": "I stole the payphone of a store that was rude to me. I threw it into the river. I was just 11 then.",
   "created_utc": 1695056101,
   "score": 61,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15o7od",
   "message": "A guy played with my heart and then continued to break it repeatedly when I was 17/18.  He would string me along when he had nobody else and then ignore me when he met a girl he liked more.\n\nI let him do it for 2 years before I grew up and found some dignity. \n\nI became successful, happy, hot and way too good for him over the years.\n\n Stayed friends with a mutual friend so I still see him a few times per year. He came onto me last year .. we're 29 and 30 now.  I turned down his advances so hard he's probably still embarrassed to think about it.",
   "created_utc": 1695060007,
   "score": 21,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k169xbz",
   "message": "I worked at a commercial AC company straight out of school doing installs for HVAC systems. Went great for about 2 weeks until they started having me work in ways that would cost me my life. My coworkers started to lie to my boss to get me in trouble and after 2 months I was fired because of them talking shit behind my back. A week later I called OSHA because of their unsafe work practices and 2 weeks later they went out of business. Everyone I worked with was a felon and my two coworkers had such a bad rap sheet that they couldn’t even get a cashier job at Home Depot. I don’t feel bad at all.",
   "created_utc": 1695067639,
   "score": 21,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k169grw",
   "message": "   Late 90s, early 2000s. Teenage me had some crappy friends who were not friends, and were also petty criminals. They tried to scam me out of money on several occasions, and even tried to recruit me to help them sell drugs, specifically a very large bag of disco biscuits. \n\nI told them 'No thanks' on both counts, and tried to distance myself from them. It was also suggested to me by others that they had designs on pickpocketing me, and were waiting for their opportunity.\n\n  I was then approached one day by a man and some of his mates, he asked me about my friends and where he could find them. He told me that they owed him money for some of his 'merchandise', and they were very late on payment. A light bulb went off in my head, and I asked him: \n\n   \"Are you talking about disco biscuits? Like, a large amount of them? Wrapped in plastic?\"\n\n   He confirmed that yes, that is what he meant. So I wrote down an address, a window of time and a door code. I asked him to never mention my name. He gave me twenty quid for my trouble and left.\n\n   Several days later and I catch wind through the grapevine that said two friends had been badly beaten inside their own home, and relieved of numerous valuable items. And that whoever did them in had the door code. I just said: \"Well shit, that sucks.\" and went back to eating my Big mac.  \n\n\ntl'dr; Try and scam me repeatedly? I'll grass you up to the gangster you stole pills from!",
   "created_utc": 1695067481,
   "score": 19,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k163jjd",
   "message": "My ex fiance dumped me for my ex best friend. For over two years, his mother used to call me to tell me how much she hated ex-bestie, what a white trash slut she was, and how her son was just \"sowing wild oats.\" More than once, she ugly-cried to me, and then to my mom, begging me to wait for him.   \n\n\nEff that. I made sure they stayed together, even while they were insisting I was some \"psycho bitch ex\" trying to come between them. Not by a long shot. Rather, I took every chance I had to remind his mom that ex-bestie was her son's choice, and she needed to accept it. I reminded her more than once that this could be her DIL someday (which brought on another round of choked sobbing, \"Oh God, don't say that!\") and I reminded her that she'd called me a white trash slut, too. Whenever I'd bump into former mutual friends/family members who wanted to bend my ear about how \"immoral\" or \"gross\" (others' words, not mine) exbf and exbff's relationship was or try to tell me that she was fatter/uglier than me, I reiterated that they were \"soulmates,\" as they'd been telling everyone, and weight/looks were irrelevant. Even ex's stepfather treated me to a short but spirited diatribe about their selfishness and how much he disliked ex-bestie. \"Yes, but that is Ex's choice, and you need to accept and be respectful of it.\" \n\nBecause of how they got together, there was no way they could split, because they'd perceive it as me \"winning.\" So, yes, ex-bestie, I helped make sure you stayed with the abusive man-baby mama's boy with rapey tendencies who thought anal was his right as a man. I also made sure you had to live up to all of his mother's meddling bullshit with a few suggestions for \"bonding\" with you. Remember how all you wanted was to get married and have children? Yeah, ex was shooting blanks, so you get to choose: him, or your big dream of being a mom? (Of course you'll stay with the guy and give up everything you previously wanted.) And yes, ex, I made sure that after you dumped me for being \"overweight and having mental issues,\" you got stuck with the terminally ill screaming liar who whips people with her illness, was obsessed with marriage and having kids, constantly gains weight from medication, and who will drain every cent and ounce of life force from you. Yup, soulmates! \n\nI went on to uni, got MAs and a PhD from two top-5 schools, and have multiple publications. Just celebrated 26th anniversary with my amazing, delightful partner who still gives me goosebumps when he kisses me, and the last several decades have involved the two of us living life all over the world. AFAIK, the \"soulmates\" are still together, too. I'm just grateful that I got multiple shitty, selfish assholes out of my life at once.",
   "created_utc": 1695065459,
   "score": 55,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k152hql",
   "message": "Met a racist old woman on a tram. (She just sat right next to me and began to talk about how she hates Asians.) The tram was en route to a region that is the *de facto Chinatown* of the city, with possibly more signs in Chinese than the local language. I showed her all the Chinese signs.. She totally freaked out and I kinds laughed inside.",
   "created_utc": 1695052296,
   "score": 32,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15ner5",
   "message": "I played the long game. In high school I was terribly bullied. And I was kind of a loser.\n\nBut I never forgot.\n\nAt 26 I joined a 12 step program called Adult Children of Alcoholics. Started dealing with my childhood trauma, including the shame my parents laid on me which left me open to so much bullying. Years of counselling got me increasingly happier. Got married, successfully raised a few children. Still happily married over 30 years later.\n\nHappy, healthy reasonably fit, and still have all my hair. \n\nThey on the other hand, got fat, divorced and balding.\n\nRevenge is a dish best served cold.",
   "created_utc": 1695059721,
   "score": 91,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15r4ou",
   "message": "I worked at a startup that played real fast and loose with, well everything. My manager was a very inexperienced first-timer (this was the first manager position he's ever had) and hired a fraud into our team. Somehow this fraud managed to deceive my boss for months because when the fraud's facade starting peeling back, everyone realized this guy did no work, had nothing to show for nearly 10 months. This fraud had a major grudge against me for whatever reason and threatened me on his last day of work. He got in my face like he wanted to throw down right there in the office. Unfortunately, there were no witnesses and later that afternoon, in the heat of the moment, I told him out loud that if he ever got in my face again I'd put him through a table. Fraud leaves the company at the end of that Friday. Come Monday morning they ambushed me with some fake meeting and fired me under fake pre-tenses. During the exit interview I asked them if they knew that the fraud had threatened me with physical violence that day which prompted my response. The shocked look on their face told me not only did they not know, now they were probably worried about possible wrongful termination.\n\nSpoke to an attorney but he recommended I just take my severance and leave it at that. Wouldn't be worth the fight. I agreed with his assessment, but I wasn't about to accept this L without some retribution. I was friendly with many of the senior management at the company, particularly the chief of staff. I wrote her a very long email detailing the entire 10 months this fraud had been among us and all the BS he put me and the rest of the team through. I threw my boss (who was now a director) under the bus along with the manager. Kicked off an entire HR investigation and everything. I don't think anything ever came of it but I enjoy the thought that perhaps they really shat bricks when they realized what I had sent to the chief of staff.",
   "created_utc": 1695061058,
   "score": 17,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15js5m",
   "message": "Damnit.\n\nSo, I don't know exactly how old I was, but something like 7 or 8. Winter and a lot of snow this year, school yard was full of it, including the plowed up piles of it that made for excellent forts. We had all just had a massive snowball fight, lots of kids and I guess we were exhausted at this point and just sitting down and having a breather.\n\nThis one kid, and I can't forget him, was always excluded. If it was today he would have had a diagnosis, but... yeah, he couldn't interact, comes up and smacks a handful of snow into my face. Didn't hurt or anything, he was just trying to get included, but somehow the out of play violation made me see red. I basically pick him up and barrel him face first into a fairly solid wall of packed snow.\n\nI remember this so clearly, the sudden anger and then him crying, and I wish I could say instant regret, but it wasn't. At that moment I'm pretty sure I felt convinced that he deserved it.\n\nAfter that it sort of hit home how he had problems with being social. Not in those terms then, but I kind of understood the things that had happened up to that point, where there had been all the efforts made to fit him in and everyone, but perhaps myself in particular, had rejected this kid.\n\nI'm ashamed of this particular event to this day. Also pretty ashamed of my general rejection of this human, though I tend to try to excuse it by \"Oh I didn't know anything back then\" but at a similar point in time I was precocious enough to know that I could cause a stir and get out of the \"visit to a church service\" by raising the devils horns finger gesture. I should have known better and been less of a dick.",
   "created_utc": 1695058425,
   "score": 48,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k164cp2",
   "message": "Almost got my former boss fired.\n\nHe was the service manager at a car dealership I'd worked at for 7 years, everybody fucking hated him. He treated me like shit even though I busted my ass, because he just didn't like me.\n\nYear after I quit I saw him comment on a Facebook news post saying some horrendously racist shit.\n\nSo, I took a screenshot, and sent it to a guy from Australia who was on the same car forum I was on at the time, and linked him to the dealership's Facebook page and asked him to post it at what would be 12AM my time (the dealership internet coordinator stops monitoring at 10PM).\n\nHe did, and before the Internet Coordinator logged back on at 7AM, the damage was done.\n\nWas was suspended for a month without pay, but they decided to keep him for some reason.",
   "created_utc": 1695065736,
   "score": 13,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15zo2c",
   "message": "I put the cell number of the girl my ex cheated on me with online and requested sexy nudes and dick pics.\n\nI had her number because he “wanted us to be friends”. He was hoping for a threesome but when I wasn’t down for it, he just cheated on me instead.\n\nI feel zero guilt.",
   "created_utc": 1695064103,
   "score": 11,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14z7la",
   "message": "I had a girlfriend who cheated on me, so I fucked her twin. His cock was very impressive.",
   "created_utc": 1695051123,
   "score": 73,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16ivk5",
   "message": "When I was 13 I got revenge on my four really close friends. What warranted this revenge act was the fact they scared me so badly I piss myself in front of my girlfriend and my friend. On the day I decided to wear grey joggers.\n\nWell my comeback was good, me and them, my girlfriend and two of my friends girlfriends and the girlfriend’s friends. When swimming in the river after school. The girls dare us boys to jump off a very high hill and into the river. After girls mock our boyhoods “ you five haven’t got the balls to jump” not wanting our egos hurt we all walk up the hill. \nStanding on the edge, I was very nervous, I didn’t like heights. My mates could clearly see I was nervous and so were they mind you, but one of them said “hey!…don’t piss, you’re self again”\nThis planted the seed for revenge in my head, as quickly as anything. I came up behind them and one by one I pull hard on their swim shorts and give them hard push off the edge. The girls laughed so hard at what I done. For weeks they kept on joking to them about the size of their bits. “Aww soo small” and “ I told you no balls” \nRevenge complete.",
   "created_utc": 1695070846,
   "score": 10,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k1575hw",
   "message": "I was several hours late to my first day of summer school when I was 17 and by doing so they were supposed to kick me out and I would have failed the courses. So I walked in crying about how my bestfriend killed himself, which he had the year before. I didn't get in trouble, they let me in. I felt kinda bad but I also think Juan would have gotten a kick out of it.",
   "created_utc": 1695053957,
   "score": 30,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15k647",
   "message": "I texted a huge rant to a friend after he started going steady with a girl I thought was flirting with me. He called me back and yelled, rightfully so.",
   "created_utc": 1695058564,
   "score": 18,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16bh3m",
   "message": "I was trying to poop in my apartment years ago, when someone started knocking on my door loudly and persistently. I was expecting a package, so I frantically wiped and jumped off the toilet. I didn't wash my hands (yes, disgusting I know).\n\nTurned out to be a woman that was going door to door to sell some new age form of Christianity. I told her I wasn't interested, but she held my door when I tried to close it. She kept trying to tell me this wasn't what I thought, and they actually believe God is a woman! I tried and tried to kindly tell her I wasn't interested and finally had to tell her to just leave.\n\nShe acted all high and mighty, but finally said goodbye and to have a nice day with some attitude. So I put out my hand and said, \"You know what, you too!\" And shook her hand goodbye.",
   "created_utc": 1695068187,
   "score": 20,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16cz3c",
   "message": "I had a guy that conned my uncle out of a significant amount of money\n\nI once saw a story on Reddit about a mechanic putting roofing tacks in someone’s driveway who stiffed them\n\nWell, I can confirm, it is a great way to deflate tires on a Land Rover of someone who conned your uncle",
   "created_utc": 1695068716,
   "score": 9,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16il2b",
   "message": "Deliberately spread my flu to my supervisor who called me after I called in sick to beg me to come in. I was so young and naive, that I let her convince me. (I actually regret this one).\n\n\nI also called the police on a guy who decided to drive alongside me when I was riding my mobility scooter to work. He shouted at me from his car that I was a benefit cheat and faking. I tried to explain that I have been diagnosed with chronic fatigue and fibromyalgia by several specialists and I am not on any benefits. He wouldn't believe me. He followed me long enough for me to remember and write down his license plate.",
   "created_utc": 1695070740,
   "score": 8,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16jhem",
   "message": "One of my first jobs was working in a bakery at Walmart. A coworker of mine was a tender and kind and older woman named Sally. Sally used a walker, and would have to sit down when scoring knead and packaging. Nonetheless she was chipper. Always a fun story about her daughter, her late husband, or how she lived.\n\nCarol was a cake decorator. Heavier set woman who demanded a stool to sit on while she did cakes. Carol thought Sally was sitting on the job, and wasting time. So Carol demanded management take Sally's walker away. Sally would clock in with it, and was told she had to leave it by her locker. Carol grandstanded about this.\n\nSally...lost her job in the bakery. She was in tears and took a hefty paycut to sit upfront as a welcomer/receipt check a week later. Otherwise she wouldve been let go. My last day (3 weeks later) I made a general $1 price tag and bought Carol's stool after hours. I took it home, disassembled it, and threw it in the trash. Carol found my number, messaged me like a bat outta hell. Didn't respond. Blocked. Went on with life as team lead in local bakery here.\n\nI went back to that Walmart to shop a little over a year later. Sally was back in bakery. Able to sit in her walker. Carol was the receipt check now. She gave me the cold shoulder. Store Leader saw me, laughed and welcomed me. He brought up the incident and I said I'd neither confirm nor deny. He smirked, shook my hand, and told me I did the right thing",
   "created_utc": 1695071071,
   "score": 10,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15wt44",
   "message": "Not me but my dad, who tends to be relentless in avenging himself.\n\nHe once thought he was grossly overcharged for a specialty food item that was made in-house by a local business. He anonymously called the city food safety department, hoping it would be a nuisance when a health inspector showed up to check out the place... which is exactly what happened.\n\nThe inspector shut the place down. Permanently.\n\nSo, was my father vengeful or did he do a public service?",
   "created_utc": 1695063090,
   "score": 17,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k163yy1",
   "message": "TL:DR jerked off in my XO’s canteen out of spite. \n\nI had a XO lieutenant in the Army that was a real piece of work. Total Napoleon complex and thought he was better than the enlisted. I had the unfortunate duty of being the CO’s driver thanks to my attitude. I spoke my mind regardless of outcome and he appreciated the truth. \n\nWe are on a field rotation and my CO had to leave and go to another state to check on our future rotation there. The XO took over command and life began to be hell. He had straight attitude, disrespectful cause he could be. I hated him so much. During our field rotation of 40 days we don’t get access to showers so baby wipes are how we would clean. \n\nI kept my vehicle as clean as an Army vehicle could be. I took pride in my vehicle. This cocksmoker didn’t give a shit and treated it like his own personal trash can. He’s make a mess and leave it all over the vehicle, baby wipes from his balls and ass, pits, MRE trash, just a filthy mother fucker. \n\nI’d clean my vehicle and put all his shit in the floor board. Not my mess, not my job. XO gets real pissed when I say that to him and gets my sergeant involved. He tells me to clean my vehicle. I explain situation and he tells me okay, his mess, his problem. \n\nXO gets pissed off that my SGT had my back and threatens me with article-15 if I don’t clean his trash. Fucker leaves to scout out maneuver but leaves his canteens behind. Well I proceed to use his porn mags to jerk my 30+ day load right into the canteen, fill it with water and kool-aid powder and give a good shake. SGT caught me in the act and laughed his ass off. \n\nXO returns thirsty cause no water during scout mission. Downs entire canteen while we all watch. My face when we all know he just drank my baby batter.",
   "created_utc": 1695065606,
   "score": 18,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16a8dd",
   "message": "I quit working for a company that was taking me for granted. They lied to me and screwed me over so I Gave them two weeks notice and spent extra time to put a book together for the 32 projects I was working on. 2 months later they threw the book away thinking it was not needed. My understanding from the suppliers was they were completely lost and didn’t know until it hit them what needed done when they were working on the sold products. I talked with My replacement and he didn’t know how I was doing everything I was doing. I let him know I was working 16 hour days to keep up. 9 months after I left the entire management team was fired.",
   "created_utc": 1695067746,
   "score": 7,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15qm19",
   "message": "My college roommate pissed in my closet so I did something to his toothbrush",
   "created_utc": 1695060873,
   "score": 24,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15s96b",
   "message": "Was on a vacation sharing a room with my boyfriend and his sister.  One afternoon the sister went ballistic and was screaming at us for some nonsense but being really nasty about it.  I later went to use the bathroom and spied her fancy facial soap bar on the back of the toilet.  I peed all over it and just smiled the next day when she was in the bathroom getting ready....",
   "created_utc": 1695061461,
   "score": 7,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k167gtw",
   "message": "He fucked my ex girlfriend the week after we had a huge break up, I fucked his sister for six months",
   "created_utc": 1695066799,
   "score": 7,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16fg65",
   "message": "One of my friends from high school turned out to be a extremely conservative, homophobic republican type of dude. I’ve known him for years and have been listening to his rightwing shit on and off forever. Anyway, he posted something really stupid on his IG and it pissed me off so I signed him up for GLAAD. I signed him up in a big way, I provided his email, phone number, correct physical address, the whole nine yards and even made a small 35$ donation in his name.  \n\nI thought it was funny when he started receiving all of the literature and emails and texts and everything and I was hoping to have a good laugh at his expense, but it kind of didn’t turn out that way as he ended up kind of a having a nervous breakdown over the whole thing. Oops.",
   "created_utc": 1695069600,
   "score": 7,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k1633tf",
   "message": "Busted a windshield, also told sa abuser's wife what he did to me",
   "created_utc": 1695065308,
   "score": 6,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16ahe7",
   "message": "Loaned someone money on PayPal with no expectation to be repaid. They fucked me over and I disputed every transaction after they laughed in my face.",
   "created_utc": 1695067833,
   "score": 6,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14zo5i",
   "message": "I got someone fired on a judgment call. They'd annoyed me a while before, and I had a sway in who went and who stayed, and made this person the one to go.",
   "created_utc": 1695051290,
   "score": 16,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15w446",
   "message": "Honestly? Nothing. The girl he cheated on me with ended up cheating on him right after they got engaged so I just got to sit back and watch it happen",
   "created_utc": 1695062848,
   "score": 10,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k1699sr",
   "message": "My friend spent six years building his base in a popular modded game he stole a magic card from my house (worthless) so I built a nuclear reactor under his base and let it go critical I've never seen a grown man cry before that",
   "created_utc": 1695067415,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16f2f0",
   "message": "As a 9 year old I fell asleep on the school bus. A bully sucker punched me in the nose. The next day I stabbed him in the back with the sharpest pencil I had.",
   "created_utc": 1695069464,
   "score": 5,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16fcoy",
   "message": "There was a new girl in high school our senior year and she did not yet know that I was unpopular/a bullying target. She was a new stepsister to one of the popular guys who enjoyed participating in said bullying. \n\nWell, he misplaced his car keys and as it turns out - she had his keys. We had a laugh not giving him his keys back even though he was asking if she had seen them. She was asking me, oh should I give them back? Of course I said nah. She clearly wasn't a huge fan of his either. \n\nHe ended up getting his car towed for some reason instead of getting a spare key (this was in 2000 or 2001, maybe there weren't many spare car keys back then?). She confessed she had his keys after we found out he got his car towed. We laughed pretty hard about it and he was just saying oh you think that's funny?! \n\nYes. I, specifically, thought that was hilarious. Bullying can cost you, sometimes. \n\nThe girl didn't really talk to me after that, but I don't think I missed out on much 🤷‍♀️ \n\nWorth it.",
   "created_utc": 1695069566,
   "score": 6,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16jjc7",
   "message": "My social studies teacher hit on me often and openly, in front of the whole class. (1973, just a really gross era. If you weren't there, just watch Anchorman.) \n\nWhen the yearbooks came out, the nerdiest, most sheltered, most religious girl in school gave me her yearbook to take up to the teacher and ask him to sign it as if it were mine. It wasn't my idea, and I don't know if it was hers either, but I did it. He wrote, \"For you --- later --- Tony\" Didn't take long for him to realize whose book he had actually signed and you could see the fear and panic in his eyes as his face turned bright red. He's lucky that girl's parents didn't destroy him.",
   "created_utc": 1695071091,
   "score": 5,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16kow0",
   "message": "I put confetti on ceiling fans. My mom put lobster in vents...",
   "created_utc": 1695071521,
   "score": 6,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16w2az",
   "message": "On a Friday, I spilled plain yogurt on the desk of a toxic coworker. By Monday morning, it had dried. FYI, dried plain yogurt looks a lot like a semen stain. \n\nDamn, more than 20 years later, remembering her freak-out still makes me laugh.",
   "created_utc": 1695075805,
   "score": 5,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15rh2q",
   "message": "My ex abused me for 5 years. I finally left him, and when I moved out I asked him if I could buy a spare TV from him. We agreed on £90, and I got to take the vacuum too.\n\nI took the vacuum and the TV and told him to get fucked, he wasn't getting his money. \n\nHe still came out better off, even with what little I took. \n\nSmall vengeance for me though.",
   "created_utc": 1695061182,
   "score": 15,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15gb1b",
   "message": " I put depilatory cream in someone's shampoo. I am not sorry. 🙂",
   "created_utc": 1695057179,
   "score": 10,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16aa4r",
   "message": "A couple months ago I was visiting California from the east coast. First day in LA I was waiting for my cousin to get off work, so I drove around to some iconic areas—Mulholland Drive, Laurel Canyon, Venice Beach, etc.\n\nWhile coming down through Beverly Hills I stopped at a light just as it turned red, in the right lane. Some guy behind me, who I could see very clearly in my rearview, honked at me a bunch and was visibly angry and gesticulating. Apparently he wanted to make a right turn and was just that angry that I hadn't run the light and he was going to have to wait 30-45 extra seconds. This being Beverly Hills, he presumably had more money than I'll ever be able to imagine having.\n\nSince this obviously called for some street justice, once the light turned green, I took my sweet time starting to move again. Needless to say, more honking and wild gesticulating was in order. My only regret is not sitting there longer.",
   "created_utc": 1695067763,
   "score": 8,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16e0eo",
   "message": "A ex childhood friend of mine messed with my gf in highschool. So 4 years out of highschool later my brother and I fucked his baby mama togeather.",
   "created_utc": 1695069085,
   "score": 10,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15qbco",
   "message": "A \"friend\" fucked my gf. I had some dirt on him and gave him and some of his pals trouble with the law, jail time included. And after I left the bitch and took all my suff with me she had to become a sex worker to survive.",
   "created_utc": 1695060765,
   "score": 9,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k169mq7",
   "message": "I had an old boss when I was a young girl who would talk sexually to me non stop..I hated him so much I quit! Fast forward some 20 odd years later..I see this guy much older and still the same cocky scumbag..He doesnt even notice me, But I for sure noticed him going to a resturant near my house..Just by his tone and manner of speaking I could tell a mile away it was him talkimg to the valet!, in this nice ass Mercedes convertible..I think to myself, this mofo made my life miserable what can I do to get this fucker back?!?!? I think to go in the resturant and call him every name in book ect..No that mkes me look foolish..I ponder this for a few minutes..What the worst thing I can do to get him back??? Light bulb! I take 2 buckets of fermented dog shit we picked up from our lawn over the last few months and proceed to litterally dump shit all thru his nice Mercedes! Pay back is a motherfucker",
   "created_utc": 1695067537,
   "score": 6,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16dy0b",
   "message": "Stole one of my bullies' baseball cap and threw it in the trash.",
   "created_utc": 1695069061,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16fyl1",
   "message": "When I was young, for a brief period, we had a sort of unspoken tension between me and my neighbors. I think one day our football landed in their yard and they made a bit of a thing about giving it back or something. \n\nSo one day a friend was over and we decided to get some revenge. We took a small shampoo bottle, emptied it, and I filled it with piss. Then, in what we thought was a very clever move, we typed up a little note that said something like \"please enjoy our free shampoo sample!\" and put it in an envelope. A plain-ass white letter mailing envelope. Then we put it in their mailbox, hoping they would open this envelope and use the \"free shampoo sample\" and get piss in their hair.\n\nA few weeks later, as I was passing by their driveway on the way home, one of the kids (similar age to me) waved to me, so I went over and chatted with him. And a few minutes into it I brought up how I had gotten this weird shampoo sample in the mail and asked if he did too. He was like \"oh yeah, I totally did. It smelled like piss so we threw it away!\"\n\nLooking back, I have to imagine they knew it was some kind of prank and that I gave myself away when I asked. But it was never mentioned again.",
   "created_utc": 1695069787,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16gv7i",
   "message": "A girl I dated dumped me after 7 years together, so I had sex with her high-school bully.",
   "created_utc": 1695070115,
   "score": 5,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16w3yg",
   "message": "I had a company screw me out of an annually recurring 5-figure sales commission so I found a new job, and on my way out manipulated the client and my (former) CEO into a conflict that resulted in the client taking their annual $10MM+ in revenue elsewhere.",
   "created_utc": 1695075822,
   "score": 5,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k17bwok",
   "message": "In middle school I had this bully. Idk what her issue was with me but she would never leave me alone. It all came to a head when one day on the bus, completely unprompted, she dumped an entire bowl of gelatin with other random bits of things in it (science project) over the top of my head. I just sat there holding back tears for the entire ride while trying to pick out little paper clips and chunks of goo out of my hair. \n\nA couple weeks later when I was staying late after school with some friends, we noticed a phone left on the sink in one of the bathrooms. This was before phones had passcodes, so we decided to go through the pictures on it to figure out who it belonged to so we could return it. \n\nThis is where it gets bad… we’re going through the phone and suddenly my jaw drops. It’s a mirror pic taken by my bully with her shirt off. All my friends knew how awful she was to me so we came up with this plan. We’d turn the phone in at the office, but not before setting the phone’s wallpaper of that photo so that when the person in the office opened the phone, that’s what they’d see. Obviously this is very problematic what with the underage nudes of it all… but I was 13 so getting back at her was the only thing on my mind. \n\nSo, that’s exactly what we did. The next day, I’m walking through the halls and I see my bully walking out of the office, face beet red, sobbing. I’m pretty sure she never found out it was me that did this, but she never bothered me again after that. Not something I’m super proud of, but that’s the story!",
   "created_utc": 1695082386,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15gykg",
   "message": "Tapped on my brake for like half a sec after some asshole decided to tailgate me on an wide open freeway",
   "created_utc": 1695057416,
   "score": 12,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k14v3gr",
   "message": "I became successful.",
   "created_utc": 1695049626,
   "score": 19,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15ne7q",
   "message": "Once when I received the physics test results I got a B+. There was this other student who was also my classmate and they got a B/A (in my country it means just between B+ and A-). I was usually the one who got the best grades, but performed worse than usual. I got slightly bitter and then I decided to take revenge by studying insanely hard for the next test. I got an A+. Think of this as a “know your place” kind of mindset. I’m know very well how petty this sounds, especially since I wasn’t wronged by anyone.",
   "created_utc": 1695059716,
   "score": 7,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k168vn2",
   "message": "When I wrote an e-mail to my ex-boss exactly why I didn't want to work for him anymore (after he broke his promise to take me back for the fourth time). AND when I accidentally received an e-mail from the union (who thought I was still employed there) 1,5 year later because they were again gathering information about all the power abuses going on at that place and replied to them: \"Well, I'm not employed there anymore. Having said that, it doesn't surprise me that you still get notified about this, because in my experience...\" Didn't really change anything, but at least I did all I could and probably made him sweat a little bit.",
   "created_utc": 1695067278,
   "score": 6,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15jup0",
   "message": "Wund up a guy in work til he lost his temper but to be fair he did previously key my car door",
   "created_utc": 1695058451,
   "score": 6,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15z7es",
   "message": "I haven't done it yet. But I will. I've been waiting 13 years.",
   "created_utc": 1695063940,
   "score": 3,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16kedm",
   "message": "This was a long time ago. I subscribed an asshole to a very nasty porn magazine. It was in his name, but addressed to his neighbor. Who was a gossip.",
   "created_utc": 1695071412,
   "score": 3,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16l8h1",
   "message": "There was a girl in high school who used to lead a campaign of bullying against me and other girls. I was socially awkward and not very pretty, so she and her friends called me names and things like that. \n\nOne day, she came into class bragging about her new \"boyfriend\" whom she'd met online. She was going to sneak out that weekend to meet him in the middle of the night outside of town. Her friends were all laughing, telling her she was going to end up raped and murdered, but it was a joke to them. \n\nI went to the school counselor during lunch and told her all about it. The next day, Bitchy McBitchface came to class FURIOUS. She demanded to know who had ratted her out. Turns out the counselor had called her parents, and they looked on her laptop and saw her chat logs. They took away her phone, her laptop, all Internet access, the car keys, and every freedom she had. Her parents drove her to school and picked her up every day until the end of the year. \n\nThat day, when she was interrogating everyone, she never once looked at me. It probably never occurred to her that the fat girl in the corner would have said a word. To her, I wasn't even a consideration. I wasn't even a person. \n\nI might have saved her life that day, and she'll never know it.",
   "created_utc": 1695071723,
   "score": 3,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16m4wg",
   "message": "My little sister dated a guy who was pretty emotionally and verbally abusive when we were in high school. She didn’t tell anyone about this for the longest time and even covered for him when we’d notice little potential red flags. \n\nWell eventually she worked up the nerve to break up with him and when she did, the creep locked her in his car and drove her around for hours yelling at and threatening her. He did let her go when he calmed down and she came home in tears and told my mom and I the whole truth. \n\nLater that night after everyone had gone to bed and went to his house and threw a big rock through his front windshield and slashed his tires. The police came and questioned my sister but when she burst into tears and told them about their relationship, they dropped it and left her alone. I never ended up getting in trouble for it either.",
   "created_utc": 1695072058,
   "score": 3,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16wvdv",
   "message": "Shagged my cheating ex a week before his wedding, knowing that he was intending to “start over”. I fully intended to ruin things for him as much as he had ruined my mental health and faith in humanity.\n\n(His fiancée was on Tinder their entire relationship as well as regularly shagging her ex. It was largely a victimless crime.)",
   "created_utc": 1695076131,
   "score": 3,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15ujct",
   "message": "I went and got two degrees to avoid speaking to them. It worked.",
   "created_utc": 1695062287,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15ne5o",
   "message": "Pissed on the door of the teachers lounge after my last day in that cesspit ended.",
   "created_utc": 1695059715,
   "score": 7,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15s69q",
   "message": "T-bagged Slayer28339 after 360 no scoping him after jumping off the building on that map in COD",
   "created_utc": 1695061432,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15wj9t",
   "message": "My stepdads sister \u0026amp; her kids are extremely fucked up. Like she has some kind of insanity going on (it’s okay, I can say it, I have BPD). \n\nWhen my step-grandpas brain tumour got bad, my stepdad was driving 2.5hrs back and forth all winter to deal with it as he was the power of attorney and NONE of his other siblings would take care of him. When he died, the insane one showed up screaming because apparently grandpa hadn’t left her very much … at all. She was mad about money. The day her dad died. \n\nOn the same day, my grandma discovered she’d “lost” $250. So my stepdad started going through their financials to discover that a shit ton of money was lost and only a few suspects were around. Lol. She’d also been basically paying for the lifestyle of that family for decades. Because they’re roaches. \n\nStepdad took grandma up to our house because he felt she was unsafe. Being actively stolen from while her husband was dying lol!! \n\nSo. This is when my stepdad starts getting nasty, evil messages from the family about how he’s “stealing the money”, how he “manipulated” grandpa into making him POA, etc. My grandma started crying. \n\nI lost my shit. Don’t make my grandma fucking cry. I started calling and messaging them all incessantly, trying to formulate exactly what they’d done wrong but mostly just slinging the most hurtful shit I could at them. I called them useless narcissists, thieves, unempathetic, emotionless, evil bitches and bastards. I specifically remember saying “how fucking dare you accuse my dad of doing the evil shit you did, bitch?” \n\nAlso: “I feel really bad for (stepcousin’s kids). Their mom is an evil bitch. They’ll be just as fucking insane as you.” \n\nEventually I received a threat from my step-cousin’s husband or whatever. He’s just a big douchebag, but I had to stop at that point or I’d seriously be damaging things. \n\nI don’t regret a thing. I hope they remember how much I hate them.",
   "created_utc": 1695062996,
   "score": 4,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k15vt2d",
   "message": "In high school I took the girl my boyfriend tried to cheat on me to his house and pretended I didn't know shit till we decided to leave.  It was hilarious!",
   "created_utc": 1695062738,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16duuz",
   "message": "Swapped the soap with a bar of cream cheese. \n\nMore of a prank, he never saw it coming hahaha",
   "created_utc": 1695069030,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16k1ts",
   "message": "First girl put me in friendzone infront of everyone at school then started dating her bestfriend for 7 months. (They fell apart). 2 months after the breakup I started dating the first girls older sister for 6 months.",
   "created_utc": 1695071283,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16oh0a",
   "message": "At school, I was frequently bullied because I never fought back - often out of fear of punishment. I also had a reputation for being weak and harmless. Then one day, one of my school bullies made the mistake of picking on me away from school, at the birthday party of a guy in my class whose family liked me. \n\nI punched him in the nose, so hard he started bleeding. Everybody else started laughing at him because he’d just lost a fight to me of all people. And the birthday boy’s parents covered for me, so I didn’t get into trouble.",
   "created_utc": 1695072932,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16qh27",
   "message": "So far? I’ve stayed alive. That would be pissing off no less than five people right now. The actual number is likely quite a bit higher though.",
   "created_utc": 1695073673,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16xhnh",
   "message": "My college roommate yelled at me for our apartment being a mess as he was walking out the door to go home for the weekend. He told me the place had better be cleaned up when he got back. While I definitely had played a part in the mess, there were 4 other responsible parties who weren't there in that moment and escaped the scolding.\n\nI spent several hours cleaning his room that weekend. I dusted everything. I washed his sheets. I moved his bed and dresser and mopped underneath. I scrubbed his bathroom. I made the place so spotless and flawless that it was impossible not to notice.\n\nHe came home on Sunday night, went to his room, came out again with his head hung and meekly said, \"I'm sorry for being a dick.\"",
   "created_utc": 1695076384,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k16zb2c",
   "message": "I've done some things in my time, but I'm gonna share the shorter and less interesting one for now.\n\nSome dude at my school offered to take my (now ex) boyfriends' virginity (t4t). He was generally weird, but this was creepy and made me dislike him.\n\nLat year, it was revealed that he took part in the production of child p\\*rn and he was expelled from the main highschool.\n\nHe ended up in my alternative school (school for troublemakers, recent juvi releases, and anyone who doesnt do well in regular school).\n\n3 times (so far), I've put high potency laxatives in his food, and I will continue to do it until he either leaves the school or shits himself in front of everyone.",
   "created_utc": 1695077143,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k179e59",
   "message": "Ex girlfriend dumped me when I got 40 pounds over weight and told me I’d never get my dream job. Sobbed for 4 months before putting in the work getting lean, went to school and got my dream job all in 2 years",
   "created_utc": 1695081353,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k17bbj2",
   "message": "Was in the pub with a few friends a few years ago and one of them said my shirt was ‘unique’ they were drinking vodka and Diet Coke and when it was my turn to get a round of drinks I got them normal coke. Take that fucker!",
   "created_utc": 1695082149,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k1565om",
   "message": "I filled a half-empty honey bottle with KY. The owner was a college dorm RA, date-rape waiting to happen.",
   "created_utc": 1695053604,
   "score": 2,
   "submission_id": "16lxdq2"
  },
  {
   "comment_id": "k17e8u8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16lxdq2"
  }
 ]
}