{
 "submission_id": "16m2cy1",
 "title": "What was the most disappointing, tourist infested place you’ve ever been?",
 "selftext": "",
 "created_utc": 1695059742,
 "permalink": "/r/AskReddit/comments/16m2cy1/what_was_the_most_disappointing_tourist_infested/",
 "score": 93,
 "url": "https://www.reddit.com/r/AskReddit/comments/16m2cy1/what_was_the_most_disappointing_tourist_infested/",
 "comments": [
  {
   "comment_id": "k1688xz",
   "message": "The room with the Mona Lisa in it.\n\nCouldn’t get anywhere near it and it’s not that big of a painting to see from the back of the room when all the people in front of you had giant cameras. Maybe it’s better in the age of cell phone cameras - but I doubt it.",
   "created_utc": 1695067064,
   "score": 191,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k165ut5",
   "message": "I'm sure other cities have this problem, too, but there's an epidemic in NYC of pop-up \"museums\" that are essentially just Instagram backgrounds.  There are some great temporary exhibits in the city all the time that genuinely have cool artwork, or historical items, or just make for a neat experience.  ...and then there's ones that just have a bunch of backdrops for people to pose in front of and maybe a placard.\n\nSpecial shoutout to the 'Museum of Candy' that was hosted in a random warehouse and where you *didn't even get any candy* with your ticket admission.",
   "created_utc": 1695066250,
   "score": 166,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k15obz6",
   "message": "Every cruise ship port in the Caribbean",
   "created_utc": 1695060050,
   "score": 194,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k165mjj",
   "message": "The leaning tower of Pisa.\n\nA field of tourists trying to take a picture of the tower without other tourists in it and souvenir shops trying to sells those tourists stuff.",
   "created_utc": 1695066171,
   "score": 231,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k165x4m",
   "message": "Venice in August, I felt bad being there. Luckily was only a day trip but it was like something from a horror film.",
   "created_utc": 1695066272,
   "score": 203,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k161f3f",
   "message": "Nassau, Bahamas.  It was like being in a very expensive prison.",
   "created_utc": 1695064720,
   "score": 107,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k15wmfy",
   "message": "Hollywood blvd … literally a worse version of NY Times Square (which also sucks)",
   "created_utc": 1695063026,
   "score": 91,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k15zo6d",
   "message": "Yellowstone NP is fantastic when it's just you or a few other people. However, most of the main sites are so full of people it really feels like Disney World at some points instead of nature. It's also infuriating when I see so many tourist disrespecting the nature by walking off of the paths/board walks and leaving trash around.",
   "created_utc": 1695064104,
   "score": 195,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16cq0n",
   "message": "My own city in the last 10 years. Amsterdam really took a nosedive. Lots of unique little shops disappeared in favor of approx. 10 million frozen yogurt/chocolate waffle stores. Tourists used to be a few chill, cheery groups interested in the city they were in - now they sometimes look like hordes of zombies hobbling from one tourist trap to the other. Painstakingly slowly, and of course taking up the whole sidewalk.",
   "created_utc": 1695068627,
   "score": 183,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k161e8j",
   "message": "Oxford Street, Central London. The place for you if you enjoy:\n\nClaustrophobic levels of crowding, overpriced / borderline fraudulent retail, traffic that barely moves, groups of roadmen/hood teens everywhere",
   "created_utc": 1695064712,
   "score": 177,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16b4ks",
   "message": "Plymouth Rock",
   "created_utc": 1695068063,
   "score": 147,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k165n4s",
   "message": "Hollywood was such a tourist trap. I guess, see it once but expect to be disappointed. Lot of fake guys wanting to get money from you because they dressed up like spiderman.",
   "created_utc": 1695066177,
   "score": 245,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16g031",
   "message": "The big Christmas tree at Rockefeller center NYC around Christmas... So packed I got just close enough to barely squeeze myself out.. Didn't even really see the tree... That area always looks so nice in movies 🤷.Time square also.. straight up stressful just being there . An I still don't understand why gridlock traffic everyone feels the need to beep their horn constantly as if there is anywhere to go?..I'm just to country boy I guess...",
   "created_utc": 1695069801,
   "score": 91,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k167exp",
   "message": "Any tourist destination in Bali. Beautiful place, amazing food, stunning vistas, friendly people, but the pushy salespeople on the street outside every tourist destination trying to extract every rupiah I had for tourist knick-knacks ruined a lot of the good vibe.",
   "created_utc": 1695066781,
   "score": 191,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16psuw",
   "message": "The Sistine Chapel. It was incredible to see in person, but it was literally shoulder-to-shoulder with people and they were trying to usher everyone through as fast as possible, so I felt like I was in the way and couldn’t stay long. I would have loved to just gaze quietly at the ceiling and take it all in for several minutes, but that wasn’t an option.",
   "created_utc": 1695073425,
   "score": 87,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k15zwcr",
   "message": "Myrtle Beach. Just don't go.",
   "created_utc": 1695064186,
   "score": 156,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16nqeb",
   "message": "The Little Mermaid statue in Copenhagen was...underwhelming. To be fair though, I shouldn't really have expected to be whelmed by a little mermaid statue.",
   "created_utc": 1695072659,
   "score": 40,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k163qvb",
   "message": "Mount Rushmore, the land around it is 1000X more spectacular to look at then the fuckin rock lol",
   "created_utc": 1695065528,
   "score": 48,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16g2qm",
   "message": "Times Square, NYC\n\nIt's just a bunch of screens. I'm not joking, that's *it*.\n\nNew York City is an amazing place, but please avoid this giant tourist distraction that offers nothing. \n\nSide note: and for those who want to see the Statue of Liberty, since you can't go up in the crown anymore, the trip isn't really worth the unbelievable line, imo. Just take the Staten Island ferry ⛴️, and you'll get close to the statue and pass at a leisurely pace. \n\nThen hop on the ferry back! Unless... you know, you want to hang out in Staten Island... which is entirely your prerogative, I mean... you do you!\n\nEdit: a word",
   "created_utc": 1695069827,
   "score": 0,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16kplv",
   "message": "Pigeon Forge Tennessee... The only good thing there is Dolly Parton herself.",
   "created_utc": 1695071528,
   "score": 73,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k1665kq",
   "message": "Niagara Falls, overrun during the summer.  The Ontario side is the tackiest of tourist destinations, the NY side is a great place to get shot in the face.",
   "created_utc": 1695066353,
   "score": 145,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k15scpa",
   "message": "Wondering people who are commenting... did they visit the place as a tourist themselves?",
   "created_utc": 1695061497,
   "score": 127,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k169mft",
   "message": "Sadly I live there.\nNashville, Tennessee",
   "created_utc": 1695067534,
   "score": 62,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k15tgq7",
   "message": "Cabo San Lucas.  It's certainly pretty, and the tourists aren't the problem, it's that you can't go anywhere in town or on the beaches without being constantly hounded by people trying to sell you stuff.",
   "created_utc": 1695061902,
   "score": 116,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16pvyu",
   "message": "I went to Santorini this year. The island is an empty rock, no trees, no nature and full of trash. The unique places clean are the villages that are just an attraction for tourists. Everything is overpriced and packed of instagramers wanting their photos and not caring about the people around. I will never go back there.",
   "created_utc": 1695073458,
   "score": 31,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16mtxs",
   "message": "Tourist infested? Prague. But it wasn't disappointing at all. I can't bitch about tourists when I'm one of them.",
   "created_utc": 1695072320,
   "score": 106,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16fr4i",
   "message": "Prague was absolutely beautiful, but holy shit the amount of tourists and general chaos in the busy squares really dampened the mood a bit",
   "created_utc": 1695069711,
   "score": 75,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16j6zv",
   "message": "Cancun.  It was still majestically beautiful but practically impossible for a first time 19yr old to navigate without getting separated from all his cash.",
   "created_utc": 1695070965,
   "score": 73,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16k3pa",
   "message": "SEDONA, AZ. \n\nRIP. it was so beautiful",
   "created_utc": 1695071301,
   "score": 73,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k161c63",
   "message": "Hollywood Blvd",
   "created_utc": 1695064692,
   "score": 87,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k1664p7",
   "message": "Stonehenge. When I went: for some reason you couldn’t get within a hundred yards from it or so. Don’t remember why but I remember it was faaaar away. And there’s nothing else to do nearby. \n\nWhat’s crazy is they let people hop and dance all over the damn thing during summer solstice. I know because the peeps I went with had done so.",
   "created_utc": 1695066344,
   "score": 208,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16mxmr",
   "message": "Dubrovnik after GoT. So many Khaleesies",
   "created_utc": 1695072357,
   "score": 45,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k166m93",
   "message": "Times Square",
   "created_utc": 1695066512,
   "score": 65,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k178ay3",
   "message": "Salem, Massachusetts. \n\nI knew there would be a ton of witch-hunt hype, but I wanted to see 17th century buildings and locations, not dozens of cheesy gift shops.",
   "created_utc": 1695080899,
   "score": 21,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16xii3",
   "message": "Ground Zero in NYC. It wasn't so much the number of tourists, but rather the number of smiling selfies being taken. It felt like it was in bad taste.",
   "created_utc": 1695076394,
   "score": 43,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16bb4x",
   "message": "The Mona Lisa is this tiny ass painting you have to be in a huge, moving queue to see for like a minute or two before moving out of that area with the herd",
   "created_utc": 1695068128,
   "score": 79,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16ss5y",
   "message": "Venice. It’s beautiful and scenic but man it’s crowded and just gross with tourism.",
   "created_utc": 1695074534,
   "score": 18,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16suim",
   "message": "This might get downvoted to hell but MILAN CATHEDRAL. Beautiful cathedral but whoever is running that as an attraction has utterly ruined it. They check the bags of everyone entering NOT looking for weapons, they’re looking for souvenirs that were not purchased at the official Milan Cathedral gift shop. The person has the choice to throw away the souvenir they bought or waste the ticket they had already purchased. I saw a trash can full of hundreds of dollars worth of souvenirs just because they were not purchased from the official store where you buy the entrance tickets. It was gut wrenching not only as a tourist, but as a Christian to see this. Beautiful cathedral ran by ugly and terrible people.",
   "created_utc": 1695074559,
   "score": 16,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16cbi9",
   "message": "The Disney parks in Orlando, we paid an absolute fortune for tickets but the place was so overcrowded it just wasn't fun",
   "created_utc": 1695068486,
   "score": 164,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k167qi4",
   "message": "This will be an odd one, but North East Georgia during leaf season. I’m a local so once it starts it’s time to find alternative routes. It gets so bad during peak that emergency vehicles are not able to safely reach their destination. However places like Dahlonega and Blue Ridge depends on the commerce so it slightly reduces our taxes.",
   "created_utc": 1695066891,
   "score": 34,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16shm7",
   "message": "All the hottest places in Tokyo. I spent 3 weeks in Japan and loved 90% of it but Tokyo was a massive disappointment. Even in March, when international tourism was still slow to pick up, places like Harajuku, Shibuya, and Kabukicho were way too touristy and boring for my tastes and every other tourist seemed to have no idea what they even wanted to do or see, there. On the other hand, I endured tourist-infested areas of Kyoto well because the sights to see were extremely worth it. Kiyumizu-dera? Gorgeous. Totally worth the 9am crowds. Probably would not have felt the same at 1pm, who knows. Dotonbori in Osaka? Totally fucking worth every crowd, it was so much fun. Tokyo? Not even close.",
   "created_utc": 1695074424,
   "score": 33,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16h5up",
   "message": "Downtown Reykjavík. Any Icelander knows what I'm talking about.\n\nQuirky cute little downtown area thats just overswarmed with tourists and stores selling cheap puffin trinkets",
   "created_utc": 1695070220,
   "score": 63,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16ktlt",
   "message": "Bourbon Street, New Orleans.\n\nI don't want to sell my shoes to you, and I don't want to give everyone on the street a cigarette. \n\nJust didn't feel safe at all, and there wasn't much jazz playing either - day and evening.\n\nLovely city tho.",
   "created_utc": 1695071570,
   "score": 71,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16i4sv",
   "message": "I live in a tourist city, Bath, and it's an absolute nightmare in summer and around Christmas",
   "created_utc": 1695070573,
   "score": 13,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16yvwg",
   "message": "Las Ramblas in Barcelona, what a pickpocket paradise!",
   "created_utc": 1695076966,
   "score": 16,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k17a84b",
   "message": "Savannah, Georgia. We went on a weekend thinking southern gentility/quirky Midnight in the Garden of Evil. Instead it was bachelorette parties, those bicycle bar things with lots of \"woo woo\" girls, and drunken frat guys vibe. It was much like Bourbon Street with the rowdy drunks.",
   "created_utc": 1695081702,
   "score": 14,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k17fsvp",
   "message": "Never go to the Van Gogh “immersive experience” — it’s the biggest bit of malarkey I’ve ever paid $50 for. You’re just trapped inside a blurry, underwhelming PowerPoint presentation where the art is not even presented in logical sequence and the music is arse.",
   "created_utc": 1695083919,
   "score": 15,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k169svd",
   "message": "I love Great Smoky Mountains National Park, but every town around there suuuuuuucks. Gatlinburg, Pigeon Forge and Seviervelle are awful. Just endless strip malls, mini golf, go kart tracks, chain restaurants and dumb gimmicks. Ugh.",
   "created_utc": 1695067597,
   "score": 134,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k168sti",
   "message": "Leaning tower of Pisa",
   "created_utc": 1695067251,
   "score": 12,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16efks",
   "message": "Orlando most of the year but in particular the summertime.",
   "created_utc": 1695069238,
   "score": 16,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16sqgh",
   "message": "The answers in this thread are the reason I have no intention of ever visiting most of the world's most popular historical places, museums, and national parks. Not because I don't want to go, but because I can't be fucking reverent surrounded by 300 people snapping pics.\n\nThanks, first world prosperity, for making accessible travel not worth it.",
   "created_utc": 1695074516,
   "score": 50,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16cq0w",
   "message": "I’ve been to Las Vegas twice and both have been very underwhelming. \n\nEverything is basically a giant fake ass tourist trap that tries to imitate the real world locations, with slot machines stuffed everywhere up to the eyeballs, manned by fat old people trying to piss away their life savings.\n\nClubs were fun, but the rest is a solid 6/10.",
   "created_utc": 1695068627,
   "score": 195,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16mg1i",
   "message": "Lagos, Portugal i saw more tourists than actual portuguese people, they where everywhere, it looked like i was in UK or Germany",
   "created_utc": 1695072173,
   "score": 13,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16tm01",
   "message": "Rome. People complain about Paris, but I really enjoyed it. Rome, on the other hand, was horrible. Amazing art and architecture everywhere, ancient ruins, the opulence of the Vatican... it's all there, but absolutely ruined by the thousands of tourists, the locals, and the overall dingy unkempt depressing nastiness of the city. Sorry, didn't love it.",
   "created_utc": 1695074849,
   "score": 13,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16uj6j",
   "message": "I live in LA so if you never been and planning to visit I’ll warn you ahead of time.\n\nThe Walk of Fame and Venice Beach are absolute shitholes. Do something else. Please.",
   "created_utc": 1695075201,
   "score": 14,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k174c1k",
   "message": "A cruise ship",
   "created_utc": 1695079257,
   "score": 12,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k15pd5y",
   "message": "Zion National Park in the middle of summer.\n\nWinter, however, was incredible.",
   "created_utc": 1695060424,
   "score": 65,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16l2ne",
   "message": "The Church of the Holy Sepulcher in Jerusalem.  Still worth it but my gosh, it was hard to appreciate the moment and be prayful where you hurried through the place and there are flocks of people wielding selfie sticks and chatting.",
   "created_utc": 1695071663,
   "score": 14,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16m0ro",
   "message": "Bali. I’ve been lucky to travel all around the world, and no place has disappointed quite as much as Bali. Not only is the island overcrowded with tourists, but it’s also overcrowded with western expats and the whole place is totally westernized and inauthentic. \n\nBut the worst part is the total influencer circus that has taken over Bali. Everywhere we went felt like a theme park for Instagram. All those ’pristine’ and ’natural’ places you’ve seen photos of? Any waterfall, rice terrace, volcano view, tropical beach, historical temple? They are ALL surrounded by tourist shacks selling Chinese crap, they all have entrance fees to even look, queues upon queues upon queues of people, and the people in the queues doing stuff like getting dressed into long evening gowns (rented from nearby racks) to have an oh so original photoshoot at said location, oh yeah and the locals have built all sorts of cheesy photo platforms/swings/loveseats/nests and big plastic signs everywhere, and selling photo props as well. All tour companies advertise ”Instagram tours” that take you to all the famous IG photo spots and come with a photographer and even a wardrobe. \n\nEven the damn volcano sunrise hike was a traffic jam all the way to the top and then the supposedly beautiful sunrise moment was just a photoshoot bonanza. \n\nMy tip for anyone wanting to visit Indonesia: skip Bali. There are SO many much more incredible places to go. East Java had 100x better waterfalls, temples and volcanoes and 10% of the tourists of Bali, and none of the IG crap. Sumatra (or Borneo) to witness orangutans in the wild, trekking in actual largely untouched jungle. Raja Ampat for truly pristine paradise islands and underwater worlds. Indonesia is incredible and vast. Bali is the least impressive part of it.",
   "created_utc": 1695072017,
   "score": 23,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16xbe7",
   "message": "Key West",
   "created_utc": 1695076312,
   "score": 11,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k172bqw",
   "message": "The airport in Atlanta",
   "created_utc": 1695078418,
   "score": 10,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16pia7",
   "message": "Anything Disney!  I grew up living near Disney, so we went a lot (80’s).  It was still crowded and pricey, but nothing like it has become today.  I went a couple years ago on a trip back home.  I could not believe the prices and crowds.  It was miserable.",
   "created_utc": 1695073315,
   "score": 32,
   "submission_id": "16m2cy1"
  },
  {
   "comment_id": "k16kbec",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16m2cy1"
  }
 ]
}