{
 "submission_id": "16m21al",
 "title": "What's the worst thing you've done to someone, who then forgave you?",
 "selftext": "",
 "created_utc": 1695058983,
 "permalink": "/r/AskReddit/comments/16m21al/whats_the_worst_thing_youve_done_to_someone_who/",
 "score": 105,
 "url": "https://www.reddit.com/r/AskReddit/comments/16m21al/whats_the_worst_thing_youve_done_to_someone_who/",
 "comments": [
  {
   "comment_id": "k15p1zv",
   "message": "I treated my partners the same way my parents treated me, unknowingly. I only understood after lots of healing that I was also the villain in lots of other stories, passing traumas to them and extending the cycle.",
   "created_utc": 1695060311,
   "score": 141,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15p5ul",
   "message": "I punched my friend in the face and knocked out his recently implanted tooth. It happened over 15 years ago and I was drunk. Only time I ever punched someone and I felt incredibly guilty about it, still do. He forgave me a long time ago and was one of my groomsmen in my wedding 2 years ago.",
   "created_utc": 1695060350,
   "score": 237,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15tbz5",
   "message": "I helped a guy’s fiancé cheat on him. I met her at a cafè I frequented at the time and she was a server there. She always seemed interested in our friend group and our hobby of playing card games at the cafe after school/work. \n\nWe offered her to join us on a day off one day, to which she agreed! She and I eventually got interested in each other and started going back to her place. I thought we were on the path of a relationship at the time. \n\nI found out a few weeks later when her boyfriend showed up at the cafe and confronted her and me together. I felt awful for the whole thing and apologized to the guy, but he was hella pissed. She tried REALLY hard to blame me for the affair which he kinda bought. \n\nAnyways, like 5 years later I was working as a server at a diner when the (now ex) boyfriend came in as a customer with his wife and newborn baby! He immediately recognized me. Before he and his wife left after eating he came up to me and apologized for what happened back then and said it wasn’t my fault for what happened and he learned the truth over time. He and I shook hands, we wished each other the best and I’ve never seen him again since then.",
   "created_utc": 1695061853,
   "score": 136,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15sw4i",
   "message": "I double booked my friend and my sister for r/Hamiltonmusical at Richard Rodgers in 2016.\n\nI only had one spare ticket, and both showed up when I expected at least one to bail. I chose my friend.\n\nMy sister eventually forgave me. Lin-Manuel probably wouldn’t…",
   "created_utc": 1695061692,
   "score": 83,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15p0l9",
   "message": "When I was a kid my friends parents died and I hacked his runescape account a few days later.",
   "created_utc": 1695060297,
   "score": 5,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15sokd",
   "message": "I started dating my good friends ex boyfriend. I ended up marrying him and went through an abusive relationship (emotionally). She forgave me and was thankful I went thru the trauma instead of her lol",
   "created_utc": 1695061616,
   "score": 228,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15rgm7",
   "message": "I broke up with my first ever girlfriend in middle school on her birthday unknowingly. Literally a 1/365 chance but She did forgive me a few years later and is now married and plans to have a kid soon!",
   "created_utc": 1695061178,
   "score": 163,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15tclk",
   "message": "I rick rolled someone in 2006.\n\nThey forgave me in 2011.",
   "created_utc": 1695061860,
   "score": 185,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15trk1",
   "message": "A major cocaine addiction and affair on my wife. \nIt was almost 10 years ago but we are still together. \n\nI’m not convinced she has 100% forgiven me but we are pretty strong in our relationship now.",
   "created_utc": 1695062011,
   "score": 129,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16cu2p",
   "message": "When I was a child under 8, because I was being sexually abused at home I thought that it was normal and offered a sex act to another child. We never did anything, and I'm kind of glad it happened because he told his mom,  who called cps and that stopped it for a while. I obviously traumatized him.  We met years later,  and he forgave me (or when i brought it to to apologize he said it was fine to get me to leave which is *completely* understandable. Your victim does not owe you forgiveness).  It's still just a disgusting mark on my life,  being a predator even if I didn't understand it and was a victim in my own right.  This is why consent is so important to teach children so they don't think gross shit like are 'normal\"",
   "created_utc": 1695068667,
   "score": 108,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15x6eo",
   "message": "I ditched my closest friends for my then boyfriend at the time who ended up being my fiancé and completely cut me off from them and then cheated on me, and they forgave me and our friendship is much stronger now and I’ll never understand why they forgave me but I thank GOD they did because I wouldn’t be here without them.",
   "created_utc": 1695063219,
   "score": 47,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16derq",
   "message": "I gaslighted my ex-girlfriend when I was struggling with bad depression and started messing around with drugs. She's the best person I know and when confronted I doubled down like an idiot. The guilt killed me and I can't believe I hurt someone I loved so much. We got back together and broke up down the line which still hurts but opening up about that problem and talking it out was the best thing for me at the time. Easily my biggest regret. If you're struggling please don't hesitate to talk things out with the people that love you.",
   "created_utc": 1695068872,
   "score": 25,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15qnfn",
   "message": "I slept with her older sister when \\*we were on a break!\\*",
   "created_utc": 1695060886,
   "score": 90,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15s71z",
   "message": "Had a dry hump fest with my best friends ex gf on coke. Woops.",
   "created_utc": 1695061440,
   "score": 35,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15sel3",
   "message": "Drove my mother’s Cadillac over 35 miles per hour, as a 16 year old with a learner’s permit.",
   "created_utc": 1695061515,
   "score": 35,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15rqau",
   "message": "I kissed (just kissed) someone my friend liked. I feel so guilty about it to this day but it happened and I cannot change it. 😭",
   "created_utc": 1695061275,
   "score": 54,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15wauk",
   "message": "I unintentionally got my friend busted with heroine because I called the cops to do a welfare check on them. I thought she was suicidal, drug use wasn't something I considered.\n\nShe went to jail and lost custody of her kid. Two years later I apologized to her for calling the police instead of just asking if she was OK. I was taken aback that she didn't hold it against me",
   "created_utc": 1695062914,
   "score": 121,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16gbgq",
   "message": "I was a terrible girlfriend to my college boyfriend. I cheated and lied and stole money. I think his life after we broke up was pretty normal and he seems happy. I continued to struggle for years with substance issues and then I sought therapy for my unresolved trauma. A big part of that was taking responsibility for how I treated other people. Years later I reached out to him and apologized. We talked on the phone for a little while and he had to have therapy because of me. He said it helped him forgive me. I don't ever reach out or try to keep in contact with him. I still feel really bad about how I treated him and I probably will until the day I die but that is life. All I can do is be a better person going forward.",
   "created_utc": 1695069916,
   "score": 30,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15tvjf",
   "message": "So many sexual mistakes. \nSo this is not something i did but friend did to me that i forgave. \nI was giving a good friend a place to live for awhile while she wasn't 100%. She ended up stealing some cash from me and got into trouble. She called me from jail pleading for help. At first i told her to sit there and consider the consequences. 3 days later my damn heart broke and bailed her out. I got her into rehab and we are still best friends today. Only women in my circle of friends that my wife even trusts too. People can change.",
   "created_utc": 1695062051,
   "score": 34,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16rsft",
   "message": "I was an idiot teen working at a shop. I was lazy, counting hours, unmotivated. \nMy boss wrote me a letter, about how her business was her home, her means of living and as important to her as her own children.\nShe had been running her own successful shop for twenty years, and I was disrespectful.\nIt was hard to read, but she was right. She was a great boss, and a wonderful person, and instead of firing me or letting me continue being an oblivious asshole, she gently corrected me and let me learn.\n\nShe never yelled or badgered me, she forgave me, she was just asking me to grow up.",
   "created_utc": 1695074162,
   "score": 26,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16rc67",
   "message": "I completely ghosted my best friend for 11 months while she was pregnant until her baby was 3 months old because I had had a third miscarriage in 7 years of trying and my brain just shut down. I said many not nice things to her, saying she did it to spite me, not nice, very toxic and jealous. Had a full breakdown over my infertility and spent 6 month in therapy. \n\nWhen her daughter was 3 months I called her and asked her out to lunch. She was always a good friend and proved it again when I started telling her what happened, and why and she accepted my apology instantly and in the next breath moved on like the past 11 months never happened. \n\nShe’s never let me feel guilty about it, never brought it up again and it’s been 4 years. \n\nThanks Livie.",
   "created_utc": 1695073990,
   "score": 34,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16hicl",
   "message": "I watched a friend’s dogs and house while her and the rest of her family went to say goodbye to their mom dying of stage 4 cancer in the hospital…. I stole all of the mom’s cancer meds while they were gone. I was deep in addiction and while she forgave me because of that I still hate that I was excited about the opportunity to raid their drug cabinets. Like her situation didn’t even matter to me at the time I was just pumped for some hydromorphone. A true self-centered piece of shit man, I’m goin to hell.",
   "created_utc": 1695070345,
   "score": 9,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15o91c",
   "message": "Nice try, officer.",
   "created_utc": 1695060021,
   "score": 58,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16cd3p",
   "message": "Slept with someone, they developed feelings for me, I didn't reciprocate but kept the sexual relationship going and I broke their heart...\n\nThat happened multiple times... Sometimes with friends that I had known for years.\n\nLuckily we're all well rounded adults now and I'm still friendly with all but one person. I probably will never hear from her again and I don't blame her. I had had *my* heart broken and she was a sort of rebound and I basically used her as emotional support while completely neglecting her needs. I was in a shitty place and it made me a shitty person. She deserved much better.",
   "created_utc": 1695068502,
   "score": 24,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16cl2u",
   "message": "I was using meth, and my dad eventually found out. Of course I had removed myself from his home and chose to live in my van so I would keep the drug and everything that came with it away from him, since he also has a strong history of use. Anyway, he wanted me back int he house regardless of my use because he was a worried dad ect, and I moved back in, still using. I was on a back road with a friend, smoking and talking as the usual went. My phone vibrated and I looked down to see a text from my dad, asking if I could find and and if I could find 💉 (which I was using at the time too). I was shocked because it was unexpected but quickly got excited and immediately began messaging around. My luck that day was very minimal and I watch him use one of my very used (2x at least) rigs to slam. I'm surprised watching that didn't make me quit. We both used together for a while, and my stepmom eventually joined in. I ended up having to skip town and my dad slowly lost his job he had for years, then the truck, then the rental, so on. He is doing alright now, but I got to watch that landslide happen because I said yes.\n\nWhat I regret is ever telling him I could find it, and even feeling excited because my drug fueled mind told me that means id get some too. He never held a grudge against me. Our relationship isn't harmed, and I've expressed my guilt for bringing it back into his life. All he tells me is \"it's not your fault kiddo\"but I will die with that guilt. Among many more choices that were fueled by my use of drugs.",
   "created_utc": 1695068579,
   "score": 21,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15yxom",
   "message": "I cut contact with a girl I had been seeing on and off (in an extremely volatile way) for a couple of years, claiming it was for her own good. She forgave me when she realized that I really honestly did do that for her own good. I reached out to her again 2+ years ago and we're still good friends, she's the only ex who's still in my life, and I'm repeatedly astonished at the fact that her fiance, who knows me mostly from her stories, somehow likes me despite all that complicated history.",
   "created_utc": 1695063842,
   "score": 11,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15wftl",
   "message": "My intrusive thoughts won. My cousin had her mouth around a fudge pop and I leaned forward and slammed it all the way back. Idk why I did it but the tip broke off in her throat and she was chocking but I gave her the Heimlich and saved her so she forgave me.",
   "created_utc": 1695062963,
   "score": 33,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15uvvu",
   "message": "Me and my best friend at the time created a catfish account to screw around with my ex boyfriend. We both created and managed the account - we switched off who would use it daily. Or weekly. We both started messaging him and we came up with this story that she lived a block away from where he did. Created this whole story that this catfish account was living with her parents, but were never home. Her dad was a lawyer who traveled everywhere and the mom was some artist. she had a younger brother and always took care of him. She was homeschooled yada yada. Anyways, it got to the point where i had been talking with my ex for about a solid MONTH. (this was back when i was in hs. had too much time on my hands.) and he confessed that he was starting to like me. Said that we should meet up one day. so i agreed to it. we made a plan to meet up at some park nearby. but i never showed up. He messaged me the next day asking why did i ditch him? I didn't say anything for a few days then got back to him. I made up something like my mom came home and asked me where i was going, she grounded me. We messaged less and less, until one day I decided to just send him a picture of me saying that i had been catfishing him etc. He sent me a 5 minute voice message talking about how embarrassed but angry he was. He went off on me basically. told me to leave him alone. I deleted the catfish account.\n\nA year or so later, he randomly reached out to me out of nowhere. He said that despite what i did to him, he had forgiven me for what happened. I did tell him i was sorry and that it was shitty what I did. i showed my best friend the conversation and she laughed at him. Said that he is so sensitive, that he cannot take a joke. Mind you they used to be good friends. she didn't really care. He and I talked for a bit but then we just stopped talking again. I hope he's doing ok wherever he is. It was such a stupid thing to do- i can't imagine doing this to somebody again.\n\nTLDR: Me and my best friend catfished my ex bf. I ended up confessing that it was me and we stopped talking. a year later, he reached out and said he forgave me.",
   "created_utc": 1695062412,
   "score": 14,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15qwqz",
   "message": "I stabbed a friend. Stabbed another friend twice. Knocked another friends molar out. Still friends.",
   "created_utc": 1695060979,
   "score": 23,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15velj",
   "message": "I tormented my sister once I hit puberty 😔\n\nOnce I hit high school though we realized we could get away with so much more stuff so we became best friends.",
   "created_utc": 1695062596,
   "score": 7,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15v4m7",
   "message": "I’m an addict so I’ve done some pretty awful shit. The worst is OD and get arrested. My husband somehow forgave me. 30+ years this year. I don’t know what he sees in me. I am crazy as hell",
   "created_utc": 1695062498,
   "score": 250,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k163k4h",
   "message": "When i was a kid and playing with a stray cat, it shit all over my pants, my friend laughed at this and i got kinda mad so i flung some softserve-like shit at him. Next day we were already playing minecraft together.",
   "created_utc": 1695065464,
   "score": 9,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k162wxs",
   "message": "Whenever I'm fed up, I harshly criticize my mom and poke at her insecurities. Essentially, I'm taking out my anger out on my mom. I always apologize, and she forgives me. I'm going into therapy next week.",
   "created_utc": 1695065242,
   "score": 10,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16rxvh",
   "message": "When I was 4 I walked into my older sister’s room, pulled down my pants and peed all over her carpet",
   "created_utc": 1695074218,
   "score": 3,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16j6a0",
   "message": "I met a girl on tinder, hung out, fucked her, then drove off the next morning after she went to work because I was broken still.  She was bummed, but that girl had such an amazing perspective about it, we're still friends online, she's in a good relationship, I finally got my shit figured to be emotionally available for a relationship.   She's a rad person who didn't take it personal, and she's the only girl I've ever had a fling like that with who I still write Christmas cards to.",
   "created_utc": 1695070957,
   "score": 6,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15txfg",
   "message": "I beat the shit out of my uni roommate because his stupid loser coke head friend was in my room doing coke (he didn’t even offer me any). When I grabbed him and threw him out, my roommate came down and got in my face about it, weirdly taking his side. He pushed me, so I clocked him and just didn’t stop. I was sort of surprised how badly I pummelled him because I actually always thought he was pretty tough and he’s a bit bigger than me. It was a pretty comical fight actually, I was throwing him around the room like in movies, broke a table, etc. he got me a few times too. I’m also not a fighter but I snapped that day. He had been pissing me off lately that year, making fun of my marks in front of girls and what not (I have a better job now, fuck you Dan lol) so I think it just compounded in that moment.\n\nWe’re in our 30s now and I actually just met up with him last week after work for a beer as our offices are near each other lol we never talk about it.",
   "created_utc": 1695062070,
   "score": 10,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15p305",
   "message": "I had sex with one of my friends boyfriends when I was drunk. It was terrible. He was really hot and I was really drunk and he convinced me that my friend would like it. I felt so terrible. I now will not drink around men who Unless I know I can  trust them",
   "created_utc": 1695060321,
   "score": 12,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k15ullp",
   "message": "Worse thing I've done is threw a knife at my dad , I regret it so much , I've never meant to hurt him.💔",
   "created_utc": 1695062309,
   "score": 2,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k169i2l",
   "message": "I accidentally caused a heavy wooden cupboard drop on him hitting his head he was a senior coworker I was 14/15 he didnt shame me even for one second",
   "created_utc": 1695067494,
   "score": 2,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16f9ic",
   "message": "when i was very mentally unwell and untreated i was an incredibly toxic person. \n\ni made my unhealthy habits everyone else’s problem. would romanticize my drinking, self harm, smoking etc. i couldn’t be left alone i would demand attention and my partner when i was in my adult-teens put up with it for much longer than anyone should have. \n\neventually we broke up and finally they blocked me for a few years but this year we actually reconciled and now are on great terms and in much better spots mentally.",
   "created_utc": 1695069534,
   "score": 2,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16hzn6",
   "message": "I ghosted a good friend for years because she made my partner jealous. I was so grateful and relieved when she forgave me for that.",
   "created_utc": 1695070521,
   "score": 2,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16ye9r",
   "message": "My friend is hella rich and there’d be times when we’d be getting food or whatever at the mall and I’d order and just walk away expecting him to pay. I was a dick back then. The fact that we’re still friends can be a testament to his richness though.",
   "created_utc": 1695076758,
   "score": 1,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16itti",
   "message": "I overdrank, apparently pissed everyone off at an event. \n\n\u0026amp;#x200B;\n\nI emailed them a heartfelt apology expressing I didn't know what I did not remember but take accountability for my actions. They took this to heart and invited me for dinner.\n\n\u0026amp;#x200B;\n\nMy buddy who helped me that night said not to go, that it was a trap. Apparently I pissed everyone off so much that I made a fool of myself and pushed everyone's buttons, getting them into a violent rage (I mean, we all have talents, right? lol)\n\n\u0026amp;#x200B;\n\nAnyways, I went and they were very nice. They brought out these big dudes from their bedroom and asked me if I remembered them. I said I didn't. Apparently I insulted them, their mothers, their families and their lives as well as tried to fight them all. I didn't know all this, but apologized profusely. They were super forgiving and nice about it.\n\n\u0026amp;#x200B;\n\nThankfully this happened before the era of everyone pulling out their smartphones or this moment would have lived on the internet forever. But I'm sure this comment will be pulled in 10 - 20 years and turned into a short AI film for some kids junior high project.",
   "created_utc": 1695070829,
   "score": 4,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k160k7m",
   "message": "I stabbed my dad in the arm with a knife almost 2 years ago.  \n\nHe's forgiven me I think. Yes I got charged.",
   "created_utc": 1695064423,
   "score": 2,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k163jqb",
   "message": "i watched my...\n\n#ex wife \n\n...swallow a bottle of expired wellbutrin and told her to try harder.\n\nshe seized and flatlined several hours later and only barely survived.\n\n#i divorced her after this. \n\nshe tried again 10 years later (that was 3 years ago) on my birthday. rude. \n\ni got a tip from someone who cared less than me... but i went over there, on my birthdsy. left my *(much hotter new)* wife at home, and let dinner get cold.\n\ni got her up off the floor... damn girl, you getting thicc. i told her it was gonna be okay. we waited for EMS to arrive, and she went away for a few days. after discharge, I took care of her financially and emotionally while she recovered. she never thanked me... and we don't talk anymore. at all.\n\nbefore you say anything. this is the same woman who shoved my own loaded handgun in my face and threatened to kill me a year before the wellbutrin thing. she swore she didn't know it was loaded. but there was a round in the chamber, and I never kept that gun hot. prolly maybe that's when we shoulda gotten unmarried.\n\nshe forgave me, but never did admit to that one.\n\nand for the record. i do regret telling her that. cos ever since then shes been taking it to heart, shes not doing good last i heard.\n\nand she wasn't always like that. a *\"life event\"* occurred and she kinda just... deteriorated.\n\ny'all girls out there, lock your fuckin car door when you go to the store at night.",
   "created_utc": 1695065461,
   "score": 253,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16ax66",
   "message": "Smoked their O, rebought it to cover it up, then smoked that one too.",
   "created_utc": 1695067990,
   "score": 1,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k169174",
   "message": "Accidentally hit my sister in the face with a metal softball bat.",
   "created_utc": 1695067332,
   "score": 1,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16k5g9",
   "message": "Got caught flirting with an ex through text and my gf forgave me. Still regret it til this day as it didn’t mean anything. I was just too cowardly to have those important and scary talks that are very much needed with your partner. We’ve grown since but it still haunts me.",
   "created_utc": 1695071319,
   "score": 1,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16wny0",
   "message": "can't think of anything, maybe i'm going to hell",
   "created_utc": 1695076047,
   "score": 1,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16dl3m",
   "message": "I once allowed my neighbors son to drink my fermented pee (used it as a source of nitrates to grow potatoes for my family and never told them but that's a different story). I told him it was lemonade because he had this annoying habit of asking for everything you were eating whenever her came over. Be it a bite or a sip it really ticked me off. Anyway once he drank it he spat it out realizing what it was. I bribed him $5 not to tell he had a sore stomach for two days and missed school. Anyway this happened as kids and forgave me back then. He was always a deviant hyperactive menace. Later turned out he was just super intelligent and under stimulated with controlling parents. He went to uni became quite successful he hasn't been home in 4 years since graduating uni. I'm happy for him.",
   "created_utc": 1695068933,
   "score": 1,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16jco9",
   "message": "Bad things happen to me",
   "created_utc": 1695071023,
   "score": 0,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16nb2k",
   "message": "I stuck horseshit in my friend’s mouth. 10 years later and we are married.",
   "created_utc": 1695072499,
   "score": 0,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k16xtjz",
   "message": "Ruined my mother's hips. She forgives me every year on my birthday",
   "created_utc": 1695076519,
   "score": 0,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k171t4i",
   "message": "When I was younger I suggested my friend ask her grandma for money because she has Alzheimer’s and wouldn’t remember she needed to be paid back. It was an intrusive thought meant as a joke but they took it seriously",
   "created_utc": 1695078200,
   "score": 0,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k179jl9",
   "message": "Got her pregnant.\n\nTwice.",
   "created_utc": 1695081416,
   "score": 0,
   "submission_id": "16m21al"
  },
  {
   "comment_id": "k171pqj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16m21al"
  }
 ]
}