{
 "submission_id": "16mcfv9",
 "title": "What is the most depressing city you have been to?",
 "selftext": "",
 "created_utc": 1695083701,
 "permalink": "/r/AskReddit/comments/16mcfv9/what_is_the_most_depressing_city_you_have_been_to/",
 "score": 103,
 "url": "https://www.reddit.com/r/AskReddit/comments/16mcfv9/what_is_the_most_depressing_city_you_have_been_to/",
 "comments": [
  {
   "comment_id": "k18efcl",
   "message": "The port city of Aden in the Yemen. I was lucky that I got shipped out the day before the last civil war started.",
   "created_utc": 1695099529,
   "score": 97,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18irry",
   "message": "Cairo, Egypt. It could be amazing to visit the remnants of one of the great civilisations but instead it's a littered crumbling place where the local peddlers are harassing tourists  to the point of fear. Men touch foreign women without consent, just passing in the street. Awful awful place.",
   "created_utc": 1695102361,
   "score": 168,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17g33q",
   "message": "Gary Indiana",
   "created_utc": 1695084030,
   "score": 241,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k183rfm",
   "message": "Kolkata, India. Levels of poverty and suffering that I had never even imagined before visiting.",
   "created_utc": 1695093792,
   "score": 13,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18h1j3",
   "message": "Phnom Penh. The most seedy vibe you've ever felt, western men all over young Cambodian girls. The horrible history. Couldn't wait to leave the place, broke my heart.",
   "created_utc": 1695101202,
   "score": 158,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17yr9k",
   "message": "Odessa/Midland Texas. Grew up somewhat close to it, and moved away in my early 20s. Going back to see family, it’s the worst part of the drive.",
   "created_utc": 1695091546,
   "score": 172,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17tsxy",
   "message": "Juarez, Mexico.\n\nI lived in El Paso Texas in the mid 90s, and went to Juarez at least once a week.  There were some nice areas with fun nightclubs and great restaurants, but if you got off the main roads on your way to the nice areas?\n\nGood luck with that.\n\nThe first night I went across the border, one of the people in our car - a Mexican native - said \"please don't judge my country by this place.\"  She was right.  I've been from one end of Mexico to the other, and it is a lovely country with great people...but Juarez is a depressing shit-hole.  And back when I went there it was relatively \"safe\" before the drug war really kicked in.\n\nJuarez makes Gary Indiana seem like suburbia.",
   "created_utc": 1695089444,
   "score": 184,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18iq10",
   "message": "Fresno. My God, if we could bottle the feeling it gives you and sprinkle it over the Russians they'd all go home and cry.",
   "created_utc": 1695102329,
   "score": 246,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18lqf7",
   "message": "The utter shitehole that is Bradford, England.",
   "created_utc": 1695104420,
   "score": 55,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18mq38",
   "message": "Toledo,  OH",
   "created_utc": 1695105139,
   "score": 28,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17tg5g",
   "message": "Niagara Falls, Ontario Canada. The falls part is nice but the rest of the city looks like an apocalyptic wasteland",
   "created_utc": 1695089295,
   "score": 45,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18i2c2",
   "message": "My hometown I joined the army young and every time I go back, it’s like seeing a tv show I just slowly watch as my family gets old started with my younger siblings not being able to drive, my step dad being so lively, my mom being there always. These days my siblings have vehicles, lives, my dads old I can’t see it in his face his hair his body, my mom is getting sick. So every-time I go back to my city it’s just to catch up on my show of what I’ve missed except I don’t get the best adventures or the saddest moments I get what I get and it’s mostly them just trying to put up a fake facade of what’s really going on their lives just to make me comfortable at one point I was young enough to not notice but when I went through my trauma I can now feel the slightest awakes moments like glass breaking in an empty room.",
   "created_utc": 1695101884,
   "score": 54,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18ggn5",
   "message": "Driving through Alabama into Florida felt like seeing different layers of hell. Just rundown houses, trailer parks, strip clubs, and weirdly billboards for megachurches and sex shops...just those two things.",
   "created_utc": 1695100822,
   "score": 150,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17gb1r",
   "message": "Technically a town but Lowestoft",
   "created_utc": 1695084116,
   "score": 40,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17yusx",
   "message": "Atlantic City",
   "created_utc": 1695091589,
   "score": 84,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18fp0a",
   "message": "Corpus Christie Texas. That is a hollowed out shell of a town. Oil company gang bang gone wrong.",
   "created_utc": 1695100323,
   "score": 66,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18ls07",
   "message": "In SoCal: Anywhere east of the Inland Empire or San Bernardino, CA. Opioid towns and sadness",
   "created_utc": 1695104451,
   "score": 15,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k187k8c",
   "message": "This is a Gary Indiana post",
   "created_utc": 1695095600,
   "score": 34,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17iu26",
   "message": "West Memphis, Arkansas is bad",
   "created_utc": 1695085111,
   "score": 106,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k183ske",
   "message": "Camden New Jersey.",
   "created_utc": 1695093806,
   "score": 57,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17gurm",
   "message": "Battle Creek, Michigan",
   "created_utc": 1695084331,
   "score": 29,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k187luc",
   "message": "Dubai. Flashy with a lot of money. But soulless.\n\nSingapore. A country populated by millionaires. Nicer than Dubai but it's burnout city. People live there to work and nothing else. Your standing in society is judged by how big your bank account is and it shows.\n\nBangalore. Been going there for 30+ years. The small, cool vibe city that I used to love as a child has been replaced with overcrowding, massive glass buildings and broken infrastructure. Went from a small, classy retirement city into a rat race ridden sprawl.",
   "created_utc": 1695095624,
   "score": 135,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18eh90",
   "message": "East St. Louis. Hiroshima the day after was nicer.",
   "created_utc": 1695099561,
   "score": 39,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17t1wp",
   "message": "I was shocked walking through the tenderloin district of San Fran, it was 10 am too.",
   "created_utc": 1695089136,
   "score": 86,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18f52k",
   "message": "Managua, Nicaragua.\n\nAbsolutely the worst, most unpleasant, unsafe, disgusting city I went to in all of Central America. Get in and immediately get out.",
   "created_utc": 1695099970,
   "score": 27,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k1840g8",
   "message": "LA (as a foreigner). It just seemed like such a twisted state of existence, with a huge disparity between the haves and the have-nots. The culture seemed plastic and classful in a very uncomfortable way. I recognise that LA cannot be entirely like that, but what I experienced was. It left me feeling like I never need to return.\n\nTo be transparent, my stay was privileged but where I'm from is egalitarian, so that coloured my view greatly.",
   "created_utc": 1695093901,
   "score": 165,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17z7r4",
   "message": "Wilkes Barre, Pennsylvania.",
   "created_utc": 1695091749,
   "score": 31,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18emxg",
   "message": "I used to make a lot of trips between the Bay Area in CA and Oregon. Redding CA was a convenient halfway point when I had to leave later in the day and needed to stop for the night. Every stay was worst than the last. I slowly grew to hate that city. Sorry anyone from there. I'm sure there are nice areas and good people there somewhere.",
   "created_utc": 1695099656,
   "score": 35,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18dc0w",
   "message": "Aberdeen, WA and Detroit, MI some 7-8 years ago.",
   "created_utc": 1695098857,
   "score": 46,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18ehu9",
   "message": "Uyuni, Bolivia. It's a small city on the outskirts of the Salar de Uyuni, a unique salt flat that gets enough rain during the winter to make it look like a mirror stretching to the horizon. It's a stunning natural wonder for sure, but Uyuni... well, lets just say that the biggest attraction in Uyuni is an abandoned train graveyard. Literally just a dozen or so rusting graffiti covered turn of the century mining rail cars rotting away in the desert. \n\nThe place is depressing an hour before you even see the city itself. Nothing but scorched brown earth for at least an hour until you start to see some trash on the sides of the highway.  Once you get into the city itself, the bleakness starts to become more apparent. Shabby low slung buildings that look like they were designed in MS paint. Giant empty streets, some covered in a layer of brown sand or dirt. Potholes everywhere. The main attraction in town besides the train graveyard is one of the saddest looking clocktowers I've ever seen. It looks like the slowest kid in your 7th grade art class tried to replicate big ben at 1/10,000th the scale and having only seen blurry pictures of the real deal in an encyclopedia.\n\nThen there's the food. My god the food. Since it's a poor city in the middle of fucking nowhere, the main protein you'll get at pretty much every restaurant is Alpaca. Dry, chewy, and slightly gamy. If you think Alpaca bolognaise sounds fun and exotic, trust me, it's not. It's just sad.",
   "created_utc": 1695099571,
   "score": 21,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18gcmr",
   "message": "I spent like 20 minutes in Poughkeepsie as a teen (on the way to somewhere) and then it was the setting for all my gloomy fiction for several months",
   "created_utc": 1695100750,
   "score": 19,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18kyw5",
   "message": "Moscow, Russia. I’ve never felt more depressed or wanted to leave a trip sooner. Everything and everyone is gloomy.",
   "created_utc": 1695103881,
   "score": 48,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18mt9e",
   "message": "Wichita. My god.",
   "created_utc": 1695105204,
   "score": 15,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18if1r",
   "message": "Jacksonville NC",
   "created_utc": 1695102123,
   "score": 9,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18ii2t",
   "message": "Shelby, Montana. Most of the towns on the reservations are pretty sad too, unfortunately.",
   "created_utc": 1695102180,
   "score": 8,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18l4cn",
   "message": "Gary, Indiana",
   "created_utc": 1695103990,
   "score": 9,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18svl7",
   "message": "Bakersfield California, it is where hope goes to die.",
   "created_utc": 1695109881,
   "score": 8,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17spaj",
   "message": "Warsaw, granted this was right after the fall of the ferrous drape, hopefully it's better now.",
   "created_utc": 1695088994,
   "score": 34,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18jjv1",
   "message": "Elyria, Ohio",
   "created_utc": 1695102889,
   "score": 6,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k19fe1i",
   "message": "Most rural towns between the 3 C’s in Ohio. \n\nAt least in the cities and suburbs of Cleveland, Cbus and Cincy there’s massive opportunity and wealth. \n\nIn the sticks between ‘em? With few exceptions, it’s a religious, poverty stricken **brain drain**. Some of the dead towns look like *The Last of Us*.",
   "created_utc": 1695125430,
   "score": 6,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18iffk",
   "message": "Fort McMurray, Alberta \n\nVery dirty, filled with temporary workers, only 1 road in and out of town. Not walkable. Has a crime problem.",
   "created_utc": 1695102130,
   "score": 25,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18qcw3",
   "message": "The whole state of Florida.  Imagine everything negative in the United States in one 170,000 sq. km flaccid penis dangling into the Atlantic Ocean.",
   "created_utc": 1695107891,
   "score": 61,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18h0ro",
   "message": "Mobile, AL and Memphis, TN.",
   "created_utc": 1695101187,
   "score": 10,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18st49",
   "message": "Gulfport Mississippi.",
   "created_utc": 1695109826,
   "score": 13,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18regg",
   "message": "Not a city, but Luton in the UK.",
   "created_utc": 1695108704,
   "score": 7,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17snwd",
   "message": "Las Vegas.",
   "created_utc": 1695088979,
   "score": 73,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k186zfb",
   "message": "I don’t recall the name of the town, but it was (one of many) steel towns in PA.  I hated doing work in PA.  They are dead towns.",
   "created_utc": 1695095312,
   "score": 12,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k186ypz",
   "message": "Newark, New Jersey.  I was there about a decade ago to pick up some thing I had shipped.  I'm from a major city, and I've seen some rough, rough areas.  It was nothing compared to being on the wrong road in Newark trying to find the train station.  \n\nThat or Detroit.  Those people live in Mad Max times.",
   "created_utc": 1695095303,
   "score": 21,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17nqsu",
   "message": "St Louis. \n\nI’ve seen nicer toilets",
   "created_utc": 1695087011,
   "score": 44,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k17uijx",
   "message": "Ocotillo, CA\n\nYou've probably never heard of it.",
   "created_utc": 1695089740,
   "score": 14,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18dk3c",
   "message": "Freeport, Illinois",
   "created_utc": 1695098994,
   "score": 5,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k193w9u",
   "message": "Jackson, MS",
   "created_utc": 1695118620,
   "score": 5,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k1998wj",
   "message": "Roswell, NM.\n\nImagine if a run down Chuck E Cheese somehow grew into an entire city",
   "created_utc": 1695122117,
   "score": 4,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k19ff03",
   "message": "Youngstown, Ohio.  The definition of rust belt.",
   "created_utc": 1695125443,
   "score": 6,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k19iq77",
   "message": "Not so much a city, but have been to a few remote aboriginal/indigenous communities in the outback of Northern Territory Australia for work. Houses that were ripped apart and barely provided shelter, glimpses of kids abusing substances, men missing or passed out with substance abuse issues, and mothers struggling with it all.",
   "created_utc": 1695127030,
   "score": 5,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18o5gn",
   "message": "So many astronauts come from Ohio because they all want to get as far away from Cleveland as possible",
   "created_utc": 1695106201,
   "score": 45,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18niy0",
   "message": "East St.Louis  \nAll I did was drive through that place on highway, but when traffic slowed down, I saw a person walking around with a syringe sticking out of their leg under an overpass as well as several other zombie like people stumbling around haphazardly by the road.",
   "created_utc": 1695105728,
   "score": 10,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k183nk4",
   "message": "Baltimore was up there.  We went to the hood to find the best chicken and it looked pretty bleak.",
   "created_utc": 1695093742,
   "score": 30,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18x631",
   "message": "Two that stand out:\n\n1. Christchurch, NZ. After the last earthquake happened, everyone just left the core. It was like the Walking Dead when I was there, tons of abandoned condemned buildings, nobody around, some sketchy guys following us. It was really depressing.  \n2. Lesvos, Greece. Refugee crisis where people are caught on this island, having escaped from the Middle East to Turkey, then rafted over to Lesvos in hopes of getting to mainland Western Europe. But they’re just stuck in limbo as the EU doesn’t want to accept them. When I was there, the living conditions and overcrowding in camps were atrocious.",
   "created_utc": 1695113337,
   "score": 10,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18uhzv",
   "message": "Almere in the Netherlands",
   "created_utc": 1695111183,
   "score": 3,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18eyyx",
   "message": "Baltimore, Maryland. Stopped to get a soda from 7/11 and saw a dude doing heroin on the side walk. And everything was just really dirty. The bay was gorgeous tho",
   "created_utc": 1695099861,
   "score": 12,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18l5o3",
   "message": "Baton Rouge, Louisiana for some reason. My grandparents lived there for several years. Probably somewhere in Florida beats it but I can’t really remember those.",
   "created_utc": 1695104015,
   "score": 14,
   "submission_id": "16mcfv9"
  },
  {
   "comment_id": "k18v0gz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16mcfv9"
  }
 ]
}