{
 "submission_id": "16mzx18",
 "title": "What happened to the lonely guy of your high school class ?",
 "selftext": "",
 "created_utc": 1695151566,
 "permalink": "/r/AskReddit/comments/16mzx18/what_happened_to_the_lonely_guy_of_your_high/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/16mzx18/what_happened_to_the_lonely_guy_of_your_high/",
 "comments": [
  {
   "comment_id": "k1bnznw",
   "message": "Well, I just googled him and he's a Georgetown law professor.",
   "created_utc": 1695155125,
   "score": 49,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bofzv",
   "message": "The person I always thought of as possibly lonely retained the same couple of friends for the past 13 years and they still seem to enjoy getting together and doing the things they did back then. Video games, anime, etc. \n\nOne of the most happy-go-lucky, friendly, and popular guys I knew took his own life a couple of years back.",
   "created_utc": 1695155281,
   "score": 108,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bpqqt",
   "message": "Committed suicide a few years after graduating. Didn’t know it for over a decade until I came across a Facebook page for my high school class. He was listed as one of the people that had passed away.",
   "created_utc": 1695155732,
   "score": 38,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bnqi0",
   "message": "Shot himself in the head after his attempt to wrap around a tree didn’t work. He’s now being taken care of by his 78 year old mother.",
   "created_utc": 1695155037,
   "score": 99,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bsnim",
   "message": "I lost touch. Can't be a one way street forever :(",
   "created_utc": 1695156757,
   "score": 46,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bqyff",
   "message": "i don't really know what happened to anyone from high school, and i'm okay with that.",
   "created_utc": 1695156159,
   "score": 90,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bqovz",
   "message": "Of course I know him, he’s me",
   "created_utc": 1695156065,
   "score": 11,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bqv1j",
   "message": "We had a guy at our school who was nice enough and tried to be friends with everyone, but was odd enough that everyone avoided him. Always quiet, would set with us and just stare. Always seemed sad. He’d show up, attempt to hang out then would wander off to try to hang out with another group and fit in… He raped and murdered a young girl after high school, left a ton of physical evidence (clothing and belongings) at the scene and is serving life in prison. Always kind of made everyone who avoided him feel bad for doing it, we all felt like we could have done something to make the dude feel more regular and made him more social just so his brain didn’t break.  [article](https://www.latimes.com/archives/la-xpm-2002-sep-15-tm-murder37-story.html)",
   "created_utc": 1695156126,
   "score": 183,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bsnns",
   "message": "He was my friend, He didn’t make it.",
   "created_utc": 1695156759,
   "score": 14,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1ccpwt",
   "message": "he ended up graduating top of the class, got a full ride scholarship to cornel got his masters makes 7 figures a year and is happily married with two kids. i was one of his few friends in highschool and dude is doing amazing in all aspect of his life",
   "created_utc": 1695165362,
   "score": 27,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bok70",
   "message": "He is sitting in a data science conference reading Reddit.\n\nI am sitting in a data science conference reading Reddit.",
   "created_utc": 1695155322,
   "score": 12,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bdx2v",
   "message": "He made a Reddit account and now wasting his best years on the site.",
   "created_utc": 1695151645,
   "score": 130,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bsui7",
   "message": "Got cancer very suddenly and died,went to his funeral he was just 16 the youngest in our class,truly a tragedy.",
   "created_utc": 1695156829,
   "score": 51,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bmsc4",
   "message": "Haven’t heard from him in 8+ years. I know he made a couple attempts on his own life before. I just hope he’s doing okay now.",
   "created_utc": 1695154711,
   "score": 148,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1btd06",
   "message": "He committed murder against massage therapists in Atlanta. \n\nhttps://www.nydailynews.com/2021/03/19/lets-be-honest-about-what-we-know-and-dont-about-the-atlanta-murderers-motives/",
   "created_utc": 1695157014,
   "score": 163,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bry5x",
   "message": " Learnt that he killed himself 2 years ago. Apparently because he was accused of bad stuff and didn't want to go to jail. \n\nI was also pretty lonely most of my scholarship, but in high school I had the luck of finding a small group of friend that adopted me.",
   "created_utc": 1695156508,
   "score": 225,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c9c4r",
   "message": "He hanged himself shortly after hs and photos of him were spread around some saying how he was so nice and stuff and they didnt expect this when they were people who bullied him and othere where just making memes of him example: smoking that anon pack.",
   "created_utc": 1695163889,
   "score": 66,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bnuq8",
   "message": "He joined a cult and completely cut ties with his family. There was an article written about said cult recently and his name pops up quite a bit, so he must have some kind of position of authority in it.",
   "created_utc": 1695155078,
   "score": 82,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bsm4p",
   "message": "Ours was a lonely girl, and we have been trying to track her down actually. Last we heard she was homeless and a drug addict. I really hope she’s doing better because she was a sweet girl, just very shy.",
   "created_utc": 1695156744,
   "score": 167,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1ccn7o",
   "message": "Just Googled him. Apparently he finally got a girlfriend in college, got her pregnant, then murder/suicided them. Jesus. I wish I hadn't checked.",
   "created_utc": 1695165329,
   "score": 192,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bxh04",
   "message": "still lonely, However he worked his way up within a KFC franchise through high school and bought his first house early on even though he didn’t do well at school. Then worked in the army for 10 years and bought property 2 and 3. Now works as a director on a cruise liner and goes country to country by himself \n\nNo partners or girlfriends ever but financially well off",
   "created_utc": 1695158549,
   "score": 249,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c8hvo",
   "message": "Didn’t like to be around people much, so he spent a lot of time riding his motorcycle alone, which he said he found therapeutic.  Died at 20 in a motorcycle accident.",
   "created_utc": 1695163525,
   "score": 123,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bm5zy",
   "message": "He became an actually model for high class perfumes and brands and not one those instagram / tik tok \" models \"",
   "created_utc": 1695154493,
   "score": 79,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1d7xad",
   "message": "He unfortunately went on to become the Sandy Hook Elementary School shooter. I’ll never be able to unsee that kid’s face despite how much I want to.",
   "created_utc": 1695179085,
   "score": 47,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1brgme",
   "message": "He married a pretty artist from Syracuse and also typed this sentence",
   "created_utc": 1695156337,
   "score": 22,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bhpy2",
   "message": "I got a degree, got married, started a career. Not much different form others, just started later.",
   "created_utc": 1695152971,
   "score": 178,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bsrhh",
   "message": "I became an agoraphobic shut-in after a short stint in higher education.",
   "created_utc": 1695156798,
   "score": 20,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bte7g",
   "message": "Got all incel about a girl who was dating a guy he didn't like.  Stole a rifle from a neighbor and shot him dead, and wounded a few others.  He was immediately caught and sent to prison.  Just got out a year ago or so after 18 years or so.",
   "created_utc": 1695157025,
   "score": 8,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bsufc",
   "message": "I'm doing OK.\nFor someone who has lost sight in 1 eye, fought off incurable cancer, permanent nerve damage in back, hips, and legs, slipped disc in back and fractured pelvis. But yeah, I'm good",
   "created_utc": 1695156828,
   "score": 253,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1befw0",
   "message": "It’s me. I’m the lonely guy.",
   "created_utc": 1695151825,
   "score": 176,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bdunb",
   "message": "Dropped off the map, hope he's doing good tho",
   "created_utc": 1695151622,
   "score": 17,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bw87y",
   "message": "I graduated from college, got married, have a career in IT, and am currently saving up for my dream car.",
   "created_utc": 1695158089,
   "score": 52,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c2rdt",
   "message": "If the lonely guy is known, than he is not the loneliest guy. \n\nBut most are fine. High school is not a great time for many.",
   "created_utc": 1695160841,
   "score": 253,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c1d6u",
   "message": "He grew several inches after high school..  went into tech. Was very successful and now has a supermodel wife and a beautiful family..\n\n\nAnother guy became a pediatric surgeon. Was married and had a daughter.. over the years his wife disappeared from his Facebook post and it was just him and his daughter.. in a few years ago he married a super model Eastern European nurse.\n\n\nAnd the third guy climbed into a bottle and never got out...",
   "created_utc": 1695160235,
   "score": 130,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c5v16",
   "message": "Committed suicide while still in HS. He was lewd, obnoxious to get attention, and incredibly disrespectful to girls. (Would go up behind girls and pretend to hump them, etc) I think he would have been a future rapist.",
   "created_utc": 1695162376,
   "score": 83,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c9rky",
   "message": "Moved his disgusting sexual remarks online. He kept messaging all of the women from our graduating class (myself included, until I blocked him,) and made lewd comments just like he did when we were 15, and we're now in our 30's. Proof that some people just never grow up.",
   "created_utc": 1695164074,
   "score": 87,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1btxoa",
   "message": "Married with four kids, good career. \n\nJust took him a little longer than some to come out of his shell. \n\n(It was me)",
   "created_utc": 1695157229,
   "score": 116,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c02eb",
   "message": "Still alone, but I'm not as lonely. Video games and weed and a job make for a cozy comfortable life and that's better than being lonely and in a shitty situation growing up. I'm still young, I'll find someone eventually not getting too fussed about it and not really looking rn either",
   "created_utc": 1695159616,
   "score": 106,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c13a9",
   "message": "He became an entrepreneur of a really successful company. \n\nEmployed the 3 jokers who used to bully the heck out of him. They still don't know who he is.",
   "created_utc": 1695160084,
   "score": 108,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bxix2",
   "message": "We’re all here dude.",
   "created_utc": 1695158569,
   "score": 40,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1d5t4e",
   "message": "Joined the army and then literally went AWOL two years later. No one has seen or heard from him since. His mom posts his missing person flier up on my hometown's Facebook page every year on his birthday. It's really fucking sad",
   "created_utc": 1695178075,
   "score": 36,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bzc1g",
   "message": "It was me!  As an immigrant that didn't speak English well, I was picked on a lot and it really affected my development as a kid.  My \"clique\" at school was the outcasts that none of the other cliques wanted.  I got rejected a bunch in high school (including getting humiliated when I asked someone out to prom...I ended up not going), gave up on it and in college decided to focus on my career.  Got a night internship at a tech company working 7PM to 4AM, while going to college fulltime.  Got a job immediately after college (internship turned into a job) and decided to focus on dating.  \n\nGot rejected a bunch, finally got my first repeat date (ie. not just a first date from OKC) when I turned 27.  Turns out dating, like everything else in life requires practice.  I got zero practice and was pretty awkward and possibly creepy.  Kept trying, kept getting rejected.  Got my first girlfriend (ie. dated for \u0026gt;3 months) when I turned 32.  Didn't work out well because again, relationship needs practice and I had none.\n\nFinally, started dating my wife when I turned 37 and we've been happily married for 6 years with 2 kids!\n\nIt was a rough ride, but I'm happy that I'm here.  My wife jokes that she's glad I sucked at dating because otherwise I would have been off the market before we met.  I'm glad too!\n\nSo yeah, first date at 27, first girlfriend at 32, wife at 37.  Life will happen at it's own pace; I'd glad I didn't try to rush it and get involved with the wrong person!",
   "created_utc": 1695159281,
   "score": 73,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1cc10p",
   "message": "This comment section is not giving me hope LMFAO",
   "created_utc": 1695165064,
   "score": 69,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bg90u",
   "message": "now im the lonely guy in the college class",
   "created_utc": 1695152457,
   "score": 121,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1cbscr",
   "message": "I joined the navy at seventeen. Married at thirty.retired at fifty five. \n\nIn high school I  could go weeks without a word spoken to me.\n\nFuck my early life all to hell.",
   "created_utc": 1695164958,
   "score": 83,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1cc9k9",
   "message": "he is my husband",
   "created_utc": 1695165165,
   "score": 83,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1btus4",
   "message": "That was me.  I always sat at my own table with the occasional foreign exchange student.  I got out of school and worked really hard.  I just turned 48 and I still haven't peaked.  I have a large portfolio of real estate and do a lot of traveling.  I wanted something more for myself but I didn't really have that confidence until after school.  I now live an incredible life.  There is hope for us losers who aren't afraid of a little work.",
   "created_utc": 1695157199,
   "score": 174,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1cfy4m",
   "message": "Turned out I had autism. Now I'm on Reddit. RIP",
   "created_utc": 1695166772,
   "score": 27,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bn8iu",
   "message": "That guy was me. And im less alone and doing great now 👍👍",
   "created_utc": 1695154864,
   "score": 90,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bhwc8",
   "message": "suicide",
   "created_utc": 1695153031,
   "score": 46,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bvsfk",
   "message": "Busted for CP",
   "created_utc": 1695157924,
   "score": 20,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c8dff",
   "message": "One that I was friends with became a miserable incel,  the other became super successful in IT and lives his best life.",
   "created_utc": 1695163471,
   "score": 20,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1czd0f",
   "message": "I'm a loser that lives with his parents",
   "created_utc": 1695175170,
   "score": 19,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1d1n63",
   "message": "Oddly enough, this thread gave me chills. It made me realize I have had no contact with anyone I went to school with.",
   "created_utc": 1695176172,
   "score": 19,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1db6gk",
   "message": "i started dating him 3 months ago, 9 years after graduating. he’s amazing",
   "created_utc": 1695180697,
   "score": 19,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1dhlhe",
   "message": "The one I knew best, he was a neighbor,  we re-connected in the Myspace days,  went on to work for Microsoft, and ended up being on the design team for the first Xbox.  When everyone migrated to Facebook, he was there for a bit circa 2009, but I guess he tired of it and ceased using it by 2010. In 2016, my dad passed away (My dad was a highschool prinicple and the guys mother taught at my dads school, so I guess he heard of my dads passing from his mom), he appeared out of the blue on messenger one day, and got my cell number from me. He called me one night a few days later and offered his condolences from him and his family to me. He was no longer working at Microsoft, was working for some software firm in Seattle, and was pondering opening a game studio. He was married and had several teenage kids, who I guess would all be mid 20s now. and back off into the ether he went. I have no doubt in my mind he is likely now  the wealthiest person I went to high school with.   \nHe had it bad in school, being somewhat of a nerd. I did too, me being my punk rock/later on goth self(we lived in GA). He and I had things in common during high school  video games(we used to trade copies of C64 games back and forth all the time), sci fi and horror movies, and I even got him into some cool music like Black Flag and the Cure,  so we were always friendly to each other throughout highschool. I always felt so bad for the guy, but he took all the bullying in stride ,and I am  not sure what happened to all the people who bullied both he and I, but I know one (as of about 2010) was on his about 4th DUI, and most of the others still around our home town never amounted to much, peaked in highschool as they say,",
   "created_utc": 1695184207,
   "score": 23,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1dk4lj",
   "message": "After many alleged crimes, meth, coke, ecstasy usage, 2 car wrecks, no jail or prison, or dui, massive amounts of money stolen and then additional $500k debts due to a gambling addiction while also on meth, massive drinking problem since yay and booze go so well together, he finally got his shit together and went back to school, got a degree. \n\nThen he became a teacher. Then got fired after two years. Now he’s unemployed. \n\nBut also married with two kids. \n\nIt’s been a whirlwind life and he’s ready to retire. He is me.",
   "created_utc": 1695185712,
   "score": 19,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bs6zj",
   "message": "That was me! Got my master's and work for a large bank as an analyst. Still single though.",
   "created_utc": 1695156594,
   "score": 40,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bz45x",
   "message": "Hard to really say who was really lonely or not. Plenty of lonely people that forced themselves in the crowd. \n\nAnyways there was a kid his sister was one of the prettiest most popular at school. She was a senior and he was a freshman. He got the principal to let him put on a concert for lunch period for his band. One of the teachers watching lunch shut him down because he was doing “screamo music” about pop tarts. A month later he shot himself in the head. \n\nEveryone plays it off that he was lonely etc. I never believed that and I thought his concert took a lot of self courage. He was hanging out with his friends. It was the bullying because he wanted to be himself and not fit in the norm. His sister stopped going to school and idk what happened to her. It’s sad how cruel we as kids are.",
   "created_utc": 1695159178,
   "score": 74,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bqxxb",
   "message": "I have no idea. He was my friend and I've been looking for him for years because I'm worried.",
   "created_utc": 1695156154,
   "score": 18,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bocc8",
   "message": "I'm doing pretty well, thanks.",
   "created_utc": 1695155246,
   "score": 17,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1drqfo",
   "message": "I’m seeing a sad pattern with the outcomes: \n\n• Becomes a criminal \n\n• Drug addict\n\n• Committing murder or suicide \n\n• Rape/Pedophilia \n\n• Becoming successful. \n\nThe chances are not in most favor 😭☠️. That’s an 80% chance of something bad happening.",
   "created_utc": 1695190702,
   "score": 16,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c9y0s",
   "message": "He was my boyfriend during high school. He had several troubled years during/after college where he spiraled, lashed out, behaved manically. I got the call that he successfully killed himself this past January.",
   "created_utc": 1695164153,
   "score": 34,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bv56p",
   "message": "He’s dating my best friend :) together for \u0026gt;12 years. She brought out the best side of him",
   "created_utc": 1695157684,
   "score": 13,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1ehhej",
   "message": "Married him. Seems to be doing fine. Wants me to empty the dishwasher instead of Reddit dwelling. Rude.",
   "created_utc": 1695209464,
   "score": 13,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1brn10",
   "message": "Still as lonely as I was back then",
   "created_utc": 1695156399,
   "score": 13,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c92se",
   "message": "My older brother was friendly with the class loner. \n\nThey remained friendly past high school, and it turns out the guy was one of the OG developers working for Facebook. Was so weird creeping his FB and seeing real legit comments from Zuckerberg on the guy’s posts.",
   "created_utc": 1695163779,
   "score": 11,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1dwbhg",
   "message": "He was the smartest person I ever met. Very quiet, kept to himself, did 110% on anything he was ever given to do. He always got the best scores. Me and my best friend were the second and third place, but it wasn’t worth chasing first place with him around. We always tried to be his friend, but he wasn’t interested in friends. He was always polite but didn’t seem to want friends. He always accepted me as a friend on social media though, and we were always friendly. \n\nI was 21 when he posted for the first time on Facebook. It was a suicide note. Thank God someone got to him in time. I messaged him afterwards and let him know I understood and he could talk to me. He sent me a long message back, and I understood so much of what he was saying. The constant pressure to be perfect, the trap of trying to please your parents, the spiral downwards when you realise you aren’t a superhuman…I had no idea how much pressure his parents were putting on their kids. His sister almost died from anorexia. \n\nWe talked for a bit, but he eventually stopped responding, and I had moved to a different country. \n\nI hope he’s doing well now, he is an amazing guy. Love ya Scott, if you ever see this.",
   "created_utc": 1695194031,
   "score": 12,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bqg4h",
   "message": "He is now the richest man in the world and got punched in the face by Amber Heard. Pretoria Boys High - true story",
   "created_utc": 1695155979,
   "score": 54,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bduti",
   "message": "bro go trip on psychedelics and thank me later",
   "created_utc": 1695151623,
   "score": 138,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bsv4x",
   "message": "Got cancer very suddenly and died,went to his funeral he was just 16 the youngest in our class,truly a tragedy.",
   "created_utc": 1695156835,
   "score": 27,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1bu71p",
   "message": "Joined the military 🪖🪖🪖 , I wish him all the best by the way.",
   "created_utc": 1695157326,
   "score": 25,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c3jvm",
   "message": "He went to college and his life really changed. He became very popular and has a solid group of friends today. ❤️ actually, he started to do so well on his job, that he left college to work full time (he was computer genius). So yep, today he has an amazing job, has a gf and leads a good life. We keep in touch from time to time and I am insanely proud of him and happy to see that he is happier now.",
   "created_utc": 1695161222,
   "score": 24,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1c86n1",
   "message": "He murdered his family one day. True story. He sat next to me in elective classes like wood shop and metal. Super weird kid who would tell me he hated his sister soo much and had family problems. One day after school he went home and Shot his mom, Stabbed his dad and strangled his sister in the back yard with the phone chord. Look it up. His name was Brandon Menard. This was like 2003.",
   "created_utc": 1695163389,
   "score": 23,
   "submission_id": "16mzx18"
  },
  {
   "comment_id": "k1ecule",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16mzx18"
  }
 ]
}