{
 "submission_id": "16n8jsx",
 "title": "What was the most illegal thing that happened at your school?",
 "selftext": "",
 "created_utc": 1695173883,
 "permalink": "/r/AskReddit/comments/16n8jsx/what_was_the_most_illegal_thing_that_happened_at/",
 "score": 193,
 "url": "https://www.reddit.com/r/AskReddit/comments/16n8jsx/what_was_the_most_illegal_thing_that_happened_at/",
 "comments": [
  {
   "comment_id": "k1d82i1",
   "message": "A kid got beat to death in my school. Locked down for 4 hours. He was life flighted and died a few days later. The kid who killed him ran away from the school but they ended up catching him. He only got 20 yrs probation and is now a successful real estate agent and everyone kind of forgot about it.",
   "created_utc": 1695179154,
   "score": 144,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d9ug5",
   "message": "Dude robbed a Liquor Store and stashed it all in lockers. A kid took a crow bar to each locker and stole all the booze. Also, someone hit someone in the head with a bat but what can you do 🤷🏼‍♂️",
   "created_utc": 1695180028,
   "score": 54,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dbwc2",
   "message": "In high school, the Principal (who lived right across the street from me) got accused of SA against a student who was his adopted son living with him. The kid had behavioral issues so a lot of people didn’t believe the student, and the principal was allowed to keep his job. During the next school year, a student wore a wire into his office, and got the principal on recording.",
   "created_utc": 1695181062,
   "score": 123,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d8qt3",
   "message": "Teacher sucked off a student in her office and then got deported for it",
   "created_utc": 1695179482,
   "score": 199,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d3y0w",
   "message": "Teacher got accused of grooming and sexual assault. The allegation brought to light that two other teachers throughout the school's history had also sexually abused students. Two of the three teachers are dead now and the other is in jail.",
   "created_utc": 1695177210,
   "score": 11,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d2tok",
   "message": "Kids smoked pot on the school bus. The school bus driver drove to the police station rather than the school and turned the kids in.",
   "created_utc": 1695176698,
   "score": 51,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dc7xx",
   "message": "A guy and a girl, both in ninth grade from what I can remember, decided to throw down and have sex with  each other in a classroom in front of the entirety of the class while the teacher was out of the room. It was chaos. People yelling, some encouraging them, others objecting. The teacher came back and some of the students actively held the door to prevent her from interrupting. The cops got involved. It was all over the news and the school shut down for like 3 days.",
   "created_utc": 1695181230,
   "score": 24,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d3sv6",
   "message": "Principal invited the cheerleaders to a pool party at his house and set up a camera in the bathroom where he told them to change.",
   "created_utc": 1695177144,
   "score": 72,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dhncp",
   "message": "Probably that time I brought uranium into class.\n\nMy physics teacher was sceptical until he checked it with a Geiger Counter. I was promptly sent sent home with it and told never to bring it into school again. It's lucky he didn't freak out too badly, evacuate the school, as some teachers do e.g.\n\nhttps://www.theguardian.com/australia-news/2022/aug/23/radioactive-rock-at-randwick-girls-high-no-cause-for-alarm-nsw-inquiry-told\n\nI still have it (I made a little box for it):\n\nhttps://imgur.com/a/XXztcOn",
   "created_utc": 1695184237,
   "score": 82,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d2bjv",
   "message": "Both the school nurse and later the school counselor were pedophiles. Nurse would take advantage of students going to him in Elementary School. School counselor who was also a dude, had a thing for black high-school boys in particular. Also was the head football coach on the side. Didn't find out about either until a couple years after I graduated. Nurse got caught, and counselor/coach got narced on by his wife who divorced him.",
   "created_utc": 1695176473,
   "score": 254,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d0acj",
   "message": "This chick beat this other chick so hard that she needed facial reconstruction surgery, and then punched out campus police. They tried to tase her, but she kept punching through it.\n\nEdit: this happened in HS",
   "created_utc": 1695175572,
   "score": 208,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d2s9w",
   "message": "Besides multiple teachers and admin being arrested for banging students? We had a dude passing counterfeit money. So much so the secret service showed up. And i was hauled off to a windowless building to explain why i had a fake 20",
   "created_utc": 1695176680,
   "score": 125,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d976j",
   "message": "Kid (not a student) snuck on campus, pulled a gun and tried to shoot a student. Security saw him literally trying to execute the kid, managed to intervene before he fired and beat the everliving fuck out of him.",
   "created_utc": 1695179708,
   "score": 95,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d6msf",
   "message": "Ah after my time since I wasn't really connected to the bullshit but some dumbass tried to sell prescription narcotics at school and got caught with the cameras.\n\nThat dumbass was my younger brother's friend and the narcotics he was selling belonged to my dad who had recently died from skin cancer.",
   "created_utc": 1695178465,
   "score": 24,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d18il",
   "message": "I went to a private school, and right before my senior year started it was discovered that one of the top administrators had been stealing hundreds of thousands of dollars from the school. He was arrested, and we had a new set of principles or whatever the title was on the first day of school.",
   "created_utc": 1695175992,
   "score": 177,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d6vxg",
   "message": "Several guys bought enough cocaine to turn $100k or so into millions. They didn't account for the DoD server the school was on (military school), and apparently key words flag somewhere. The FBI, DEA and other 3LA's showed up one day",
   "created_utc": 1695178584,
   "score": 204,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d546v",
   "message": "In middle school, a classmate of mine stole his grandparents car, picked up his gf, and tried to drive from the SF Bay Area to Colorado to see the X Games. They made it all the way to Colorado too.\n\nFunny thing is that the X-Games were on a tape delay so even though they were on tv, they had happened a couple weeks before he tried to drive to Colorado.",
   "created_utc": 1695177753,
   "score": 84,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cx3jd",
   "message": "A music teacher joined who had been on britains got talent, everyone loved him. Turned out he tried to SA multiple girls and was fired within a week of joining.",
   "created_utc": 1695174185,
   "score": 100,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1czay7",
   "message": "it was 1971. a girl i knew whose boyfriend dealt drugs brought a bunch of really strong LSD to school to sell. for the rest of the day we freaks would see each other walking down the hall tripping balls and laugh ourselves silly…there must have been 20 of us. one of the cheerleaders got some and ran away from home. the principal grilled her but couldn’t prove anything. and then there was the band teacher who ran off with one of his students mid-semester.",
   "created_utc": 1695175144,
   "score": 245,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dcfoe",
   "message": "Catholic high school...a priest on the faculty got a girl pregnant then paid for an abortion. The Bishop paid off the girl's family to keep it quiet.  The Pennsylvania grand jury exposed it twenty years later.",
   "created_utc": 1695181343,
   "score": 201,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dba6l",
   "message": "The computer teacher for 8th grade was busted handing out, 'A's,' for handies. All genders welcome.\n\nI shit you not, his name was Mr. Palmer.",
   "created_utc": 1695180749,
   "score": 237,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cy1me",
   "message": "One of the coaches would make passes at lots of girls and he would smoke weed with kids in the locker rooms. He kept a metal bowl poking out the top of his sock, we could literally all see it all the time. He was the coach for a long ass time too.",
   "created_utc": 1695174601,
   "score": 136,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1daalf",
   "message": "School got a threatening letter from a movie studio because students where passing around a pirated copy of The Blind Side on school issued computers. School wiped every computer and threatened any student caught \"in the act of piracy\" with expulsion.",
   "created_utc": 1695180249,
   "score": 33,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cwg09",
   "message": "There was a major drug bust where multiple students were caught selling and using drugs on school premises.",
   "created_utc": 1695173897,
   "score": 1,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dfjyj",
   "message": "A girl broke the geneva convention she mixed ammonia and bleach and brought it to school to fight 2 other girls over a stupid boy.",
   "created_utc": 1695183036,
   "score": 139,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dacpm",
   "message": "I’m sure there were worse things that I don’t remember, but a friend of mine ran a business out of his locker selling movies pirated from IRC chat rooms. I’m pretty sure he got a cease and desist from the MPAA.",
   "created_utc": 1695180279,
   "score": 183,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d49kz",
   "message": "Bomb threats. Lots and lots of bomb threats. Like, seriously we had days that we evacuated for 3-4 bomb threats in a single day.",
   "created_utc": 1695177358,
   "score": 97,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d110b",
   "message": "Two students murdered twelve students and a teacher.  It happened in '99, I went there in '03.",
   "created_utc": 1695175900,
   "score": 34,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d1ydx",
   "message": "He was either a junior or senior, but he'll always be remembered as The Sheep Fucker for a reason.",
   "created_utc": 1695176311,
   "score": 255,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d7i0h",
   "message": "Well… an armed robbery plan that ended with a murder. And it was carried out by the most accomplished athletes at our school at the time. \n\nMid 1990s.\n\n\nThe Varsity Captain, Varsity Co-captain and the Junior Varsity Captain robbed the pizza place next to my after-school job and murdered someone I knew that worked there. One of them worked there, and they planned to stage a fake robbery; the other two being the robbers and “forcing” him to open the safe and registers. An off-work employee stopped by randomly while this was happening and one of the “robbers” shot him \u0026gt;!in front of his 2 year old son!\u0026lt; with the very real gun.\n\nThe shooter was in my psychology class, and in my desk pod (the classroom was arranged in groups of 4 desks pushed together). Let’s call him S. All week our teacher would make sure we were all doing okay— this happened in the strip mall closest to our high school so dozens of juniors and seniors worked in the varying businesses there. S would make these comments like “damn, I hope they get him” and “that’s scary, so close to home….” One day, maybe that same week even, the police came to the school and I’ll never forget how I felt in this moment — S was called to the office during our class and he just stood up, gathered his backpack and book, smiled at us all, and said something like “well, that’s that,” or “about time” and “it’s been good, y’all” something that hinted at admission.\n\nPretty sure I remember they canceled a bunch of games; the joke in town was “Oooh don’t play ______ High, they have a killer football team!”\n\nThe trial was a whole debacle because there were other students - other football players - peripherally involved… like how they got the gun from another varsity football player (not present during the shooting) who worked at a sporting goods store and had stolen it from their boss. All three were found guilty — mainly because they used a school logo football bag during the robbery and then dumped the empty bag in the park between the school and the strip mall — and got varying sentences. I think S was tried as an adult and might still be in prison.\n\nIf this story sounds familiar to you, *go Cougars* amirite\n\nEdit to update: just looked him up on socmed — ***OMG he’s out***",
   "created_utc": 1695178876,
   "score": 132,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d9wf8",
   "message": "It's so hard to pick just one. \n\nWe had the gender neutral bathrooms becoming a brothel, a math teacher dating a junior, the vice principal sleeping with multiple students, a crackhead social studies teacher who punched his boss in the face during a class, and one of the women at the main office get busted as a cocaine dealer.",
   "created_utc": 1695180055,
   "score": 240,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d71wf",
   "message": "Lots of drugs just most people didn't get caught. There was a girl in my English class I think my sophomore year who called in 2 bomb threats. She wanted to get out if a test. It was January we had to sit on the football bleachers for 2 hours before they moved us into the neighboring middle schools gym, auditorium, and cafeteria. One of my friends brought her instrument with her cause we were in band when they called everyone out of the school. A random teacher tried to take it. That shit cost like 4 grand. Good times I remember sitting next to my best friend who's dad was a captain on the police force. They were texting and they had cleared the school twice already but the person in charge wanted them to do two more sweeps before they let everyone back in. One kid also hopped in his car at that time got in an accident and fled the scene to come back to the school trying to act like he didn't do anything. I do remember seeing the girl who called in the threats get walked out of the school by the police. They tried to not make a big scene but kind of hard when you take her out the front doors.",
   "created_utc": 1695178663,
   "score": 60,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d2sd5",
   "message": "A student pulled a knife on another student in the cafeteria.",
   "created_utc": 1695176681,
   "score": 179,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d8n1i",
   "message": "School cop was selling us drugs.",
   "created_utc": 1695179431,
   "score": 23,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dofkw",
   "message": "A 22 year old posed as a 16 year old refugee from Haiti and enrolled in school, dunked on kids in basketball games, and had physical relations with underage girls.",
   "created_utc": 1695188470,
   "score": 139,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d44t6",
   "message": "Female math teacher was also the track and field coach.  Got caught diddling female student.  Training together for shot put.  Got arrested right in the middle of algebra class",
   "created_utc": 1695177297,
   "score": 14,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d895i",
   "message": "Some students tried to rob a bank across the street by chaining their truck to the ATM before school and driving away with it",
   "created_utc": 1695179244,
   "score": 221,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dbalr",
   "message": "When I was in elementary in the 90s as we were coming in from recess the boy standing next to me was shot by a stray bullet. Some kid was shooting birds in his back yard and the bullet hit my friend. If the boys and girls line was reversed it would of been me. And I was like 2 inches shorter than him. It hit him in the chest , luckily didn't hit his heart. He lived but it traumatized me.",
   "created_utc": 1695180755,
   "score": 186,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d4qrp",
   "message": "There are way too many pedos that become school gym teachers",
   "created_utc": 1695177579,
   "score": 249,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dapf3",
   "message": "One of the teachers at my high school was arrested for doing drugs in between classes.",
   "created_utc": 1695180456,
   "score": 93,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cwlhs",
   "message": "Some of the haircuts.",
   "created_utc": 1695173965,
   "score": 233,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d1iqs",
   "message": "We smoked a lot of weed in the restrooms. Also couple HS students and teachers hooked up at different times. But maybe the biggest thing was the Admin to the Superintendent was embezzling a lot of money over the course of about 5 years.",
   "created_utc": 1695176117,
   "score": 167,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cyf23",
   "message": "Security guard flirted with young female students. He even gotten fired for trying to sleep with one of them and gotten caught.",
   "created_utc": 1695174762,
   "score": 103,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d50ut",
   "message": "A dude robbed the McDonald’s down the street with a gun while wearing our uniform.\n\nEdit: Added “while”",
   "created_utc": 1695177710,
   "score": 89,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dhvy4",
   "message": "Went to high school from 87-91. Here is a list. Take your pick:\n- kids doing cocaine off their desks in drug education / health class\n- I personally dropped acid at least once a week in 7th period so that I would peak on my walk home an hour later. Day depended on the amount of parental supervision I had when I got home.  80’s = very little\n- I sold drugs. I feel like everyone sold drugs. Those that didn’t sell drugs bought drugs. Mostly weed, shrooms, coke, and acid\n- a teacher and a student got into a fist fight. Basically assault by the teacher, but teacher could have also claimed self defense. It was kind of crazy. \n- kid brought a gun to school. Rather than turning them in, we thought it was cool\n- kids would drink whiskey before first period. Not just a sip, kids would show up drunk\n- my high school had one of the worst drug problems in the state so I feel like everything was drug related. \n- the occasional student car would get stolen \n- what was casual groping in the 80’s is actually sexual assault. \n- rumors of teachers and students hooking up. \n- oh, not actually in the school, but a few parents were busted for insider trading in 1987 / black Monday \n- lots of kids beating the shit out of other kids was just brushed off as bullying and now would be assault\n- lots of kids under 18 dated people in their 20’s. That was fucked up. \n\nRural PA was weird in the 80’s.",
   "created_utc": 1695184377,
   "score": 156,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d7hb9",
   "message": "School (Woodland Hills HS) was known for using excessive force with children. One instance, the principal slammed a kid to the ground and busted his front teeth. He was still the principal after that and he may of even gotten off with no charges.",
   "created_utc": 1695178866,
   "score": 140,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d7wjw",
   "message": "A kid that felt like we got no respect shot and killed a senior from our football team. I remembered the murdered kid as just quiet in the math class we were in. \n\nMurdering fool got out of prison for the school murder only to murder again.",
   "created_utc": 1695179075,
   "score": 137,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dapsk",
   "message": "School guidance counselor cheated on his wife (an English teacher) with a 17 year old and got her pregnant.  Christian school, girl kept the baby because it was God's will.  The  counselor and teacher got a divorce, but they still both worked there, I was a freshman in high school and couldn't understand why he didn't go to prison.",
   "created_utc": 1695180461,
   "score": 132,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d3hj3",
   "message": "Trading Pokémon cards during class",
   "created_utc": 1695177002,
   "score": 76,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cz6dq",
   "message": "Teenagers smoking too close to the high school exits. There was even a health ministry RAID with written warnings and small fines. One teenager even blew smoke in the face of a teacher!!",
   "created_utc": 1695175090,
   "score": 19,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d3wuf",
   "message": "I dont live in the US\n\na Student bought a gun to school with the intent of filming a Youtube Video showing off his way of \"Dealing with bullies and teachers you dont like\"\n\nluckly, the kid was caught and arrested. Scary as shit as I was litterly just down the hall from the classroom he was filming in",
   "created_utc": 1695177194,
   "score": 6,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d2s95",
   "message": "Teacher was banging a 8th grade boy. They ended up getting married after he graduated. Her apartment was right down the street from my house and his red corvette was there every day. It was a running joke for years back then, but I never saw the humor.",
   "created_utc": 1695176679,
   "score": 4,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dalhm",
   "message": "Someone threw a molotov cocktail into the office thinking they could erase their report card grades.  Grades weren't even stored on hard copies anymore.  It was already in the computer with offsite backups.",
   "created_utc": 1695180401,
   "score": 163,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d91n7",
   "message": "During a lockdown because of someone with a knife, one class went out for a smoke break. Their argument was that they had more knives than whoever was out there.",
   "created_utc": 1695179632,
   "score": 58,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1da543",
   "message": "Video went around of a girl getting fingered during lunch, before anyone says anything, no there is no actual parts shown\n\nKid got beat up because he told another kid that was insulting him that he would send a video of him jerking it to the other guy’s 12 year old sister\n\nGirl got sent to reform school for having a shit ton of weed in her locker, funniest part? She sold the weed from that locker and because of that, it stunk up the hallway",
   "created_utc": 1695180173,
   "score": 56,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d1ufz",
   "message": "I'm not sure, but I was stabbed, and the school did nothing about it. I bet something worse happened if that was okay. \n\nTo be clear, it was not with a knife it was with a pencil that was widdled really sharp with a knife at home, and I still have the scar from it 10 years later.",
   "created_utc": 1695176262,
   "score": 3,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cz6e1",
   "message": "One kid stabbed another several times the other kid lived. He was charged with attempted murder and was in jail for a very long time.",
   "created_utc": 1695175090,
   "score": 89,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1cz22i",
   "message": "A stabbing",
   "created_utc": 1695175038,
   "score": 88,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dd08p",
   "message": "My Spanish teacher in high school got caught having sex with a student. She was a nice woman but she was going through some sort of domestic abuse at the time and was open about it during class. The student was out of school for a while but when he finally came back, a bunch of people paraded him through the Spanish hall and they were all chanting “FREE MRS. GARCIA”.",
   "created_utc": 1695181644,
   "score": 107,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d1q5y",
   "message": "Probably the time I stole the excuse to leave early permission slip tablet from the principal's office. We forged his initials and left early every single day the last month of school. Or maybe the time me and a couple of friends stole a big electrical sign from a local restaurant that said \"Crabs Steamed to Go.\" We took it into a BB game at half time. The team we were playing were \"The Crabbers.\" It was in our gym and we got a huge cheer when we brought it in. We lost the game though.",
   "created_utc": 1695176209,
   "score": 250,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d32y5",
   "message": "a couple of murders\n\nwe were also thisclose to having a riot that could have been even worse, but thankfully nothing major happened",
   "created_utc": 1695176817,
   "score": 35,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d5bzh",
   "message": "Couple of stabbings, allegedly a science teacher had sex with a student",
   "created_utc": 1695177852,
   "score": 40,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1da52r",
   "message": "I had a high school coach get caught twice participating in a prostitution ring. I don't remember if he was fired or if he was already retired the first time.",
   "created_utc": 1695180173,
   "score": 38,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dadtj",
   "message": "Music teacher molested a bunch of kids by pretending he saw talent in them and then offering private lessons. He was caught and then fled the country. Happened longgg before I was at the school thankfully.",
   "created_utc": 1695180295,
   "score": 36,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1daeim",
   "message": "Turned out one of our female drama teachers *really* liked some of her male students.",
   "created_utc": 1695180305,
   "score": 35,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1dl9m3",
   "message": "Police searched a student's car in the school parking lot and found his girlfriend's body in the trunk.  \n\nIf that doesn't count because the murder happened off of school grounds it was a whole ring of people doing tattoos and piercings that ended up getting infected.",
   "created_utc": 1695186418,
   "score": 40,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1d3j0e",
   "message": "Some students murdered an undercover cop. Yes that was definitely the most illegal thing I recall. There is a book called “Innocence Lost”.",
   "created_utc": 1695177021,
   "score": 136,
   "submission_id": "16n8jsx"
  },
  {
   "comment_id": "k1fl2z7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16n8jsx"
  }
 ]
}