{
 "submission_id": "16nfirv",
 "title": "What is something you accidentally stumbled across online that scared you for life?",
 "selftext": "",
 "created_utc": 1695197042,
 "permalink": "/r/AskReddit/comments/16nfirv/what_is_something_you_accidentally_stumbled/",
 "score": 234,
 "url": "https://www.reddit.com/r/AskReddit/comments/16nfirv/what_is_something_you_accidentally_stumbled/",
 "comments": [
  {
   "comment_id": "k1f9wp6",
   "message": "That guy that got turned into red mush by a lathe machine. Especially since I work with these machines. And funky town.",
   "created_utc": 1695221735,
   "score": 117,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f1dg8",
   "message": "A video of some kid doing a running jump from some railings into the sea. Unfortunately, he slips on the railings and fails to clear a concrete jetty below, and appears to hit the corner edge face first. The video then cuts from his body floating face down in the water, to footage from the hospital where doctors are trying to hold his face together whilst he’s still alive. I’ve never forgotten it.",
   "created_utc": 1695218511,
   "score": 171,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ekku8",
   "message": "Those teens who murdred a man in Ukraine and filmed it--like just slowly stabbing away at him and laughing about it.",
   "created_utc": 1695211089,
   "score": 192,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1et13a",
   "message": " A copypasta about the effects of rabies",
   "created_utc": 1695215050,
   "score": 29,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1felhx",
   "message": "Everyone else’s comments are about gore, murder, suicide so mine might sound a bit dumb. But I somehow stumbled across this page on Reddit one day, had no idea what it was. So I started scrolling and it was people posting pictures of their prolapsed assholes, and being proud of it? Like the more prolapsed the better? I don’t know but it grossed me the fuck out and it still haunts me to this day.",
   "created_utc": 1695223455,
   "score": 6,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f3bfy",
   "message": "I can't remember how I found it but I came across a Bug Chaser forum. They were discussing how to best transmit STDs and have parties where one they would try to contract HIV. I couldn't quit reading it for most of the night I found it, I just kept reading it hoping it was fake. It fucked my world up for awhile.",
   "created_utc": 1695219275,
   "score": 6,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f0kqy",
   "message": "I knew I should've stayed away from this - but no. Now I need  decontamination.",
   "created_utc": 1695218196,
   "score": 157,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f1sqf",
   "message": "I've seen the gore videos, which are disturbing of course, but the one video that got to me was a baby (around 8-12 months) laying on the bed, crying, and the young mom was taking a pillow and hitting him with it out of rage. The baby kept crying and reaching out to his mom for help/comfort while he was being hit by her. Just thinking about it makes me so sad and tear up, and I don't really cry over much.",
   "created_utc": 1695218681,
   "score": 254,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f8nyq",
   "message": "the scream in the brick video still gives me nightmares",
   "created_utc": 1695221278,
   "score": 239,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f421t",
   "message": "Pictures of the Congo under Belgian rule..\n\nA dad sat on the floor with a small hand and foot on the ground in front of him.",
   "created_utc": 1695219561,
   "score": 150,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1e2wjf",
   "message": "Cartel torture and death. Especially when they chop the head off with a dull knife. It’s insane how much torture and murder come from those garbage animals.",
   "created_utc": 1695199177,
   "score": 243,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ff22v",
   "message": "The one of the two people arguing with their neighbor. He comes back out and proceeds to shoot both of them multiple times. The security footage has audio and it’s absolutely terrifying",
   "created_utc": 1695223621,
   "score": 205,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f36cy",
   "message": "Everytime I see a mason jar I think of him.",
   "created_utc": 1695219220,
   "score": 208,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1e0tt5",
   "message": "The gore subreddits",
   "created_utc": 1695197532,
   "score": 188,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f3gak",
   "message": "During the early days of the Ukraine invasion, I saw a video of a father and son in their car get hit by bullets. The father ends up laying on his back in the road, trying to get up but he can't, while his son calls to him. Both of them were killed. But the desperation and fear in his voice still haunts me.",
   "created_utc": 1695219326,
   "score": 6,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f0x4w",
   "message": "the brick video, you know which one",
   "created_utc": 1695218333,
   "score": 149,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fhwxj",
   "message": "When I was maybe 9, I stumbled on a video of a woman in heels slowly stomping a kitten to death. I will never get the image of her sticking her stiletto into its eye ball out of my head.\n\nI have since dedicated my life to fixing animals, and I foster several litters of kittens every year. Makes me feel a bit better about it.",
   "created_utc": 1695224643,
   "score": 153,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ffnue",
   "message": "I don’t watch these type of videos. \n\n“Proceeds to read every comment in the thread and is still traumatized”\n\nAre you guys ok? Fuck.",
   "created_utc": 1695223837,
   "score": 8,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1euaci",
   "message": "Uncle's house after he passed away and wasn't discovered for at least 6 weeks.  \n\nWe didn't really know what to expect when we walked into the house.  Thankfully his body (or what was left of it) had been removed by that point, but a very visible outline where he passed still remained on the carpet.  The smell is something I will never forget.  \n\nAt some point in those 6 weeks, the house was broken into and ransacked, my uncles pickup truck stolen out of the garage.  I truly wish the worst for whoever is responsible.\n\nEdit: woops.  Missed the part that said \"online\"",
   "created_utc": 1695215599,
   "score": 140,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1e72b9",
   "message": "I was messing around on my FB page getting into all sorts of pages and I came across this nasty page I didn’t see anything so I just forgot about days later this video came up I think it was somewhere in Africa this lady with her baby tied to her back was smiling and dancing she made some turns and she was all happy next thing I know she turns her back to the camera and you see her baby smiling and happy.. I heard a firing squad thru shot her and her baby killing them both",
   "created_utc": 1695202472,
   "score": 127,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1eu9rh",
   "message": "Honestly, how almost everything seems to give you cancer.",
   "created_utc": 1695215592,
   "score": 167,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1eqacb",
   "message": "From the 90s.....rotten.com",
   "created_utc": 1695213819,
   "score": 203,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fhtt1",
   "message": "Not scared, but scarred for life when I stumbled across child pornography images 20 years ago when working for a web hosting company. A client submitted a support request because the site was just showing an error message. They had some script they were running on their site exploited and their website was being used to share the content without them knowing.\n\nYou think you know how bad child pornography is, but when you see some it's worse than you could ever imagine. You don't know who these people are, you don't know how long ago it was, you don't know if it ever stopped, and you don't know if there was ever justice and punishment, and you don't know if the people are even still alive.",
   "created_utc": 1695224613,
   "score": 39,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f3mv0",
   "message": "Pro-anorexia communities. Just watching people actively supporting each other’s starvation was awful and their extreme hostility towards people who were reaching out to help them was heartbreaking.",
   "created_utc": 1695219398,
   "score": 90,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ewy3u",
   "message": "Was scrolling through Facebook while my boyfriend at the time was on the other side of the room playing games, and I came across a video that had the content hidden.\n\nTo this day I still don’t know why or how this video ended up on my Facebook feed, it was from a page I wasn’t following, but me being the curious little shit I am decided I wanted to see why the content of said video was hidden.\n\nA woman had tethered her two German Shepherd dogs up to a wall (I have a German Shepherd who I absolutely adore), proceeded to get in her car, and slowly run them over.\n\nThe yelps and squeals and cries of those poor dogs still haunts me. I immediately clicked off the video and burst into tears. My boyfriend came over and was confused, I explained what I’d just seen and he comforted me for the entire day, bless him.\n\nI still get images of it pop into my head now and then, and I literally have to get up and do something else to distract me. It was horrific. It makes my blood boil that anyone would do such a thing, let alone record it and post it online.\n\nI don’t let my curiosity get the best of me these days now. :/",
   "created_utc": 1695216714,
   "score": 82,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ey9m2",
   "message": "Runthegauntlet.com",
   "created_utc": 1695217265,
   "score": 81,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fbp4i",
   "message": "I was there before internet had any kind of filter.\nVideos about mutilation, murder, etc were all over the place.\nI will always remember a video where a guy had his testicles nailed to a table. His screams were really haunting.",
   "created_utc": 1695222397,
   "score": 82,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f4c0k",
   "message": "[rotten.com](https://rotten.com) in the late 1990s",
   "created_utc": 1695219665,
   "score": 70,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fog1h",
   "message": "This case (link below because I'm on mobile). Nehemiah Flores. He was four.  Full disclosure, I wrote this news story. I sat in court for days covering the trial and the photos were absolutely horrifying. He was basically abused to death over the course of several months. It was the only time in my career I've ever had to leave a courtroom to cry. I kept a lot of really gory details out of the story, and it's still just... really hard to read. The pictures were just ... it was terrible. \n\nIt's not \"accidental\" exactly, I guess but i definitely wasn't expecting how awful it was.\n\nhttps://www.jacksonconews.com/news/two-sentenced-life-prison-capital-murder-four-year-old",
   "created_utc": 1695226950,
   "score": 139,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fa2eg",
   "message": "Y’all look up some fucked up shit online.",
   "created_utc": 1695221793,
   "score": 248,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f2ga4",
   "message": "After watching “Don’t Fuck With Cats” I stupidly researched it online. Man, that documentary doesn’t sound like it will end with a hotel beheading and corpse sex. That video was just… I dunno",
   "created_utc": 1695218937,
   "score": 153,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1e1grt",
   "message": "Prions. \n\nI wish I had never learned of their existence.",
   "created_utc": 1695198036,
   "score": 142,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ex5me",
   "message": "Footage from the Yulin festival in China. It's been years since I saw it, but images still pop up in my head from time to time and it's devastating.",
   "created_utc": 1695216803,
   "score": 79,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f0nc1",
   "message": "I went looking for amateur footage of 9/11 the other day.  Don't do that.",
   "created_utc": 1695218224,
   "score": 96,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fb6lc",
   "message": "That video of the woman in the passenger seat being killed by a brick that fell from the lorry in front of them on the highway.\n\nNow I literally make it a point to never stay behind a lorry one second more than I have to.",
   "created_utc": 1695222207,
   "score": 92,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ekpbq",
   "message": "2girls1cup. It will forever be engrained in my mind for eternity.",
   "created_utc": 1695211152,
   "score": 245,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f617j",
   "message": "Saw a woman that had some kind of bug larvae in both breasts. There were tons of holes and you could see the larvae looking out of the holes 🤮. I have trypophobia!  It was horrible!  I saw this picture about 15 years and have never forgotten it! 🤮",
   "created_utc": 1695220302,
   "score": 90,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1euafj",
   "message": "When I was a lot younger.. rotten.com, then It was early days /b/ on 4chan. Some of the stuff they turned up was pretty traumatic for a kid.",
   "created_utc": 1695215600,
   "score": 42,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f724r",
   "message": "Saw one of the sicario using two pit bulls to eat man’s penis and legs off, apparently guy was a pedo but still fucked me up",
   "created_utc": 1695220681,
   "score": 56,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f6xma",
   "message": "The Russian Sleep Experiment Creepypasta, the thunbnail image of that haunted me for years until I realized it was an edit of a shitty halloween decoration.",
   "created_utc": 1695220635,
   "score": 131,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f8lef",
   "message": "I won't call it an accident, when I was 11yrs old, I used to watch horror films like it was nothing, and my stupid arrogant mind told me to search for something more cruel, I googled the most cruel torturing method, found it lame, I kept searching until I found a women torturing her child ( a 4yrs old), I was traumatized to know such people exist. It's funny how I thought torturing in general was something lame that needs creativity, I used to be a scary child for my grown self.",
   "created_utc": 1695221252,
   "score": 100,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1eg3e3",
   "message": "My ex's porn. \n\nShe was real abusive tbh, once made me masturbate on cam or else she'd hang herself. It hurt seeing her like that again, kinda scared me a bit.\n\nI take some solace in knowing her career was as unsuccessful as I could have hoped.",
   "created_utc": 1695208690,
   "score": 213,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1edfn8",
   "message": "My little pony jar",
   "created_utc": 1695207058,
   "score": 228,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ewy7x",
   "message": "That someone put cat in the blender and turn the blender on.",
   "created_utc": 1695216715,
   "score": 113,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f7gmj",
   "message": "Some cartel video where a guy was punished by having his heart cut out. I went on a gore trip and that one ended the adventure. Another one where a argument happened at a mall and the guy got sliced with a knife in just the right way where it hit his jugular. Dude didn’t know how bad he was cut until a few seconds and ll the blood was flowing then he collapsed and probably died.",
   "created_utc": 1695220831,
   "score": 42,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f8fo9",
   "message": "1. I was bored-scrolling Facebook and came across a live of a man in a car drive up and, without any context, shoot an older man in the face. The shooter was the one filming. I didn't have much faith in humanity before that, but, jfc.\n\n2. I had seen some of the Luke Magnotta videos. I figured they were faked for shock value, and time went on. I didn't realize until I saw the Don't Fuck With Cats documentary on Netflix that what he did was real. I threw up and felt so sick and dirty. What a monster.",
   "created_utc": 1695221193,
   "score": 25,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fcx7f",
   "message": "A video of a grown man raping a little girl. About 1 or 2 years old. My own son was 1,5 years old at the time. \n\nThe sound of her crying and screaming is still stuck with me.",
   "created_utc": 1695222847,
   "score": 25,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1eipyj",
   "message": "I've seen a lot of stuff online back in the day but only one thing really ever stuck with me, was about 25 years ago and I was probably around 14. There was a dog laying on the ground, wagging it's tail and suddenly without warning, it's lower jaw was blown off by a shotgun. The video was longer, but I recoiled and shut it off immediately. I've seen beheadings, suicides, and people being blown apart and it never bothered me. That video has always stuck with me and I wince every time I think about it.",
   "created_utc": 1695210137,
   "score": 213,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fobbc",
   "message": "This was on my Twittwr feed and I have no clue why it appeared there, and why the person I was following at the time retweeted it.\n\nIt was CP. And it was a video of a very young girl, and I'll leave it at that. The minute I realized what was going on, I reported that post, reported the person who retweeted it and the original poster, and unfollowed that same person who retweeted it. \n\nThe video was being portrayed as a *joke*, but the contents of what were starting to take place were absolutely NO joke at all. I just felt really bad after witnessing that video and it still makes me sad when I think about it.",
   "created_utc": 1695226905,
   "score": 76,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1est5b",
   "message": "The entirety of the NSFL subreddit. Can't remember how I found it but I guess horny me miss clicked some years ago. Definitely put a scar in my head.",
   "created_utc": 1695214952,
   "score": 56,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1euikl",
   "message": "That cartel video where they kill this kids dad in front of him, also some of those old chinese live leak videos. Still though 2 girls one cup is the worst.",
   "created_utc": 1695215696,
   "score": 67,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1exnzy",
   "message": "There was a parody \"Wikipedia\" site when I was in high school. They had a page for \"offended\" and that page messed me up for the rest of my life.",
   "created_utc": 1695217019,
   "score": 26,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fa585",
   "message": "Like 20 years ago I was pretty young…my uncle was friends with a guy who was an army ranger sniper. He had a video of head shotting a guy in the Middle East during the war following 9/11. They were up in some mountains, the sniper was using a .50 cal, and you just see this guy’s head utterly explode. \n\nIt didn’t really scare me for life but I always remember how scarring that imagery was. \n\nThat and seeing the decapitation during the same time period. I no longer click on such videos.",
   "created_utc": 1695221822,
   "score": 35,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fozsv",
   "message": "Pictures of hollowed out torso in Dahmers sink. Sorry to be so graphic, but you asked",
   "created_utc": 1695227144,
   "score": 21,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1e0gn7",
   "message": "Pictures of the Black Dahlia murder. So graphic.",
   "created_utc": 1695197244,
   "score": 65,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1flt8f",
   "message": "How easy it is to get someone's personal information. Especially minors. I was banned from an app for notifying the admin about it.",
   "created_utc": 1695226019,
   "score": 22,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1ev5zn",
   "message": "Travis Alexander’s Autopsy",
   "created_utc": 1695215974,
   "score": 39,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fox3r",
   "message": "This whole thread has great potential to scar or scare you for life. Peace out, homies!",
   "created_utc": 1695227118,
   "score": 27,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1e55kj",
   "message": "PETA videos. Unconscionable, gratuitous amounts of horridness done to animals. I’m not a vegan, but fuck is wrong with all those factory farms that put animals through countless iterations of hell for days before processing them for human consumption.",
   "created_utc": 1695200977,
   "score": 172,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1er984",
   "message": "Fish scale skin grafts. I have bad trypophobia. I’ve told my kids don’t ever let anyone give me one or I could see myself literally ripping them off my body.",
   "created_utc": 1695214258,
   "score": 92,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f50br",
   "message": "I was a 13 year old boy on Omegle quite a while back, me being an absolute baboon put “Boys” as my tag. Well, I met someone. They told me to open a link they sent and tell them what I think. It was the most disturbing shit ever. Dads doing things to their literal babies. Like fresh out the womb. I still won’t go to Omegle for that reason.",
   "created_utc": 1695219917,
   "score": 16,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f5zxh",
   "message": "I accidentally watched a woman hit a baby for crying over and over on facebook years back. I havent been right since… my eyes fill up with tears when i look at my daughter sometimes cause i could never imagine hurting an innocent human being like that.",
   "created_utc": 1695220289,
   "score": 15,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1gggo0",
   "message": "I don't know why I'm knowingly ruining my day by reading this thread",
   "created_utc": 1695236665,
   "score": 55,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1f3i85",
   "message": "Worst thing i saw were cartel videos \n\na video of someone getting his face skinned hes also pumped full of drugs so he will stay conscious and feel every bit of pain.(victim isnt recognised, noone knows is he innocent or cartel member but nobody deserves that pain)   \n\n\nAnother video is where they burn mans face alive, from \"disturbing reality\" i heard that he was tortured for like 2 days before finally they burn his face. (victim was another cartel boss)  \n\n\nVideo where they dismember some dude and he screams \"NO MORE\" everytime   \nTheres also video where cartel skins someone(once again) and dude says nothing, not a single sound and only says \"dont step on me dude\" with a calm tone.  \nTheres alot of fucked up things in the internet, i wonder, does anything worse than cartel videos exist in the internet? People are scarier than monsters",
   "created_utc": 1695219348,
   "score": 33,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fqczj",
   "message": "Graphic descriptions of a notorious child torture case that happened in some Asian country. Not saying the name, but if someone does, please do not look it up. Your curiosity being filled is not worth it.      \nI went through horrific abuse and have literally seen people die in front of me, but the memory alone is enough to make me shut down my brain and think of literally anything else.",
   "created_utc": 1695227626,
   "score": 17,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fzn0n",
   "message": "Nutty Putty Cave\n\nJunko Furuta\n\nIf you don't know anything about these, keep it that way. Ignorance is bliss.",
   "created_utc": 1695230862,
   "score": 26,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1fnzl7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1g8zi9",
   "message": "I unfortunately was just old enough to use the fledgling World Wide Web without supervision, and young enough to be not doing anything of the sort.\n\nAs a 16 year old metalhead, I saw things on rotten, steakandcheese, and other sites that still randomly flash into my mind's eye 30 years later. \n\nThere are a lot of things about the modern internet that piss me off, but sites like that going down / becoming really underground is not a bad thing.",
   "created_utc": 1695234100,
   "score": 20,
   "submission_id": "16nfirv"
  },
  {
   "comment_id": "k1gb2nc",
   "message": "Arthur Labinjo-Hughes. \n\nA little boy who was killed by his parents. There was a video from the security camera in his house of him trying to make up a little bed for himself while sobbing that no one loved him and no one would feed him. Even now just thinking about it I'm in pieces again. If I could erase anything from my memory it'd be that poor poor little boy's sobs. \n\nThere's a lot on here about cartel videos, if I could hand over that baby's parents to them, I'm watch whatever happened to then with pleasure.",
   "created_utc": 1695234816,
   "score": 25,
   "submission_id": "16nfirv"
  }
 ]
}