{
 "submission_id": "16nh8l8",
 "title": "What was the reason you left your last job?",
 "selftext": "",
 "created_utc": 1695203728,
 "permalink": "/r/AskReddit/comments/16nh8l8/what_was_the_reason_you_left_your_last_job/",
 "score": 204,
 "url": "https://www.reddit.com/r/AskReddit/comments/16nh8l8/what_was_the_reason_you_left_your_last_job/",
 "comments": [
  {
   "comment_id": "k1e99lx",
   "message": "Found a new job with higher pay.",
   "created_utc": 1695204161,
   "score": 162,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e95ba",
   "message": "About to leave this job once I secure another one. I have 1 coworker and she's a fucking nightmare of a person to be around",
   "created_utc": 1695204072,
   "score": 39,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eejgi",
   "message": "Toxic work environment and senior management refused to address bullying behaviour.",
   "created_utc": 1695207763,
   "score": 147,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e9j0c",
   "message": "Started a business at the end of 2018. Chipped away at it on the side. Covid happened and it blew up while I was furloughed without pay from my job for months. When they told me it was time to return I said I’m not returning. HR called later that day to ask if I was giving two weeks and was confused when I said no.",
   "created_utc": 1695204354,
   "score": 175,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e8u3w",
   "message": "Boss screamed at me after I asked for a 50 cent raise",
   "created_utc": 1695203834,
   "score": 134,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eg4yy",
   "message": "They demanded we come back to the office while the higher ups still worked from home. I put in my notice and found a permanent remote job with higher pay.",
   "created_utc": 1695208715,
   "score": 123,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ecoxd",
   "message": "My friend died in a motorcycle accident.\nMy boss had a thing going on the Saturday of his memorial.\nHe asked me to come in that Saturday and I said no, I have a memorial. My friend died.\n\nI had an arrangement where I studied while working there. I was working \"part time\" and I had to go to classes and we discussed it in the interview.\n\nThen when I couldn't come in he said \"If you can't do this for me, I'm going to take away the time I give you to go to class\"\nBear in mind he payed me basically minimum wage for the privilege of being there.\nHe was just a horrible person.",
   "created_utc": 1695206570,
   "score": 225,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1egos4",
   "message": "The manager said I was replacable, I had another job lined up so I basically said \"OK replace me\" and left. \n\nTurns out I was replacable, but I like my new job a lot more even though the pay is slightly lower, so over all I consider this a win.",
   "created_utc": 1695209018,
   "score": 212,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eek3l",
   "message": "Just don't work for a family member. Trust me.",
   "created_utc": 1695207774,
   "score": 93,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e9pg3",
   "message": "I'd had enough of having to be extremely professional for minimum wage.",
   "created_utc": 1695204483,
   "score": 249,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1edkt0",
   "message": "Cause I was in burnout and I was having serious anxiety problems.",
   "created_utc": 1695207152,
   "score": 244,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ee5rt",
   "message": "Lack of hiring vacant spots and management expecting everyone to \"share the load.\" My department went from 52 employees to 46 during the pandemic it was... managable, barely. Post pandemic, the call was made to bring everyone back to the office, and we lost more. The department went down to 37. Over the last year, people have been quitting due to overwork and unrealistic expectations. When appealing to management, we were told we were on a hiring freeze. When I quit, the department was down to just under 30 people, and we had a 4 month backlog of work. The work we did was to stay compliant with federal regulations. I can't be any more specific than that until the investigation is over.",
   "created_utc": 1695207525,
   "score": 227,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ejcjk",
   "message": "I worked as Maintenance in a giant Tyson chicken plant. Super dangerous, smells awful, cold and wet all the time, shitty hours.  But none of that is why I left.  \n\nI left because they would demand the machines run perfectly all the time but would not provide the necessary parts because they were too \"expensive\"  \n\nZero support from upper management.  There you are just a warm body.  They don't care if you live or die.  Profit over safety every time.",
   "created_utc": 1695210470,
   "score": 71,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ef2wa",
   "message": "The companies did a lot of shit in one week. I was contracted to work for Amazon.\n\nOriginally, I was supposed to stay in town and work out of one warehouse. They realized there wasn't enough for me there, so my contract company quickly negotiated (i do it or no job and a threat to fine me) me into traveling to other local cities. I quickly had to get used to multi hour drives, living entirely in hotels, and dealing with a lot in expenses. That was in the first month. I could get through that.\n\nThey \"renewed\" my contract and lied to me that they would be maintaining the same terms. It was a job that was now 100% travel, and they changed it, so I would no longer be paid for my time to get to a site. They also expanded my range of travel from in state to the entire country. That means I would get 0 pay while driving 3 hours to somewhere or losing an entire day in airports. I found this out during a call while I was sitting at an airport waiting out a layover. Amazon also tried to bump me up to a team leader as they expanded their project. Of course, there was no pay increase. I was just supposed to train and be a coordinator for the new people. \n\nTheir communication royally sucked. I got flown to another state just to find out there was no work to be done. I was not allowed on site because they were still doing heavy construction to build the warehouse. Me not being on site means they would not pay me. I managed to sort of fill the week to not go mad with boredom in my hotel. \n\nAdd on that I was in no way going to get along with the people I was now working with, I decided that was enough. I called the contract company and my Amazon guy while at the airport headeing home, and I told them I was done. I'll come in to drop off my equipment on Monday and that I do not want to see them again.",
   "created_utc": 1695208092,
   "score": 62,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1enmqc",
   "message": "People usually don't leave jobs, they leave managers.",
   "created_utc": 1695212582,
   "score": 54,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ejjy4",
   "message": "Used to work for fedex, I was loading 10 vans by myself(2000 packages) daily not counting trailers they needed me to unload. Meanwhile my same job on a different van line had 4 people loading a van. Asked for more help and gave them at least a month to hire people/get their shit together but they never did. Two very close family members died within a span of a week and my patience was stretched too thin and I told them go fuck yourselves I’m done.",
   "created_utc": 1695210576,
   "score": 54,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eiees",
   "message": "I was told via Zoom that my dept.'s work was going to be outsourced to India, but they weren't exactly sure when (\"it could be six months... it could be a year...it could be 18 months...\"). They offered me a buy out if I didn't want to wait, so I said \"fuck it,\" took it, and jumped.",
   "created_utc": 1695209966,
   "score": 43,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e9qtw",
   "message": "They lied about starting salary and prospects so I was looking elsewhere within days of starting",
   "created_utc": 1695204510,
   "score": 40,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e8xlx",
   "message": "Retired.",
   "created_utc": 1695203909,
   "score": 31,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e97l5",
   "message": "I don't like working",
   "created_utc": 1695204119,
   "score": 88,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1earr3",
   "message": "My parents live 1800 miles away and are getting older. I wanted to be closer.",
   "created_utc": 1695205248,
   "score": 47,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1edrf3",
   "message": "They took away accrued PTO I hadn’t been able to take due to my workload. It was a rule to cap PTO as of a certain date, I admit I wasn’t super aware of it because they had suspended it in the first year of covid. When I asked for an exception and explained that not only were they taking away my one and only benefit, but I had worked countless unpaid hours over 40/week. So I found a better job and quit. Big companies are way too inflexible.",
   "created_utc": 1695207268,
   "score": 49,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1el78p",
   "message": "They didn’t respect my vacation time and I was being micromanaged. I left and found a way higher paying job where I am union and get two raises per year automatically",
   "created_utc": 1695211399,
   "score": 22,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eprzx",
   "message": "I had a mental breakdown. I had a toxic team leader who played sides, and I never caught it until it was too late. I’ve been without a job since last November just trying to get my head right.",
   "created_utc": 1695213584,
   "score": 21,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1emdgz",
   "message": "My boss was an absolute CUNT.",
   "created_utc": 1695211973,
   "score": 19,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1egh2i",
   "message": "My coworker finally got a training position she'd been wanting to get for years. A few weeks later, before she started, she found out she was pregnant. Due to the nature of our work, she immediately disclosed this to our manager as additional safety precautions would be required. Soon after that, she was told that she no longer had that training position due to her pregnancy. Needless to say, HR and our union became involved and she was given her training position back. The manager then tried to bond her to the position for 2 years once she returned from maternity leave (6 months paid). That also didn't go over too well.\n\nAfterwards, our manager apologised to her for any stress it had caused her. Not for doing something blatantly illegal and immoral, just a cop-out, bullshit apology. Her husband is in the Air Force and they ended up being relocated to another part of the country, so she never returned after her maternity leave was finished. She was then screwed over AGAIN by my work giving her a bad reference when she is one of the hardest-working people I've ever met.\n\nShe and her family are now living their best life overseas and have since had a second child. I miss her dearly, but I don't miss that old workplace.",
   "created_utc": 1695208900,
   "score": 38,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1efpee",
   "message": "Colleague raped me. I reported to the police and the company. They told me that “your stories are different so we won’t uphold the complaint but we will hold a reconciliation meeting”. I said hell the fuck no and left at the end of my sick leave. Fuck Sainsbury’s, rape apologist company.",
   "created_utc": 1695208463,
   "score": 85,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eb441",
   "message": "got made redundant",
   "created_utc": 1695205484,
   "score": 15,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1f83cr",
   "message": "I was killing it at my last job. I found a major problem with a multi-billion dollar program, brought it to the attention of the program manager, led a team to fix it, and delivered the fix on schedule. \n\nI won a (non-monetary) award for this work. I got an “excellent” performance review. And I got a 2.8% ‘raise’ when inflation was ~8%. \n\nMy boss said he had tried to get me more money from his bosses, but unless I brought him an offer for more money, there wasn’t much he could do. So I got a higher offer, and I accepted it.",
   "created_utc": 1695221067,
   "score": 15,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1f8c9k",
   "message": "I actually really loved my old job. Back in February I had hinted at consideration for a promotion to a supervisor position. I met all the requirements- and worked more hours than the supervisors at the time. But I had to leave for a few months because I had surgery and was placed on medical leave. They ended up hiring a new guy to fill my position- but I was so cross trained on everything that the guy they hired who had my experience levels was made a supervisor. I was salty but oh well. When I came back from my surgery I started to adult big time and try to find a place of my own but my pay wasnt cutting it. Around this time one of the supervisors up and left and straight moved across the country. I was very professional and told my manager I wanted to be interviewed for the open position. He knew me well and knew I wanted to get out of my moms house. He told me that despite having every single qualification and then some, I wasnt going to be considered because of my age. I'm 20- the requirement was 18. \n\nSo I applied somewhere else, had an interview, got the job with a significantly better pay and directly after that, I signed the lease to my first apartment. While I hold no resentment, I'm really happy I made that call. My life is more stressful now but Im way happier overall :)",
   "created_utc": 1695221158,
   "score": 15,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eb1zu",
   "message": "Because fuck you",
   "created_utc": 1695205443,
   "score": 42,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1g5nk3",
   "message": "It was Amazon and let me tell you, the rumours are true.",
   "created_utc": 1695232934,
   "score": 10,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ekyyr",
   "message": "RN, Got tired of the BS, was assaulted by a patient and a good friend died from cancer, very quickly from diagnosis to death.\nI'd reached my Superannuation retirement age. Went back to work after friends death, had a panic attack.\nSaw my Dr who recommended medication.\nSaid fuck it I'm not being medicated to do my job that I had done for 40 years. Got a medical certificate and cut out all my accrued sick leave. Then resigned.",
   "created_utc": 1695211284,
   "score": 11,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1el2yt",
   "message": "Mainly the commute, after coming home I barely had enough time to prepare dinner/lunch for the next day, shower and go to sleep. Now I just walk about 15-20 mins each way...",
   "created_utc": 1695211340,
   "score": 10,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ecgau",
   "message": "I was literally allergic to it (swimming instructor, chlorine) my body grew resistant to the antihistamines I was using and I had a full body breakout. It didn't heal for over 2 months, only healed once I finally fully removed myself.",
   "created_utc": 1695206409,
   "score": 22,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e9on7",
   "message": "It was time for my State Pension and I f. ..ing hated the place!",
   "created_utc": 1695204468,
   "score": 10,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eg91k",
   "message": "Took my soul. No work life balance",
   "created_utc": 1695208778,
   "score": 8,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ec8ap",
   "message": "This may seem stupid, but it was mainly my boss calling me 'Froggert' all the time. She thought that was really funny. Yes, I have a terrarium in my living room and yes, it houses a couple of frogs. When I showed her an innocent photo of it in my first month, I didn't anticipate that it would have year-long consequences. In hindsight, it was also a mistake to put that little porcelain figurine of a bullfrog on my desk...\n\nAnyways, these tactical errors on my part led to her calling me 'Froggert'. It rhymes with my real name, which I'm not going to reveal here, and her eyes flickered with pride when she first came up with it. Upon leaving her office after tendering my resignation, my last words were 'See you never, Pigscilla', which was perhaps a bit clumsy but nevertheless accurate, as she looks like a Priscilla and is a fat and mean whore.",
   "created_utc": 1695206258,
   "score": 37,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1f8dmv",
   "message": "Promised health insurance after 90 days.. quit on day 92.. it was a health center.. told me I missed the enrollment or some lie..",
   "created_utc": 1695221172,
   "score": 7,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1efpuv",
   "message": "A micro-managing, passive-aggressive female bully.",
   "created_utc": 1695208472,
   "score": 13,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ea0ou",
   "message": "Got a degree so my pizza delivery job didnt seem so useful anymore",
   "created_utc": 1695204710,
   "score": 6,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ebawc",
   "message": "Used to work in HR for a small company. I drastically overhauled how the recruitment process was done after some frustrating experiences and drastically improved staff retention rates which had been dire.\n\nAfter years of proven success, the boss started interfering in my duties undoing all my work, he only parts of my job he didn't essentially take over where either menial tasks he couldn't be bothered with and the unpleasant stuff. Final straw came when he insisted on trying a new kind of assessment for potential recruits with 20 minutes notice. I refuse, but say I will consider it for future drives. He did it anyway, launching into a spiel while I was collating documents - but then we couldn't mark the papers as he had neglected to bring the answers page, so all he'd done is waste time.\n\nIn his defense, his home life was in a bad place and several months later, he'd have a full on breakdown and even attempt suicide [unsuccessfully thankfully] but it was a shitty experience and hugely demoralising.",
   "created_utc": 1695205618,
   "score": 8,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eg5yr",
   "message": "Because my boss was super controlling. She never listened to me. And was super inconsiderate. And she always wanted to have a staff meeting on my days off.",
   "created_utc": 1695208731,
   "score": 8,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eiiov",
   "message": "..some asshole making my life and that of others, miserable.",
   "created_utc": 1695210030,
   "score": 7,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1enbz3",
   "message": "Poor mental health. Crying before, during, and after work because I hated the job\n\nMaking less money but took a job afterwards in a field I loved working in before. No regrets with my decision",
   "created_utc": 1695212441,
   "score": 7,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eip02",
   "message": "Classic shitty suburban office park work culture. \n\nGuys all wore khakis, polos, talked about golf, were homophobic as a personality trait and pretended to be players (going to shitty suburban bars). \n\nWomen all drove the same giant SUVs and all bought the same exact $500 handbags as each other. \n\nJust a giant cookie cutter situation where the only way to not be singled out by management was to become a robot that confirmed to the basic white person stereotype. The last straw for me was when we were at a birthday breakfast thing in the office, and a colleague of mine openly and loudly chastised me for the amount of butter I put on my bagel.\n\nSo yeah, I couldn’t work at a place where the amount of butter you put on your bagel made you stick out like a sore thumb.",
   "created_utc": 1695210123,
   "score": 45,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ebloy",
   "message": "My boss had a horrible temperament. Her and another coworker would start so much drama. She would never hold herself accountable for all the drama she would cause.",
   "created_utc": 1695205827,
   "score": 6,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ehl3m",
   "message": "I was basically a janitor at a restaurant. I cleaned back of house, the walk in and freezer, bathrooms, did trash, cleaned dining room, equipment, dishes and more. Also floated around the kitchen when we were busy af and ran register because I had the experience even though I was hired specifically to clean. Anyway I made it 5 weeks and quit because co workers would come in the back while I was trying to work and fill the back room with smoke from hitting their dab pens and the assistant store manager was on meth bad. Like dude would come in high, get high in the bathroom and smoke weed with my co workers who were 16 and 17 years old. Drug shit only happened while this particular manager was on duty, rest of the employees were professional af and I loved working with them but I started getting scheduled more and more with Manager Methhead so I quit because I didn’t want to be around that shit. Also the GM kept covering his ass anytime he would fuck up or the DM would try and drug test the dude.",
   "created_utc": 1695209522,
   "score": 7,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1elh8b",
   "message": "The assistant manager saying \"if everything isn't put away within 72 hours of the truck delivering it then the district Manager is going to write us all up\"\n\nIt's mildly satisfying to know that literally everyone else who worked there with me has now quit. If only the incompetent suck up manager would do the same.",
   "created_utc": 1695211536,
   "score": 6,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1epfw3",
   "message": "Hated managing people … and hated managing my bosses even more.",
   "created_utc": 1695213430,
   "score": 6,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1f7npu",
   "message": "Micromanaging boss kept shifting more and more of her work onto me.",
   "created_utc": 1695220905,
   "score": 7,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ejcux",
   "message": "Chronically ill. It was over. I couldn’t manage work anymore. :((",
   "created_utc": 1695210474,
   "score": 9,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eqcdl",
   "message": "Worked at a coffee shop and it got infested with cockroaches. Owner refused to pay for an exterminator. \n\nThere were a ton of other issues but that was my final straw.",
   "created_utc": 1695213845,
   "score": 5,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1f8n00",
   "message": "Said I was too old and made too much.  Paid me a year's salary to go away.  Did it for everyone in the company who was my age.\n\nSpent 2.5 years retired until I got an offer that I couldn't refuse.",
   "created_utc": 1695221269,
   "score": 5,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ebdl1",
   "message": "I work on a golf course. Got fired bcs I put my dick in the ball washer. But to be fair she was fired too.",
   "created_utc": 1695205672,
   "score": 45,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ec95n",
   "message": "Piss poor management, mostly due to micromanaging, irritating coworkers, and dealing with the trashy public. Tip for any supervisors out there; don't text or call your employees every 5-10 minutes asking about their day, or what they're currently doing when they're in the field. It easily makes a half-day job turn into a full day.",
   "created_utc": 1695206274,
   "score": 4,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eclcw",
   "message": "Project moved away from my technology to new team. So I found new one.",
   "created_utc": 1695206503,
   "score": 4,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ebh5c",
   "message": "Terrible manager who loved to create a very toxic environments to all his team.",
   "created_utc": 1695205741,
   "score": 11,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eprsj",
   "message": "People throwing people under the bus. I fucking hate that shit. You got a problem with me then include me in the meeting. Don’t have meetings behind my back and then tell me shit wasn’t going good. And people going over my head to my boss when I gave no reason for them to need to do that. It’s hard being black in corporate.",
   "created_utc": 1695213582,
   "score": 6,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1e9zrh",
   "message": "I had to quit a week ago to attend the funeral of a friend, he died of complications due to a severe case of monkeypox. Luckily my boss JUST gave me the job back after I returned from the funeral. Miss you Ftak15.\n\n#😔",
   "created_utc": 1695204692,
   "score": 6,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eibgm",
   "message": "I was a bartender, and it was so toxic. Don't get me wrong, I liked my coworkers, but the environment as a whole was keeping me on the wrong path. I had to leave for my mental health. That was 9 yrs ago, and I'm much better these days.",
   "created_utc": 1695209922,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1elfbr",
   "message": "I needed a new environment.  I was bored, doing the same thing for over 16 years.  I had no guidance or really even a manager.  I could see my teammates being promoted but there was no path for me.",
   "created_utc": 1695211509,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1eq8rj",
   "message": "Retired.",
   "created_utc": 1695213798,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1g0gck",
   "message": "I moved to another department because the people I worked with were militant Christians and unapologetic friends/supporters of the Duggars.  Better pay just came along with this transition.",
   "created_utc": 1695231145,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1g0gu5",
   "message": "Paid too little",
   "created_utc": 1695231150,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1gjb1g",
   "message": "A combination of physical inability and my boss trying to get me fired in order to commit nepotism.\n\nI was only supposed to fold laundry, deliver personal clothing, load and unload the machines, and take out the trash and sweep up and clean the dining rooms at the end of the day. Occasionally I'd come in in the morning to stock the linen closets, sometimes I had to disinfect pillows.\n\nIt was a lot of hard work, like a lot of heavy pulling and pushing and it wrecked my shoulders and back. Sometimes the backroom garbage can was so packed I couldn't lift the bag out. Then they decided that since the housekeeping staff weren't there in the evening I was the one who needed to clean any rooms that were discharged after they left. Which honestly was fine, a lot easier on my body. But this was in a healthcare facility during the waining of peak COVID so I was sweating my ass off in an N95 because it felt like every week there was someone testing positive.\n\nBut I was told that any work I didn't get done because I had to do a cleaning wouldn't be counted against me, and I had two days of housekeeping training where I arrived in the morning and could leave when my usual shift was supposed to start and my boss was supposed to find someone to cover for me.\n\nWell, that was all a lie. My boss never found someone to take my shift, and I later found out that I was written up for not showing up to my shift, on top of everything I couldn't get done because I had to do room cleanings. To make matters worse, I was also written up for not showing up for a meeting I was never told about. So here I was with a multitude of violations over my head and possibly about to get fired.\n\nI knew it was all bullshit so I went to someone I could trust who looked at it, talked to a few people, and found out that my boss was a two-faced lying bitch who wanted to hire on her four sons and was trying to get me fired so she could do so. I put in my two weeks, she got reported for nepotism, left that position, and moved her and her dumbass kids to another state.\n\nNow I'm sitting here trying to get a remote job because my body is so destroyed from working laundry.",
   "created_utc": 1695237642,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1gjlqn",
   "message": "Boss was a huge Jerk disguised behind a facade, full on narsicist behaviour and very manipulative. Too much bs, only got to know if I had to work the day before I had to work, couldn't make any plans with anybody, super stressful. Most of my colleagues there were pretty chill, I enjoyed my time with them, my boss was definitely the biggest problem tho",
   "created_utc": 1695237741,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1gjrtq",
   "message": "A bullying, inept, narcissistic manager!",
   "created_utc": 1695237797,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1hsyx3",
   "message": "Worked at a popular hardware store and they kept making me do things that weren't part of my job. Working in departments that were not involved in my position (minor gripe), having me operate heavy equipment I was not qualified to use and was not trained for and stuff like that. Huge safety issue that broke so many rules.  \n\n\nBut the two really bad things were that they forced me to do landscaping work outside of the building in the hot sun without access to drinking water for hours and **capture and kill snakes** that frequently arrived in container of piping that were delivered. This is especially horrible since they were required to use outside services for both tasks. Went against company policy. Maybe the law. Haven't looked into it.  \n\n\nI now run two successful businesses from my house. Screw working for other people. I don't like getting treated like dirt for pocket change.",
   "created_utc": 1695254432,
   "score": 3,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1ea8gd",
   "message": "toxic environment... my manager was extremely confident even when he was talking shit... as someone who is not so quick to react on the spot (unless it involves throwing punches), he really made me question my knowledge even if I could prove later on that I was right and he was wrong. The pay was very good but I am willing to take a pay cut rather than work in that environment.",
   "created_utc": 1695204869,
   "score": 9,
   "submission_id": "16nh8l8"
  },
  {
   "comment_id": "k1h3p5r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16nh8l8"
  }
 ]
}