{
 "submission_id": "16nt4w5",
 "title": "What’s the most disgusting thing you have ever done?",
 "selftext": "",
 "created_utc": 1695235713,
 "permalink": "/r/AskReddit/comments/16nt4w5/whats_the_most_disgusting_thing_you_have_ever_done/",
 "score": 190,
 "url": "https://www.reddit.com/r/AskReddit/comments/16nt4w5/whats_the_most_disgusting_thing_you_have_ever_done/",
 "comments": [
  {
   "comment_id": "k1gzz33",
   "message": "One time I threw up into the inside pocket of my coat on the bus... Don't think anyone noticed, but I was on drugs so I could be wrong",
   "created_utc": 1695243262,
   "score": 111,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gqmep",
   "message": "In middle school, I ate a dead fly off a windowsill to impress a girl. It did not work.",
   "created_utc": 1695240042,
   "score": 56,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1geytl",
   "message": "Used to have a job in a dense American city where I had to clean up human waste when people used the driveway/entryways as a toilet. Dope-sick poops are beyond revolting. Public toilets are a public health necessity.",
   "created_utc": 1695236153,
   "score": 110,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1ge25j",
   "message": "I accidentally drank bong water once which was probably the most disgusting mistake I have ever made. \n\nI had poured the water out into a glass and refilled the bong with bottled water and went to have a drink from the glass later and realised after a big gulp.",
   "created_utc": 1695235844,
   "score": 241,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1ghjb4",
   "message": "I worked for the sanitation department at the shit pumping plant over the summer, while cleaning some tanks accidentally sprayed some of it into my mouth. Learned to keep my mouth shut while at work...",
   "created_utc": 1695237036,
   "score": 109,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gj6zi",
   "message": "When we were dissecting a pigeon in bio class a few years ago, I told my friend I'd give him $1 if he ate a piece of corn from inside the pigeon. And he actually did it. I have no idea how long the pigeon was dead for or how long it's been preserved.",
   "created_utc": 1695237604,
   "score": 55,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1giyoe",
   "message": "Washed an ecstasy tablet down with warm wine (Buckfast), puked it up in the street with accompanying chicken pizza, looked through puke for the pill, it was under a bit of chicken. Picked it up and swallowed it again.\r  \n\r  \nWhat do I win?",
   "created_utc": 1695237525,
   "score": 104,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gr7z9",
   "message": "For my previous career, the government would send us on missions in the woods for a couple weeks at a time. Had a bad ingrown toenail one night on a backcountry operation. We were bedding down and my foot had been killing me all day. I sat on my bedroll and took my boot off, just to find my big toe was swollen as hell with puss starting to leak from where my toenail met the skin. It was so red and puffy that I couldn’t touch it lightly without wincing. It had to be dealt with, but sleep time is very crucial out there, if you start fucking with guys precious time to sleep, there going to let you hear about it. I started working on the nail with my knife, but it hurt so bad I almost screamed. I have a pretty good pain tolerance, but I knew I would make noise so I looked around, and for some unknown reason decided my best bet was to stuff the sock I had been hiking and sweating in all day into my mouth while I cut it out. I cried and let out screams muffled by the sweaty sock, as I operated and cut out the worst ingrown nail I had ever seen. Lots of blood and puss. After a while I got it handled, and took the sock out of my mouth. It was a tough night, that toe still bothers me to this day.",
   "created_utc": 1695240246,
   "score": 211,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1grxco",
   "message": "Had to wash a diarrhea covered staircase outside the door to the Mayor's Office in the Civic Centre car park.",
   "created_utc": 1695240480,
   "score": 124,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1ghmav",
   "message": "When I was 14, I was living in Mexico with relatives. I woke up at about 12 am, I guess the beans made me gassy. Well I felt like I had to fart, so I did and ended up sharting. :/…. So my relatives lived in a rural type area. We had to shower by heating up water then putting it in a bucket. And they heated it up by a fire made from wood. Which I had no idea how to do. It was October so of course it was freezing. The only running water was like a small faucet type outside the house. I tried cleaning myself as best as I could, it was so embarrassing, so disgusting. Also hand washed my pants and underwear various times, I was freezing. Luckily everyone was asleep. Don’t trust farts!",
   "created_utc": 1695237065,
   "score": 53,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gzfph",
   "message": "Pissed in my ex's mouth wash after he cheated on me with my friend two days after my dad passed away. I feel gross about it now as a F35 but at the time (I was 17) it felt like the best revenge",
   "created_utc": 1695243085,
   "score": 22,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1givdn",
   "message": "2 500ml bottles of cherry Pepsi max. 1 I am drinking out of, another went flat so I was using that to put my cig ends in, I got them mixed up, swallowed a big old gob full of a mix of flat pop, cigarette ends and tar. I promptly threw up the cig ends",
   "created_utc": 1695237494,
   "score": 144,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h3ztj",
   "message": "I dropped a scoop of ice cream on the carpeted floor at a mall, picked it up with my hand, put it back on the cone, and ate it. I was like 17.",
   "created_utc": 1695244636,
   "score": 184,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hmxrm",
   "message": "I used to work for a company that transported bodies for the coroner’s office and about twenty funeral homes in the area. I didn’t really want the job, but it was not long after the economy collapsed, felons were not in high demand in the job market, and I had bills to pay. Also, I’d found my kid brother dear a year prior, which didn’t do anything good for my psyche. I thought more exposure to death might somehow soften the blow, or desensitize me enough to wipe that memory from my brain.\n\nSo, I receive a call at 7 something on a Friday morning. I’m to meet the medical examiner at the scene of a fire. When I arrive, I’m told the decedent is an eighty-three-year-old man named Sydney, and it’s his birthday. He planned to have the family over that afternoon to celebrate, but didn’t like the look of the weeds growing between the brick pavers spanning the stretch from his home to his detached garage, so he decided to torch them. \n\nSydney poured gasoline all over the weeds, unaware the gas can had a pinhole and he was spilling it all over his pants leg. He walks into the garage, sets the can down, lights a book of matches and tosses it out the door, and the flames come right back inside and up his leg. He knocks over the can, spilling gas all over the floor, which spread the flames to the garage walls and the Honda Accord. I go to put Sydney in the Ziplock (he’s my first burn victim), and when I grab his arms, his skin crackles like a hot dog that’s been on the grill too long. His skin came off in my hands, as de-gloving and slippage are common in serious burns.\n\nSo it’s probably 9:30ish by the time I load the birthday boy into the meat wagon. He smells awful. As soon as I close the rear door, Sean, the Medical Examiner, sticks his head around the van’s rear and says, “Ready for the next one? She’s only two miles from here. Neighbors reported a foul odor and say they haven’t seen her in weeks.”\n\nOh, joy.\n\nThe lady lived in a townhouse condo. When I arrived, there were six or seven uniformed cops standing on the lawn, all with disgusted looks on their faces. The front window of this condo has so many flies on it, it resembles a scene from the Amityville Horror. Covered. No exaggeration. I ask one of the cops how bad it is. He asks how much protective gear I had in the wagon. I start listing the items. He says, “Fuck it, man. Wear two of everything. It’s horrible in there.”\n\n(I’d be remiss if I did not mention that this is all occurring in August, temps are in the mid 90s, and I have to wear a suit and tie for this gig.) \n\nAfter putting Vick’s under my nose, I don my biohazard suit, respirator, goggles, additional shoe covers, and three pairs of gloves. I see her legs protruding from behind the kitchen island. There’s a zillion flies buzzing around as I approach. Sean is shaking his head in disbelief as he takes photos. I round the corner of the island and discover this woman has a cat, and it hasn’t had any Meow Mix in at least three weeks. The cat was literally eating the flesh from her owner’s face, as I stood there.\n\nSean tells me we’re going to be there awhile, because we need to wait for a feline dentist to come there and extract the tissue from the cat’s teeth. The odor caused by a human body three+ weeks into active decomposition, in August, in a closed space, is fucking horrible. (Ghastly doesn’t do it justice.) I’m gagging and trying not to puke and I haven’t even touched this poor old woman yet. Her phalanges are exposed, she’s leaking everywhere, and when I roll her over (she fell face down) the whole right side of her face had melted into the carpet. Zero distinguishable features. \n\nAfter two hours of this disgustingness, I load her into the wagon. Now I have a burn victim and one in active decomp, three feet behind me, and it’s hot out, man. The AC in the van does not work. I roll the windows down, but I don’t want to smell any more of this than I have to, so I keep all my gear on. \n\nThere’s a magnet for the door, but it is not in the van for some reason. So each time I pull up to a stoplight, people catch a whiff of my cargo, look over and see me dressed like I’m about to cook meth or kidnap E.T. \n\nI can only imagine what went through their heads.\n\nI kept the job until the day they sent me to pick up a three-year-old girl who’d drowned. My daughter was only a few years older than the girl. It messed with my head. And that was the day I discovered that my line in the sand on a dirty job, is dead kids.\n\nApologies for the novella…",
   "created_utc": 1695251925,
   "score": 149,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h1vfy",
   "message": "So when you have babies, there's a couple ways to get the snot out of their nose because they can't really do it on their own. You have the bulb things where you squeeze one end and it creates suction but you also have these little straw things with a big sponge in the middle. You suck on one end and the snot goes into the sponge filter. Except I was tired because we had twin newborns and I forgot to put the sponge back in. So I got a mouthful of snot.",
   "created_utc": 1695243902,
   "score": 250,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gebx2",
   "message": "I once dropped a pill into a gutter style urinal, last one so I picked it up and swallowed it anyway.",
   "created_utc": 1695235935,
   "score": 219,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gk1ya",
   "message": "Apologies in advance for this being long. We have a big outdoor music festival here every year that is in a large park down town (they also shut down the streets around it as well as use the civic center right by the park). When I was 17 we went like we (my then GF) and I did every year. Well, it was the last day of the event and it was coming to an end on Sunday night. As we were sitting in front of the stage for one of the last acts, I get the ever so dreadful churning and gargling in my stomach that I always know is going to end in diarrhea. The port-o-potties are about football field away and they always had long lines, so I decide to tough it out since I was about to head home. It progressed further to the point that I'm starting to sweat and getting sharp pains as we begin packing up and walking out.\r  \n\r  \nI have to walk about 4 blocks over to a parking garage where I and they (her family) are parked. So we get there, I'm clinching trying to hold it together, and she is doing the usual drawn out teenage goodbye which feels like eternity. Finally she leaves and I head up to the middle deck (about 3 floors up, they were on the bottom) to my car. As I walk toward my car she calls my phone and inform me she has my keys still (were in her purse) and to come back down and get them. Now, at this point it has rapidly progressed to the point I am penguin walking around this parking garage about to lose the good fight. I get back down and get my keys, she draws out the I love you, I'll miss you, blah blah blah again and I'm about to just run away. She leaves and I think maybe I can get back in and just hold it till I get to the port-o-pottie. No dice, since the event was over, they wouldn't let anyone back in. I make it back to the garage, dripping buckets of sweat, having to stop every 10 ft or so to clinch and wait for the all temporary clear. There is no public elevator in this garage, so I'm between floors, in the stair well, when it's game time. Nothing could hold it back. It was if someone had kicked me in the stomach and there was no holding back. I fling my pants/boxers off and the most horrible chunky liquid spews out. There is so much of it that it starts running down the stairs and all of a sudden \"click-chhhhh\", the door on the bottom floor, two flights of stairs below me, open. I quickly wipe my bottom with my boxers and throw my pants back on. As I'm entering my floors door I hear \"OMFG, OMG OMG OMG, WTF\". I hop in my car and take off.\r  \n\r  \nFlash forward to the next day. We are sitting around watching TV and they run a news story about the event. Apparently the door way I lost it at was also the floor that has the entrance to the mayors office. They are looking for the \"vandals\" and there may be a reward for any information. At this point, being 17, I'm freaking out thinking what if cameras saw me, what if they saw my car and start questioning people, what if they DNA test the poo. My GF is utterly disgusted at the story and thinks \"people like that should be put down\". A few days later, I get a call from the police department that I need to come down to the station. I'm of course freaking out, immediately turn pale white according to my mom. We make it down to the station and I am at the point of being in tears thinking I'm going to jail. Turns out they had recovered my stolen car stereo that was stolen a few months back. They just needed me to sign off on it. To this day I have told no one of this story...reddit, you are the first.\r  \n\r  \nEdit: Wow this really caught traction. When I went to bed this was at the bottom and I figured no one would actually read it, my story being forever safe. To anyone doubting it, this story is very real unfortunately. Afterwards, and to this day, I carry a small pack of baby wipes in my glove box and a dose of Imodium AD (diarrhea medicine) in my wallet.",
   "created_utc": 1695237891,
   "score": 244,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h2m0g",
   "message": "Pulled a raccoon in about 54 pieces out of a combine after he made friends with the radiator fan, I've had to hack up pigs with a saw to make them fit in an incinerator, and I've had to sort (by thankfully gloved hand) through fecal and renal waste for a nurses' lost earring.\n\nIdk why she wanted it back either.",
   "created_utc": 1695244155,
   "score": 94,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gjse3",
   "message": "I was on a Boy Scout camp out and this kid kept hitting me with his bamboo stick so I broke it in half and threw it away, he then decided to spit in my eye, so I proceeded to steal his bag of peanuts while he wasn't looking and filled the bag with my pee, I let it soak for a bit then poured the pee out and I let the bag dry in the sun for the rest of the day. The next morning I placed the bag back in his tent and watched him eat the whole bag, he periodically looked at the peanuts a little confused but he ate the whole bag of like 30+ of them. It was excellent revenge",
   "created_utc": 1695237803,
   "score": 127,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gp9o1",
   "message": "When I was a chef many years ago, I had an absolute cunt as an assistant manager who just wouldn’t stop sexually harassing me. \nI was 19 at the time and it was a series job for me. \nAnyways one day when I had had enough, I decided to shove his bbq chicken breast up my 14 hour shift sweaty ass crack. Kept it there a while and put it back on his plate. \nYes I squeezed out a fart as hard as I could. He was such an ass hat to me, I hated him so much. He once made me get his wallet from his car that was wrapped up in a jock strap. \n\nTurns out he used to sexually harass a lot of young men at the restaurant i worked in. So I feel justified in what I did. \nI had a greasy ass for a night but it was a small price to pay watching him at some stink chicken.",
   "created_utc": 1695239592,
   "score": 17,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1genjt",
   "message": "I’ve eaten 2 Arby’s beef and cheddars in one sitting. To my “credit”, I was high and I paid the price with meat sweats",
   "created_utc": 1695236045,
   "score": 202,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1ge7kr",
   "message": "A waffle stomp",
   "created_utc": 1695235895,
   "score": 54,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hfsjx",
   "message": "I shit the hell out of a Dunkin Donuts bathroom. \n\nI couldn’t help it. I was about to shit my pants, so I raced into the bathroom, dropped my pants as quickly as I could, and just blasted the toilet, seat and wall.\n\nI really don’t know how. \n\nMy underwear was ruined, so they stayed behind in the trash, and the mess that I made was horrible. I tried cleaning what I could, but it would take a hazmat team to fix what I did.  It was horrible.\n\nI felt awful about it, but I didn’t feel well, and wanted to get home to some medication, so I left a 20 in the sink, and headed for home.\n\nWorst part is, I wasn’t 10 or 20years old.  Probably 55 or so, and I’ve never been so embarrassed in my life.",
   "created_utc": 1695249003,
   "score": 101,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gkf44",
   "message": "Hosed down a diarrhea covered Golden Labrador Retriever puppy.",
   "created_utc": 1695238013,
   "score": 93,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1guyen",
   "message": "While deployed I got a little drunk and had to pee like a horse but of course the latrine is like half a mile walking distance so I used a half filled Gatorade bottle, the white flavor, and put the top on, subconsciously set it on the stand next to my bed black out again... still drunk and not thinking I wake back up later hungover, not remembering anything and was like fuck yes a full Gatorade. I pounded that thing.. so dehydrated, didn't care just straight chugged it. I was sick for 2 days after that",
   "created_utc": 1695241480,
   "score": 143,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gkwyj",
   "message": "We had an office Christmas party when I worked at a university and a few of the employees didn't care for chocolate cupcakes and so they got thrown in the trash. The whole box was sitting in the trash can and not even opened. I took the whole box out and took it home with me. Some would say that's gross but it never got open and the cupcakes were from a nice bakery. I hate to see food just get wasted.",
   "created_utc": 1695238177,
   "score": 178,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gt5tj",
   "message": "Ate incredibly greasy fish and chips on Hastings Beach, then also ate a cheap supermarket cheese pizza that night, then the next day proceeding to throw it all up, bits of fish and all after walking around for 15 minutes feeling like a giant ball of lead",
   "created_utc": 1695240885,
   "score": 65,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gf3hr",
   "message": "Once I shit in the bathtub and I remember it to this day. But to be fair, I was three years old or younger than that.",
   "created_utc": 1695236196,
   "score": 31,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hjt4i",
   "message": "My husband and I were checking on some first-calf heifers\\*, and we came across one heifer that had had a stillborn calf and had prolapsed. This means she pushed her uterus out of her body and it was hanging out of her, inside out. We had to push her uterus back inside her so my husband hog-tied her and lay on top of her neck/head so she couldn't thrash around. I had to push her uterus in as far as I could so my arm was inside her up to my shoulder.\n\nI then had to place two antibiotic boluses\\*\\* in her righted uterus and then I sewed her vulva shut with burlap string to keep her from pushing her uterus out again. If you have never been around anything being born there are a lot of liquids, solids, and **smells** and I was covered *in all of them*. By far the most disgusting thing I've ever done.\n\n\\*Just like the name suggests, this is the first time they have been pregnant.\n\n\\*\\*These are like a big pill about the size of a cutie tangerine.\n\nBTW an inside-out cow uterus looks like something out of a SciFi movie.",
   "created_utc": 1695250623,
   "score": 166,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hj7qb",
   "message": "Full on shit myself while driving, stuck in traffic.\n\nShit again 20 minutes later.\n\nSat in it for a further 45 minutes until I got home.",
   "created_utc": 1695250384,
   "score": 93,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hog3o",
   "message": "I ate Reese’s peanut butter cups in the dark for four nights (old Halloween candy)\n\nOn night#5 the gf had one and screamed\n\nThere were worms in them\n\nI ate worms for four nights in a row\n\n\nFuck",
   "created_utc": 1695252547,
   "score": 179,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gg6au",
   "message": "During a Ren fest with my friend, we had a competition as to who was “more Viking.” We were pretty young so I did the most vulgar and stupidest thing my 13 year old brain thought of by rubbing a huge turkey leg against the top of a dirty wooden picnic table. Then in true “Viking” fashion, I ate the entire contaminated turkey leg. I was the most Viking that day.",
   "created_utc": 1695236565,
   "score": 69,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h7pcp",
   "message": "Swapped to the alt account for this one...Long story short: coming down from a high of booger sugar, smoked some weed, home alone, bored. Got in bed to masturbate. Grabbed my gfs butt toy. Felt like I was about to finish, felt an intense sensation, closed my eyes, then, after 2 full seconds, I realized I wasn't Cummings. I was pissing up into the air and back onto my stomach.",
   "created_utc": 1695245952,
   "score": 65,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hk4qn",
   "message": "For 2 years I used to take OxyContin like it was candy.  Opiates cause constipation and in order to shit, every day I’d have to put on a rubber glove and bust out a tub of Vaseline and lube up and go digging.  I don’t miss those days.  Been Oxy free for 13 years now.  Weed is my go to pain meds now.",
   "created_utc": 1695250755,
   "score": 81,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1ge2yh",
   "message": "I just peed in my pants in the car.",
   "created_utc": 1695235851,
   "score": 19,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gvohk",
   "message": "Freshman year in college (I was 17). One night a group of friends and I went to a house party that we walked to from campus. After getting drunk at said party, we started roaming the streets to other frat houses/random house parties and getting even more drunk. Late at night we found ourselves in someone’s backyard that had a bunch of beer pong tables with red solo cups filled with various amounts of beer etc from random people that left them there. I literally, in my drunken stupor, started to drink the beer from the random cups…bc I was out of alcohol. Yup.",
   "created_utc": 1695241732,
   "score": 11,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1ggoho",
   "message": "Cleaned a public woman's restroom.",
   "created_utc": 1695236740,
   "score": 54,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1heocn",
   "message": "Went down on a guy and discovered a “ring” of rock-hard caked smegma had formed behind the head of his dick. Found it with my mouth.  \n\nGuys… wash your goddamn genitals and ass. It’s not hard.",
   "created_utc": 1695248562,
   "score": 48,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gldzw",
   "message": "Drank my own puke, threw it up, drank it again.  We won the scavenger hunt that year.",
   "created_utc": 1695238330,
   "score": 18,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h3c6l",
   "message": "My dog had killed a rabbit and left it out in the yard. No one noticed for a few days until it started to smell. I got a shovel and scraped it off the artificial turf and chucked it in the trash outside. It was the day after trash day so the whole can was empty. The next day I went out and the bottom of the trash was covered in maggots. My mom told me to dump bleach in it, so I did. So there sat my dogs dead rabbit with a million maggots and half a gallon of bleach in the hot socal sun. Fun times. Smelled great.",
   "created_utc": 1695244408,
   "score": 37,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1glspt",
   "message": "I had the runs at summer camp while I was in the shower.\n\nEmergency waffle stomp.",
   "created_utc": 1695238465,
   "score": 9,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gs2fa",
   "message": "I wiped my ass on my sister's pillowcase when I was like 15. \n\nI asked her to grab me some TP while I was on the toilet and set it outside the door. She said no. She learned something that day.",
   "created_utc": 1695240526,
   "score": 42,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hm5bt",
   "message": "It was four floors up from the bathroom in a place I was staying in Vietnam. I had to shit, but didn't want the stairs. I squatted over the sink that was in my room, but it was a particularly thick loaf that proved highly resistant to passing through the cross hair of the sink drain. I had only a thin shirt hanger wire to help, and it was not much help at all.",
   "created_utc": 1695251596,
   "score": 8,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hoh88",
   "message": "According to my wife, putting BBQ sauce on tacos..",
   "created_utc": 1695252560,
   "score": 8,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h79aw",
   "message": "Shower on my period… WARNING GROSS: on my first period my mom told me I had to shower after two-three days of being too scared. I blood was everywhere, and clots kept sliding down my leg and it just tore me up. I ended up needing her help.",
   "created_utc": 1695245794,
   "score": 14,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hinbb",
   "message": "Ate a cockroach when it was alive, don't ask",
   "created_utc": 1695250157,
   "score": 17,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hm809",
   "message": "Woke up in a bathtub full of vomit, shower running, almost overflowing, fully clothed, in a random apartment during a house party. No clue how I got in there.",
   "created_utc": 1695251628,
   "score": 35,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1htw2w",
   "message": "When I was really young I found a very fancy box that I liked very much. Beautifully ornate and heavy. Inside the box was a white powder and I instinctively licked my finger and stuck it in and tried some. Very chalky with no taste. I asked my mom what is this beautiful box with bad tasting powder inside. I’m sure you can infer the rest, it was my uncle. I was young and it was unintentional obviously so I don’t get hung up on it really.",
   "created_utc": 1695254815,
   "score": 55,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hyhxw",
   "message": "Got a handy from Lauren Boebert during a play.",
   "created_utc": 1695256715,
   "score": 6,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h6x91",
   "message": "Slept with a female cousin multiple times for years",
   "created_utc": 1695245676,
   "score": 29,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1genyn",
   "message": "Group-Pooped on a guy as we quaked profanities at him.  He fed us mouldy bread. He would turn up for days , just throwing mouldy bread into the pond. Duck knows where he got it from.",
   "created_utc": 1695236050,
   "score": 28,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gf65u",
   "message": "In the Marine Corps every Thursday is \"field day\", where the entire base gets cleaned.  Well, at your barracks, you get assigned a common area to clean.  At 29 Palms, we had this lounge area my platoon was responsible for.  A pool table, kitchenette, couches, the usual stuff.  Well while we are cleaning, I dipped at the time,  I'm spitting into a clearish solo cup.  My buddy, completely unaware, asks me if that is Coke in my cup?  I mean, come on.  Of course I said yes.  Hand him the cup.  He takes a nice big swig of my warm, fresh spittle.  I ran.  Fast.  He chased me for like 10 minutes around the base.  We laughed so god damn hard for so long about that.  That.  That was fucking gross.  I did it to someone else.",
   "created_utc": 1695236221,
   "score": 31,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h2oml",
   "message": "I went down on this woman and the lights were off.  When I later went into the bathroom and turned the lights on, I had a lite coat blood all over the lower half my face.",
   "created_utc": 1695244181,
   "score": 7,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hffnh",
   "message": "You win! Every godforsaken nastyarse one of youse. I'm out!",
   "created_utc": 1695248861,
   "score": 6,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hkysx",
   "message": "I double dipped a chip.",
   "created_utc": 1695251103,
   "score": 5,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hoz1x",
   "message": "My horse had an illness called strangles and her lymph nodes around her throat and face abscessed.  Some of them had to be lanced and one huge one on the side of her head popped on it’s own.  Every day twice a day I had to peel the crust off of them, gently press out any puss, then flush them out with warm water mixed with chlorhexidine (probably spelled that wrong).  If doing that for a month wasn’t bad enough while flushing one of the abscesses one day some fluid sprayed back at me and got in my eye.  By the next afternoon I had a gnarly pink-eye infection.",
   "created_utc": 1695252766,
   "score": 37,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1gyob3",
   "message": "Your mother",
   "created_utc": 1695242831,
   "score": 23,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hhxat",
   "message": "We had this guy in our barracks in AIT, he was a grade A twatwaffle. He thought he was hard, he wasn’t, he thought he was cool, he wasn’t, etc… Anywho this was before cameras became big on phones, so one night I tea bagged him when he was out cold on his rack while my buddy took a Polaroid of my nuts on his forehead. Next off post pass, I dropped it in the mail to him. He basically never got mail, so when Sargent on duty called his name he was super excited and we all knew what was up. He got back in formation and open the envelope and was instantly pissed but put it away real quick. Later on the barracks floor he tried finding who did it but everyone just laughed.  \n\nIt took all the power in the world for everyone that was in on it to not laugh their asses off right there in formation. Now 20+ years later I still think it’s funny, but it was gross to throw my nuts on his face that way.",
   "created_utc": 1695249863,
   "score": 36,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hkaxj",
   "message": "When I was a kid I picked my nose, got a fat booger and flicked it… well it landed and stuck to my wall and I didn’t know until I spotted it a few days later, in which it grossed me out so I didn’t try to pick it off the wall. \n\nMy dad painted over it not too long after, I’m guessing he didn’t see it. But you could still clearly see the outline of it if you knew where it was. So that house has my old crusty booger in the wall forever.",
   "created_utc": 1695250824,
   "score": 55,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hlnvu",
   "message": "Probably helping gut a home that, at one point, had a good 8' of water in it during the flooding from Hurricane Katrina. This was in the middle of summer about 10 months after the disaster and we were left scraping out several inches of mud and tearing out moldy drywall. At one point someone opened the fridge - that smelled like rotten eggs and stale milk, but like 100x worse.",
   "created_utc": 1695251393,
   "score": 15,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hlyaf",
   "message": "Threw up on some guy in the restroom trying to get to the toilet to heave. Down his leg. He was really understanding, thank goodness.",
   "created_utc": 1695251514,
   "score": 6,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hmeha",
   "message": "I fell into a pit of poop when I was 4. Shout out to my dad for piggybacking me covered in human poop.",
   "created_utc": 1695251703,
   "score": 26,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hnw9j",
   "message": "I was beyond broke, and hungry, so for a bit I dumpster dived for food.",
   "created_utc": 1695252319,
   "score": 6,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hu9ta",
   "message": "The comments are all just run of the mill stuff. I’m disappointed.",
   "created_utc": 1695254975,
   "score": 6,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1i01bt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hfwv8",
   "message": "Was cleaning a patient's room when they suddenly shot up from their dead sleep, tore off their CPAP, and projectile vomited, hitting me. \n\nFound out later that they were vomiting feces. \n\nProbably was the worst day of both of our lives.",
   "created_utc": 1695249052,
   "score": 101,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hjaqk",
   "message": "When I was first hitting puberty and my period my birth giver forced me to use reusable pads. Like the all organic hippie dippie kind with no leak-proof backing. I had such a heavy period (in fact it was dangerous but I was a victim of medical neglect so it just wasn't addressed) I tried to tell her I bled through them way too fast, but she just dismissed me as whining. It was my first period, I didn't know how to go pad shop, and even if I did we lived out in the middle of nowhere, I was too young to drive, and I wasn't allowed to have my own money. So my second period rolls around. In order to not run and change my pad every 30 minutes or so my little CHILD brain decides to just layer up as many pairs of underwear as possible. I still bled through them so fast. Later that first day of my second period I stole the house phone (I wasn't allowed to use it) called my dad, begged for him to pick me up, and I promised I would explain after he came and got me. Before he got me I changed, but I was so embarrassed that I hid all the bloody underwear. Ladies and gentlemen, it was not found until **years** later. Like not until I was an adult and moved out.\n\nThe story does have a happy ending though. My dad and I learned how to pad shop together, and we made a plan to secretly arrange that I would stay with him when I was on my period, which my birth giver never caught on to... thankfully.",
   "created_utc": 1695250417,
   "score": 51,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1i2h7a",
   "message": "Was drunk at a strip club. Went into a bathroom stall to pee. Noticed a little bit of white powder on tp holder. Ran my finger over it and then licked finger to see if it was coke. It was.",
   "created_utc": 1695258351,
   "score": 16,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hf4eh",
   "message": "I've gone *easily* three weeks without showering. Ahaha yay executive dysfunction",
   "created_utc": 1695248739,
   "score": 15,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1i0l8f",
   "message": "2021 I relapsed on opiates. To end my relapse, I took a naltrexone to put me into precipitated withdrawals. First it started out as a gurgle in my stomach, then it was uncontrollable diarrhea, then I started puking. Everything calmed down for a minute so I started a shower. Got in the shower and proceeded to shit while puking and vice versa. Puked so much that it clogged the drain so I was left standing in puky, shitty shower water. 0/10 would not recommend.",
   "created_utc": 1695257570,
   "score": 16,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hnz30",
   "message": "threw away half a 375 ml bottle of whiskey in a city garbage can. the kind of can where people throw away poop bags and other fun stuff. i went back later and fished it out to finish off the bottle. i was hiding my drinking. got sober not long after. almost at 12 years now without a drink.",
   "created_utc": 1695252352,
   "score": 15,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hsciv",
   "message": "Ate a chip off the floor then had to pick a hair out of my mouth. Just happened yesterday.",
   "created_utc": 1695254169,
   "score": 16,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hpsit",
   "message": "When I was 19 I slept with my female boss and the married man she was having an affair with. \n\n20 years later, I have an awareness of how disgusting it was. I really didn't get it back then. \n\nAnd no, I never repeated it. Despite Reddit's belief in such things, some people do learn from their poor choices and choose better.",
   "created_utc": 1695253107,
   "score": 15,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hs795",
   "message": "Ugh. Some years back I was at work and started to feel sick. So I drank a few cups of tea to help my throat. My boyfriend at the time wanted to go to Olive Garden for dinner that night so I picked him up after work and we went. We were almost there and I got hit with *the rumble*. We were still new at this time and he didn’t know about my IBS. So I rushed to find parking and as we were walking in, I diarrheaded my pants :/. I had to go to the bathroom and throw away my brand new cute valentines underwear from Victoria’s Secret. Thankfully I was wearing black leggings so you couldn’t see anything. I carried on like nothing happened.",
   "created_utc": 1695254108,
   "score": 15,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1htfj4",
   "message": "I have contamination OCD. The most disgusting thing I have ever done as per the dictates and influence of my OCD is not washing my hands after going to the toilet because it was too soon after applying my expensive prescription eczema ointment to justify washing it off. I was desperate, that toilet trip simply had to happen.",
   "created_utc": 1695254626,
   "score": 13,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h9u7r",
   "message": "In college, off campus apartment. My roommate's girlfriend was practically living with us and would steal my food. She was mean and nasty to him. She would cheat on him, he'd take her back. She always gave me attitude and was just fucking rude to me all the time. She was rude to the girls i would bring back after parties.\n\nShe had her fancy shampoo and body wash in our bathroom shower. I peed in her shampoo and body wash bottles often.",
   "created_utc": 1695246727,
   "score": 14,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hkk73",
   "message": "When I was younger I did swimming lessons. I would bike there, and wear my swimsuit under my clothes so I could rip them off as soon as I got to the pool. While biking, my stomach started turning and I felt nature calling. Unfortunately, I didn’t have time to go before my lessons and decided to hold it in and pray for the best. I kept having those farts where I felt like it was gonna be poo but I couldn’t help it. So while in the pool, my stomach only started turning more. I don’t know what was wrong with me, why didn’t I ask to leave? I decided to fart to release some gas, and to my horror I realized I shat myself. What do I do? Do I hold it in my  one piece and ask to leave? How do I get rid of it?\nI decide to move my bottom to the side and as I do the turd rises up.. \nNo one notices. Except me of course. I looked at it in terror, knowing what I just did. I turned away and pretended not to see it. Finally my instructor saw a rouge turd floating on the surface of the pool, and screamed for everyone to get out. I got out, walked to the washroom inconspicuously and as I write out this story I remember just wiping my cheeks full of poo. I continued to shart in the toilet. Liquid. Just liquid. I guess it was good a turd floated up and not diarrhea. I couldn’t believe I just did that. I sat on the toilet sweating. \nAfter that I think I just cleaned up and we ended the day early. \nI was 9 years old. I am a girl. Im taking this to my grave.",
   "created_utc": 1695250934,
   "score": 24,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hr5gj",
   "message": "When I was a smoker (in high school), we used to smoke in the girls’ bathroom. There was a vent to the outside on the wall right over one of the toilets, so we’d stand on the toilet seat and blow the smoke right into the vent to avoid stinking up the bathroom too badly. \n\nOnce, while standing on the toilet and rummaging around in my purse for my pack of Newport Lights (🤢), I pulled out the pack a bit too aggressively, causing me to drop the last remaining cigarette…\n\nRIGHT. INTO. THE. TOILET. 🚽🚽🚽\n\nAnd being the idiotic teenage nicotine addict that I was, without a second thought, I fished the cigarette out of the toilet WITH MY BARE HAND, BLEW ON IT until it was mostly dried off, and then proceeded to SMOKE IT. 🤢🤦🏻‍♀️\n\nAnd to this very day, I still have shameful flashbacks whenever I set foot in a public bathroom… **shudder**",
   "created_utc": 1695253674,
   "score": 27,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1h74cs",
   "message": "I drank water with a dead mouse in it *gags* \n\nWe lived in a house surrounded by fields, they flooded. I had this giant opaque plastic cup I used. I picked up my half full cup and had a giant swig. Before I realized the flooding field forced the mice into our house and one had taken a swan dive and drown. This was 5 years ago and still upsets me. Surprised I didn’t get sick. Gah!",
   "created_utc": 1695245745,
   "score": 11,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hql19",
   "message": "I was at a park with my dog when the gurgling and gassiness started.  There were two bathrooms but they were far apart.  I went to the closest one but it was locked.  I hightailed it to the other one way across the park.  It too was locked.  I ran out of time.  Leaned against the back wall of the bathroom, pulled down my pants and let go.  Didn't notice that there were houses with a full view of me.  Wiped myself with some grass.  Even my dog was embarrassed.",
   "created_utc": 1695253438,
   "score": 11,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hsp0e",
   "message": "My husband used to chew tobacco. I had a Pepsi and he mistook it for his spit bottle. I drank it by mistake and nearly threw up.",
   "created_utc": 1695254315,
   "score": 10,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1ggso8",
   "message": "Picked food from the rubbish and ate it.",
   "created_utc": 1695236781,
   "score": 10,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1hkfex",
   "message": "I scooped out a sink - full to the brim - of pure, undiluted, entire-meal-puke, with my *bare hands* one night as a barback. Puke so thick it clogged the drain and had to be removed before I could even run the water.\n\nIt was just faster to get it done quickly and move on than spend 30 minutes fighting through the packed bar to get supplies and then all the way back to the bathroom. \n\nAnd yes I scrubbed my hands repeatedly like was about to do surgery afterwards.",
   "created_utc": 1695250876,
   "score": 10,
   "submission_id": "16nt4w5"
  },
  {
   "comment_id": "k1htevg",
   "message": "A gram of dope off a public bathroom floor (I'm now 8 years clean from heroin)",
   "created_utc": 1695254618,
   "score": 10,
   "submission_id": "16nt4w5"
  }
 ]
}