{
 "submission_id": "16o1h6v",
 "title": "What ruined your life?",
 "selftext": "",
 "created_utc": 1695256391,
 "permalink": "/r/AskReddit/comments/16o1h6v/what_ruined_your_life/",
 "score": 132,
 "url": "https://www.reddit.com/r/AskReddit/comments/16o1h6v/what_ruined_your_life/",
 "comments": [
  {
   "comment_id": "k1i4g2p",
   "message": "I injured my back in 1983 when I was 25 and it has affected me every day since.",
   "created_utc": 1695259173,
   "score": 207,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ij75f",
   "message": "Okay I feel kind of bad for typing this out and please realize that even after all I am about to let loose below. I love those two kids more anything and wouldn't change a thing as far as me stepping up to raise them. BUt what ruined my life is my sister's herion addiction and the fact she had two kids she couldn't raise because of her addiction forcing me at 17 to step up and be a parent to her two kids. Today I am 35 years old and they are teenagers. One is almost finished high school but having to raise them really stunted my life and made me sacrifice so much because my sister couldn't be a mother. There I said it. My sister ruined my life. Now with that all said. I love my kids. I would never have abanoned them and not be there for them but being parent to kids I didn't bring into this world has been a challenge of a lifetime. Parenting is no joke. You always feel like you are failing too. Its tough... I love them more anything in life though and would never have chosen differently.",
   "created_utc": 1695265686,
   "score": 77,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iafer",
   "message": "My daughter passing away.",
   "created_utc": 1695261728,
   "score": 165,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i6hf2",
   "message": "My inability to form strong connections to other people and my lack of effort to learn how.",
   "created_utc": 1695260036,
   "score": 78,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1idx1x",
   "message": "Wouldn't say it's ruined but my lack of discipline, direction, and drive has really taken away from what my life could have been",
   "created_utc": 1695263260,
   "score": 61,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ihrwg",
   "message": "Short answer alcohol.\n\nLong answer parental childhood neglect and abuse.",
   "created_utc": 1695265012,
   "score": 16,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i3bb7",
   "message": "The consequences of my actions.",
   "created_utc": 1695258703,
   "score": 232,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1idvw9",
   "message": "Stevens Johnson Syndrome / TENs disease. My face and body are scarred up enough to where I can’t have a normal interaction with people.",
   "created_utc": 1695263246,
   "score": 171,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ib9if",
   "message": "My bipolar disorder. It’s ruined my relationships, caused me to act against my own interests and has made my life a complete mess. It’s under control with medication now thankfully.",
   "created_utc": 1695262089,
   "score": 220,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iaal1",
   "message": "My ex killing himself after I broke up with him.",
   "created_utc": 1695261670,
   "score": 19,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ig5we",
   "message": "Hodgekin's lymphoma    \nI got through the chemo and the radiation fine.  BUT...   \nI Dropped out of college for treatment and never went back.   \nTwo years later when the cancer came back, I couldn't work a full schedule while on Chemo so I wasn't making enough to pay my share of expenses,  as a result, we put things like groceries on a credit card balance that kept growing.    \nMy insurance company denied half my treatments, so we put some of that on credit too.  20 years later we were still under that credit card debt till we took advantage of our growing house value and lower interest rates to refinance the credit debt into our equity.    \nSTILL Because our credit rating was fucked, we got a worse rate than we should have.    \n20 years of financial bullshit because I had the audacity to get cancer in the United States of America.",
   "created_utc": 1695264276,
   "score": 15,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i8io5",
   "message": "TBI age 4, leading to lifetime of pain, nerve damage, lack of social skills in certain situations and a slew of other small issues that when combined make it very challenging to get through mist days.",
   "created_utc": 1695260909,
   "score": 146,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i8mvw",
   "message": "Drinking",
   "created_utc": 1695260960,
   "score": 160,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1icby5",
   "message": "Cancer \n\nJk I’m kicking it’s ass 💪",
   "created_utc": 1695262558,
   "score": 189,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1hy9a2",
   "message": "Inflation. Been working non-stop for 22 years. Thought I was finally earning an okay wage. Now I can’t afford to even take a day off work. Buried in debt. Own no assets except a 16 year old Highlander. Have never travelled. May never retire.",
   "created_utc": 1695256615,
   "score": 176,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iixos",
   "message": "Not being able to keep friends. I’m so lonely",
   "created_utc": 1695265560,
   "score": 48,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ieznk",
   "message": "PTSD",
   "created_utc": 1695263745,
   "score": 96,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iiu6j",
   "message": "Social anxiety and depression. Maybe not ruined totally, but definitely seriously injured.",
   "created_utc": 1695265515,
   "score": 50,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ikmit",
   "message": "When the love of my life killed herself.  Over 20 years later, I am still picking up the puzzle pieces.",
   "created_utc": 1695266380,
   "score": 38,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iesbr",
   "message": "Genetics, I was dealt a pretty crap hand in the poker game of life",
   "created_utc": 1695263654,
   "score": 114,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i643n",
   "message": "Having a child. I wasn’t ready for him and knew it but was pressured into it. I’ve never been the mother he deserved and he’s growing up to be a piece of shit. Now the older I get the harder it hits and the guilt eats me alive.",
   "created_utc": 1695259879,
   "score": 119,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i5wgr",
   "message": "My then-fiancé getting promoted to being my direct supervisor, combined with another manager deciding she didn’t like me and turning into Jekyll-and-Hyde so he wouldn’t see what my problem was. Destroyed my life and career when it ended.",
   "created_utc": 1695259790,
   "score": 73,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i8mjs",
   "message": "My wife’s affair.",
   "created_utc": 1695260956,
   "score": 104,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1idejy",
   "message": "Undiagnosed and untreated mental illness.\n\nEdit: To clarify, I was undiagnosed and untreated for 37 years. Two years ago, I finally sought professional help. At that point, I was diagnosed ADHD (and likely on the Autism spectrum, but technically that has yet to be confirmed), PTSD, etc etc. So yes, I have been officially diagnosed and been to therapy and been medicated. I'm doing much better now, but it took 37 years to get there and absolutely destroyed my life up until that point, including my first marriage/several jobs/friendships... you get the picture. It was not a happy, fun time.",
   "created_utc": 1695263032,
   "score": 154,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ijv1q",
   "message": "Being bullied. I was bullied all through elementary to high school. Depression hit me like a train later on. Due to extremely low esteem I was not able to make good friends, when I was living at home I hid in my room. Every social situation starts with anxiety and I assume everyone will hate me. It also led to a avoidance personality disorder, social anxiety and an eating disorder. Due to all these problems, I had to quit college. I am now recovering from depression and I have recovered from my eating disorder, but the personality disorder will always leave its marks and not entirely go away.",
   "created_utc": 1695266008,
   "score": 30,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1igjsq",
   "message": "The navy. Straight up lied. Now I'm forever afraid of crowds and loud sounds, and will never know a second of not-pain for the rest of my life. No gi bill, no benefits, no nothing. A waste of 6 years",
   "created_utc": 1695264450,
   "score": 90,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i1az1",
   "message": "Birth.",
   "created_utc": 1695257863,
   "score": 148,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i89dz",
   "message": "The pandemic",
   "created_utc": 1695260798,
   "score": 173,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i92sd",
   "message": "Shit, I've gone down pretty damn low, but I'm still here so it ain't ruined yet.",
   "created_utc": 1695261149,
   "score": 54,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1igut0",
   "message": "My parents put me in a group home at 14.",
   "created_utc": 1695264590,
   "score": 57,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iii4k",
   "message": "Depression, which causes me to overeat. Hoping things get better now that I am getting therapy, but sigh... I dunno.",
   "created_utc": 1695265354,
   "score": 55,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i08m4",
   "message": "Poverty and my country",
   "created_utc": 1695257431,
   "score": 26,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iby5y",
   "message": "Legionaries Disease. Caused fibromyalgia at 16 which 30 years later is still crippling me.",
   "created_utc": 1695262390,
   "score": 27,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iopnf",
   "message": "Deciding to inject meth for the first time at the start of the pandemic. Been picking up the pieces of my life and struggling with it ever since.",
   "created_utc": 1695268454,
   "score": 24,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1igw0c",
   "message": "\"Investments\" into the stock market during 2020 turned into an options gambling and alcohol problem. I eventually lost the bulk of my life savings.\n\nI'd have $70k in the bank and no debt right now. That's a lot of money for me, I've been oppressively poor my whole life.",
   "created_utc": 1695264605,
   "score": 52,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i20tw",
   "message": "My own head",
   "created_utc": 1695258160,
   "score": 46,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i899w",
   "message": "A lot of bad decisions, not finishing my studies, not working self love, being in relationships so i wouldnt feel lonely bit ended up feeling even lonelier, cheating on my husband when he didnt deserve it, just because im insecure, not having any commitment or sense of responsability to any job...",
   "created_utc": 1695260797,
   "score": 20,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ib191",
   "message": "Alcohol",
   "created_utc": 1695261990,
   "score": 20,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ioj7l",
   "message": "Baby died.",
   "created_utc": 1695268362,
   "score": 20,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ipslz",
   "message": "Abandonment as a small boy, several times for weeks. Physical and sexual abuse as a small boy.",
   "created_utc": 1695269034,
   "score": 19,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ik8ub",
   "message": "Never getting over a heartbreak of the best relationship I ever had. I never found anyone as good as her. Tried dating. Now I'm too old.",
   "created_utc": 1695266193,
   "score": 17,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1igcwp",
   "message": "Childhood trauma",
   "created_utc": 1695264364,
   "score": 36,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ihxdq",
   "message": "My uncle, after he murdered my brother.",
   "created_utc": 1695265083,
   "score": 14,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ij4l5",
   "message": "Divorce.  \n\n\nThe kids are probably the only reason I am alive.",
   "created_utc": 1695265652,
   "score": 15,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1icc5h",
   "message": "First it was just me, then everyone joined in",
   "created_utc": 1695262560,
   "score": 14,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1imgma",
   "message": "Fear. \nOf uncertainties. \nOf risks.\nOf failures. \nOf rejections. \nOf embarrassments.\n\nI made the worst possible life decisions for the last 6 years because I’ve been scared. \nI lost everything because I’ve been scared.\nI am still scared. That’s why my life is still going downhill. I genuinely don’t know what to do.",
   "created_utc": 1695267294,
   "score": 14,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i5mew",
   "message": "My inability to see past my flaws.",
   "created_utc": 1695259671,
   "score": 30,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1idkgv",
   "message": "My failed romantic choices.",
   "created_utc": 1695263104,
   "score": 27,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ifefv",
   "message": "Two tick-borne infections that weren't diagnosed properly for about six years.\n\nFinally treated, but damage was done by then.",
   "created_utc": 1695263930,
   "score": 29,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ios92",
   "message": "I wouldn't say ruined, but learning you have ADHD at 35 definitely causes a period of mourning. For all the opportunities, relationships, and moments that slipped through your hands over the years. How you might have seized an opportunity better, and where you might be today as a side effect. How relationships turned out due to rejection sensitivity disorder with no apparent reason for your reactions looking like red flags, and not a quirk of the brain. For the years feeling like a lazy piece of shit for struggling to do my job. \n\nI'm doing much better now, and it's only been a couple months. But you definitely replay scenarios in your life, and how they might have been different if you'd just known. Conversation might have been different, friends not felt like you'd forgotten them (object permanence).\n\nBut it's all history, and the only thing you can do is put down the what if, and start with whats now",
   "created_utc": 1695268492,
   "score": 31,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iuneb",
   "message": "I’m really good at dedicating myself to careers that don’t involve 6-figure salaries.",
   "created_utc": 1695271797,
   "score": 13,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iko1o",
   "message": "My mom's passing, and loved ones passing, pet went missing never saw her again and mostly everything long story.",
   "created_utc": 1695266400,
   "score": 12,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iogco",
   "message": "Losing my good remote job bc the contract ended \u0026amp; getting married to my ex. She was a secret criminal with 14 misdemeanors, a domestic violence charge, and was a meth user and drug dealer. \nI’m still piecing myself together after these past 2 years of chaos. I lost my apartment, I am 2 payments behind on my car, I have no car insurance, my credit is shit now, I owe $1,000 in unpaid medical bills and $5,000 in credit card debt.\nI still haven’t found a job that can pay my bills, have trauma from my ex berating me and completely taking advantage of me. I feel like a failure bc I have no job and no money whatsoever. I’m doing my best though.",
   "created_utc": 1695268320,
   "score": 12,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1i3cyf",
   "message": "Mathematics",
   "created_utc": 1695258722,
   "score": 24,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1idbkq",
   "message": "a lot of things, but you always manage to unruin, at least you can",
   "created_utc": 1695262996,
   "score": 10,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ih1in",
   "message": "My chronic illness. A lot of shitty things wouldn't have happened if I hadn't gotten sick.",
   "created_utc": 1695264674,
   "score": 11,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1idwtr",
   "message": "My wife and I had been together 12 years when she declared that her plan had always included children. I had been mildly discontent doing biomedical research and quit at 31 to have our first child and become a SAHM   She had our son 3 years later. I thoroughly enjoyed being a SAHM and my wife made over 300k as a physician.\n\nShe also began to resent me and lose all respect and appreciation for me, although I maintained our 2 homes impeccably   All she really wanted from me is more money for things we didn't need, and to know I wasn't just enjoying life   Quitting to have the children my wife wanted ruined my life",
   "created_utc": 1695263258,
   "score": 41,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1is3rl",
   "message": "Molested by my grandfather",
   "created_utc": 1695270322,
   "score": 10,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iu1aw",
   "message": "Loving a person who never liked you, hoping he'll love you as time goes by",
   "created_utc": 1695271437,
   "score": 9,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1if4po",
   "message": "I’m a 24 year old male. I’ve been searching for love for the past year, going on tons of dates, working out daily, and broadening my horizons. The only issue is that I hadn’t had sex in a while. In fact, I had convinced myself I was unworthy. So when an opportunity FINALLY arised last week, I jumped at the opportunity.\n\nAnd as of today, I undoubtedly have genital herpes. I feel like I’ve completely shattered my life after trying so goddamn hard to improve myself for years. I know it’s just a harmless rash that’s mostly dormant. That’s not what I’m concerned about. It’s the stigma. I’ve put SO much work into making myself happy and healthy, only for it to all come crumbling down in a flash.\n\nI have so much love to give to this world, and I’m struggling to make sense of it all. Life is so cruel.",
   "created_utc": 1695263808,
   "score": 44,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iarc6",
   "message": "Easily my parents.",
   "created_utc": 1695261871,
   "score": 30,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1idrjv",
   "message": "My ex husband.",
   "created_utc": 1695263192,
   "score": 18,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1igvqs",
   "message": "I took SSRI meds during Covid after stopping alcohol cold turkey. This influenced some off the worst behaviors I was manic and erratic and destroyed my business and life and relationships in a few short months. If the doctor just had monitored me it would have been avoided but he increased my dose without knowing what he was trying to diagnose. I haven’t been the same since. My old self is gone and I’ve aged like a decade due to stress.",
   "created_utc": 1695264602,
   "score": 21,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1im27a",
   "message": "the internet",
   "created_utc": 1695267089,
   "score": 9,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iny45",
   "message": "Being born",
   "created_utc": 1695268058,
   "score": 8,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ihegp",
   "message": "Currently pregnant with someone I've been LDR dating for only 3 months. He lives out of state and wants me to move there, I want to stay in my home state. I told him today that I don't want to move and the conversation went so badly; he was upset and understand why but I feel like he doesn't have sympathy for my position. I feel like I want this baby but abortion is the only way to avoid having a long, horrible legal battle. I don't want abortion to be part of my life. I don't think there's any way for me to get through this without regretting my decision, whatever it ends up being.",
   "created_utc": 1695264839,
   "score": 17,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ioa3v",
   "message": "Jehovah's witnesses religion and my upbringing caregiver",
   "created_utc": 1695268231,
   "score": 17,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ii5iz",
   "message": "Not standing up for myself. Destroyed my relationship, destroyed my goals and destroyed my career.  I'm absolutely heartbroken and trying to rebuild everything from the ground up but it's hard",
   "created_utc": 1695265187,
   "score": 8,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iif7h",
   "message": "Having children",
   "created_utc": 1695265316,
   "score": 25,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1igvas",
   "message": "Capitalism and depression",
   "created_utc": 1695264596,
   "score": 37,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1icwwt",
   "message": "Obesity and depression.",
   "created_utc": 1695262819,
   "score": 14,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ieasy",
   "message": "Insecurity fr",
   "created_utc": 1695263432,
   "score": 13,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ieh2e",
   "message": "Covid",
   "created_utc": 1695263512,
   "score": 13,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1ioe6y",
   "message": "Organized religion",
   "created_utc": 1695268289,
   "score": 14,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1isqlg",
   "message": "A bad childhood/broken family/abuse and then being conditioned by my environment and parents to make me feel like it was all my fault",
   "created_utc": 1695270683,
   "score": 7,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1iw17z",
   "message": "The Leadership of The LDS Church - WA STATE",
   "created_utc": 1695272638,
   "score": 7,
   "submission_id": "16o1h6v"
  },
  {
   "comment_id": "k1j56vx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16o1h6v"
  }
 ]
}