{
 "submission_id": "16o1wnl",
 "title": "What is it like to be in a sexless marriage?",
 "selftext": "",
 "created_utc": 1695257547,
 "permalink": "/r/AskReddit/comments/16o1wnl/what_is_it_like_to_be_in_a_sexless_marriage/",
 "score": 87,
 "url": "https://www.reddit.com/r/AskReddit/comments/16o1wnl/what_is_it_like_to_be_in_a_sexless_marriage/",
 "comments": [
  {
   "comment_id": "k1i16to",
   "message": "It’s like your life now, but married",
   "created_utc": 1695257814,
   "score": 47,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i2l15",
   "message": "I unfortunately have first hand experience with this. Been married for 25 years. My wife has become less and less interested since our last child was born (9 years). We have sex about once every 2 months or approximately 5 times a year. We have a functional relationship in all the other areas but to be honest, I’m only staying for the kids. We don’t really fight, but we’re basically just in a domestic partnership",
   "created_utc": 1695258397,
   "score": 138,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i5daw",
   "message": "It’s like having a jealous \u0026amp; angry sibling that won’t let you date anyone.",
   "created_utc": 1695259562,
   "score": 188,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ibyjx",
   "message": "For nearly a year my marriage has been sexless. My wife passed away last month. Terminal cancer. During the year and a half after her diagnosis, I found that sex, while an expression of love, wasn’t the only way to express that feeling.\n\nIn the end, just holding her hand and seeing her smile gave me more satisfaction than anyone could ever know.\n\nShe was my room mate. My best friend. The love of my life. I would trade a thousand years of sex whenever I wanted just to spend the rest of my life holding her hand and hearing her contagious laughter.\n\nA sexless marriage isn’t the end of a marriage, but a sexless marriage without communication absolutely is.",
   "created_utc": 1695262394,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i5bjl",
   "message": "Imagine holding a grudge against someone you love more than anyone you've ever loved because you have no outlet for physically expressing how much you love them, and that resentment grows until it completely eclipses the relationship",
   "created_utc": 1695259541,
   "score": 15,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i2ms3",
   "message": "Literally two people living together.\n\nI used to think it was fucked that my grandparents slept in different rooms. Well here we are. Married for 8 years and it's a room mate situation. We share bills and meals sometimes. Most of the time she doesn't even pay her side of the bills.\n\nIt's fucked.",
   "created_utc": 1695258418,
   "score": 103,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i7g98",
   "message": "It’s like going home to a second job where you used to be real close with the people there but something happened over the years working together and now you still work together but just do your own things still seeing each other some or most days but that’s about it.",
   "created_utc": 1695260448,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i9l7l",
   "message": "It's like living with a roommate but you can't date or have sex with anyone else. It's lonely and over time, the resentment grows. There are a lot of hurt feelings and insecurity on the part of the partner who wants sex (unless neither of you want it). Been married going on 25 years, it took me a very long time to realize (or make myself believe) that my husband is just not a very sexual person. Until about 6-7 years ago, we would have sex every few months. Until about a 2 years ago, we had sex 1-2 times a year. We last had sex a year and a half ago. We sleep in separate rooms. I'm miserable. He doesn't seem to have an issue with it.",
   "created_utc": 1695261367,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i0py7",
   "message": "Depends if it’s mutual or not. If one’s horny and the other is not, say night-night to a healthy relationship. Reciprocation is vital.",
   "created_utc": 1695257624,
   "score": 65,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i169c",
   "message": "It’s like being a sexless single person, but you get all the companionship, comfort, support and arguments of a relationship.",
   "created_utc": 1695257808,
   "score": 173,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i4uc9",
   "message": "My wife came out as ace. It is difficult and disheartening I won't lie. She will do it if I ask but it is more of a chore for her than anything else. We have sex maybe every 3 months or so to give perspective.",
   "created_utc": 1695259339,
   "score": 131,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i8ox6",
   "message": "Trapped. Incredibly trapped.",
   "created_utc": 1695260984,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i6ryy",
   "message": "It’s lonely AF. Imagine being single and can’t date anyone, but you aren’t single and still can’t date anyone.",
   "created_utc": 1695260159,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i3fcf",
   "message": "Like living with a roommate, or a ghost, who you slowly grow to resent and fall out of love with.",
   "created_utc": 1695258749,
   "score": 125,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i5d1q",
   "message": "It sucks, or doesn’t as the case may be! Wife has chronic pain and not interested at all. I too had sone ED issues in the past but am trying to resolve but I guess after 20 years she has decided that my dick is not welcome in her anymore.\nSo you think about the good ole days and get sadder by the day!",
   "created_utc": 1695259559,
   "score": 99,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i7pa7",
   "message": "Friends without benefits",
   "created_utc": 1695260557,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i7kch",
   "message": "Husband is disabled and is on various medication. He already had low testosterone before, it hurts him severely to finish and he’s on a meditation has lowered his libido to getting horny a few times a year. It sucks for both of us. But we are also partners and we still try to do life together as it comes. There are more important things sometimes.",
   "created_utc": 1695260497,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i4ez3",
   "message": "You watch and jerk off to a lot of porn",
   "created_utc": 1695259160,
   "score": 70,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i5h2z",
   "message": "Head over to the dead bedrooms subreddit and you’ll find out.  It’s painful if it’s one sided.",
   "created_utc": 1695259607,
   "score": 26,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i8hy5",
   "message": "I'm more curious what it's like to be in a sexful marriage....",
   "created_utc": 1695260900,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i99zv",
   "message": "It is very difficult. For 6-8 years, I (45+M ) stayed faithful, even though there was no intimacy, nor respect. Ultimately, I strayed and got caught. \n\nThe self doubt from the loss of intimacy was hell, the imputed guilt from the transgression worse. We are still together today, but things have not changed.",
   "created_utc": 1695261235,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i2a82",
   "message": "It's 2 people living together.",
   "created_utc": 1695258270,
   "score": 36,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i7om9",
   "message": "After a while you start to question the point of it all.",
   "created_utc": 1695260549,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i9t9e",
   "message": "It like being in the friend zone with someone that doesn’t really like you.",
   "created_utc": 1695261464,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i7voz",
   "message": "As the less interested partner in my first marriage, stressful and full of guilt. He loved to quote that 'men think about sex every 2 1/2 minutes '. He watched a lot of porn and expected it to be like the things he watched, to the point where he humiliated me and left me with a very bad infection. He made it last as long as possible. He could (and often did) tell me how long it'd been to the hour since we last had sex.\n\nHe took me to several therapists - psychiatrists and sex therapists to try and medically fix my obviously abnormally low sex drive. The sex therapist said I was fine and normal. The psychiatrist changed around my antidepressants several times, but it didn't make a difference. I was given blood tests to see if my hormones were out of whack. They were fine. It was always a me problem, nothing was ever wrong with his behaviour.\n\nTowards the end, he'd regularly try to get me drunk enough to have sex, and even once raped me when I was too drunk to move or respond. I told him later that I was aware at the time but unable to say anything, and all he said was 'oh'. He never did apologise.\n\nOn the other hand my second husband and I have less sex, but are overall happier. We both accept that at times one or both of us sometimes don't feel in the mood, and that's perfectly fine.",
   "created_utc": 1695260634,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i6cfi",
   "message": "Don't do it. Intimacy is very important in a relationship. It's awful.",
   "created_utc": 1695259977,
   "score": 37,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i9mai",
   "message": "Not in a sexless marriage but I believe it's perfectly okay and acceptable to divorce in that situation if one party doesn't see a sexless marriage as being a problem.",
   "created_utc": 1695261381,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i4kri",
   "message": "After 32 years experience with it, don't want to do it again, She probably saved my life from booze, but, sometimes I'm not sure it was worth it. It's a lousy way to survive.",
   "created_utc": 1695259227,
   "score": 16,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i6aqe",
   "message": "Absolute fucking torture.",
   "created_utc": 1695259956,
   "score": 15,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i95ym",
   "message": "Not a big deal. Wife has medical issues that makes it uncomfortable for her. I respect that. There's more to a good marriage than just sex.",
   "created_utc": 1695261187,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i8pe0",
   "message": "Horrible, boring, depressing.",
   "created_utc": 1695260990,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i98my",
   "message": "Wasn’t married but was in a sexless relationship for 2 years. I don’t recommend it.",
   "created_utc": 1695261218,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1icars",
   "message": "I'm in sexless, loveless marriage. Together 32 years. Sexless for six. We knew early on we were not compatible, but stayed for kids. We don't go out like other couples. She's extremely jealous and suspicious if I go with my brother or a friend anywhere. \n\nWe never were each others best friend. Now, we are barely roommates. It is a horrible life. Can't seek out a lover...and don't have one at home.",
   "created_utc": 1695262544,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i3zie",
   "message": "FUCKING GREAT",
   "created_utc": 1695258981,
   "score": 19,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i17s6",
   "message": "A Reddit marriage",
   "created_utc": 1695257826,
   "score": 6,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i2d39",
   "message": "Roommates",
   "created_utc": 1695258304,
   "score": 7,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i9pwb",
   "message": "What I hope to have. I don't need sex to be in a happy fulfilled relationship although I know it's not the norm.",
   "created_utc": 1695261423,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i7jyn",
   "message": "Its like living with your best friend as a roommate",
   "created_utc": 1695260493,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i89p0",
   "message": "Sucks",
   "created_utc": 1695260802,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i9b9i",
   "message": "Depends on the reasons. If there are medical reasons and you care about the person you're with you learn to cope with it.",
   "created_utc": 1695261250,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i9f74",
   "message": "Is there anyone here that’s in a sexless marriage that they actually enjoy / still love the person? ( You want to stay with your parents \u0026amp; or it just works for you both for whatever reason)?",
   "created_utc": 1695261296,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ibi6v",
   "message": "Have no clue. Sounds sad \u0026amp; lonely....but the worst kind of lonely bc you're not alone, but yet you are?? Idk.  \n\nDamn.",
   "created_utc": 1695262197,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1icxos",
   "message": "think of having a roommate who gets to tell you what you can and cannot do, that you have to support, and that bitches at you non-stop but if you decide to leave, you have to pay them for years.",
   "created_utc": 1695262829,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1id5vh",
   "message": "I don't see alot of the wife's perspective in these comments so here's mine \nIt's fucking exhausting, I want to have sex, I get horny but I just can't make myself fuck someone who feels like an extra child. Doing thr bare minimum really doesn't do it for me.",
   "created_utc": 1695262928,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1idqwq",
   "message": "My wife and I grew up religious, so we were virgins on our wedding night. Turns out she had some very repressed sexual abuse and on the wedding night all the memories came rushing back and she had a complete breakdown. It took two years before she could really have sex and three years before she could fully relax and find joy in it. This week will be our four year anniversary and I am happy to report that she is 15 weeks pregnant with our first child. Those first years were tough. Sex is dope. But I would go through it all over again for her. She is the love of my life and I am excited for all that is to come.",
   "created_utc": 1695263185,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i0z4h",
   "message": "Not sure but I’m guessing there’s not a lot of sex",
   "created_utc": 1695257727,
   "score": 10,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i4lxg",
   "message": "Remember being 15 a lot like that. Except way more responsibility.",
   "created_utc": 1695259241,
   "score": 7,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i7en7",
   "message": "Excuse my ignorance, but can explain it to me?  I’ve never been married, nor lived with a woman full-time.  Medical conditions, age, and and kids aside, I can’t imagine what it’s like to live with someone, see them naked all the time, sleep in the same bed, and not have sex.  \n\nIs that sex gets old after years of marriage?  Libido ebbs and flows?  I just don’t get it, not even once a week?",
   "created_utc": 1695260429,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ia6wt",
   "message": "Not a marriage but I was in a relationship for one of my partners was asexual and it was just like any other relationship just without sex Not all relationships have to have sex in them We loved each other just like anybody else would",
   "created_utc": 1695261626,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i5wk6",
   "message": "Who are you?? How did you know that? Stay the hell outta my life!  (Jk). 🤣",
   "created_utc": 1695259791,
   "score": 4,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i99hz",
   "message": "This may be hard for some to hear, but sometimes your spouse doesn’t have sex with y’all because you have let yourself go….",
   "created_utc": 1695261229,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i84eq",
   "message": "Infuriating.  Told her I'd go find it elsewhere if she didn't want to show any love.  Divorced a few months later.  Went on a greasy box spree and met my current wife.  Not on the spree, but she's what ended it.  We're affectionate whenever we can, two kids kind of hinders it a bit but we go for at least 2x a week or more.",
   "created_utc": 1695260738,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i62lo",
   "message": "Not as big a deal as ppl think\nWe fuck when we want and are best friends and have each others back no need to bang like we are teenagers just whenever it hits even if it’s months apart",
   "created_utc": 1695259862,
   "score": 10,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1i9wvc",
   "message": "Not I’m one but imagine it’s boring",
   "created_utc": 1695261506,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ibf79",
   "message": "As an asexual reading these comments are making me lose hope",
   "created_utc": 1695262159,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ic5tc",
   "message": "It’s like living with your mum. She bitches when you leave shit around, she bitches when you go out, she bitches about everything and oh yeah no blowjobs…",
   "created_utc": 1695262483,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ickjn",
   "message": "It’s devastating to me.  Sex is an important part of self esteem for a complicated daisy chain of reasons probably related to neglect or abuse as a kid.\n\nWhen we got together, sex all the time.  Pregnancy triggered the start of an autoimmune disorder.  That lead to stress, depression, and brain damage.\n\nShe phased from lower libido, to gray ace, to ace, to sex-averse.  It varies from three months to three years between sex.  During the final shift, there was a year or more where she gaslit me about why no sex.  Maybe I did not move fast enough from a work task.  Maybe she wanted to get ready for bed first and then was too tired.  Maybe an hour of foreplay was moving too fast.  I eventually stopped answering her fake calls for sex which had become “it’s time to sleep”, and I stopped asking, because the rejection was crushing (I have RSD as part of autism).\n\nFrom 2018 to now, 5 times, and only when she felt guilty, and I comforted her over the guilt.  It feels gross after the fact, and has lead to erectile dysfunction, or at least contributes to it.\n\nThe wacky thing is, outside of that, she is awesome.  Perfect match.  We are SO weird, in just the right ways.  Our kids and nieces/nephews are awesome as well.\n\nSo, I’m trapped by love and entanglement.\n\nI had a platonic crush get freaked out after I wrote out to her what we had talked about with affection and love, and that also is a huge weight on me.\n\nI have no romantic/sexual partners, no snuggle buddies, and my life partner and I are basically best friends with a history of sex manipulation and lack of freedom to seek sexual partners.  Even the closeness of the intimate platonic relationship has gotten attention (well, it’s imploded).\n\nThis is probably not typical, but is how far things needed to go before I finally worked around the judgment fears and scheduled my first ever therapy session.\n\nI recommend others not wait so long.",
   "created_utc": 1695262665,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1icvjv",
   "message": "Lonely.",
   "created_utc": 1695262803,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1id96r",
   "message": "Abusive",
   "created_utc": 1695262967,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1idhon",
   "message": "About the same as being single except someone steals the fucking sheets at night",
   "created_utc": 1695263070,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1idkpx",
   "message": "It’s like growing up in the desert, hearing stories of a magical oasis that lies beyond the sand dunes.\n\nYou go out in search of it, and after many years you find it. Your oasis. The thing you yearned for. \n\n***BUT THE OASIS WONT LET YOU FUCK IT***",
   "created_utc": 1695263107,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1idlo0",
   "message": "It's a rollercoaster of emotions. Am I being rejected because I am now yucky? Then comes the hugs and kisses and flirtings, then it js gone again. It's like living with a roommate sometimes, but with I love yous. It is confusing and, gotta admit, a little bit sad 😔",
   "created_utc": 1695263119,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1idv0o",
   "message": "Married 24 yrs. and I'm 54, so It's not that bad. I have a lot more energy for my girlfriend this way.",
   "created_utc": 1695263235,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ie62l",
   "message": "Not bad if you both lack much of a sex drive. My wife and I have been married over 35 years and we are both past 60. The love is stronger than ever but we have not had sex this year. Neither of us is that interested so we are absolutely fine.",
   "created_utc": 1695263371,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ieieu",
   "message": "It's pretty chill.\n\nI have metastatic breast cancer. I'm on a treatment now that blocks all sex hormones. All of them. And I have no uterus or ovaries because of previous endometriosis.\n\nMy husband and I genuinely enjoy being around each other. We hold and cuddle each other, kiss each other whenever we're in the same room (not exaggerating), lavish compliments on each other, and have fun together on a regular basis. We're plenty intimate.\n\nDo I wish we could have sex? Occasionally, in a nostalgic sort of way. Horny just doesn't exist in my world.",
   "created_utc": 1695263529,
   "score": 1,
   "submission_id": "16o1wnl"
  },
  {
   "comment_id": "k1ibd3h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16o1wnl"
  }
 ]
}