{
 "submission_id": "16oe9vw",
 "title": "What is something people think they hide really well, but everyone around them knows what's going on?",
 "selftext": "",
 "created_utc": 1695298342,
 "permalink": "/r/AskReddit/comments/16oe9vw/what_is_something_people_think_they_hide_really/",
 "score": 88,
 "url": "https://www.reddit.com/r/AskReddit/comments/16oe9vw/what_is_something_people_think_they_hide_really/",
 "comments": [
  {
   "comment_id": "k1kgadi",
   "message": "Compulsive lying. I have a family member who will make up ridiculous stories. There’s no way anyone could believe them. But everyone just goes with it",
   "created_utc": 1695306273,
   "score": 163,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lyf72",
   "message": "People who like to \"throw shade\" in a way they think is terribly witty and subtle and that only their close friends and accomplices will notice - never the person they're mocking who is too polite or embarrassed to call them out on it",
   "created_utc": 1695325284,
   "score": 41,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1k3pz8",
   "message": "When they're having an affair with a co-worker. Ma'am. Sir. We see that body language. We feel that tension. We know.",
   "created_utc": 1695301254,
   "score": 253,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1ll9cj",
   "message": "Disinterest. You almost hear the silence echo behind their eyes and placid smiles lol",
   "created_utc": 1695320774,
   "score": 80,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1khfrw",
   "message": "Body odor. \n\nYou get noseblind to it, they don't.\n\nShower and if you need it, wear stuff to help.",
   "created_utc": 1695306702,
   "score": 30,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1m939y",
   "message": "**YOU. SMELL. LIKE. WEED.**\n\nI can smell you from over here. \n\nGrandma.",
   "created_utc": 1695328940,
   "score": 179,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1mfx2e",
   "message": "Meth addiction. Meth heads have themselves fully convinced that they are acting normal. I had to go up to the courthouse last year, and there was a woman that was 90 pounds soaking wet, sores all over her face, track marks on her arm, bouncing off the walls on the high speed chicken feed. She had a little pit bull puppy with her and she insisted on making conversation with the policeman standing by the front door. Then she would put the dog down, and run out of the courthouse so the dog would chase her, get to the road, run back, and presume talking to the cops like nothing had happened. The self assurance was unmatched.",
   "created_utc": 1695331339,
   "score": 13,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lbeqp",
   "message": "I hope it’s not me picking my thong out of my ass",
   "created_utc": 1695317387,
   "score": 71,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1jz5n3",
   "message": "Alcoholism\n\n\n[edit to say how impressed I am at the supportive and constructive dialogues happening below…nicely done, fellow Human Beings]\n\n[2nd edit to say r/stopdrinking is a great place if you feel like you need some support]",
   "created_utc": 1695299181,
   "score": 136,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1jyxlu",
   "message": "Surfing the internet at work",
   "created_utc": 1695299075,
   "score": 111,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1k4964",
   "message": "I'm not happy, I'm just friendly",
   "created_utc": 1695301487,
   "score": 234,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lji8d",
   "message": "When a couple is unhappy in their relationship/marriage.",
   "created_utc": 1695320175,
   "score": 247,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1kuajl",
   "message": "When they try to discreetly fart in public but won't acknowledge it was their fart. I know. I always know.",
   "created_utc": 1695311276,
   "score": 220,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1m3n79",
   "message": "Heavy steroid use. \n\nYou put on 40lbs of lean muscle mass in 30 days taking some \"all natural supplement\" you just happen to be sponsored by? Yeah, okay.",
   "created_utc": 1695327072,
   "score": 212,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1k4lyb",
   "message": "Smoking. People seem to really believe their perfume/aftershave and some chewing gum is covering the smell, but you just smell of a rancid mix of the two.",
   "created_utc": 1695301640,
   "score": 33,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1jy09d",
   "message": "Me after I smoke a fat bowl and show up to the function",
   "created_utc": 1695298634,
   "score": 117,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lef30",
   "message": "I feel like I can always tell when people dislike me despite them trying to be subtle about it",
   "created_utc": 1695318450,
   "score": 224,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lwj6i",
   "message": "Attraction to someone. Even if it’s subtle there are still changes in body language and mannerisms to show it",
   "created_utc": 1695324629,
   "score": 11,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1kp6mt",
   "message": "I was about to say it’s weird how many people are mentioning office affairs. And then realized that anytime I’ve been in an office that had something romantic occurring, eeeeeeverybody knew.",
   "created_utc": 1695309502,
   "score": 43,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lgkos",
   "message": "Looking at boobs",
   "created_utc": 1695319186,
   "score": 255,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1le3d6",
   "message": "How they regret getting married and or having children",
   "created_utc": 1695318335,
   "score": 206,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lzp4a",
   "message": "Autism apparently, according to studies. People can tell something's up, but not exactly what it is.",
   "created_utc": 1695325718,
   "score": 191,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1jzqgu",
   "message": "Bad toupees.",
   "created_utc": 1695299459,
   "score": 168,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1k2p59",
   "message": "Smoking anything, especially weed. No, blowing the smoke through a dryer sheet stuffed in a toilet paper roll will not hide it. Neither will that incense. Everyone knows.",
   "created_utc": 1695300804,
   "score": 213,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1jxm0p",
   "message": "*Place erection joke here*",
   "created_utc": 1695298441,
   "score": 76,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1m9gq3",
   "message": "Being stoned. Sir, it took you a full ten seconds to pick up a spatula when your fried chicken was actively catching fire, a sloth would consider you to have slowed reflexes.",
   "created_utc": 1695329068,
   "score": 80,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1ligsx",
   "message": "Talking about someone nearby thinking they can't hear you. Voice travels probably 3x further than most people think.",
   "created_utc": 1695319826,
   "score": 122,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1jy1tz",
   "message": "Being in a relationship with a coworker. That shit is always obvious when it happens",
   "created_utc": 1695298655,
   "score": 49,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lbkft",
   "message": "These answers all suffer from a type of confirmation bias or selection bias or whatever.\n\nA lot of people have said 'drugs/alcohol' because you have noticed people who try to hide those things. But you probably didn't verify if they really did use drugs/alcohol and you certainly didn't test people who seemed fine to see if they have a drug or alcohol program.\n\nLots of people _really do_ hide their addictions very well. But you wouldn't notice. Experts in the subject, people who study these things, say 'Yeah your loved ones might be hiding a drug problem'.\n\n\u0026gt; We never saw it coming” is a common phrase uttered by parents at Nar-Anon meetings. Recognizing that your loved one, particularly your child, is struggling with addiction can be difficult. It is easy to be blinded by love, to get stuck in denial, or to simply miss the signs\n\nAnd \n\n\u0026gt; Some, such as functioning alcoholics, are so successful at hiding their excessive drinking that they maintain a seemingly normal life ⎼ succeeding at work and keeping up with family obligations, all while consuming dangerous amounts of alcohol.\n\nAnd\n\n\u0026gt; As a concerned family member or friend, it can be difficult to spot a loved one’s problem with drinking if they are going to great lengths to hide it.\n\nEtc etc etc\n\nYou only spot the people who suck at hiding it.  Lots of drug users are successfully hiding it.\n\nOn a personal note, my Mom is a nurse at a hospital and it's not an everyday thing, but they get people who seem fine, who have jobs and families and give off zero 'I am an alcoholic or drug addict' vibes, until they start going into withdrawal.",
   "created_utc": 1695317444,
   "score": 72,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lineo",
   "message": "I'm surprised no one said \"farting\" yet, a lot of people think others don't notice them walk into a room and leave a scent of shit before peace'ing out",
   "created_utc": 1695319889,
   "score": 164,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1khijs",
   "message": "Any form of dating in the office. If its not obvious now, it will be soon.",
   "created_utc": 1695306730,
   "score": 128,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lswrz",
   "message": "Justin Timberlake being high on coke on the Hot Ones released this morning. But no one is talking about it.",
   "created_utc": 1695323380,
   "score": 45,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1jyzwt",
   "message": "being insecure",
   "created_utc": 1695299106,
   "score": 220,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1k5wba",
   "message": "The urgent need to use the facilities. Kids obviously have no game, but adults only think they're more subtle.",
   "created_utc": 1695302189,
   "score": 70,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1kzdez",
   "message": "Judgement. Some people wear their judgement on their sleeve but think they hide it.",
   "created_utc": 1695313022,
   "score": 202,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lqv9y",
   "message": "Shooting up in the bathroom, public or otherwise.",
   "created_utc": 1695322684,
   "score": 39,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1kh0qs",
   "message": "Their eating disorder.  A lot of people try to disguise it as being really into fitness or becoming vegan or having food allergies but when you get so thin that a gust of wind will send you flying, we all know what's really going on.",
   "created_utc": 1695306546,
   "score": 121,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lc131",
   "message": "When they hate someone either out of jealousy OR because that person is too similar to themselves.\n\nGranted, it may be the case that everyone around them realizes it, but they don't.",
   "created_utc": 1695317611,
   "score": 171,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1ltwo6",
   "message": "Office farting.  Yeah we fucking know it's you Trevor",
   "created_utc": 1695323727,
   "score": 65,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1o92y8",
   "message": "When you're trying to be quiet while eating a bag of chips, but your friends can hear you from across the room.",
   "created_utc": 1695359495,
   "score": 73,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1m3wz5",
   "message": "I used to wear shorts in the colder weather because I thought it was cool. I had a couple people tell me that I was obviously cold and to go put some more clothes on. I guess I was shivering too much",
   "created_utc": 1695327165,
   "score": 31,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1n2exr",
   "message": "When people go to the “bathroom” at a bar and it’s clear as day they did a fat key bump of coke in the stall",
   "created_utc": 1695340161,
   "score": 30,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1n3j5g",
   "message": "Scheming.\n\nIt stinks. People may not know what the plan is, but they do pick up on it. It's awful.",
   "created_utc": 1695340622,
   "score": 31,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1k19kn",
   "message": "People talking negatively about someone else.",
   "created_utc": 1695300169,
   "score": 88,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1kodve",
   "message": "\"Losing love is like a window in your heart\r  \nEverybody sees you're blown apart\r  \nEverybody sees the wind blow\"",
   "created_utc": 1695309215,
   "score": 67,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lfq6h",
   "message": "Cokeheads, everyone can tell. You're incoherent and sloppy, but like alcohol it makes you delusional",
   "created_utc": 1695318896,
   "score": 97,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1lpdzg",
   "message": "Baldness. I was going bald and decided to take matters into my own hands and shave it off. Next work day, no one noticed.",
   "created_utc": 1695322176,
   "score": 101,
   "submission_id": "16oe9vw"
  },
  {
   "comment_id": "k1klgaq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16oe9vw"
  }
 ]
}