{
 "submission_id": "16ojq9r",
 "title": "What did you have to learn the hard way?",
 "selftext": "",
 "created_utc": 1695312195,
 "permalink": "/r/AskReddit/comments/16ojq9r/what_did_you_have_to_learn_the_hard_way/",
 "score": 235,
 "url": "https://www.reddit.com/r/AskReddit/comments/16ojq9r/what_did_you_have_to_learn_the_hard_way/",
 "comments": [
  {
   "comment_id": "k1lacr4",
   "message": "The importance of communication in a relationship. It was my first one and I was reluctant to speak up because I didn't want to be known as overly sensitive or dramatic. At the same time I was wracked with anxiety/doubt about the status of our relationship and paranoia about every other girl I saw talking to him.\n\nBF finally sat me down and said something along the lines of \"we have a connection, we don't have a PSYSCHIC connection. If something is bothering you? Tell me. If you don't like something I do...WHATEVER the context? Tell me. If you're uncertain about something? Tell me. If you're feeling concerned about anyone else in my life causing problems? TELL ME. I'd rather deal with it now than have you miserable and pretending everything is ok.\"",
   "created_utc": 1695316998,
   "score": 133,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ky2se",
   "message": "That things can change in the blink of an eye",
   "created_utc": 1695312569,
   "score": 177,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l02q9",
   "message": "Things can go perfectly in a relationship and still end due to other factors, factors out of your control",
   "created_utc": 1695313261,
   "score": 94,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lhgv6",
   "message": "The only one, at the end of the day, who truly cares about your wellbeing, is responsible for ensuring your emotional wellness, and is capable of making you happy... is yourself. Took years of pessimism, deep depression, and random, desperate texts to friends in the middle of the night, that I realized that that wasn't going to make me better, at any point. I wondered why no one like me, well, turns out people don't like people who put out nothing but bad vibes, and latch off of other people like an emotional vampire. Since I've learned to look after myself and manage my needs better, instead of expecting other people to, I've been much better off.",
   "created_utc": 1695319491,
   "score": 43,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lcnvw",
   "message": "That you need to let yourself feel through intentse emotions in their entirety and that running away from pain and grief is impossible.",
   "created_utc": 1695317832,
   "score": 247,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lmspb",
   "message": "That I’ll never have the same relationship with my sister that I had when we were kids.  She lives 2 hours away and visits about twice a year, and always seems to be in a hurry to leave.  When we were young we hung out a lot but I realized when she was leaving at one of her last visits that getting home to her cats was more important than saying goodbye to her niece.  I had a big close family when I was little and now all of us barely see each other, I miss that closeness.  And yes, I’m several drinks deep at the bar in a T.G.I Fridays right now.  It’s a free country.  I get sentimental when I have a drink.",
   "created_utc": 1695321292,
   "score": 147,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1kz5v5",
   "message": "That I have severe depression. I'm going to be honest here and say this might be the hardest thing for me to understand.\n\nEdit: I've read all your comments and I love you all",
   "created_utc": 1695312951,
   "score": 57,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lchjk",
   "message": "Just because you can afford to buy a (used) luxury car, doesn’t mean you can afford to own a luxury car.",
   "created_utc": 1695317771,
   "score": 27,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lgwwc",
   "message": "That it is ok to say no.  Don't set yourself on fire to keep someone else warm.",
   "created_utc": 1695319300,
   "score": 165,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ld2re",
   "message": "The grass IS NOT always greener on the other side.",
   "created_utc": 1695317980,
   "score": 53,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ldg0b",
   "message": "Lift with your knees not your back. If you know you know.",
   "created_utc": 1695318109,
   "score": 55,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ltn01",
   "message": "That no one is coming to save me at the end of the day",
   "created_utc": 1695323632,
   "score": 59,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l1bz2",
   "message": "How to properly use and manage credit cards.",
   "created_utc": 1695313705,
   "score": 163,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1leezd",
   "message": "That another person who claims to love you can suddenly cease for any reason. They don’t owe you anything",
   "created_utc": 1695318449,
   "score": 87,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1llcv7",
   "message": "The less you say, the better your life.",
   "created_utc": 1695320807,
   "score": 83,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l7c0y",
   "message": "Your hard work, long hours, and dedication to your company will not be reciprocated when it comes down to the money",
   "created_utc": 1695315829,
   "score": 151,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l83wi",
   "message": "That letting go is Necessary sometimes. I’ve always struggled with the concept. I hold on to things far too long, and it’s been a detriment to me.",
   "created_utc": 1695316124,
   "score": 76,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1kypzu",
   "message": "Don't pepper-spray yourself (in the balls) just because you want to know what it's like. Edit: I'm okay, the ornaments are okay, everything is okay, I was just unable to feel my crotch and surrounding thighs for a month.",
   "created_utc": 1695312797,
   "score": 107,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l8gdz",
   "message": "Your partner is not your therapist",
   "created_utc": 1695316254,
   "score": 138,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1mhtqw",
   "message": "being sexy isnt everything a guy wants",
   "created_utc": 1695332024,
   "score": 31,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lcei6",
   "message": "Jail sucks",
   "created_utc": 1695317741,
   "score": 76,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lazun",
   "message": "Owning a home involves a ton of upkeep and maintenance",
   "created_utc": 1695317236,
   "score": 57,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l7psm",
   "message": "Just because you’re “friends or family” doesn’t mean you have to tolerate/forgive them for the stuff they do to you",
   "created_utc": 1695315975,
   "score": 43,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lfu7p",
   "message": "Just because you're nice to someone doesn't mean they'll be nice to you",
   "created_utc": 1695318935,
   "score": 24,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lee97",
   "message": "That my money doesn't jiggle jiggle, it folds.",
   "created_utc": 1695318442,
   "score": 59,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1le2le",
   "message": "Don't put more on a credit card than you can afford to pay when the bill arrives.",
   "created_utc": 1695318328,
   "score": 39,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ll0zn",
   "message": "Social skills can get you further in a career than aptitude can.",
   "created_utc": 1695320695,
   "score": 18,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l8k20",
   "message": "If two people are in love it doesn't mean they can be together",
   "created_utc": 1695316294,
   "score": 37,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lfsqs",
   "message": "That even when the relationship is perfect and you’ve never once even raised your voice at them and you do everything perfectly, that they’ll still cheat and rip your heart out with no remorse. Stay frosty, Gentlemen.",
   "created_utc": 1695318921,
   "score": 46,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lfa8q",
   "message": "Some people you think are friends, are not, in fact, friends. It is okay to walk away from one-sided relationships.",
   "created_utc": 1695318745,
   "score": 17,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lpkbm",
   "message": "No matter how nice or polite you try to be, some people just hate you",
   "created_utc": 1695322236,
   "score": 15,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lbnbl",
   "message": "Most people suck",
   "created_utc": 1695317474,
   "score": 55,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l4a1a",
   "message": "That no matter how good you treat your partner, and you think they'd never do you dirty, you'd be surprised. Most people are trash and you go through life learning it the hard way...",
   "created_utc": 1695314742,
   "score": 58,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1laikh",
   "message": "How to manage my money.  My parents taught me NOTHING, in spite of the bad times they had with money, too.",
   "created_utc": 1695317058,
   "score": 15,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lleo6",
   "message": "That just because you don't *blame* a person for their mental health issues and toxic behaviors **does not** mean you are obligated to stay in a relationship with them and suffer.",
   "created_utc": 1695320823,
   "score": 14,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1loegu",
   "message": "That what someone says means nothing if their actions don’t match up.",
   "created_utc": 1695321836,
   "score": 13,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1kyr8d",
   "message": "Working for a living will never make you rich",
   "created_utc": 1695312809,
   "score": 37,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lklxb",
   "message": "Read everything before you sign something",
   "created_utc": 1695320553,
   "score": 12,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lti5q",
   "message": "You can't let your anxiety control your actions. Sometimes, you'll find that confronting the things that give you anxiety, in my case social situations and dating, actually can help reduce your anxiety towards those things in the long run.",
   "created_utc": 1695323586,
   "score": 13,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1kxc84",
   "message": "Don't go down a set of stairs if you can't see your feet.\n\nUnless you like breaking bones.",
   "created_utc": 1695312314,
   "score": 25,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ldzur",
   "message": "Don’t “follow your dream” for post secondary education. Go for the one that will result in a secure job that pays well and isn’t long hours.",
   "created_utc": 1695318301,
   "score": 23,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ldoc4",
   "message": "People let you down",
   "created_utc": 1695318190,
   "score": 11,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ljejc",
   "message": "Don’t go into a relationship with a woman thinking you’ll develop feelings for her.",
   "created_utc": 1695320140,
   "score": 10,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1los2i",
   "message": "I disqualified partners because I did the thinking for them. \"She would never be with me because I want to live in that city.\"\n\nYears later, she found a BF and they moved to that city.\n\n\"She would never be with me since I'm balding and she's into men with long hair.\"\n\nTurns out, years later, she was totally into me and her current BF is entirely bald with no hair growth at all.\n\n\"She would never be with me, I'm too nerdy and introverted for someone so social and outgoing as her.\"\n\nShe then married a guy who she met in WoW and who plays D\u0026amp;D every week. I didn't even know she played MMOs.\n\n\"She [a colleague of mine at the time] would never be with me, she has a long-term relationship with a guy from her own country [Russia] and she would never go for someone like me.\"\n\nShe broke up with that guy, hooked up with a colleague of hers, and now has a child with him.\n\n---\n\nDon't disqualify yourself. Not in love, not in work, not anywhere. Go for what or who you want and be respectful. Take \"no\" for an answer and respect that.",
   "created_utc": 1695321966,
   "score": 10,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l0jgo",
   "message": "That parents are far from perfect people, and sometimes YOU have to support them",
   "created_utc": 1695313425,
   "score": 43,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1kx6ha",
   "message": "Women cheat too.",
   "created_utc": 1695312261,
   "score": 54,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l8l3x",
   "message": "Worked my ass off for a business for 4.5 years and they threw me away like I was nothing. I am now more careful what workplace I give my loyalty to and have realised I have to do what’s best for me. Life’s to short to work for a shit boss or business",
   "created_utc": 1695316306,
   "score": 15,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lpiff",
   "message": "Life can wind up being much shorter than you anticipate. Don't wait for a future that isn't guaranteed before you prioritize your own wants and needs. It took a cancer diagnosis at 24 for me to realize that I could die anytime. I'm good now, but chemotherapy in my mid 20s was not something I planned for and it made me realize I was wasting my time living for other people.",
   "created_utc": 1695322218,
   "score": 8,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lrox6",
   "message": "People who you thought had your back and come to find out they don't.",
   "created_utc": 1695322966,
   "score": 7,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lyct9",
   "message": "HR is not on your side. EVER. They are there to protect the company from lawsuits.",
   "created_utc": 1695325261,
   "score": 9,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lhnwx",
   "message": "Being a top performer at your job wont get you any benefit instead you'll get sent to underperforming areas to improve them. Bare minimum is enough",
   "created_utc": 1695319557,
   "score": 25,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lklbi",
   "message": "Women can be abusive as much as men can",
   "created_utc": 1695320547,
   "score": 14,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lw2sp",
   "message": "I don't think a lot of people have learned this lesson in life as of yet. 99% if the people you meet in life don't give 2 shits about you, not the way you look, act, talk and the hardest for people to understand. they 1000% don't give a fuck about your feelings. make yourself happy and who cares about what others think?",
   "created_utc": 1695324470,
   "score": 6,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lwpme",
   "message": "To stop trying to fill my cup from an empty well. \n\n (Continuing to return to toxic people. Finally learned the hard way how to cut out the bad relationships that don't serve me.)",
   "created_utc": 1695324692,
   "score": 7,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lbkeh",
   "message": "“Do something while there’s still a chance, because that chance doesn’t last forever. Trust me, sherlock, it’s gone before you know it. Before you know it!” - John Watson\nSherlock, S04E02, 1:19:50\n\nThat",
   "created_utc": 1695317444,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lt0hr",
   "message": "You'll spend time with some people and eventually realize you never really liked them in the first place.\nI'm mostly talking about acquaintances/friendships here, not romantic.",
   "created_utc": 1695323416,
   "score": 7,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l9e0l",
   "message": "Your car gets repossessed, you are not absolved of the debt.  After auctioning it off they came after me for the difference and sued me.  Ended up having to pay $6,000 through garnished wages over 18 months, which ironically was nearly double the original car payment.  All for a car I no longer had, whilst making payments on the new car I had to get to replace the one I'd had taken, with a higher car payment due to now having bad credit!  Very hard lesson in financial responsibility.\n\nTook me about 5 years to get my credit back into a healthy place.",
   "created_utc": 1695316624,
   "score": 10,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l3qg9",
   "message": "Working with children is not that easy",
   "created_utc": 1695314554,
   "score": 11,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lnejr",
   "message": "There is no substitute for putting in the hours.\n\nNo matter how good you are, or smart you are, or talented you are, at a certain point you have to buckle down and put the work in or you get nothing.",
   "created_utc": 1695321498,
   "score": 9,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lf9vh",
   "message": "Dont get in debt!",
   "created_utc": 1695318741,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1llhth",
   "message": "That there is no God and if there was He wouldn't be considered a very good father by todays standards",
   "created_utc": 1695320852,
   "score": 6,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ltbe0",
   "message": "People don't care People suck. \n\nIf you don't have money or connections it's very difficult to do some things/ work some jobs.\n\nAlso don't pour water in burning oil.",
   "created_utc": 1695323521,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lw4o3",
   "message": "That sometimes not having expectations for someone is the only way to love them. My dad was a true POS dad. He was an addict and cared very little for his two (maybe 3) children. He almost never was there for us and when he was it was a very mixed bag of affection and fear. I hated him for a very long time. I had just wanted him there for me. When I got older and found out he was dying I just... let it go. I didn't rush to his bedside or anything but I let my expectations for him to. It let me look back on the good times, and there were really good times, and let me grieve who I wanted him to be.",
   "created_utc": 1695324488,
   "score": 6,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lwn95",
   "message": "when someone offers you a drag off their cigarette, don't say yes 🥲",
   "created_utc": 1695324669,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1m0dd4",
   "message": "That blood is almost never thicker than water. I have more people who aren’t family, that care about me way more than my family my ever did.",
   "created_utc": 1695325951,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1m0ra0",
   "message": "People don't change whatsoever.",
   "created_utc": 1695326081,
   "score": 6,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1n75lb",
   "message": "People who owe you thousands of dollars can just declare bankruptcy and then they don't owe you shit, even if they're still rich.",
   "created_utc": 1695342096,
   "score": 6,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l2n2t",
   "message": "Caring for your health is just as important for an 18 year old as it is for a septagenarian.",
   "created_utc": 1695314165,
   "score": 8,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lg8gu",
   "message": "no one actually cares about you.",
   "created_utc": 1695319071,
   "score": 25,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lfbqw",
   "message": "Everything. I have adhd.",
   "created_utc": 1695318759,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lfoht",
   "message": "The horrors a human being is capable of to fellow human beings. I've seen some awful stuff overseas.\n\nBut with every evil, there is a good. There are so many wonderful and amazing people in this world that absolutely balances, or even tips the scale against those horrors. It's just that the evil always hogs the megaphone",
   "created_utc": 1695318879,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lhu8y",
   "message": "you can NOT in fact launch yourself by shooting fireworks at your feet in minecraft",
   "created_utc": 1695319615,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1liov8",
   "message": "If a date tries to move the relationship a little too fast, and is a little too pushy early on, RUN.",
   "created_utc": 1695319902,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lj6up",
   "message": "Friends are mostly useless as they will just discard you when you’re out of sight. Just sucks because I’m not that way and I can’t understand why everyone else so consistently sucks",
   "created_utc": 1695320071,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lj7ff",
   "message": "Don't date coworkers",
   "created_utc": 1695320076,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lkd7j",
   "message": "How to be a good husband; I'm still learning and relearning but it's been a sharp[er] climb given that my father checked out at an early age. The onus for change is on me, but learning by **not** doing what he did, it's been fucking hard.",
   "created_utc": 1695320469,
   "score": 2,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1loxmy",
   "message": "Don’t punch inanimate objects when you’re mad. Your hands are precious.",
   "created_utc": 1695322020,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lpjgd",
   "message": "People who you think are nice acquaintances or friends could very well be lying to your face because they want something out of you. That shit doesn't stop when you become an adult. We live in a world where everybody is always trying to come out on top, even if it means quashing somebody who thought they were your friend. Obviously there are those who are your true companions, the people who love and care about you and want whats best for you, but \"good friends\" have no issue tossing you aside if they can benefit from it.",
   "created_utc": 1695322228,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lqrx1",
   "message": "You can either die a hero or live long enough to become the villain",
   "created_utc": 1695322652,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ls6m3",
   "message": "That bees don’t like to be pet\n\nI was a dumb kid",
   "created_utc": 1695323135,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lsjug",
   "message": "My mom is a bad person",
   "created_utc": 1695323257,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1ltc44",
   "message": "That words mean so very little. A person can tell you they love you every day and then show you the opposite, treat you with disdain and blame you for how they treat you and tell you how wrong you are every day. But then they “love “ you. I won’t ever buy words, I’ll only consider actions",
   "created_utc": 1695323528,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lw5ao",
   "message": "I was in my late thirties when I realised that I wasn't just a person everyone wanted to beat on. I was an abused child, and it seemed that i was beaten in every relationship I had. One day it just came to me that it wasn't an immutable inner characteristic of nature to be abused, it was the type of man I was choosing. It was such an epiphany to realise that I was attracted to abusive people. It was my choices, not my basic personality, that was causing this. I began looking at the people I chose to spend time with, and started looking for what they had to offer me in terms of shared interest and happiness. It changed my life. I now fully believe that I wasn't born to be abused because of who I am, and it's very freeing.",
   "created_utc": 1695324495,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lwddv",
   "message": "Don't do drugs",
   "created_utc": 1695324572,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1m3q0x",
   "message": "That it's okay to let people go. People change. Their behavior towards you change. And it's okay. You can try, but if they're just not there for you...it's time to let go. I have seen so many friends in my life just come and go.. sometimes it gives me anxiety, but I'm constantly reminding myself that it's absolutely okay. They have their journey..if they want to..they can always find a way back to me. Until then, I'll focus on myself and people who are there for me right now.",
   "created_utc": 1695327099,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1mrldw",
   "message": "When the doctor say lose 10 lbs because you're pre-diabetic; lose those 10 pounds. I am now a diabetic.",
   "created_utc": 1695335717,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1mxejj",
   "message": "Just because you’re good friends doesn’t make you two good roommates. Also, don’t let anyone borrow more money than you’re willing to lose, I’d go so far as to say not to let anyone borrow any money at all, only give a gift. Money can really ruin friendships",
   "created_utc": 1695338096,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1mxjg4",
   "message": "The value of a dollar. I have made some very, very dumb financial decisions in my adult life which had left me feeling extremely stupid, stuck and irresponsible.\n\n\u0026amp;#x200B;\n\nA message to everyone: Figure out and budget that works for you, AND STICK TO IT! When the money is gone, the money is gone. Please be responsible and take care of yourself and your finances. It may not always be an easy adjustment, but it will be worth it.",
   "created_utc": 1695338153,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1mz8f6",
   "message": "There are narcissistic assholes out there in the world who will take advantage of your kindness if you let them. They don't care about the amount damage they do to you, your mentality and your life as long as they get what they want. \n\nAnd do not spend a second thinking they will turn around and take responsibility for their mistakes. They will never do it out of good faith, but only if they are forced to. \n\nI would save myself from a lot emotional pain and loss of money if I were not so naive in my early 20's.",
   "created_utc": 1695338849,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1mzyyx",
   "message": "Not to help out friends financially unless you are 100% sure of who they are and how they act during tough times. \n\nThis year my wife and I took in one of her childhood friends as our roommate, with the promise she would get a job.\n\nShe worked for 1 month, quit, and had an absolute meltdown when I gave her an ultimatum 7 months later about getting a job to the point we had to call the police because we didn't feel safe with her in the house.",
   "created_utc": 1695339156,
   "score": 4,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1n8akt",
   "message": "To stand up for myself to end a pattern of abuse.",
   "created_utc": 1695342558,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l2q2f",
   "message": "Set a value for everything in your life, a price where you would absolutely walk away and stick to it.  It can be money, sanity, experiences, whatever.",
   "created_utc": 1695314195,
   "score": 7,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1kxobk",
   "message": "Never cook your meat frozen.",
   "created_utc": 1695312429,
   "score": 9,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1l4yn7",
   "message": "“Don’t stick your dick in crazy”",
   "created_utc": 1695314983,
   "score": 15,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1luz4r",
   "message": "When dating (or life in general), never hold back on your personality. Always be yourself.",
   "created_utc": 1695324091,
   "score": 5,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lcpdg",
   "message": "Everybody lies.",
   "created_utc": 1695317848,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lfz2s",
   "message": "When a narcissistic compulsive liar such as @lalaaluvv  LT betrays you and used you and convince herself that she wasn't at fault when you tell somebody you love them and then go and move in with another dude who is a sex offender violent domestic heroin user and has no intentions whatsoever of having her best interest that's what I learned the hard way",
   "created_utc": 1695318982,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lg4mu",
   "message": "I had to learn that sometimes people just do not like me, and I had to learn to be okay with that.  For years I would go out of my way to try to people-please and make everyone happy in my work life and my personal life.  It was so detrimental to my own well-being as well as my time.  It was a hard lesson to learn.",
   "created_utc": 1695319034,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lipvl",
   "message": "Live the moment and stop thinking so much about the future. Your life can change in an instant and all those plans you made and spent so much time overthinking and stressing about just fade away in an instant. \n\nIf your parents love you, listen more to them. Experience in life does give them some edge. \n\nNever rush into a relationship unless you feel that exciting spark.\n\nBe yourself even if it means you're alone. \n\nLearn to say \"No\" and don't be afraid to disappoint people just because you're doing what's good for you.",
   "created_utc": 1695319912,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1lksst",
   "message": "Even if you're always nice to people, people will not always be nice to you.",
   "created_utc": 1695320617,
   "score": 3,
   "submission_id": "16ojq9r"
  },
  {
   "comment_id": "k1mnzge",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16ojq9r"
  }
 ]
}