{
 "submission_id": "16olcmf",
 "title": "What is the pettiest reason why you wouldn’t date somebody?",
 "selftext": "",
 "created_utc": 1695316336,
 "permalink": "/r/AskReddit/comments/16olcmf/what_is_the_pettiest_reason_why_you_wouldnt_date/",
 "score": 132,
 "url": "https://www.reddit.com/r/AskReddit/comments/16olcmf/what_is_the_pettiest_reason_why_you_wouldnt_date/",
 "comments": [
  {
   "comment_id": "k1ltrqd",
   "message": "\"If a woman has a horse in her dating profile, you will never be more important than that horse.\"\n\n\u0026amp;#x200B;\n\n(It may be petty, but it's backed up by personal experience).",
   "created_utc": 1695323679,
   "score": 241,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lel7j",
   "message": "If they have my sister's name. I'm not saying my sister's name during sex.",
   "created_utc": 1695318506,
   "score": 58,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1ma3ui",
   "message": "If they have “💵😛📈✈️” or some shit like that in their bio. Just seems like some scammer or Ponzi scheme shit.",
   "created_utc": 1695329288,
   "score": 188,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mbh6s",
   "message": "Because her eye was twitching while we were talking to each other.  I was a dumb freshmen in college.  This girl was super attractive, smart, and we got along great.  For some unfathomable reason this made me want to not talk to her again.  \n\nLater it dawned on me that it was during finals and she was heavily caffeinated and that can be a side effect.  She dodged a bullet because I was a complete dingleberry lol",
   "created_utc": 1695329757,
   "score": 244,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m4eii",
   "message": "Not me, but I had a friend who wouldn’t date this guy because he had one crooked tooth. He was the nicest guy truly a wonderful person. Like if I hadn’t been in a serious relationship I would’ve dated this guy. \n\nFast forward he meets a wonderful woman and they get married my friend was all weird about it I asked why and she said “well I thought he liked me enough to get his twisted tooth fixed” \n\nIt was the silliest thing I’ve ever heard.",
   "created_utc": 1695327332,
   "score": 78,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m73hv",
   "message": "I will never date/fuck another Anthony ever again. I’ve dated/relationshipped three different Anthonys at three different ages and they all turned out badly.\n\nETA: From these replies it looks like any time one dates multiple people with the same name, it’s a bad idea! Everybody’s responses cracking me up. 😂",
   "created_utc": 1695328259,
   "score": 231,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mcmaa",
   "message": "I briefly dated a young woman who was insanely out of my league. People stared when we went out. Anyway, her voice was like minnie mouse, and I just couldn't take it. I still feel bad about that one.",
   "created_utc": 1695330155,
   "score": 229,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lysp3",
   "message": "My cat said hello to her and she didn't say hi back",
   "created_utc": 1695325413,
   "score": 127,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lcfm3",
   "message": "They slurp when they drink or smack when they eat",
   "created_utc": 1695317752,
   "score": 63,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1ln2q2",
   "message": "Audibly scraped their teeth on metal silverware with every bite they took.",
   "created_utc": 1695321387,
   "score": 52,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mc0zv",
   "message": "If they’re into conspiracy theories. I dated a guy who was and it consumed his life. It’s all he talked about. I couldn’t even watch a movie with him because he would talk through the whole thing about how it relates to certain conspiracy theories….  And he’d spend hundreds of items he needed in case we ever got attacked by “skin walkers”…..Never again.",
   "created_utc": 1695329948,
   "score": 76,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lsk71",
   "message": "If they’d date someone like me, then it’s off \n\nI can’t trust someone so obviously judgment-impaired",
   "created_utc": 1695323260,
   "score": 219,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lbqlw",
   "message": "If they mention astrology more than once in their dating profile.",
   "created_utc": 1695317506,
   "score": 101,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mpi70",
   "message": "His mouth was shaped like a trapezoid when he talked. Couldn’t unsee it anymore.",
   "created_utc": 1695334895,
   "score": 71,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lxhlo",
   "message": "Someone who has to record everything \u0026amp; post everything daily on social media",
   "created_utc": 1695324959,
   "score": 145,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1laq3k",
   "message": "They shared same name as someone I don’t like.",
   "created_utc": 1695317136,
   "score": 247,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lu1dg",
   "message": "Their belly button sticks out. They're so gross looking to me that it's an instant turn off.",
   "created_utc": 1695323773,
   "score": 185,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mih2d",
   "message": "I broke up with someone because his kid was bad as fuck. I refuse to date someone who can’t control their kids. \n\nAnd by mad I mean at 6; cursing up a storm, running all over Sheetz with a bag of popcorn in his mouth thag he didn’t even end up getting (this was shortly after the virus restrictions ended) \n\nAnd if you have baby momma drama; I won’t date you. I now it sounds petty, but I don’t have daddy drama so I’m not about to deal with yours either.",
   "created_utc": 1695332261,
   "score": 128,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lf9fj",
   "message": "She said she, \"had to go tinkles\" on our blind date.  Never contacted her again.",
   "created_utc": 1695318737,
   "score": 54,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lt7k1",
   "message": "I dumped a girl in middle school because i didn’t want to buy her a christmas gift 🧐",
   "created_utc": 1695323484,
   "score": 195,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lyiiz",
   "message": "Wasn't me, but a female friend broke up with a guy because \"his allergies were a sign of weakness.\"  \n\n\n\nYea, I responded the same way you did.",
   "created_utc": 1695325316,
   "score": 170,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lc1se",
   "message": "I have a friend who stopped dating someone because he found out they were lactose intolerant.\n\nHis example of why was, what if I taste a really great dessert, and I want to share the experience with her, and she can’t even taste it.",
   "created_utc": 1695317618,
   "score": 157,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1ldfe9",
   "message": "He'd briefly dated my ex best friend (after our friendship ended, and when they were like 15). Even though it'd been like four years since at the time, I wasn't gonna be caught dead taking her sloppy seconds.",
   "created_utc": 1695318103,
   "score": 243,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mobsy",
   "message": "She wore fake glasses with no lenses in them and that just seemed like a gigantic red flag",
   "created_utc": 1695334443,
   "score": 106,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lxxr1",
   "message": "Trash in the floor of their vehicle.   I'm not saying that their car has to be spotless.  But I'm out if you can't take the time to at least keep the food wrappers and cups thrown away.",
   "created_utc": 1695325115,
   "score": 120,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lnq90",
   "message": "Petty?  My first name is Roxanne.  Any guy who screeches \"Roxanne!  You don't have to put out the red light\" in public then asks me on a date is going to be rejected.  The song is about a prostitute.  Why would that seem like a good idea?  Completely petty but I've never regretted it.",
   "created_utc": 1695321609,
   "score": 69,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lbi1l",
   "message": "Could never date a smoker.",
   "created_utc": 1695317419,
   "score": 105,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lnoao",
   "message": "Being a white guy with a deep love of Japan, has wall swords, only watches anime and just so deep into everything Japanese.",
   "created_utc": 1695321591,
   "score": 82,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1n4k81",
   "message": "He wore the same shirt on both of our dates. \n\nGet this, years later, I get into the elevator at work and he's there. IN THE SAME SHIRT.",
   "created_utc": 1695341047,
   "score": 41,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m8kp0",
   "message": "If they have a gummy smile. Uppercase gums with lowercase teeth.",
   "created_utc": 1695328763,
   "score": 233,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lc3gg",
   "message": "They use spaces instead of tabs",
   "created_utc": 1695317635,
   "score": 118,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lp56z",
   "message": "Long nails. I don't know why I hate them as much as I do I just know I hate them.",
   "created_utc": 1695322092,
   "score": 168,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m9uv1",
   "message": "I have 2.\n\n1. They golf.  I hate golf.  I haven't golfed in more than 30 years.  \n2. If they love Country Music.  I HATE country music.  I'm not going to try to share my life with someone that LOVES something I hate and vice versa.",
   "created_utc": 1695329202,
   "score": 187,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mpwgl",
   "message": "I wouldn’t date this girl because of here eye colour it was like a really light green but when she looked at you it felt like she was looking into my soul",
   "created_utc": 1695335049,
   "score": 30,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mbmgk",
   "message": "I broke it off with a guy that ordered water and then stole soda from the self serve station. It was the grossest example of being cheap. Keep in mind he was a grown man with a good job.",
   "created_utc": 1695329808,
   "score": 107,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lxr6y",
   "message": "if they chew with their mouth open. or do that thing where they breathe really loudly out of their nose while eating",
   "created_utc": 1695325052,
   "score": 58,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lweg0",
   "message": "I one time brought this girl back home. And she helped herself into my chinchilla cage!!! Bitch he don’t know you!… never heard from me again",
   "created_utc": 1695324583,
   "score": 27,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mcirp",
   "message": "When they use their dating profile to complain about past relationships. But \"subtly\". Like \"I don't date liars, cheaters, back-stabbers...!!!!\" or something along those lines",
   "created_utc": 1695330121,
   "score": 72,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m264e",
   "message": "They post hunting photos... it's not even because I'm against hunting; I just hate seeing the lifeless bodies aimed to try and impress, like a house cat bringing a dead mouse over.",
   "created_utc": 1695326562,
   "score": 101,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m6vm6",
   "message": "He says \"I seen\". Petty? Perhaps. Grammatically messed up, absolutely.",
   "created_utc": 1695328183,
   "score": 64,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mm69f",
   "message": "If you don't have a good job. I honestly got so sick of just dating these men with either no job (I supported them) or crappy jobs where they were going nowhere. Then I met my husband and having an equal partner with a good job makes things so much different. Splitting things equally and having someone with the means to take care of me has changed my life. \n\nI remember dating my ex and being so stressed out when I got furloughed because I didn't know how tf we were going to make our rent or feed our cat. Now, if I were to lose my job tomorrow, we would be fine. \n\nI think people say that money doesn't matter, but stability does. Having someone who can provide stability for me has been life changing. Money does play a role and having a good job is a part of that. \n\nAnother thing is that my husband is passionate about his job and that is why he does well. Sure, he has bad days, but overall he is a very positive hardworking person. That just changes how I feel too not being surrounded by the constant negativity of someone who hates their job but refuses to do anything about it.",
   "created_utc": 1695333620,
   "score": 22,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1ljrnr",
   "message": "She was always using the word “infer” when she obviously meant “imply”\n\nShe actually owned a copy of “Joe Dirt” on DVD\n\nOne of her earlobes was just a little tiny bit too big",
   "created_utc": 1695320265,
   "score": 86,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1low3m",
   "message": "She eats her peas one at a time! You've never seen anything like it. It takes her an hour to finish them.  I mean, we've had dinner other times. I've seen her eat corn niblets, but she scooped them.",
   "created_utc": 1695322005,
   "score": 98,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mbdyl",
   "message": "i didnt date a girl i really liked because i couldnt get over the 90’s raver shoes she wore.",
   "created_utc": 1695329726,
   "score": 41,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lt0ew",
   "message": "If a girl can’t go to Cedar Point and at least try one big roller coaster, then I don’t want anything to do with her.",
   "created_utc": 1695323415,
   "score": 67,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mbh0w",
   "message": "Being named Katelyn but not spelling it the way I just did.",
   "created_utc": 1695329756,
   "score": 49,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1ltykj",
   "message": "\"I'm an empath\".",
   "created_utc": 1695323746,
   "score": 59,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1l9fxa",
   "message": "They don’t put water on the toothpaste before brushing.",
   "created_utc": 1695316645,
   "score": 127,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lwqba",
   "message": "She had ugly feet...like...really ugly feet...",
   "created_utc": 1695324699,
   "score": 27,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lxfnw",
   "message": "Littering. Someone litters while on a date I'm ghosting them",
   "created_utc": 1695324940,
   "score": 29,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lktfi",
   "message": "If they are religious, I just can't date them.  I guess that is probably the pettiest.  Others are, smoker, not very smart, obese/unhealthy, horoscope consultors, paranormal investigators and so on and so forth.  I live in a very small town in the south so it should come as no surprise to learn that I am single.",
   "created_utc": 1695320622,
   "score": 142,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lugbg",
   "message": "They put the toilet paper on the wrong way… drives me crazy",
   "created_utc": 1695323917,
   "score": 91,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lo39q",
   "message": "[deleted]",
   "created_utc": 1695321731,
   "score": 57,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mkpqi",
   "message": "Bruh y’all downvoting ppl for putting their pettiest reasons lmao it’s MEANT to be petty.",
   "created_utc": 1695333082,
   "score": 69,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lvovz",
   "message": "Because they had an OF dedicated to squishing random things with her feet. They were really nice as a person but nah, couldn't get past it even though what they did was 100% harmless",
   "created_utc": 1695324336,
   "score": 45,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m0h6p",
   "message": "If they have a photo of their truck or car in their profile. It’s one thing to really like your car. However I found that guys who have a photo in their profile REALLY like their car. To the point where I would question who was more important in their life, their partner or their car.",
   "created_utc": 1695325987,
   "score": 24,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m8gdn",
   "message": "Do people not understand what the word petty means? I would never date someone who is a New England Patriots fan and I'm not even a huge sports/football person. That's petty.",
   "created_utc": 1695328723,
   "score": 23,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lth1j",
   "message": "Her insecurity.\n\nThe message on my phone, if I don't answer says \"Hi, this is Adddicus. I am available to take your call, but I'm trying to avoid someone, so leave a message at the beep and if I don't call you back, it was you.\"\n\nSo, I get a message from this woman with whom I had had two dates. She was cute, but I really was not ready for any sort of relationship, having been recently divorce. Anyway, the message she leaves is basically \"It's not me is it? You're not trying to avoid me, are you? Are  you?\"\n\nMy message is just supposed to be a joke, but she took it very seriously and I just couldn't deal with her after that.",
   "created_utc": 1695323575,
   "score": 68,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m1lx0",
   "message": "They do duck lips in their photos.",
   "created_utc": 1695326369,
   "score": 10,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lvyad",
   "message": "Sock shoe sock shoe",
   "created_utc": 1695324426,
   "score": 32,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lg2au",
   "message": "Non-lobed ears",
   "created_utc": 1695319012,
   "score": 47,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m8w86",
   "message": "If ya don't like snuggling while we sleep for the night, we may as well just not be together.\n\nAfter a while of sleeping over, my ex suddenly says she doesn't like sleep snuggles and I was actually blown away.\n\nThat wasn't what broke us up, but in hindsight it was one of the first signs she fell out of love.",
   "created_utc": 1695328873,
   "score": 52,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1m13m2",
   "message": "\"Must be taller than me\" even if I am taller than those girls, hard pass",
   "created_utc": 1695326197,
   "score": 10,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lfg7h",
   "message": "their smell",
   "created_utc": 1695318801,
   "score": 28,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mabau",
   "message": "They’re from Connecticut",
   "created_utc": 1695329360,
   "score": 27,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1lszxt",
   "message": "If they happen to share the exact same first name as my ex. It will feel too weird",
   "created_utc": 1695323411,
   "score": 21,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1mj65b",
   "message": "She keeps asking questions during movies. Like mf I don’t know I haven’t seen it either",
   "created_utc": 1695332514,
   "score": 18,
   "submission_id": "16olcmf"
  },
  {
   "comment_id": "k1nqos7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16olcmf"
  }
 ]
}