{
 "submission_id": "16p6yg2",
 "title": "Former pornstars, what made you quit?",
 "selftext": "",
 "created_utc": 1695379361,
 "permalink": "/r/AskReddit/comments/16p6yg2/former_pornstars_what_made_you_quit/",
 "score": 181,
 "url": "https://www.reddit.com/r/AskReddit/comments/16p6yg2/former_pornstars_what_made_you_quit/",
 "comments": [
  {
   "comment_id": "k1qezxc",
   "message": "Male porn actor here. Bottom line is that it was no longer worth it. I dunno how to better phrase this but the mental excitement of getting to have sex with porn actresses really died off somewhere along the way. The money was *okay* but thanks to being in porn I've lost jobs, friends, and even girlfriends who found out.",
   "created_utc": 1695400500,
   "score": 137,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1pn0uj",
   "message": "It was exhausting. A 11-15 minute video is almost 2 hours of shooting. The schedule was crap. The pay wasn't awful, but I make better now.\n\nThe only way to survive the business as a male is to either go the gay route or get signed and make money off your image rather than the videos themselves. Neither of which I was capable of doing. \n\nYou either invest your whole life in it and make it a career or you find something else to do before your cock wears out(this is a legit thing).",
   "created_utc": 1695390297,
   "score": 67,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1r9t1g",
   "message": "Male porn actor here, Took a fart to the eyes one day during filming, words cannot decribe it but I had the absolute most PAINFUL pink eye I’ve ever had, that being said, I’m an IT Business Analyst Now",
   "created_utc": 1695411516,
   "score": 172,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qwyg6",
   "message": "My buddy did OF, Butlering and other kinda sexual gigs here and there.\n\nHe quit because he took notice that he was harboring hate against women. Turns out being objectified daily by various married women, many of whom requested services despite being monogamous, just turned him right off to the point where he was having violent thoughts.\n\nMight be worth noting he had been cheated on before - but in any case, he hated his client base so he decided the money wasn't worth it. He also experienced a bit of existential dread due to the lack of meaning in his work.",
   "created_utc": 1695406915,
   "score": 186,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1p1xg5",
   "message": "Former female creator here. I was never a legitimate porn star, but I was mildly popular producing my own free explicit content on this account. This is why my account has over 100k post karma. I had 30 thousand Reddit followers and 3 mil total views on my redgifs account. Hell, I was one of the top content creators of *all time* on r/rapefantasies and a few more kink/fetish subreddits. So I was small, but still had hundreds and thousands of people engaging with my content daily. Sounds cool, right?   \n\n\nWell, I went too far with it, like I always do. I became hooked on posting content, constantly responding to every single comment and message I got. It consumed my life. I dropped out of university because I wasn’t going to classes. I hid from and avoided my boyfriend, family and friends for days (sometimes weeks). I didn’t have a job (unfortunately when I did have a job, I would watch porn, sext and sometimes even make content during my shift). I literally didn’t even clean my apartment during this time, lol. I lived in chaos. All I did was masturbate, make content and sext. There are some moments where I spent literally *days* awake masturbating until I became sore, exhausted and tired. I am not joking - I would go up to three days without sleep so I could masturbate and sext. I was raw, sore, ashamed, disgusted and in mental *and* physical pain. Also, being awake for three days straight WILL make you psychotic (visual and auditory hallucinations). No, I wasn’t on drugs, I was just addicted to edging, content and sexting. Not to mention all the fucked up kinks and fetishes I would post that I feel were personally unsafe, dangerous, amoral or shameful. I spent months/years wasting my life dissociating while masturbating and sexting strangers.   \n\n\nNo one in my real life knew I was struggling this much. I’m unfortunately great at hiding and compartmentalization. I have struggled with irl sex addiction \u0026amp; prostitution in the past, which was even more scary, but I wasn’t ready for help then. However during this particular episode, I finally admitted to myself I was a sex addict and checked myself into SAA and sex addiction therapy. Now all my previous content and comments are gone, which literally took me *days* to delete because there was so much, lol. Glad I am out of the content cycle now.",
   "created_utc": 1695380200,
   "score": 167,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1q8saa",
   "message": "I knew someone who was an online content creator. She was pretty successful on OF and I think some kink website? She lived alone and most of her expenses went to buying material to “use” for her content. Her boyfriend did not know, shockingly, she was so incredibly desperate to make sure he didn’t find out. Among all the mistreatment she got online and IRL, he was her ray of light. And on the day he did, he broke up with her, which actually made something snap in her. \n\nShe tore down her pages, blocked and deactivated everywhere, and spent the rest of her time “purifying” herself, going to church, repenting her sins, trying to rebuild herself into a pure woman. She stalked him and eventually got RO’ed. Last I heard, she’s an advocate against porn and women “whoring” themselves out. Really sad. I think if she was honest upfront, none of this would’ve happened.",
   "created_utc": 1695398300,
   "score": 31,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qmhas",
   "message": "I am waiting for Johnny Sins the legend to reply to the subreddit post.",
   "created_utc": 1695403163,
   "score": 8,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1rtypv",
   "message": "I was a dominatrix, did porn, and did  fetish modeling. Long story short, lost myself along the way. Don’t get me wrong I had a ton of fun, but now I work in a very different field(kinda like the movie Office Space) and not many people know about my past life. \n\nIt’s hard getting out of the industry because the money was amazing for me. So going to less pay, more hours, and doing school is brain numbing. But here I am, I made it out on the other side. The grass isn’t greener though, it’s just different turf.",
   "created_utc": 1695419106,
   "score": 211,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qhzkf",
   "message": "got into a monogamous relationship",
   "created_utc": 1695401557,
   "score": 237,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qjz6g",
   "message": "Asshole got so loose,kept shittin while i sneezed. That was my cue to leave the industry…..",
   "created_utc": 1695402265,
   "score": 33,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qv0is",
   "message": "I was never a porn star but had a friend who created content and was in a couple of videos.. one of them being ghetto gaggers. I tried to convince her NOT to do that but she was so desperate for the money and just didn’t care anymore. That pretty much broke her. She got tired of being objectified and became suicidal. In the end she’s doing great now. Married with a beautiful daughter but in the end the money wasn’t worth her sanity and body.",
   "created_utc": 1695406215,
   "score": 7,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1pob8x",
   "message": "It was a pain in the ass",
   "created_utc": 1695390810,
   "score": 154,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qkqik",
   "message": "Not an actor but the first person I(34M) had sex with when we were kids— moved to the US— Atlanta; he got into gay porn and contracted HIV— and died a few years later in his VERY early 20s.",
   "created_utc": 1695402538,
   "score": 84,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1s6yhp",
   "message": "Had a friend who did porn.   It wrecked every relationship she had.   Every guy who dated her always said they were cool with it, it was her job, etc..  \n\nAny fight they’d have?  Boyfriend would throw her job in her face.  “Well you’re a fucking whore!” etc..  in case you don’t get it, they were not cool with it.  But she was really hot so….\n\nShe also got into coke pretty bad, had a mental breakdown.   \n\nShe eventually quit because she hit rock bottom.   Vids are still out there, and she hasn’t been the same since, also her nose is kind of fucked up from the cocaine and Botox.    But she is in a stable relationship for 3 plus years which for her is a record.  I don’t know if the guy is aware of her porn past.  \n\nIt was super easy money, and she’s a ridiculously good looking girl, so do the math.  She started at 19.",
   "created_utc": 1695424404,
   "score": 82,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qn9sr",
   "message": "I guess it's not that profitable. Aren't there several documentaries on how the average girl has a shelf life of 3 to 6 month in the biz. after which you can either \"specialise\" and start stuffing household items into your orifices, get beat up for money and pretend that that's your thing (aka the kink.com route) or just call it quits?",
   "created_utc": 1695403442,
   "score": 150,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qlv76",
   "message": "My co-workers were dicks.",
   "created_utc": 1695402944,
   "score": 154,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1ps5q4",
   "message": "Having to clean all the cages and put the sick ones down.\n\nWait, am I in the wrong thread again?",
   "created_utc": 1695392302,
   "score": 140,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qgb42",
   "message": "Adam22 gave them an STI...",
   "created_utc": 1695400965,
   "score": 69,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qktyy",
   "message": "Friend of mine quit OnlyFans because people she knew were screenshooting and sending anonymous emails to her family, her (other) job, her friends, etc. She got sick of people she knew \nseeing her stuff and having it affect her real life. Sucks because I think that's kinda common knowledge, don't do anything online you don't want to haunt you forever. 🤷",
   "created_utc": 1695402572,
   "score": 41,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1qdh7d",
   "message": "I'll give you the honest answer having dated 1 and knowing friends who dated some- the only thing that makes them stop is age/demand. The money is just too easy and psychologically you just can't go from $500/hour plus flights/hotels etc to $15/hour and needing to pay rent. Theres also the \"Rockstar\" factor of being hyped up for your looks on a daily basis, whereas it'll be totally inappropriate to compliment someone in that way at work so you'll start thinking you're only attractive naked. And then also the fact that very often you got into it young (16-18) and didn't bother with an education since the cash was coming in easy and seemed like it'd last forever after just 1 shoot.\n\n\nPeople ease out of it as they see the contracts dry up and need to consider another track of work out of necessity-and hopefully they have savings and managed to avoid the drugs/booze habits that go with the business. Nowadays its gotten easier to transition to acting, management etc. \n\n\nEither way, it might be romantic and all to say \"I quit for this person\" but that never works- you can't do things for other people and the worst thing you can do as a partner is pressure someone to change for you. I learnt that the hard way and I regret trying to change someone I was already in love with to be \"more perfect\" instead of just working on my definition of perfection.\n\n\nDon't regret the relationship ending- lol it was a total shitshow of a life. But I regret having been in that mindset and it helped me a lot with my current relationships to realize that.",
   "created_utc": 1695399965,
   "score": 164,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1q571k",
   "message": "Personally its the constant fucking reposts of \"Former pornstars, what made you quit?\" on AskReddit.",
   "created_utc": 1695397034,
   "score": 154,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1rmsaa",
   "message": "Not a pornstar, but briefly dated someone who just found her way into the business and quit quite abruptly in spite of being one of the most searched women on the internet…\n\nIn short, I matched with her on Tinder right before co-vid went wild, and at the time, she was a struggling single mom waiting tables and restarting life after separating from her child’s father. \n\nIn the time I spent with her, she was a sweet person, but that changed quickly once she blew up on a certain app for short-form videos…\n\nFound fame in a matter of weeks…opened an OF account…started with cosplay…\n\nDemands for more explicit content continued to grow, and so did the amount of money she was being offered…\n\nShe decided to dive head first into it…gave up custody of her child and deleted her child’s existence and association to her from the internet…and began doing anything that she was asked to do on OF and other platforms…\n\nI stepped away once she gave up her child and began creating very taboo content…\n\nIt just took over her life, and honestly, it was hard to watch. \n\nAs another poster stated, she developed a bit of an addiction to it…oh, and the money. She could not get enough. \n\nAgain…she recently quit porn in spite of being in HIGH demand…reached out and apologized for the person she had become in pursuit of the overnight wealth she found, and stated that she quit because she no longer had “control” as she did when “working for herself” on OF…\n\nHonestly, it didn’t pay nearly as well and she didn’t have time to fulfill the demands that were being asked and money offered on OF and other platforms that she has a LARGE following on, and on the sadder side of things, her social capacity has dissipated significantly and she doesn’t do a very good job of functioning outside of her home.",
   "created_utc": 1695416362,
   "score": 70,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1s2g43",
   "message": "Former OF girl. Honestly I had fun with the costumes and setting up the scenes but I didn’t enjoy how it made me feel. I felt really ashamed a lot. I still do. I also have trauma from an assault from someone who subscribed to me.\n\nI also met someone who loved me for me and it raised my confidence enough to stop.",
   "created_utc": 1695422480,
   "score": 48,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1rfhcd",
   "message": "Didn’t fully quit but definitely have taken very long breaks from OF. You just get so bored of sex, masturbation, etc. I think aside from the money the only reason I haven’t fully quit is being able to step away for a while whenever I start feeling burnt out.",
   "created_utc": 1695413634,
   "score": 50,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1prf5o",
   "message": "Upper floor closed.",
   "created_utc": 1695392023,
   "score": 117,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1quv06",
   "message": "Here come all the made up stories.",
   "created_utc": 1695406159,
   "score": 101,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1sihqu",
   "message": "So I worked as IT for a branch of the military, on a training base specifically supporting the students.  We managed two isolated but open training networks. \n\nWord got out that a student did a scene for one of those big name websites. Where they were a bit rougher on her.  I dont remember how it came out.  but she was hard up on cash. She did one scene, then at some point, she joined the army. Sadly, the site wasn't blocked. It was a mad dash to block it before word spread, but it was too late.  The students and instructors found out. They wound up discharging her. Because to many people found out. Honestly it was a bummer that it got so out of hand.",
   "created_utc": 1695429426,
   "score": 7,
   "submission_id": "16p6yg2"
  },
  {
   "comment_id": "k1r27ox",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16p6yg2"
  }
 ]
}