{
 "submission_id": "16pr1nu",
 "title": "What stopped you from killing yourself?",
 "selftext": "",
 "created_utc": 1695431406,
 "permalink": "/r/AskReddit/comments/16pr1nu/what_stopped_you_from_killing_yourself/",
 "score": 251,
 "url": "https://www.reddit.com/r/AskReddit/comments/16pr1nu/what_stopped_you_from_killing_yourself/",
 "comments": [
  {
   "comment_id": "k1usb8z",
   "message": "If you ever need help, then please know that there are many qualified people who would like to help you. \n\n* https://findahelpline.com/i/iasp (Global)\n* http://www.befrienders.org (Global)\n* https://988lifeline.org/chat (United States)\n* https://www.samaritans.org/how-we-can-help/contact-samaritan (United Kingdom)\n* https://www.lifeline.org.au/Get-Help (Australia) \n\nThere are crisis services worldwide that are trained to provide support. They are designed to give temporary relief from feelings that are overwhelming you and can help you get through a tough hour/night/week. Chat services, as well as phone numbers, are available on these sites.\n\nJust as you would see a doctor when you are sick, you deserve to take care of your mental health.",
   "created_utc": 1695478000,
   "score": 1,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1snfbo",
   "message": "I met this girl online and we became really good friends. She used to sing a lot and just be there for me. Eventually it got me to sing with her and she would just be there for me. At the time I was all alone in a foreign country with no family or friends and she was around for a long time. Eventually she passed away from a drunk driver. So now I just have her in my mind singing through some tough times.",
   "created_utc": 1695431607,
   "score": 217,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sn8g0",
   "message": "The impact it would have on my kids",
   "created_utc": 1695431519,
   "score": 15,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1st5nq",
   "message": "My sister called cause my niece wanted to babble to her auntie. She couldn’t even talk full sentences yet but loved her auntie. And talking to auntie on the phone.\n\nLiterally was looking at a gun considering swallowing it when the call came. And I realized I didn’t wanna be a person she’d never remember. She liked me for some reason and that was enough to keep the auntie going.\n\nI officiated her wedding a few weeks ago. We’ve come a long way.",
   "created_utc": 1695434245,
   "score": 65,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1stmw9",
   "message": "I honestly don’t know. I guess it’s because I still hope that things will get better, even if I don’t believe it.",
   "created_utc": 1695434463,
   "score": 10,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sz8ei",
   "message": "A therapist told me that studies show that children of parents that commit suicide are more likely to commit suicide themselves. And however bad I feel my situation is.  I can't give them a reason themselves.",
   "created_utc": 1695437103,
   "score": 80,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1svrwl",
   "message": "My dog Peach",
   "created_utc": 1695435454,
   "score": 150,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1su2ot",
   "message": "At my absolute lowest, the only thing that stopped me was the fear that I would fail at it. I knew roughly how much of one of my prescriptions to take but I was afraid it wouldn't work and then I would still be alive and miserable and not even have that prescription until my next refill.\n\nI'm doing much better now.",
   "created_utc": 1695434664,
   "score": 80,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1st4fj",
   "message": "The shit the people I care about will have to deal with after I do it. To much guilty thinking",
   "created_utc": 1695434229,
   "score": 13,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1ssnps",
   "message": "I wasnt a \"turn around and die\" suicidal but \"I'm going to do this dangerous thing because IDGAF\" suicidal. I was mixing alcohol and recreational drugs and woke up in the hospital. I was relieved yet also pissed off that I didn't die. I realized (begrudgingly) I'm here for a reason so in exchange for my life I haven't touched those drugs since.",
   "created_utc": 1695434013,
   "score": 5,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1stcnk",
   "message": "Spite",
   "created_utc": 1695434335,
   "score": 197,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1soii1",
   "message": "Jury’s still out.",
   "created_utc": 1695432100,
   "score": 205,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t69l0",
   "message": "being too much of a coward to actually do it and my pets. My cat, especially. I love him, and he loves me. while I was in a mental hospital for a week, my parents told me he would stay in my room a lot and was really sad the whole time. When I came back, he was much more affectionate for a while and kept following me and sitting near me if I was crying. \nI can't stand the thought of leaving him and him not understanding where I went or why.\nso I stay for him.\n\nsorry, I tend to ramble sometimes.",
   "created_utc": 1695440729,
   "score": 206,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t3q6q",
   "message": "I realized that dying would not truly END my pain, but instead just transfer and spread it to everyone I loved... I hated the thought of others experiencing my sadness.",
   "created_utc": 1695439364,
   "score": 125,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sogjv",
   "message": "The fact that I won't be able to step on crunchy leaves if I'm dead.",
   "created_utc": 1695432076,
   "score": 241,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1swbke",
   "message": "Not wanting my kids to be the ones to find me. Single Dad at the time.",
   "created_utc": 1695435709,
   "score": 159,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tbxn9",
   "message": "My daughter after I had cut my wrists was about 2 and a half. She saw my bandages and \"kissed it better\". I teared up and started therapy not long after. I was only 18 with a 2 year old and felt like I never accomplished anything. Now at 24 I've realized to slow down.",
   "created_utc": 1695443988,
   "score": 146,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1stvhq",
   "message": "nice lady on the other end of a suicide hotline",
   "created_utc": 1695434571,
   "score": 235,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sxruh",
   "message": "Executive dysfunction",
   "created_utc": 1695436394,
   "score": 0,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t93qr",
   "message": "I love guns. I have many of them. I take extremely good care of them. None have rust or show signs of aging. I buy quality ammo for everything. I’ve had exactly 1 misfire in my 100,000+ rounds fired. The misfired round was aimed at my head.",
   "created_utc": 1695442321,
   "score": 142,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1swx4l",
   "message": "Don’t want my cat to be lonely",
   "created_utc": 1695435991,
   "score": 110,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szuld",
   "message": "Love for my dad.\n\nI was 13 and a year earlier watched my grandma, my main mother figure, die in front of me. I couldn't cope with the pain of loss, toyed with self harm, but ultimately decided I just wanted it to end at any cost. \n\nAs I was about to carry out my plan, one thing popped into my mind: What would happen to dad? It was his mom who he was also extremely close to, and if he were to lose his only kid after that.... I decided my pain was worth limiting his.\n\n15 years later we were talking about it on the anniversary of her death, and he straight up told me, \"yeah, I don't think I would have made it if you did that.\"",
   "created_utc": 1695437402,
   "score": 237,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t07wc",
   "message": "My cats wouldnt know where i went.",
   "created_utc": 1695437581,
   "score": 223,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sx0ld",
   "message": "My girlfriend (then childhood friend) reached out after a really really bad break up and I was able to confide in her. She saved my life and I would do anything for her",
   "created_utc": 1695436037,
   "score": 110,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szpsj",
   "message": "The possibility of tomorrow",
   "created_utc": 1695437337,
   "score": 103,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1su2n9",
   "message": "I was suicidal before I found out I was pregnant. Finding out stopped me. And having my son has stopped me since. I would never hurt him.",
   "created_utc": 1695434663,
   "score": 128,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tbdyo",
   "message": "I gave myself a due date. August 30. August that year was the happiest I've ever been because I was going to die. On August 26, I was on my way out of the door to go to work and saw my workmate's mother on the news. My workmate was murdered along with his father. I worked in a small office with only the two of us as employees of our boss, I was a clerk and he was our messenger. It seemed bad to off myself after that.",
   "created_utc": 1695443660,
   "score": 102,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t3k8t",
   "message": "The fact my bird would be sad without me and I wanted to see the end of a sour story with someone",
   "created_utc": 1695439278,
   "score": 89,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t92gr",
   "message": "One piece finishing so I can call It mid.",
   "created_utc": 1695442301,
   "score": 80,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sncz1",
   "message": "All the things I would have missed out on",
   "created_utc": 1695431576,
   "score": 149,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1su0i4",
   "message": "Didn't want to hurt my twin sister",
   "created_utc": 1695434636,
   "score": 154,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tbenc",
   "message": "My wife just happened to walk in the room as I had the gun in my mouth (I didn't know she was home). She calmed me down and took me to the hospital.",
   "created_utc": 1695443671,
   "score": 73,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szxsx",
   "message": "The fear that what's after this existence is worse",
   "created_utc": 1695437446,
   "score": 232,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sy8a2",
   "message": "Knowing if i did, my elderly mother and previously homeless disabled brother would be screwed and would have possibly ended up homeless.",
   "created_utc": 1695436613,
   "score": 59,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tcbj7",
   "message": "How are you going to let your enemies outlive you?! Don't let them win",
   "created_utc": 1695444222,
   "score": 58,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t1n1v",
   "message": "Being 100% serious here. About the time you posted this question I had just gotten back to my 12' by 12' \"apartment\" where i live alone and I started making a turkey sandwich and I found myself needing to repeat three times \"don't kill yourself\"",
   "created_utc": 1695438286,
   "score": 55,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t3jp2",
   "message": "Superman.\n\nI was seriously depressed in my 20s, but I wanted to watch Smallville.\n\nI eventually got over it. (There were other shows, too, but yeah, this)",
   "created_utc": 1695439270,
   "score": 47,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t9bnt",
   "message": "I didn't take enough pills, apparently. \n\nI was on the track to heaven,  life support and funeral home on speed dial and my ass decides to breathe again. Just rude.",
   "created_utc": 1695442452,
   "score": 82,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sp1m4",
   "message": "Seeing my mommas eyes.",
   "created_utc": 1695432343,
   "score": 44,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sud1u",
   "message": "My work in earth is far from complete.  There are still lots of people I still haven't struck their last nerve yet, and it's something I kinda look forward to doing, so why would I quit with so much work to do?",
   "created_utc": 1695434796,
   "score": 41,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t0we0",
   "message": "Lexapro",
   "created_utc": 1695437918,
   "score": 44,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1snfbg",
   "message": "I had a dog at the time, and I couldnt imagine giving her up and not knowing what would happen to her or leaving her with me if I did go through with it. It was a whole mess.",
   "created_utc": 1695431606,
   "score": 74,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sxjap",
   "message": "Fear that it would start a chain of suggestion.  And that my mom is still alive and has already lost one child.",
   "created_utc": 1695436279,
   "score": 35,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t3fhj",
   "message": "Knowing death is inevitable and not believing in an afterlife.\n\nI know I'll be outta here in a comparatively short time, a max of 100 years or so is peanuts compared to an eternity of oblivion so I ethically and logically can't justify quickening the process unless I've tried everything to make my life something I can be proud of. I am only slightly above rock bottom, so I have some fighting left to do, else I'm conceding to the world that this is the absolute peak of my capabilities, and that would be so pathetic it's almost funny.",
   "created_utc": 1695439210,
   "score": 129,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sug3b",
   "message": "Thinking about my nieces and nephews all grown up without a super kickass auntie to spoil them and be their listening board when things get rough. Also because of my twin that I hold an extremely tight bond with. I’d never ever ever put her through that.",
   "created_utc": 1695434834,
   "score": 31,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szbi8",
   "message": "I met a girl. Fell in love. Miss her. Grateful.",
   "created_utc": 1695437145,
   "score": 33,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t3tsz",
   "message": "My cats. One of my cats particularly has only ever liked me. She hides from everyone else for the most part. If I’d killed myself, she probably would have spent the rest of her life never coming out from under the bed again. And she wouldn’t know why I was gone. Honestly, thinking about how my cats wouldn’t know why I was gone is why I have avoided doing dumb/dangerous things in the past.",
   "created_utc": 1695439418,
   "score": 33,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t91ng",
   "message": "The pipe were I tied the rope broke and I  hit the floor when I woke up I tought my landlord will have a hard time fixing this. \n\nSo i went to the hardware store and fix it. \nThat made me feel better like I wasn't that useless after all.",
   "created_utc": 1695442289,
   "score": 53,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szcq0",
   "message": "The thought of fucking it up again and just ending up with another gnarly scar that people constantly ask me about.",
   "created_utc": 1695437162,
   "score": 24,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tbqtt",
   "message": "the suicide demon sits in the room with me as we speak. \n\na voice in the background says “Don’t do it! You’re about to go to Icon Collective! You could be living your dream as a touring musician in a year and a half!”\n\nI try to listen to that voice. I really do. The others aren’t so optimistic.",
   "created_utc": 1695443874,
   "score": 25,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tc3e5",
   "message": "Scared of messing up and being paralyzed/severely disabled for life",
   "created_utc": 1695444084,
   "score": 30,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1thx21",
   "message": "My bond with my dog saved my life. I held a gun to my head, but I knew the sound would terrify her, and that I wouldn't be able to comfort her. In the commotion when my body was found, and in the coming days, she would've been completely overlooked, and scared. I knew that no one else could take care of her the way I did. I loved her too much to put her through all of that, or to leave her. \n\nI had to say goodbye to her last month, after almost 17 years together. I miss her everyday, but I'm in a much better place mentally and emotionally than I was at my worst. I am so grateful that she stayed with me for so long, and that I was able to do the same for her.",
   "created_utc": 1695447846,
   "score": 24,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szb53",
   "message": "My dog. Her previous owners were old and passed. When I found her she was grieving and immediately bonded to me. \n\nShe’s my whole fucking world. I couldn’t imagine my life without her. I do it all for her and I couldn’t do it without her. \n\nShe got me out of a dark place and she makes me want to be better.",
   "created_utc": 1695437140,
   "score": 50,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1srj6t",
   "message": "There’s weed I still gotta smoke",
   "created_utc": 1695433495,
   "score": 133,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1svit0",
   "message": "Fear of eternal damnation. And there's a book I want to write. If the book fails, and somehow the damnation thing is proven false, I'm absolutely doing it. Not even a cry for help at this point, what's the point if not personal desire and God?",
   "created_utc": 1695435335,
   "score": 22,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szdcl",
   "message": "The clothing rack ripped outta the wall when I tried to hang from it. I just laughed",
   "created_utc": 1695437171,
   "score": 21,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szujx",
   "message": "The beam I hung myself from broke",
   "created_utc": 1695437401,
   "score": 23,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t2m91",
   "message": "There would of been no one to take care of my cat",
   "created_utc": 1695438788,
   "score": 25,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t9xen",
   "message": "My kitty. He was a sickly little guy who was incontinent but the love of my life. He really was the only glimmer of joy in my life. I knew if I killed myself that no one would take care of him and would put him down. He was a rescue and sick so I saved his life but then he saved mine. He passed last year and I miss him every day.",
   "created_utc": 1695442798,
   "score": 21,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tabjs",
   "message": "I'd rather suffer than put my parents, sister, and nephew through pain. \n\n\nPlus I was once told that dogs don't understand suicide. I don't want to hurt my dogs and now I have a cat too.",
   "created_utc": 1695443024,
   "score": 21,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t1o8k",
   "message": "A random girl added me on snapchat the day I had planned to. No mutual friends. I wasn't tagged in some story. She just added me \"because she was bored\"\n\nI had everything planned out. Notes written and everything I planned to use. I was about to turn my phone off when I saw her name pop up on my phone, and something told me just to see who it was. That was it. Then I could carry on after. I got so lost in conversation with this complete stranger that by the time I realized how much time had passed, I had something, someone to live for. After only a few hours of talking with her, I wanted her to be in my life forever.\n\nThat was in 8th grade. We're 27 now and planning to get married. No one besides her knows that she saved my life by mere hours that day.\n\nEdit: After a few comments and people dm'ing me apprently thinking I'm lying because of the time frame, Im yping to attempt to clear up the time frame. I was 15 in the 8th grade (Yes, I was held back). I turned 27 like 2 weeks ago. Snapchat came out in 2011. September, to be exact. The story took place in early January of 2012. \nSnapchat was very new.\n\nI also changed my age in the post to 27 as I've only just turned 27 a couple of weeks ago and instincually put 26.",
   "created_utc": 1695438302,
   "score": 239,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1szbs9",
   "message": "My dog, he pushed the door open and lay on my leg promised from that day on I’d give him the best life I possible could",
   "created_utc": 1695437149,
   "score": 17,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t2k7w",
   "message": "Didn't want to hurt my mother like that. Felt like it would be too selfish of me to hurt her that way. It really feels like she is the only string that keeps me attached to life, and it terrifies me (like without her i wouldn't feel the need to exist).\nStill on some of the dark days i tend to think that few years down line after doing what i intend to do, my parents would move on and i wouldn't be such a burden to this world anymore. But you know what they say about demons, gotta fight them some how.",
   "created_utc": 1695438757,
   "score": 17,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t9u7w",
   "message": "I told this guy I was talking to how miserable I felt. We were in his truck having a late night talk. Just a lot of feeling like I’m behind at my age and how everyone I knew left me behind. I started to breakdown and cry and when I turned to him he began crying with me and said “Please don’t cry”. He said he wouldn’t leave me behind. It sounds cheesy but it was something I needed and wanted to hear. I’m in a much better place now, and we’ve been in a great and healthy relationship for a while now :) I love him dearly.",
   "created_utc": 1695442747,
   "score": 19,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1stgfi",
   "message": "Stupid luck. Cocked the gun but the round didnt load. Stuck in the magazine. Pulled the trigger and heard the click. Cried after because I couldn't even do that right",
   "created_utc": 1695434383,
   "score": 18,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t5lz9",
   "message": "Made a promise at my brother's funeral that I wouldn't leave this world the same way that he did.\n\nAnd I'm not about to start breaking promises any time soon.",
   "created_utc": 1695440371,
   "score": 18,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sq86s",
   "message": "Indiference",
   "created_utc": 1695432887,
   "score": 16,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t2sdj",
   "message": "Guilt. They're are people counting on me and my help. I can't just abandon them.",
   "created_utc": 1695438877,
   "score": 16,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t7v5n",
   "message": "First, a cop tackled me after i ID’ed my gf’s body. I tried to jump off the same cliff she did. I loved her a lot. \n\n2nd, i was sitting on a mountain side, pills in hand. I was gonna take em and pass out. Maybe wolves would get me. Or the coldness. \n\nBut, i sat there, watching the sunset, hearing a waterfall a bit away. And silence. I thought “maybe i can help other people before i go, luna woulda wanted that” so, i took 1 pill. Waited for hours and cried. I felt so alone. Im still alone in a sense. And life is garbage. But, im alive. And i wanna stay that way.",
   "created_utc": 1695441613,
   "score": 16,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tc1ta",
   "message": "I didn't want my partner to find my body.",
   "created_utc": 1695444058,
   "score": 16,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1syye4",
   "message": "my motivation to die was ''Im too kind to live in this world were everyone is bad'' then i just realized (some minutes after i take meds to kill myself)  that im not gonna die because of some shit people that are inferior to me, they are verms and dont deserve to win over me",
   "created_utc": 1695436966,
   "score": 40,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t2vef",
   "message": "My dad told me young, it's always a permanent solution to a temporary problem. I'm very logical and he's right.",
   "created_utc": 1695438921,
   "score": 13,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t5j7w",
   "message": "Mom will get sad",
   "created_utc": 1695440329,
   "score": 15,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1sz0vg",
   "message": "i want to have kids so i can give them a better life, and create these people who know they have a mother who is proud of them and loves them always, and who share their love with everyone, no matter the person.",
   "created_utc": 1695437000,
   "score": 28,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t1wb4",
   "message": "I have a naturally curious mind, so this may not work for you but…\n\nI dove into the deep end of meditation. The idea was that if after hundreds of hours of hardcore Theravada-type meditation, I still felt suicidal, I’d make a decision. \n\nAfter a few grueling months, coming face-to-face with my own madness, deconstructing the very fabric of perception, and meeting the devil himself, I came out the other side with wisdom that broke through everything. \n\nMeditation saved my life.",
   "created_utc": 1695438415,
   "score": 52,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tcrxu",
   "message": "6 years ago tomorrow my best friends mom shot herself. I watched it fuck up everyone that knew her and I still feel shitty this time of year and cant help but think about it. I came close a couple times but i could never inflict that on the people that care about me. R.I.P Amy",
   "created_utc": 1695444503,
   "score": 13,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1squvk",
   "message": "My cats and all the entertainment that I would miss",
   "created_utc": 1695433182,
   "score": 13,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t3hm2",
   "message": "Ice cream. Beautiful.",
   "created_utc": 1695439241,
   "score": 13,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1swgkd",
   "message": "An absolutely huge amount of spiritual intervention",
   "created_utc": 1695435772,
   "score": 10,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t07fm",
   "message": "Realizing that if I were to follow through with it, there's a chance I could end up back on this planet anyway.\n\nALSO\n\n\nRealizing that if I were to follow through with it, there's a chance I could mess up somehow, and I'd have to deal with that aftermath.",
   "created_utc": 1695437575,
   "score": 13,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t2enz",
   "message": "The reaction my mum would have had. Awful.",
   "created_utc": 1695438678,
   "score": 10,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1tcucp",
   "message": "1. My cat wouldn’t understand \n2. Even though I wasn’t rational and at the lowest point of my life, I still knew in the back of my mind it wasn’t a good decision",
   "created_utc": 1695444544,
   "score": 11,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t037p",
   "message": "My son wasn’t old enough to care for himself.",
   "created_utc": 1695437519,
   "score": 10,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1t08tf",
   "message": "My friends never gave up on me no matter how many years it’s been since I’ve seen them. \n\nSome days it’s when a customer is nice to me at work as pathetic as that sounds. \n\nEven more pathetic is there are times when someone hits on me and I’m like, I might stick around for a little longer. But hey. It kept me here so there’s that",
   "created_utc": 1695437594,
   "score": 9,
   "submission_id": "16pr1nu"
  },
  {
   "comment_id": "k1ufz3d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16pr1nu"
  }
 ]
}