{
 "submission_id": "16pupqc",
 "title": "[serious] what is a genuinely terrifying true fact?",
 "selftext": "",
 "created_utc": 1695442419,
 "permalink": "/r/AskReddit/comments/16pupqc/serious_what_is_a_genuinely_terrifying_true_fact/",
 "score": 5,
 "url": "https://www.reddit.com/r/AskReddit/comments/16pupqc/serious_what_is_a_genuinely_terrifying_true_fact/",
 "comments": [
  {
   "comment_id": "k1t99o9",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1695442420,
   "score": 1,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1vs0j6",
   "message": "People can die suddenly without warning or symptoms of anything significant to give warning.  \n\nSource: lost my wife 4 years ago when she was only 23 to a heart attack precipitated by non alcoholic fatty liver disease.  No symptoms or risk factors leading up to it. She was skinny, in shape, energetic, didn’t use drugs.  Just got home from work one day and she was gone.",
   "created_utc": 1695491878,
   "score": 163,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1u5jl4",
   "message": "If you don't get enough calcium when you're pregnant, the foetus saps it right out of your bones, leaving you brittle and vulnerable to osteoporosis",
   "created_utc": 1695465535,
   "score": 130,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tvbyc",
   "message": "Auto immune diseases are hella scary. One day the system that was designed to protect you thinks your own cells are pathogenic and decides to attack you",
   "created_utc": 1695457625,
   "score": 206,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1vwu0n",
   "message": "We'll never know who the *best* serial killers are.",
   "created_utc": 1695493678,
   "score": 119,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1u24l3",
   "message": "You can have a really bad disease for years and not even know about it, due it becoming dormant or latent.\n\nEssentially the disease is asleep and you wouldn't have a clue it was there unless a doctor told you. You could go to the grave with it...or it could wake up at the most inconvenient time.\n\nIn South Africa its reckoned up to **55%** of the population has latent Tuberculosis at this moment.",
   "created_utc": 1695462959,
   "score": 246,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1u3xnp",
   "message": "I got one: so years ago I started loosing my balance and loosing feeling in my legs. As they told me I had only about 5 more years to live, they did an MRI to see how bad “the lesions” were in my brain (they thought I had MS). So once I do the MRI, they’re like, “You need to see an ENT (Ear, Nose, \u0026amp;. Throat) doctor right away. So I’m like, dude tell me about the MS, and all they do is keep repeating “Go to the ENT”. So I go to the ENT and he explains they think I have a giant fungal growth taking up the entirety of my sinus cavities, and pressing on my brain. So after medication, a super painful surgery where they had to break my nose and sinuses to get it out, medical stints that were made on a 3D printer using some hardened medicine, and about four months of healing, I was back to normal-ish. \n\nThe horrifying part, the fungus comes from the feces of chickens and it is being introduced to the air by haulers moving chickens. Everyone in the US breathes in these spores regularly, but it mostly takes hold in people with compromised immune systems. Settling in the lungs is most common, and is often mistaken for lung cancer at first.\n\n\nETA: Thank you all for the upvotes. Yes, it was histoplasmosis.\n\nETA2: I have not seen The Last Of Us, but now I don’t think I want to.",
   "created_utc": 1695464336,
   "score": 151,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1turfd",
   "message": "I met a woman in the 90s, my girlfriend worked with her at a charity. Really nice lady, like yr fav Aunty type of person.\n\nI learned that she once had a child, a little boy. He only lived to be a few years old because one day while they were both playing in the garden, the boy picked up a snail and licked it.\n\nCant remember if it was days, or weeks later... but parasites had nested in his brain the eaten it from inside.\n\nWhat is more terrifying? That common snails can do this... or that your child can be lost so quickly and innocently while you are playing in the garden making memories.\n\nI will never forgot that.",
   "created_utc": 1695457179,
   "score": 55,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1uqvn3",
   "message": "I guess this isn't terrifying, but the Pillars of Creation, that amazing feature in the Eagle Nebula that is super famous and amazing looking...\n\nDoesn't exist anymore. It was wiped out by a Super Nova some 7000 years ago and given that it is 6000-6500 light years away we can still see it but in the next 500-1000 years astronomers will no longer see it in the night sky.\n\nThough I assume they'll see a really amazing Super Nova which could equally be as awesome. Imagine spending your life at just the right moment in history that you can watch a Super Nova unfold and wipe out a massive 4-5 lightyear tall iconic feature in our galaxy.",
   "created_utc": 1695477363,
   "score": 35,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1txovd",
   "message": "With our life span increasing due to modern medicine. We are at an increased chance of developing dementia.",
   "created_utc": 1695459481,
   "score": 201,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1ubsbh",
   "message": "When electricity was first made available for home use, the wires were not insulated and not hidden behind walls. People had live wires free standing in their homes, at an arms reach. Utter terrifying insanity.",
   "created_utc": 1695469682,
   "score": 184,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tsfve",
   "message": "Women are 8 times more likely to be murdered when they are pregnant.",
   "created_utc": 1695455376,
   "score": 62,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1ulg34",
   "message": "Antibiotic treatments are becoming less and less effective and common infections and minor injuries could become LIFE THREATENING  \nAs someone that has uses them at least once or twice a year, *antibiotic resistance* is genuinely terrifying to me, its like bacterial infections becoming viral ones",
   "created_utc": 1695474843,
   "score": 232,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tox9w",
   "message": "Half of the world's coral reefs have died in the last 30 years, and two thirds of the Great Barrier Reef have been damaged by coral bleaching.",
   "created_utc": 1695452768,
   "score": 120,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1txf51",
   "message": "40% of prostitutes in India are children.",
   "created_utc": 1695459268,
   "score": 92,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1txngw",
   "message": "[removed]",
   "created_utc": 1695459450,
   "score": 176,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tdcki",
   "message": "Our brains will not hesitate to remove something that is vital to us to keep us alive by programming it to die.",
   "created_utc": 1695444852,
   "score": 149,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1ut61v",
   "message": "The lyssa virus has been plaguing our species for thousands of years. once contracted the virus hijacks your nervous system to travel to your brain, much different than a normal virus, by this method it remains completely undetected by your immune system. this process can take weeks, to months. \n\nOnce the virus reaches your brain your immune system is put into overdrive as it can finally detect something is wrong. However the lyssa virus continues to control your central nervous system and forcibly tells your tcells to self destruct as they arrive in your brain. the tcells that it does not tell to self destruct, it tells to sever nuerons in your brain, causing confusion, lethargy, rage, and paralysis. \n\nAt this point the virus starts to move towards your salivary glands where it will attempt to infect another mammal. while this is happening it reprograms your brain to make you afraid of water, you run a massive fever, youre dying of thirst, your brain starts to swell, pressing against your skull. this pressure causes damage, and once a critical point is reached, your organs fail one by one until you slip into a coma and die.\n\nonce the rabies virus reaches your brain, and you start experiencing symptoms, you *will* die, and there is nothing that can be done to save you.\nover the thousands of years that the virus has been terrorizing humanity, killing tens of thousands of people a year, only around 50 people have defeated the virus. in all of recorded history...",
   "created_utc": 1695478370,
   "score": 201,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1unqa0",
   "message": "Some historical facts seem to back up the story of the Pied Piper.",
   "created_utc": 1695475923,
   "score": 107,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tsge8",
   "message": "Out of everyone alive on earth right now, there is someone who is suffering more than anyone else.",
   "created_utc": 1695455388,
   "score": 141,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1txlpl",
   "message": "That we need some way to replicate the ambient noise of the Earth. I'm not talking of cities, cars, etc the ambient seismic noise the Earth creates. Why? Because humans are so reliant on the noise that if we don't hear it we become more anxious. \n\nIt's already a problem on the list of problems for astronauts who stay for long periods on the ISS.",
   "created_utc": 1695459411,
   "score": 95,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1ur6ri",
   "message": "It takes only 1 second to change your life forever. \nI went from working 70 hours a week to being disabled. 1 second accident, life was forever changed for me. \nAlso, life could change from bad to good as well. 1 second to buy that lottery ticket that wins.",
   "created_utc": 1695477504,
   "score": 157,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1t9q6z",
   "message": "Your bed has around 10 million dust mites.",
   "created_utc": 1695442682,
   "score": 249,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1uljjr",
   "message": "The ovaries are not attached to the fallopian tubes, they actually yeet the egg across a small void, and the fallopian tube shoos it in the door with little flanges. Because of this gap, while rare, it is possible for a fertilized egg to escape into the abdominal cavity and attach itself to other organs. The bladder, the liver, anything really. And because embryos are very innovative parasites that excel at evading the carrier’s immune system, they can develop and wreck havoc. \n\nOn that same note, the void also allows sperm to escape and swim around in the abdominal cavity until they die 5-7 days later. While harmless, it’s still a little disturbing to think about having sperm in your guts, I’d imagine.",
   "created_utc": 1695474889,
   "score": 136,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tqtai",
   "message": "You have a 1/3 chance of developing Dementia past the age of 85",
   "created_utc": 1695454143,
   "score": 206,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1u5x5v",
   "message": "An estimated 27% of people with sepsis in hospitals and 42% of people in intensive care units will die.\n\nEven more if you ignore it.\n\nEveryone can get a sepsis by any open wound, be it a sunburn or a mosquito sting, a blister from new shoes or a gun wound.",
   "created_utc": 1695465811,
   "score": 136,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1trlyd",
   "message": "The Sun loses mass at a rate of 4.3 × 10^12 g every second to energy. \n\nThat's 4.3 million tonnes a second.",
   "created_utc": 1695454742,
   "score": 70,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1v710b",
   "message": "Unlike other predatory animals, bears do not know to kill their prey before they start eating. They just start eating it’s prey while it’s completely alive and conscious.",
   "created_utc": 1695483936,
   "score": 113,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tqytq",
   "message": "A wandering black hole could just end our entire solar system.",
   "created_utc": 1695454258,
   "score": 255,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tqxec",
   "message": "Somebody reading this won’t be alive tomorrow.",
   "created_utc": 1695454229,
   "score": 215,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tibyz",
   "message": "You could literally be dead in the next 10 seconds. Aneurysm, embolism, heart attack, car crash, plane crash... life is way too precious.",
   "created_utc": 1695448126,
   "score": 45,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1ul6td",
   "message": "Your brain eats itself because of a lack of sleep, remember to sleep people.",
   "created_utc": 1695474719,
   "score": 221,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tkdgp",
   "message": "When watching old sitcoms, everyone on the laughter track is dead.",
   "created_utc": 1695449528,
   "score": 96,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tx8n8",
   "message": "The sheer amount of banking and financial services that rely on Excel spreadsheets is enormous. \n\nSoftware generally is bad and can and does kill people.\n\nSelf driving cars are least of the problem.",
   "created_utc": 1695459125,
   "score": 247,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1u5z8g",
   "message": "There's no way to actually communicate your experiences to anyone. When you talk to someone, all they get are the words, and must then translate them in terms of their own preexisting knowledge and experiences.\n\n If I tell you I saw an interesting tree yesterday, the tree image in your mind will be quite different from what I saw. We can use more and more words to describe it, but actually there's no way to create a perfect model in your mind.  All models are wrong/incomplete. What you end up with is the bare minimum, shoddy caricature of the tree.",
   "created_utc": 1695465852,
   "score": 138,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1u40ff",
   "message": "If you have an infection severe enough, your body may eventually kill itself by attempting to save you. It's called sepsis, and it's an overreaction of your immune system, often leading to organ failure due to a dramatic decrease in blood pressure, among other things. At its highest severity, it is known as septic shock and patients often need to be put into a medically-induced coma. It's the cause of about a half of the deaths in hospitals, and the initial infection doesn't even have to be that bad.\n\nWhat's scarier is that even routine dental appointments can cause this. Earlier this year, I had to have a tooth pulled which had cracked and developed an abscess (yuck and ouch). Within an hour, I was in the hospital with a heart rate of nearly 200, plummeting blood pressure, extreme mental confusion, and I was shaking so badly that I couldn't breathe properly. I was told that after the tooth was pulled by my dentist, bacteria entered my bloodstream through the open socket, and I would have gone into septic shock had I made it to the hospital any later. I was in the hospital for 5 days and I'm lucky to be alive.\n\nA lot of the time, when a bacterial infection kills you, it's your brain and body that actually pulled the trigger.",
   "created_utc": 1695464394,
   "score": 193,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1vfs2b",
   "message": "That surgeon who's getting ready to cut you open sometimes has nights when they can't sleep and they show up to work groggy as hell.",
   "created_utc": 1695487260,
   "score": 189,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tsyai",
   "message": "There’s a theory that the reason we can’t detect any life outside of ours is due to the fact that all intelligent life is inherently self destructive. It will crumble too fast for two seperate species to be technologically advanced enough to communicate their existence to the universe",
   "created_utc": 1695455772,
   "score": 125,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tbubv",
   "message": "We are currently in a mass extinction event, not only are numerous species going extinct, but the rate is accelerating, exponentially..\n\nEdit for more clarity:\n\nThis is the 6th (debatably 7th) mass extinction event, and while it's true that the previous ones were natural, there is an overwhelming amount of evidence to show that we are the cause of this one. Habitat destruction, deforestation, pollution, the introduction of non native species, are all contributing factors. We've observed extinction rates skyrocketing the moment humans enter the picture.\n\nEvery year more is added to the list, and the amount added to the list grows ever higher :)\n\nhttps://en.m.wikipedia.org/wiki/Holocene_extinction",
   "created_utc": 1695443933,
   "score": 245,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1uf8et",
   "message": "There's more slavery now, than at anytime in history",
   "created_utc": 1695471658,
   "score": 149,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tu805",
   "message": "[removed]",
   "created_utc": 1695456762,
   "score": 74,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1udxow",
   "message": "Corporations have exponentially more control over the government than constituents",
   "created_utc": 1695470924,
   "score": 102,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1u2lzu",
   "message": "The poles of the earth act as a planet wide ice cooler and they are melting.  Most people don’t understand the scientific concept of latent heat. The transition from ice to water requires energy and the absorption of this energy is called Latent Heat.  Latent heat can be understood as hidden energy which is supplied or extracted to change the state of a substance (for example, to melt or vaporize it) without changing its temperature or pressure. This includes the latent heat of fusion (solid to liquid), the latent heat of vaporization (liquid to gas) and the latent heat of sublimation (solid to gas).  When the Arctic Ocean is covered with ice the water temperature remains at 0° centigrade. But when the ice is gone and there is open water all the sunlight that had previously been absorbed by ice now raises the temperature of the water dramatically.  Once the ice is gone there will be an abrupt rise in temperature and the cooling effect of the North Pole will be reduced in a dramatic fashion. This will change climate throughout the earth. Places where food was previously grown will no longer support agriculture and places that were previously inhabitable will no longer be habitable.  Wet bulb temperatures of 50°C that extend for weeks will kill hundreds of millions of people in places that were previously just hot. Desertification will follow.",
   "created_utc": 1695463327,
   "score": 70,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tzzlj",
   "message": "Climate scientists keep stating the benchmark that we must reach is that humans do not emit more than 2t eqCO2/person/year. This is completely impossible to reach with a minimal level of comfort:\n\n- the carbon footprint of modern state services: education, healthcare, police, research, defense... have a carbon footprint of about 1.4t eqCO2/person/year. This is the number for France, but I guess it's similar in other Western countries. With a lot of smart savings, we may be able to reach 1t eqCO2/person/year, but this is a far stretch, because the gains to be made are minimal.\n- just breathing alone, for a normal person, amounts to about 350kg of CO2/year. This CO2 is accounted for in the food that we consume. But that is just our base metabolism, it doesn't include the CO2 released from food growing, transportation, preparation, recycling...\n- home improvement to better insulate our housing is overall neutral in terms of CO2 emissions: first, there is the rebound effect that make people heat their home more after it has been insulated, second the installation and maintenance of good insulation turns out to have a huge carbon footprint by itself, so the real economies in terms of carbon emissions are only about -30% compared to a non-insulated house. The solution for housing is to live in smaller houses, all together in a single heated room during the cold season, as humanity has done in the past millenia.\n\nSo, this leaves between 250kg to 650kg of eqCO2/person/year for everything else: housing, transportation, leisure, clothing... Which completely impossible to reach.\n\nI poll my friends around with Carbon footprint calculators, and my friend with the lowest footprint is still at 3.6t eqCO2/year. And this is someone who lives like a monk: vegetarian, one or 2 trips on train/year, lives in a bachelor suite, his only hobby is playing music.\n\nEither Climate Scientists are overtly pessimistic, or we're in for a bad time.",
   "created_utc": 1695461290,
   "score": 161,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1ttm1e",
   "message": "Your immune system is unaware of your eyes. If it were to find out, your immune system would destroy then",
   "created_utc": 1695456285,
   "score": 50,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tromi",
   "message": "Mosquitoes have killed half of all humans who have ever lived.",
   "created_utc": 1695454798,
   "score": 171,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tixke",
   "message": "Pineapples contain an enzyme the dissolves flesh. So this begs the real question.\n\nWho is eating who?",
   "created_utc": 1695448536,
   "score": 108,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1twjgp",
   "message": "Most of the world oxygen comes from the oceans and seas and not trees, and that's ⅔ of the planet and we're polluting it",
   "created_utc": 1695458573,
   "score": 54,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tw8f0",
   "message": "[removed]",
   "created_utc": 1695458331,
   "score": 62,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1uigx0",
   "message": "More than half of the world‘s population cannot swim. They could drown in every pond, pool and river you see.\n\nAlso there are proteins called Prions that have been folded wrongly and can self multiply. They can be eaten as was the case with BSE and infect you.\nForgot to mention they cause horrible diseases like scrapie that „eat“ your brain and there is cure.",
   "created_utc": 1695473372,
   "score": 41,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1tr3hz",
   "message": "There’s these things called Gamma Ray Bursts that happen all across the universe and release an ungodly amount of energy. \n\nIf one where to happen within a few hundred light years of our solar system, it could completely eviscerate our atmosphere and kill us all. \n\nAnd there’s zero way to detect them, nor defend against them. \n\n\nHank Green made a short about these things",
   "created_utc": 1695454358,
   "score": 95,
   "submission_id": "16pupqc"
  },
  {
   "comment_id": "k1w3iwc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16pupqc"
  }
 ]
}