{
 "submission_id": "16q3np1",
 "title": "What’s the best thing you ever did that helped your self-esteem?",
 "selftext": "",
 "created_utc": 1695473215,
 "permalink": "/r/AskReddit/comments/16q3np1/whats_the_best_thing_you_ever_did_that_helped/",
 "score": 133,
 "url": "https://www.reddit.com/r/AskReddit/comments/16q3np1/whats_the_best_thing_you_ever_did_that_helped/",
 "comments": [
  {
   "comment_id": "k1uumoa",
   "message": "I moved across the country away from everyone that I know. Six months later, I had lost fifty pounds because I was no longer stress eating. I was that person that family and friends only called when they needed something. I am no longer the bank for people that blow all of their money. I blocked several numbers and did away with fb, insta and twit. I found myself and I made a promise to myself to not allow anyone else into my life that was not good for me.",
   "created_utc": 1695478989,
   "score": 200,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uitsj",
   "message": "Really letting go of what people think of me. Why should their opinion matter to me? My life became a lot easier once I started recognizing that I don't have to care what people, *especially* strangers, thought of me.",
   "created_utc": 1695473551,
   "score": 150,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uy1f4",
   "message": "Went to college at 50.  Getting good grades was incredible for my self-esteem!!",
   "created_utc": 1695480397,
   "score": 142,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uikxl",
   "message": "Lose weight and work out.",
   "created_utc": 1695473427,
   "score": 182,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uooz8",
   "message": "Lost almost 200lbs",
   "created_utc": 1695476371,
   "score": 119,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1ukgtx",
   "message": "[deleted]",
   "created_utc": 1695474368,
   "score": 70,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uipaj",
   "message": "Begin to seek validation from within. Not care what others think. Life is too short. Change your mindset.",
   "created_utc": 1695473488,
   "score": 15,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uzn1z",
   "message": "My uncle taught me to do something for myself every day.  No matter how small, even pulling over to buy a pop you like.  But you must make sure you note that it was for just for you.  You deserve to be happy, and doing little things has taught me a lot about making myself happy and not just looking for others to.",
   "created_utc": 1695481044,
   "score": 144,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uiivr",
   "message": "Learning to properly self-care. Taking care of my teeth properly, moisturizing regularly, spending the time to look nice, keeping my environment tidy and clean, etc.",
   "created_utc": 1695473399,
   "score": 180,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uo5df",
   "message": "Positive talk to myself. I didn’t realize how often I put myself down. Now if I start to think poorly of myself, I will stop and defend myself. \n\nI still critique myself and seek improvement. Those are good characteristics, and I’m quite capable of overcoming my weaknesses. I will not allow myself to be my own bully anymore.",
   "created_utc": 1695476119,
   "score": 57,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1ujjn0",
   "message": "I stood up for myself because a boy was harassing me so I punched him and got a four hour detention",
   "created_utc": 1695473913,
   "score": 94,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uoptf",
   "message": "Stopped drinking",
   "created_utc": 1695476382,
   "score": 89,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uwqi9",
   "message": "I stopped dating guys who didn't want to be my boyfriend.",
   "created_utc": 1695479864,
   "score": 74,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1utnkq",
   "message": "Stopped being so worried about what people think of me. I just went “Fuck it” one day and have been more bold with the way I dress",
   "created_utc": 1695478580,
   "score": 33,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uiskg",
   "message": "Changed my job.",
   "created_utc": 1695473534,
   "score": 56,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1utirl",
   "message": "Working out and eating accordingly.\n\nDefinitely changed everything",
   "created_utc": 1695478523,
   "score": 27,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vh0ro",
   "message": "Walked away from unrequited love and unbalanced relationships of any sort.",
   "created_utc": 1695487736,
   "score": 20,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1viuwp",
   "message": "Fell in love with books and learned to choose QUALITY DOPAMINE over cheap dopamine (social media, pr0n, alcohol, fake people etc)\n\nAlso... learning how to stay away from people who do not resonate with me. We cannot thrive when we are immersed in environments that seek to destroy us.",
   "created_utc": 1695488426,
   "score": 24,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uj8ks",
   "message": "Running and working out , this sounds silly , but those 2 activities you can control and also you set the goals .  I would caution you to set short term goals and long term goals \n\nBut since you control the destiny of activities , you will succeed and ot should help your self esteem",
   "created_utc": 1695473759,
   "score": 17,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1utz14",
   "message": "I did keto for a month and lost 9kg. Right now I'm overweight, unhappy, drinking waaaaaaay too much, and depressed. Fuck this shit. I'm starting again tomorrow.",
   "created_utc": 1695478712,
   "score": 18,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v35bh",
   "message": "Gave up hoping my marriage would eventually get better. My husband is never going to change, never going to stop treating me like property, and accepting that made a huge difference everyone in my life has noticed.",
   "created_utc": 1695482438,
   "score": 18,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uj9ev",
   "message": "To start always thinking of myself first. I am the beloved first, and then others",
   "created_utc": 1695473771,
   "score": 48,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uvuac",
   "message": "Not something i really did. Have a friend that helped me. She would hear me talk bad about myself and talk to me about why I felt that way. She would point out the flaws in my reasoning and give me ways to look at myself in a better light. It helped me so much.",
   "created_utc": 1695479498,
   "score": 16,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vmg05",
   "message": "I got hearing aids.\n\nIt turns out that just \"getting by\" without them wasn't good for my brain.\n\nI've got more energy now.\n\nI'm not as anxious.\n\nI'm more self confident.\n\nYeah I can hear better, but that's almost secondary compared to all the other benefits.",
   "created_utc": 1695489770,
   "score": 14,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1ujm71",
   "message": "Going to the gym, and eating better",
   "created_utc": 1695473949,
   "score": 13,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uz6in",
   "message": "I quit caring about what other people thought about me. So very freeing.",
   "created_utc": 1695480858,
   "score": 13,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vpouw",
   "message": "Wouldn't say the best thing but something that might help other redditers. Sharing too much. \n \nMy wife noticed every time there's guest over I would tell them funny things that happened to me. I would mention dumb moments I have.\n Then in result a lot of people see me as the an idiot bc I share too much about myself. \n\nFor example I'm a locksmith and  I'll tell them \"sorry I'm late. I just drove an hour to a customer to fund out they didn't need a new key their car battery was just dead hahaha\"\nI would say it to get people chatting but I don't realize the comments that come back are \" oh man you're never focus hahaha\" \"how long will it take for you to be good at your job? Hahaha\"\nMy wife knows how smart I am. And she know notice these small comments subconsciously gets into my head and even theirs about me. Also, who else is talking about their faults in our crowd to joke? \nNow I walk in silence. I entertain my guest with news and sports topics. Tbh I carry myself differently in front of people now. Why make fun of me FROM me? I can take a joke but why should I clown myself?",
   "created_utc": 1695490992,
   "score": 13,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v95ab",
   "message": "Leave the Mormon Church",
   "created_utc": 1695484742,
   "score": 10,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vabxk",
   "message": "Stopped drinking. Alcohol kept me in this loop where I felt like I needed a substance to get through normal social interactions. It made and kept me sick for years. My body never had time to properly recover before I made it sick again. When I quit, I realized I could overcome my social anxiety all on my own, and as my body started to heal from the abuse I just looked better, too.",
   "created_utc": 1695485189,
   "score": 11,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1ujci6",
   "message": "Join the Marines lol",
   "created_utc": 1695473814,
   "score": 8,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v4uxl",
   "message": "Learning a new skill, then getting decently good at it such that people come to you for help. Mine is building/building repair for instance. I'm not a professional but I can think outside the box and that's helpful/impressive to people who can't.\n\nFor me, it isn't other people's opinions that matter nearly as much as the feeling of being useful.\n\nOtherwise, just drill into your mind constantly that you are worthy, you are important, you are a perfectly valid human being who deserves to be happy and feel confident.\n\nIf you mean as far as social interaction, I have severe social anxiety and I've totally overcome it. The secret? Force yourself to accept that no one is better than you. They might be more successful, or attractive, or whatever, but they're just a human, and you're just a human. I use that baseline for every single interaction I have.",
   "created_utc": 1695483105,
   "score": 9,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v8so8",
   "message": "I stopped saying bad things about myself, even if it was a joke. No more \"I'm such trash, OMG I'm such a failure\" type jokes. It wasn't really a joke, I did feel bad and tried to make light of it. After even a week of no self-imposed insults I felt better. Turns out when you're not hearing insults every day you stop feeling bad.\n\nThere will always be people who don't like you, and I tried not to make myself one of them.",
   "created_utc": 1695484607,
   "score": 9,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1voztn",
   "message": "May sound ridiculous but changing my appearance so I actually look I want to look like.\n\nGetting rid of toxic assholes in my life who never gave a fuck about me.\n\nPacking my things, moving to another country and make it work. Reminds me that I am able to get my stuff done.",
   "created_utc": 1695490727,
   "score": 9,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uilh6",
   "message": "Lost weight",
   "created_utc": 1695473435,
   "score": 8,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1ujvf4",
   "message": "Getting strong",
   "created_utc": 1695474078,
   "score": 8,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vaqsc",
   "message": "Deleted Tik Tok \u0026amp; Instagram.",
   "created_utc": 1695485347,
   "score": 8,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vlfj0",
   "message": "Therapy and deleting the majority of social media.\n\nI took CBT therapy on the advice of my GP to tackle my anxiety, I did 7 weeks of weekly meetups with the therapist, a soft spoken lady, and we just spoke about my history and techniques etc as well as on the first day doing a questionnaire that gave me a score of where I was in relation to my feelings and anxiety, and I'll be honest, while I was there all I was thinking was 'This is useless it's doing nothing'... even on week 7 I was thinking that... until I did the questionnaire again and my score had improved IMMENSILY, and I tell you now I answered it as honestly as I could... I then started realising things were not bothering me anymore... like I used to get crazy anxious in queues and on public transport to the point I'd be drenched in facial sweat etc... that just stopped, and still to this day it's never bothered me again, and that was 3 years ago, I stopped caring what people thought of me and only stressed and felt anxious by things that any human would have that reaction too... I still don't know what she did to me but I still always joke with my girlfriend when she asks me why I'm so relaxed, I say 'go ask that magical soft spoken lady' lol.\n\nSeriously the best thing I have ever done, PLEASE if you're considering it DO IT! Even f you're sceptical. \n\nSocial media was the other big one, I got rid of Insta, Snap and Facebook, and BARELY use Twitter, mainly just here and TikTok now, it's so freeing not seeing useless posts from other people, like their drama etc.",
   "created_utc": 1695489393,
   "score": 8,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vq94t",
   "message": "Just did it 4 days ago got all my bad teeth out and got dentures , only 47 years old but I didnt look after my teeth so now i can finally smile again ,well once everything heals up ,but yeah almost instant increase to my low self esteem",
   "created_utc": 1695491206,
   "score": 8,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uk4u3",
   "message": "I educated myself through study. It's been years and years and I'm still in that process. It’s worth it",
   "created_utc": 1695474204,
   "score": 15,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1utahm",
   "message": "Lost over 100 lbs",
   "created_utc": 1695478424,
   "score": 7,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1utq2o",
   "message": "I no longer take depression medications because going to the gym helped me so much with my despair and self-confidence. In particular, weightlifting has enabled me to regain control over my appearance and sense of self.",
   "created_utc": 1695478608,
   "score": 14,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uya0w",
   "message": "I used to bite my nails but now that I've got they done by a professional beautician I feel more confident. And, more importantly, I quit drinking alcohol so I lost a lot of weight and now I am feeling great 👍🏽",
   "created_utc": 1695480491,
   "score": 6,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vbdnc",
   "message": "Wrote a great will clearly depicting that everything I've written, recorded, or otherwise created is to be destroyed upon my death, and that I am to have no funeral services/memorials/obits, etc.  Knowing I will leave zero legacy and that my life will ultimately be seen as worthless (or hopefully, not even noted anywhere at all) really takes the pressure off.",
   "created_utc": 1695485592,
   "score": 6,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vclft",
   "message": "Quitting alcohol and nicotine.  I can do anything... Lol, no I can't.  But I can clean my abode, workout regularly, eat healthy, go for fun hikes, and so much more....",
   "created_utc": 1695486054,
   "score": 6,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vnn8z",
   "message": "Plan small but fun stuff to do, make a budget, and work towards it. Having a target to achieve makes me look forward instead of around me, where the unimportant people that judge me are. Also, I quit comparing. A cliché one but highly effective.",
   "created_utc": 1695490222,
   "score": 6,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vr499",
   "message": "Learning not to take things so personally. I grew up in an emotionally abusive household so really struggled  with  a lot of self blame and guilt. When I began to integrate not taking people’s behaviour as a reflection of me but a reflection of themselves this helped my self esteem.",
   "created_utc": 1695491533,
   "score": 7,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v4c1w",
   "message": "Instead of trying to convince yourself to become confident, go learn to do something. Anything, really. Just pick a skill you've always wanted and start learning about it. Practice it. Invest in it. Confidence is a side-effect of being good at something. Confidence without competence is, really, arrogance and ignorance.",
   "created_utc": 1695482903,
   "score": 10,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vc3xw",
   "message": "Deleted the dating apps, made a new Instagram where I only follow my close friends and family to avoid falling into the trap of comparing myself, and started going to the gym six times a week. I’m growing stronger physically and mentally every day. 😊",
   "created_utc": 1695485872,
   "score": 4,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vokjt",
   "message": "Lost weight permanently. \n\nWhile difficult, it’s simple. The pay off is huge.",
   "created_utc": 1695490567,
   "score": 4,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1w36k5",
   "message": "I did a course called TLC (the living course) back in 2002 that is based on childhood trauma/messages that make you feel not good enough about yourself. I learned to reparent my inner child and learned that I am enough and love who I am. My husband did the course as well and our children did the course in 2010. We are a true family unit today and our children are well adjusted , well educated and thriving adults. They are all close and well connected to each other, which makes my heart sing. The greatest thing I ever did for myself and my family. Happily married for 27 years.",
   "created_utc": 1695496082,
   "score": 4,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wk13s",
   "message": "Getting pregnant. Literally everything I was insecure about has seemed to melt away. My belly is there for a reason, if I hate my skin, will I hate it on my baby? I doubt it. If I can’t be my own cheerleader, how could I be theirs when they share my genes. It has really changed my whole perspective in a way I never thought possible.",
   "created_utc": 1695502407,
   "score": 5,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uj1ob",
   "message": "My self esteem use to be low because of my height, and looks, it was at an all time low during high school and a bit after, I was poor and couldn’t afford nice clothes and my hair was already raggedy. Had crooked teeth on top of that. Then I got a real job, made real money and enhanced my looks. Got braces, got my hair professionally done, went out and bought decent clothes, got my toes and nails did. Went on YouTube and learned how to do basic makeup. Started feeling way more pretty and confident.",
   "created_utc": 1695473662,
   "score": 10,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1um7kx",
   "message": "Took a street-fighting self defense class.",
   "created_utc": 1695475209,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uql3h",
   "message": "Learned a new skill!",
   "created_utc": 1695477229,
   "score": 4,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vba5i",
   "message": "Lost about 115 pounds",
   "created_utc": 1695485555,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vf5hw",
   "message": "Started going to the gym for my mental health. At the gym I spend a lot of time thinking and reflecting on my own actions and you have a lot of time to yourself there. It’s great. If you can’t get motivated to go to the gym, just think about how the time is gonna pass anyway. Every few months I used to just think about how if I just started the gym 4 or 6 months ago I’d be so different and I got sick of that so I just went. Just go.",
   "created_utc": 1695487026,
   "score": 4,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vskb3",
   "message": "I got a divorce from an exceedingly toxic partner.  They were slowly chipping away at my self confidence over time and I stopped them when I left.",
   "created_utc": 1695492083,
   "score": 4,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vywij",
   "message": "Left my crappy marriage , was scared shitless, had been married 31 years. Best thing I ever did for my self esteem.",
   "created_utc": 1695494449,
   "score": 5,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vzq3s",
   "message": "i stopped eating poorly ,and lost 400 lbs in 21/2 yrs  at the age of 62.",
   "created_utc": 1695494765,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wime7",
   "message": "Lost 140 pounds, had skin removal surgery from my stomach (they took off 10.5 lbs from my abdomen), and just focusing on myself and my life. I’ve taken a huge step back from always people pleasing and my mental health is better off for it.",
   "created_utc": 1695501888,
   "score": 4,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1xk3k7",
   "message": "I left my toxic friends behind",
   "created_utc": 1695517426,
   "score": 5,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uyrsf",
   "message": "Transitioning",
   "created_utc": 1695480692,
   "score": 6,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1ulu81",
   "message": "Quit drinking and getting in shape",
   "created_utc": 1695475031,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uof8r",
   "message": "Lift weights and get big and strong.",
   "created_utc": 1695476246,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uz6cc",
   "message": "Getting braces",
   "created_utc": 1695480856,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v5hlq",
   "message": "Lost 187 lbs. His name was Paul, a verbally abusive twatwaffle.",
   "created_utc": 1695483343,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vadww",
   "message": "Solo travelled for the first time. Stopped caring (mostly) what other people think and that carried over to when i got home. And had to overcome some obstacles I ran into while traveling all by myself, which gave me lots of confidence in my ability to just figure it out. I’m so much happier and more confident now.",
   "created_utc": 1695485209,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vg0ya",
   "message": "Moved out of my narcissistic mother's house, went to college and university and have not spoken to her in 10 years",
   "created_utc": 1695487356,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vgxge",
   "message": "I was in a real low after failing a couple different College programs (i tried arts, teaching, journalism) and said to my self that it would be my last chance. Everything before failed because of my actions and my mental health which nobody took serious except my gf at that time.\nMy parents told me if i would fail again i pretty much would end needing social welfare.\nThe fear of failing again made me pretty ambitious and when i saw that good this resulted in good grades my self-esteem gradually went up.\nAfter a breakup it went down again but at that point i knew that i could and can achieve stuff.",
   "created_utc": 1695487702,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vlsre",
   "message": "Weirdly posting on reddit.",
   "created_utc": 1695489531,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vns31",
   "message": "Went to work in a pub. I worked in a building society and I was badly bullied by another staff member. Hair was falling out, I was miserable. So I applied at a pub and got the job. I made new friends, and we had THE BEST time. We would go out after work, chill out together, go on holidays together. I found myself again. Sadly our pub manager died a few years ago. He was loved by all of us and we all reconnected over our utter heartbreak. We’ve all gone on to do different things now, it’s been more than a decade but those memories are so special.",
   "created_utc": 1695490272,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vpa2d",
   "message": "Work out. start caring about what I actually eat. \n\nIt's fine to have whatever you want from time to time, but just like income you should be budgeting it. if you know you're going to a cookout / family dinner / cheat day and you're gonna eat a lot, plan accordingly. Do stretches in the morning, try to squeeze in some workouts in the day",
   "created_utc": 1695490835,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vr45v",
   "message": "Exercised and uninstalled meta apps",
   "created_utc": 1695491532,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vrr2v",
   "message": "Joined an improv group\n\nDaily 1-hour-walks",
   "created_utc": 1695491778,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vrtsc",
   "message": "Deleted a stupid game that I used to talk to really mean people on",
   "created_utc": 1695491807,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wgcuo",
   "message": "Started working out 11 years ago and never stopped.",
   "created_utc": 1695501053,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wn0bj",
   "message": "Getting on anti-depressants. I'm a little over a year in and I wish I hadn't spent my 20s and the first half of my 30s just white knuckling life through my depression. My life is better in so many ways than it was a year and a half ago, and most importantly, I am now a much better parent and spouse.",
   "created_utc": 1695503516,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wsfa0",
   "message": "Counselling.",
   "created_utc": 1695505648,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wvd0d",
   "message": "Had to leave first husband. He said things like, after I had our first child, nobody would want me because I was loose (I wasn't, hehe). He said I was in the \"top 3\" of his cutest girlfriends. He told me I was \"cute\" when I was 29 but guys wanted 17, 19 year olds and I was old.  He was pissed at me once when I bought a salad and I got a lot of fruit, which made it weigh a lot, and it cost more than his. I was pregnant then too. My God the baggage I have fought since I left him. The worst 10 years of my life spent on that loser.",
   "created_utc": 1695506820,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wxxz9",
   "message": "Moving 2000 miles away to a city where I knew no one. \n\nI could finally get away from everyone's idea of who I am. It let me stand a bit taller, far more outgoing and I've come to mostly like who I am! \n\nIt was like suddenly I'm finding friends who like me for me instead of being friends because we've known each other forever. It made me dig into myself and pull out more of what I'd been hiding. \n\nMaybe it wasn't that I was so broken. Yeah I've a LOT of cracks but if you didn't know my past you wouldn't know. I wasn't Blue who was always too quiet, accepting absolute shit from others. I wasn't Blue because no one in my new city knew that person. \n\nI became Blue Cat, Laughing who tends to seriously over write stuff but who is confident enough to not care (not care as much lol, I still have a ton of work to do on myself).",
   "created_utc": 1695507868,
   "score": 3,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uiiw1",
   "message": "Visiting a naturist resort.",
   "created_utc": 1695473400,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uscpx",
   "message": "I became adult.",
   "created_utc": 1695478018,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1utzh8",
   "message": "Being able/comfortable with walking at least a mile.",
   "created_utc": 1695478717,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uv6lr",
   "message": "Get in shape and dress better.  Making more money goes a long way too.",
   "created_utc": 1695479224,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uyota",
   "message": "Took a speech class. I was always a quiet person, and this helped me find my voice, along with my love for public speaking.",
   "created_utc": 1695480659,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uzpw7",
   "message": "Therapy",
   "created_utc": 1695481076,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1uzw4l",
   "message": "Divorced",
   "created_utc": 1695481146,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v0x0n",
   "message": "Working out and therapy",
   "created_utc": 1695481557,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v4pmb",
   "message": "Got divorced.",
   "created_utc": 1695483049,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v4q59",
   "message": "Following through what I told myself I will do. Self respect at its finest.",
   "created_utc": 1695483054,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v5n71",
   "message": "I no longer take my negative thoughts about myself as fact, instead I now reflect on why I had that negative thought in the first place and try to figure out how to healthy process my perception of myself",
   "created_utc": 1695483403,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1v8lih",
   "message": "Laser eye surgery",
   "created_utc": 1695484530,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1va6sw",
   "message": "Lost my virginity. I know it sounds weird but it was like a switch was flipped in my brain. I went from being debilitatingly shy to much more confident and outgoing. It also greatly reduced my concern for what other people thought about me. If they like me, great, if not, whatever.",
   "created_utc": 1695485135,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vb9eo",
   "message": "LSD, a dark quiet room, a comfy place to sit, and my own thoughts.",
   "created_utc": 1695485547,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vbx8y",
   "message": "Got off social media 100%. I was living through it, and by that I mean I had curated a version of myself on there that didn't match me in reality, and it was really damaging tbh",
   "created_utc": 1695485802,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vcwgz",
   "message": "Look into my own eyes in the mirror and say true kind things. It got me into the habit of talking to myself like a friend in my head.\n\nThat and learning that others' feelings are not my responsibility or my business. And vice versa.",
   "created_utc": 1695486169,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vemje",
   "message": "Stopped giving a rats' ass about what people think of me.",
   "created_utc": 1695486827,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vfivy",
   "message": "Put more effort into dressing up and working out regularly. I still have room for improvement but my self-esteem is undeniably higher.",
   "created_utc": 1695487164,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vfsrq",
   "message": "Started running naked 5ks. Now I literally don’t give AF about what anyone things about my body.",
   "created_utc": 1695487268,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vftn6",
   "message": "Became single and refused to date again",
   "created_utc": 1695487277,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vgggn",
   "message": "Flexibility in perspective, yoga, and exercise",
   "created_utc": 1695487522,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vh620",
   "message": "Get tattoos. 😄",
   "created_utc": 1695487790,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vhecn",
   "message": "Got in shape. Gave me great body confidence!",
   "created_utc": 1695487876,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vi3qu",
   "message": "Working out.  Eating better.  Yoga and Meditation.  Full sleep on a regular schedule.  Drinking more water.  Spending more time reading and learning.",
   "created_utc": 1695488140,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vj68u",
   "message": "Therapy and self work.",
   "created_utc": 1695488544,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vjde7",
   "message": "Therapy!",
   "created_utc": 1695488616,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vkh11",
   "message": "Leaving an abusive relationship",
   "created_utc": 1695489029,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vksih",
   "message": "walk my dog lol",
   "created_utc": 1695489150,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vls7o",
   "message": "Punching bag. The big kind. Afterwards I felt like a new man. Huge weight lifted.",
   "created_utc": 1695489525,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vm5jr",
   "message": "Quit drinking booze.",
   "created_utc": 1695489663,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vn36a",
   "message": "Got old... know nothing matters so just fucking go for it",
   "created_utc": 1695490011,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vn6kp",
   "message": "Got away from my ex.",
   "created_utc": 1695490047,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vq6vj",
   "message": "Delete social media, work out, reflect your feelings, practice gratitude and try to surround yourself with less negative content (in my case I stoped listening to true crime podcasts)",
   "created_utc": 1695491183,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vqoll",
   "message": "Got cats.",
   "created_utc": 1695491368,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vrnrk",
   "message": "I stopped giving a fxck about failing \n\nI used to be a shut in because I was always worried about \"being cringe\" or \"embarassing myself\". This fear prevented me from trying things and pursing new opportunities. But then I realised- so what if I'm cringe? If I fail I can always try again. Infact anyone who's succeeded has been cringe at some point. Every artist has started with a stick man. Every olympic swimmer has started with arm bands. So WHAT if I'm a failure, or I'm cringe - everyone's been a failure at some point. And everyone's so pre occupied with their own failures to even dwell on yours for longer then 5 seconds.",
   "created_utc": 1695491742,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vt4m1",
   "message": "Got my teeth fixed. Mine weren't even that bad, just like ten little cavities all in the front.  I lied to myself that I didn't care for years until an old filling fell out and had to get them all fixed.  Oh my GOD the surge in confidence was crazy!  The ability to smile without feeling even slightly self conscious is so freeing.  It was expensive and ouchie, but oh so worth it.",
   "created_utc": 1695492290,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vtcw5",
   "message": "If you know the rules of chess, you know that it's illegal to move your own king into check. Can't do it.\n\nI had a friend who pointed out that I spent a lot of my life \"checkmating myself.\" I would back down from things I wanted to do because I would talk myself out of even trying. I'd say I wasn't good enough, or smart enough, or whatever enough, and then I'd give up.\n\nSo my friend said, \"you're not allowed to checkmate yourself anymore.\"\n\nConceptually, this just clicked with me. Next time I saw something I wanted to do and started to shy away from it, I heard my friend in my head, decided I wouldn't checkmate myself, and I went for it.\n\nThe place this changed the most for me was relationships. I used to not talk to pretty girls because I figured they were \"out of my league.\" Turns out, there are no leagues, and lots of people self-select themselves out of the running, so you actually have less competition asking out a hottie than you do asking out a kind of average looking woman.\n\nSo don't checkmate yourself!",
   "created_utc": 1695492377,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vu3hx",
   "message": "legally changed my name. soooo powerful.",
   "created_utc": 1695492654,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vu7jk",
   "message": "Therapy, getting off social media, putting myself first",
   "created_utc": 1695492696,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vu8p9",
   "message": "lost weight, get my hair done once and awhile as a pick me up",
   "created_utc": 1695492708,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vu9fu",
   "message": "Established personal boundaries that cannot be broken no matter the person.",
   "created_utc": 1695492716,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vumeh",
   "message": "Introspection. Honest internal dialogue about my past, my fears and desires.",
   "created_utc": 1695492852,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vunyc",
   "message": "Learnt to understand that my employers don't care. Put my job into perspective and my self worth",
   "created_utc": 1695492869,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vuz4v",
   "message": "Do esteemable things. Seriously. Get up and make your bed, that way you already done the first thing right in the morning. Do something nice for somebody every day without telling anyone. See how you can give instead of take. It’s simple, not easy. But totally worth it. My best to you.",
   "created_utc": 1695492987,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vvc80",
   "message": "do more things that are good and productive rather than doing nothing and scrolling reddit and playing video games. being in the best shape you’ve been and continuing to crush goals and pbs is the best motivation to wake up in the morning. besides my girl giving a quickie",
   "created_utc": 1695493126,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vx5t5",
   "message": "Got a job",
   "created_utc": 1695493802,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vy52l",
   "message": "Not stressing about how many tasks I can complete in a day, but rather praising myself for the little things I did manage to complete. Also not worrying about how many tasks I have left.",
   "created_utc": 1695494161,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vyzob",
   "message": "Not paying my student loans. I was able to afford proper food and mental health care to become the best version of myself. LMAO imagine suffering for some stupid fucking finance bro who thinks he can just make imaginary money by signing papers.",
   "created_utc": 1695494482,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1vz2n5",
   "message": "Got drunk.",
   "created_utc": 1695494514,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1w1mp1",
   "message": "Finally went to therapy. Was your typical guy who didn't need it until I did. Was about two days away from \"taking care of myself.\" Now I know why I'm messed up and am taking steps to fix it.",
   "created_utc": 1695495493,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1w1o06",
   "message": "Exercise. Self help books-gottman helped me build and keep healthy relationships. Also avoiding toxic and abusive people, that included family. Avoiding social media helps too. Eating healthier. Self development I read and listen to things I’m interested in and that has build up confidence.",
   "created_utc": 1695495507,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wc3ma",
   "message": "After being thrown back into the dating pool in my late 40's, I was really self-conscious about having a new man see me nude.  My first 'encounter' was a wonderful guy that said, \"I'm not looking for stretch marks 'n shit, I'm just grateful you're naked with me!\"  \n\nI purposefully internalized that and it has helped me a great deal in my current relationship.",
   "created_utc": 1695499425,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1we142",
   "message": "I got a tumblr account.  \nThe number of people who are completely random and perfect strangers all complement me on the same features, which makes me feel better.   It's superficial, I know, but I was teased so bad in school for being tall and never had a schoolmate want to date me. My self-esteem was in the toilet.  I wasn't good enough. Nor pretty enough. I was too tall.  \n\nIt's not true and it took me years to get over that.",
   "created_utc": 1695500166,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wgbv6",
   "message": "I read a book called ***Refuse to Choose*** that made me stop feeling like there was something wrong with me for starting a lot of different types of projects and never finishing them.",
   "created_utc": 1695501043,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wlbro",
   "message": "I opened an onlyfans. This shouldnt be advertizing or anything but it feels good to get all this nice compliments.",
   "created_utc": 1695502885,
   "score": 2,
   "submission_id": "16q3np1"
  },
  {
   "comment_id": "k1wu4ch",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16q3np1"
  }
 ]
}