{
 "submission_id": "16q8a11",
 "title": "What's your experience with men who are insecure about their dick ?",
 "selftext": "",
 "created_utc": 1695485187,
 "permalink": "/r/AskReddit/comments/16q8a11/whats_your_experience_with_men_who_are_insecure/",
 "score": 225,
 "url": "https://www.reddit.com/r/AskReddit/comments/16q8a11/whats_your_experience_with_men_who_are_insecure/",
 "comments": [
  {
   "comment_id": "k1vks6x",
   "message": "One guy was at the point of booking surgery because there was some slightly abnormal thing going on affecting shape I believe (curve?). I didn't see a single thing wrong with it and told him to hold off because his dick was perfectly fine but there could be major complications from surgery. He was so grateful I convinced him not to go through with it.\n\nETA: He was so grateful he bought me an Amazon gift card lol",
   "created_utc": 1695489147,
   "score": 254,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1wlci3",
   "message": "As a man that has been insecure about my own dick, I will answer this...  \n\n\nFor me its a bit of being a grower and what porn typically set as a \"standard\" which is just as realistic as their \"scenarios\" (for those that do not know, NOT REALISTIC AT ALL).  \n\n\nWhat helped me was understanding anatomy thanks to excellent publications on the internet and Trojan Condoms printable sheet that helps you find out what size best fits. Its designed to be printed on an 8.5x11 sheet (8.5 wide by 11 tall), and it has sizes ranging from well below average, to well above average (0.1%). It was using that printed piece of paper that I learned where I actually stood and what average really looks like.   \n\n\nAfter that I learned that women's vaginas are just as different as mens dicks, some women have deeper vaginas, and their uterus will change its depth in the vagina based on ovulation patterns and arousal. Also some women find it extremely painful to have their uterus hit during sex, others don't mind it and some like it. It's almost like everyone is unique (wow what a revelation that is).  \n\n\nPornography sets up some really really bad expectations across the board and its because they pick and choose and doctor up (literally in cases) to get what they are marketing.   \n\n\nActual, factual, medical, and scientific information will set you free, I just wish the medical community would \"dumb it down\" and provide accurate printable illustrations for \"situations\" like this, but its typically a lot of words and assurances which just does not sell well at all.",
   "created_utc": 1695502892,
   "score": 105,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w3uw1",
   "message": "In the old days having a small dick just meant it was less likely to be cut off by a sword or eaten by a lion - i tell myself this to limit insecurity, i got a combat ready dick",
   "created_utc": 1695496340,
   "score": 236,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vlxll",
   "message": "Personally, I noticed that ( from personal experience) they are very eager about foreplay/going down on a woman over the actual act. Most were also surprisingly really good at it (foreplay)",
   "created_utc": 1695489581,
   "score": 9,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vg4l4",
   "message": "They usually ask on Reddit about people's experience with men who are insecure about their dicks.",
   "created_utc": 1695487396,
   "score": 44,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vua4s",
   "message": "For me I think my insecurities came from the fact I'm a grower not a shower.  I thought there was something wrong with me because all the porn I would watch would feature showers.  What finally helped me get over it was by gaining confidence in other areas of sexuality and it no longer was as big an issue for me.",
   "created_utc": 1695492724,
   "score": 170,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w2zo9",
   "message": "I used to be insecure because of being a \"grower\" until my ex said it's like a magic trick and now it makes me laugh thinking about it and I feel good about my self",
   "created_utc": 1695496009,
   "score": 146,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vjj7i",
   "message": "Just want to point out since some commenters seem to be missing it. OP said insecure about their dick, made no mention of size. You can have a huge dick and be insecure and you can have a tiny dick and be totally secure",
   "created_utc": 1695488677,
   "score": 81,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vw4k3",
   "message": "I understand the concern. My penis is only 5 inches, which I was worried about for most of my youth.\n\nBut as I grew older and got more experience, if anything, the woman I slept with found that too wide.",
   "created_utc": 1695493416,
   "score": 149,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w129r",
   "message": "As a fellow dude who've gone through this insecurity; I had erection problems, couldn't stay hard for long or wasn't at my %100, it was like a semi-erection. I couldn't enjoy sex because of my overrhinking and stress and I couldn't please my partner. My gf was supportive all the time and I went to therapy which solved all my problems in just 2 sessions. I strongly recommend sexual therapy to anyone that has insecurities. \nBy the way I also went through a diet and lost 12 kilograms, I can confirm that my D got at least 1 cm longer and my gf confirms it's gotten huger",
   "created_utc": 1695495275,
   "score": 207,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1xkzay",
   "message": "Lol think every guy is insecure with varying degrees. Size shape blah blah blah. Porn setting unrealistic standards etc.\n\nWorked at one place and we always messed with a guy who had quick wit. About anything really. Just made the day less shitty and always had good comebacks. Anyway.\n\nOne day one of the guys asked him “ hey Brad what’s it like having a little dick?” Without skipping a beat he says “ it’s fine… once they get naked they are already committed” had everyone cracking up but he had a point",
   "created_utc": 1695517816,
   "score": 66,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vcabp",
   "message": "Cum fast, very nervous, anxious but good with foreplay and their hands.",
   "created_utc": 1695485938,
   "score": 84,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vxbtk",
   "message": "I was one of these guys. I chickened out of losing my virginity 3 times because I thought I’d be laughed at because it litterly happened to my friend when he was 15 with a girl and also conditioned to believe I had a small dick by all the boys at school who all seemed to have massive ones. When I eventually was forced into losing my v she boosted my confidence as it turns out maybe those boys at school were overcompensating.",
   "created_utc": 1695493865,
   "score": 251,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vjb5r",
   "message": "I’ve had both huge and tiny.\n\nThe tiny warned me but the huge did not.\n\nWe are talking the almost diameter of a soda can.  \nThere was no way, so I left and we never spoke again.\nCome to find out later, his wife filed for divorce because she literally couldn’t deal with it.",
   "created_utc": 1695488594,
   "score": 191,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w7ae9",
   "message": "I’m not insecure!! Why would you think I’m insecure about that??? I’m totally fine with it, and I’ve literally never had any one complain about it.  And it’s actually AVERAGE by the way.  I mean there are statistics out there. You can look it up!  Besides most women say they don’t even care about size.  It’s more about how you use it!  I’m also super into foreplay, and that counts for a lot!  But it isn’t even small anyway.  Like I’m insecure about *some things* - everyone is - but I’m in NO WAY insecure about my size. Why do you ask?",
   "created_utc": 1695497626,
   "score": 116,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1wm88i",
   "message": "In my experience small dick guys will make big dick jokes and big dick guys will make small dick jokes, me on the other hand. I have a medium dick. It can talk to ghosts",
   "created_utc": 1695503222,
   "score": 219,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vw39m",
   "message": "Depends on how servere the insecurity and what its about. Too small? Too big? Weird shape? Discoloration? A curve? Foreskin? Etc. \n\nA little insecurity is understandable especially with how often society tells men that their dick being wrong means no woman is ever truly satisfied with it(and OH BOY HOW NOT HAVING SEX WITH WOMEN IS ABOUT ONE OF THE BIGGEST INSULT THROWN AT MEN'S SENSE OF SELF WORTH). \n\nBut, when its affecting your sex life or actual life then its a real problem. My experience is they usually project their insecurities on others and think everyone else secretly feels the same way they do.",
   "created_utc": 1695493403,
   "score": 115,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w2t3f",
   "message": "Had an ex who had a perfectly normal size but he was massively insecure. Would jackhammer even though I told him repeatedly I didn’t like it, he was super insecure about me cheating, asked me about other guys dick sizes, talk about tips for enlarging. He was the only person I had been with too at the time so I kinda thought maybe all guys were neurotic like that. Now I cringe when I think about our sex and so glad I never have to be with him again.",
   "created_utc": 1695495940,
   "score": 240,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1wo29j",
   "message": "Reading through this thread and thinking about the lack of support that men feel overall and it's starting to make sense.",
   "created_utc": 1695503927,
   "score": 105,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vmcct",
   "message": "Almost every man is insecure about his dick.",
   "created_utc": 1695489733,
   "score": 240,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1wi04p",
   "message": "About a year into dating my boyfriend i decided I wanted to have sex with him and was comfortable enough to open up (pun intended) to him. I wasn’t a virgin, but I don’t like sleeping with any joe shmo. It was hard to wait that long as both of us have a high libido lol. \n\nWe talked about safe words, what I like and what I wont tolerate. He did the same, then he warned me that he has a small pp. This shocked me as I’ve seen his morning wood before. [We had a sleep over and I woke up before him. (I wasn’t being creepy and purposefully looking) He didn’t have any blankets and he was on his back] By no means was he small!! Not at all! \n\nI reassured him that whatever he had was okay and will not dampen my image of him. Basically a pep talk.\n\n He had a solid 5-6in, enough to hurt/be uncomfortable. Without going into much detail, It was great :)\n\nAfter, he asked me how bad was it? Before I could even answer he said, “it was too small, wasn’t it?” all sad🥺\n\nThis broke my heart because he’s perfect in so many ways, I don’t like seeing him beat himself up. I ended up disclosing that my dildo is only 4in long. That shocked him to say the least 😂😂\n\nWe’ve been together 4 years now and are going strong!! I love my baby \u0026lt;3\n\nMoral of the story, bigger isn’t always better ;)",
   "created_utc": 1695501659,
   "score": 95,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1wr14y",
   "message": "Ya know, I didn’t use to be insecure about my dick, never a single complaint and even some compliments…Until I had a woman fake her enjoyment and then tell me later “I couldn’t feel you inside me but you looked like you were enjoying it so I didn’t say anything.” I’ve been self-conscious ever since.",
   "created_utc": 1695505095,
   "score": 70,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w69yt",
   "message": "Am insecure. I think it’s because the perception that the dick is our defining tool during sex. Takes a lot of self reflection to realize sex is much more than dick. \n\nKat Williams said it best: Eat her pussy so good she forget dick coming next. \"You brought Dick too?” Have her talking to herself like \"he brought dick With him too\"",
   "created_utc": 1695497247,
   "score": 155,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vmmpp",
   "message": "I find it annoying tbh..An ex never accepted my compliments about his because he was 5 inches so not big enough according to him.",
   "created_utc": 1695489839,
   "score": 80,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1wc4dq",
   "message": "Half of these comments are people dick-shaming with stereotypes. This is literally just reinforcing people's insecurity.",
   "created_utc": 1695499434,
   "score": 90,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vam5r",
   "message": "Oh, plenty of experience, I am one",
   "created_utc": 1695485297,
   "score": 100,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1wg011",
   "message": "The penis is a important part of men's self-image and ego and also the kind of body-shaming that is still a free for all. Saying anything negative about a women's looks, weight, or even worse their genitals: bloody murder! Dick-shaming: always funny.",
   "created_utc": 1695500919,
   "score": 69,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1viknk",
   "message": "they tend to be insecure about their masculinity overall",
   "created_utc": 1695488319,
   "score": 219,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w5m0h",
   "message": "Eat her til she cums she will not gaf about how big or small you are (usually)",
   "created_utc": 1695496997,
   "score": 121,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1vg857",
   "message": "The small penis is the last body part where body shaming is still socially acceptable",
   "created_utc": 1695487433,
   "score": 218,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w89y4",
   "message": "Not exactly answering your question, but kind of on point:\n\nI was seeing a girl for a few weeks and it was going OK. She paid me some nice compliments in that area and so, like any guy, the ego boost certainly felt good.   But then, on behalf of men around the world, I had to kick her to the curb….\n\nAfter a nice dinner date, we were back at my place, having cocktails, and just having one of those “sex talks“ where you can really learned a lot about somebody if you listen closely.  I asked the same questions. Every guy asks every woman, “so is size important?”  my entire opinion about her changed when she said to me:\n\n“ bigger isn’t always better. How you use it is what matters.  HOWEVER, two small is no good.  This one guy, we were taking off our clothes to have sex for the first time, and when I saw this tiny excuse for a dick, I couldn’t stop myself from laughing, and just said OH NO, SORRY I CANT!”\n\nMy jaw about hit the floor. I said something like “so you are a terrible human being then?” She tried to laugh it off with a quote that was probably a little mean wasn’t it?”  \n\nI just remember thinking terrible thoughts about what this guy might do to himself having been humiliated like that.   That was the last night I ever saw her.",
   "created_utc": 1695497995,
   "score": 112,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1xc2mz",
   "message": "I’m so insecure I’ve turned down sex many, many times.",
   "created_utc": 1695513942,
   "score": 12,
   "submission_id": "16q8a11"
  },
  {
   "comment_id": "k1w8gq7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16q8a11"
  }
 ]
}