{
 "submission_id": "16qefb8",
 "title": "What‘s the horniest thing you ever did?",
 "selftext": "",
 "created_utc": 1695500996,
 "permalink": "/r/AskReddit/comments/16qefb8/whats_the_horniest_thing_you_ever_did/",
 "score": 80,
 "url": "https://www.reddit.com/r/AskReddit/comments/16qefb8/whats_the_horniest_thing_you_ever_did/",
 "comments": [
  {
   "comment_id": "k1xr14k",
   "message": "Fucked a woman that was 30+ years older than me in the back seat of her car while her dog watched.\n\nUnintentionally got myself a sugar momma for that.",
   "created_utc": 1695520574,
   "score": 190,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xa6gz",
   "message": "Drove 2 hours to just fuck for 2 minutes",
   "created_utc": 1695513113,
   "score": 4,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xtkek",
   "message": "In my culinary class i burnt my hand really bad so i tried jerking off with the other one but it was weird so i just used the original it hurt like hell but whatevs",
   "created_utc": 1695521717,
   "score": 63,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1wgzf1",
   "message": "investigated reddit subreddits",
   "created_utc": 1695501288,
   "score": 231,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xoqor",
   "message": "Don’t think it’d be the horniest but I here we go.\n\nEx and I were in her room while the whole family was home. She was not allowed to close the door anytime I was over. It was okay to leave it open to the point where even a centimeter gap was left open it just could not be closed. \n\nHer and I were cuddling, and the random horny energy just appeared out of nowhere due to us just being really close to each other (y’all know the feeling lol). \n\nNext thing you know, both of our bottom halves came off, blanket on and we went on a mission bravo 6 going dark w/ a suppressor because of her family being right there all hanging out in the living room. \n\n2-3 minutes later, we heard footsteps and her mom talking directly to my ex as she was approaching and getting closer to the barely opened door. Both of our face lit up and I just swooped my head on her chest and pretended to be asleep while she turned her eyes towards the tv, at the same time rubbing my back. \n\nThis all happened within 3-4 seconds prior to her mom opening the door. Happened very fast. They finished the conversation and her mom left the room. I was still rock hard inside her. Her and I both looked at each other and decided to call it off because we both got scared lol. \n—-\n\nLater on I realized her mom probably knew what we were doing just because of the nervousness from my exes voice and most likely her facial expression.",
   "created_utc": 1695519516,
   "score": 3,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1y9d0i",
   "message": "When my wife and I were dating, she 16, me 17. I snuck over to her house late at night.  Her mom had a red car that was really sun faded. So this night I knocked on her window. Helped her crawl outside and started making out on the side of her house. She showed me that she \"shaved\", it was my first time seeing her like that and I went to town. We were trying to figure out how to do this standing up and decided to lay her face down on the hood of her mom's car. All is done and she goes back to her room. \nI come over the next day to help her job hunt and she shows me her mom's car in the daylight. Not sure if you know but heavily oxidized paint on cars really like to absorb the oils from your skin. You can see the silhouette of a girl on the hood of the car. You can make out hand prints, a cheek, her boobs,  even her bellybutton.  Her mom didn't notice until she was in town and after driving her car to church. My gf (wife) convinced her that someone was playing a prank on her. I saved the day by washing and hand waxing her car. \n\nFast forward a few weeks and I decided to pay my gf another late night visit. This time it was in the back seat of my camry (because I had learned my lesson I guess). She went back inside and went to bed. I started my car (mind you this car was flawless and had no mechanical problems ever, I wouldn't hesitate to drive it from California to Florida) when I started it, the solenoid decided to stick and cause my starter to stay in the starting position. Not sure if anyone has heard this before but it's like sticking a screwdriver in a metal fan blade. Noisy af. Her mom came running outside, neighbors turning on porch lights and dogs going crazy in the neighborhood. \nThat was fun trying to explain why I was there. Lol.",
   "created_utc": 1695529838,
   "score": 245,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xmzo6",
   "message": "Jerked it to some mountains that looked like titties.",
   "created_utc": 1695518718,
   "score": 168,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xno9c",
   "message": "At a small town wedding, but the wedding was **huge.** \n\nTalking like, quadrupled the population type.  Two ‘important figures’ got hitched, and the brides family was very close to mine.  \n\nGot a little tipsy, and had a few shots I could’ve taken.  But I was civil.. in public lol… \n\nAt the peak of the night, when most of the peoples of the place were in dance floor mode.  I went to go to the bathroom, saw the line was stretched along a wall and sighed.  \n\nFriend of the family, who I had just met via drunk aunt intro’s, came up to me just then grabbed my arm a little and then squeezed after the question...  *”We can use the church down the street.  You need to use the bathroom, right hun?”*  she was checking me out all night and I knew this was massive potential to lead to something wild asf\n\nLong story short, I went motorboating inside of a church with some rich lady",
   "created_utc": 1695519026,
   "score": 113,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1widdt",
   "message": "My friend literally told me to hang out with his aunt and we did more than that",
   "created_utc": 1695501796,
   "score": 189,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xlo8t",
   "message": "I spent almost 10k for a blowjob at a stripclub after a few months of sexless separation",
   "created_utc": 1695518131,
   "score": 38,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1y0nnc",
   "message": "My Dick brought me to places I woudnt go without a gun.",
   "created_utc": 1695525077,
   "score": 146,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1x2dm8",
   "message": "Had sex with a girl on the hood of her car while it was in the driveway of her parents' house in the middle of a typical suburban neighborhood. Just a makeout session that got out of control. I happened to be wearing a huge jacket that draped over both of us while I was on top of her. So we went for it.",
   "created_utc": 1695509728,
   "score": 13,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xjnai",
   "message": "Used to leave the bar to go have sex in my truck in a near by state park that had a dark road that no one could see.\n\n\nUsually we went back to the same bar with said woman that night, sweaty and a little disheveled.\n\nWoman is now my wife of nearly 13 years, so it was worth it.",
   "created_utc": 1695517225,
   "score": 35,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1wzh86",
   "message": "Once I cut off circulation of my ejaculation and achieved a Heaven-like eight-minute orgasm chasing the feeling and then exploding at the end. I wouldn't do that again, but it was a fantastic feeling.",
   "created_utc": 1695508510,
   "score": 19,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xe47p",
   "message": "Fancied the shit outta this girl in university. She was a wee bit older. She worked in one of the local bars and had a side gig as a Suicide Girl, so I was borderline obsessed with her. \n\nOne night, thinking it would be another failed attempt to chat her up, things actually went my way and I ended up back at hers.\n\nNot wanting to mess up my chance I made an absolute meal out of her pussy. Just ate that thing like the cure to cancer was at the back of it.  She seemed to love the borderline worship and came really hard. \n\nSo anyway, I'm thinking nows time for the main event but she stops, says \"that was wonderful but I have an early start tomorrow\" and then rolls over  to go to sleep. \n\nSo I tried to sleep but not a chance. My dick stayed hard for ages, the fucker was pulsating. So, I checked to make sure she was out, and then started to very discreetly see to myself. \n\nTook ages but eventually I got close when it hit me \"what the fuck am I gonna do with this when it comes out?\" \n\nNo tissues or anything by the bed so I ended up just catching it in my hand. \n\nNow I'm looking around this room in the dark for anywhere to deposit this. There's a bin by the bed but it's an auld wire mesh one with no bag, so that's no use. \n\nI get my phone out to try and shed some light but this was back in the day, it was an auld 3210 with a dull Green glow that would barely startle a Gremlin. \n\nMeanwhile, like any good sauce, this stuff is starting to separate in my hand and is getting more and more watery. \n\nAnyway, this, THIS is the moment she decides to wake up and roll over to cuddle. \n\nDesperately wanting to see this girl again and with no other options I took the only avenue left ...and hoofed it down my throat. \n\nIt's actually not as bad as it sounds, though I wouldn't be dipping my chips in it any time soon, the stuff was largely inoffensive. \n\nAnyway, that was about 15 years ago at this stage and we now have three beautiful children. \n\nLOL! Nah. We had breakfast the next morning but then she went off to some appointment and I went to class and I never got so much as her phone number. \n\nShe'd still flirt and tease me at the bar when I was around but  I never got with her again. I think she got off on just how infatuated I was with her.",
   "created_utc": 1695514824,
   "score": 9,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xnle1",
   "message": "A long time ago, my crush from band class gave me her old trumpet because she quit, so my immediate thought as a horny teenager was to empty her spit from the valve and use it to stroke my meat",
   "created_utc": 1695518989,
   "score": 40,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xjl1a",
   "message": "I once woke up around 2am and drove 4 hours to a girl's house after she called me over. I had to work the next day too. \n\nDrove all the way there with a printout of directions from Map Quest. This was before modern day smart phones.\n\n\nI even had the presence of mind to print out directions from the address she gave me to my job. I taped the return directions to my dashboard. Because that drive was gonna be ROUGH.\n\nWorth it. She was BAD.",
   "created_utc": 1695517198,
   "score": 221,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xr19w",
   "message": "Fingered an ex under the table when she handjobbed me during a family diner, with ver parents and grandparents a round the table. We were teenagers and used to have sex like 10 times a day. I have not met a single person with such a sex drive and I dont think ill feel that kind of intensity again….",
   "created_utc": 1695520576,
   "score": 28,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1wxzt0",
   "message": "Was playing pool on the second floor of a pool club, they usually didn't open it unless for tournaments but I played there a lot so they let me up there, it was just my and my ex gf.\n\nShe bent over to take a shot, I put my hands straight up her skirt and pulled her underwear down and smashed her right there over the pool table.\n\n5 stars, would recommend.",
   "created_utc": 1695507889,
   "score": 135,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1whjqy",
   "message": "A one armed Mormon stripper",
   "created_utc": 1695501493,
   "score": 46,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1wi42y",
   "message": "Went skinny dipping and then gave 3 blow jobs",
   "created_utc": 1695501699,
   "score": 157,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xqoqc",
   "message": "Went on a solo trip in Japan, met up with a British guy on tinder, took him down a tight alley at midnight in shinjuku, sucked him off, plastered my face, said thankyou and went back to my airbnb haha",
   "created_utc": 1695520414,
   "score": 39,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xnvjp",
   "message": "Had a friends-with-benefits situation and we were both invited for a sleepover at a mutual friend’s place who did not know. We were sleeping on opposite sides of the mutual friend’s room but we were so horny that we would crawl across the floor to silently kiss and give oral. It was so hot and we were SO LUCKY the mutual friend who slept on their bed wore noise canceling headphones. Homie didn’t even stir and snored. \nI miss it just thinking about it lol\n\nEdit- to clarify, it was a straight FWB. So I gave him head and he ate me out.",
   "created_utc": 1695519118,
   "score": 32,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xlt1g",
   "message": "Ashamed to say it, but when I was 17, I would sometimes smell the car seat of where my old gf would sit after one of our dates. We were never that intimate so I think it might’ve been my way of coping with it. I never told her about it.",
   "created_utc": 1695518190,
   "score": 144,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xwncv",
   "message": "Was pretty drunk at a wedding reception and took a women to a storage area and completely slutted her out. Like really rough pounding, spanking, gagging her, calling her names, facial, ruined make up, it was hot and rough. We’ve been married for 11 years, together for 16. When the wedding pics pop up my wife always ask if I remember that wedding with a grin.",
   "created_utc": 1695523146,
   "score": 141,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xl526",
   "message": "Had sex in the mental institution with my then committed GF in a room with no locks.",
   "created_utc": 1695517888,
   "score": 0,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1wknae",
   "message": "When I was in high school, this kid was making out with two chicks in the back of the school bus. I tried to insinuate myself, and was politely told to leave.",
   "created_utc": 1695502632,
   "score": 248,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xalqg",
   "message": "Did a married woman anally standing up with her bent over a hotel balcony with cars passing below.  I still don't think that tops the gal who went skinny dipping then blew all 3 of her friends.",
   "created_utc": 1695513296,
   "score": 200,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xoa58",
   "message": "Hooked up with someone from Reddit",
   "created_utc": 1695519306,
   "score": 40,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xkldt",
   "message": "Met this older lady at a night club at a resort I was staying at. We were outside sitting at a table on the  patio socializing by ourselves when she just randomly threw out “I want to suck your d***”. Instantly dropped pants and she pleasured me underneath the table. Throughout the rest of the night we walked around the resort and she sucked me off 5 more times at random locations lol",
   "created_utc": 1695517646,
   "score": 121,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1y9ear",
   "message": "Hurricane irene hit my area really hard and there was intense flooding and trees coming down all over my town. I lived on the other side of town from my gf we were horny and i was in highscool at the time. I rode my bike 10 miles across town during the middle of the hurricane to get laid. I was the only person i saw the entire time aside from armored disaster relief trucks. I had to climb over giant trees and drag my bike across. I walked my bike through waist high flood waters where it was too rough to ride. I rode past dozens of downed powerlines and street signs. The wind was whipping person sized branches past me. I literally thought i was gonna die. Still got laid though so it was worth it. Looking back i cant believe what a horny little dumbass i was.",
   "created_utc": 1695529858,
   "score": 54,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1wry4k",
   "message": "Fucked my hand\n\n*Sad Music starts to play*",
   "created_utc": 1695505460,
   "score": 38,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xtqqb",
   "message": "Drove literally all day to have sex and didn’t actually have sex. Saw a cool dam though",
   "created_utc": 1695521800,
   "score": 174,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xhcsp",
   "message": "8th grade. Jerked off as I was walking home from track practice.  Like actually walking and jerking it at the same time through a neighborhood.",
   "created_utc": 1695516227,
   "score": 229,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1x7gln",
   "message": "Got drunk at dinner with my gf on our anniversary, and on the walk home and decided it would be a good idea to bend her over in a doorway just outside the city courthouse. After I filled her up we went around the corner to the plaza where there was a live music thing going on. We sat on a step, she sat on my lap and I played with her pussy (it was late and dark) and teased her for a little bit while we drank out of a flask. After we finished it we walked the rest of the way home and then we finished her off and went to sleep. That was a great night and it being at the courthouse was the icing on the cake lol.",
   "created_utc": 1695511926,
   "score": 50,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xwzn4",
   "message": "Got fucked in some small clearing between trees and shrubbery in some ravine. I ran into stinging nettle while we made our way down there and I had been wearing a skirt. It fucking hurt but I still let the guy smash 💀 He was great, we fooled around a few times that summer  😩",
   "created_utc": 1695523309,
   "score": 100,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1ws78v",
   "message": "I was too horny and I decided to go fuck my ex when I was trying to stay the fuck away from her. She started sending nudes and I just decided to take her for another spin.",
   "created_utc": 1695505560,
   "score": 69,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1wzu16",
   "message": "Let a couple guys watch me finger my pussy and asshole until I came. I didn’t know them.",
   "created_utc": 1695508659,
   "score": 140,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xcfwb",
   "message": "Hooked up with my ex’s aunt 2 years after we broke up. Even knowing full well that she had gone from an optometrists assistant (I think was the title), to an escort. I had always thought she was attractive as hell and I had graduated highschool a year and a half before. She was a pothead and as was I, I told her I knew where to get some Molly if she really wanted to have fun, we both took some and things went from there. This was almost 10 years ago now, I don’t do drugs anymore and I am married with kids, I slowed down, A LOT.",
   "created_utc": 1695514102,
   "score": 240,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xfzu9",
   "message": "Had sex with a girl in her car in a regionally known hiking trail parking area. We’re in her back seat going at it while trying to hide out of family’s views. 10/10 would recommend",
   "created_utc": 1695515634,
   "score": 167,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xx3st",
   "message": "Was at a dive bar with friends. I’m a good clean guy but was thinking with my wrong head. Mother and daughter came in clearly looking for trouble and dude so I started a conversation with them…daughter was hot but def dressed like sluts. Decided to leave with them. Daughter was probably 21-24 and mom was in her forty’s. \n\nI’m in the backseat drunk with another random dude that came along and mom and daughter in the front. At a red light mom who is driving did a line of coke. I was like wtf did I get into but still drunk and for some reason didn’t get out of the car. \n\nMade it to some apartment complex who knows how long later. Went in and there was no furniture. Mom brought up some dudes that were hanging outside and they started doing drugs and doing a gang bang in the living room area. \n\nThe daughter asked me to come with her to the community pool. She gave me a blowjob by the hot tub area before a bunch of other dudes showed up and just started getting naked. I got out of the way and they just started running train on her right there. \n\nI left the pool area and found a cool spot to sit by an apartment wall and passed out from somewhere around 3am to 5am. I woke up kinda sober and climbed a fence and started calling my buddies for someone to pick me up. I ended up being in the seediest part of town 25 miles away. I got picked up and brought back to my apartment.",
   "created_utc": 1695523363,
   "score": 51,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xf8n6",
   "message": "Beat my shit to a ceiling titty",
   "created_utc": 1695515307,
   "score": 233,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xbda4",
   "message": "Redditors try not to ask sex related questions (hard mode)(not easy)",
   "created_utc": 1695513633,
   "score": 93,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xpyco",
   "message": " 1980, 19 years old, in the Navy (and I swear, if any one of you starts singing it...so help me...) and stationed at the Navy Annex, living at Fort Myer. There was a \"porn\" theater, not far off base. I put \"porn\" in quotes, because they never showed hard x-rated films; the actors' privates actually had a black box over them on the screen. For my age, with extremely limited exposure to porn except for my occasionally beating off to, this was pretty stimulating to a horndog as I was back then. After leaving a playing one night, there was a telephone booth just outside the theater. I called my then girlfriend (who is now my beautiful wife of nearly 36 years), collect, via my parents' phone line (look it up, this is how long distance was done back then), we spoke for a while (we had not yet begun intimacy with each other, but damn, her voice!).\n\nIt was about a 1.5 mile walk back to the barracks, dead quiet, and probably close to midnight. I was horny beyond reason, and I never liked masturbating in the bathroom, and I couldn't in my room because my 2 roommates would definitely notice. \n\nRight next to Fort Myer us Arlington National Cemetery, and there was a stone wall about 4 feet high and  absolutely no one around except the sentry at the guard shack about 1/4 Mike up the winded road.\n\nI couldn't take it anymore, I was almost painfully erect, leapt over the wall and hid behind a rather huge monument. I did the deed, thinking of my girlfriend (the movie really wasn't that stimulating or even inspiring), finished rather quickly and got myself back together, jumped the wall and kept walking back to the barracks...\n\nWithin the next day or so, walking to my shift at the Navy Annex, curiosity got the better of me and I wanted to know whose graveside I soiled the other evening...\n\nI found the monument, walked around to the front, and the name Robert Todd Lincoln stared me right in the face..I honestly don't recall my initial reaction, but I do remember laughing almost all the way to work.\n\nIt was a good day...\n\nEDIT: Instead of being civilly corrected and informed of my mistake, I've been told that I'm \"full of crap,\" that Mary Tidd Lincoln is buried in Springfield, IL. I did some digging (pun intended) and discovered it is ROBERT Todd Lincoln who is buried in Arlington National Cemetery. I've edited my post, and I feel a bit less \"embarrassed\" that I didn't soil her gravesite/memorial.\n\n2nd EDIT: everyone please bombard u/JackfruitJackelope with a plethora of thanks for responding to my correction of my photographic memory, and not recollecting and saving for posterity, the EXACT name of the gravesite that I soiled, one night, 44 years ago.",
   "created_utc": 1695520072,
   "score": 38,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xc5np",
   "message": "I made my partner cum in his pants in front of his friends and family… I mean they had no idea lol but it kinda kick started his new interest in “exhibitionism”.",
   "created_utc": 1695513979,
   "score": 77,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xkckq",
   "message": "Had worked a really long day at a customer site with the CEO/primary owner and one of the other owners.  We worked from 8 in the morning until 8 at night and then had a 7 hour drive back home.  We were rotating drivers. I tried to sneak in a nap so that I wouldn't fall asleep during my shift.  I was in the backseat and for some reason horny as hell and just could not fall asleep due to the boner.  So I threw a jacket over me and got myself off.",
   "created_utc": 1695517538,
   "score": 118,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xq37c",
   "message": "Went skinny dipping then this chick blew my 2 mates and I",
   "created_utc": 1695520135,
   "score": 115,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xit1l",
   "message": "You ever jack off in a portajohn?",
   "created_utc": 1695516862,
   "score": 24,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xwax0",
   "message": "Degenerates all of you",
   "created_utc": 1695522981,
   "score": 150,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xs5xe",
   "message": "Fucked my girlfriend on the tile floor of the local pizzeria , i was the dough guy .. the dough shiift started at 4am ,she passed by for a quickie at 6 am, later on that yearthe new manager girl was flirting and i asked what she was doing tonight , she said \"you\"\nI had mojo back then, not as much these days lol. Good times",
   "created_utc": 1695521087,
   "score": 110,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1whyhw",
   "message": "Replied to this post",
   "created_utc": 1695501644,
   "score": 97,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1ydki5",
   "message": "I masturbated while driving 100 mph in the middle of nowhere, almost wreaked. The post nut clarity hit really hard really fast. Would i want to be found with no pants on flipped in a ditch? Nah.",
   "created_utc": 1695532413,
   "score": 23,
   "submission_id": "16qefb8"
  },
  {
   "comment_id": "k1xd7gq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16qefb8"
  }
 ]
}