{
 "submission_id": "16qg5lq",
 "title": "Married people of Reddit, what is a personality trait that your partner started showing (that they never showed when you two were still dating) the moment you two started sleeping in the same roof?",
 "selftext": "",
 "created_utc": 1695505395,
 "permalink": "/r/AskReddit/comments/16qg5lq/married_people_of_reddit_what_is_a_personality/",
 "score": 104,
 "url": "https://www.reddit.com/r/AskReddit/comments/16qg5lq/married_people_of_reddit_what_is_a_personality/",
 "comments": [
  {
   "comment_id": "k1xmh0k",
   "message": "20+ pillows on the bed and the insane amount of fall decorations.",
   "created_utc": 1695518488,
   "score": 50,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xi38q",
   "message": "Talking for myself. I never showed my now husband my ADHD doom piles/I am either obsessively organized or a dumpster fire.",
   "created_utc": 1695516551,
   "score": 179,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1x6hrk",
   "message": "Tantrums resulting in self harm . A complete lack of control over negative emotions , not towards me but towards themselves. Felt manipulative to me as I always felt it was my fault because they only did this around me and only in response to things I said . Like I triggered them almost . \n\n We have both since matured and they’ve since received counselling.",
   "created_utc": 1695511509,
   "score": 121,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1y10mi",
   "message": "I knew he was messy, since I had been in his house before we were married, but once we were under the same roof it got out of control with clutter everywhere, dinning room was for 6 only had space for one to eat due to the big mess and also he started with compulsive buying unnecessary stuff. After 14 years he is now my ex.",
   "created_utc": 1695525260,
   "score": 126,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xl5lz",
   "message": "Incredibly generous and always trying to do little things that make me happy. He is just wonderful.",
   "created_utc": 1695517895,
   "score": 205,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xorpp",
   "message": "How fucking loud he is when he coughs or when he gets ready for work in the morning",
   "created_utc": 1695519529,
   "score": 64,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yghdk",
   "message": "His childlike side... in the best way. Once I moved in, he opened up a lot more and I got to hear his real laugh, see how excited he got about his passions when he wasn't trying to \"play it cool\", and enjoy simple things like just snuggling and going out for ice cream and trying to out-do each other with puns and dad jokes. I like his goofy, hyper, golden-retriever energy side a lot more than than the \"cool, tough, and manly\" face he showed me before. Now I get both! \n14 years later and I am somehow more in love with this man every day.",
   "created_utc": 1695534240,
   "score": 49,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z8rqk",
   "message": "The most ATROCIOUS farts to ever exist. I mean LOUD, LONG, WET, and VIOLENTLY disgusting. I cannot describe how bad they are. And it is ALL. THE. TIME. He held them in every time we were together until we moved in together. I’ll be honest, it’s a turn-off. I love him to death, but my god. If he farts we’re done for the rest of the night. I’m genuinely concerned for his health but he insists it’s “normal”. NO IT’S NOT.",
   "created_utc": 1695554820,
   "score": 68,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1x5p60",
   "message": "Great memory.",
   "created_utc": 1695511168,
   "score": 128,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xnoa4",
   "message": "Her addiction to soap series.",
   "created_utc": 1695519026,
   "score": 51,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1x00bd",
   "message": "Nothing bad. But she cleans the house a lot more. I think it has to do with we were living in the house my ex and I bought (I won the house in the divorce). We ended up selling and my wife and I picked out a house of our own. Plus, her name's on the deed so she's more attached to it.",
   "created_utc": 1695508730,
   "score": 234,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xpbyy",
   "message": "I knew it, but its adorable to me, her drink collections. Bedside table, drinks. Office desk, drinks. We watch something for a couple hours and the couch side table, drinks. She thinks at some point it will bother me, but I love it. It's like her secret that I get to be a part of.",
   "created_utc": 1695519785,
   "score": 129,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xuokt",
   "message": "She vents a lot when she comes home. I’m still learning how to help, it’s a work in progress",
   "created_utc": 1695522220,
   "score": 84,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1ypr5l",
   "message": "a 7 year relationship (5 living together and owning a business together) counts, right?\n\nhe is completely and utterly lazy when it comes to cleaning. i didnt notice this when we were dating because he either cleaned to impress (trap) me or we were so wrap up in each other when i visited that i didnt notice. \n\nits not until i moved in that i noticed the never ending toothpaste spit in the sink, the clothes on the floor next to the hamper, the trash being taken out once a week, the cat litter not being changed until it stinks, the empty shampoo bottles everywhere, the plates being left out for days, his laundry being on the bed all week, underwear in the kitchen, wallet under the table, remote controls in the bathroom, just not cleaning anything or even tiding up behind himself... and the most gross .. the cum shirt! the shit he uses to catch his semen when hes masterbating, he leaves on the floor and the cat likes to lay on it.",
   "created_utc": 1695540661,
   "score": 73,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1x3n11",
   "message": "Controlling every aspect of simple stuff, like getting popcorn.\nTake out the bag, open it and put the cheese powder, use the pink container .....",
   "created_utc": 1695510274,
   "score": 108,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xgmyh",
   "message": "How did I marry a man who makes the bed *every* day??  You guys, he makes the bed while I'm STILL IN IT!  Complete psychopath!  (But seriously, get to know them very well before moving in.  Even more so before marriage.  Surprises will still happen, but it shouldn't be anything too drastic, especially *immediately*)",
   "created_utc": 1695515913,
   "score": 71,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xmt8w",
   "message": "Aggressive cuddler, he even cuddles me from behind the whole time and chats while I cook sometimes. I'm a big introvert and it weirded me out in the beginning, but I'm used to it now. Or more like I forced myself to get used to it, still hate it lol",
   "created_utc": 1695518639,
   "score": 98,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yxvj8",
   "message": "Well, he's horny most of the time. I have no complaints about it though.",
   "created_utc": 1695546930,
   "score": 29,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z0noe",
   "message": "She sometimes fights things in her sleep. I’m her dreams I guess it’s probably something important but to me she’s just wriggling around throwing elbows and hands around the bed lmao. We started with a double and now have a king. I’m a very light sleeper so I still wake up when she’s punching around, but I definitely don’t accidentally get hit nearly as often. It’s kinda cute too, because she’s absolutely not a fighter when awake, she’s far too dainty in the arms to be all that effective.",
   "created_utc": 1695549113,
   "score": 25,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xnfz5",
   "message": "Became significantly more self-absorbed and didn’t take me or my goals/wishes into account anymore when considering the future.",
   "created_utc": 1695518921,
   "score": 23,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xwzpj",
   "message": "My wife is a bit of a hoarder. I thought it was because her place was so small when we first got together, but it’s just accumulated over 10 years. Not crazy bad but we have tons of clutter in our house.",
   "created_utc": 1695523310,
   "score": 20,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z49k3",
   "message": "Not married, which, thank God I didn't do that. Once we started living together, even before our daughter was born (I have sole custody because she abandoned us.) She would CONSTANTLY try and get me to go to bars or parties with her friends knowing full well I am a recovering alcoholic/addict. Like, if people are drinking around me like, at a barbecue or something, that's whatever, easily avoidable. \n\nI'm not going to actively put myself in an environment filled with temptation. She would constantly fight with me that I wasn't \"Fun\" anymore and \"Never wanted to do things with her.\" \n\nThe best day of mine and my daughters life was when she took her opportunity and left. \n\nTook a while to get over it, but I'm fine. I've also enrolled my daughter in child therapy because she's asking those questions like, \"Why doesn't mommy want me, why doesn't mommy live with us, why doesn't mommy love me?\"\" Breaks my fucking heart that someone could be capable of abandoning their own child who they birthed like it was nothing. \n\nThis was a case of \"You think you know someone until you live with them.\"",
   "created_utc": 1695551800,
   "score": 39,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1wwjmc",
   "message": "Anger issues. He broke a door, his phone, threw our daughters (empty) car seat at the wall, and became verbally abusive.",
   "created_utc": 1695507301,
   "score": 65,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1y60c2",
   "message": "Low self esteem,  attention seeker. A good liar and vindictive.\nThank God I got rid of her.",
   "created_utc": 1695527901,
   "score": 14,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yeeql",
   "message": "Turns out the sweet Catholic girl I married 41 years ago would be quite adventurous in bed. That was unexpected but very welcome.",
   "created_utc": 1695532938,
   "score": 42,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yp6q4",
   "message": "SNORING",
   "created_utc": 1695540233,
   "score": 28,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z3g87",
   "message": "We moved in together way before we got married, but our bond has only gotten stronger over the years. One thing I've noticed is that I'm not craving sex as often as I used to when we first moved in together. Not because I don't want it or think she's unattractive: quite the opposite. I just find that I value her companionship and love so much that when it happens, it happens. Our bond is stronger than it ever has been, and we've been through so much together. We haven't even had an argument in a long time, because we make decisions together and compromise. I absolutely love my wife and the life we have together. We may struggle financially sometimes, but boy do we get shit done together.",
   "created_utc": 1695551228,
   "score": 28,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yw1ej",
   "message": "Sleepwalking. And sleep panic leading to sleep-attempt-of-killing.",
   "created_utc": 1695545514,
   "score": 12,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xr1xs",
   "message": "I feel like there are two comments happening here:\n\n* Comments that understood the question, but where one wonders how long they knew each other before sleeping under the same roof.\n* Comments that did not understand the question and say \"nothing, because we lived together before we got married\".\n\nSorry, OP.",
   "created_utc": 1695520584,
   "score": 57,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yzb1q",
   "message": "Steely determination and a toughness that was a shock for such a gorgeous girl. Also I swear like a sailor. I’ve never heard her say a single swear word. I even offered to pay her to just utter one word. No way.",
   "created_utc": 1695548061,
   "score": 10,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z2tf7",
   "message": "that her parents never showed her how to clean, wash dishes, do laundry, or cook.\n\n\n\n...then when i have to show her so that I'm not forever the only one, she would get defensive and say \"if you don't like how i do it, do it yourself \"\n\n\nbig hidden red flags that took way more effort to overcome than a lesser man would have stepped up for.",
   "created_utc": 1695550768,
   "score": 10,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1x333i",
   "message": "Master procrastination - but that wasnt after marriage, that was when we moved in together",
   "created_utc": 1695510033,
   "score": 17,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1ymjl0",
   "message": "He eats my snacks constantly. He has his own snacks and he'd rather eat mine. He also makes fun of the TV shows I watch, like Walking Dead.\n\nI can live with that though, he's a good guy.",
   "created_utc": 1695538345,
   "score": 21,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1y46h5",
   "message": "I had no idea that he shaved his ears once a week. He can be passive-aggressive, but he's got better about it. We try to hold each other up.",
   "created_utc": 1695526900,
   "score": 9,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zg1iq",
   "message": "My wife to this day comes to bed around midnight and wakes up at 4:30 to workout before work. She never is tired throughout the day and never takes naps. While I on the other hand go to bed around 8 to get up at 4 for work and my ass is draggin throughout the day. I wish I could operate on 4 1/2 hours of sleep during the week.",
   "created_utc": 1695558948,
   "score": 8,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yy9i7",
   "message": "He knocks his hand down on the couch to get attention. It’s infuriating",
   "created_utc": 1695547238,
   "score": 9,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z3ee0",
   "message": "Lack of any level of patience. Like, from very positive, never-nagging personality to I have no patience for anything. \n\nI have a full of patience personality and I m always calm (even when the world falls apart) so  this was a shocking revelation which I have not and will never get used to. It didn’t help when I realised she grew up in a tense environment which lacked common sense. \n\nI can tolerate this normally but it deteriorated when kids came into play and make things more difficult now to help them grow up in a calm environment which is important to me.",
   "created_utc": 1695551191,
   "score": 9,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xh0f5",
   "message": "Instant dead bedroom if she couldnt get pregnant.",
   "created_utc": 1695516075,
   "score": 25,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1y54v6",
   "message": "The lying. It was subtle at first and then it was like huge things.",
   "created_utc": 1695527417,
   "score": 14,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zcock",
   "message": "She tries to snore the house right off the foundation and farts like a water buffalo every night while she gets her beauty sleep",
   "created_utc": 1695557191,
   "score": 5,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1y1htk",
   "message": "She got really spiteful and physically abusive.",
   "created_utc": 1695525504,
   "score": 11,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1x2a0i",
   "message": "Nothing really. One really should live with someone before marrying. I cannot imagine really getting to know someone only once you're already legally committed.",
   "created_utc": 1695509685,
   "score": 53,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yx13z",
   "message": "Uncontrolled anger, being verbally abusive after too much alcohol, drinking way too much alcohol, running away from any confrontation, low libido",
   "created_utc": 1695546275,
   "score": 4,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z97ih",
   "message": "Becoming possessive over me, eg if I go to bed and just read a book he moans about why I didn't tell him what I was going to do .",
   "created_utc": 1695555110,
   "score": 7,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z9s8w",
   "message": "I know this is a bit different, but I thought I’d share. \n\nThere were so many little things that bugged me here or there when dating, but we were long distance for so long (5 or so years) and so it was just little things and I truly didn’t not see the significance of them. Then he had a seizure one night, is diagnosed with brain cancer, and now he’s not only home full time but we have all the brain cancer stuff to deal with too. And so now we’re learning to live with each other full time, but I’m also learning some of the annoying things are brain cancer related…? So much wtf I have a hard time even functioning somedays. Life can hit you hard and in unexpected ways.",
   "created_utc": 1695555459,
   "score": 10,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zeda5",
   "message": "My ex husband went from treating me like a partner to expecting me to be his mother. I cleaned, cooked, did laundry, housework, took care of pets, etc, nearly exclusively because if I didn't do it, it wouldn't get done. This man cleaned a toilet all of twice in ten years, and only because I refused to clean a toilet he clogged and LEFT OVERFLOWING WITH HIS SHIT FOR ME TO CLEAN WHEN I GOT HOME FROM WORK...ten hours later, still full of shit, him just using the guest bathroom instead.\nI worked full and over time in addition to all that and would have to spend my days off cleaning his messes. \nHe mentally and emotionally abused me for years, refused marriage counseling, used sex as a weapon and way to degrade me, and ended up hospitalizing me before I realized there's no saving a relationship with a narcissistic psychopath. My therapist told me I was lucky to get out alive.",
   "created_utc": 1695558101,
   "score": 9,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yum5i",
   "message": "Once we both got comfortable on the roof, she started complaining that the roofing shingles were uncomfortable to sleep on, and she liked the ones from her house better.\n\nI told her these were 10-Year shingles, and actually survived a hurricane. She was still complaining about rolling off and other nonsense.\n\nAlmost told her to climb back down and sleep by herself in our bedroom just because of that",
   "created_utc": 1695544407,
   "score": 16,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yyv9r",
   "message": "This question is wild to me because I can’t imagine people getting married without sleeping in the same house first.",
   "created_utc": 1695547715,
   "score": 8,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yrsec",
   "message": "Procrastination, nothing super bad, but I’m more kind of “right now” person",
   "created_utc": 1695542223,
   "score": 4,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yvsjz",
   "message": "He needs to be liked, he needs recognition and if he don't get it he will act very imaturly..forever.",
   "created_utc": 1695545327,
   "score": 4,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z56cb",
   "message": "He was a lot kinder and less distant. My husband mostly has female friends which he keeps a respectable distance with as some are past ex's or FWB. I think it was hard for him to break out of that until we lived together and her finally opened up more in every way. It finally felt like I had a bf and now he's my husband",
   "created_utc": 1695552434,
   "score": 5,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1ze6y2",
   "message": "We never married but I found out my last gf had a drug issue after living together. Not talking weed or a little too much sauce either.",
   "created_utc": 1695558013,
   "score": 4,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zh0to",
   "message": "She is messy! Leaves cabinet doors and drawers open like a damn poltergeist.",
   "created_utc": 1695559430,
   "score": 5,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zm9v1",
   "message": "My gf was the meanest person to everyone but me.  The day I put the ring on her finger to be engaged, the mask was ripped off and she acted the same way towards me as everyone else.  For that and other reasons, the marriage did not happen.",
   "created_utc": 1695561971,
   "score": 4,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z83cy",
   "message": "Pro tip: start living under the same roof *before* marrying. The fewer surprises you have after marriage, the better.",
   "created_utc": 1695554398,
   "score": 7,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1wwp1a",
   "message": "Honestly? Nothing. I believe in living together before marriage so that you know what you’re living with forever.  When you’re comfortable enough to show you’re real selves after a year or two of living together, then get married.",
   "created_utc": 1695507363,
   "score": 14,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yvi5x",
   "message": "Snoring",
   "created_utc": 1695545103,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z6gc5",
   "message": "She became lazy and stopped working",
   "created_utc": 1695553299,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z9b3m",
   "message": "My husband doesn’t organise, he puts stuff out of sight. Like he’ll see that I have yet to put the towels away, so he’ll put them with the bedding. Or he’ll see some opened mail on the kitchen table, so he’ll pick it up and move it somewhere where it’ll be out of his view but *not* to our actual mail station. I leave our kids folded clothes on our bed where I folded them and he’ll pick them up and move them to our kids bed, not his closet. Drives me up the wall.",
   "created_utc": 1695555175,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zeaoj",
   "message": "The silent treatment\n Pisses me off to no end. Just tell me what happened and I'll go fix it.",
   "created_utc": 1695558065,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zev25",
   "message": "Doesn’t stfu about work. It’s their entire personality now.",
   "created_utc": 1695558355,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zgj7b",
   "message": "My husband is incredibly handy and I never knew until we bought a house.",
   "created_utc": 1695559188,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zh49t",
   "message": "She talks in her sleep. It’s super weird cuz she never has any memory of it even when I try to wake her up right after.",
   "created_utc": 1695559480,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xw175",
   "message": "The man I dated is the man I married and is the man 12 years later. I've learned more about him and about myself.",
   "created_utc": 1695522852,
   "score": 7,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1yqulz",
   "message": "passion and intimacy immediately vanished",
   "created_utc": 1695541500,
   "score": 3,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z28z3",
   "message": "I married my wife who, 19 years ago, was a sex machine with a body I’ve still not seen the likes of to this day. She was kind and not critical. \n\nToday she’s the absolute opposite. A deformed body from giving up on her health; ugly fat. Critical of me every day over something. I play a game of wondering when I’ll be blamed for something each day. And overall, she’s become more and more like her Appalachian Meemaw that she so fondly speaks of. \n\nI didn’t marry a Meemaw and it has me wondering lately if the person I made marriage vows to is even still around.",
   "created_utc": 1695550343,
   "score": 9,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z6zow",
   "message": "Severe anxiety! I know she was anxious but not like this",
   "created_utc": 1695553651,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z8j5q",
   "message": "Extremely toxic overthinking",
   "created_utc": 1695554666,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zan1x",
   "message": "Some serious paranoia and trust issues, girl tried to call me a cheater on a damned family camping trip, I went outside for a cigarette",
   "created_utc": 1695555986,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zftr5",
   "message": "He was a huge jerk.  His personality before and after weren't even close to the same.",
   "created_utc": 1695558840,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zgrcj",
   "message": "He dreams and reacts to the dreams. Talks, fights... usually it wakes me up scared.",
   "created_utc": 1695559296,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zguqu",
   "message": "Is not cleaning up after himself a personality trait? Expecting me to do all the work while he trashed the place?\n\nAhhh he’s a POS anyway. Glad he’s my ex.",
   "created_utc": 1695559343,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zh4us",
   "message": "Narcissism, victimization, etc",
   "created_utc": 1695559489,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zhrfo",
   "message": "There is only one decorator and it ain’t me",
   "created_utc": 1695559811,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zihd4",
   "message": "Somehow he could no longer find his keys and they only resurface when I am recruited to search…even when they are right in front of his face!",
   "created_utc": 1695560168,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zj579",
   "message": "What y’all doing sleeping in a roof?",
   "created_utc": 1695560496,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zja2t",
   "message": "I swear on my life my husband used to sneeze and degunk quieter. Now I wake up to the sweet soothing sounds of the  noise a child makes for immitading a tiger roar. He would go into another room in the morning to let me sleep in now he'll do it right next to my ear no problem. Also his sneezes could break break the sound barrier but they used to be a normal type of loud. He swears nothing has changed but I don't remember ruptured ear drums while we were dating.",
   "created_utc": 1695560564,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zjbxb",
   "message": "Laziness!!",
   "created_utc": 1695560589,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zjk65",
   "message": "Incredible care for me. More than I thought possible",
   "created_utc": 1695560699,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xu8p3",
   "message": "We didn’t even live together first and still no surprises.",
   "created_utc": 1695522024,
   "score": 2,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xe30l",
   "message": "We lived together 4 years before marriage so nothing",
   "created_utc": 1695514810,
   "score": 1,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1xoub3",
   "message": "Nothing, but we spent 5 years knowing each other before we married.",
   "created_utc": 1695519562,
   "score": 1,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1z791d",
   "message": "Formerly married. When I moved into his place, I realized how stubborn he was. Never wanted to make any house or decor changes, really set in his ways. He lightened up the longer I lived there though.",
   "created_utc": 1695553833,
   "score": 1,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1y5gfa",
   "message": "Ofc I moved in before we marry.",
   "created_utc": 1695527592,
   "score": 1,
   "submission_id": "16qg5lq"
  },
  {
   "comment_id": "k1zly7d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16qg5lq"
  }
 ]
}