{
 "submission_id": "16qy0a2",
 "title": "People who purchased \"Penis enlarging products\" from porn sites, what happened?",
 "selftext": "",
 "created_utc": 1695562798,
 "permalink": "/r/AskReddit/comments/16qy0a2/people_who_purchased_penis_enlarging_products/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/16qy0a2/people_who_purchased_penis_enlarging_products/",
 "comments": [
  {
   "comment_id": "k2079lc",
   "message": "It was advertised as free. After going through the ordering process, there was a surprise $4.95 shipping fee. It's one of those deals where if you don't cancel within 30 days, they automatically sign you up for an expensive monthly subscription. I set a reminder for 25 days and cancelled without issue. A sales rep called me and asked how it was going. I said they worked too well, I could no longer put on pants, and I needed another pill to reverse the effects. She didn't believe me and hung up. I never heard from them again, nor was my card charged beyond $4.95\n\nThe pills did nothing",
   "created_utc": 1695570237,
   "score": 245,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1ztn4b",
   "message": "It’s the perfect scam. If it doesn’t work, nobody’s saying shit or reporting it/suing.",
   "created_utc": 1695565087,
   "score": 180,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zyd3b",
   "message": "A serious answer from somebody who used to work in a sex shop and sold those pills among many other things: probably diarrhea.\n\n\n Those pills are all untested \"supplements\" just packed full of natural sounding \"enhancements\". Popular ingredients are things like ginseng and caffeine but you also sometimes see exotic sounding stuff like yuzu (a fruit) or ylangylang (another common herb) that tricks people into thinking they are taking a quality product that will actually achieve their goals. I could go on at length (lol) about this but basically these pills have the same ingredients that Popular dietary supplements have. Diarrhea is actually best case scenario.",
   "created_utc": 1695566895,
   "score": 162,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k206a76",
   "message": "I bought some dick hard pills at 7-11 once. It increased my heart rate to like 200 bpm for 24, which caused me to panic, which was then an instant boner killer. \n\n0/10 would not recommend.",
   "created_utc": 1695569875,
   "score": 58,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zqghb",
   "message": "I think \"Serious\" tag was required.",
   "created_utc": 1695563808,
   "score": 228,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zs4sv",
   "message": "I wasted a ton of money to pee expensive urine out of my micro penis.",
   "created_utc": 1695564498,
   "score": 201,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zuztk",
   "message": "Really bad headaches and my dick did not get bigger.",
   "created_utc": 1695565600,
   "score": 183,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k20ga0p",
   "message": "I did not buy them from a porn site per se, but it was way back in the early 2000s when I used to watch the Howard Stern show late at night.\n\nThey advertised these pills called Xtendz(?) all the friggin’ time so I bought a bottle to try it out.  In addition to taking the pills multiple times a day, you had to…manipulate your penis which was supposed to increase blood flow or something.  I ended up stopping about two weeks in because it was quite the hassle and kinda hurt.\n\nAnyway, fast forward about 15 years and this company has a class action lawsuit filed against them for false advertising and selling snake oil.  I ended up getting the entire purchase refunded.  The worst part of the whole experience was having to explain to my wife why we got a $60 check in the mail from the class action lawsuit.",
   "created_utc": 1695573570,
   "score": 197,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zriry",
   "message": "I don’t think you’ll get an answer from any of them, most of those guys are massive dicks now",
   "created_utc": 1695564249,
   "score": 243,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k210co8",
   "message": "So not a penis enlargement product but a make you last longer product. One of my patients purchased some shit he bought on the Internet and it gave him priapism for 48 hours. In case you don’t know anything longer than four hours is a medical emergency. So we start an 18 gauge needle in each side of his dick and pushing fluid as we aspirate it out we pulled about 200 mL of what looked like canned cranberries out of his dick. In the end we still sent them to the OR and his dick was probably useless. Which means he’ll end up with a penile prosthesis.\n\nFor those if you don’t know, a penile prosthesis is where they put a bladder inside your dick with a little pump in your balls, so you literally pop up your dick like a 1990s Reebok",
   "created_utc": 1695580563,
   "score": 93,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zpdxy",
   "message": "They worked great. I am now bangin' milfs in my local area.",
   "created_utc": 1695563348,
   "score": 119,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zsnin",
   "message": "My wife left me. She just couldn’t take it any longer.",
   "created_utc": 1695564710,
   "score": 101,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zop7i",
   "message": "I know buddy who did that with his grandparents card in high school. He ended up getting prostate and testicular cancer so his business doesn't work anymore. There is an irony there that is lost on me.",
   "created_utc": 1695563051,
   "score": 254,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zoie4",
   "message": "I'm no longer allowed to wear shorts in public",
   "created_utc": 1695562972,
   "score": 35,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zp3al",
   "message": "They turned me into a newt. But I got better.",
   "created_utc": 1695563221,
   "score": 234,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k208xn7",
   "message": "That feeling when you’re genuinely interested in the question , but 99% of the answers are lame jokes. :/",
   "created_utc": 1695570845,
   "score": 34,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k2007dv",
   "message": "I had a friend in uni doing research into what was actually in the drugs as part of a illegal drug research project. \n\nSo they bought them. Bought so many different types. \n\nMost were nothing. However some had sildenafil in them. Which they shouldn't. As sildenafil is an actual medication that requires a prescription. \n\nEssentially illegal sildenafil was manufactured and sold in those pills. My friend reported it all to the powers that be and noped slightly out of the research.",
   "created_utc": 1695567596,
   "score": 44,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zr07d",
   "message": "They now post on r/bigdickproblems",
   "created_utc": 1695564036,
   "score": 69,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zp39j",
   "message": "Think of it this way:\n\n\nIf they actually worked - Nearly every man on earth would use them\n\n- In the same way that tooth whitening strips... Or like, fake tan is used widely",
   "created_utc": 1695563221,
   "score": 223,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zuysq",
   "message": "I purchased a cream that you were supposed to rub on your dick to make your dick bigger. My dick stayed the same size but now I have Mickey Mouse hands",
   "created_utc": 1695565589,
   "score": 242,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k207ui6",
   "message": "I have a great story about this…\nWhen I was in my early 20s and in a serious relationship I went to a ‘shop’ to spice things up around Valentine’s Day. The store associate was all like ‘you should totally enter our Valentine’s Day basket giveaway contest, we’re giving away $400 of prizes!’ So I reluctantly enter this giveaway when cashing out. \n\nA few days later I receive a call from a overly enthusiastic associate like ‘YOU WON THE BASKET!!!’ I’d never won anything in my life so of course thought it was hysterical and go to pick up my basket. Amongst other hilarious things there was a penis pump in there. I don’t think my ex even tried it that I know of because we thought it was hilarious. \n\nA good 4-5 years later I’m cleaning out  stuff to give to Goodwill and uncover the penis pump in original packaging. I tuck it in one of the Hefty bags and, yep, end up donating it to the local Goodwill. So that was the end of the penis pump story and perhaps the beginning of someone else’s 😆",
   "created_utc": 1695570449,
   "score": 52,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zqtrf",
   "message": "My ex kept trying to tie it in a knot while I was asleep, glad I broke up with her",
   "created_utc": 1695563961,
   "score": 129,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zs1cx",
   "message": "It worked so well that when I do helicopter dick I actually float upwards.",
   "created_utc": 1695564458,
   "score": 35,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k200csf",
   "message": "They won’t answer because they all bought dodge rams with big tires and squatted rear ends currently taking up 4 spots in a Walmart parking lot trying to sleep off the 12 pack they downed earlier.",
   "created_utc": 1695567654,
   "score": 107,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zr1qw",
   "message": "\nMy credit card was stolen so I had to move to a new country and assume a new identity to escape all the harassing debt collector calls because I was too embarrassed to tell them my info was stolen while trying to increase the size of my dong\n\nThe good news is I did receive some pills in the mail, they didn’t make my penis grow but I did grow a third nipple so there’s that",
   "created_utc": 1695564054,
   "score": 8,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1ztovd",
   "message": "When I was young I was working at a billing company that was used by some of these companies.\n\nAnd sometimes we received mail sent by customers to the wrong address.\n\nAnd a lot of them were very happy customers that had seen great results using the techniques listed on the websites.\n\nBut it was not pills, just exercises that you have to do to get a bigger penis and a better erection and it seems to work. I downloaded the pdf for myself as it was free for us🤭",
   "created_utc": 1695565105,
   "score": 44,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zo7s0",
   "message": "They got scammed",
   "created_utc": 1695562842,
   "score": 79,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zs8o5",
   "message": "It worked too well. I am actually a penis that outgrew my owner.\nWell, I better go beat my human.",
   "created_utc": 1695564542,
   "score": 165,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k2015bh",
   "message": "It’s not mine! That’s not my bag baby!",
   "created_utc": 1695567943,
   "score": 27,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k21bryy",
   "message": "My first throwaway!\n\nYes! I have experience with these products!\n\nI do not have a small penis. It was distinctly average. Just a fraction over 6 inches. I am a long time consumer of Derek from moreplatesmoredates' content and frankly literally wanted to test these products due to my skepticism. Not due to any issue with my penis... for science!\n\nI purchased the two devices he was recommending. A particular penis pump brand, and another stretching device designed for use while sleeping. Roughly stated, the pump gives you a bit of length and girth, the stretcher mostly length and can be used to straighten (apparently it's legitimately used for been that've suffered a broken penis etc).\n\nIt was during Covid lockdown so I figured I had time. It's a huge time investment. With the penis pump you sort of build up your usage and pressure on the pump to daily 15min sessions. The stretcher you similarly titrated up until you use it for a nights sleep.\n\nProgress is measured over months (and years). But it absolutely worked, and worked well. I was, frankly, incredibly disciplined due to my skepticism but wanting to do it properly to give it its dues - mainly in respect for Derek's recommendations.\n\nAfter about two years I stopped using the devices as consistently. Think of them kind of like working out for your penis (or so I've read). It takes a lot of effort to build a longer/thicker penis, but minimal effort to maintain it. So nowadays I just use the pump once or twice a week and haven't noticed any real decline in size.\n\nMy protocol added a 1.3 inches in length, and 0.95 inches in girth.\n\nWhere there any other changes in performance or feel? None. I remain as sensitive as before. And frankly I've always had a bit of difficulty reaching orgasm, that's unchanged as well. It doesn't look really any different except just the ratios were increased.\n\nIt hasn't made a meaningful difference to my sex life. My penis was fine before and girls found it pleasurable. Now maybe I get a bit of a reaction, and it's perhaps a little more important to ensure proper foreplay has been enjoyed to warm things up and relax. But... not really a big deal of it either. \n\nI'd say although larger and clearly above average, it's not yet at the size where it's a genuine problem. Do girls like it more? No.. do some object? No... it kind of hasnt changed much. I think if I were into rougher sex it's capable of hitting cervíx's easier. It could be more overwhelming... but I'm not overly into that kind of sex. Or at least not often.\n\nPerhaps it's made a couple of positions a little easier. Maybe... but that's it!\n\nAMA!",
   "created_utc": 1695584478,
   "score": 12,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k21h212",
   "message": "I bought Viagra eye drops... they don't do anything to your cock, but it made me look hard.",
   "created_utc": 1695586239,
   "score": 14,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zoqsz",
   "message": "Such a brave topic to discuss openly. It's essential to shed light on these products and hear real experiences. Upvoted for awareness!",
   "created_utc": 1695563070,
   "score": 128,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1ztk3j",
   "message": "I’m using my dick to type this, so you tell me",
   "created_utc": 1695565056,
   "score": 104,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k20fuf2",
   "message": "Doctors hate me because of this one simple trick",
   "created_utc": 1695573414,
   "score": 11,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k214q9p",
   "message": "I once was given this dick-hardener substance by my friend that according to him, “it makes u last longer with girls if u were bursting too quick”, “just rub it agaisnt ur schmeat, the more the better”. I never really had the chance to use it with girls but one day out of boredom I decided to try it out. That shit didnt make me go hard at all, it paralyzed my dick and my balls, I completely lost all feelings down there. I was so fucking scared cause although I can feel my dick with my fingers, my dick didnt feel anything at all for 5 hours, no matter how hard I twisted the nut skin. It was like touching 2 saggy balloons and a hose with my hand. After that i had to wear diapers for 3 days because I use too much and some of it got into the tip, paralyzed the muscle inside aswell, making me not be able to hold my pee. \n\nNever again",
   "created_utc": 1695582086,
   "score": 14,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zth36",
   "message": "My penis became extremely big. I still have some of the product left and am willing to sell.",
   "created_utc": 1695565025,
   "score": 42,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k207vvo",
   "message": "I’ve never bought any myself, obviously a scam and a whatnot but one day I was curious what the link would actually go to and it sent me to a storefront for some CBD gummies Amazon lmao",
   "created_utc": 1695570464,
   "score": 9,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zuau8",
   "message": "Someone asked something like this within the last month or so (maybe not in this sub) and in the comments there was a reference made to a subreddit where these people are hanging weights off their dicks in order to increase their length\n\nI thought for sure it had to be some kind of joke, but in fact, it is a real subreddit dedicated to helping one another do it safely/correctly.\n\nNo, I don’t recall the name of the sub.",
   "created_utc": 1695565339,
   "score": 22,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k20dk2x",
   "message": "I woke up this morning with a bad hangover\n\nAnd my penis was missing again.\n\nThis happens all the time.\n\nIt's detachable.",
   "created_utc": 1695572560,
   "score": 13,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k20p70c",
   "message": "A word of caution… \n\nBack in the day, I was a Bank Manager at a bank for several years. About once every six months, a man would come in alone and ask to dispute a charge. We’d sit down and I would pull up his account history and ask him which charge he’d like to dispute and if it was a one-time charge or recurring. \n\nThe absolute torture these men were going through, having to sit with a bank employee and dispute the monthly charges from dick enlarging pills because the company wouldn’t stop charging when he’d asked….. so awkward. For the record, we are professionals and we have seen it all. But for these men, it was a painful 30 minutes. \n\nI imagine it happens even more often than I know, as most of the time the company name for these places doesn’t give away what it is. But some of them are like Dick-stend Me LLC or something. \n\nThink hard (pun fully intended) before you use your card or account for these things.",
   "created_utc": 1695576764,
   "score": 8,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zrvs0",
   "message": "Got scouted by a world famous circus to be their big top pole.",
   "created_utc": 1695564396,
   "score": 43,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zzl1t",
   "message": "Not me but my dad. Years ago he bought one, they overcharged him multiple times and way too frequently for pills he only received a handful of times. It wasn’t until they charged him twice in two weeks (at this point I don’t even think he was using them), he was freaking out about the money being gone. Something like $340 in two weeks. When I contacted them, they tried to give me this run around about how he’d have to go through this long process of certified written letters and etc to cancel. We just changed his bank card info and asked the bank to get some of it back as he was “scammed” and they did but it took like 6 months of bullshit and after it was all over, my dad said he didn’t even gain a 1/4”.",
   "created_utc": 1695567360,
   "score": 13,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k200l3g",
   "message": "SERIOUS COMMENT\n\n“Several non-invasive methods of penile lengthening have been described, such as vacuum devices, penile traction devices and penoscrotal rings; even 'physical exercises' have been popularized through the media. Most of these techniques, however, are not supported by any scientific evidence”\n\n“At best, surgery may give a slight increase in girth to the penis. Or surgery may add a slight appearance of increased length to the non-erect penis. But it does not change the actual length of the penis. At worst, surgery can result in complications such as infection, scarring, and loss of sensation or function”",
   "created_utc": 1695567740,
   "score": 12,
   "submission_id": "16qy0a2"
  },
  {
   "comment_id": "k1zxpit",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16qy0a2"
  }
 ]
}