{
 "submission_id": "16rcvb5",
 "title": "What would women like men to know about having periods?",
 "selftext": "",
 "created_utc": 1695599839,
 "permalink": "/r/AskReddit/comments/16rcvb5/what_would_women_like_men_to_know_about_having/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/16rcvb5/what_would_women_like_men_to_know_about_having/",
 "comments": [
  {
   "comment_id": "k22t09k",
   "message": "As far as cramps, moodiness, bloating, etc. there is no rule and it's not just different for every woman, it can be different for the same woman at different ages.",
   "created_utc": 1695605099,
   "score": 116,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22ito2",
   "message": "The pain is unbearable, but it also causes insomnia. I’m tired not just from bleeding burn because I literally cannot sleep",
   "created_utc": 1695600727,
   "score": 165,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22tpnp",
   "message": "I can’t believe no one has mentioned period shits. Period shits are THE WORST, you should know about them so you don’t give your friend a weird look when she spends a lot of time in the bathroom once a month",
   "created_utc": 1695605412,
   "score": 25,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22p7su",
   "message": "It's not just lower abdomen pain ( cramps) it's also headaches, bloating, constipation, dizziness, nausea, insomnia, mood swings, back pain and sometimes EXTREME back pain, dry skin, loss of appetite or sudden increase of appetite and sometimes a lot of those combined. For a few days.",
   "created_utc": 1695603450,
   "score": 172,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22h5u3",
   "message": "\"Cramps really fucking suck. It's like giving birth without a pay off.\" - My Partner",
   "created_utc": 1695600004,
   "score": 163,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22ysjs",
   "message": "It feels like giving birth to a jellyfish.",
   "created_utc": 1695607657,
   "score": 18,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22pi3z",
   "message": "Maybe just me, but I’m not crabby because of hormones, I’m crabby because I feel like shit. You are also crabby when you feel like shit. This isn’t rocket science.",
   "created_utc": 1695603576,
   "score": 202,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22n8vm",
   "message": "That there are a significant amount of woman who have been denied healthcare or misdiagnosed due to the doctor writing off symptoms as PMS or a period. Friend of mine was having more pain than normal during her period and cramps had moved into her thigh, doctor told her to take more painkillers. Wouldn't entertain any ideas that the pain was different or more severe. \n\nTurned out to be bone cancer :)",
   "created_utc": 1695602609,
   "score": 27,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k230dyr",
   "message": "When I went into labor with my first born, the nurse asked if I was having contractions. \n\nI said \"not really, just some period like cramps\"\n\nShe looked at the monitor that was strapped to me and said \"you're in the middle of a major contraction right now, you don't feel that?!\"\n\nAnd that's when I learned my monthly period cramps are so severe, they're on par with being in labor. Of course it hurt, but I thought labor was supposed to be *worse* than my monthly period lol",
   "created_utc": 1695608381,
   "score": 247,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22vlam",
   "message": "Women pee and bleed out of different holes.",
   "created_utc": 1695606237,
   "score": 221,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22sr99",
   "message": "It's just a normal bodily function. Seeing or buying tampons and pads shouldn't freak you the fuck out any more than toilet paper.",
   "created_utc": 1695604990,
   "score": 53,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22l22i",
   "message": "[deleted]",
   "created_utc": 1695601679,
   "score": 190,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22z3in",
   "message": "That it is never ok to say \"my mother/sister/gf/ex has periods like this, so you are wrong/malingering/ exaggerating /etc. when you say your periods are like that\".     \n*edit because I re-read and saw how what I wrote might confuse",
   "created_utc": 1695607795,
   "score": 173,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k230wpi",
   "message": "I think one of the things that people who don’t menstruate might not consider right away is how exhausted it can make you feel. It wipes you tf out. I wake up tired and get more tired throughout the day until I finally go to bed and have insomnia from the pain and discomfort of the other symptoms, and it just repeats like that until it’s finally over.",
   "created_utc": 1695608605,
   "score": 176,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22hols",
   "message": "we can't hold our periods like pee",
   "created_utc": 1695600233,
   "score": 87,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22ueur",
   "message": "It hurts from my knees to my belly button, I spend the first day in bed on pain killers. Tampons do not break the hymen or cause sexual pleasure. Periods are not restricted to the full moon. It is possible to get pregnant while menstruating. We can not hold it in. Periods and pee do not come from the same hole. Periods and PMS do not make us irrational, they just lower our tolerance for bullshit. Women have mistaken appendicitis and heart attacks as no big deal because their period hurts more.",
   "created_utc": 1695605721,
   "score": 249,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22z8og",
   "message": "Imagine getting sick and feeling hot and achey and gross and wanting to call out but not being able to afford it. Imagine how miserable you’d be.\n\nNow imaging getting sick like that once per month for something like 50 years. \n\nJust try to give us some sympathy and flexibility. No need to treat me as fragile or a monster, just a person having a rough time.",
   "created_utc": 1695607860,
   "score": 253,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22qu9l",
   "message": "The things I'm pissed about when I have PMS are things I'm pissed about all the time. It's just that at that time of the month I don't have the capacity to bite my tongue about them.",
   "created_utc": 1695604156,
   "score": 109,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22svbe",
   "message": "Forget periods, ovulating can be the most painful experience ever for some women. \n\nI wound up in the hospital ready to get my appendix taken out, surprise it was my ovary…. \n\nI still get pain from cysts (eggs getting stuck in my fallopian tube I guess) every once in a while, but now it’s just like bad cramps day… then my period starts and get actual bad cramps.",
   "created_utc": 1695605039,
   "score": 105,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22zkve",
   "message": "A regular schedule is not guaranteed.  We don't always know when a period is going to start (or end).  It can be a constant source of low-level stress to be out and about wondering if you'll need to make a quick bathroom escape.",
   "created_utc": 1695608013,
   "score": 188,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22u2zb",
   "message": "Period poops. The worst. Also using the bathroom in general is like wiping a marker. At some point you just give up and say it’s good enough. Or wipe, put the tampon in, then wipe again",
   "created_utc": 1695605575,
   "score": 142,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k234pkl",
   "message": "Related: Men need to know that birth control is a huge physical burden. The things it does to you. We all experience it differently but it can fundamentally change your emotional baseline. I was destabilized by anxiety, panic attacks, and depression, and it set my life off course for a while. But many women have been on the pill all their lives and don’t realize what it’s doing. And the effects don’t go away when you stop taking it. They linger for months. Men have no idea.",
   "created_utc": 1695610339,
   "score": 146,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k2331fr",
   "message": "Women around the world do not get their periods at the same time.\n\nTrue story: My brother-in-law legit thought that when it was \"that time of the month\" it meant that all women were getting their period at the same time.",
   "created_utc": 1695609568,
   "score": 61,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22t2mx",
   "message": "PMDD. Google it. THEN look up the reality of it on Reddit.  Every 28 days I have to deal with what my doctor initially diagnosed as major depression and bipolar ii disorder because I get a period.",
   "created_utc": 1695605129,
   "score": 164,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k237yr4",
   "message": "One thing that I think is notable is that we’re all secretly dealing with this. We’ve been conditioned to hide it because it’s framed as being disgusting and impolite; however, for a lot of women being on your period feels worse than having the flu. We’re just secretly enduring feeling like shit while we continue to work and operate in the world. It’s 1/4 weeks of the month for most of us. I think part of why we are more likely to have a short fuse on period has less to do with mood swings than it does with bearing the burden of feeling like shit, bleeding into our underwear, while juggling hiding that from most of the people around us.",
   "created_utc": 1695611905,
   "score": 53,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22rxlc",
   "message": "it’s completely life draining. the second day is the worst for me. any plans? might as well cancel them. i can’t eat cause i’ll just throw it up. i don’t eat and i still throw up. it causes full body shakes and you feel like you’re gonna pass out once that pain hits. pain relievers take too damn long to kick in and you can’t eat it unless you had food prior (or else you’ll throw up). guess that depends on body proportions i’m pretty petite. anyways it sucks :(",
   "created_utc": 1695604630,
   "score": 109,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22tm72",
   "message": "Yes, they ARE that painful, in fact, it’s more painful than that.",
   "created_utc": 1695605369,
   "score": 51,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23dsce",
   "message": "Needing super pads / tampons doesn't mean we have gigantic vaginas. It just means we're heavy bleeders",
   "created_utc": 1695614944,
   "score": 54,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22q1lx",
   "message": "I have one good week a month. When I ovulate my ovaries cause pain. Then sometimes my vagina feel like I’m sitting on rocks. My eczema flairs, my balance is off, my skin feels like when I you have the flu. The week before my period I sweat when I sleep so much I get pools between my boobs and my hair is soaked. I could cry at anything (and I’m not a crier). I get insomnia. All leading to bleeding like a stuck pig that I gross myself out. \n\nMen: be kind to us. More than likely you aren’t seeing us on the one good week we get",
   "created_utc": 1695603808,
   "score": 178,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k2342gh",
   "message": "They are so painful. Making fun of us for being cranky just makes it worse. We already feel like shit. Just bring us chocolate, heating pads and remind us we are pretty.",
   "created_utc": 1695610046,
   "score": 48,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22rlvj",
   "message": "It's just not the physical pain, but also extreme hormonal changes. I'm mentally ill and used to be extremely suicidal during my period. Saying it can't be that bad isn't helping at all.",
   "created_utc": 1695604490,
   "score": 77,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23149d",
   "message": "Reading this thread, evolution must have had something against women.",
   "created_utc": 1695608697,
   "score": 38,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k232v7g",
   "message": "That PRE menstrual syndrome (PMS) comes BEFORE the period. The altered moods that come from PMS are in the week BEFORE your period. It pisses me off when guys say \"You're upset because you're on your period\", when the PMS was a whole week earlier. \n\nNormally I'm pissed off when I'm on my period because I'm in pain and bleeding all over the office chair but still have to pretend to work normally. It's not that my emotions are unreasonable, it's just that I'm dealing with a lot at that moment.",
   "created_utc": 1695609487,
   "score": 35,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23bljn",
   "message": "Tampons don't feel good or sexual or arousing",
   "created_utc": 1695613750,
   "score": 35,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22iqhr",
   "message": "My son talking to his best friend\n\nSon: can you imagine bleeding from your penis! Like, every month you bleed from your penis? Clots? Can't sneeze or cough without BLOOD gushing out? Dude~~~.",
   "created_utc": 1695600689,
   "score": 173,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22yas0",
   "message": "And it’s every goddam month for 40 years, except when you’re pregnant or breastfeeding.",
   "created_utc": 1695607436,
   "score": 28,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k2332j7",
   "message": "It's different for every woman. But for some it's a few days of feeling like you have a very, very mild cold. You are a bit achy and could go for a nap. But all in all, you are fine. For others, it's doubling over, agonizing cramping with a shopping cart of other symptoms like nausea, diarrhea, headaches, mood swings and all over bloating. Nothing fits. *Nothing.* And for other women, it could be in between the two or it could swing between the two from month to month. Like I said, it varies from woman to woman.",
   "created_utc": 1695609582,
   "score": 31,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23ao3x",
   "message": "Please don't be in the only bathroom in the morning when I wake up. It's like my muscles have realized I'm up, it's time to stop relaxing and time to gush out some blood.",
   "created_utc": 1695613256,
   "score": 31,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23furv",
   "message": "Imagine being told at a young age that you will experience varying degrees of discomfort and inconvenience once monthly for the rest of your life.  The only ways out are both awful and unpleasant in their own ways, pregnancy being a complete rearranging of all your body systems, some of which never return to your previous normal and menopause is a years long process of your hormones resettling into new orientations but taking the rest of your body on the ride.\n\nBut you shouldn't talk about any of that, it makes people uncomfortable, so ideally don't suffer about it and if you must, suffer silently so not one is bothered by you.",
   "created_utc": 1695616139,
   "score": 35,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22hf8e",
   "message": "Even if PMS exists, that doesn’t invalidate my emotions or feelings. And it doesn’t turn women into irrational harpies.",
   "created_utc": 1695600118,
   "score": 233,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22hcsb",
   "message": "If you can smell it, I'm sorry, I really am. But I'd rather not know, ignorance is bliss.",
   "created_utc": 1695600089,
   "score": 124,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k235lor",
   "message": "It's not an inconvenience for YOU.",
   "created_utc": 1695610761,
   "score": 29,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k2312w5",
   "message": "Theres chunks",
   "created_utc": 1695608680,
   "score": 52,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22yb9c",
   "message": "I feel like a “normal” human for half the month, and the other half I get to enter my “bad” half. Fun. Especially the last week before the bleed. All the negative emotions amplified. My brain starts catastrophizing. I can cry for reasons I wouldn’t the first half of the month. Then agonizing cramps that paralyze me in my tracks more months than others. This makes being on vacation or doing anything during this time way less enjoyable for myself and whoever I may be with as a byproduct. I hate it, and wish I were a dude just to have a sense of steadiness on a month to month basis. \n\nAlso, it’s unfortunate that women are expected to be little men, going to their 9-5s even on these “bad” days despite this. Personally I think the labor system should add in a 3 day per month pms PTO. I KNOW if dudes experienced this, pms PTO would 100% exist.",
   "created_utc": 1695607442,
   "score": 46,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22w25m",
   "message": "It can be some of the worst pain we’ve ever felt. During my worst, the cramps rivaled my contractions when I was in labor with my son",
   "created_utc": 1695606447,
   "score": 18,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k234tyh",
   "message": "For context of cramping pain:\nI thought I was having bad cramps, turned out my appendix (partially) ruptured. I wrote it off (and so did my doctor) for a week.",
   "created_utc": 1695610395,
   "score": 18,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22ok8l",
   "message": "It's infinitely worse for me than it is for you",
   "created_utc": 1695603169,
   "score": 44,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k232lhp",
   "message": "We do not bleed/pee out of the same hole.  We have a urethra that attaches to our bladders just like men do. \n\nNot all periods are the same.  The stuff public schools teach about the reproductive system is severely watered down due to prude religious zealots who see women and girls as things to control while men are held to different standards such as \"boys will be boys\".\n\nAnd most importantly- unless you are a certified OBGYN who has extensive work with uteri and positive feedback from patients, you are NOT an expert on women's bodies simply because you have slept with many women.",
   "created_utc": 1695609361,
   "score": 17,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22z8am",
   "message": "They're different for different women, which means what you learned from watching your mother/sister/SO/etc may not apply to other women.  Some women are more easily irritated or hurt before their periods, bur others aren't.  Some women get a lot of pain, other's don't.",
   "created_utc": 1695607855,
   "score": 15,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k238fvr",
   "message": "As you get older, your period changes, and the consistency of what comes out also changes. The first two days of my cycle now is like giving birth to baby octopuses 🐙",
   "created_utc": 1695612136,
   "score": 14,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k2340id",
   "message": "If a woman becomes irritable during her period, its from the negative physical effects of the period (cramps, fatigue, body aches, headaches etc) not from hormones. Theres no magical thing that turns us irritable simply from bleeding. \n\nIve been more cranky from colds than from periods (some colds have had worse symptoms)\n\nIf you got sick for 3 days a month you'd be cranky on those days too.",
   "created_utc": 1695610021,
   "score": 29,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k2390g0",
   "message": "Vulvar pain. It feels like somebody hit me with a hammer repeatedly around my entire vulva and pelvic area. It feels bruised. It feels sore. It aches in a bruised way. I don’t know why it happens, and I rarely hear anyone speak of this symptom. It is so painful and so uncomfortable. I’ve had it since I first started :(",
   "created_utc": 1695612419,
   "score": 14,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23caj7",
   "message": "Sometimes if your period is irregular or if you don’t track it, or even if you do, even with a huge ass pad(diaper) or a super tampon, I still bleed the bed sometimes :-(",
   "created_utc": 1695614120,
   "score": 13,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22nkct",
   "message": "It lasts for 3 to 7 days depending on the person. It's not just 1 day of the month and then you wait till next month.",
   "created_utc": 1695602747,
   "score": 41,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22u8w9",
   "message": "That during the menstrual cycle our uteruses actually cut blood circulation to different parts at random moments. Which is were cramps come from. That and during our menstrual cycle, we actually produce LESS estrogen and MORE testosterone,  if you want another reason why we can be rage monsters and have a shorter bs fuse.",
   "created_utc": 1695605649,
   "score": 34,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23clfc",
   "message": "Catamenial epilepsy.  Yes, my fucking period gives me seizures.\n\nNo.  I can't get a fucking hysterectomy because EVERYONE is soooooooo concerned over me, a 38 year old divorced lesbian, \\*possibly\\* having kids.\n\nThis is the post Roe V Wade world.",
   "created_utc": 1695614285,
   "score": 13,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k250utq",
   "message": "Many girls' periods hurt and some don't, for me personally, it does. What helps me, and what guys should know, are warm compresses on my abdomen and laying in bed watching Netflix or munchies 🍬",
   "created_utc": 1695651566,
   "score": 1,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22uuaj",
   "message": "Not all women turn into hormonal beasts when they're on their period. I'm still me. I don't need to be fed chocolate or treated any differently. On the flip side, some cramps are so debilitating that it's hard to leave the house.",
   "created_utc": 1695605908,
   "score": 25,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k22w1lw",
   "message": "No, we don’t want to put a towel under our ass and have sex anyway",
   "created_utc": 1695606440,
   "score": 62,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23born",
   "message": "We can die or lose a limb from keeping a tampon in for too long.",
   "created_utc": 1695613799,
   "score": 12,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k234gib",
   "message": "It’s not weird or embarrassing. Most women have to deal with it, and if you’re going to be with a woman, it’s your responsibility to learn about it and not treat her like an alien when she has hers. If she needs feminine products and you happen to be at the store, have her send you a picture of exactly what she needs, then please do not hesitate to offer to pick some up for her. It should never be a big deal. Periods are a basic human function and buying tampons or pads is no weirder than buying condoms or toilet paper.",
   "created_utc": 1695610225,
   "score": 10,
   "submission_id": "16rcvb5"
  },
  {
   "comment_id": "k23klfa",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16rcvb5"
  }
 ]
}