{
 "submission_id": "16tjlre",
 "title": "Women of reddit, what is the hardest part of being a woman?",
 "selftext": "",
 "created_utc": 1695818726,
 "permalink": "/r/AskReddit/comments/16tjlre/women_of_reddit_what_is_the_hardest_part_of_being/",
 "score": 113,
 "url": "https://www.reddit.com/r/AskReddit/comments/16tjlre/women_of_reddit_what_is_the_hardest_part_of_being/",
 "comments": [
  {
   "comment_id": "k2fr9u8",
   "message": "Everything related to our reproductive system. Periods, hormonal cycles, contraceptives, pregnancy… don’t get me wrong, I love being a woman and I want to be a mother, I don’t think those things are bad, but they’re definitely very hard.",
   "created_utc": 1695825937,
   "score": 104,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2h6sd6",
   "message": "Time of the month.... but the thing is if we don’t get one then we would probably think “oh crap am I pregnant!?”  \nWe just can’t win.... and NO we can’t hold it in like urine it just blobs out!",
   "created_utc": 1695844485,
   "score": 138,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fcub4",
   "message": "I have a lot but I would say endometriosis and PCOS",
   "created_utc": 1695820275,
   "score": 1,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fdqp9",
   "message": "Periods.",
   "created_utc": 1695820660,
   "score": 137,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gmcpk",
   "message": "There are a lot of potential answers, and this one probably isn't the worst, but it does add a significant and unnecessary degree of difficulty to everything:\n\nPeople are obsessed with the idea that women do literally everything for \"attention\".\n\nMentally ill? Attention-seeking. Physically ill? Attention-seeking. Victim of SA? Attention-seeking. Promiscuous? Attention-seeking. Feminist? Attention-seeking. Vegan? Attention-seeking. Alternative? Attention-seeking. Queer? Attention-seeking.\n\nIt is absolutely surreal how often women go without very necessary resources because people apply a veneer of skepticism to every single claim they make. \n\nAnd what would the end goal even be? Who is giving all this attention? Who is fawning over all these women and waiting on them hand and foot? I sure as hell don't know, but for some reason, the idea of women being dramatic whiners is more pervasive than the known fact that women's healthcare is abysmal or that sexual assault occurs at an astronomically high rate towards women. \n\nLike yes, of course, the reason I talk about my chronic illness or mental health or abuse history is because I want to be special and unique, not for a list of other perfectly relevant and important reasons.",
   "created_utc": 1695836886,
   "score": 162,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g9fr8",
   "message": "For me it’s the combination of all the little things that build up. They’re all connected. But if I had to pick only one, it’s the final boss of nobody ever believing you about anything. I am always questioned on everything, even things that I am literally an expert in, by people who have absolutely no credentials. \nAnd I’m questioned on the reality of the other things I mentioned before. Could my chronic pain actually be that bad? Am I sure that my ex was taking advantage of me? Everyone wants to play devil’s advocate when the devil is doing a fine job advocating for himself.",
   "created_utc": 1695832380,
   "score": 198,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gg2q7",
   "message": "The weird sexism when women talk about their interests and hobbies when they’re not the traditional “woman hobbies”\n\nIf a woman is working in a male-dominated industry, she’s required to be one of the best and mistakes are met with misogynistic “women can’t do anything right” bullshit. She can’t be just average like a man can; it’s a weird double standard. \n\nOr if I woman has more masculine hobbies or interests and the men around her find out, most of the time they’ll end up “quizzing” her to see if she’s actually into it or faking.",
   "created_utc": 1695834688,
   "score": 183,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g9tyk",
   "message": "When doctors brush you off as having anxiety.",
   "created_utc": 1695832518,
   "score": 19,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gjmkt",
   "message": "Everyone is gaslighting your choices.\n\n From not wanting children, acting girly, not wanting a man, not wanting friends, not caring about looks, not caring about likeability, wanting to be independent, wanting to pursue masculine hobbies(football)",
   "created_utc": 1695835927,
   "score": 61,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2ge3es",
   "message": "I'm always frustrated that breasts are so heavily sexualized. That is such a huge section of me that can't be remotely bumped into without someone feeling like they need to profusely apologize to me. Both woman and men feel awful when they do. ...it's just skin.",
   "created_utc": 1695833991,
   "score": 117,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fujuv",
   "message": "Aging and society's pressures to remain youthful looking until we drop dead.",
   "created_utc": 1695827125,
   "score": 249,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g95ua",
   "message": "Being objectified and people not taking me as seriously. Generally just being seen as less",
   "created_utc": 1695832283,
   "score": 171,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gdvbs",
   "message": "I wanna play online video games and be able to use a mic! The moment I turn my mic on its either instantly getting hit on or being harass.  Like grow the fuck up boys for real.",
   "created_utc": 1695833913,
   "score": 184,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2f9lrf",
   "message": "Knowing there is a sizable portion of any population across all parts of the world who see me as a piece of property that can be brutalized or murdered for social transgressions.\n\nGives a bit of anxiety.",
   "created_utc": 1695818840,
   "score": 189,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fswb0",
   "message": "Being objectified, sexualized, and never feeling completely safe when you are alone outdoors.",
   "created_utc": 1695826525,
   "score": 183,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g8dfm",
   "message": "You know what the worst thing is? That despite the societal pressure to maintain a full-time career, you also have to do the majority of housework and childcare, even though you’re technically working the same amount of time as your partner. \n\nWomen are expected to do the majority of care work in their families, they do most of the invisible labor, and they’re expected to do it all at the cost of their well-being. On top of this, you’re expected to have children, have to have a period, and also have to give birth. It’s baloney.",
   "created_utc": 1695832008,
   "score": 143,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g3cx5",
   "message": "Learning about all the extra sacrifices we have to make around reproduction due to the body we were born in (paying for period products, dealing with regular pain, scheduling birth control and gynecologist appointments, dealing with side affects, pregnancy, childbirth, nursing, etc) ....\n\n....and then learning that there are political groups that don't think that's enough of a burden and want to make things even harder for us by taking away any semblance of autonomy we have over our bodies or reproduction.",
   "created_utc": 1695830259,
   "score": 31,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fnu64",
   "message": "Being sexualized no matter what you do or wear, even as a kid. \n\nKnowing that many of the women you know and around you have been sexually harassed or assaulted in someway. \n\nBeing called a whore for liking sex. \n\nBeing called a slut and ugly when rejecting a guy. \n\nNot feeling safe when it’s dark outside.",
   "created_utc": 1695824663,
   "score": 216,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g2euw",
   "message": "So far? Getting diagnosed with endometriosis. Every month or so I would get struck with debilitating nausea and constant vomiting, lose feeling in my hands and feet and would end up collapsing because I couldn't walk. Took multiple ER trips before they figured it out. The doctor treated me like a drug addict and insisted I had Cannabinoid hyperemesis syndrome because I mentioned I smoked (it just so happened weed got legalized in my state within the month of my repeated visits). Incredibly demoralizing and humiliating experience. They got real sweet with me once they finally found the ~7cm long chocolate cyst eating away at one of my ovaries, whee~",
   "created_utc": 1695829926,
   "score": 40,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fyaa8",
   "message": "I can’t tell you how many guy friends I’ve heard say they love living in the cities. But, I live in the cities too and I get yelled at by gross fucks once a week. I rarely feel safe. Just two days ago I decided to take a short cut through a parking lot thinking I could just walk quickly through. And of course some frat guys were taking a smoke break and yelled at me super loudly about how they liked my ‘tits’. It was fucking disgusting. \n\nFuck people.\n\n*EDIT: I wish I could flip men off or say something back to them. I used to be the kind of person that would do that in heartbeat. But, I have no idea if a group of guys are going to start following me, will rush me, will threaten even WORSE things, or will see my license plate as I get into my car. \n\nNot to mention, if I’m with a friend, it would be irresponsible to try and start something that could put them in danger. God it sucks.",
   "created_utc": 1695828460,
   "score": 124,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gfua3",
   "message": "I think that monologue from the Barbie movie nailed it for me.",
   "created_utc": 1695834605,
   "score": 173,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gjerv",
   "message": "Honestly, being a woman always felt like a constant punishment to me. We're belittled and objectified our whole lives and there's nothing we can do against it. An uncanny amount of men are viewing women as living porn categories, not human beings. \nThe only time we get *true* attention and recognition is when we look our greatest. So we have to respond to that with the constant pressure of always looking good. \nOnce you get old, you become completely invisible. And with that current ageism going on, you're labeled as expired when you're 31 or so. No man will ever know what it feels like, no offense. Being a woman means to be tragically limited, because the only value that's given to us lies in our appearance. \n\nWithout wanting to sound dramatic, but I look forward to the day I die and can escape this hellish pressure forever, hopefully to never be reborn as a woman again.",
   "created_utc": 1695835852,
   "score": 36,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gjp0j",
   "message": "Invisible labor. \n\nI do so so so SO much for my family and it’s either not noticed or I’m accused of being overbearing or not being able to relax. \n\nThe expectation to be everything.",
   "created_utc": 1695835951,
   "score": 35,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gkb4r",
   "message": "Casual misogyny. It’s almost easier to deal with the extreme misogynists like Andrew Tate than the subtle everyday shit that is done/said about or to us. Medical professionals dismissing us, communities of men online talking about us like we’re a different species than them, being pitted against each other all the time by the media, stereotyping, even our hobbies get shit on simply because we’re women and things that we enjoy are seen as lesser. It’s so fucking insidious and it really wears you down.",
   "created_utc": 1695836165,
   "score": 182,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gi8xf",
   "message": "Never really being taken seriously for anything be it medical issues, financial, anything really. I’m tired of being seen as this adorable little thing that needs to be coddled and protecting and not a traumatized person who is just trying to get by and live. Having to bring my partner or male friend to help me out because no one takes me seriously. Oh and little to no bodily autonomy in some cases.\n\nI can write down more stuff that I hate about being a woman but I’m tired and want to go play with my kittens now.",
   "created_utc": 1695835447,
   "score": 72,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g8ucs",
   "message": "Constant pressure to be a great girlfriend/wife/mother/daughter/sister/friend etc. Be thin but not too thin, instead we need to be healthy. Can’t be fat, but a little meat on the bones is ok. Can’t dress too sexy or you’re a slut. Or if you are covered then you’re a prude. Be smart but not too smart cuz then you’re a know it all. Pressure to keep a clean happy home but also have a career. Make sure our partners are satisfied so they don’t cheat.",
   "created_utc": 1695832171,
   "score": 97,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fqph9",
   "message": "Probably knowing that in most of the world women are viewed as property or sexual objects, not as human beings with feelings, hopes and dreams just like a man.",
   "created_utc": 1695825729,
   "score": 213,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gu3ri",
   "message": "Dismissal\n\nEverything, from a young age, gets dismissed because of gender.\n\nSocial issues, physical pain, illness, etc is all viewed as us being weak whiney bitches.\n\nOur work is seen as inferior just because we produced it - and gets accolades when credits to any man",
   "created_utc": 1695840040,
   "score": 95,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gdqzu",
   "message": "The being a woman, part. All of it.",
   "created_utc": 1695833870,
   "score": 69,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gnoeg",
   "message": "The expectation of invisible labor.",
   "created_utc": 1695837367,
   "score": 34,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gdlx4",
   "message": "Being a ugly woman",
   "created_utc": 1695833821,
   "score": 81,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fo9y0",
   "message": "Honestly, the expectation of filling the role of a homemaker, but also in this economy having to work. No chance I'll ever get to be \"stay at home\" but the embedded bias is irritating.",
   "created_utc": 1695824830,
   "score": 207,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gbmmj",
   "message": "Periods. By far. Heavy, a week long and very painful. Can’t exercise or even leave the house, and sleep poorly. And this shit happens once or twice a month.",
   "created_utc": 1695833135,
   "score": 27,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gdmt0",
   "message": "PCOS, and no one takes you seriously",
   "created_utc": 1695833830,
   "score": 25,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gm2y3",
   "message": "Constantly being sexualized in society",
   "created_utc": 1695836783,
   "score": 25,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fvic4",
   "message": "Invisible labor. Everything extra that gets done, at home or at work, that doesn't get credit/paid for.",
   "created_utc": 1695827468,
   "score": 124,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g6qma",
   "message": "*gestures wildly everywhere*",
   "created_utc": 1695831442,
   "score": 109,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fb0of",
   "message": "Healthcare being based on men and never getting a diagnoses because \"it's just hormones\" or \"have you considered you're taking it\" or \"pregnancy\" while you're not pregnant",
   "created_utc": 1695819469,
   "score": 66,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g98w5",
   "message": "The hardest part is like standing infront of a crowd who yells boooo no matter what you do.",
   "created_utc": 1695832313,
   "score": 44,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gggqg",
   "message": "Not that this is the worst, but I think one of the most frustrating things to deal with is trying to explain how you feel- as a woman- and having men try to explain why you’re wrong. \n\nBut then there’s the danger, sexism, and biology that make life much much harder.",
   "created_utc": 1695834825,
   "score": 47,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gfhdi",
   "message": "We're just physically inferior, and it kills me.\n\nI am a lady weightlifter. I will never, ever be as strong as a man with the same amount of training. Any athletic achievements I have will always be ranked below men. I am doomed to be in sports divisions where people just don't value me as much -- they're too busy watching men. See how every team sport has the men's team being famous and the women's paid less and watched less. We run slower, jump lower, and lift lighter.\n\nOh yeah, that thing about women having higher pain tolerance is a myth. The only -- *only* \\-- areas where women have an advantage physically are in the very few sports where being a tiny person is useful (equestrian, gymnastics) and in ultramarathon swimming and running. If you are good at none of those, you are SOL, Shit Out of Luck.\n\nIf you're a non-skinny, non-feminine woman, you have basically no perks. No using your sex appeal to get drinks or whatever. No feeling desirable because people actually want you. No looking hot in a bikini. But, you also still lose physically against men if you're ever in a conflict. You have all the social disadvantages of a man with all the physical disadvantages of a woman. If you don't want babies, you're now totally irrelevant, because anything you can do, a guy can do as well or better. (I don't want babies, can't you tell.)\n\nIf you're not willowy or small,  you may as well be a guy, it'll get you more advantages.",
   "created_utc": 1695834480,
   "score": 104,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gfzwp",
   "message": "Outside of what’s already been mentioned here, I’d say having friendships with men as a woman is difficult.\n\nOne of my best friends is a guy I’ve known since college. We talk almost every week. However, I can’t talk about hanging out with him without someone asking why we aren’t dating or how we’re just in denial and should be dating.\n\nIt’s annoying and uncomfortable. Stop reading into people’s relationships. That’s what books are for.",
   "created_utc": 1695834660,
   "score": 78,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g3dh0",
   "message": "28f I’m a masc lesbian who has always identified as a woman, I was born female, and never questioned my gender identity. However, I have short hair and wear men’s clothing. So for me or others like me, it’s difficult getting glared at when leaving a restroom by other women who assume I used the wrong one or am doing something wrong/pervy by being there. I’m very tempted to ask the next woman looking at me hatefully if she’d like me to whip out my v for her as proof that I belong there. Just because my hair is short, and I don’t dress like you, doesn’t mean I’m not also a woman, and a person with feelings. I don’t need to be reminded that “I don’t fit the mold” every time I walk into or out of a rest stop bathroom. \n\nDisclaimer, most of the time women freeze when they see me, look at the sign, and look back at me. More out of confusion than distain. I’ve told many “It’s okay you’re in the right one” and they usually laugh it off or apologize once they hear my voice or look closer at me. I understand these encounters. But I’m talking more about the other type of person who makes it known they disapprove, and stand there glaring as I walk by or into the mirror as I wash my hands. Most of the time it’s fine though. This happens at least twice per bathroom break on my drives, no exaggeration. I have many stories.",
   "created_utc": 1695830264,
   "score": 19,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gij0m",
   "message": "Your whole life being controlled by your hormones and being the best/ normal version of yourself only 1 week per month. That party in 3 weeks? That holiday in 6 months? …could be the best time of my life or I could be 1- about to get my period in which case I’ll be less hyper and happy, more stressed , worried and tired 2- having my period, in which case I don’t even want to be here because everything hurts and I’m knackered 3- just coming out of my period and it left me with the energy of a sloth. I envy men SO MUCH. Oh, and then there’s the whole being afraid of being raped or murdered all the time since you are kids. \nWe just having a great time 😃✌🏻 lol",
   "created_utc": 1695835543,
   "score": 23,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gky53",
   "message": "Not being taken seriously.",
   "created_utc": 1695836386,
   "score": 26,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g1e3j",
   "message": "Constant vigilance. \n\nMen are the most dangerous people to to women and we have to condition ourselves to not set you off or reject you lest you decide to murder/ rape us.",
   "created_utc": 1695829563,
   "score": 237,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2ffg33",
   "message": "Safety",
   "created_utc": 1695821367,
   "score": 158,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2h1br9",
   "message": "Constant fear instilled by society and exasperated by male violence",
   "created_utc": 1695842612,
   "score": 17,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gd5l0",
   "message": "Periods. Not being respected in male dominant fields. Expectations around what a woman should say, how we behave, how we should dress, how we should age, etc.",
   "created_utc": 1695833663,
   "score": 17,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gbfj3",
   "message": "Being constantly treated like a piece of meat and victimized throughout our lives. Am still young too so there’s got to be even more trauma coming, but I can’t take more and my mental health is wrecked. Like how many more times will I get groped/SA’d by a male family member for fucks sake. Two times already. Not to mention all the insanely violating and creepy incidents I’ve dealt with at work. Then we get periods for an extra “fuck you” from life. Being female is a curse.",
   "created_utc": 1695833065,
   "score": 57,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fx57n",
   "message": "Everything gets connected back to a man somehow. \nOur experiences? \n“Well it’s not as bad, have you been a man?”\n\nI wish I can dress how I want, but I feel unsafe.\n“Well men can’t control themselves.”\n\nI wish healthcare took me more seriously.\n“Well men work more harder jobs or dangerous jobs.”\n\nYou get the idea.\nNot to devalue their own experiences, but it’s like can we focus on us for once?",
   "created_utc": 1695828053,
   "score": 128,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g1ahg",
   "message": "The constant double standard. \n\nIt just gets exhausting.",
   "created_utc": 1695829527,
   "score": 97,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gl9bh",
   "message": "Everything you do, say, write, read, listen and think is somehow different from other species on earth I guess",
   "created_utc": 1695836495,
   "score": 14,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2glo2b",
   "message": "To add a bit onto the people talking about the health issues and the societal struggles, and to summarize, pretty much just being a more \"high maintenance\" human being. And I know that term carries some different connotations that what I'm eluding to, but there are numerous forms of \"upkeep\" we have to perform on ourselves that men don't. There are also numerous medical ailments we are far more prone to dealing with, some of which you wouldn't even realize.\n\nI cannot even count the amount of times I've gotten a little pamphlet or piece of paper with information about whatever sent me to the doctor/hospital, and on the list of things that cause people to be more likely to get them, I see \"being female\". It legitimately makes me feel like I'm cursed at times.",
   "created_utc": 1695836637,
   "score": 14,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fhh4s",
   "message": "Time of the month.... but the thing is if we don’t get one then we would probably think “oh crap am I pregnant!?”\r  \n\r  \nWe just can’t win.... and NO we can’t hold it in like urine it just blobs out!",
   "created_utc": 1695822195,
   "score": 11,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g626z",
   "message": "Have you seen Barbie? She literally has a breakdown about this exact thing and it’s 100% accurate. \n\nNothing you do is right. Too fat too skinny. Too passive too bossy. It’s impossible to just be yourself and not face intense criticism.",
   "created_utc": 1695831201,
   "score": 62,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gq42y",
   "message": "Damned if you do damned if you don’t on literally anything and everything.",
   "created_utc": 1695838322,
   "score": 10,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gzq6d",
   "message": "It’s a bit vague, but I would say feeling like you constantly have to prove yourself, again and again, no matter what you do.",
   "created_utc": 1695842065,
   "score": 12,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fc7tx",
   "message": "The competition that exists between women, who is prettier, slimmer, sexier... it's very disruptive to life.",
   "created_utc": 1695820004,
   "score": 92,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g8lkb",
   "message": "Realizing you will always be the weaker physical sex and it is the men in your society who could at any point be a very real danger to you.",
   "created_utc": 1695832085,
   "score": 42,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fpohw",
   "message": "Being totally disregarded and ignored while still being expected carry the same load as a man. BUT I am still expected to carry all of the mental and emotional load. \n\nBeing thought of as the weaker sex but told that men are to fragile to do basic life tasks.\n\nBeing told that I am nothing without a man or children.\n\nAND finally if I’m not happy with any of this then there is something wrong with me.",
   "created_utc": 1695825353,
   "score": 110,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g14v6",
   "message": "The perception from men that your life is cherries and pie. They seem to think that we have it easy and get cash thrown at us. Lol I wish. Would make bill paying and working easier…..",
   "created_utc": 1695829471,
   "score": 39,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g4jqe",
   "message": "The expectation that I'm supposed to melt over anything baby related.\n\nI don't like babies or children. I don't want babies or children. I don't have any nurturing feelings towards them.\n\nI'm sick of being told that I just need to have some of my own, because then it'll be different and it'll change me. Firstly it's far worse and more dangerous to regret having a child, than to regret not having a child. And secondly, not wanting children and not feeling nurturing towards them isn't something that automatically needs to be \"fixed\" about me or any other person.",
   "created_utc": 1695830678,
   "score": 36,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fvs3e",
   "message": "unfortunately there are lots of things but what comes to mind for me the most are: Women still have to deal with double standards, things that are acceptable and Ok for men, women are still judged on. When women are victims, we are blamed. Misogyny is real and alive right now more than ever and we have to deal with that. don't believe me just go to any social media comment section. We constantly live in a state of hypervigilance, needing to always be aware of our surroundings and be one step ahead. Honestly, its exhausting and I've only mentioned the tip of the iceberg.",
   "created_utc": 1695827566,
   "score": 85,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g5y4m",
   "message": "It’s hard to pick one. I’d say all the issues related to our reproductive system, horrible reactions to medication because they’re designed for men and CONSTANT sexual harassment all share the top-tier for me.",
   "created_utc": 1695831162,
   "score": 25,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fyb5c",
   "message": "Many worrying symptoms being ignored and dismissed as period cramps or pregnancy.",
   "created_utc": 1695828468,
   "score": 20,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2go7o1",
   "message": "Doctors automatically taking years longer to diagnose the same illnesses / diseases because women are trained to grin and bear it and doctors still have some kind of collective consciousness they haven’t evolved out of regarding hysteria or some similar female medical phenomena that veers dangerously close to “we don’t believe that you understand your body better by living in it than we do by studying it relatively briefly.”\n\nThe “female tax” while still living through a gender wage gap. \n\nSomehow straddling being a “cool girl” while still being straight enough to breed and look pretty. Preferably effortlessly, if you don’t mind. I don’t know who I am anymore.",
   "created_utc": 1695837566,
   "score": 18,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2fy9te",
   "message": "Hard to pinpoint the “hardest” part, but periods really suck. I developed adenomyosis and my periods became atrocious.",
   "created_utc": 1695828455,
   "score": 10,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2gi49k",
   "message": "Being undermined",
   "created_utc": 1695835402,
   "score": 7,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2hjqd4",
   "message": "mate literally everything\n\n\\-expectations to get married and have kids ew i never want to have a kid\n\n\\-despite the fact stated above, still having to deal with the bullshit called periods\n\n\\-sexism \u0026amp; getting paid less than a man who does the exact same thing as me because yes that makes sense\n\n\\-the literal constant paranoia of \"i don't know this man very well what if he rapes me??\" or maybe that's just cuz i have paranoia so idk\n\n\\-if a man has unprotected sex he doesn't have to worry about accidentally getting pregnant. \n\n\\-society's pressure to always look our best for men like stfu i don't care if i look like a rabid trash panda but society is like \"bro what is that?\" so i have to go back inside and put make-up on\n\n\\-periods\n\n\\-WHY ARE GIRLS SO MEAN TO EACH OTHER LIKE JUST BECAUSE I AM MORE CONVENTIONALLY ATTRACTIVE THAN YOU OR SOME OTHER BULLSHIT DOESNT MEAN YOU HAVE TO BE SUCH A BITCH WE COULD HAVE BEEN FRIENDS\n\n\\-did i mention periods already?\n\n\\-\"just say no\" yeah tell that to the woman who got murdered because she told a guy 'no' and he didn't like it. or even better \"just ignore them, they'll go away\" tell that to the woman who got stabbed then thrown in a lake because she ignored a guy's advances and he didn't like it. stfu.\n\n\\-someone tell me why I'm somehow always doing stuff wrong???\n\n\\-i could have sworn i haven't mentioned periods yet",
   "created_utc": 1695848878,
   "score": 9,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2g0hxd",
   "message": "This isn’t the hardest part, but in the sciences our work is stolen and the credit given to men. It’s happened to nearly every woman I know who’s worked in a lab run by a man. When I mean stolen, it’s data collected, graphs and reports and maps, ect. 100% made by a woman, 0% credit given, like we never existed on the project whilst the men in our position get their fair credit.",
   "created_utc": 1695829246,
   "score": 53,
   "submission_id": "16tjlre"
  },
  {
   "comment_id": "k2hcjq5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16tjlre"
  }
 ]
}