{
 "submission_id": "16trgxx",
 "title": "Married people of reddit, what made you decide to get the engagement ring you did, and how much was it?",
 "selftext": "",
 "created_utc": 1695837523,
 "permalink": "/r/AskReddit/comments/16trgxx/married_people_of_reddit_what_made_you_decide_to/",
 "score": 79,
 "url": "https://www.reddit.com/r/AskReddit/comments/16trgxx/married_people_of_reddit_what_made_you_decide_to/",
 "comments": [
  {
   "comment_id": "k2h17gd",
   "message": "My grandmother pulled Me aside five minutes after meeting my now wife, then girlfriend for the first time, that she really loved her and she would fit right into our family. They had a REALLY good Bond for a couple of years before my grandmother passed. Her last Wish was that i used her engagement ring from 1945(grandfather proposed the day the germans left Norway) when i Ask for marriage. I did, she said yes, and we have been happily married for a good few years now.",
   "created_utc": 1695842570,
   "score": 247,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gz9wc",
   "message": "My mother was dying of cancer and gave me her engagement ring to give to my wife. It was a low profile diamond from 1965. I think my father paid $275 for it at Eaton’s. \n\nJust celebrated our 25th last week. She still wears it daily.",
   "created_utc": 1695841910,
   "score": 254,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gq16s",
   "message": "Was asked if I wanted a ring...surprised myself by saying that I did even though I'm not a jewelry person. So we went shopping and I hated all the jewelry store rings. Decided to check out antique stores and we found a cool looking '50s vintage diamond ring with an illusion setting (makes tiny stone look bigger). It fit. It was $300. It was perfect.",
   "created_utc": 1695838293,
   "score": 25,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h24go",
   "message": "I worked for the jeweler store. I had about a steep discount. I chose 5 and let him pick from there since I had to technically buy it. He picked my favorite.\n\nIt is a 1ct ruby set in rose gold, I love it. Retail it would be around $5000 for me it’s was $900. \n\nI wanted a ruby as I did not want a diamond, and I am a big history buff.",
   "created_utc": 1695842889,
   "score": 93,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2guhbu",
   "message": "I told my now-husband back when we were talking about getting married that I did not want him spending thousands of dollars on a ring for me. I just wanted something colorful, and that would stand out. We sat down and talked about the ring and went online to look at some. We landed on [this beautiful ocean cluster ring that has a variety of gorgeous blues](https://audryrosestyle.com/starry-ocean-cluster-ring) in it. \n\nWhen looking for a ring, you really need to sit down with your S.O. and ask what it is that they want. Most women wouldn't want someone to spend a ton of money on a ring.",
   "created_utc": 1695840188,
   "score": 220,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gwmsf",
   "message": "$140, I wanted a more expensive ring for her, but she insisted that I use that money for the wedding. I ended up going with a silver ring that looks like the branches of a tree, it has one large amethyst in the middle and two smaller ones in the branches to the side. When I saw it, it immediately reminded me of the date we went on when I realized I wanted to spend the rest of my life with her.\n\nWe got up early to go to an orchard that was a little while away, the whole ride, she was talking about how frustrated she was with work and I was so happy to be listening to her talk and to spend time with her. We spent all day at the orchard, we got lunch at the farmer's market, went on a hayride, went to a petting zoo, we picked pumpkins then picked apples as the sun was just starting to get low. From there we went a haunted trail on a ski trail that took us up the hill in a ski lift and we had to walk down. As we went up the hill, we got the most amazing view of the sunset and I knew had found my better half, because I couldn't even imagine anyone else that I would want to watch the sunset with.",
   "created_utc": 1695840985,
   "score": 192,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gzw7r",
   "message": "Tip for anyone ring shopping now; lab diamonds are the exact same as natural diamonds, they’re just way cheaper!",
   "created_utc": 1695842123,
   "score": 179,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gux6d",
   "message": "Hers has a piece of meteorite as the gem instead of diamond. I think all together I paid $150 for the set.",
   "created_utc": 1695840363,
   "score": 47,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gv5di",
   "message": "We went to a wholesale diamond store, so it is much cheaper there. Also ‘secondhand rings’ (basically rings that were ordered and diamond was fitted to it, but the person didn’t want to buy it at end for whatever reason) are cheaper than brand new.\n\n\n\n\n(Edit for regarding the ‘secondhand ring’ explanation)-\n\nNo no.\n\nIt’s “secondhand”.\n\nBasically at a wholesale market place, they sell diamonds to other stores. It’s cheaper to buy the diamond and ring there (\u0026amp; better quality) than at a typical Macys or Helsburg Diamonds. Think like a 1K diamond at Helsburg is like 8K+, but here is 2K. Same quality to better quality. Then you need to buy the band (another 500-1K) and get the diamond put into the ring.\n\nA ‘secondhand ring’ means that someone came and ordered a band and diamond. They pay a deposit. Then, for whatever reason, they decide not to get the ring/fully pay it off. Maybe they broke off the engagement, maybe fiance died, maybe they found something else, whatever.\n\nNow they consider it ‘secondhand’ and put it to be shown on display. So many people try it. Getting a ‘secondhand’ or ‘display’ item is cheaper than one that is newly ordered (at least in wholesale places). If you luck out and find a band in your size already there that is display/secondhand, instead of being like 500, it may be 200. And the diamond secondhand may be less as well. You can also negotiate for secondhand/display gems, which you can’t do as much in normal stores.",
   "created_utc": 1695840452,
   "score": 96,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gu0f7",
   "message": "[removed]",
   "created_utc": 1695840001,
   "score": 92,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gvrmu",
   "message": "We went shopping for one like 9 months before popping the question, she ended up liking something completely different than she initially expected. \n\n5500 for the engagement ring\n\n2500 for the wedding band.",
   "created_utc": 1695840682,
   "score": 73,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gvioe",
   "message": "It was a her great grandmothers. So just a little for the resizing",
   "created_utc": 1695840592,
   "score": 31,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h1fm5",
   "message": "My wife’s wedding rings were $160. Purchased from a friend who canceled his wedding. My ring was from a cigar. Married 42 years",
   "created_utc": 1695842649,
   "score": 110,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gwlm1",
   "message": "I couldn’t afford an engagement ring when we got married. It’s been a few years and now I can, so I’m working on a custom ring with a local jeweler we’ve worked with a bunch already. The concept is a subtle subversion of traditional engagement ring tropes and will cost around a grand USD",
   "created_utc": 1695840973,
   "score": 75,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2hebnq",
   "message": "Worked really hard, thought the name mattered.  50k TiffCo.  Was stupid don't follow my example.",
   "created_utc": 1695847033,
   "score": 51,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2guy26",
   "message": "My wife liked it. 15k",
   "created_utc": 1695840373,
   "score": 11,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h1m8y",
   "message": "She gave me pictures of a few rings she wanted.  All sapphires, no diamonds. I got one of those for $120.  Probably worth in the $200 range today.\n\nShe specifically did *not* want the \"two months' salary\" standard. She would refuse a ring that was expensive enough that somebody would be willing to cut off her hand in order to steal it.",
   "created_utc": 1695842714,
   "score": 45,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h60a8",
   "message": "My wife is a chemist and agronomist. She was working on her master's in agronomy and part of her thesis project had to do with cobalt and molybdenum. So I got her a cobalt chrome engagement ring (which happens to also be 6% molybdenum). For the stone I went with a manufactured sapphire, because science.\n\nShe absolutely loves it. Cost me less than $300",
   "created_utc": 1695844211,
   "score": 23,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gzfdz",
   "message": "I was lucky af, her mom gave me the ring her dad proposed with to give to her. Meant more to my wife than any other ring would've.",
   "created_utc": 1695841962,
   "score": 19,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h02i0",
   "message": "Our decision was not to purchase engagement rings because weddings cost so much. We have simple wedding bands purchased from a local jeweler. We know the woman who made them. No diamonds. No stones. But, our wedding was in a night club with amazing lights and sound. So...know where to spend it.",
   "created_utc": 1695842182,
   "score": 16,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2hlk25",
   "message": "Some individuals prioritize ethical and environmentally responsible choices, such as lab-grown diamonds or recycled metals. These choices can sometimes influence the ring's cost.",
   "created_utc": 1695849533,
   "score": 31,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gub16",
   "message": "I live in Canada, and my husband proposed to me without a ring. He wanted me to pick what I wanted since it's something I wear every day. Mine is a rose gold band with a small sapphire, just over $1500 CAD. Don't get a diamond, they're so overpriced. Sapphires are significantly cheaper and has close to the same hardness as a diamond. Wedding band was $75.",
   "created_utc": 1695840120,
   "score": 49,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2guzic",
   "message": "Got my wife the ring she desired. Rose gold. Everything she wanted. Paid $3300. I work construction and got myself a 3 pack of rubber rings from Walmart for $7.",
   "created_utc": 1695840389,
   "score": 230,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gpali",
   "message": "It was $600 usd. 1/4 ct diamond in the center, with an 1/8 on either side, and white gold. \n\nI love it. It's delicate and pretty.\n\nWedding ring is a plain white gold band that was $99.",
   "created_utc": 1695838000,
   "score": 24,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2guwhn",
   "message": "Let my wife pick her own it was like $25.",
   "created_utc": 1695840356,
   "score": 25,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h1mv8",
   "message": "Wife had a bunch of floral style rings on her Pinterest page so I went and got one custom designed from a local jeweller. They suggested Moissanite (synthetic diamond) to keep cost down and appearance up. Got 3x the stone for 1/2 the price of a real diamond. Well worth it. Total ran about 3k for the engagement ring.",
   "created_utc": 1695842719,
   "score": 25,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2hwhbc",
   "message": "Love the shaming on this thread for anyone who spent more than $24.99 on a ring.\n\n$18k because it’s the only expensive thing she’s ever asked me for and it makes her happy every single day. 1 year interest free financing softened the financial blow considerably.\n\nTo each their own! Don’t shame people for spending their money how they choose on the ones they love!",
   "created_utc": 1695853629,
   "score": 32,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2guotg",
   "message": "$3500 and it was the first one I saw. I wasn’t planning on asking her to marry me but I was walking through the mall, saw the store, saw the ring. That was that.",
   "created_utc": 1695840271,
   "score": 30,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gutim",
   "message": "I chose the shape of the stone, he chose the actual diamond (size, quality, etc) then we went shopping together to choose the setting. It was a lovely experience!  I got a ring I love which I will wear forever and he got to control / feel comfortable with a large component of the cost to keep within his budget.",
   "created_utc": 1695840324,
   "score": 19,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gwuon",
   "message": "My wife is very conservative, but wanted a real diamond for some reason which really surprised me because she's very environmentally conscious and really isn't into designer/expensive anything. Weird, but I love her so of course I got her what she wanted. It's custom built so it's one of a kind.\n\nIn total I believe it was just over 4.25 carat total weight. I think it was $35,000-$40,000 or so.",
   "created_utc": 1695841062,
   "score": 58,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gsbos",
   "message": "I went to the mall to buy a ring from a shop, knew I wanted white gold and a sapphire because that's her favorite gemstone. I think I spent around $3000 in 2013",
   "created_utc": 1695839137,
   "score": 8,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gvkgp",
   "message": "It was my grandmother's and it was awesome and it was free and she loved it.",
   "created_utc": 1695840611,
   "score": 8,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gvf3b",
   "message": "We never got an engagement ring. I don’t really like rings, so I proposed with a poster of the stars on the night we met.",
   "created_utc": 1695840555,
   "score": 21,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gxhxj",
   "message": "Two gay dudes. Got our rings off Amazon for like $16 each because I lose them all the time",
   "created_utc": 1695841289,
   "score": 54,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h2acp",
   "message": "My ring was purchased through a wholesale jewelry my MIL knew. He brought 3 cases of rings, it was the one I liked best. $285.\n\nHubbies ring: he had been married before.  I worked in dentistry.  I had our lab tech (the guy that makes crowns) melt down the ring and a gold bridge a patient didn't want and recast a new ring. Old ring had 3 diamond chips. I had a jewler reset the chips. Total cost: $36 and a 6 pack of beer.\n\nWe've been married almost 4 decades,  so it must have been OK!",
   "created_utc": 1695842944,
   "score": 12,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h43m7",
   "message": "My wife only dropped subtle hints. Luckily I chose the right setting \u0026amp; diamond. Spent $19,500",
   "created_utc": 1695843558,
   "score": 33,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h0vn3",
   "message": "Wife told me what cuts she likes, and whether she wants a silver or gold band. \n\nFriend recommended I go through Blue Nile to purchase a ring. It was an online retailer that had great prices because they didn't have any physical stores at the time my friend bought his wifes ring. \n\nWhen I decided to buy one, the first Blue Nile store opened up about 1.5 hours away from me. I drove there to check out some rings because I didn't trust diamond pics on the internet. \n\nTurns out the physical Blue Nile store only has fake plastic diamond rings on display just as a size reference. You still couldn't see the color and clairity of what you were buying. \n\nSat down with a sales rep who ended up showing me what kind of diamonds they have on her ipad (it was pointless for me to drive there). Bought a diamond ring that I liked by looking at it on an iPad, without seeing it in person. \n\nThey told me that the ring will be ready a day before I planned to get engaged. My plan was to get engaged on a vacation we were flying to. So if the ring wasn't as good as I hoped for it to be, I'd be very upset. \n\nTurns out the ring was beautiful and just as nice, if not nicer, than the picture of it on that ipad. The sales rep guaranteed I'd love the ring, and she was right! Wife loved it too and obviously said yes since I'm referring to her as \"wife\" lol. \n\n\u0026amp;#x200B;\n\nAll in all, check out Blue Nile. Great prices and great rings. Recommended it to two of my friends who ended up buying rings from them and they're all happily married/engaged. \n\n\u0026amp;#x200B;\n\nTL;DR: \n\nBlindly bought a ring from Blue Nile before even seeing it in person. Ring was beautiful and my wife loved it.",
   "created_utc": 1695842461,
   "score": 15,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h2a12",
   "message": "I got the one she wanted because she had a specific requirement due to needing to wear surgical gloves daily.  It was roughly $13,000 (This was our second marriage in our late thirties).  First marriage, I think I spent $300 from a pawn shop. lol",
   "created_utc": 1695842941,
   "score": 15,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h16y3",
   "message": "I proposed with a ring from a coin-op machine in the mall. I bought like 12 of them so she could pick her favorite.\n\nThen I gave her my grandma's fused together marriage/engagement ring after she said yes.",
   "created_utc": 1695842566,
   "score": 11,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h0lp2",
   "message": "[removed]",
   "created_utc": 1695842366,
   "score": 19,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gydty",
   "message": "We were dirt poor at the time.  My wife found a couple of rings she really liked.  One was on the billboard for our local jeweler, and when I went to see it they told me it was $9,000.  Okay, that's out of my price range but I can make it work for my wife.  When I asked how many carats it was, they said that was just for the ring, and you still have to pick out the individual diamonds to go in it, which adds thousands to the cost.  Holy shit!\n\nThen she found a solitaire she liked at Tiffany and Co, but again, this one was like $10,000.  But I was willing to make it work.\n\nBut at the end of the day, she said she didn't want me going into massive debt to get her an engagement ring and would rather we spend that money on stuff for the family, so she found a matching set at zales that she really liked and it was like 2 carats between the two rings and about $2500 total.  I did splurge and had our initials and wedding date engraved inside the ring, and there were two additional diamonds inside, as well.\n\nETA:  We do have money now, and I've offered several times, including when she had to have her ring cut off when I accidentally broke her finger playing catch, to buy her a nicer replacement set, but she said she wants to keep the actual rings we got married with.",
   "created_utc": 1695841602,
   "score": 5,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h0t1x",
   "message": "I just said “let’s get married,” she said yes, and then we want ring shopping with a price limit”",
   "created_utc": 1695842436,
   "score": 6,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h2l03",
   "message": "As the recipient I did not pick it out- 100% him and he did a great job. I think around $6k in 2004",
   "created_utc": 1695843044,
   "score": 5,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h4v6d",
   "message": "We were in our late 30s but really really broke. He gave me his high school class ring and said \"Let's go steady forever.\" Married 26 years!",
   "created_utc": 1695843821,
   "score": 5,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h54x0",
   "message": "Fifty two years ago my wife’s and my ring, Art Carved, were $50 and $60.\nToday they are over $1000.00 each. \nThe $110.00 original bill was paid in two different payments. Couldn’t afford to outright buy them.",
   "created_utc": 1695843912,
   "score": 4,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2hn5p9",
   "message": "I did not go the traditional route. I went to the jewelry store with my wife and she picked out the ring she wanted. \n\nWhen I proposed to my wife I used my mother’s ring  (she passed when I was a kid). However, my mother’s ring was gold and very old fashioned and that is not my wife’s style at all, so after she said yes I explained to her it was my mother’s and we could go get her a new ring that was more her but have the jeweler put my mothers diamond in it. That way she got a ring she loved and still had the sentimentality of my mom’s stone. A hybrid of old and new. \n\nAs a bonus I saved a LOT of money because while diamonds are expensive, *rings* are cheap!",
   "created_utc": 1695850109,
   "score": 4,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gsdg1",
   "message": "I didn't buy my own, but my husband chose my ring because of 1. my taste/style/likes, and 2. he found a company that donates a portion of their proceeds to charities that bring access to clean water to underserved areas. Part of the purchase included a note about what city would benefit from the funds from my ring. But no, I don't know how much he paid lol\n\nedit to add: I specified that I didn't want a diamond, as well- my ring has a moissanite stone. I wasn't comfortable with him spending that much, especially considering I'm not much of a jewelry person. Now that we're married, I only wear my engagement ring on special occasions/dates and usually just wear my (heirloom) wedding band.",
   "created_utc": 1695839155,
   "score": 13,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gtrqb",
   "message": "I think it was 5k USD",
   "created_utc": 1695839897,
   "score": 12,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2gzqu6",
   "message": "My late wife and I never discussed the engagement ring.  I bought her ring from a jeweler while traveling for work.  I picked it because it was pretty and thought she would like it. She did like it.  Cost me 2k",
   "created_utc": 1695842072,
   "score": 4,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h2b4t",
   "message": "I knew what I liked but he was not a fan of the shape.  He chose a few shapes he liked then we decided to go shopping to try on to see what we liked.  When I tried this ring on it was a shape neither us thought about but when it was on my finger I started to tear up and was shaking like a leaf on a tree.  He said that is the one. $3000 USD.",
   "created_utc": 1695842951,
   "score": 5,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h352u",
   "message": "Got platinum because of her nickel allergy. Custom designed ring and the trio of diamonds added to the cost - think I was in the $14k range.",
   "created_utc": 1695843235,
   "score": 4,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2hgfha",
   "message": "My wife of 40+ years picked them.  We were young.  We didn't have a pot to piss in or a window to throw it out of.  She did NOT want to blow a bunch of money on jewelry.\n\nWe got simple platinum (or is it white gold? -- I forget) wedding bands.  No engagement ring. Plus we got her small, simple, kind-of-matching hoop earrings for her pierced ears and a very simple and tasteful white gold necklace; they looked really nice on her at our very simple yet tasteful wedding.  I think I paid about $400 or so for the lot.\n\nShe still has the earrings.  Wears them practically every day.  \n\nI won the goddam jackpot when I met that woman.",
   "created_utc": 1695847739,
   "score": 3,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2i0te9",
   "message": "My wife liked a certain cut, and I had a certain income. The jeweler did the rest.",
   "created_utc": 1695855392,
   "score": 3,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2i0y78",
   "message": "Wife hates waiting…. low patience …high anxiety…..took her to a pawn shop- first store we went to first one she looked at —-$350 - best money I’ve ever spent in my life.",
   "created_utc": 1695855447,
   "score": 4,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h4tj2",
   "message": "1.5 carat lab-grown moissanite. Got it because moissanite is scientifically prettier than diamond(refractive index), and it doesn't give a red cent to DeBeers. $1400 for the set. Equivalent in diamond would've probably been near 10x that. Would recommend.",
   "created_utc": 1695843805,
   "score": 8,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h0fpl",
   "message": "I didn't need an expensive ring to know I wanted to marry him, so we got a $50 tungsten carbide ring for both of us.",
   "created_utc": 1695842308,
   "score": 7,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h0qbh",
   "message": "We talked about it beforehand and decided we both thought engagement rings made no sense, so we didn't do them. This freed us up to spend more on our wedding rings.",
   "created_utc": 1695842410,
   "score": 3,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h3orn",
   "message": "Both military so rubber rings",
   "created_utc": 1695843420,
   "score": 3,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2h5dmg",
   "message": "My husband and I just each bought a $20 wedding band off Amazon lol. We plan to upgrade, but we don’t really care too much. Also, my upgrade is going to be a ring off Etsy for less than $500. I like unique stones and settings (more artsy and organic) and think diamonds are scammy tbh. I absolutely do not want a big rock on my finger. Just a hassle plus asking to get robbed imo. It’s for some people but not me, personally. I do like wearing a ring simply to say I’m taken and that’s it.",
   "created_utc": 1695843994,
   "score": 3,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2hfwjg",
   "message": "All I told him was “I’m not a materialistic person, but I want a rock” \n\nAnd he did",
   "created_utc": 1695847563,
   "score": 3,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2i0j7v",
   "message": "He took me to a jewelry store to see what I’d like. This backfired in that I found a ring that I loved. It was an estate piece, so one of a kind. We bought it right then and there. My now husband had allocated 10k for a ring, but because it was an estate piece it was less expensive, only 3.6k. I like to remind him that I ended up saving him money.",
   "created_utc": 1695855274,
   "score": 3,
   "submission_id": "16trgxx"
  },
  {
   "comment_id": "k2i6emr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16trgxx"
  }
 ]
}