{
 "submission_id": "16tth1o",
 "title": "What's the most hilarious punishment you've ever heard of someone receiving in the military, and how did they end up in that absurd situation?",
 "selftext": "",
 "created_utc": 1695842744,
 "permalink": "/r/AskReddit/comments/16tth1o/whats_the_most_hilarious_punishment_youve_ever/",
 "score": 173,
 "url": "https://www.reddit.com/r/AskReddit/comments/16tth1o/whats_the_most_hilarious_punishment_youve_ever/",
 "comments": [
  {
   "comment_id": "k2h5o03",
   "message": "So this guy was constantly late to everything. Never out of bed on time, never in formation when he was supposed to be, etc.\n\nThe Sargents pulled a clock off the wall, attached a bike chain to it, and make it look like a big ass necklace. (If you were a rap fan back in the day you may know where this is going)\n\nThey made the dude wear it like a [Flava Flav clock chain](https://www.alamy.com/stock-photo/flavor-flav-clock.html?sortBy=relevant). They would constantly scream at him “Flava Flav what time is it?!?”\n\nHe learned to be on time real quick",
   "created_utc": 1695844092,
   "score": 40,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hesfk",
   "message": "So bunch of us are in basic training doing a camp.\nMedic warned us not to crap in the bushes as it is unhygienic and may cause epidemic typhus. We were  only use the temp toilets, which are basically a line of plastic seats on scaffolding planks, covering a trench.\n\nThe second morning he finds a turd in the grass under a nearby tree.\nCalls us all together to make a line. First guy at the turd, last at the closest toilet.\n\nWe had to transport the \"dead body\" back to \"its grave\", by passing it along only using our hands. After that, we had to fall in line behind a single tap from a water tanker to wash our hands.\n\nThe medic never found a turd in the grass again.",
   "created_utc": 1695847189,
   "score": 0,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hl0f2",
   "message": "Having to carry a plant to make up for the oxygen he was wasting.",
   "created_utc": 1695849337,
   "score": 52,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hxv3j",
   "message": "Trainee soldier (IDK the exact term, he wasn't a cadet, but, like, the level above it, but also not a proper soldier) on a yomp through the English countryside levelled his rifle at a sheep. It was dumb, but he was nowhere near stupid enough to actually shoot it.\n\nSomeone further up the chain found out and made him write an apology letter to God for threatening one of His creations. Every sentence had to have a sheep-related pun, \"to keep it light\".\n\nMotherfucker filled a whole sheet of A4, on his own, before the next morning. The sergeant told him he was wasting his talents in the army.\n\nHe agreed, and dropped out a few weeks later. Apparently he's a writer at the BBC now.",
   "created_utc": 1695854186,
   "score": 115,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hoe7m",
   "message": "1995 - At mile 4 of an 12 mile hump (quick water break), my assistant gunner forgot the tripod for the M60. The platoon sergeant made him hug and apologize to every tree along his side of the road for wasting oxygen for the rest of the road march.  8 miles of this and no one could go past him. A road march that should've taken three hours ended up taking 12.  There's a lot of trees at Ft. Campbell",
   "created_utc": 1695850559,
   "score": 225,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hdjwg",
   "message": "We were weighing out bags for deployment and one guys bags were way overweight. He starts taking out essential gear and putting it to the side. One of our petty officers began inspecting his bags only to discover about 20 mini bottles of maple syrup. He was made to drink them while being mocked for trying to bring syrup instead of his gun sling",
   "created_utc": 1695846777,
   "score": 133,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2h8m3o",
   "message": "In basic training, we went to the base store to ONLY buy personal care items. One guy buys a bowling ball. Drill instructor makes him carry it EVERYWHERE.",
   "created_utc": 1695845117,
   "score": 153,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2h63h7",
   "message": "Heh.  The smallest and scrawniest dude in the company would fall out on ruck marches.  So to build him up, and because it was funny, the NCOs made him run around the company when we marched anywhere (not with rucks), shouting \"I'm a satellite!\" \n\nThey only made him shout on the first day, but they kept up the running orbit thing for probably two weeks.  It actually worked.",
   "created_utc": 1695844243,
   "score": 133,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hbjuy",
   "message": "I don't know the full story, but early (7am) one Saturday morning I saw a soldier In full combat gear, including large backpack and rifle, sweeping up leaves on an Australian Army base.",
   "created_utc": 1695846100,
   "score": 213,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2huqcm",
   "message": "One Sunday during bootcamp we were supposed to be cleaning the barracks, so naturally, nobody was doing anything. One of the guys in my platoon got up on one of the footlockers and was squatting on top of it and started saying \"Yo, check it out I'm a bird\". At that moment we heard \"AT EASE\" as a Drill Sergeant walked in, gaze transfixed on this dude still squatting on top of the footlocker. Drill Sergeant says to him \"Okay you wanna be a bird, huh? Get down here\". Dude hops off and the DS makes him run around the barracks squawking like a bird. Mid-flight the DS stops him and says \"STOP! NOW LAY AN EGG\" so the dude promptly squats down and lets out the FATTEST fart I've heard in a long time. There was not a single soul in those barracks that wasn't dying. A million push-ups from everyone immediately followed.",
   "created_utc": 1695852941,
   "score": 8,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2h8zwi",
   "message": "I'm an archaeologist that often works on military bases... came across a large rock feature one day that spelled out \"I WILL NOT THROW ROCKS\" in small rocks. Gave us all a good laugh thinking about the soldier who was probably reamed for throwing rocks and then made to spell this out with rocks.",
   "created_utc": 1695845246,
   "score": 111,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2h58ir",
   "message": "When I was in the army a dumbass was cruel/neglectful to a military K-9.\n\nHe was forced to walk 2 miles to the K-9 training facility (with 20+ dogs) early the following morning, clean the kennels with bare hands, and deposit anything he picked up into the pockets of his uniform...\n\nBefore our unit had 4 hours of PT, in the hot sun.",
   "created_utc": 1695843946,
   "score": 204,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hfokt",
   "message": "It was pouring rain one day during boot camp so we were inside cleaning the squad bay. I don’t remember what this guy did to piss of the drill instructor, but the DI told him to grab a mop and mop up all the water on the sidewalk…in the rain. Poor guy was out there mopping the sidewalk for a few hours in the pouring rain.",
   "created_utc": 1695847488,
   "score": 195,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2ho742",
   "message": "I’ve seen people cutting grass with a pair of scissors, and counting how many individual stones there were outside the guard room.",
   "created_utc": 1695850487,
   "score": 141,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2honax",
   "message": "While serving in WWII, My grandpa was put on potato peeling duty for a week because he snuck off base to go drinking with a bunch of women. I’ve seen his album of pictures and he’s got a different lady on his arm in every pic.",
   "created_utc": 1695850650,
   "score": 107,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hpmwt",
   "message": "A serious one: mopping up rain in your full fancy dress (DEU's in Canada.) A platoon in training fucked up something fierce and had to go out in a parking lot in the rain and try to mop it up off the pavement.\n\nA funny one: we used to send new guys to supply to ask for a \"long weight.\"",
   "created_utc": 1695851013,
   "score": 110,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2htk8f",
   "message": "I was on extra duty (don't ask) for 2 months in AIT (army school) and one day they made me flip rocks around the track so they would evenly tan.",
   "created_utc": 1695852485,
   "score": 90,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2h3zct",
   "message": "\"Riding Under Tail\"\n\nTraditional Cavalry punishment, apparently. I only know about it from my great grandfather's journal (he was with the lighthorsemen in Australia in WW1 I think - someone in his unit was sentenced to it), but it was also used as recently as the 70s in some African conflicts from what I later researched.\n\nApparently it was considered just about the worst punishment you could get in the cavalry, for serious offenses.\n\nThe offending soldier would be made to ride a horse facing backwards.\n\nThey would then be made to lean forward, bending down until their face was tucked up snug against the horse's backside, the tail draping over it (hence the name - **\"under tail\"**).\n\nHe would then be bound firmly in that position and made to endure a full day's ride. Or multiple days, depending on the offense.",
   "created_utc": 1695843518,
   "score": 84,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hjtos",
   "message": "My buddy happens to have a quiet voice. I don't know how else to explain this other than to say that he can't really project his volume no matter how hard he tries. We always made fun of him about this growing up, but little did I know that the funniest situation pertaining to his inability to project would take place in the military.\n\nafter high school, he enlisted into the Marines. During boot camp he got in trouble for something and when the instructor asked him a question, he couldn't hear the response from my friend. The instructor got mad and told him he better yell and project when answer to him, but try as he may, my buddy just couldn't yell or scream loud enough to satisfy the instructor. When the instructor asked what was wrong with my buddy, he simply replied that he couldn't not yell loudly no matter how hard he tried. \n\nSo the instructor took him up on this and decided he'd find out for himself. The instructor made my buddy go into some sandpit to dig sand for an extremely long period of time, while singing/screaming the children's song \"The Wheels on the Bus\" as loud as he could. And every time the instructor was not satisfied with the volume of his singing, he was forced to belt the song out again. According to my friend, he sang/yelled that song maybe 50 times before the instructor laughed and told him to stop.",
   "created_utc": 1695848911,
   "score": 5,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hzunh",
   "message": "In boot camp we had cleaning the trash can as a punishment...\n\nMy division was insane.\n\nSomehow somebody decided to really work at this... and we had the shiniest galvanized steel trashcan I've ever seen. You literally could see yourself in it. It went from being able to be used as a punishment to a point of pride. We brought it with us to some multi-division competition (I don't remeber what the fuck it was it's been 20+ years), using it as a drum.\n\nThe Chief and Petty Officers in charge were completely fucking baffled.",
   "created_utc": 1695854995,
   "score": 87,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hu6ct",
   "message": "So there I was, no shit no lie, at FOB Warhorse, Baqubah Iraq.  My platoon was about to go on patrol and all the vehicles are running all the final checks were done and we're ready to roll. \n\nI couldn't find my god damn helmet.  It wasn't anywhere.  I swear I just had it.  I tore the back of the Stryker apart and just could not find it.  Platoon sergeant is now coming over the radio net asking what the fucking hold up is.\n\nI had to sprint my ass back to our tent where I had left my helmet under my cot.\n\nI had to wear my helmet for a whole week, 24/7.  Sleep?  Helmet on.  Shower? Helmet on.  Gym? Helmet on.  Chow hall? Helmet on.\n\nI never did that again.",
   "created_utc": 1695852724,
   "score": 231,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hcwq6",
   "message": "When I was in navy bootcamp we had a guy get recycled (had to join a new division and go back several weeks) because he got busted calling somebody a \"c\\*\\*nk.\" (racist term for asian people)\n\nOn his first day in our division they took him into the fishbowl, and we couldn't hear a word they were saying, but we could see our RDCs absolutely laying into this dude.  Then our first RDC came out and gathered all of the asian members of our division, talked to them for a minute, and then had them line up outside the fishbowl towards him, flip him off, and smile and wave.",
   "created_utc": 1695846561,
   "score": 59,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hw6ji",
   "message": "Worked at a bar in a military town. Whole unit was in town for some kind of reunion. A bunch were staying at the hotel my bar was in and the night of the formal ball or whatever a bunch were in full dress pregaming at my bar, including a major and top sergeant. Some kid walks up in full dress uniform, salutes the Major and hands him a, like 5 page, hand written letter, then stands at full attention - in the middle of the bar. Major takes the letter, puts it down on the bar and proceeds to slowly drink his jack and coke while talking to the sergeant. Kid is still standing at full attention. After about 10 LOOOOOOONG minutes the Major tells the the kid to go back to his room and stay there for the rest of the night. Then he just hands me the letter - without ever reading it - and tells me to throw it in the trash. Sergeant says “he won’t do that again”. And that was it. No idea what the kid did or what the letter said. It was hilarious.",
   "created_utc": 1695853511,
   "score": 69,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2ha35b",
   "message": "In basic they made this kid get in one of the big trash cans in the lunchroom. After he was crouched down in there we all had to line up and dump our food trays on him. After each tray that was dumped on him he had to say 'thank you shipmate.'",
   "created_utc": 1695845615,
   "score": 34,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2h8cm3",
   "message": "There was a picture of someone scrubbing the floor of the grounds using a toothbrush in heavy rain with a caption wondering how that person fucked up to get that punishment",
   "created_utc": 1695845026,
   "score": 131,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hzyn2",
   "message": "One I heard from some Navy friends. An E3 was acting up and getting a little flippant with a senior Chief cause his birthday was the next day. Chief told him to straighten up or else. E3 basically said I don't care. It's not like you can take away my birthday.\n\nThe ship they were on just happened to be near the international date line, and the chief pulled some strings such that just around midnight the ship headed west across the international date line, thus being officially the day after the E3's birthday.",
   "created_utc": 1695855040,
   "score": 165,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i1hv6",
   "message": "Guy kept losing his ID/leaving it sitting in the computer. Chief \"borrowed\" it, took it to one of those one hour print job places, had it blown up to like 3 feet across, cut the picture out, and made the idiot walk around all day holding his enormous ID up with his face in the cut out hole. He stopped misplacing his ID after that.",
   "created_utc": 1695855676,
   "score": 58,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hqqct",
   "message": "Heard this from my step-dad from when he was a drill sergeant:\n\nThere was a class of recruits once and one of them was this generally weird guy. *At least* once a week, this kid would go to the base shrinks and claim he had suicidal thoughts. Every week, just the same story from this guy who never exhibited actual signs of self-harm. They didn't know if he was trying to get kicked out or what.\n\nFinally, after the 8th or 9th \"I'm gonna end it all, doc!\" visit, the doc had enough. In his desk, he had a dummy grenade he'd gotten as a gift. He grabbed the dummy grenade, *pulled the pin*, clasped it tightly into the kid's hands and said, \"Count to ten before you let it go,\" and then just RAN out of the office screaming for everyone to hit the deck. The kid couldn't see, but the people in the hall had rolled with it and \"panicked\" while trying not to laugh.\n\nThey waited for something to happen. Didn't really know what, just *something*. They waited for, like, an hour before they sent someone into the office. They found the kid basically having a panic attack, curled up under the desk with a white-knuckle grip on the dummy grenade. Took them another hour to get him to relinquish the grenade, go get checked out, then head back to the barracks.\n\nMotherfucker never talked about killing himself again, though.",
   "created_utc": 1695851418,
   "score": 248,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hr5hp",
   "message": "I thought of a second one. In the aircraft maintenance fields, there is one punishment that we all joke about but never really saw. Aircraft have to be electrically grounded for maintenance and to do so you plug this metal plug on a wire into the jet and clip the other end into a grounding port which idls usually a tablespoon sized divot in the pavent with a metal bar inside that is grounded. The punishment is having to clean them out. You can't smoke on the flight line, so most tobacco users dip, and when they needed to spit the old tobacco out, they would spit it into the grounding ports of which there are several dozens spread out over a couple football fields were of aircraft parking. Cleaning them out was pointless and a pain in the ass and time-consuming. My buddy again managed to screw up somehow and he was out there cleaning them out 2 days in a row.\n\nThe most common one was being made to carry a c139 chock ( a 3 ft long 6x6 piece of wood cut to block tires) around or in one unit a big ass awkwardly shaped rock",
   "created_utc": 1695851575,
   "score": 50,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hxmvs",
   "message": "Old anecdote about a dude the DIs at Parris Island made to stand in front of a mirror. They made him point to himself and then the mirror while repeating \"I'm not stupid, you're stupid.\"",
   "created_utc": 1695854094,
   "score": 51,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hxut0",
   "message": "A kid in my platoon got caught eating pizza out of a trashcan, so he had to answer to, \"Oscar the Grouch\" and sound off with \"Bitch, I eat out of fucking trash cans!\" for the last couple of weeks of training.",
   "created_utc": 1695854183,
   "score": 51,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hgt2e",
   "message": "I have no idea what their infraction was, but my nephew put some of his subordinates on \"tummy time.\" They had to lay on their stomach, but their arms and legs could not touch the ground, and if they were asked why they were there they could only respond, \"I'm in trouble.\" He made them stay that way for 10 minutes. The colonel walked in and asked them why they were on the floor, they responded, \"I'm in trouble.\" He took one look at my nephew, gave him a nod and walked out saying, \"Carry on.\"",
   "created_utc": 1695847865,
   "score": 211,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hr01g",
   "message": "I worked on f.w.w, I drove past the back side of the m.p station and seen two gentleman saluting at nothing, came back like and hour later, they were still there, saluting at nothing.",
   "created_utc": 1695851519,
   "score": 47,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hw5g5",
   "message": "I was an engineer. We all took an electronics exam and we all failed to answer one question correctly. 'What's the formula for resonant frequency?'\n\nSo they ordered the whole class to get changed into PT kit. We then had to jog around the perimeter of the camp chanting '1 over 2 PI Root LC, equals the resonant frequency'.\n\nThis camp had a big perimeter and we did several laps....\n\nOn the plus side, it's one formula I have never forgotten! :)",
   "created_utc": 1695853498,
   "score": 50,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hy66b",
   "message": "We had a tradition when you were new to the unit  and went on our first summer exercise (National Guard) that you would need to carry a rock around with you. It was an inspectable item so it needed to be with you at all times. You were not to let anyone else have this rock. The trick was if you lost the rock, you'd get another rock chosen by the platoon sergeant.\n\nOne guy had a hard time with the \"Don't give this to anyone else\" and kept losing his rock. After the 4th or 5th time, the platoon sergeant gave him what I can only describe as a small Boulder. This kid had to lug that rock around for the next week but he made damn sure not to lose it.",
   "created_utc": 1695854310,
   "score": 49,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hw5z7",
   "message": "The only thing I can really think of off the top of my head is The Hover.\n\nIt's more of a platoon wide punishment. The malefactor assumes the front leaning rest (pushup) position, but he holds the position approximately halfway down with his upper arms being more or less parallel to the ground. While in this position he is to use his arms to shift his body slowly back and forth side to side and in a circular fashion while the rest of the platoon (or company or whatever) seated in the bleachers beats their hands on their thighs making a staccato quite realistically resembling the sound of a helicopter's main rotor beating, hence The Hover",
   "created_utc": 1695853504,
   "score": 44,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hwxqz",
   "message": "A couple of guys hated wearing their cover (hat), so they kept \"forgetting\" to put it on when going outside.\n\nSgt made them each \"wear\" the other guy's hand as cover for a few days. They looked so ridiculous/miserable walking around holding another man's bald head.",
   "created_utc": 1695853813,
   "score": 45,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i0sas",
   "message": "Had a buddy who worked out so much that they started punishing him by taking away his “gym privileges” so he started running on the track for HOURS at a time. Then they got mad that he was still working out and CO said “you want to work out so much? Let’s see how bad you want it” and started making buddy do push-ups with him. Buddy was so excited to start doing push-ups he was cranking them out faster than the CO and started egging him on with shit like “cmon I thought you said you wanted to do push-ups? Those aren’t push-ups, let’s go, cmon keep up”.  CO promptly returned his “gym privileges”.",
   "created_utc": 1695855379,
   "score": 40,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2h6frx",
   "message": "Indian punishment. You go into a plank position and place your forehead onto the pavement in the middle of the afternoon when the sun is on fire. A high ranking officer told me about this a few weeks ago",
   "created_utc": 1695844364,
   "score": 112,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hu9uv",
   "message": "This is way back from basic but I think it remains the most comical punishment I've personally seen;\n\nWe had a guy recycle back into our company from the last cycle because he couldnt finish one of the reqs to get out of basic \n\nWe were in the middle of range week, turned out he was acting extremely arrogant and a drill sergeant just happened to overhear the comments made, which was something to the effect of \"Man, these sergeants are easy compared to my last class\".\n\nOur drills weren't to thrilled and decided to fuck with him on the next day at the range. We go, we qualify as does he, before we leave we do the usual \"no brass no ammo\" to make sure no one is swiping something from the range.\n\nOne of the sergeants had planted a live round in his pocket during the day, his turn comes up to get searched they find the \"stolen\" round, finally they start telling him to take off his ach, his gloves, his boots, until hes just wearing his top and bottom, basically his entire kit until hes barefoot, they then throw a singular one of his boots into some swampy area and tell him to fetch, he comes back they continue to throw all of his items in 1 by 1. Eventually they run out of things to throw and he puts all of that shit back on and runs around the rest of the day muddy af. It was a pretty fun experience all around tbh though, he took it well and laughed it off, his attitude didnt really change and he was still fucked with, but at least he could take a joke.\n\nReading this back it doesnt seem so funny but in the moment it was hilarious, and just something that stuck with me.",
   "created_utc": 1695852762,
   "score": 70,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hva1g",
   "message": "My sister was an MP in the Army. They’re transporting a military prisoner from Germany to the US. The prisoner is being an asshole to my sister and she told him to stfu or he’d be sorry. He keeps hassling her. She handcuffs his hands to his feet and ignores him for the rest of the flight. \n\nThe women in our family are not to be trifled with.",
   "created_utc": 1695853156,
   "score": 69,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hp0d2",
   "message": "I've read a story here about a guy who had to put sunscreen on rocks. Cannot for the life of me remember why but I laughed at that one.",
   "created_utc": 1695850782,
   "score": 63,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hwcur",
   "message": "When I was in basic we had something go right for once and got kinda loud because we were excited. Now my RDC was very disgruntled at this display of enthusiasm. So he disappeared and idk where TF he found them but he came back with several carts full of dictionaries. \n\nHe passed them out and then had us all stand at parade rest and hold the dictionaries straight out in front of us with our arms fully extended. He had us read the definition of discipline. Then he said we had to keep repeating the definition without our arms drooping until he was satisfied. \n\nMy arms had never burned like that before.",
   "created_utc": 1695853579,
   "score": 29,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hvjic",
   "message": "Dad told me they used to put the new guys on “Hurricane watch”….in Sault Sainte Marie, Michigan.  Then, they’d go to the roof and dump a trash can of water on them and shout “Hurricane!!!”",
   "created_utc": 1695853259,
   "score": 56,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hwz12",
   "message": "Navy boot camp, a guy in my division had to apologize to every tree he passed for wasting oxygen. I don't remember what he did. Another guy was caught having sex in the stairwell with a girl from another division he had to wear a condom at all times unless he was showering. Only lasted a couple days him and the girl were processed out. \n\nMy second duty station a guy was caught sleeping in a supply closet when we were supposed to be cleaning. The same closet where the cleaning supplies are stored... he had to sweep the gravel parking lot with a small kitchen broom until the gravel was all perfectly level and evenly spread.",
   "created_utc": 1695853827,
   "score": 28,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i22of",
   "message": "I grew up in the military, and lived on the Air Force bases when I was younger. Everyone has to have a military ID to get through the gate, even civilians and children over the age of 10. One time my brothers and I were fighting in the car and my mom got really mad when we wouldn’t stop. So she drove right to the outside of the base gate, took our military IDs and kicked us out of the car. We literally could not get back to our house until we had our military cards or our parents came back. All I can remember is the guards just laughing and laughing and laughing at us.",
   "created_utc": 1695855922,
   "score": 28,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i89lq",
   "message": "We had a guy who could just not get his shit together. We all know that troop. Even the easy things were hard, etc etc. \n\nThe cadre found out he was a former opera singer and also fluent in German. So they made him write and sing opera songs about his fuck ups. This was the only thing he was good at. \n\nNow here’s where this gets hilarious, beyond one dude singing self deprecating songs in a marching formation. The cadre would bark “German style!” and he’d seamlessly switch his lyrics to German. They’d yell “underwater style!” and he’d take his index finger and flip it up and down on his lips as he sang, making the song sound bubbly. \n\nNot only could the cadre not hold it together, the guys in his company would absolutely lose it. Complete breakdown in military bearing and no one cared. Other cadre and instructors would come just to listen and *they* would be in tears laughing. \n\nI don’t know where you are now homeboy, but thanks for the laughs.",
   "created_utc": 1695858519,
   "score": 25,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hvzct",
   "message": "in ww2 in N africa my grandfather was in charge of getting 20 dudes to blow up a bridge (he was an architect/engineer turn demolitionist for the war) and they were crossing a field at night and (with the help of locals) my grandfather laid out a route around this giant goat farm and they were given careful instructions to crawl most of it, even if it meant crawling through goat shit.  Long story short, dude stood up yelling about goat shit, got shot at and almost got all of them killed.  When the mission was over said soldier was instructed to \"clean\" the field.",
   "created_utc": 1695853431,
   "score": 68,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hpgif",
   "message": "Not sure why but I saw a section of combat engineers mop the rain in their parade dress.",
   "created_utc": 1695850948,
   "score": 21,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hs36x",
   "message": "I had to sweep rain for 6 hours during a hurricane.",
   "created_utc": 1695851924,
   "score": 22,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hwo4q",
   "message": "British TV show early 2000's they get a bunch of lads normally all on the wrong path silly crimes etc got them to do basic training like they they would have in WW2. One of them did something wrong not import what but as a punishment he was made to paint all the coal in a storage shed white while the others went off to do training. He decided to lay the coal out saying \"welcome back\" on the parade ground. When they got back the Sargent obviously saw this and then made him paint all the coal black.. I laughed my arse off.\nEdit: spelling",
   "created_utc": 1695853706,
   "score": 22,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i0bkc",
   "message": "Heard a story from a Marine friend of mine. Deployed in Iraq, his battle buddy had anger issues and after a phone call with his girlfriend punched a locker and broke his hand. He got into serious trouble for “damaging government property” not the locker, him, his hand. They forced him to make sand bags, every day digging with his left hand until his right hand healed.",
   "created_utc": 1695855187,
   "score": 22,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i358n",
   "message": "While on a run through hilly scrub, during my naval intake, we stopped briefly on a hill with a rock painted white. No mention was made of it, but it was conspicuous. We carried on running for about half an hour in the summer heat, until one of our troop wasn't listening and he got verbally reamed by our Leading Hand. LH asked the dipshit \"Do you remember the painted rock at so-and-so location?\". Dipshit answered in the affirmative. LH just said \"Go\". We all waited in peak midday sun, until eventually he comes grunting and sweating carrying the white-painted rock weighing about 20kg. LH yells at the dipshit \"What the fuck is that?\". Dipshit says \"it's the rock you asked me to bring back\". LH replies nonchalantly that he didn't actually ask dipshit to bring him the rock. Dipshit had to carry it all the way back, and return as fast as possible.",
   "created_utc": 1695856373,
   "score": 21,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i59n1",
   "message": "My dad a WWII vet told me this. He was training for a tank crew in a Sheridan tank. He said it was so miserable.  He said that they would make you clean every spot of oil off the inside of the engine compartment and as soon as you started it it would throw oil all over. But finally they let them drive it out into the fields and he said there was one little shack out there that hadn't been destroyed yet. So they decided to drive through it. Welp, it had a root cellar, and the tank dropped through the floor into the cellar. They came out with shovels and made them dig a 45 degree plane to drive the tank out of the cellar. He said a couple weeks later some fellas came out and ask for volunteers. You had to be 6 foot, never had a broken bone, and all your teeth. He said he hated tanks so much that he raised up his hand. That is how he ended up in the 101st airborne.",
   "created_utc": 1695857264,
   "score": 22,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hz0tc",
   "message": "Had a guy that was always late for work, to the point he was (over)due to actually get paperwork for it. His supervisor ended up PCS'ing so he got a new supervisor, TSgt Thomas. Sgt Thomas gave the guy an option: He could either take the paperwork, OR, each time he was late, the next day, he'd have to be into work an hour early. Each month his slate would wipe clean no matter what and he'd come in the normal time.\n\nThis poor guy got to the point he was working like 16 hr days (we worked 8s at the time) because he'd over sleep, come in late, then the next day of having to show an hour earlier, he show up late, and it would cycle. This went on of like 3 months I believe until the Msgt found out. The long and short of it was, he worked all them hours, and still got paperwork. 😂",
   "created_utc": 1695854658,
   "score": 18,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2htrjn",
   "message": "My uncle in the Navy had a hard time not smiling in basic.  His DI made him dig a 5ft hole, pull off his smile and bury it.  Then dig it up every few hours to make sure it was still there.",
   "created_utc": 1695852563,
   "score": 39,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i5sva",
   "message": "I once had a ladybug land on my desk during morning inspection. When staff found it. I had to write a 500 word biography of who the bug was etc. and then had to make sure he was there for the rest of the week in good health for every morning inspection that week. Lol",
   "created_utc": 1695857490,
   "score": 18,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hozct",
   "message": "We had this new guy in our acft. Mechanic flt. That would not step far enough to the side when he marshalles aircraft(think the guys waving light wands) that the wing tips could pass without hitting him or dang near hitting him. One day, as he was marshaling the jet out, the pod on the end of the wing bonked him in the head and knocked him on his ass. His supervisor made him wear a hard hat for the next week, everywhere he went indoors and out. I chuckled to myself every time I saw him.",
   "created_utc": 1695850772,
   "score": 74,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hyprg",
   "message": "We were out on a FTX and this one guy left his m4 in the port-a-potty. His sgt made him stand guard of the shitter all day (he was a pretty useless soldier). when some one came to use it, he had to clear it as if clearing a room and then when the person came out he had to do it again. He did that for 2 days straight.",
   "created_utc": 1695854531,
   "score": 36,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i1noj",
   "message": "Had to apologise to a tree for wasting the oxygen it worked so hard to make, but of course trees don't have eyes, so to make sure the tree knew he was talking to it, he had to stroke it as he repeatedly apologised",
   "created_utc": 1695855745,
   "score": 15,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i3x1y",
   "message": "We were on a 2 week exercise in New Zealand (from Australia). One of our guys lost the case holding the spare barrel for his MG. That’s a major fucking deal. They figured out where they thought he might have lost it and drove out ther. Sure enough it was on the ground next to where we had jumped out the back of some trucks.\n\nHe was going to get charged for losing a weapon but they worked out that the clip holding the strap that holds the barrel bag around your waist had broken and decided that since it was equipment failure he couldn’t be held to the same level of accountability. I’m pretty sure they were just avoiding paperwork.\n\nAnyhoo, instead of that, they came up with an alternative. Our company sergeant major was a crazy Scotsman, this particular soldier had gone to a private school and learned to play the bagpipes and had brought them along on the exercise (at the request of one of the officers for some sort of ceremonial purpose). So the CSM makes him walk up and down the parade ground playing his bagpipes for a couple of hours as punishment.",
   "created_utc": 1695856696,
   "score": 16,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i67sp",
   "message": "I made a few of my Marines carry around a plant when they did something dumb to “Replace the oxygen they’re stealing from everyone else.” If anyone asked them why tf they had a plant they were to say that verbatim. Gunny called me into his office one day and he had the plant on his desk. He thought I was hilarious, but made it clear that that was too much hazing and I couldn’t do it anymore. This is not an original idea, a DI told one of the dumber recruits that he was going to make him do this but he never actually did and I’d heard of it a couple times but never actually saw it happen so when I became an NCO I had to take it for a spin. Got a few guys before Gunny shut me down. It wasn’t even a real plant which was hilarious to me.",
   "created_utc": 1695857666,
   "score": 14,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i6k3u",
   "message": "Guy killed a dung beetle (or some other giant beetle the size of your palm) at Ft. Benning / Ft. Moore in Georgia.  Airborne instructors made everyone stand at attention in the sawdust pit.  Orders came to the beetle killer: \n\nSgt. Airborne:  “Dig a shallow grave!”\n\nHe gets down on his knees digs a shallow grave in the sawdust. \n\nSgt. Airborne:  “Say a few kind words!”\n\nBeetle Killer, at the position of attention:  “I’m sorry beetle.  You were a good beetle. I’m sorry I killed you. You didn’t deserve to die.”\n\nSgt. Airborne:  “Everyone, salute!”\n\nFollowed by Sgt. Airborne humming taps, while Beetle Killer fills in the small grave site.",
   "created_utc": 1695857810,
   "score": 17,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i33ee",
   "message": "I think my favorite was the M240 Bravo gunner that had to construct and carry around a life sized cardboard replica of his gun. Not sure what exactly he did, but for a week, at every 0900 formation, he was in the prone in front of the entire company taking orders from his weapons squad leader. The entire thing was of course replete with orally-generated machine gun noises which were NOT optional.",
   "created_utc": 1695856352,
   "score": 14,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i67b6",
   "message": "Our favorite one one was ping pong. We used it for a variety of offenses. Basically we'd tell the offender he had to go and find someone and deliver him the message \"ping\". Once he got there the recipient would tell him that he should go back to the sender and tell him \"pong\". This could go on for a long while, some times even days with just a few breaks in between. We preferred routes that had them trek the entire base, and some times we even made them jog to and fro. I think the funniest thing is how confused they are initially with being told to give such a seemingly random and cryptic message, only to then see their face when they realise what's going on. It's even funnier that many of them never actually caught on to the joke, but even those who did couldn't not do it because they were ordered to by a superior.\n\nThere was this other time where I was the offender, and the punishment was not funny at all, though it kinda is in retrospect. The punishment was that we had to run through the entire base back and forth for about an hour, fully geared up, in scorching 40C heat, do jumping jacks and other exercises while a lieutenant screamed his lungs out to my face. Unfortunately while I was the offender, it was the whole platoon being punished. It's the reason that's funny. Basically, as we had assembled and waited for the lieutenant to assign our daily duties, we were understandably quite uncomfortable in the heat and we had to stand still while he took his sweet time for more than 20 mins. Well at some point I jokingly yelled out loud \"Come forth, Lazarus!\" and wouldn't you know it he came out immediately screaming \"who said that\" and the rest is history. The entire platoon hated me that evening but in retrospect it was pretty funny because that guy had a stick up his ass permanently.",
   "created_utc": 1695857660,
   "score": 13,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hz7d4",
   "message": "I don't know how it works in other places, so it might not make a whole lot of sense without context.\n\nMy sister served in the military, and was sent to go on trial for losing her military ID. Two days before her (planned) discharge.\n\nThe people operating the \"military trial\" situation tried their best to appear serious and dramatic, sternly scolding her on the severity of losing \"sensitive equipment\"... Only to then crack with \"Okay, enough with that. It's an 8$ fine. Do you have change on you, by any chance?\".",
   "created_utc": 1695854731,
   "score": 28,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i0a4e",
   "message": "During basic at the range, one of guys from another platoon left his rifle on the ground and stepped away long enough for the Drill Sergeant to notice.\n\nHe had to run in circles around the range all day the hot Alabama sun calling, here weapon, weapon!",
   "created_utc": 1695855171,
   "score": 12,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hsml5",
   "message": "Guys in my unit had to rake the rocks at GTMO.",
   "created_utc": 1695852126,
   "score": 14,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hsrtt",
   "message": "My brother in law was in the Marines and a guy in his unit was always spitting his tobacco spit on the sidewalks. He was careful who he did it in front of but one day he did it right in front of higher up officer and he came up with a very unique punishment. He was sent outside to brush debris from in-between sidewalks contraction joints and cracks with his toothbrush for a while. \n\nI've heard of similar ones from other people. Another was someone being sent outside to collect all of the small pebbles on the sidewalks.",
   "created_utc": 1695852182,
   "score": 25,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i30td",
   "message": "Coast Guard Basic Training\n\nCompany commander caught a tiny Sikh girl looking out the window while waiting her turn to throw her lunch tray away. So they gave her to plastic cups instructed to use them as binoculars and tell them what she sees.\n\"I see birds!\"\nWhat else\n\"I see clouds\"\nWhat else\n\"I see trees\"\n\nEvery morning we wake-up at 0530 with a fire drill and muster into formation outside the barracks. And a guy arrived late. So the CC told him he is dead. Hes on fire. And to shout \"im on fire, im on fire\" while waiving his arms in the air as we marched to the next location.\n\nIn a class session i asked a question about blousing our pants. It always appeared they were tucked into our boots. But the CC explained it and it finally registered in me so i responded \"Ohhh\" \n\nOhhh?!?! Seaman recruit Checkeredfloors I want you to stand in the back of the classroom and everytime i say something interesting i want you to go OOOHHHH\n\nI CANT HEAR YOUUU\n\nOOOO..ooooo Ahhhhh \n\nFun times",
   "created_utc": 1695856322,
   "score": 26,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hyjmz",
   "message": "At my MOS school I had a real dick of a corporal that made me rake leaves from 10pm on Saturday night to 4am Sunday morning.",
   "created_utc": 1695854462,
   "score": 11,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i3pc9",
   "message": "Stationed in 29 palms (Mojave desert.) There was one junior marine who had a problem being overweight.  He decides a weeklong field op in the middle of the summer is the best time to lose weight by not eating. His corporal found out he was starving himself after he almost falls out. The corporal tells him to eat. Junior refuses. Corporal again tells him to eat. Boot says “I’m just not hungry corporal.” Corporal tells him one more time to eat or he will have his peer feed him and he will not like it. Corporal is again told that he’s just not hungry.\nCorporal ordered junior marine to stand at attention then tilt his head back, open his mouth, and close his eyes. Corporal then tells other junior marine to scoop up sand and pour it into overweight marine’s mouth, which he did. Then Corporal put overweight marine at attention again and repeated.\nAfter the second time overweight marine willingly ate an mre.",
   "created_utc": 1695856607,
   "score": 10,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i36ii",
   "message": "It was me. I was leaning on a wall, had to hold the wall up, and shout for help. \"Help help the wall is falling\" and then.. it happened again when i was leaning on a railing.",
   "created_utc": 1695856388,
   "score": 9,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i58s1",
   "message": "Craziest one I was privy to was out in the desert in Arizona. If you have been there, you know it gets hot and the UV index is through the roof. So, cue a week long field problem. Everyone was told to pack sunscreen in their kits and to be applying it regularly. We even have scheduled times for it. One doofus decided he wasn’t going to listen and catches 2nd degree sunburn across his face and neck. Has to get taken to the hospital, whole nine yards.\n\nAnyway, after he was cleared to be back in the sun, he was made to wear sunscreen so thick ilhe was a ghost, and then he had to apply sunscreen to the rock garden around the post headquarters building… and flip them every 2 hours to apply sunscreen to their other side so they would tan evenly. It was pretty glorious to witness.",
   "created_utc": 1695857254,
   "score": 8,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hmoa8",
   "message": "In bootcamp the grinder had a white line that enclosed it. Our CC told one gut to double time that circle until he he got to the end of it.",
   "created_utc": 1695849934,
   "score": 15,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i3m5i",
   "message": "I had to teach a class on destruction of government property to the company after I came to work with a hicky on my neck…",
   "created_utc": 1695856568,
   "score": 7,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2i7xe6",
   "message": "Dude my dad's big punishment in basic belongs on this list for sure. In basic they're in class and he's bored doodling motorcycles because it's tools 101 and in his words \"only idiots needed it but we all had to be there.\" DI caught him. Ripped him outta the chair and made him go in front of the class. \n\nDI goes \"so you like motorcycles?\" \nDad goes \"yes sir\" \nDI says \"show me how you ride one of those.\"\n *dad crouches into the riding position* \nDI goes \"great stay like that the rest of class\"\n\nIn my dad's story it was HOURS in that position. Knowing him it was less than 10 minutes.",
   "created_utc": 1695858378,
   "score": 8,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2hz253",
   "message": "I've heard a lot of bizarre stories about military punishments, but the most interesting was this one: during World War I, General John J. \"Black Jack\" Pershinger forced an officer to carry a huge wooden spoon instead of a sword because he forgot his gun. I understand that there should be discipline and care and especially in the military but this is too much for me, what do you think?",
   "created_utc": 1695854673,
   "score": 47,
   "submission_id": "16tth1o"
  },
  {
   "comment_id": "k2iis9q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16tth1o"
  }
 ]
}