{
 "submission_id": "16twrnr",
 "title": "Women of reddit, do you notice when men subtly(?) Adjust their dicks? If so, how often do you notice and what are your general thoughts on it?",
 "selftext": "",
 "created_utc": 1695850361,
 "permalink": "/r/AskReddit/comments/16twrnr/women_of_reddit_do_you_notice_when_men_subtly/",
 "score": 34,
 "url": "https://www.reddit.com/r/AskReddit/comments/16twrnr/women_of_reddit_do_you_notice_when_men_subtly/",
 "comments": [
  {
   "comment_id": "k2homf7",
   "message": "It’s obvious you either do a weird sidestep and reach into your pocket all the way to your dick or like weirdly shake the front of your pants. Or do a little squatty shifty type move",
   "created_utc": 1695850641,
   "score": 127,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hopdf",
   "message": "I notice. I don't know how often I notice. I don't really think about it. I just assume they're unpeeling their balls from their thighs.",
   "created_utc": 1695850671,
   "score": 236,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hqfk1",
   "message": "I notice sometimes. If they dont call me out if they notice me adjust my boobs, I wont call them out for adjusting their junk.\n\n Life is uncomfortable sometimes, so why make it more so by pointing things out needlessly?",
   "created_utc": 1695851308,
   "score": 102,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hr5wi",
   "message": "It’s life. I have to adjust my bra all the damn time lmao",
   "created_utc": 1695851579,
   "score": 173,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hoi46",
   "message": "I notice most of the time, but I don’t think anything of it. Shit gets uncomfy sometimes. I have to adjust my bra too because the gore or underwire is digging into my boob. It is what it is.",
   "created_utc": 1695850598,
   "score": 68,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hq7u9",
   "message": "subtly? they could do it while staring at your eyes and talking about their mom's birthday haha",
   "created_utc": 1695851229,
   "score": 9,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hqu6i",
   "message": "Lol yep. I dunno how often I notice. Thoughts are similar to adjusting my bra. It’s only weird if I notice it happening w the same dude multiple times in a short period. Like, wtf is going on in there? But maybe it’s like the equivalent of wearing a bad bra. So who knows. It’s nbd mostly.",
   "created_utc": 1695851458,
   "score": 100,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2honn7",
   "message": "I know this question is asking women, but as a man that was being called out for \"adjusting their scrotum\" without even realizing it at the moment, it was not only pretty embarassing, but being told \"y'all do it all the time\" made me question my reality.",
   "created_utc": 1695850653,
   "score": 59,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2i6ak6",
   "message": "They are not subtle, lol",
   "created_utc": 1695857699,
   "score": 23,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2htgux",
   "message": "Yes, they will stand ‘wide legged’ and sort of move around, especially in oversized shorts.",
   "created_utc": 1695852448,
   "score": 20,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hplvl",
   "message": "Like tucking the tip into the waistband?",
   "created_utc": 1695851003,
   "score": 43,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2ho918",
   "message": "Fuck I don’t wanna know the answer to this and if we are that obvious, I don’t need that kind of anxiety",
   "created_utc": 1695850507,
   "score": 46,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hv6bd",
   "message": "As a guy I never notice other guys doing it, so it's fascinating and scary to learn that women do notice.",
   "created_utc": 1695853115,
   "score": 44,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2i567d",
   "message": "I’m interested to know if the men’s underwear with the pouch for your balls is helpful for this issue or is it a gimmick? Inquiring minds want to know!",
   "created_utc": 1695857224,
   "score": 14,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hq20y",
   "message": "Yes, I notice. I don't think anything of it, unless a guy is doing it constantly.",
   "created_utc": 1695851170,
   "score": 13,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hsuwu",
   "message": "It's pretty damn obvious, unfortunately. I've seen both men and women notice it in the gym, at work, at the park, everywhere!",
   "created_utc": 1695852217,
   "score": 7,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2i9zuv",
   "message": "Yeah, I noticed. General thoughts are that balls are sticking, package has shifted uncomfortably/er...Pressure, or popping out of undies lol. (I always ask my hubby if he's okay when he does it 😬)",
   "created_utc": 1695859247,
   "score": 6,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hrsvt",
   "message": "I think of it as like, scratching an itch essentially. I do notice, but it's not a big deal.",
   "created_utc": 1695851817,
   "score": 6,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2ib8tz",
   "message": "Yes I notice, I do the same when my underwear snags my lady bits a bad way. It’s whatever.",
   "created_utc": 1695859762,
   "score": 4,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hohpd",
   "message": "Is this really a big deal?\n\nAs a man sometimes your balls get stuck to your thighs and the only thing I can think to say is it’s as uncomfortable as a girls push up bra slamming their nipple.\n\nIt’s human",
   "created_utc": 1695850594,
   "score": 22,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2i0krf",
   "message": "Yes, I notice, and it doesn't bother me unless it's a constant thing. \n\nFor example, we hired a contractor to do some work on our house, and the team leader would constantly tug on his junk or pinch the head of his dick. This would happen several times during a short conversation. After 2 weeks of this, I desperately wanted to ask him if he needed the bathroom or a dose of penicillin. My husband just chuckled when I mentioned it and said that since we live in the South, he likely had tacky balls. \n\nWhatever was happening in his pants, it was distracting while trying to hold eye contact and a conversation with the man.",
   "created_utc": 1695855293,
   "score": 9,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hsa2i",
   "message": "On occasion I've noticed, but I'm not usually staring at their junk.",
   "created_utc": 1695851997,
   "score": 3,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hyyrc",
   "message": "Yes, I notice. Some guys aren’t subtle about it at all. But I don’t care. Balls seem pretty annoying to deal with, so if you gotta adjust them, adjust them.",
   "created_utc": 1695854634,
   "score": 3,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2i2xc1",
   "message": "It doesn't bother me if it's subtle or even obvious as long as the guy doesn't make it a big thing.",
   "created_utc": 1695856281,
   "score": 3,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2iayhp",
   "message": "I notice, but they probably also notice me fixing my boobs in my bra. It is what it is I think. Just gotta make the parts comfy!",
   "created_utc": 1695859646,
   "score": 3,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hxvsu",
   "message": "who the hell would have an opinion on this lmao",
   "created_utc": 1695854194,
   "score": 4,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hu3y5",
   "message": "Yes. Depends on how they do it,where we are ect",
   "created_utc": 1695852697,
   "score": 2,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2ib877",
   "message": "Yeah, sometimes. It depends on what I think of a guy. If I’m not interested in him, it just immediately leaves my mind. Idc. If I’m interested in the guy… different story.",
   "created_utc": 1695859755,
   "score": 2,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2id9oy",
   "message": "Yes, we do.\n\nNow the game is to explain my 2 younger boys how to do it \"discreetly\" like Daddy and not looking like some sort of baboons doing a squat while jiggling the bells.",
   "created_utc": 1695860605,
   "score": 2,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2in0dv",
   "message": "I just hope this thread doesn't insinuate that we do it because of women lol. Its fairly easy for our buddy to get uncomfortable down there and more often than not menswear offers limited space. There's nothing more frustrating than sudden grip on your Pepe because your pants don't support movement. The fact that men chose to try to conceal having to adjust thier manhood regardless of how pitiful thier attempt at concealing the motion is indicates that the man in question has good manners unlike some trucker dude who stares you ded in the eyes as he nonchalantly swings his hand into his trunks and grips it like changing speed on the gear shift",
   "created_utc": 1695864606,
   "score": 2,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2inxx1",
   "message": "Anyone do the leg shake?",
   "created_utc": 1695864993,
   "score": 1,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2ivdld",
   "message": "Yes, I notice. My thoughts on it are effectively none.\n\nIt's like somebody pulling down a shirt after its ridden up. Pulling up a sock after crumpling on their heel. Shifting a bra strap rubbing on a shoulder. I notice it because you moved, I recognise what it is. And then I don't think about it anymore, because it's just adjusting for your comfort and doesn't matter.",
   "created_utc": 1695868129,
   "score": 1,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hrp7k",
   "message": "You may think you guys are being subtle but it doesn't go unnoticed.  I'm cool with it unless they start adjusting constantly.",
   "created_utc": 1695851779,
   "score": 4,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hu09z",
   "message": "Questions like these are why I come to this sub lol.",
   "created_utc": 1695852657,
   "score": 2,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2hu53v",
   "message": "Most of ya'll are hella obvious, whether it's walking or stretching unnaturally or trying to be sly when sitting down etc. BUT most women definitely do not care. Tits are fussed with just as much as balls are, gotta do what ya gotta do lol",
   "created_utc": 1695852710,
   "score": 4,
   "submission_id": "16twrnr"
  },
  {
   "comment_id": "k2io6z5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16twrnr"
  }
 ]
}