{
 "submission_id": "16u6b19",
 "title": "What profession always acts like they have the hardest job on earth (but it actually isn’t all that bad)?",
 "selftext": "",
 "created_utc": 1695875246,
 "permalink": "/r/AskReddit/comments/16u6b19/what_profession_always_acts_like_they_have_the/",
 "score": 117,
 "url": "https://www.reddit.com/r/AskReddit/comments/16u6b19/what_profession_always_acts_like_they_have_the/",
 "comments": [
  {
   "comment_id": "k2lairl",
   "message": "For many jobs, the most difficult part is just getting through a day because it's incredibly mundane or tedious, not actually difficult.",
   "created_utc": 1695916048,
   "score": 221,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kde2e",
   "message": "[deleted]",
   "created_utc": 1695902658,
   "score": 64,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2jiqrd",
   "message": "My family acts like my job is difficult (engineering leadership) - constantly in meetings where I'm \"arguing with people\" (my wife's words).  \n\nI've been a software engineer for the last \\~20 years, and now most of my job is soft skills - mostly focusing on concepts and mentoring rather than actually doing the grunt work.  I love it...this is by far the cushiest job I've ever had.  \n\nThey're all crazy.",
   "created_utc": 1695880855,
   "score": 59,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2jqaym",
   "message": "A shitload of enlisted military jobs are very basic and easy.\n\nMy dad's a disabled vet and as a result I help him with some support groups, a lot of guys hate the hero worship around it and sometimes they can get really messed up from the constant recognition for doing a mundane job. \n\n\"Thanks for keeping the country safe and America free!\" \"My dude, I am a mechanic and never saw the front lines\".\n\nObviously, it's not a catch-all because a) some enlisted jobs are also very strenuous and b) a bad day at war is an incredibly bad, life-altering day.",
   "created_utc": 1695886448,
   "score": 223,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kafkg",
   "message": "Real estate agent",
   "created_utc": 1695901118,
   "score": 160,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2k9vi0",
   "message": "Sales. We are a big bunch of whiny babies a lot of the times.  I think it’s because of the extreme highs and lows we go through",
   "created_utc": 1695900807,
   "score": 251,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2l2wkg",
   "message": "I fully believe that the people you work for/with are more responsible for how hard your job is.  The hardest work I've done has always been dealing with garbage sacks of people.. not the physical/mental toll of the task at hand.",
   "created_utc": 1695913297,
   "score": 79,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2l6y91",
   "message": "Military spouses",
   "created_utc": 1695914773,
   "score": 206,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kwb90",
   "message": "There are a lot of people saying “I did so and so job and it was super easy“ y’all got a remember that every job is easy to suck at",
   "created_utc": 1695910863,
   "score": 16,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2jcrdq",
   "message": "“It’s so tough being a councilor in a small US city keeping the country’s lights on.”",
   "created_utc": 1695877016,
   "score": 234,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2lfl90",
   "message": "Real estate agents because they take all of the credit for a sale but can't answer basic fucking questions about a house like what year it was built.",
   "created_utc": 1695917851,
   "score": 145,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kwnnw",
   "message": "Pornstar, they're ALWAYS moaning",
   "created_utc": 1695910993,
   "score": 54,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kw67f",
   "message": "Welders. Watch ANY welding video on a social media platform and you see a huge pissing match in the comments about how shit the weld was and how they’ve been welding for 30 years and make 200k a year. \n\nMeanwhile most welders got their welding certs from a 6 month school and essentially run a hot glue gun all day.",
   "created_utc": 1695910810,
   "score": 2,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kf1p6",
   "message": "Not the hardest, but the most self important people Ive met are truckers.\n\n\"The whole country would shut down if we decided not to work\"\n\nYeah that's why it's a job.  The whole country would shut down if gas station employees decided not to do their job too.  Or you know, almost all other jobs.",
   "created_utc": 1695903480,
   "score": 177,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2jefeu",
   "message": "Senators and Representatives.",
   "created_utc": 1695878037,
   "score": 103,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2ja73k",
   "message": "Dependas",
   "created_utc": 1695875499,
   "score": 197,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kpq98",
   "message": "I briefly worked as a substitute teacher, and I was told on more than one occasion that I had one of the toughest jobs in the world.\n\nThat was news to me, because the vast majority of the time, all I had to do that follow the teachers' detailed instructions. The students themselves were almost always perfectly fine. Even in the more underserved districts, students were fine with you so long as you didn't treat them all like little criminals.\n\nThe toughest part of it was just trying to navigate the schools if the office failed to give me a map of the school.",
   "created_utc": 1695908259,
   "score": 223,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2lfir7",
   "message": "As an ex-hairdresser, hairdressers. The whole industry is a constant competition for who can be the most burnt out, who skips lunch the most, who never ever ever ever ever sits down even for one second, who never gets a thank you for all they do, etc etc. \n\nI did the job. It’s really not as difficult as they make it out to be and if it is, it’s entirely self-imposed.",
   "created_utc": 1695917827,
   "score": 215,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2nlkgh",
   "message": "Military spouses.  God I can’t stand Dependas.",
   "created_utc": 1695946831,
   "score": 29,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2l4hhu",
   "message": "HR\n\nPeople in HR love to tell you how they not only work in HE but that it is also so hard",
   "created_utc": 1695913878,
   "score": 63,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2kr1yb",
   "message": "My boss.",
   "created_utc": 1695908801,
   "score": 211,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2lqsve",
   "message": "Pretty much any corporate job when you reach the top 10% of the company.  If life has taught me one thing it's that the higher you go on the corporate ladder, the more you get paid and less you have to work.  That is not always the case, but I have found it to be \"mostly\" true.",
   "created_utc": 1695921810,
   "score": 158,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2jm53i",
   "message": "Influencers",
   "created_utc": 1695883294,
   "score": 51,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2ko8xw",
   "message": "Every fucking marketing person I’ve ever met",
   "created_utc": 1695907650,
   "score": 18,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2lvmy5",
   "message": "Love bartenders but they act like coal miners.",
   "created_utc": 1695923527,
   "score": 148,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2k9mt4",
   "message": "Tax accountants… source: am I who has worked for some very difficult people. The deadlines make us think our jobs are so important… so much more important than anything else in the world. \n\nI know people’s money is important but missing one deadline (usually at the client’s fault because they didn’t send their info time) will not put you in tax jail. once I realized we aren’t doing brain surgery, sending people to space, teaching kids. etc. I felt a little more relaxed.\n\nI think accountants will only realize this when they see medical professionals doing their job (recently had a family friend hospitalized and I was truly amazed at how these people do their job… it cannot be easy) and I could never teach anyways.",
   "created_utc": 1695900671,
   "score": 113,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2jmmki",
   "message": "landlord",
   "created_utc": 1695883656,
   "score": 60,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2k8mlf",
   "message": "The only people I've ever heard actually say their job is the hardest is stay at home moms.\n\nI am a stay at home dad. I worked in production warehouses for 20 years, and staying at home with my beautiful son is the best gig I've ever had.\n\nBeing a stay at home parent definitely has challenges, but dealing with an actual child is much easier than dealing with adults who act like children.\n\nEdit: I am in no way saying it's easy. It definitely is not, but it is the most rewarding, and that makes it way more worthwhile than working for some CEO that shits on a golden toilet. (I apologize for my crassness.)\n\nEdit 2: I do not work in the warehouse anymore, but I am earning a degree online.\n\nEdit 3: Someone said it perfectly. It is a privilege. \nNow that I think about it, a profession is something you get paid for. So SAHP is not a profession and, therefore, does not belong in this thread.  \n\nThis is my first post with over 1k upvotes, so that's cool... 😆☺️\n\nObviously, my situation is different from others. Nothing in this life is ever black or white. Everything is a shade of gray. I'm just saying STHM's are the only people I have ever heard say that their job is the hardest. \nI have heard people say that POTUS is the hardest job. I tend to believe that.\n\nLast Edit: In the days before the Civil Rights Movement, I would agree. It was definitely the hardest job in the world. I never have to worry about my husband coming home and kicking my ass cause dinner wasn't cooked to his specifications. \n\nThat's why I am a liberal. When I hear someone say make America Great Again it enrages me. When was it great? When men could beat their wives with no repercussions. IDK, that's just me.",
   "created_utc": 1695900099,
   "score": 18,
   "submission_id": "16u6b19"
  },
  {
   "comment_id": "k2pagk2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16u6b19"
  }
 ]
}