{
 "submission_id": "16uou1k",
 "title": "What is the grossest thing you’ve ever done?",
 "selftext": "",
 "created_utc": 1695928709,
 "permalink": "/r/AskReddit/comments/16uou1k/what_is_the_grossest_thing_youve_ever_done/",
 "score": 196,
 "url": "https://www.reddit.com/r/AskReddit/comments/16uou1k/what_is_the_grossest_thing_youve_ever_done/",
 "comments": [
  {
   "comment_id": "k2ny5l4",
   "message": "Piece by piece, I pulled out the rotting corpse of a calf that had died near the end of a cow’s pregnancy. It had been rotting inside her. I knew something was off right away but things went from bad to worse when I put chains on the two front legs to pull and both legs detached from the corpse and I fell on my ass with the legs landing on me. Next step was sticking my arm up “there” and pulling the pieces out.\n\nAnd the smell….. was the worst smell I’ve ever experienced. And being on a farm, you smell some bad stuff. But nothing approaches this.",
   "created_utc": 1695951888,
   "score": 4,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2n8vga",
   "message": "Shat myself pretty early into my work day and proceeded to complete the full 12 or 13 hours as is. To paint the picture a little better; I was a garbage man and we had “weight incentives” implemented because there was a shortage of employees and material was being left on the streets for days. This meant that if I hit a target at the end of each day I’d get a pretty sizeable bonus. In order to hit the metrics it pretty much meant you had to run like snot all day with no breaks. I wanted that bank and I figured since I have limited contact with the public and I would naturally already smell, it was a no brainer. It all worked out but my girlfriend made me throw out my clothes and sleep on the couch. Small price to pay when you’re saving for a house but definitely not good for the psyche.",
   "created_utc": 1695941509,
   "score": 217,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2n7jsi",
   "message": "Cleaned-up a suicide scene, 30-30 gunshot thru the mouth.",
   "created_utc": 1695940958,
   "score": 230,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nq7j6",
   "message": "I was a funeral home apprentice in Washington during my college years. One time, we had this really obese woman come through our establishment. For those of you that don’t normally cremate someone, there are vats beneath the retort (oven) that catches body fat and other liquids. Well basically I neglected to empty the vat and started cremating the woman. The vats overflowed leaving human body fat all over the floor. I had to clean it up.",
   "created_utc": 1695948718,
   "score": 102,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2od320",
   "message": "Honestly I can’t even believe I’m exposing this but I was a kid so keep that in mind. I’ve literally never told anyone. \n\nWhen I was really young, like 5-6, I had this female dog, and I would just spend days crawling around with her pretending to be a dog as well, ya know, a kid being a kid. Well, she had puppies and they were feeding from her and I straight up sucked on her nipple along with them. Obviously being a kid I wasn’t thinking about how utterly disgusting that was, I was just trying to be a dog too. When I gained consciousness a few years later and had remembered what I’d done, I was disgusted and still am to this day.",
   "created_utc": 1695958340,
   "score": 223,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nzg87",
   "message": "I sucked a dead guys dick. Well, he may have been alive for the first part. He OD’d while I was sucking him off and was a good 3 minutes before I realized. I just thought he was really fucked up, not dead",
   "created_utc": 1695952410,
   "score": 221,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2oa4vj",
   "message": "When I was 9, I was too lazy to leave my bedroom and go to the toilet, so I shit in a plastic bag and hid in at the back of my wardrobe so my mum wouldn’t find it. \n\nMy mum found it a few months later",
   "created_utc": 1695956947,
   "score": 249,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nr1g4",
   "message": "It was unintentional but it was still rank. I was going down on this girl, and I'm pretty good at it so I was confused as to why I wasn't getting the usual reaction. \n\nPulled back to make sure I was hitting the right spot. Ahh, I see, there's the problem. I wasn't licking her clit. I was tonguing a genital wart just below her clit. \n\nBoke",
   "created_utc": 1695949051,
   "score": 241,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nzlqc",
   "message": "Ate too much at a Chinese buffet, something didn't sit right, volcano shat all over my gfs bathroom. It hit the floor the shower the toilet my shorts, everything. It was my second time meeting her father... and I turned his bathroom into a truck stop outhouse.",
   "created_utc": 1695952472,
   "score": 215,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nx1gp",
   "message": "I’ve had to do a lot of gross things and this isn’t the worst, but it’s pretty bad. \n\nI worked in an animal shelter and part of my job was sending in animals that have to be checked for rabies. You only send the head. The state prefers that you also wash the head and if you are feeling really generous douse it with flea and tick spray. \n\nSo this uppity rich kid decides to start feeding the raccoons that are hanging out by his pool. This eventually leads to him trying to cuddle with one of them, which then leads to him being bitten. After that, I believe, he kicked it into the pool and then somehow got it out and bashed it to death. Note: I do not like this guy and have zero sympathy for him. \n\nAfter he murders the raccoon who would not reciprocate his love, he throws it away. Then his bite gets infected and the dr tells him that if the raccoon can’t be tested then he’ll have to have the shots. The deceased raccoon has been sitting in a garbage bag for 5 days in over 100 degree temps. \n\nSo we dig the raccoon out that is at the bottom of a trash bag filled with rotted food and house trash. It’s pretty much decomposed, but God the stench. And the maggots. We take it back to the shelter and decide better to remove it’s head outside so we aren’t trapped inside with him and all his little friends. My partner and I are taking turns dry heaving and holding the water hose. We were trying to wash off as many maggots as possible. We could tell that the raccoon wasn’t going to be testable. I could see what was left of its brain through its eye sockets, but we are required to at least send it.\n\nMy partner is like no way, I’m not doing this, and finally I cave. I tell her to just keep rinsing off the maggots and I’ll remove the head. So I hold my breath, she stops the rinsing. I take my scalpel and run up to it and make a few cuts, then run away, dry heave, and she resumes rinsing. The skin is also literally washing away as she rinses. Just falling off. We repeat this about ten times until it’s done. She looks at me and tells me I have the biggest balls ever. I look at her like I’m pretty sure you are aware that I’m a woman, but thanks for the compliment I guess. \n\nThe raccoon was not able to be tested and he had to get the shots. I hope they hurt and he got a nasty scar of his massive cruelty and stupidity. I can still smell that dead raccoon.",
   "created_utc": 1695951447,
   "score": 203,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nf6xd",
   "message": "Was riding my bike and a bug flew into my eye and I reactively shut it closed for a few seconds while it squirmed to be free in my eyelid. I now own many pairs of cycling glasses.",
   "created_utc": 1695944168,
   "score": 142,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ndjzu",
   "message": "I've embalmed and cremated some pretty disgusting bodies.  Grabbing someone's leg and having the tissue slide off...that's up there.  I've pulled some pretty rancid bodies out of the lake.  Autopsies are pretty gross, really.  \n\nAnd OP's mom.",
   "created_utc": 1695943477,
   "score": 197,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nfo0c",
   "message": "While I was drowning in alcoholism, I once vomited on myself and my bed and went back to sleep.",
   "created_utc": 1695944368,
   "score": 13,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2o4ebg",
   "message": "Chewed gum that had been spit out on the ground.\n\nWhen I was like 5 y/o, I wasn't allowed to chew gum. One day, I came across some that had been spit out on the sidewalk in front of my house. I took it and rinsed it under the sink for a minute to get the visible dirt/debri off and put it in my mouth. Obviously, I was a kid and didn't think anything of it, but when I started learning about germs later on, I always cringe at this memory.\n\nI am confident this early exposure to who knows how many germs gave me a superhuman immune system. I never get sick.",
   "created_utc": 1695954462,
   "score": 157,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ndkrj",
   "message": "Either helping hold open my wife’s emergency c-section incision. Or, being the new guy who got to jet out the sewer main clog just below the junction…glad they had a safety rope on me to haul me up from the pit when it filled up.",
   "created_utc": 1695943487,
   "score": 59,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ob3i8",
   "message": "When I was 9, I had a sleepover with a girl from school. I shit in her shower and stomped it down the drain drain because I had too much anxiety to shit in the toilet and didn’t want her to hear me. I didn’t realise until it was too late that hot water and shit are not a very nice combination and the entire house was filled with fumes of steaming faeces. I think I blocked the rest of that night out from trauma because I don’t remember a thing beyond that.",
   "created_utc": 1695957389,
   "score": 77,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ndzg5",
   "message": "Swallowed a flying cockroach when I lived in Australia.",
   "created_utc": 1695943659,
   "score": 131,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nk9k0",
   "message": "When I was still drinking I blacked out nightly and I would sleep walk a lot. I would sleep walk and piss weird places a lot. One time I woke up super hungover and took a big swig from a glass on my bedside table that I thought was water. It was not.",
   "created_utc": 1695946292,
   "score": 79,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2n5eyo",
   "message": "Scooped out my own vomit out of the sink cause it didn’t want to go down the drain. I was drunk as a skunk and panicked. 💀💀💀",
   "created_utc": 1695940089,
   "score": 133,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2obw2f",
   "message": "I once ate Arby’s at 11:30pm in the middle of nowhere,  New Mexico. I get back on the road, and about 45 minutes of NO gas stations and squirming all over my seat - I come to the horrifying conclusion: I’m going to shit my pants. I pull off on the next exit and absolutely ass cannon the shoulder of the road. Praise god - no one was around at all, but that felt nasty. I found an old shop rag to wipe my ass in my trunk, and away I went. Horrifying.",
   "created_utc": 1695957763,
   "score": 195,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nn4j5",
   "message": "I had an episode of drug induced psychosis after an overdose in 2018. I was 16 at the time, and the period lasted around 3 ish weeks.\n\nI did a bunch of unhinged shit, but the grossest and worst was drinking my own blood. I cut my forearm and sucked the shit right out of myself. I was under the belief that people were always watching me and it was the only thing I could do to make them stop staring.\n\nIncredibly thankful for medication.",
   "created_utc": 1695947465,
   "score": 109,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nbdtf",
   "message": "When I was a kid I once took a big swig of cooking oil because I thought it was orange juice. 🤢",
   "created_utc": 1695942560,
   "score": 223,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ntrvk",
   "message": "When I was little I pooped in a McDonald’s paper bag and gave it to my brother. I said “here we brought you home an extra parfait!” And he was so happy and then opened the bag to discover my fat turd",
   "created_utc": 1695950138,
   "score": 222,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nc4jr",
   "message": "I took a shit in a junkyard through an open sunroof and wiped my ass with my sock.  Unfortunately, my stupid gotta shit brain had set my tool box on the front seat of the car…which I shit on.",
   "created_utc": 1695942876,
   "score": 72,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ns8ru",
   "message": "Stepped in warm cat vomit in the middle of the night",
   "created_utc": 1695949525,
   "score": 73,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2o3dyt",
   "message": "My first year doing autopsies I was working on a case with multiple bullets. We were really struggling to find a couple and so the body had to be taken off the metal autopsy table and put on the X-ray table for some more pictures. I waited outside the X-ray room while the doc took more images. I was bored, tired and alone so started to draw little doodles...in the dudes blood that was left on the autopsy table. It was after I wrote my name in excessively loopy cursive that I realized how fucked up this action was. So I wiped it away like it was an etch-a-sketch and never mentioned it to anyone.",
   "created_utc": 1695954033,
   "score": 149,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nmy68",
   "message": "When I was a raging junkie I used water from a public toilet to shoot up. Not my best moment.",
   "created_utc": 1695947394,
   "score": 204,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nkher",
   "message": "Years ago, whenever the green Froot Loop was introduced like it was a revolutionary thing, 5 year old me was intrigued. But my parents only ever bought Honey Nut Cheerios.\n\nWell the neighboring family, we shared a parking lot with them and their kids played outside a lot. Well I went outside one morning and noticed a GREEN FROOT LOOP on the dirt parking lot that had been there at least since the day before. It was soggy, it was dirty. I ate it and even did the \"That's pretty good!\" face.",
   "created_utc": 1695946379,
   "score": 249,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2on5h7",
   "message": "Was RN at hospital. Came on shift and had to turn patient. She was frail, old, obese, hadn’t been turned in days and was sitting in an aging pile of shit. I insisted on turning and cleaning her. While attempting to turn her my gloved hand sunk 3-4 inches through her semitransparent, gelatinous skin, allowing her adipose tissue, the color of a pale orange creamsicle, to spill out , warm and creamy, across my hairy forearm.\n\n The patient, reacting to the noise I made that sounded like a cow being smothered, arched her head back towards me and asked “what was that?” I was fucking floored, and nauseous. I froze, staring at the jiggling gob, struggled to reply and stammered to the nurse across from me something along the lines of “stop, my hand is inside her, stop, lay her back.” I’ll never forget the confusion of the resident as I discreetly attempted to explain  how I put my hand into her ass cheek and felt my thumb touch her pelvis. Then I showed him the small pile of fat on the bed and the creamy remains still tangled in the hairs on my forearm. \n\nI’ve done a lot of gross things, but putting my hand inside someones ass cheek and having their fat spill out on my arm is by far at #1.",
   "created_utc": 1695963894,
   "score": 134,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2obdcb",
   "message": "Had to perform cpr on a dead homeless man COVERED in poop head to toe.\n\nEdit: Paramedic",
   "created_utc": 1695957518,
   "score": 63,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2mn7f2",
   "message": "I was a med student and had to do a manual fecal disimpaction. I had to reach into another man's rectum to scoop out his hardened poop after a baggy of fentanyl popped in his colon.",
   "created_utc": 1695933295,
   "score": 167,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2oe6rb",
   "message": "When I was young, like 5-6, my sister and I would spread our cheeks after taking a dump so we could inspect the other’s butthole to see if we had to wipe lmao",
   "created_utc": 1695958885,
   "score": 55,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ok6yt",
   "message": "The grossest thing I've done is read every single comment on this thread 🤢",
   "created_utc": 1695962115,
   "score": 160,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nnj5n",
   "message": "Not me, but a classmate. We were dissecting frogs in biology. Someone dared him to eat the gallbladder for a nickel. He did it.",
   "created_utc": 1695947624,
   "score": 151,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2n7eiq",
   "message": "I was working outside with 2 other guys, moving some material that had been sitting in a parking lot for a few months, covered in tarps.  As we got to the center of the pile, we uncovered a yellow jacket nest, and the attention of a few annoyed bees.  Well I took my hat off and swatted at the bees, only to jettison what I can only describe as “rain” from my hat, right at my coworkers face.\nLiterally hit him with a corona of nasty hat sweat right to his dome, in his mouth, his eyes.  I felt so bad but laughed so hard as he ran to the side to start dry heaving",
   "created_utc": 1695940896,
   "score": 231,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2oar01",
   "message": "Was in the gym with 2 classmates/ buddies in eighth grade. One guy has his finger in a weight machine trying to unstick a stuck pin in a weight plate. Pulled the pin out, but his finger got caught when several plates crashed down after he pulled the pin out. We all ran upstairs hysterical and our teachers called an ambulance. I had to go back downstairs alone to the gym to retrieve his index fingertip, complete with intact nail, from the machine, and bring it upstairs so paramedics could bring it to the hospital and reattach it.\n\nI did not eat lunch that day.",
   "created_utc": 1695957228,
   "score": 50,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nwtr5",
   "message": "Ex gf sat on my face, I was quite enjoying it but couldn't get over how strongly she smelled. She lifts off my face for a bit and I notice she has a mixture of period blood and shit particles between her ass cheeks. I didn't wanna embarrass her so I just pulled her panties back on, finished myself off, and never mentioned it to her again.",
   "created_utc": 1695951361,
   "score": 207,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2oa2wo",
   "message": "When I was a really young kid I ate a dog turd (like 20 months young) \n\n I drank piss from my (at the time) boyfriend directly from his dick. \n\n I'm a mortician so, I've seen and done some stuff. Eye removal. Seen way to many deglovings including a face, penis, and entire back. Water logged corpses, house fire corpses, and goopy bones from lonely summer deaths.",
   "created_utc": 1695956922,
   "score": 89,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2o4jac",
   "message": "[deleted]",
   "created_utc": 1695954521,
   "score": 187,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nuovx",
   "message": "Had to shit into a bag while on a job site because the homeowners were gone and the nearest gas station was 6 miles away.\n\nThe worst part is I had an upset stomach so there was more liquid than solid crap. Had to bag it like 5 times, spray the bags with something to kill off the scent and then put it in a bin in the back of the work truck.",
   "created_utc": 1695950509,
   "score": 42,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ofe96",
   "message": "Had to \"pop\" a ridiculously bloated cow carcass about 10yrs ago. The cow was roughly twice its normal size. \n\nDuring college, I was working on an island beach as a naturalist/ranger and a dead cow washed up on the swimming beach. To remove the cow, my boss and I beached our boat, tied a rope around the legs, and towed the cow approximately 3 miles out into the ocean hoping the tides would carry the cow elsewhere. We untied the cow and went back to work. Mission accomplished!\n\nAbout four hours later a beach goer ran up to our shack ranting about a cow that washed up on the beach... Again. The dead cow washed up within 15ft of the original spot. We repeated the process to remove the cow from the beach, but instead of simply releasing the cow again, we decided the best course of action was to lance the cow and release the pressure so the carcass didn't act as a buoy and keep floating along the beach. \n\nWe intended to draw straws to decide who was the lucky \"stabber\", but I ended up doing it without protest because I thought it would be interesting. I took aim and plunged the large knife towards the cow with all my might. I hit my mark (I'd be inept if i missed such a large target) but the knife just bounced off the hide. I thought to my self, \"no fucking way\".\n\nI readied myself for a second attempt, but with a different strategy. This time I ended up leaning overboard and using a significant portion of my body weight to attempt to pierce the thick hide. Fortunately (more like unfortunately) I was successful. The cow ruptured and exploded a deluge of hot gases along with the MOST disgusting smell I have ever smelled. The smell permeated the air worse than one thousand farts and sprayed goo and aerosolized smell particles everywhere. We started dry heaving, then my boss threw up a little. It was torture. Needless to say we got the hell out of there ASAP and blew through the no wake zones on our way back to the dock so we could dispose of our clothes and shower. Was it a unique experience? Hell yeah. Would I ever do it again? Hell no.",
   "created_utc": 1695959511,
   "score": 42,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nv04z",
   "message": "I was gonna say sex in the back of my car but that's peanuts to the shit I'm scrolling past",
   "created_utc": 1695950632,
   "score": 77,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nohfe",
   "message": "I was expecting someone to say ate a dirty ass",
   "created_utc": 1695948014,
   "score": 144,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2noma7",
   "message": "Ate ass after she had a long day and a bowl movement and no shower. Got a pretty bad throat infection and then went down on her a week later and she got the infection in her vagina. The circle of life some say",
   "created_utc": 1695948069,
   "score": 192,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2o0prb",
   "message": "Walked in on my grandparents 69'ing.",
   "created_utc": 1695952925,
   "score": 77,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2oddq1",
   "message": "\"It takes a man to swim in the red waters, but a hero to drink from it.\"\n\nI am a hero.",
   "created_utc": 1695958483,
   "score": 38,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2npg5b",
   "message": "Me and my friends used to play a game where we would spit in each other's mouths and pass it around so it got bigger and bigger until someone was too grossed out to keep going and they had to swallow it.",
   "created_utc": 1695948410,
   "score": 52,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2o83kn",
   "message": "TLDR identifying our own ass bacteria in college biology\n\nProbably the enterobacteria unit for Intro to Microbiology. I took it at a school that fed an RN program, so 99% of my classmates were wannabe nurses. As such, the professors wanted students to have an experience that was closer to real world conditions than the very tame, predictable strains of bacteria that were purchased by the school for other lab assignments. This meant that every Microbio student had to make a stop at the lab's media checkout desk, head down the hall to the restrooms, collect their samples, and then make the most awkward walk of shame in their college career, walking back to the lab with not one but two cotton swabs they'd just shoved and swirled where the sun don't shine, check in at the desk AGAIN to get your petri dishes, and then go sit with everyone else who was wiping skidmarks onto tiny plates medical jello for 20% of their class grade. We then had the pleasure of storing our butt flora in the same incubators as we spent the next two weeks to run tests to identify what was eating what we had eaten. \n\nOur professor was 100% correct about how tame all our other specimens purchased by the school had been compared to the real thing. Those were the juiciest petri dishes of the entire semester (do NOT spill the condensate!!). Also, the various tests used to identify bacteria turn them all sorts of wild colors like metallic purple and green. That incubator was a real 🤢 feast for all the senses. \n\nThe best part: my professor bringing in a 3 foot long dowel rod q-tip as a joke, then silencing the class's groans with a stern lecture that if they thought that was too gross, they needed to seriously rethink their career path asap.\n\nThe worst part: I had to miss school, which meant that my personal sample I was working on became old to continue testing. That meant I had to beg a random classmate to let me take a colony from his butt culture (would it have been better if I'd said no homo?), and spend the next week growing and identifying his ass juice in order to complete the lab.",
   "created_utc": 1695956058,
   "score": 67,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2ncgod",
   "message": "I nibbled on a piece of my own shit when I was very young. It tasted exactly like you think it would. Never tried it again ha!",
   "created_utc": 1695943017,
   "score": 176,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2mxd51",
   "message": "tasted my cum, it was awful. i guess this should be a wake up call for me to drink less soda",
   "created_utc": 1695936976,
   "score": 69,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2o6wza",
   "message": "I think it was New Year’s Eve 2003 and my friend wouldn’t pull over on the way home because he thought we were being followed by cops and we were all underage. I really had to puke and couldn’t hold it anymore so I puked inside of my sweatshirt and coat and wore it allllll the way home. It was warm.",
   "created_utc": 1695955552,
   "score": 26,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nd308",
   "message": "Multiplied 12 x 12.",
   "created_utc": 1695943280,
   "score": 152,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nztxn",
   "message": "Worked for a tow company. Had a fatal late at night. Guy had a red Saab. Fell asleep (presumably) went off the road at an exit. Car caught air. Landed at maybe 20* bumper down right at a road sign. It was the kind of post that was not round or square in shape. The post was \"_n_\" shaped. When the bumper hit the bottom of the sign, the sign bent twords the windshield. He took the speed limit sign to the upper teeth, though his nasal cavity, out the bact top part of the head,the long way. Decapitated. \n\nI showed up, the whole place stank of death. Started clean up. The last piece I picked up was the snapped road sign. The channel in the sign was like a tough of brain matter. I got startled and dropped it. I will never forget the sound of his brains splattering on the ground. I got spattered with his brains.\n\nI got back to the chop and unloaded the car, and tarped it. I walked back into the shop to do some paperwork. I hear a faint click as I walk on the concrete floor. I dragged my boot across, and it is just a spine chilling sound. Gave me chills. I lift my boot and look with my flash light. It was a fragment of one of his teeth. \n\nPoor bastard. He was a central American immigrant. He was working 2 jobs to put his daughters thru collage.\n\nEDIT: Spelling",
   "created_utc": 1695952563,
   "score": 22,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2nogix",
   "message": "One summer job in high school I worked at a pet food processing plant",
   "created_utc": 1695948003,
   "score": 20,
   "submission_id": "16uou1k"
  },
  {
   "comment_id": "k2opzxd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16uou1k"
  }
 ]
}