{
 "submission_id": "16up1g9",
 "title": "When was you first kiss?",
 "selftext": "",
 "created_utc": 1695929200,
 "permalink": "/r/AskReddit/comments/16up1g9/when_was_you_first_kiss/",
 "score": 187,
 "url": "https://www.reddit.com/r/AskReddit/comments/16up1g9/when_was_you_first_kiss/",
 "comments": [
  {
   "comment_id": "k2mvaoq",
   "message": "I was 12 at summer camp in Florida. Very cheerful and mischievous red headed girl in my age group. Said I was too cute to have never been kissed and she laughed when my face turned red after she gave me a nice little kiss on the lips. Also the reason I apparently have a crushing weakness for red heads now. THANKS SARAH.",
   "created_utc": 1695936205,
   "score": 219,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mws3m",
   "message": "I was 18 and just moved into the dorms for my first hear of college.  Turned out I got my first kiss, BJ and sex all at once.",
   "created_utc": 1695936756,
   "score": 63,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2n10ss",
   "message": "Let’s just say late teen years. It was weird…like an awkward tennis match. \n\nThe guy kissed me briefly then quickly pulled back to gage my reaction.\n\nI saw stars so I grabbed him, pressed myself up against him, and kissed him far more aggressively.\n\nHe was so startled he pulled back and just stared at me a second (which seemed to last an eternity in my mind because I was sure I had somehow misread the situation).\n\nThen he grabbed me really aggressively, pushed me against the wall and we started seriously making out.",
   "created_utc": 1695938356,
   "score": 233,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mzy2a",
   "message": "I’ll let you know, 21 and honestly not feeling too rushed",
   "created_utc": 1695937945,
   "score": 209,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mfp6i",
   "message": "What is a kiss",
   "created_utc": 1695930641,
   "score": 166,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mgtp5",
   "message": "10th grade. Met this girl online. One Saturday I made my dad drive me 30 minutes to her house. (she lived in another town).  My dad is like, \"You have 30 minutes then I'm going to honk and you have to come back outside\".\n\nAs soon as I walked in she was uglier than her photos but not by much. Shes like \" wana make out\".  We proceed to makeout for 30 minutes until my dad honked and then I left. It was kinda awesome.",
   "created_utc": 1695931035,
   "score": 108,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2miq28",
   "message": "Two weeks ago, I'm 24",
   "created_utc": 1695931711,
   "score": 237,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mvaib",
   "message": "Sophomore year of college with my first gf. I was 20, she was 19, and we kissed lying in a hammock at like 1am.",
   "created_utc": 1695936203,
   "score": 173,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mw4j9",
   "message": "14, the guy turned out to be gay... weird stuff.",
   "created_utc": 1695936512,
   "score": 170,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2nfm32",
   "message": "In a closet when I was 10. No more questions.",
   "created_utc": 1695944346,
   "score": 63,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mecqc",
   "message": "12, she was 13. Cute goth girl.",
   "created_utc": 1695930167,
   "score": 123,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mhihy",
   "message": "Senior year with my 1st gf. She dropped me off at my house after a long afternoon of hanging out and holding hands (hey, we were young, we took it slow). We both felt it was coming and saw it in each other's eyes. \n\nI went in, and so did she... we bonked heads.\n\nThe 2nd try was a success. Fireworks! We stayed out there for a while before I went back inside my house. Definitely got better by the end of the night.\n\nStill remember the night air, her truck, her perfume, and the Tim McGraw song \"Something Like That\" which coincidentally describes how it feels to remember this.",
   "created_utc": 1695931279,
   "score": 238,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mjzk3",
   "message": "I was probably 14. Travelled to see a long distance girlfriend I had met online in a video game.\n\nShe was real, and she was exactly what I was hoping to see when I arrived. We spent a few days together. On that first day we spent a lot of time walking around outside just chatting, and at some point we made it back to her house as the sun was going down. There was a thunderstorm in the distance, it was very warm outside, and the sky had changed to it's dark blue hue now that the sun had gone below the horizon. The stars in the sky were just starting to become visible.\n\nShe pulled me to the side of the house before we went in and looked at me in the eyes, I said \"Whats up?\" and she said \"I'm waiting,\" I said \"For what?\" and she replied \"For you to kiss me,\" so I just went for it. The first one was a small peck out of nervousness, but she smiled and pulled me back in and we made out.\n\nWe then went inside, had some dinner, and spent the night on the couch after her parents went to bed. We watched TV, and during commercial breaks we would continue making out.\n\nAhh, that's a good memory.\n\nWe \"dated\" for another year, but I went to visit her a second time and she was a different person. Very withdrawn, didn't want to get close to me, acting like I was infected with something that she didn't want to catch. Turns out her parents didn't like me and had been telling her to breakup with me. So she did, right as I started my 9 hour bus trip home. That was the earliest traumatic experience with a girl I can recall. She's married now nearly 13 years later. Still friends on Steam but we don't talk",
   "created_utc": 1695932162,
   "score": 132,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mgsmr",
   "message": "Second grade, so whatever age that is 8? Looking back at it now its extremely disturbing. I had a neighbor of the same age, and she was my first kiss. The disturbing part was when we would play \"house\" she would insist we both got naked and she would lay on top of me. As a kid I didn't really think anything of it. But looking back on it as an adult, I can only think that she had to have been sexually assaulted or molested for her to be acting that out on me. This was in the late 80s so there was no internet and kids weren't really as sexually aware as they are now.",
   "created_utc": 1695931025,
   "score": 66,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mw3s3",
   "message": "3rd grade. I was in a [bf/gf](https://bf.gf) relationship with a girl. It was cool. We were close and I cared for her deeply. Unfortunately, I went to a new daycare and I stopped seeing her for that reason. This was in 1998.\n\nEdit: ok so I’m guessing nobody went to a daycare that would pick them up after school. The girl was in3rd grade as well, just in a different school.",
   "created_utc": 1695936504,
   "score": 66,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mz3f1",
   "message": "When I was 21. It wasn't how I expected a kiss to feel, but in hindsight, that's exactly how a kiss feels like",
   "created_utc": 1695937621,
   "score": 33,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mbups",
   "message": "I was 14/15, holiday, south of france, under a starry sky. It was very romantic, a girl i didnt really like but i wanted to kiss someone. Great time 10/10 would do again",
   "created_utc": 1695929285,
   "score": 89,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mxehi",
   "message": "Hasn't happened yet, and I'm 23. Cheers!",
   "created_utc": 1695936991,
   "score": 69,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mwqk1",
   "message": "34 years ago.",
   "created_utc": 1695936740,
   "score": 17,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oiyqi",
   "message": "😅In the future",
   "created_utc": 1695961421,
   "score": 19,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mc3cr",
   "message": "I can't quite remember. It would have been when my husband and I were still teenagers. Probably during a particularly frisky moment.",
   "created_utc": 1695929370,
   "score": 36,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2naabi",
   "message": "The same day I lost my virginity when I was 18.\n\nHappened to be 4/20 also",
   "created_utc": 1695942094,
   "score": 16,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mou3b",
   "message": "16yo with some random girl in my age ive never met before in a train station while waiting for the train",
   "created_utc": 1695933875,
   "score": 31,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2msib6",
   "message": "French here. We were on a beach party, in the middle of summer. She was an aquaintance of one of my close friends. First time she joined us for a party which had been planned at the last minute. Kind of \"Hey, why dont we go and party on the beach tonight with the homies ? Bring friends of yours if u wanna\". \n\nWe gathered around a fire we lit, surrounded by the sound of the ocean. Lights soon went down low, as the sun quickly set. \n\nEveyone was laughing, we drank a little but not that much. We began flirting, untill a point it became obvious for everyone that it was going to happen. \n\nWe also knew, but we relished that fleeting feeling a moment while keeping up the game : the long stares, the charming smiles and glances, the tickling and sweet moqueries. \n\nWe ended up kissing and cuddling all night long, completely ignoring our friends all around.",
   "created_utc": 1695935189,
   "score": 34,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2my9kr",
   "message": "More than a year ago which is surprising, time flies.\n\nNot with that guy anymore. He made me so insecure. Be on all occasions sure to be with who you really want to be and with someone that really appreciates your true self. Don't act for others. Be yourself, always. If not you are somehow going to get lost.",
   "created_utc": 1695937310,
   "score": 15,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2p128h",
   "message": "Bold of you to assume I've ever kissed anyone",
   "created_utc": 1695973682,
   "score": 15,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mbuhl",
   "message": "April 14, 1995.",
   "created_utc": 1695929283,
   "score": 46,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2molga",
   "message": "Spring of 2013, I didn't need to remember the exact date. I was 16, she was 17, a stunning tall redhead future model who defined my taste in women for the next few years. However, she viewed me as a rebound guy rather than something serious. We broke up a week after that. I have no hard feelings, she was the one who showed me that I'm not as hopeless as I thought back then. We kept in touch until 2017. I have eventually found the one I was looking for, and I hope so has she.",
   "created_utc": 1695933789,
   "score": 22,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mz9y2",
   "message": "My first proper or \"real\" kiss, probably around my late 15 or early 16s with my first GF, who I would have never dated if she wouldn't have asked ME to be his BF...",
   "created_utc": 1695937690,
   "score": 10,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2ok1rj",
   "message": "still waiting",
   "created_utc": 1695962033,
   "score": 9,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2osm79",
   "message": "At 30, 7 months ago. Yeah, I took my time to check that off the list.",
   "created_utc": 1695967434,
   "score": 10,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2p0r4r",
   "message": "at some point in the future",
   "created_utc": 1695973435,
   "score": 8,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mlcu6",
   "message": "January 1st, 2021. I was 17. At my first date ever. At the end of the date she kissed me. One of the best moments of my life. Was nervous even afterwards",
   "created_utc": 1695932643,
   "score": 14,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2okwd8",
   "message": "Never. 26 y/o KHHV",
   "created_utc": 1695962526,
   "score": 9,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2odd4k",
   "message": "I was 15. I remember it was in December because the guy I was dating at the time searched up a photo of mistletoe and held his phone above our heads to initiate it lmao.",
   "created_utc": 1695958476,
   "score": 6,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2omh5a",
   "message": "it was never",
   "created_utc": 1695963476,
   "score": 6,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oxnhp",
   "message": "I was 19 ; just entered in prep school for engineering degree. \n\nThe introduction in the student life with all the parties was fantastic. I met a girl from another country and it was totally obvious I was into a deep crush at the first met. \nWe spent some times together and with all the new friends doing activities as well. One night after a party we went to my room and we discussed for a long time. I finally took my chance ; approached her step by step  (it looked probably look very funny now) ;  I was soooo stressed ; and I kissed here gently after getting her implicit authorization I saw in her eyes. First time. It was amazing.",
   "created_utc": 1695971047,
   "score": 6,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mx0pd",
   "message": "I am mason",
   "created_utc": 1695936847,
   "score": 19,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2minu5",
   "message": "Status pending",
   "created_utc": 1695931689,
   "score": 11,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oijir",
   "message": "I refuse to kiss anyone other than my wife, and I haven’t found her yet.",
   "created_utc": 1695961192,
   "score": 10,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mbrj2",
   "message": "7, when I was in the first grade lol",
   "created_utc": 1695929253,
   "score": 27,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2nhf8d",
   "message": "I was 19 at the time, about a month away from turning 20. Happened super spontaneously with a friend of mine who I had always had a crush on. She was super cool and it was a great first experience",
   "created_utc": 1695945101,
   "score": 4,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2odfja",
   "message": "Does kissing my self in mirror counts",
   "created_utc": 1695958508,
   "score": 5,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oujob",
   "message": "2days ago",
   "created_utc": 1695968780,
   "score": 5,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oukk1",
   "message": "2023 . Hopefully",
   "created_utc": 1695968797,
   "score": 6,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2ouprc",
   "message": "At 19, also my first time having sex 5 minutes after. Got ghosted by her the next day lmao",
   "created_utc": 1695968901,
   "score": 5,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mbqqj",
   "message": "I was 14, on the stairs in the school. I still cringe to this day..",
   "created_utc": 1695929246,
   "score": 14,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mhq4u",
   "message": "18, new years eve",
   "created_utc": 1695931355,
   "score": 13,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mk9ao",
   "message": "Summer between my freshman and sophomore year in high school, Madrid, Spain.  My Spanish teacher took a group of kids to Spain for a trip, and one night we learned about Sangria.  Amy and I were flirting all night, we both knew it was happening.  While we both stumbled up the stairs, we bumped into each other's lips.  It was nice.  She ended up in my bedroom that night, and I didn't have the guts to make another move.",
   "created_utc": 1695932260,
   "score": 9,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mx8gc",
   "message": "5th grade. In my best friend’s driveway. She lived in my neighborhood and we both had a crush on a boy who lived two doors down from her. Channing. He was so cute. We were playing truth or dare and he was dared to kiss me. I still remember it pretty vividly.",
   "created_utc": 1695936929,
   "score": 9,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2ohgoi",
   "message": "My senior year in high school. We knew we were both in the same club at school, but never talked \u0026amp; we officially \"met\" at a convention then we started talking \u0026amp; it progressed to us being more closer. We both walked out of the anime club \u0026amp; he decided to stick around while I waited for my ride, we talked \u0026amp; then he confessed his feelings...I was shocked \u0026amp; he kissed me...now our anniversary is coming soon on Halloween.",
   "created_utc": 1695960603,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2om4t8",
   "message": "Ok, I'm a guy, i was 12, and I was leaning on the outside wall of my school talking to my friend group  and my guy friend gets pushed by my other guy friend and the friend who was pushed fell on myle and our lips got pressed together and that was last year we are still friends but we had socks on so no homo",
   "created_utc": 1695963264,
   "score": 4,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2onigq",
   "message": "30, with a guy I met in another country but then visited my country as well. We still talk. :)",
   "created_utc": 1695964111,
   "score": 4,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oste7",
   "message": "12, with my cousin",
   "created_utc": 1695967568,
   "score": 4,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2ovgwp",
   "message": "Never and still counting",
   "created_utc": 1695969442,
   "score": 4,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2pgxr3",
   "message": "Fucking never LOL",
   "created_utc": 1695985513,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2prwi4",
   "message": "Had mine at 24 (I think?), there's still hope for everyone who's not in their teenage years anymore and didn't have their first.\n\n\nThe woman was too stunned to speak.\n\nThe woman was me 💀",
   "created_utc": 1695991259,
   "score": 4,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2myice",
   "message": "When i was in highschool, in a night over with my group mates.\n\nMy group mates and i have a project that we need to finish and whilst doing the project we happen to talk abt sleep overs or something. Every one was on board and so is my gf at that time. As a person who's very innocent and very easy to be swayed followed them without thinking of the hell that is waiting for me after that day.\n\nSo the sleepover happened and my gf and i slept at the bed while my group mates slept next to us which is not even an inch away.\n\nAround 12 midnight when everyone's sleeping I notice that my gf is still awake and kinda tense/hot at that time, i ask her why and ask if she's sick or something. She just look at me eye to eye, we stare at each other for atleast a minute or two and then the deed happened. We peck each other's cheeks and forehead and smiled at each other. And then after that it became a full blown making out and feeling each other's warmth... We didn't had sex since there's a lot of people at that room and it's already 5 am in the morning. \n\nAfter that happy time, hell break through \n\nWhen i went back home my mother is furious and told me to leave the house, that's the first time i saw my mom got angry like crazy. She told me that I'm very impulsive and i didn't even think that something may happen with me and my gf if we did a sleepover (which i realized that she's fckng right) and so on so forth. \n\nAfter that my gf and i always fight with the smallest thing and then eventually broke up... \n\nI was kinda happy that we did since i kinda grew from that relationship and became the men who i am today. 🫡",
   "created_utc": 1695937401,
   "score": 12,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mkvbt",
   "message": "10mins old by my momma",
   "created_utc": 1695932472,
   "score": 13,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2mxnpb",
   "message": "1st peck on the lips was probably 1st grade from the neighbor girl.  1st French kiss was 7th grade outside a taco bell with don’t speak by no doubt playing.",
   "created_utc": 1695937084,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2nb1xn",
   "message": "First kiss ever? Second grade. Two girls liked me and I just let them both do it at once. Unsure what I thought then and I don't know what to think now\n\nFirst 'serious relationship' kiss? Eleventh grade. Both 16, met in a theater performance and we ended up dating a week before opening night. People made fun of us sometimes lol",
   "created_utc": 1695942420,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2nh33s",
   "message": "Im 35 Haven't had one yet",
   "created_utc": 1695944963,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2nhtem",
   "message": "August 27th this year!",
   "created_utc": 1695945262,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2ni920",
   "message": "The priest kissed me in his office when i was 5. I've wanted to burn churches ever since",
   "created_utc": 1695945443,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2od742",
   "message": "5th grade. I was playing around and heard he was coming to find me for something, then started running faster because I thought it would be fun. I eventually fell (it was snowing and slippery) and while I was on my back, he leaned down opposite to me so his forehead was at my chin and kissed me. He was the mischievous kid in the class and did it as a dare, and I liked him so I brushed it off but I still remember being pissed that he stole my first kiss.",
   "created_utc": 1695958395,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oi3dh",
   "message": "Checks watch…. Hmmm, looks like I’ll have to get back to you on this one friend, perhaps a rain check?",
   "created_utc": 1695960949,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oih9x",
   "message": "Lmao never.",
   "created_utc": 1695961158,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oiqcn",
   "message": "In the future, I'm 17 and still haven't had my first kiss 🥲",
   "created_utc": 1695961294,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oj5c7",
   "message": "1987...had no idea what I was doing. She was 2 yrs older, patient and caring. She taught me a lot about female anatomy and how to explore. Thanks for triggering such nice memories.",
   "created_utc": 1695961520,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oj8vl",
   "message": "My first kiss was stolen from a guy who liked me but I repeatedly said I did not like him.  11th grade.  \n\nI wish it was different and I don't even remember his name but what I do remember is he pinned me against the wall and kissed me and then said there's nothing I could do about it anyway because he decided I was going to remember him as my first and when I thought of him ill finally learn to love him the way he loves me.  He stalked me for the rest of the year and he did this in front of all of my friend group where no one knew what to do.  The principal said I shouldn't have been asking for it when it was brought up to him that I was being stalked.  My mom decided that both me and my brother would transfer high-schools because of it.  My first kiss was the reason why I transfered schools, learned that being stalked was my fault, and ended up making my younger brother hate me.  \n\nThat 1 year of high-school at a new school was amazing though.",
   "created_utc": 1695961575,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2ojpmz",
   "message": "I was twenty. Was hanging out with this girl I met in class during graduation. We were friends kinda but I never kissed a girl before and one day the topic arrived there and I was afraid she‘d laugh if I told her I had never been kissed, so I teased her that I probably dont know how to kiss anymore. She put on strawberry lipgloss and we made out. Was absolutely great.",
   "created_utc": 1695961842,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2olnws",
   "message": "Havent",
   "created_utc": 1695962984,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2oo2wn",
   "message": "Me and my ex gf were play wrestling with each other in my bedroom and then when she had me pinned down she gave me a peck, it wasn't until about 2 days later when we started full on making out",
   "created_utc": 1695964466,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2p0tth",
   "message": "Last Monday",
   "created_utc": 1695973496,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2p1gv1",
   "message": "Grade 4",
   "created_utc": 1695974002,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2p1mq9",
   "message": "7th grade at her place \n\n…my first and only",
   "created_utc": 1695974134,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2p1r61",
   "message": "12, it was so awkward",
   "created_utc": 1695974235,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2p7281",
   "message": "Next question",
   "created_utc": 1695978579,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2pfs06",
   "message": "1979, Summer before starting freshman year of HS. I was trying to get the attention of my sisters friend all summer. I finally found the nerve to offer to walk her home and help carry some stuff she bought while shopping with my sister.  When I was leaving, she said thank you and leaned forward to give me a hug; I turned in and kissed her, and thankfully, she kissed me back. We dated for 5 years, college in different places, we drifted.",
   "created_utc": 1695984780,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2phvgq",
   "message": "From my Mum when I was 1 minute old.",
   "created_utc": 1695986084,
   "score": 3,
   "submission_id": "16up1g9"
  },
  {
   "comment_id": "k2ncyti",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16up1g9"
  }
 ]
}