{
 "submission_id": "16v6en7",
 "title": "Healthcare professionals: what is a telltale sign a patient has used drugs heavily in their life?",
 "selftext": "",
 "created_utc": 1695977776,
 "permalink": "/r/AskReddit/comments/16v6en7/healthcare_professionals_what_is_a_telltale_sign/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/16v6en7/healthcare_professionals_what_is_a_telltale_sign/",
 "comments": [
  {
   "comment_id": "k2pp19c",
   "message": "Talc retinopathy. Tiny talc particles accumulate in the retinal blood vessels of IV drug users and can be seen during a routine eye exam.",
   "created_utc": 1695989919,
   "score": 32,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pn3m3",
   "message": "When you give them 6mg of versed and 300mcg of fentanyl and they are still talking to you like normal.",
   "created_utc": 1695988946,
   "score": 4,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2ptdwx",
   "message": "He was smacking his mouth like a fish out of water, wearing a leather jacket in the middle of a hot Texas July. Admitted to coming down after smoking meth.",
   "created_utc": 1695991929,
   "score": 35,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pplbp",
   "message": "Big ass hole in the nasal septum with no other explanation for cause",
   "created_utc": 1695990184,
   "score": 52,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2q9if3",
   "message": "I remember doing phlebotomy rotations at a hospital in the Middle of Nowhere, Tennessee—aside from the small 60-bed hospital there was nothing but farmland for miles. I met a patient with heavily scarred, twisted veins. I failed to hit a couple times but eventually found a viable one. IV users can be tough sticks, but what makes me remember him to this day is the forlorn look in his eyes when he softly asked me to be careful because “it was his last good one so please don’t blow it”",
   "created_utc": 1695998442,
   "score": 15,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2py3nf",
   "message": "60 yo man who had done some drugs in life but was a heavy alcoholic. Never tells Drs of his past. \n\nQuit all by age 50. Health is falling apart by age 60. \n\nDr does an MRI and showing him pictures explaining the results. \n\nShe turned to him and asked if he had drank heavy for years. He glares at me thinking I tattled. No. Dr shows him the extra space in his skull around his brain. Explaining his brain had shrunk from alcohol abuse . \n\nI guess you can lie about it, but can't hide it.",
   "created_utc": 1695993966,
   "score": 15,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2ppyft",
   "message": "He can hit his veins better than you",
   "created_utc": 1695990356,
   "score": 172,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pk8vs",
   "message": "It’s damn hard to get an IV in them in our “usual” go to places due to scarring of the veins. They usually tell us where we have to go because that’s the only place that still works.",
   "created_utc": 1695987433,
   "score": 4,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2puuwj",
   "message": "If they are in recovery they will often use a lot of sugar and caffeine.\n\nIf currently using they’ll spend a lot of time in the bathroom.",
   "created_utc": 1695992579,
   "score": 13,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2poh75",
   "message": "They look 10-20 years older than their stated age.",
   "created_utc": 1695989642,
   "score": 171,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pmr23",
   "message": "I had a patient once refuse the contrast dye injection as part of an mri scan because ‘you don’t know what’s in that stuff’. \n\nThey were there because they were having palpitations following cocaine use.",
   "created_utc": 1695988766,
   "score": 170,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pkall",
   "message": "Work in anesthesia, they require 5x the meds to go go sleep.",
   "created_utc": 1695987459,
   "score": 42,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2psrot",
   "message": "I did residency in Phoenix, AZ.\n\n\nOne of our nurses frequently referred to the ‘tooth to tattoo ratio’ as a predictor of the amount of methamphetamine use. There was a consistent inverse ratio.",
   "created_utc": 1695991655,
   "score": 67,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pnqng",
   "message": "When they are 25-30 years old and look 50",
   "created_utc": 1695989267,
   "score": 38,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pjv5y",
   "message": "Its usually in their charts but if its not, hep-c, liver failure, pancreatitis and over all health status and appearance for their age is usually a good give away. 10/10 pain score, every-time you ask. Some erratic behavior is common too, I see a lot of CKD and diabetes in chronic users or patients in recovery after a life time of substance abuse. \n\nI come from an area with a lot of heroin, coke and alcohol abuse. Ive rarely ever had a meth addict and rarely crack users, so this applies mainly to those drugs.",
   "created_utc": 1695987219,
   "score": 237,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2qcv7o",
   "message": "You can tell by the way that they are. The surprising ones are the closeted Grandma/Grandpa's. I worked in the cath lab and an older lady's cath was negative and the doctor told her, \"Then what caused me to have chest pain?\"\n\n\"Probably your habit ma'am.\"\n\n\"What do you mean?\"\n\n\"The heroin.\"\n\n\"Oh. Really?\" \n\nShe looked like your average quilting champion.",
   "created_utc": 1695999680,
   "score": 5,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pyoii",
   "message": "Worked at a clinic that subsidized the treatments for many drug addicts (physical therapy).  My biggest tell was if they were current (their eyes and personality was drastically different) but for those who had years of previous use their pain thresholds were very low.  They were so use to dampening down their nervous system that any stimulus afterwards felt like it was aggressive or too much.  To use an example, imagine wearing sunglasses 24/7, in the house and outside all the time.  Now picture after years of that trying to navigate the world without sunglasses, all of a sudden light sensitivity will be through the roof.  It works similar with pain thresholds in my clinical experience. This is obviously outside of various physical signs like collapsed veins, trace marks etc.",
   "created_utc": 1695994208,
   "score": 72,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pt04e",
   "message": "The nasal septum is gone\n\n(either tons of nose spray... or white powder)",
   "created_utc": 1695991760,
   "score": 225,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2qoa2p",
   "message": "Substance abuse treatment nurse here, there are the obvious signs to when someone has or is using but I personally think about 80% of heavy drug users look like every day normal people. These people wouldn’t turn my head at the store or out on the streets. These people have jobs, have families, have lives outside of drug use. A lot of them have emotional and mental challenges that surpass any physical sign of drug use.",
   "created_utc": 1696003839,
   "score": 153,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2po7de",
   "message": "They tell you, \"I use drugs\"\n\nNever forget a patient's history is an important tool.",
   "created_utc": 1695989504,
   "score": 121,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pmayg",
   "message": "When you tell patient, doctor ordered morphine and they tell you only Dilaudid works",
   "created_utc": 1695988531,
   "score": 85,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2psn33",
   "message": "impatience, mood swings, shakiness, many more\n\nreally depends on the substance tho! \"drugs\" is an umbrella term for practicality, not for physical/chemical similarity.\n\nweed-abuse, alcohol-abuse, meth-abuse - all very very different. \n\nput individuality on top of it and it gets-harder and harder to make a judgment.",
   "created_utc": 1695991597,
   "score": 123,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2q7vrd",
   "message": "1) Young patient with no teeth.\n2) they know very well the dosage of controlled drugs, sometimes even better than you.\n3) if they trust you, they will tell you when asked.",
   "created_utc": 1695997832,
   "score": 67,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pqpru",
   "message": "Pill poppers: When they need medications for ACTUAL painful circumstances... they don't work or require high doses. To the point where there is nothing you can do (pain tolerance very low and medication doesn't help) but to watch them sit there in pain.",
   "created_utc": 1695990714,
   "score": 24,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2qzttj",
   "message": "Usually they are shockingly honest about it. Way more than you think. I work in a family practice clinic and we have a substance abuse screening as a part of the routine checkin (ask you if you use tobacco, alcohol, or drugs). And patients will regularly confirm that they recently used Crack, Heroin, Weed or whatever. More often than you'd think they would.\n\nOne of my favorite checkins I had a patient whose previous screening said he was using Marijuana and Meth. And he initially said he wasn't using anything. And I said \"Last time you were here you said you were using Meth and Marijuana?\"  And he instantly snapped to me and said \"NO!! I quit using Marijuana!!!\"  And I said \"Well what about Meth?\". And he slumped back down and said \"well yeah I do still use Meth!\".",
   "created_utc": 1696008042,
   "score": 130,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pj5v7",
   "message": "Addiction knows no bounds. I work as an addiction counselor in Medication assisted treatment (methadone/suboxone) and my clients range from homeless, barely 8th grade educated people to former doctors.\n\nThat said,addicts are highly impulsive, manipulative and typically arnt the most forward thinking people due to the nature of addiction.",
   "created_utc": 1695986815,
   "score": 65,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pr13x",
   "message": "They are really bad to sedate, show \"strange\" behavior at some earlier or later point of their stay (withdrawal). \nThey possibly show more obvious signs of withdrawal. They don't really like it, when they get antagonised. \nThey might try and steal meds. They mostly know perfectly fine where and how to get an IV started with them...\n\nICU nurse speaking",
   "created_utc": 1695990863,
   "score": 92,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2psea3",
   "message": "Honestly, I feel like most of them are pretty upfront about it.",
   "created_utc": 1695991485,
   "score": 229,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pmci4",
   "message": "Infective endocarditis/ vegetation on the heart valves.",
   "created_utc": 1695988553,
   "score": 178,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2piypp",
   "message": "The patient needs a lot more anesthesia than the average person",
   "created_utc": 1695986702,
   "score": 166,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pnvol",
   "message": "As a fairly heavy weed smoke I’m interested in hearing about telltale signs of that side too compared to just hard drugs if anyone can pitch in.",
   "created_utc": 1695989339,
   "score": 248,
   "submission_id": "16v6en7"
  },
  {
   "comment_id": "k2pz38q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16v6en7"
  }
 ]
}