{
 "submission_id": "16vgo7z",
 "title": "What are some telltale signs of a pseudo-intellectual?",
 "selftext": "",
 "created_utc": 1696005927,
 "permalink": "/r/AskReddit/comments/16vgo7z/what_are_some_telltale_signs_of_a/",
 "score": 63,
 "url": "https://www.reddit.com/r/AskReddit/comments/16vgo7z/what_are_some_telltale_signs_of_a/",
 "comments": [
  {
   "comment_id": "k2rcnih",
   "message": "I'd explain it if I thought you'd be able to understand.",
   "created_utc": 1696012728,
   "score": 158,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qya6q",
   "message": "Pseudo-intellectuals always think they are right. They seek to impress, not inform.",
   "created_utc": 1696007476,
   "score": 189,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qx8j0",
   "message": "They like to \"debate\" but shut down and get angry the second they get an unexpected question or have to think about their answer.",
   "created_utc": 1696007094,
   "score": 234,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2quphv",
   "message": "Lacks self awareness of their own biases",
   "created_utc": 1696006171,
   "score": 145,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r18kv",
   "message": "Thinking that watching a certain movie or listening to certain music automatically makes em smarter. Like if you were the director or you were in the band fine but all you did was press play how you smart?",
   "created_utc": 1696008555,
   "score": 202,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r5967",
   "message": "They use a lot of cromulent words whose definitions they really don't know.",
   "created_utc": 1696010019,
   "score": 37,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qwlbu",
   "message": "Believing that subjective opinions are objective facts\n\nBelieving that dictionaries are prescriptive and not descriptive",
   "created_utc": 1696006855,
   "score": 35,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rek5t",
   "message": "To me a big one is using overly technical or complicated wording when simpler wording would work as well or better. I actually appreciate complex vocabulary, but I don't think it's always necessary. If you need to be very precise, then often a more complex word is better. But a lot of communication doesn't need to be that precise.\n\nIt's a nuanced issue though, because a lot of genuinely smart people actually do think in more complex vocabulary than average people. So just because someone occasionally drops a more technical or flowery word doesn't necessarily mean they were doing so for appearances. Sometimes, that is just how they naturally think and speak.\n\nBut you can often tell when someone is speaking in public and it seems like they are *constantly* searching for the most ornate, complicated phrasing to make every single point that they're probably doing it to signal their supposed intelligence rather than to just communicate effectively.\n\nOn the other hand, sometimes people who are genuinely smart and \"intellectual\" will make a conscious effort to appear that way (even if they probably don't need to). It's not like \"real intellectuals\" are immune from narcissism, pride, insecurity, etc.",
   "created_utc": 1696013431,
   "score": 226,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r5bpk",
   "message": "A pseudo intellectual will have the \"answer\" to extremely nuanced multi-faceted problems. A genuine intellectual will admit that its far too complex for them to give you an answer or that no answer is a one size fits all.",
   "created_utc": 1696010044,
   "score": 20,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rfgyg",
   "message": "Wanting to argue, debate, etc.-- but without an openness to learn, and more importantly, without an openness to change one's views. \n\nWe should want to know the truth. Fuck our own views and ideas.",
   "created_utc": 1696013766,
   "score": 105,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qxsax",
   "message": "They hyper-focus on a single source of wisdom or completely ignore their opponent's perspective.\r  \n\r  \nActual intellectuals read broadly, and the best intellectuals read things they disagree with.\r  \n\r  \nEdit: Talking about \"read things they disagree with\"... There is a difference between reading the influential works of opposing movements and browsing social media cesspools. I am disappointed that I have to clutter this post by clarifying.",
   "created_utc": 1696007294,
   "score": 14,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r1oir",
   "message": "If they get their worldviews from Reddit",
   "created_utc": 1696008716,
   "score": 126,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r01fu",
   "message": "Word salad, big words, lots of esoteric jargon, but poor sentence structure and grammar, etc.",
   "created_utc": 1696008118,
   "score": 106,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2row9z",
   "message": "All evidence is fake, or extremely biased, unless of course it supports their view.\n\nLots of unread books.\n\nTalks of spirituality but is just as vapid as everyone else",
   "created_utc": 1696017243,
   "score": 35,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s3aio",
   "message": "Pseduo-intellectuals often overstate their level of intellect; genuine intellectuals continually question their intellect and seek to improve it.",
   "created_utc": 1696022534,
   "score": 34,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rrdzh",
   "message": "Actual intellectuals have 2 cats. Pseudo only have 1.",
   "created_utc": 1696018174,
   "score": 15,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r6sqp",
   "message": "I'm more worried about sudo intellectuals. \n\n\u0026amp;#x200B;\n\n$ intellectual\n\nError.  You don't have permission to run intellectual.\n\n$sudo intellectual\n\nRunning....",
   "created_utc": 1696010578,
   "score": 91,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r93bp",
   "message": "Overuse of buzz words and inability to explain their ideas without them.",
   "created_utc": 1696011417,
   "score": 12,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2ryqlf",
   "message": "Never saying \"I don't know\".",
   "created_utc": 1696020900,
   "score": 24,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2ra0ub",
   "message": "Projection of intellectual insecurity. E.g. by calling you things like \"arrogant\" or \"pretentious\" when all you've done is state facts.",
   "created_utc": 1696011756,
   "score": 44,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r6fyy",
   "message": "They honestly believe that everything can be explained by some simplistic generalization and they often come up with ideas they think are very deep that supposedly explain very complex problems under the assumption that nobody ever thought of that before, when it's something that a million other morons have said before them and is just a dumb take.",
   "created_utc": 1696010448,
   "score": 44,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s1pyn",
   "message": "I only see one when I walked past a mirror",
   "created_utc": 1696021968,
   "score": 7,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s4l01",
   "message": "Calling morons \"pseudo-intellectuals.\"",
   "created_utc": 1696023010,
   "score": 7,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2re4nm",
   "message": "“Ayn Rand is my favorite author”",
   "created_utc": 1696013272,
   "score": 92,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qutrw",
   "message": "Them being a walking Thesaurus",
   "created_utc": 1696006215,
   "score": 56,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r2jh0",
   "message": "Posting in threads like this acting like we can judge intellectualism….wait did I just? Awwww damn….",
   "created_utc": 1696009027,
   "score": 13,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qwt3d",
   "message": "They use unnecessary “impressive” words because they think that’s how intellectuals talk.",
   "created_utc": 1696006934,
   "score": 28,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qzw2n",
   "message": "Basically just a little bit of time with someone who acts like an intellectual is all you really need. A vast majority of people who act like intellectuals are pseudo intellectuals. I don't really mind if somebody wants to be perceived as smarter than they really are as long as they don't try to use their \"intelligence\" as an excuse to belittle people.",
   "created_utc": 1696008065,
   "score": 25,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rhqsi",
   "message": "This thread is absolute cancer",
   "created_utc": 1696014603,
   "score": 25,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r6ehh",
   "message": "They have more opinions than accomplishments.",
   "created_utc": 1696010433,
   "score": 18,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rgkqo",
   "message": "Just watch about 15 seconds of Russel Brand to get a pretty good example of one.",
   "created_utc": 1696014170,
   "score": 16,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2ra7b5",
   "message": "Using false equivalencies",
   "created_utc": 1696011822,
   "score": 16,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rblom",
   "message": "Speaking in absolutes or spinning conventional wisdom beyond banal statements that are relative but broad enough to mean anything. Additionally, the use of mainstream. “Mainstream scholars” “mainstream academics”",
   "created_utc": 1696012339,
   "score": 12,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r55vf",
   "message": "They expect you to take their bad-faith arguments at face value because they think there's no possible way for you to see through them.",
   "created_utc": 1696009987,
   "score": 9,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rpqd4",
   "message": "They believe that any opinion of theirs is a fact. And will try and debate everyone over it\n\nThe music they like is objectively the best\n\nTheir favorite food is objectively the best, and others are not as good even if they haven't tried it\n\nIf you don't enjoy their favorite piece of media you are objectively stupid",
   "created_utc": 1696017550,
   "score": 4,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s3aij",
   "message": "They tell you their IQ. Or that they're in MENSA. Repeatedly",
   "created_utc": 1696022534,
   "score": 5,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s8irx",
   "message": "Skimming through these comments to see how many boxes you check",
   "created_utc": 1696024483,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s8qsy",
   "message": "They talk more than they listen.",
   "created_utc": 1696024568,
   "score": 4,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qv2y3",
   "message": "Listening to or being Jordan Peterson.",
   "created_utc": 1696006308,
   "score": 111,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2rnojc",
   "message": "Whatever the most recent book they read or documentary they watched, they take on the subject as a temporary-but-critically-important part of their personality. Until they move on to the next thing. Which usually doesn't take very long.",
   "created_utc": 1696016798,
   "score": 7,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2qx383",
   "message": "People who are obsessed with credentialism but don't work in technical jobs.",
   "created_utc": 1696007039,
   "score": 14,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s2nu1",
   "message": "Disregard for serious scientific research based on their opinion and/or untested/discredited hypotheses. \n\nAdditionally,  referring to a scientific theory as _just a theory_",
   "created_utc": 1696022305,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s2zmj",
   "message": "Self-reporting their IQ.",
   "created_utc": 1696022425,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2s4utq",
   "message": "I greatly respected the writing of the late Isaac Asimov.  In addition to lots of his books, I also subscribed to his “pulp” magazine for years, and Asimov always included an editorial for each issue.\n\nHe was a great proponent of clarity in writing.  All too often, folks will resort to using jargon or two-bit language to not only display their intellect, but also to intimidate or obfuscate.    \n\nWe see that on various sub-Reddits here… Folks with a “wall of text” sprinkled with their favorite “where’s my dictionary” language.",
   "created_utc": 1696023111,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2sbcgl",
   "message": "Straw man. Everything is a straw man to them.\n\nThey can’t win an argument under the strength of the argument so surprise, now it involves some bullshit made up scenario designed to help their logic triumph.\n\nAlso they’re never wrong. Part of their delusion forces them to always be the smart correct one.",
   "created_utc": 1696025586,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2sc4gf",
   "message": "They mention Schrodinger's cat",
   "created_utc": 1696025902,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2se36f",
   "message": "They are working on a perpetual motion machine.",
   "created_utc": 1696026696,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2sgule",
   "message": "They’re a redditor",
   "created_utc": 1696027860,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2shrt2",
   "message": "Repeating the political opinions of whatever late night comedian they’re watching",
   "created_utc": 1696028271,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2sht4j",
   "message": "They never admit when they're wrong. They make excuses as to why you misunderstood them about something you found they're wrong about. \n\nThey like to correct you every chance they can.\n\nThey like to be the center of attention so they will try to meddle in whatever conversation you have with someone else like \"Actually guys it works this way ...\"",
   "created_utc": 1696028287,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2si2o7",
   "message": "A bounteous number of sophisticated vocables to characterise and illuminate a hypothesis which does not necessitate such bewildering jargon, often convoluted with ill-placed phraseology fashionable in prevailing media.",
   "created_utc": 1696028404,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2sjz51",
   "message": "They call watching yt videos 'research'. Don't get me wrong, I've learned a lot from yt but some dude pouring water on a spinning basketball ain't it, bro.",
   "created_utc": 1696029261,
   "score": 3,
   "submission_id": "16vgo7z"
  },
  {
   "comment_id": "k2r9864",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16vgo7z"
  }
 ]
}