{
 "submission_id": "16vpodk",
 "title": "What's the most bizarre coincidence you've ever personally experienced?",
 "selftext": "",
 "created_utc": 1696026897,
 "permalink": "/r/AskReddit/comments/16vpodk/whats_the_most_bizarre_coincidence_youve_ever/",
 "score": 181,
 "url": "https://www.reddit.com/r/AskReddit/comments/16vpodk/whats_the_most_bizarre_coincidence_youve_ever/",
 "comments": [
  {
   "comment_id": "k2seom8",
   "message": "Ran into my childhood friend in a random café in Paris. We both grew up in a small town in Texas and hadn't seen each other for years.",
   "created_utc": 1696026938,
   "score": 99,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sn7la",
   "message": "I know an elderly couple in their late 70s.\n\nBoth born in Nebraska. On the same day. In the same hospital. The two mothers shared a room.\n\nIn college, the two kids met and fell in love. Married 50 plus years now.",
   "created_utc": 1696030705,
   "score": 58,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sqe9l",
   "message": "I've written about this before, but it still blows my mind.  About 10 years ago I was at a big medical clinic in the city where I live.  I signed in for a blood test.  The sign-in  sheet asked for your name, arrival time and date of birth.  The *three people* ahead of me all had the same birth date as me!",
   "created_utc": 1696032137,
   "score": 51,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2st66a",
   "message": "I drove 18 hrs / 1300 miles moving into a new city.\n\nLast couple hrs listening to an 80's hits mp3 CD I had.\n\nAs I arrived to the new address, Human League \"Don't you want me\" was playing halfway tru, but I turned from CD to FM radio, yet the stereo kept on playing \"Don't you want me\".\n\nI was annoyed \"the stereo must be broken\", and I ejected the CD, but \"Don't you want me\" continued blasting... WTF???\n\nI was tired and i didn't realize that I had coincidentally tuned into a random 80s station, which was playing that same song at the same time, and I had made the transition from CD to FM imperceptible and on the radio the song was about halfway tru too...\n\nNothing impressive, but curious to me.",
   "created_utc": 1696033392,
   "score": 42,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sppg0",
   "message": "My older brother died when I was 5. I knew it really messed my mom up, so on my 7th birthday I wished for a baby brother because I thought it would make her happy. Roughly 9 months later my baby brother was born. \n\nGotta be honest though, if I knew that wish was going to come true, I would have used it on something I wanted 🤣",
   "created_utc": 1696031825,
   "score": 37,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sqskm",
   "message": "So they say that if 23 people are in a room, the odds of someone sharing a birthday are about 50%.  Ok, sounds odd, but I guess the math works out.\n\nHowever, I was on a flight to go do a job.  The guy who picked me up from the airport mentioned seeing my passport...and noticing we shared the same birthday.  Day and month, not year though.  So we chuckled.  How peculiar, what are the odds?\n\nAs we get to the worksite and begin talking to the manager there, we had mentioned the earlier coincidence.  He asks what day.  We tell him.  He smiles, takes out his ID, and shows us...he had the SAME birthday.  Again, not year but still.\n\nSo this wasn't just, put enough people in the room and *someone* will share a birthday.  This was three very specific people regarding this job, from different locations in the world, all having the same birthday.",
   "created_utc": 1696032320,
   "score": 32,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sr748",
   "message": "When I was 12, in 1988, my family took a trip to New Zealand. I forget which town we were in, but we had checked out of our hotel and were about to drive off when my dad realized he had left his credit card at the front desk, so he ran back in. There was an elderly American at the front desk checking out too, so they got to talking...\n\nTurns out the guy was my dad's little league coach from 30 years prior.",
   "created_utc": 1696032507,
   "score": 61,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sjcxw",
   "message": "I once dreamt about driving through a cemetery with my bf at the time’s mother. When I got to work that day (she was my manager), she was in a really down mood because her mother in law had died that night.",
   "created_utc": 1696028982,
   "score": 23,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2srhjb",
   "message": "I'm from the east coast of the US.  I went on a cruise in Alaska, and met someone from my same small city.  He knew where I was from because I was wearing a shirt that advertised a local business.  \n\nThree years later I sat down for a job interview and he was the one conducting the interview.",
   "created_utc": 1696032639,
   "score": 27,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sttbu",
   "message": "I donated some custom Vans sneakers to a thrift store in town. I go to the bar a few weeks later and as I was catching up with an acquaintance, I look down and he’s wearing my Vans. His mom bought them for him.",
   "created_utc": 1696033684,
   "score": 20,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sh1r9",
   "message": "I'd traveled to Kyoto for business and ended up literally running into one of the nurses that I got to know when I was in physical therapy after a coma and numerous corrective surgeries for childhood injuries that never healed properly (long story). She literally spilled her coffee on me again like she did on our first PT session. We ended up laughing at it as soon as we realized who the other person was. \n\nHere's the impossibility of it all. She's from the Midwest and lives in a town of 800-ish people and was there visiting her sister who'd moved there to teach English. Kyoto is a city of about 1.5 million people the odds of us encountering one another were miniscule. The odds are even slimmer that she'd be carrying coffee. The odds that she'd spill it again are even more remote.",
   "created_utc": 1696027947,
   "score": 48,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2subr1",
   "message": "Was in sitting with a group of expats in Bogata, Colombia. Got to chatting with one of them and coincidentally, we had the same birthday, same year, same small town in northern Canada, in the same hospital born within 20 minutes of each other.",
   "created_utc": 1696033918,
   "score": 15,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2syluv",
   "message": "I was a food runner at a restaurant in Florida, I brought a tray over to a table wearing Alabama crimson gear. I asked them if they were from there and told them my family was also from Alabama, after talking for a second it turns out he grew up with my dad and my dad just so happened to be visiting me that day at work and was sitting right at the bar. They hadn’t seen each other for about 30 years.",
   "created_utc": 1696035882,
   "score": 13,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2synf7",
   "message": "I was born on 6th June (6th month) at 6 PM on the 6th floor of the hospital and I work on the 6th floor at my office and my parking space is #6. I might add that I play a 6 stringed guitar, but that may be a bit of a stretch, lol. idk, but that's a lot of coincidences",
   "created_utc": 1696035903,
   "score": 12,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sk94h",
   "message": "Flew from Chicago to DC. Saw three different people I knew at the DC Airport, none of whom had been on my flight.",
   "created_utc": 1696029388,
   "score": 10,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sqhnb",
   "message": "Standing in line to register for a dorm at a university in Scotland in 1982.  Standing two people behind me was a good friend who I went to high school with in Virginia.  We both graduated two years earlier, hadn't been in touch since.  Wow.",
   "created_utc": 1696032180,
   "score": 12,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2skfgj",
   "message": "Worked nights as a nurse in a nursing home/rehab facility. Was approached by a recent stroke patient, a woman in her early 30's, asking for a single cloth work-glove that she could cut the fingers out of, and wear to curb the chaffing on her palm caused by the w/c wheel. The therapy department could have contacted doc for an order, billed for an evaluation/treatment plan and ordered some over-priced glove for her \u0026amp; my patient might have a glove within a week.... OR, I could stop at the hardware store on my way home, spend $0.99 \u0026amp; have it to her later that night when I came back... no brainer. I left the facility that morning, and as I was warming up my car and sweeping the light coating of snow off the hood, I noticed a snowless patch of grass 4-5' in front of my car. Dead-center in that spot was a single brown  work glove... looked brand new.... and was for the same-side hand she needed it for... coincidence?  I laughed hard and told God he had an awesome sense of humor! 🧤",
   "created_utc": 1696029465,
   "score": 26,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2slcfs",
   "message": "My boyfriend and I moved from Missouri to LA so he could go to grad school. We knew two people in the city, one from HS and one from college, but hadn’t been in touch with either of them since we moved. \n\nWe went to a random club in Hollywood one night and ran into one of them on the dance floor - excited and amazed, hugged, blah blah blah. I yelled in my boyfriend’s ear, “now we just have to run into Bruce!” and I turned around and Bruce was literally standing right behind us at that moment.",
   "created_utc": 1696029872,
   "score": 27,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2srhae",
   "message": "I was in two bus crashes on the same day once in London.  The first one managed to hit an old red phone box, (which was barely marked lol), and the bus that was sent to rescue us hit a raised concrete mini-roundabout on the way into the bus station, stopping it in its tracks and sending an old woman flying.",
   "created_utc": 1696032635,
   "score": 9,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sviav",
   "message": "our neighbors grandson came to our house, and I said hey buddy how are you doing? He says good. I say, what’s your name, same name is me, oh, that’s cool. we don’t have exactly common names. then, either right away or just a few minutes later somehow we ask each other what are birthdays were, exact, same birthdays. I thought that was wild.",
   "created_utc": 1696034450,
   "score": 10,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2svxik",
   "message": "I had a friend in high school, a “friend with benefits”… and we’ve stayed in touch for 20 years but I’ve not seen his mom for a long time. A few years ago I moved 90 minutes away. This summer I went alone to a local theater show, a 30 minute drive for me. I chose my ticket/seat randomly. I discovered after a few minutes that I was seated right next to my friend’s mom, who drove an hour to the show, also alone, and happened to sit in the adjacent seat. It was a nice reunion and we agreed to see a show together soon.",
   "created_utc": 1696034645,
   "score": 8,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sw63n",
   "message": "I was at work listening to random YouTube videos in the background and caught an episode of a show about airplane crashes. It was about a really horrific two-plane disaster on Tenerife Island. About ten minutes after the episode was over an order came in from my business website…..from a guy on Tenerife Island. \n\nDifficulty:  I make historically accurate American military uniforms for a living. Very specific stuff. World-wide customers are fairly common but this was the one and only from Tenerife Island.",
   "created_utc": 1696034755,
   "score": 9,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sw8i3",
   "message": "Me and a guy by the same name at Tim Hortons said the same words the same time in the same context like 8 times in a row, Him and I got REALLY weirded out by it.",
   "created_utc": 1696034786,
   "score": 7,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sydeh",
   "message": "When I was a kid we had a family friend who was about to give birth. She wanted to name her daughter with an H (not the real letter). After a relative that died.  She couldn’t come up with any she liked.  My mom saw an H name she liked in the birth announcements in a paper from the city/state she was visiting.  It wasn’t a common name. \n\nShe called the friend. The friend used it. Years later, the friend’s daughter met a girl with the same first name.  The first time she met someone with same first name. It was the girl she was named after.",
   "created_utc": 1696035772,
   "score": 6,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sytgc",
   "message": "Went to Japan and stayed in an AirBNB with a very friendly middle aged couple. After two weeks the guy pulls out a photo album of guests who stayed with them long term. In it was my cousin!",
   "created_utc": 1696035980,
   "score": 5,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2swn4z",
   "message": "I have an old school(ish) French first name, i could count on one hand the number of other people I've met with the same name (2) before that one day i went for blood tests. I handed my ID to the nurse, and she goes, \"Hey!!!! My name is IncogChick too!\" High five because for real, it's rare (here, might be popular in France, idk). Then she asked if the lady at reception had seen my ID? Yup, you guessed it, another IncogChick! 🤯",
   "created_utc": 1696034972,
   "score": 6,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2swthe",
   "message": "When I was about 12, I had a nightmare that my family and I were on the Titanic when it hit the iceberg, and that my father died. Ran into my parents room sobbing, promising never to take either of them for granted again. Within six months, my father was dead from an accident my whole immediate family was involved in. Since then, I have also experienced having a dream that my grandfather died, only for him to die six months later. I rarely remember my dreams, so now when I dream about a death, I pay attention.",
   "created_utc": 1696035051,
   "score": 6,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t38l5",
   "message": "Maybe this makes no sense BUT as a kid I was weirdly into license plates and phone numbers - memorizing them, knowing them. I knew 2 families from my city who did not know each other and had sequential license plates, with just the last digit different. I always thought that was cool.",
   "created_utc": 1696038067,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t4ex7",
   "message": "One time me and two friends all agreed to get Xmas presents for each other. Without any planning or discussing, we all ended up getting each other best buy gift cards for the exact amount as each other.\n\nIt was beautiful.",
   "created_utc": 1696038632,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sfde0",
   "message": "Someone called my room and asked for me by name. It was 9/11, and I had never heard of this person, though they seemed to know me, or at least my name.",
   "created_utc": 1696027216,
   "score": 7,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2snyyv",
   "message": "Both times the needle went through my nipple for my nipple piercing, their electricity went out! It scared them enough to pack up shop and move it 3 1/2 hours away…",
   "created_utc": 1696031045,
   "score": 9,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2somry",
   "message": "I fell out of a truck going about 40 mph and was unconscious in the middle of the road for about ten minutes.  The girl that found me was the girlfriend of the brother of the girlfriend of the guy who was driving the truck.",
   "created_utc": 1696031344,
   "score": 8,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2szmee",
   "message": "Travel: had the same head desk clerk at 3 different hotels. 2 were in different regions in Cuba and one in Mexico. \n\nMet people in that \"we'll never see them again\" way, and ran into them very randomly.",
   "created_utc": 1696036359,
   "score": 4,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2su0fb",
   "message": "I saw the doctor who took my wisdom teeth out in NYC 3 months after the procedure",
   "created_utc": 1696033774,
   "score": 2,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2svs4c",
   "message": "I grew up in the Philly suburbs. I worked full time at a company nearby. One time, my boss and I, were meeting a client. She was from DC and had never been to Pennsylvania before. The client mentioned that her boyfriend was from this area but wasn't sure exactly where. I can't remember exactly what she said but it was about his mother shooting his father. I was like, is his last name xxx (sort of uncommon Italian name) by the way?  Turns out I grew up with him, he was in my grade from kindergarten through senior in high school and lived right up the street from me.  We hung out sometimes because all the neighborhood kids got together to play games. It was so strange.",
   "created_utc": 1696034576,
   "score": 2,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2syiqa",
   "message": "When I was in junior high my town had a (large for the time) clothing store on the main street. Around 1980 the owner sold it for what I understand was a good amount of money.\n\nSo the a year or two later I am on a teen tour in London. I am with a bunch of kids from the tour, and we went to see the changing of the guard at Buckingham Palace. It was the summer. Wall to wall people. So I turn around and standing behind me is the former owner of the store and his wife. We chatted about what a coincidence it was.\n\nA year or two after that, probably 1984, I got on a plane with my parents, I think we were going to California from NYC. Sure enough, there they were again sitting a few rows ahead of us. I remember joking about who was following who. That was the last time I saw them.",
   "created_utc": 1696035841,
   "score": 2,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2szh3u",
   "message": "Called the wrong number asking for my friend Emma. The number I called was for someone else called Emma also. After a quick chat and misunderstanding I realized I knew this person also but had called them by mistake and didn't have their number.",
   "created_utc": 1696036290,
   "score": 2,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t1hql",
   "message": "For the first 15 yrs of my marriage every time we traveled out of state we’d run into one of my HS classmates (we both lived at least 500 miles for our previous cites). \nWent to Hawaii there is Casey and Robbi. Go to Boston, there is Cindy and Darin. Go to Williamsburg and there is Tammy and her family.  Round the corner and run smack into Simone. Sitting in a dive bar in Amarillo and they at the bar across from me is my HS crush.  So I was pretty happy those ended. But I’d love to Run into Beth G. That would be fun.",
   "created_utc": 1696037243,
   "score": 3,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t3wyd",
   "message": "At my school in the UK there were three South African members of staff.\n\nThey'd all grown up in the same half-horse dustbowl town (like, population 2000 and no hospital) in the butt crack of nowhere, all went to the same high school and then the same South African university.\n\nThe age difference was as much as several decades and they didn't know each other prior to working at the school.  If they'd been closer in age and known each other, I'd be inclined to believe they were just referring each other for the jobs at the school - but that wasn't the case.\n\n---\n\nAnd another one - I went on a long roadtrip in the UK and stopped at a large service area.  The car parked just opposite from mine had the same registration mark but exactly one year newer.  We had totally different cars, mine was a Ford Focus and his was a BMW X5.\n\n(Say that my car was AA66 XYZ, his was AA67 XYZ)",
   "created_utc": 1696038393,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t4sd3",
   "message": "Lived in a shared apartment with a dude and a girl when i was a student. Name of the girl was a female version of the dude's name. I will change the name buy say it's Christian and Christina (just far less common). The boyfriend of the girl had the same first name as me and the same birthday. The brother of said boyfriend had the same name as my flatmate (Christian).\n\nThe next shared apartment i lived in: Got new flatmate who also had a main apartment with his girlfriend in the small village where my grandparents used to live.\n\nFast forward a few years: The guy who moved away from my new apartment had the same first name as me - and his girlfriend was named a rare female version of that name.",
   "created_utc": 1696038808,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t5exg",
   "message": "Me and my fiance will find a movie we want to watch but find out it isn't available streaming. Then we will go to Walmart and go in the $5 bin or walk around Goodwill and it will always be there sitting for us, every movie every single time. We've gotten ET, Red Dragon, Vampire's Kiss, and so many many others over the course of our 3 years together. \n\nI had a dream I found my wedding dress at a Goodwill and went once, didn't find anything. The second time I went looking for shits and giggles and found THE DRESS.\n\nOn the way to my birthday dinner I got a call from my parents saying to come home, something had happened. I knew instinctively to check my Uncle's Facebook and he had died. The day after I was outside crying for him, asking for a sign, and 3 green meteors flew through the sky during this like once Ina lifetime shower. I wished for happiness and health and success in mg career. A week later I got a photoshoot at a restaurant called DiAnDi... he was the biggest DND nerd around painting figurines and had a 3d printer for them too.\n\nThese crazy things have followed me my whole life and I LOVE them",
   "created_utc": 1696039105,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t66wl",
   "message": "A mortgage broker had a fax number that was the same 7 digits as mine, but in a different area code one state away.  Once in a while I would receive faxes intended for the broker.\n\nOne day a 20+ fax came in that was someone's personal tax return. The sender was  applying for a mortgage.  The name on the tax return was a teacher I had in high school 30 years earlier.",
   "created_utc": 1696039475,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t688f",
   "message": "I was walking with my sister on a 40000 person university campus. I ask her if she ever sees my high school friend, Harry, there. She tells me no, it's a giant campus and odds are slim of running into him. I look up and realize he's playing frisbee on the lawn 50 feet in front of us.",
   "created_utc": 1696039493,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t7ctm",
   "message": "On a summer family road trip in fifth grade, we went to the Crazy Horse monument and ran into my third-grade teacher. A few years later, she would move down the street from us, unknowingly. About five years ago, I ran into her again at my work, having moved across the country in the meantime, and she was in the area visiting family. Crazy!",
   "created_utc": 1696040041,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sf9v3",
   "message": "A man in a full white radiation suit and a gas mask running down my street with a teenage pastel goth girl in a stroller.",
   "created_utc": 1696027174,
   "score": 3,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2swxke",
   "message": "When i breath put a noise outside happens at the same time and I'm not sure if i made the boise or not, then i breath out again and it happens again.\n\nPretty mind blowing.\n\n\n\n\n\n\n(Or nose blowing)",
   "created_utc": 1696035102,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t22b3",
   "message": "Don’t worry",
   "created_utc": 1696037515,
   "score": 0,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2sy8kv",
   "message": "I’ve lived in NC my whole life, through college, and just moved out to CO a year ago to start my real estate media company. I have 1 employee who’s a college buddy from NC as well. A few months in we get a brand new client who wants to get some work done at this mountain top mansion. We show up, meet the realtor for the first time and walk inside where the homeowner is. I say hello and introduce myself when my employee says “nice to see you”. In my head I thought it was weird, so did the realtor. Turns out the homeowner was the mother of my employees ex from high school back in NC. Here we are shooting her mountain top home in Boulder CO a decade later, small world.",
   "created_utc": 1696035708,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t13c8",
   "message": "Moved at 17 from Tacoma to upstate New York and working in a kitchen on cape cod in the summer I met my first girlfriends cousin who was waiting tables there. So weird.",
   "created_utc": 1696037054,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t1kui",
   "message": "I shared a gondola with the son of one of my mum's life-long friends while skiing with my mum in Leogang, Austria. Neither of us had any idea the other was there, and we hadn't seen each other for 12 years, and we still recognised each other!",
   "created_utc": 1696037284,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t4ezn",
   "message": "We lived in north delta.  The nice part of Surrey bc. We fly to aus and go to some random ass diner for dinner in noosa heads. Waitress walks over and turns out she is from Surrey.  Had a great time talking with her.  We tipped her 400$ on an 80$ bill and wished her well on her travels.  It’s always nice to see another canadian on the other side of the world.",
   "created_utc": 1696038633,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t6i07",
   "message": "One of my bosses in Japan went to the same highschool as me in NJ and my girl friend from Ukraine on exchange at my highschool was from the same town as my mother. Later at university this lady speaker survived baba yar which was a period of killings my family survived on both sides with something like maybe 3 dozen survivors.",
   "created_utc": 1696039624,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t7spv",
   "message": "There was a guy in college who I became friends with because we kept running into each other under the weirdest circumstances.\n\nIt start with the fact that we wound up taking three different classes together, not that crazy a coincidence for college you might be thinking, except the classes were Speech, Hawaiian History and an upper level French course, none of which were courses in either of our majors.\n\nThat wasn't the end of it though.  Another time I was at a movie, accidentally elbowed the guy next to me, turned to apologize, only to discover he and I had been sitting next to each other the whole time without realizing it.\n\nAnd still another time I was walking along campus when I heard someone calling my name and turned around to see it was him, except he wasn't calling me but his brother, who happened to have the same name as me and happened to be walking alongside me.\n\nBut wait, there's more.  Late in my college career I had to move into a new apartment that was a fair bit away from campus.  After heading out into the lobby from signing the lease guess who I see in the lobby.  \"Of course you live here,\" I said to him.  \"Actually it's my girlfriend who lives here,\" he said.\n\nOne last one: I walked into a convenience store.  The woman behind the counter squints at me and says coincidence guy's name.  No, I correct her, I'm me.  Then she tells me about a guy who she became friends with because she kept winding up in unexpected college courses with him.  It was the same guy.  \"You two look like you could be brothers though,\" she said to me.  No, I told her, only brothers in coincidence.",
   "created_utc": 1696040252,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t86ov",
   "message": "I'm not a very social person, so I don't keep in contact with many people. One of my few online friends happens to live in the same town my family is from. I go up to visit for a cousin's wedding and agree to meet this friend in person. By chance, he lives less than a mile from the house we're staying in for the week.",
   "created_utc": 1696040436,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t8w8h",
   "message": "Back in college I dropped off a disposable camera at a one-hour photo in Manhattan. I get back after an hour and give my name to pick it up (not at all a common name and with a unique spelling). They hand me back a headshot of someone who is not me with my exact name exactly how I spell it.\n\nI always describe this as my \"Twilight Zone moment.\"",
   "created_utc": 1696040781,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t9ogu",
   "message": "Grew up in one town my most my life. Had a job that was cut back in 2009. Had a work phone and vehicle I lost with the job. Needed a break from life so I talked to a buddy who has a wealthy family that doesn't require him to work. We went to his parents house 3 hours south of where I live for a week. Day 2 or 3 of being there, I decide I need a new cellphone. So I get a burner phone from Best Buy. I register it and realize I get an area code from my hometown and not in the town I bought it. \n\nThe next day I get a text from a number I recognize. Since the phone is new, I have no numbers or info saved. I ask my buddy if he recognizes the number. He looks it up on his phone. It's a good friend of ours that I have known since grade school. I ask \"how did you get my number?\". He said he always had it. I ask \"who do you think this is?\". He responds with another friends name.\n\nA friend from our group changed numbers and carriers a month or two prior. I randomly got his old number. From a retailer 3 hours south of where I lived. \n\nAll my friends already had my number. They just had to change names. Fucking weird.",
   "created_utc": 1696041174,
   "score": 1,
   "submission_id": "16vpodk"
  },
  {
   "comment_id": "k2t9qj1",
   "message": "One summer about 20ish years ago I was a little bored when I woke up and decided that for the whole day I was going to take something inconsequential from wherever I was, and swap it for something everywhere I went, so like I started with a mug from my house, went to a friend's house, he swapped it for a pen or something, and so on. After four or five times of doing this, and hanging out with a bunch of different people and explaining what I was doing, this chain ended with another friend giving me his Yellow Pages (back when it was still a physical thing that was sent to everybody), which I put in my bag and immediately forgot about.\n\nThat evening I was at a house party in the countryside with most of the people I knew at the time, we'd all decided to drop acid, apart from the guy whose house it was, and a couple of others, and by a few hours later we were all tripping heavily and laughing our arses off. Great times.\n\nOh, the coincidence? A few hours after that when things were starting to wind down, one of the girls in the group walks into the room and asks the owner guy \"Hey do you have a Yellow Pages? I need to call a taxi and I don't have a number.\" He says \"Sorry, we don't have one. Do people even use Yellow Pages anymore?\"\n\nI'm still tripping but I hear this and yell \"WAIT, I DO! Here you go!\" and I reach into my bag and pull out the Yellow Pages from earlier. She looks confused, takes it and asks me \"Why the fuck do you have this?\"\n\nI look her dead in the eye and say \"I have absolutely no fucking idea.\"",
   "created_utc": 1696041204,
   "score": 1,
   "submission_id": "16vpodk"
  }
 ]
}