{
 "submission_id": "16vr2ha",
 "title": "What do You think is the biggest event that will happen in the next 50 years?",
 "selftext": "",
 "created_utc": 1696030269,
 "permalink": "/r/AskReddit/comments/16vr2ha/what_do_you_think_is_the_biggest_event_that_will/",
 "score": 23,
 "url": "https://www.reddit.com/r/AskReddit/comments/16vr2ha/what_do_you_think_is_the_biggest_event_that_will/",
 "comments": [
  {
   "comment_id": "k2sqt6a",
   "message": "Last episode of The Simpsons",
   "created_utc": 1696032328,
   "score": 154,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqdfq",
   "message": "I feel like one of the major countries in the world will have a major collapse, russia, us, china, something.",
   "created_utc": 1696032127,
   "score": 138,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2smlzj",
   "message": "controllable nuclear fusion\n\nhuman landing on the Moon (again)\n\nwars breaking out in the west-Pacific",
   "created_utc": 1696030440,
   "score": 65,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqo52",
   "message": "It will probably be something we’ve never imagined happening",
   "created_utc": 1696032265,
   "score": 253,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2smyeq",
   "message": "Costco still sells $1.50 hotdogs",
   "created_utc": 1696030594,
   "score": 117,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sph5g",
   "message": "Holographic Ana de Armas A.I girlfriends",
   "created_utc": 1696031721,
   "score": 8,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sszbq",
   "message": "Joe Biden \u0026amp; Donald Trump are going to quit politics and open a lovely bed \u0026amp; breakfast in Oregon.",
   "created_utc": 1696033307,
   "score": 69,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ss2bp",
   "message": "Grand theft auto 6 will finally be released",
   "created_utc": 1696032900,
   "score": 158,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ssbl4",
   "message": "Water wars",
   "created_utc": 1696033017,
   "score": 45,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2smld3",
   "message": "It seems to me that artificial intelligence will become self-aware.",
   "created_utc": 1696030431,
   "score": 225,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2spvxk",
   "message": "The death of Keith Richards. Nah just kidding. Keith will be around at least another 50 years.",
   "created_utc": 1696031906,
   "score": 90,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2soaz2",
   "message": "It's going to be demographic collapse. That's well underway now, and the impact is going to be enormous. \n\nWhile the world's total population will continue to climb, the advanced world is already starting to decline and cannot recover. Tiny generations will produce even tinier ones.\n\nCountries like Germany, Russia, Korea China will continue to contract. America will hold on longer but are on the same path.\n\nThe world economy will need to be reorganized; the growth forever model is dead and nobody's really ever figured out what replaces it. That transition will be extremely tough from any number of angles. \n\nWhile this sounds good from a Thanos type point of view, you will not actually reduce total population. You are making the total older, grayer and less healthy. It won't be some green paradise, but it will be a world of less, and probably a world with more conflict and war as global systems break down.",
   "created_utc": 1696031195,
   "score": 209,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2smfrh",
   "message": "First people on Mars.",
   "created_utc": 1696030361,
   "score": 63,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2smd15",
   "message": "The commercialization of quantum computing.",
   "created_utc": 1696030327,
   "score": 113,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sreps",
   "message": "The cost of energy will be close enough to be considered “free” and practically infinite. . \n\nDue to renewables or fusion or space solar or something we don’t know yet. \n\nAs a result we move into a pos-scarcity world.",
   "created_utc": 1696032602,
   "score": 71,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqgef",
   "message": "Aliens are revealed to be our ancestors as we are decedents of them and earthlings. They are beings who have mastered time and other dimensions.",
   "created_utc": 1696032164,
   "score": 93,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqb6o",
   "message": "Inexpensive, low energy desalinization of ocean water…everybody in the world will have as much inexpensive salt as they need",
   "created_utc": 1696032097,
   "score": 30,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqtzz",
   "message": "Disclosure of NHI",
   "created_utc": 1696032339,
   "score": 38,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2stezk",
   "message": "Aliens will land, get out of their spaceship, take one look around and go home in disappointment",
   "created_utc": 1696033502,
   "score": 30,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqjfp",
   "message": "Life (or at least fossilized life) will be definitively discovered within our solar system. \n\nAstronomers will likely also find very suggestive signs of life far beyond our small corner of space. \n\nPerhaps the former will help inform the discovery of the latter.",
   "created_utc": 1696032204,
   "score": 54,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ss0ad",
   "message": "Hard to say what should be considered the most significant, but I have a number of predictions.\n\nFamine it tropical regions killing potentially millions at a time, gangs and warlords taking over regional areas in the ensuing chaos and becoming dictators.  \n\nThe threat of rising sea levels and increasingly frequent and deadly storms cause large populated areas (eg Florida) to become financially non-viable to live, as the cost of frequently rebuilding and the long term threat of permanent flooding increases and becomes undeniable.  \n\nFirst long term settlements in space, both in LEO and on the Moon. (When I say settlements I mean a literal handful of people, but still self sustaining in the short term).  \n\nMan walks on Mars.  \n\nOver/Under 1.5 US Presidential assassinations  \n\nOver/Under 1.5 Western Democracies fall to fascist dictatorships based on right wing ideas.  \n\nOver/Under 1.5 large nations see large scale overthrows of their economic power structure (ie. eat the rich style riots) do to economic inequality and wide scale poverty/food insecurity.\n\nThe mystery of dark energy will be solved.  \n\nEvidence of simplistic pre-microbial life is found elsewhere in the solar system.  \n\nDirect evidence of complex life forms outside the solar system becomes significant enough to be considered probable.",
   "created_utc": 1696032875,
   "score": 45,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2smcjh",
   "message": "World War 3",
   "created_utc": 1696030321,
   "score": 77,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sq9xk",
   "message": "Antarctica’s ice sheet will melt into the ocean, effectively eliminating any possibility to hold back the drastic effects of climate change.",
   "created_utc": 1696032081,
   "score": 67,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2squsw",
   "message": "Plot twist: Not World War 3, but Solar War 1. A war of Earth vs the remarkably advanced underground civilization on Mars. \n\nYou’d think this would at least finally bring Earth together as one collective human race, but no. Half of Earth’s population is extremely susceptible to Mars’ anti-Earth propaganda and actually on the side of Mars.",
   "created_utc": 1696032350,
   "score": 27,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqctz",
   "message": "Massive volcano eruption",
   "created_utc": 1696032119,
   "score": 12,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ssgn3",
   "message": "We'll see at least one living human leave us forever with effectively no understanding of where they are going.",
   "created_utc": 1696033077,
   "score": 13,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sq38n",
   "message": "The Singularity.",
   "created_utc": 1696031997,
   "score": 20,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqo6t",
   "message": "Pandemic, but a bigger one, say mutated Ebola, loose a third of world population",
   "created_utc": 1696032266,
   "score": 30,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2szcv8",
   "message": "P Diddy goes to jail for being the sole conspirator behind both biggie and tupacs murders",
   "created_utc": 1696036233,
   "score": 5,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqbsq",
   "message": "President Camacho will reign supreme after sending each political rival to rehabilitation. \n\nMore likely it's something to do with nuclear war, tbh. I believe Putin and Kim especially would rather end the world than be removed from power or concede defeat. They'll bomb someone in NATO and that'll be it.",
   "created_utc": 1696032105,
   "score": 11,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2smmrr",
   "message": "Wilko's will re open",
   "created_utc": 1696030449,
   "score": 7,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2srkpj",
   "message": "World War 3, as much as we dread it.",
   "created_utc": 1696032679,
   "score": 4,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ss74s",
   "message": "Some idiot will use a nuke somewhere and the world will become extra fucked",
   "created_utc": 1696032962,
   "score": 5,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2st8jz",
   "message": "The biggest one, in my opinion, is the fact that many of these companies, who are in charge of creating technology and software that has the potential to transform the world (LOOKING DIRECTLY AT ZUCK), aren't interested in either taking the necessary precautions to properly implement the technology or in accepting accountability when things go wrong with it. We are really screwed if the corporation that creates artificial general intelligence has this \"Profit above all else / Move fast and break things\" mentality. This is one way that humanity could end up extinct long before the effects of climate change do.",
   "created_utc": 1696033421,
   "score": 5,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sy55n",
   "message": "The invention of truly immersive VR causes transportation prices to collapse, triggering WW3, a hemisphere conflict between the exploited peoples of the Southern Hemisphere and the robot armies of the North.  A version of the events of Neuromancer plays out, and self-aware AI is permanently out of the bottle.  The Singularity and the painful change to a post-scarcity society occurs. As a result, humanity never develops FTL and instead turns inward, and some other intelligence's version of the Fermi Paradox lives on.",
   "created_utc": 1696035664,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t0z47",
   "message": "Famine on a scale we can’t grasp right now",
   "created_utc": 1696036999,
   "score": 4,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2snmrr",
   "message": "Yellowstone will erupt triggering the cascadia subduction zone causing massive wipeout of humanity. The world will never recover from this",
   "created_utc": 1696030892,
   "score": 29,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sqcxr",
   "message": "Facism Part Deux",
   "created_utc": 1696032120,
   "score": 10,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ss4od",
   "message": "Uploading human consciousness to the cloud",
   "created_utc": 1696032930,
   "score": 5,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ssad5",
   "message": "UFO Disclosure",
   "created_utc": 1696033001,
   "score": 8,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ssfrk",
   "message": "Aliens will reveal themselves within the general population. They will be housewives mayor's school teachers and police officers. They will begin a breeding schedule so they can populate the earth and send us to solar systems never explored before.",
   "created_utc": 1696033067,
   "score": 6,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ssqmj",
   "message": "Aliens",
   "created_utc": 1696033200,
   "score": 9,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2spxk1",
   "message": "The AI slash robot apocalypse.",
   "created_utc": 1696031926,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2srj4q",
   "message": "Space/alien related disclosure",
   "created_utc": 1696032659,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2srmpn",
   "message": "Ww3",
   "created_utc": 1696032704,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2ssj0x",
   "message": "The third world war.",
   "created_utc": 1696033105,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sz2ft",
   "message": "Confirmation of life on another planet",
   "created_utc": 1696036096,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2szb57",
   "message": "I can't see how we avoid nuclear war. \n\nEverything's fine until suddenly it isn't.",
   "created_utc": 1696036210,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t1zrl",
   "message": "War, famine, pestilence. We will live through this, (some of us) but population control will happen not only through wars but also were facing an outbreak of illnesses that over the next 50 years will come to light. \n\nI predict Putin will die before Valentine's Day 2024. This combined with NKoreas new toys creates a cold war while other nations push for one world order.\n\nSomething massive will happen in Hollywood when actors start selling their image instead of actual acting jobs. \n\nA large worldwide treaty to stop further AI progress until a safehold is in place everyone can agree upon.\n\nChina population decline and changes to worldwide trade rules causes them to be hit hardest by the end of the 50 year time period.\n\nWorldwide natural disasters hit hard, especially earthquakes and storms with flooding. I see bad floods worldwide until 2036 when a major change in climate happens.\n\nCERN has a major disaster destroying much of the area in Switzerland. While devastating the information gleaned from the accident changes lives.\n\nWithin 2000 years we will create a time travel device but we are unable to direct to specific times. These trips become visible to our reality within the next 15 years, although we cannot replicate it without some kind of element that has not been brought to earth yet.\n\n\nI hope these make sense. I do tend to be about 80% accurate most of the time.",
   "created_utc": 1696037482,
   "score": 3,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t2hs7",
   "message": "We are going to transition into a never before seen economic system. We're seeing the \"labor pains\" already with the writers' strike. Studios are already wanting to move towards a system where they have AI churning out the bulk of scripts that just to be polished by a single human writer. A team of writers can now be replaced with one human and an AI. What's going to happen when the polishing is not needed? Writers will be made almost obsolete. This is going to every single white collar job, and the rate that it happens will be astounding. In the past, new technology has replaced workers, but it always made run for new positions. This won't happen with AI because it will be able to learn new jobs faster than humans.\n\nIf left unchecked, the result will be something similar to medieval serfdom. We will have a permanent lower class living in squalor while the wealthy elite live in luxury as they reap the benefits of AI replacing the human labor force. If properly utilized, we could be coming into an age of utopia where everyone's needs are met and the input required of each person is minimal. This will require moving away from a capitist system, though, which means sacrifice for a lot of people.",
   "created_utc": 1696037720,
   "score": 1,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t2n5t",
   "message": "I think we've got a pretty major economic reckoning coming. If we're smart it will happen in the next 10-15 years and we will have some level of societal change after a few small events. If we let the oligarchy and demographic collapse continue to get much worse, I think it will be less societal change and more violent societal collapse.",
   "created_utc": 1696037790,
   "score": 1,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t5jhc",
   "message": "I honestly think it will boil down to a break down of world powers. I don’t see a civil war happening but I do see huge riots and violence on the horizon. The state of politics in the powerful countries is now increasingly toxic, “undecided” voters do not exist, people are FIRMLY in a spectrum and regardless of what’s said nothing will change their minds. Unless we start fixing our communication things will continue to get worse and decline. George Washington’s warning about the two party system, entangling ourselves in European affairs are becoming true. We should take some time to touch base at home for a few years, really invest into our people and restore public faith.",
   "created_utc": 1696039163,
   "score": 1,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t5vua",
   "message": "Disclosure of the existence of Aliens coming and visiting Earth since the beginning of human history.",
   "created_utc": 1696039327,
   "score": 1,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t5y04",
   "message": "Something with UFO’s.",
   "created_utc": 1696039357,
   "score": 1,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t6l69",
   "message": "We will discover a ground breaking technology that will greatly further the lives of mankind, while simultaneously using it in the most destructive way possible",
   "created_utc": 1696039668,
   "score": 1,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t6zp1",
   "message": "I think it's already happened.",
   "created_utc": 1696039864,
   "score": 1,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2sp4hf",
   "message": "Confirmed contact with other living beings from outside of earth",
   "created_utc": 1696031562,
   "score": 12,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2spcmq",
   "message": "My children will have to bury their father (me), most likely",
   "created_utc": 1696031665,
   "score": 7,
   "submission_id": "16vr2ha"
  },
  {
   "comment_id": "k2t34o0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16vr2ha"
  }
 ]
}