{
 "submission_id": "16w3q2o",
 "title": "Who won in court BUT lost in the “court of public opinion”?",
 "selftext": "",
 "created_utc": 1696070802,
 "permalink": "/r/AskReddit/comments/16w3q2o/who_won_in_court_but_lost_in_the_court_of_public/",
 "score": 168,
 "url": "https://www.reddit.com/r/AskReddit/comments/16w3q2o/who_won_in_court_but_lost_in_the_court_of_public/",
 "comments": [
  {
   "comment_id": "k2vctkh",
   "message": "In 1980 Lindy Chamberlain-Creighton was charged for the murder/death of her daughter Azaria Chamberlain. They had been camping in the Australian bush when the baby disappeared. She claimed a dingo had taken her child, but the public thought that was preposterous.\n\nDespite locals who regularly camped in the area AND indigenous people that LIVED there saying there were many dingo lairs nearby and that the creatures were *extremely* dangerous, they did little to no follow up and she was convicted because the public thought she behaved 'weirdly' after the baby's death by doing things like smiling at a pleasant memory during the memorial. Not only that, she became a laughingstock around the world with the term 'the dingo ate my baby' making it into shows as big as Seinfeld at the time. \n\nYears later they found a dingo lair with scraps of Azaria's clothes because, shockingly, the people who live and regularly camp in the area actually know more than the police and general public and were correct. She was released from prison and her name was cleared, but she'll have to live the rest of her life knowing her baby was taken from her and the world treated her like a murderous clown.\n\nThis, and the McDonalds hot coffee lawsuit, are a major lesson in how nobody should ever take what the media says about a case at face-value.",
   "created_utc": 1696086156,
   "score": 77,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uzj1i",
   "message": "Jennifer Connell was called the worst aunt ever and the “aunt from hell” for suing her nephew. Her nephew basically jumped into her arms and the extra physical affection broke her arm. Became a really big deal when it happened. Thing is, she needed to name a person at fault for her injury for her insurance and named her nephew with his parents’ permission. She wasn’t actually suing her nephew, just getting insurance money so she could be treated.",
   "created_utc": 1696080397,
   "score": 224,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2vpmiy",
   "message": "Ken McElroy, the Skidmore Missouri \"town bully\".  His rap sheet included assault, statutory rape, child molestation, arson, animal cruelty, hog and cattle rustling, and burglary.  Never convicted.\n\nOne day he was shot and killed in broad daylight on a busy street.  Nobody saw who did it \u0026lt;cough cough\u0026gt;",
   "created_utc": 1696091146,
   "score": 124,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uweey",
   "message": "Richard Jewell, the man falsely accused of the Centennial Olympic Park Bombings in Atlanta in 1996. He was a security guard and saved dozens of lives by spotting the bomb and clearing spectators. The FBI noted him as a person of interest, and his name was dragged through the mud by local and national media. While the FBI stopped investigating Jewell by October of that year, it wasn’t until a couple of years later that his name was truly cleared when Eric Rudolph, the actual bomber, was caught. \n\nJewell sued a number of media outlets and settled with a few of them for an undisclosed amount.",
   "created_utc": 1696078861,
   "score": 147,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v5xr7",
   "message": "The dingo took my baby woman. Which turned out to be true as well",
   "created_utc": 1696083332,
   "score": 145,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2vmap6",
   "message": "That case in Mexico where a rapist was acquitted of rape because he “didn’t enjoy it.” I guess the rapist’s dad being a top cartel honcho had nothing to do with it then",
   "created_utc": 1696089863,
   "score": 210,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v4tzs",
   "message": "Jesse Ventura sued Chris Kyle for defamation but after Chris' death the lawsuit continued and people smeared Jesse for \"suing a dead man's wife.\"  Jesse eventually got a settlement.",
   "created_utc": 1696082853,
   "score": 72,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2ujbwd",
   "message": "OJ simpson",
   "created_utc": 1696071174,
   "score": 230,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v516g",
   "message": "The city of new London in Kelo v City of New London.  The city was using the eminent domain to remove a nice lady from her home to build shopping complex. Made its way to the supreme Court and a 5 v 4 decision won and Kelo lost her home to provide economic opportunities. High profile case where the public sided with Kelo but the courts sided with the city.",
   "created_utc": 1696082944,
   "score": 179,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uiwh7",
   "message": "Casey Anthony",
   "created_utc": 1696070869,
   "score": 173,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v1sb1",
   "message": "Bill Cosby. I literally forget sometimes that his conviction was overturned and vacated.",
   "created_utc": 1696081462,
   "score": 155,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uw0ue",
   "message": "Mason Greenwood. 19 year old raped his girl friend and audio of it was leaked. After 18 months, the case was dropped and he was shipped off to play for a Spanish club.",
   "created_utc": 1696078670,
   "score": 223,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2umxe7",
   "message": "OJ \u0026amp; Casey Anthony….debatably Karla Homolka too cuz she got a ridiculously light sentence",
   "created_utc": 1696073594,
   "score": 158,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v9pac",
   "message": "Monica Lewinsky. She \"won\" in court because she wasn't the person on trial. The power dynamics also weren't in her favor. He was her boss. But yet, we still call it \"the Monica Lewinsky\" scandal and her name is still brought up in derogatory ways after all these years.",
   "created_utc": 1696084895,
   "score": 135,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2utagt",
   "message": "The woman who won a damages settlement from McDonald’s for being burned by overly hot coffee. It was dangerously hot and they’d been warned before and paid medical bills by court order over other burns, but because she got a high payout over something as seemingly trivial as coffee, she’s labeled litigious and dramatic. The burns were awful. And by the way, McDonald’s still has coffee that’s dangerously hot; they were in the news a week or two ago for another burn case.",
   "created_utc": 1696077252,
   "score": 197,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uviq3",
   "message": "Brock \"The Rapist\" Turner arguably won given his sentencing\n\nEthan Couch, the \"Affluenza\" kid\n\nEdit: I was wrong. Brock \"The Rapist\" Turner now goes by Allen \"The Rapist\" Turner. Sorry for the confusion",
   "created_utc": 1696078417,
   "score": 79,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v7w5f",
   "message": "John Delorean, he was set up by the FBI and his case is the reason for the term entrapment. He was acquitted of all charges. \n\n“DeLorean needed $17 million to save his company from collapse. To this end, he spent much of 1982 desperately seeking investors for his failing company.\n\nHe was approached by one such investor named James Hoffman on June 28, 1982, who claimed to have a business opportunity to help save DeLorean’s company.\n\n**Unknown to DeLorean, James Hoffman was actually a convicted drug smuggler, who, in exchange for leniency, struck a deal with federal authorities to become an informant.”**",
   "created_utc": 1696084160,
   "score": 240,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uyv92",
   "message": "Anneli Auer. I'm sure this case is not known outside of Finland.\n\nhttps://en.wikipedia.org/wiki/2006_Ulvila_homicide_case?wprov=sfla1",
   "created_utc": 1696080079,
   "score": 122,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v4g7g",
   "message": "Duke lacrosse players.",
   "created_utc": 1696082678,
   "score": 203,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2ullgd",
   "message": "Kevin Spacey",
   "created_utc": 1696072715,
   "score": 4,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uvwrk",
   "message": "Dan white getting 5 years for killing Harvey Milk and the mayor of San Francisco",
   "created_utc": 1696078614,
   "score": 250,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v7kdj",
   "message": " The State of Tennessee actually won the infamous [\"Monkey trial\"](https://en.wikipedia.org/wiki/Scopes_trial) where a local teacher was prosecuted for teaching evolution. But if anyone has heard of it today, it's generally presented as a bunch of bullying fundamentalists trying vainly to stamp out ideas they didn't like.",
   "created_utc": 1696084025,
   "score": 175,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uwss7",
   "message": "It's mixed for sure, but Michael Jackson. Went to court twice, and was found not guilty, but he'll always be the butt of child molester or paedophile jokes.",
   "created_utc": 1696079060,
   "score": 80,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2v3w0s",
   "message": "i’m here to predict Lizzo wins in courts but her image will never be the same, if she can win back the public opinion at all….",
   "created_utc": 1696082420,
   "score": 231,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2utcgr",
   "message": "Stella Liebeck from the McDonald’s coffee case. She won her case, but she became the face of frivolous lawsuits after McDonalds campaign to discredit her.\n\nMcDonald’s policy was to serve coffee so hot that it could cause third degree burns within seconds of contact with skin simply to discourage customers from getting refills.",
   "created_utc": 1696077280,
   "score": 204,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uubrq",
   "message": "Fatty Arbuckle",
   "created_utc": 1696077798,
   "score": 226,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2vg3g4",
   "message": "[Phillip Brailsford, the cop that killed Daniel Shaver.](https://en.m.wikipedia.org/wiki/Shooting_of_Daniel_Shaver)\n\nThe video of that left me sick to my stomach. The man was carelessly shot to death, cop was tried for 2nd degree murder, acquitted of all charges, and was hired back to the police force just long enough to earn his pension.",
   "created_utc": 1696087465,
   "score": 102,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2uvga1",
   "message": "The first acquittal of the cops who beat Rodney King. That was some preposterous bullshit.",
   "created_utc": 1696078384,
   "score": 27,
   "submission_id": "16w3q2o"
  },
  {
   "comment_id": "k2yezfg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16w3q2o"
  }
 ]
}