{
 "submission_id": "16wa47t",
 "title": "what’s something common that men do, that women wish they would stop doing?",
 "selftext": "",
 "created_utc": 1696088576,
 "permalink": "/r/AskReddit/comments/16wa47t/whats_something_common_that_men_do_that_women/",
 "score": 104,
 "url": "https://www.reddit.com/r/AskReddit/comments/16wa47t/whats_something_common_that_men_do_that_women/",
 "comments": [
  {
   "comment_id": "k2xhmft",
   "message": "Asked my wife this question while we're at the dinner table.\n\nShe says \"Breathing.\"\n\nI'm fuckin sleeping with one eye open from now on. 😐",
   "created_utc": 1696116415,
   "score": 52,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xck8k",
   "message": "Asking women questions and ignoring the answers.",
   "created_utc": 1696114175,
   "score": 213,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xcdrc",
   "message": "Loading the dishwasher like a raccoon on meth",
   "created_utc": 1696114096,
   "score": 142,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xwm9w",
   "message": "Anger IS an emotion.",
   "created_utc": 1696122861,
   "score": 218,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wvj24",
   "message": "Leaving beard hair shavings in the bathroom sink.",
   "created_utc": 1696107073,
   "score": 242,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2y0m7l",
   "message": "Calling taking care of their kids \"babysitting\".",
   "created_utc": 1696124598,
   "score": 224,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x84ps",
   "message": "Feigned Incompetence. \n\nCleaning and cooking are learned skills. I was not born with an inherent skill because I have a vagina. Get off your lazy ass and clean up after yourself and learn to fend for yourself.",
   "created_utc": 1696112247,
   "score": 79,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x9xu3",
   "message": "My husband asks me a question, I provide the answer. He calls his friend to ask him the same question to *confirm* my answer is correct (it always is). Either stop asking me questions or freaking accept the answer I provide.",
   "created_utc": 1696113034,
   "score": 164,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wonbl",
   "message": "Telling you to get a sense of humor when you call them out on being mean. Now I just say, “It’s not my fault that you’re not funny.”",
   "created_utc": 1696104356,
   "score": 105,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wzv4e",
   "message": "Dismissing our contribution to the discussion without even giving it honest consideration.",
   "created_utc": 1696108803,
   "score": 64,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x1cc4",
   "message": "Not washing their hands after peeing. You did not just put down that filthy toilet lid only to afterwards proclaim \"you didn't touch the p*\". Ya filthy.",
   "created_utc": 1696109410,
   "score": 169,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wuhpl",
   "message": "Not all men, but many in my circle, act like know-it-alls. Don’t argue with me about something I do for a living.",
   "created_utc": 1696106659,
   "score": 57,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xv712",
   "message": "For me it’s the contradictory behaviour/wants\n\nE.g. \n\nWeaponising incompetence over things they can’t be bothered doing and treating their partner like a manager, but then acting like women aren’t meant for leadership \n\nBeing angry about small things, punching walls and not sorting through emotions, but then saying women are too emotional (as if anger isn’t an emotion)\n\nGuarding their daughters or partners from other men because “men have the worst intentions”, but then saying “not all men” and not believing anything women say about their experiences\n\nInterrupting and talking over people all the time, but kicking off when they are interrupted by anyone\n\nTouching women they don’t know on the lower back as they pass, but being creeped out if a man does it to them\n\nWanting a wholesome virgin, but also someone who is dynamite in bed akin to someone with experience\n\nFinishing things with a partner to be alone and sort through issues, and then lilypadding onto someone else almost immediately and continuing the cycle of damage instead of going to therapy\n\nWanting a stunning girlfriend, but being surprised and annoyed that it actually takes them time and effort to make that happen\n\nNot wanting children, but then refusing to wear a condom",
   "created_utc": 1696122252,
   "score": 74,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2w4u50",
   "message": "Trying to order me over to your apartment like I’m Uber eats instead of inviting me on an actual date.",
   "created_utc": 1696096807,
   "score": 101,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wzcyg",
   "message": "Don’t hit on me while I’m at work.\n\nI am here working, I am forced to be here on the clock, I am forced to be nice to you.\n\nI can’t tell you how uncomfortable I feel, how inappropriate this is to me, and how I am praying that I never have to see you again in my life.",
   "created_utc": 1696108603,
   "score": 39,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2w0poo",
   "message": "Spitting",
   "created_utc": 1696095245,
   "score": 92,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wzdvn",
   "message": "Dicc pics. \n\nPlease stop ✋🏾",
   "created_utc": 1696108613,
   "score": 26,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xggxs",
   "message": "Do not sort by controversial... it's a fricking Trainwreck down there...",
   "created_utc": 1696115914,
   "score": 174,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x0uj4",
   "message": "Calling men they deem weak \"women\"",
   "created_utc": 1696109205,
   "score": 100,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wmu7v",
   "message": "Seeing me as an opportunity rather than a person. OR expecting me to conform to what they want me to be because we’ve both established we like each other. I cannot be what you want me to be just because you want me to be it.",
   "created_utc": 1696103657,
   "score": 62,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2w3ut6",
   "message": "Pissing across the room and missing the toilet.",
   "created_utc": 1696096428,
   "score": 160,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x58m7",
   "message": "Not wipe their bums enough times after they poo!!!",
   "created_utc": 1696111014,
   "score": 40,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x0t8q",
   "message": "Being creepy on dating apps. I don’t want to go from talking about my pets to “you’re so sexy” and “are you a good kisser”",
   "created_utc": 1696109190,
   "score": 54,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wiluc",
   "message": "Open mouth coughing or sneezing without covering on a plane.  Was traveling with my husband and saw multiple versions of this. My husband finally exclaimed “Who the hell raised these guys?”",
   "created_utc": 1696102014,
   "score": 8,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wwz7p",
   "message": "\u0026gt; feeeeeeeeeeemalees \n\n\u0026gt; putting their hand on me randomly",
   "created_utc": 1696107650,
   "score": 219,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2y2lhp",
   "message": "Getting upset/ aggressive / evil  at women for not wanting to have sex after the first date",
   "created_utc": 1696125492,
   "score": 145,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2whtux",
   "message": "Piling up their dirty clothes next to the hamper or on the floor. Put it in the damn basket!",
   "created_utc": 1696101711,
   "score": 61,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x89y1",
   "message": "Hogging the toilet every morning. People keep saying women take a while to get their makeup or whatnot done. But no one talks about how men are always in the damn toilet. Unless if you're married, or living w one, no one freaking talks about it.\n\nEdit: guys, just find a good spot to have a private time in, talk to your family and have a serious discussion about quiet time. It's actually pretty unhealthy to stay seated on a toilet too much, I'm worried about you lol. In the long run, it'll definitely ruin your insides, talk to your doctors about the ramifications of sitting down on a toilet too long. Sit on a nice chair and chill there. At least you can snack while you're in a room that's not a bathroom.",
   "created_utc": 1696112310,
   "score": 196,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wvu2y",
   "message": "Telling people to smile",
   "created_utc": 1696107192,
   "score": 106,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xinb9",
   "message": "Treating women like a mystery or a prize or really anything other than a fellow human (with flaws and dreams just like you).",
   "created_utc": 1696116883,
   "score": 139,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wsr8q",
   "message": "Catcalling",
   "created_utc": 1696105978,
   "score": 215,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x9aaz",
   "message": "Explaining shit to me that I already know.",
   "created_utc": 1696112747,
   "score": 42,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2vjjnx",
   "message": "Not taking 'no' for an answer, they'll respect a line like 'I have a boyfriend' more than a no. Some imaginary man gets more respect than women do",
   "created_utc": 1696088811,
   "score": 16,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xyev9",
   "message": "Viewing skill at household tasks as inherent to women, but maybe even more, viewing *the ability to notice when tasks need to be done* as inherent to women. The noticing is the hardest part. It's taken me years to kind of be able to notice that things around the house need to be done. \n\nI think that's part of why it really rubs me the wrong way to be told \"just tell/ask him to do chores when they need to be done\". Most of the work for me is just the noticing, and the budgeting of time, and just the thought process of \"this place needs work; gosh, ok, dishes, laundry, that clutter is mostly dishes but also 2 unpaid bills, ok, start the dryer but have the kids shower before using the rest of the hot water on the wash... \" \n\nIt is nice to have someone do the tasks, but even my kids are able to do them when told and I'm still raising them. It's work to delegate and I think that's why moms in the past often just shooshed others out of the kitchen and did things themselves.",
   "created_utc": 1696123636,
   "score": 172,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wrub6",
   "message": "Acting like women are hella dumb and then relying on us for EVERYTHING. I don't blame you for being incompetent, but for God's sake,  humble yourself then.",
   "created_utc": 1696105616,
   "score": 252,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wrzkr",
   "message": "Stop expecting to be mothered. You're a grown ass man, your partner shouldn't have to tell you what needs done. You have eyes, you can see a mess, clean it up. Clean up after yourself and put things where they belong. Don't be a lazy slob. Don't run off with your friends or get on your video games before the chores are done, and sure as hell don't do it instead of parenting the children you've fathered. They're as much your responsibility as hers. Even if she's a stay at home mom, you don't get to just checkout when you're home.",
   "created_utc": 1696105674,
   "score": 134,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xwicz",
   "message": "Pretending you're interested in me and then ghosting/rejecting me after we sleep together. If all you want is a hookup just say that!!!",
   "created_utc": 1696122814,
   "score": 40,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2y43ej",
   "message": "Something I've noticed lately; men bracing both arms against a doorway, effectively blocking people from going through. A few weeks ago a guy a work had me trapped in the closet just talking at me when I was trying to get around him. I kept saying \"Excuse me\" and \"I need to get past you\" but he ignored me and just kept rambling at me. When I complained about it later, he got irritated with me, saying \"I was just talking to you, calm down\" and \"So its a crime now to stand in doorways?\". I don't think he was trying to intimidate me or anything; he was talking about a book he recently read that I had recommended to him and didn't realize he was effectively holding me captive.",
   "created_utc": 1696126179,
   "score": 13,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wvywa",
   "message": "I think a lot of men just don't really see women as people. And I wish they would.",
   "created_utc": 1696107245,
   "score": 250,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xaggm",
   "message": "blaming women for reacting to their disrespect",
   "created_utc": 1696113259,
   "score": 137,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xgblm",
   "message": "Stop. Touching. Me. \n\nJust say excuse me if you need to get past. There is NO reason for your hands to be on my lower back/hips unless we are doing a partnered dance or you ARE my partner. \n\nAnd get out of the damn way walking three across along the footpath bc there’s only one of me, and I’m not moving bc you’re busy being rude. If we collide, we collide, that’s on you",
   "created_utc": 1696115849,
   "score": 167,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xohjq",
   "message": "Saying “smile!”.\n\nNo. Why? How is it affecting you? I don’t know/barely know you. Wtf??",
   "created_utc": 1696119437,
   "score": 163,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xmsmt",
   "message": "Telling us our (negative) feelings are unwarranted or irrational because they don’t understand why we’re upset",
   "created_utc": 1696118687,
   "score": 36,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x1rht",
   "message": "Peeing in anything other than the toilet. Looking up pornographic videos and expecting your wife to do those things. Being asked nicely to do something 20x and ignoring it and then telling wife they are nagging when they got angry on the 21st time.",
   "created_utc": 1696109587,
   "score": 7,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2way1f",
   "message": "Seeing a dirty floor and asking \"babe, do you want me to vacuum\" instead of just doing it. Seeing the dishwasher is filled with clean dishes and asking \"honey, do you want me to take care of that?\" instead of just doing it, telling their friends \"the girlfriend won't let me go to the bar with yall\" so often their friends lowkey start hating me when really I never told him not to go but he likes the easy excuse",
   "created_utc": 1696099086,
   "score": 35,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xqvks",
   "message": "That super creepy handshake where they use their middle finger to \"tickle\" your palm to signify they want to have sex with you. I've had two old men (as patients, while I am their nurse) do this to me and it makes me want to vomit",
   "created_utc": 1696120491,
   "score": 124,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wa2kg",
   "message": "Weaponized incompetence.\n\nIt's one of the current buzzwords and not always applied properly, but my man. Friend. You are absolutely capable of learning what clothes size your kid has, when your mum's birthday is, and what to do when the sink is full of dishes.\n\n\"I don't see the mess!\" and \"Just tell me and I'll do it!\" infuriate me. Stop it.",
   "created_utc": 1696098772,
   "score": 108,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x1lj3",
   "message": "Assuming the bare minimum of social politeness is flirting.",
   "created_utc": 1696109517,
   "score": 176,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2x94sl",
   "message": "I’m surprised that doing almost all the murders isn’t higher on this list.",
   "created_utc": 1696112679,
   "score": 177,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xdph2",
   "message": "Shaving over the sink and refusing to wipe it up. It’s not that hard!!!",
   "created_utc": 1696114679,
   "score": 33,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wfxvu",
   "message": "for the love of god just sit to pee if you can’t aim into the toilet bowl.",
   "created_utc": 1696100985,
   "score": 111,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wlt35",
   "message": "Interrupt",
   "created_utc": 1696103256,
   "score": 241,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2y7805",
   "message": "Mistaking my kindness for flirting. It’s literally part of my job to be helpful. It doesn’t mean I want to bang you.",
   "created_utc": 1696127629,
   "score": 24,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2wovxr",
   "message": "Pretending to know every band I mention. My ex did this constantly. It was to the point I started making things up just to mess with him. It was the opposite of impressive. Not to be all 'name 3 songs' but if I list off several disparate, obscure artists every so often and you claim to know ALL of them all the time, yet can't name any album or song or anything that you like about them, it's gonna get on my nerves. If someone shows me a cool band I thank them and go check them out. I don't pretend to know everything every time",
   "created_utc": 1696104450,
   "score": 209,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2vjgnd",
   "message": "Invalidating our experiences",
   "created_utc": 1696088779,
   "score": 15,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xqepc",
   "message": "I get overtalked in meetings and I am in no way quiet or shy or soft spoken.   I have had men restate what I said in a loud voice, and I just last Friday had a man incorrectly explain to another man, ( in a 3 person meeting just me and the two men, that was expressly called for me to explain something that I specialize in) something I had just said.  Like as an aside he explained like he was correcting me to the other guy.  I said, no, I am absolutely sure that I am right, and corrected him.  \n\nHow in the world are they having a side meeting between themselves about something they specifically called a meeting to ask me about.   It's like they couldn't stand to let me use my expertise.  This is in the IT space.",
   "created_utc": 1696120282,
   "score": 47,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2xbi4k",
   "message": "listening to Andrew Tate",
   "created_utc": 1696113710,
   "score": 209,
   "submission_id": "16wa47t"
  },
  {
   "comment_id": "k2ymjin",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16wa47t"
  }
 ]
}