{
 "submission_id": "16wceji",
 "title": "What ruined your childhood?",
 "selftext": "",
 "created_utc": 1696094373,
 "permalink": "/r/AskReddit/comments/16wceji/what_ruined_your_childhood/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/16wceji/what_ruined_your_childhood/",
 "comments": [
  {
   "comment_id": "k2wb2b8",
   "message": "My parents were killed in a car accident on Christmas Day when I was young. I survived, obvs, but I can clearly remember the sound of everything settling afterward, and the steady drip drip of my mother bleeding out and watching the blood pool grow. I heard my dad take his last breath while mom died in surgery. \n\nI also watched the first people to stop and help riffle through our belongings, taking the rings off Mom's fingers, taking Dad's watch, and going through their wallets and removing cash/credit cards. While I was laying injured in the back seat they just winked at me, seriously they winked, and kept on stealing the belongings of a dead man and his dying wife in front of their child. \n\nThen they left us there.  It was a few more minutes before someone else came upon the accident and jumped into action and got first responders rolling, and got me out and sat trying to comfort me while I was injured and in shock.\n\nThanks to a lot of miscommunication (pre-digital age) in spite of a large family,  I ended up in the custody of the state and lost in the system until the age of 18. This was before they gave assistance and support to foster kids, so the day I turned 18, they literally opened the door to exit hell, and adios, you're on your own.\n\nYup, ruined my childhood, Christmas and my life all in one drunk driver.  Who lived.",
   "created_utc": 1696099129,
   "score": 35,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2vyo10",
   "message": "Had a lot of childhood trauma which forced me to have to grow up quicker than I would have.\n\nSo I feel I missed quite a bit of actually being a kid.",
   "created_utc": 1696094495,
   "score": 42,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w0v2n",
   "message": "Being brought up to be a people pleaser. Leading me to get into several abusive relationships. That lead me to the mess I'm in today. \n\nI don't think my parents understand their part to play in all that.\n\nMy dad said to me today that I made decisions, and that's my fault. My abuse was my own fault.",
   "created_utc": 1696095300,
   "score": 250,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w1qnp",
   "message": "Asshole step-dad that ruined my confidence and gave me ptsd",
   "created_utc": 1696095623,
   "score": 65,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w5dx9",
   "message": "Ehhh. Hate restating this. When I was 7-9 , a  PoS kid who was 3 years older sexually abused me and scared me with blackmail that he would tell that I instigated the assault. And I was so young I was scared he would do that. I wish only horrible shit on that bastard.\nFucked up my childhood, and honestly me 40+ years later.",
   "created_utc": 1696097010,
   "score": 52,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w5bgr",
   "message": "Adults “joking” about how fat or skinny I was, how tall I was for my age, my feet were “too big”, my eyes were “massive”,  I wasn’t athletic like my siblings, not as talented as them either. Gave up on trying. Hated myself ever since.",
   "created_utc": 1696096985,
   "score": 92,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wf8qh",
   "message": "My father committed suicide when I was 4. Fuckin sucked.",
   "created_utc": 1696100713,
   "score": 35,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wimd2",
   "message": "When my parents started taking in foster kids.\n\nNo hate to the foster system, and of course I understand kids need homes, but as a kid one day having your room, classmates, home, parents be shared with rotating doors of strangers who are cruel and abusive to you as they pass through honestly completely and abruptly ended childhood for me.",
   "created_utc": 1696102019,
   "score": 39,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w38ar",
   "message": "Got throw into a van in the middle of the night and taken two states away from my family and dropped off at some remote \"school\" for assholes. Wouldn't recommend it.",
   "created_utc": 1696096189,
   "score": 95,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w28vb",
   "message": "Being my parent's 12th kid who they had only because of their religion, they also both had depression and my father had anger issues.\nI grew up extremely poor and got diagnosed as depressed at 9.\nBeing brought up thinking that I was evil/disgusting and having to suppress my true self as a gay man.\n\nJust the usual 🤷‍♂️",
   "created_utc": 1696095814,
   "score": 110,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w4byp",
   "message": "Grew up with my grandparents. Dad nowhere to be found and my mom showed up once in a while. My grandparents retired and my mom met this guy. He buys the house I grew up in and kicks us out within a month. Devastated me. That house was everything to me\nHaven't driven down that road to see it since it happened in the early 80's.",
   "created_utc": 1696096614,
   "score": 47,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2vyjhs",
   "message": "Religious controlling parents",
   "created_utc": 1696094450,
   "score": 118,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2vyie4",
   "message": "the internet and meeting certain people",
   "created_utc": 1696094440,
   "score": 22,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w8bb6",
   "message": "ADHD diagnosis - I was a 90s kid and it was handled VERY differently then.",
   "created_utc": 1696098118,
   "score": 22,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wnmq6",
   "message": "Grandmother severely abusive alcoholic. I was 14 and the term now is “ throw away” kid. Mom died shot in the stomach and dumped in the bathroom. Bled out in front of me. I held her hand. Many lessons learned very well up to now at 56. Came to terms with many of the issues. Thankfully doing better. 🍄This has helped- alot. Suicidal ideations/ plans STOPPED overnight. Overnight. All is the way it is suppose to be. Namaste one and all. 🙏🏼",
   "created_utc": 1696103963,
   "score": 21,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wr2ab",
   "message": "Bullying.\n\nYears of therapy and I'll never be the same.",
   "created_utc": 1696105308,
   "score": 18,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w9nht",
   "message": "My mom being an abusive alcoholic and my biological dad being killed by a drunk driver when I was 9.  \n\nFortunately, I have an excellent former stepdad that I call my dad because he was there for me when my dad died and hasn’t left my side. I was terrified when him and my mom divorced I would never see him again but I’m 40 now and he’s still my dad.  I see him next weekend and I can’t wait",
   "created_utc": 1696098622,
   "score": 17,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w8q1p",
   "message": "Poverty, sexual abuse, neglect, verbal abuse, my mother's anxiety, extensive bullying, my mother's hoarding...",
   "created_utc": 1696098273,
   "score": 34,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w1y71",
   "message": "My parents",
   "created_utc": 1696095701,
   "score": 14,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2watjj",
   "message": "Munchausen Syndrome by Proxy, 13 years in foster care away from my brothers and sister, 38 now still think about it every second",
   "created_utc": 1696099041,
   "score": 14,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w1slh",
   "message": "Being born.",
   "created_utc": 1696095643,
   "score": 28,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wt8v3",
   "message": "My father slapping me on my head when I didn't do what he expected.  Him picking me up by my head and shaking me when I didn't do what he expected.    He shaved my head with rusty shavers that hurt and pulled my hair.   He yelled alot. \n\nSo I fear haircuts. I hate loud people and aggressive people.   I don't like people touching me ever.",
   "created_utc": 1696106170,
   "score": 14,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w0ezs",
   "message": "Growing up.😞",
   "created_utc": 1696095134,
   "score": 12,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wd7qv",
   "message": "Bullying and mean kids.  I couldn’t understand it and never tried to protect myself.  Still living with the daily anxiety 30 years later",
   "created_utc": 1696099926,
   "score": 11,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w3rqo",
   "message": "Moved every couple years, had a hard time maintaining friendships(pre internet), moving wouldn't have been a big deal but moving that often was imo detrimental.",
   "created_utc": 1696096395,
   "score": 12,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w6zbb",
   "message": "My mother becoming disabled due to a car accident while she was getting my 8th birthday cake",
   "created_utc": 1696097606,
   "score": 9,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wowbh",
   "message": "My sixth grade social studies teacher telling every boy in his class we were all going to die in Iraq during the first gulf war.",
   "created_utc": 1696104454,
   "score": 9,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2vzthu",
   "message": "My narcissistic uncle... he destroyed my childhood life... abusive and sadistic person...",
   "created_utc": 1696094912,
   "score": 13,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w214v",
   "message": "Verbal and emotionally abusive household. My \"friends\" weren't any better, I was sexually assaulted at 6 by a \"friend\"",
   "created_utc": 1696095733,
   "score": 14,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wb831",
   "message": "Bullying and abusive teachers",
   "created_utc": 1696099186,
   "score": 16,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w173s",
   "message": "Funny answer: Accidentally finding porn while searching images for my favorite cartoon at the time. \"Safe search\" wasn't invented yet so I saw way more than I ever wanted to as a 7 year old in 2002 lmao. Serious answer: Probably the abuse",
   "created_utc": 1696095423,
   "score": 13,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wdwz4",
   "message": "Alcoholism. My dad is a fun drunk, but it got so bad my mom divorced him, then he stopped paying the electric bill, got a DUI, stopped coming home at night, stopped buying groceries, got fired, stopped paying rent \u0026amp; got evicted, found a new home, got evicted again and became homeless, and almost killed himself via alcohol poisoning. During all of this I was left to take care of my younger siblings and keep him safe when he was too drunk to be a parent. He’s sober now, but it took 7 years of escalation and my siblings completely cutting him off for him to finally quit.",
   "created_utc": 1696100193,
   "score": 14,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w7tuc",
   "message": "depression",
   "created_utc": 1696097933,
   "score": 7,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w7nx2",
   "message": "Boarding school at the age of five.  It was cold, gray and had a smell I absolutely hated.  I was lonely and homesick most of the time.  \n\nI was son of black sheep of the family; and I thought I was close to them.\n\nThese two aspects ruined my childhood.  Took me a while to understand.  And it is okay.  \n\nI have gotten out of that toxicity and made my own life.  I have accepted and forgiven myself.  I love life for its curve balls.",
   "created_utc": 1696097869,
   "score": 7,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wau19",
   "message": "Over protective parents. They never left me alone.",
   "created_utc": 1696099045,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wh5dr",
   "message": "A shitty parent",
   "created_utc": 1696101451,
   "score": 7,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2whdsv",
   "message": "So I am brown skinned and in my family everyone is mostly fair so they made fun of me for my skin colour called me burnt charcoal. They told me that I was not as good as my fair skinned cousin's. So i was very insecure about my skin colour now i embrace it and I love it.",
   "created_utc": 1696101540,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2whj51",
   "message": "Divorced parents fighting. 3 years old.\nDeath. Not being taught about it.\nAlcoholism. Mother and Father.\nRape at 14.\n\nEw. Never wrote it down.",
   "created_utc": 1696101597,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wi6rl",
   "message": "my parents",
   "created_utc": 1696101851,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wi7fq",
   "message": "My family",
   "created_utc": 1696101858,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wifk7",
   "message": "My parents",
   "created_utc": 1696101944,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wq09j",
   "message": "An abusive home life",
   "created_utc": 1696104895,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wq61f",
   "message": "Parents that broke my self-confidence and taught me that I should always be kind and be a people-pleaser. Now, those relationship were so toxic, I had to break them up and don't have any friends anymore.",
   "created_utc": 1696104960,
   "score": 7,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wq6lf",
   "message": "The emotional neglect of my parents. Mainly my mother",
   "created_utc": 1696104966,
   "score": 7,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wqinc",
   "message": "The Catholic Church",
   "created_utc": 1696105095,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wqq23",
   "message": "Parents divorce forced me to raise my siblings. I missed out on my own childhood so they could have theirs",
   "created_utc": 1696105175,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wrg4p",
   "message": "CSA. Multiple perps. No justice whatsoever.",
   "created_utc": 1696105459,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2waarq",
   "message": "My dad's drinking.",
   "created_utc": 1696098852,
   "score": 11,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wmm4a",
   "message": "Being denied an autism test when the doctors who delivered me requested it to my parents. Said parents (mostly my mother) not only kept it from me for nearly 20 years but subjected me and my also disabled sibling to certain methods of treatment that I recognize as incredibly gross ableism, implicit or explicit. \n\nI'm making arrangements to get tested because I've suspected that I may be on the spectrum for a year now, but if I already didn't trust my parents with any bone in my body, I definitely don't now.",
   "created_utc": 1696103570,
   "score": 10,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w19dz",
   "message": "poverty and trauma",
   "created_utc": 1696095446,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w7n6n",
   "message": "An emotionally manipulative mother and absent father.",
   "created_utc": 1696097861,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w88jm",
   "message": "Epilepsy.",
   "created_utc": 1696098089,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wcfr8",
   "message": "Getting bullied pretty much everywhere I went. Pre-school, all classes of actual school, after-school daycare, even in bloody university a group of girls wanted to get me.",
   "created_utc": 1696099636,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2we83h",
   "message": "My mom ALWAYS choosing whatever boyfriend she was with at the time over me.. constantly kicking me out and crying all the time to people wondering why I don’t love her. Then yelling at me “ I’m your mother you need to respect me… when I die you are going to regret what you said”. all the time now that I’m able to express how I feel.. when I was a kid she used to always tell me I never had a choice and she used to pinch me to shut up.",
   "created_utc": 1696100313,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2weyb4",
   "message": "Drugs.\n\nAddicted parents will do a number on a kid.",
   "created_utc": 1696100601,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wfh6a",
   "message": "The internet, bullies, school system.",
   "created_utc": 1696100804,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wfuwn",
   "message": "Crack",
   "created_utc": 1696100953,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wko88",
   "message": "Bullying and constantly fighting parents that just don't fit each other",
   "created_utc": 1696102812,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wpz4z",
   "message": "Poverty + abusive parents",
   "created_utc": 1696104882,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w3ujy",
   "message": "Falling in an ice fishing hole when I was about 10",
   "created_utc": 1696096425,
   "score": 11,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wj5ey",
   "message": "My father was very much \"I hate children you should be a full grown adult by now\"\n\nNow that I am a full grown adult he says \"just bc you are an adult doesn't mean you can't act like a child and have fun\"\n\nThx dad.",
   "created_utc": 1696102230,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w8s6s",
   "message": "My earliest memory I can recall was my mom's face covered in blood due to my awful dad. So yeah, I sometimes joke that I could hold the world record of being traumatise speed run",
   "created_utc": 1696098295,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wc3s5",
   "message": "Divorce",
   "created_utc": 1696099512,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wdz91",
   "message": "My adulthood and a bunch of shit that would take way too long to get into",
   "created_utc": 1696100218,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2webcl",
   "message": "My parents",
   "created_utc": 1696100347,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wg6wt",
   "message": "Turning into an adult",
   "created_utc": 1696101084,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wikgj",
   "message": "My adoptive parents who probably never should have raised kids.",
   "created_utc": 1696101999,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wjzda",
   "message": "Domestic violence and more domestic violence. And now my father doesn’t want to be held accountable for it.\n\nHe even says that I have to stop living in the past and that I should grow up. He almost killed me numerous times.",
   "created_utc": 1696102549,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wk85m",
   "message": "Alcoholic mother, absent father. Sexual trauma. Being viciously bullied by kids at school cause I was fat.",
   "created_utc": 1696102641,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wkvos",
   "message": "My dad",
   "created_utc": 1696102892,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wlf89",
   "message": "Bullying. I was a tall yet chubby kid and having to endure people calling me a pig, fatass, ballon etc.\n\nGood thing is that I basically turned into an asshole myself so it's pretty hard to bully me now.",
   "created_utc": 1696103104,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wom9w",
   "message": "My dad",
   "created_utc": 1696104345,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wplok",
   "message": "My adulthood.",
   "created_utc": 1696104734,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wquo4",
   "message": "Nothing my childhood was pretty fucking awesome, got worse as soon as I attended a government run college.",
   "created_utc": 1696105226,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wr976",
   "message": "My mother and sister. They didn't really ruin it, but they were definitely a fly in the ointment.",
   "created_utc": 1696105383,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wrdtl",
   "message": "My father",
   "created_utc": 1696105435,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wrt6q",
   "message": "raped, drug addict parents.",
   "created_utc": 1696105603,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wtn6l",
   "message": "Being incorrectly circumcised. Or as I call it ‘male genital mutilation’. 90% of my shaft skin was removed and I didn’t realise until I was 23 that all of my problems and insecurities stemmed from this act that was done to me when I wasn’t even conscious yet. \n\nI look back and realise how my world view was oddly shaped \u0026amp; I couldn’t quite put a finger on what was ‘wrong’ with me. Had 3 corrective surgeries these past 2 years and beat depression so I’ve come out not half bad. But yeah, my childhood sucked because I hid away from a lot of things out of insecurity of people noticing I was abnormal for a male. Nope, my mother never picked up on it for some reason. Stopped looking for answered that don’t exist now \u0026amp; just live life with peace looking forward",
   "created_utc": 1696106324,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wuept",
   "message": "My dad being verbally and emotionally abusive. I'll have issues my entire life, even though he got anger management, and we patched things up when I was 21. He died when I was 24. I'm 43.",
   "created_utc": 1696106627,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wuyod",
   "message": "Dad's porn stash",
   "created_utc": 1696106847,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w8lkb",
   "message": "Poverty and having to move repeatedly into new school districts.",
   "created_utc": 1696098225,
   "score": 7,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wb69b",
   "message": "My mom dying when I was 6 certainly didn’t help.",
   "created_utc": 1696099168,
   "score": 6,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wr1u6",
   "message": "Grown men who couldn't keep their hands to themselves",
   "created_utc": 1696105304,
   "score": 7,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w5401",
   "message": "My parents",
   "created_utc": 1696096911,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wb0c7",
   "message": "Me (too shy to do shit, didn't have confidence, anxious, afraid, lost opportunities to experience stuff a normal kid should've, isolated and didn't socialize)\n\nAlso my Father, pretty much just worsened what I felt ever since he left the family of 27 years for another woman.",
   "created_utc": 1696099110,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wd0yw",
   "message": "Finding out you were a foster child and lied to about the entire reason a family took you in and the event that led to me being brought into this world",
   "created_utc": 1696099856,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wdwcc",
   "message": "Unsupervised exposition to the internet, I mean, some stuff in my head is fucked up (insensitive about watching irl gore) but then I developed some odd sexual fetishes... but being asexual and a digital artist with OCs saved me and others of me being a criminal (aka. Hurting others)",
   "created_utc": 1696100186,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wevhs",
   "message": "Being molested by my brother",
   "created_utc": 1696100569,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wfpuo",
   "message": "Growing up to become and adult!",
   "created_utc": 1696100898,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wg1uu",
   "message": "My dumbass parents who didn't know the first thing about parenting.",
   "created_utc": 1696101029,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2whj98",
   "message": "My brother.",
   "created_utc": 1696101598,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wicfr",
   "message": "My parent's undiagnosed mental problems. Having to care for my younger brother and sister. Not that I hold anything against them it just made me grow up too fast.",
   "created_utc": 1696101911,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wij5b",
   "message": "Anxiety disorder starting from a young age.",
   "created_utc": 1696101984,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wijuo",
   "message": "My father. Substance abuse and his own trauma from childhood brought out his worst and I took the bulk of it. Reconciled a few years ago when I began to see that the years of fear, and self hatred I was unlearning was something he never had the opportunity to do. He was a good man. Just damaged. Passed at 67 from pancreatic cancer yesterday evening. I’m feeling so many god damn emotions right now but that fact that he knew I forgave him for what he did brings me peace. Makes me feel like I can finally move on from it all.",
   "created_utc": 1696101992,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wiod6",
   "message": "step dad who was an alcoholic abusive POS",
   "created_utc": 1696102040,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wjarb",
   "message": "Being prescribed 50mg of the early Adderall in the 4th grade when I was like maybe 75lbs... I always felt like I did something wrong, like it was something that eventually after taking lots of meds I could eventually become better. While I won't discount the drugs completely, for me it probably was one of the worst things that has ever happened to me. Years and years of depression which was followed by \"well let's put him on more drugs to counteract the drugs we are giving.\" Which just exasperated the issues. By the time I was old enough to realize this wasn't helping and articulate to my parents this they had mostly drank the kool-aid. Thank goodness my mom respected my opinion enough that after many years of telling her I hated it, she let me stop taking it. I can't possibly imagine my life continuing had I continued to take these mind altering drugs. Just like any drug, they have different effects on varying humans and again it's not that I'm completely against them, but for myself I am definitely against them. They did nothing for me except cause extreme depression and anxiety, and I've been through all the various adhd medications all of them in their own way would cause issues. While I won't say I'm perfect now by anymeans, understanding the difference in my brain chemistry versus \"a normal\" one was what really has made the biggest difference. As while I can't control it, I am aware of my short comings and if I remind myself of that to an extent I can control it. \n\n4chan... discovered when I was like 12. I don't use now... but as a kid it was like such a wild place that you would stumble upon the craziest shit a kid shouldn't see. \n\nThen my mom getting cancer when I was like 16 and watching her die for years really solidified everything as the world being such a dark place.",
   "created_utc": 1696102288,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wkb06",
   "message": "My dad got cancer when I was 15 and died when I was 17. \n\nGoing from a kid to a caretaker to the man of the house so quick is really tough on a kid. I never truly grieved his passing because I always felt like I had to be strong and grow up. I think the lack of grieving led to my alcohol abuse. But that's my fault and nobody elses. \n\nMy mom is still with me, I never even moved out. Always just worked amd cared for her, now her health is declining and I'm kinda getting those flash backs",
   "created_utc": 1696102671,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wkoqh",
   "message": "The need of beeing so independent.",
   "created_utc": 1696102818,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wkxzm",
   "message": "Poverty, trauma, violence, racism...growing up in the projects was not pleasant.",
   "created_utc": 1696102917,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wlv8l",
   "message": "My dad serving 22 year in the British army, I moved around every 2 years, now at the age of 31 I don't have any \"mates\"\n\nI was chatting to my manager on Friday, he said to me, you like a good chat when at work, I said to him the only people I talk to outside of work is my wife and 4 year old child, so when I'm at work I have good laugh and chat with the lads, he wasn't criticising me, he was just curious",
   "created_utc": 1696103280,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wm9w5",
   "message": "Puberty.  \n\nPuberty ran my childhood over like a fat man at an all you can eat buffet.",
   "created_utc": 1696103440,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wnjtb",
   "message": "My parents were actual geniuses and when I was young I was pretty smart so those expectations kept rising and rising and after the age of 12-13ish I lost all of my emotional attachment to my parents and a lot of other people I knew. Every time I was unhappy, they just threw money at my face but I wasn’t allowed to spend said money and that money was still theirs. Thankfully I am not a snowflake and their comments about my weight didn’t make any difference to me else this list would be twice as long hahaha and I’m a very logical person so I actually started exercising when there was a need for it. \n\nEdit: my mother wasn’t really too bad but she didn’t really help me but my dad is fucking awful.\nEdit 2: I still live with my parents because I’m still a minor",
   "created_utc": 1696103932,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2woyf4",
   "message": "Horrific childhood trauma and I was the oldest.",
   "created_utc": 1696104477,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wp2n1",
   "message": "My childhood best friend’s sister getting leukemia. I was there when she was rushed to the hospital. She was vomiting blood two feet away from me. Shit like that no child should see, and cancer is nothing any child should ever endure. I don’t think I realized how much it had affected me until adulthood. \n\nShe beat it though, and as far as I know, she’s still alive. Hope she’s doing alright.",
   "created_utc": 1696104525,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wp9a7",
   "message": "My mom dying when I was 5. \n\nIt wasn’t not having a mom that ruined it, but more so everyone in the family went their own separate ways afterwards.",
   "created_utc": 1696104597,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wpnhs",
   "message": "Grooming and my dad arguing with me for the slightest thing",
   "created_utc": 1696104754,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wpy5a",
   "message": "My mother dying when I was 2",
   "created_utc": 1696104872,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wqb4d",
   "message": "Financial issues when it’s actually needed :,)",
   "created_utc": 1696105015,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wrh6v",
   "message": "The invention of f*cking frozen fish sticks.",
   "created_utc": 1696105471,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wsxxd",
   "message": " Being kidnapped.",
   "created_utc": 1696106051,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wtqfq",
   "message": "Divorce",
   "created_utc": 1696106359,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wypsb",
   "message": "Mom was terminally ill.",
   "created_utc": 1696108343,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2x1d7b",
   "message": "moving to america and at 10 and seeing it was never how it was portrayed in the movies. this thing of a country is one giant shithole.",
   "created_utc": 1696109420,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2x9pwn",
   "message": "narcissistic mother.",
   "created_utc": 1696112935,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2xa43y",
   "message": "Siblings",
   "created_utc": 1696113110,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2xd4a5",
   "message": "Irresponsible mother, lack of protection, moving around a lot, mom choosing horrible, emotionally unavailable mom, death of my dad, lack of stability and rules in the house and many other things tbh",
   "created_utc": 1696114418,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2xdn0s",
   "message": "The woman who gave birth to me",
   "created_utc": 1696114649,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wtg1z",
   "message": "Being the golden child and then becoming disabled and losing that, for sure",
   "created_utc": 1696106248,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w8quf",
   "message": "Having to visit relatives. Having to go to church. Kids at school being bullies. Me being gay. It was a lot of depression.",
   "created_utc": 1696098281,
   "score": 4,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wense",
   "message": "Being born?",
   "created_utc": 1696100483,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wesz8",
   "message": "9/11",
   "created_utc": 1696100541,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wqj3t",
   "message": "my barhopping whore of an absentee mother marrying, and abandoning me with, my abusive stepdad and half sister.\n\nhe wasn't prepared for children, and she didn't want to be a parent.",
   "created_utc": 1696105100,
   "score": 3,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wsg5t",
   "message": "My childhood changed for the worse when i was 8 years old. My parents had rules that made no sense and my stepdad was a monster. I was not allowed to play video games most of the time, not even if i got a new game for my birthday. I was excluded from many family events and was not allowed to hang out with friends either. I wasn't allowed to go on most field trips and i couldn't go to the school dance. My stepdad would often get drunk and beat me on a regular basis using any excuse he could think of. I missed a spot when cleaning? I got beat. Couldn't finish my food? I was force fed and then beaten. I said a bad word? He beat me and put dish soap in my mouth and told me if i spilled any over the next 2 hours, i would get beat again. I didn't clean my room? I was strangled, thrown around like a ragdoll and nearly suffocated. I tried everything i could since they got married to sabotage my parents marriage, spreading rumors, getting child protective services involved, beating him myself, and it was all in vain",
   "created_utc": 1696105856,
   "score": 5,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w0ibm",
   "message": "A town that has nothing but school and empty grounds to play cricket … and temples !",
   "created_utc": 1696095168,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w163s",
   "message": "My dad.",
   "created_utc": 1696095413,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w58nf",
   "message": "Trauma",
   "created_utc": 1696096958,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w7a49",
   "message": "Having too many birthdays.",
   "created_utc": 1696097721,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w7xae",
   "message": "Finding out my father was addicted to cocaine.",
   "created_utc": 1696097970,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w84s2",
   "message": "My future.",
   "created_utc": 1696098050,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2w88tg",
   "message": "Joe Carter",
   "created_utc": 1696098092,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2we5s0",
   "message": "Ooof",
   "created_utc": 1696100288,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wet3z",
   "message": "The physical and mental abuse",
   "created_utc": 1696100542,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wiqvw",
   "message": "bullies.",
   "created_utc": 1696102068,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wk0tw",
   "message": "My twin sister. I found out she secretly has hated me our whole life and had tried to boycott my social life among other things. Nothing ruins your childhood quite like not knowing if anything that happened was a lie or not. I thought we were best friends.",
   "created_utc": 1696102565,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wln68",
   "message": "Broken home and bullies. Destroyed my self-esteem. It's the sort of thing you take in to adulthood and it affects the rest of your life.",
   "created_utc": 1696103190,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wmk6t",
   "message": "In my house, the butter was always ice cold. Could not spread that shit on anything.",
   "created_utc": 1696103550,
   "score": 2,
   "submission_id": "16wceji"
  },
  {
   "comment_id": "k2wu67i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16wceji"
  }
 ]
}