{
 "submission_id": "16whpvh",
 "title": "What's your worst secret that you are holding?",
 "selftext": "",
 "created_utc": 1696107597,
 "permalink": "/r/AskReddit/comments/16whpvh/whats_your_worst_secret_that_you_are_holding/",
 "score": 197,
 "url": "https://www.reddit.com/r/AskReddit/comments/16whpvh/whats_your_worst_secret_that_you_are_holding/",
 "comments": [
  {
   "comment_id": "k2x601z",
   "message": "My greatest fear is becoming my father. He's selfish, manipulative, narcissistic, and can never admit when he's wrong.\n\nEvery once in a while I see a flash of him in myself and it eats away at me for days.",
   "created_utc": 1696111333,
   "score": 58,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xf8a5",
   "message": "I lied about being chased by a Turkey when I was around 4 years old on a school trip to a farm, and they thought it was hilarious.\n\nI am now in my 30s and my parents still bring up that story as a funny anecdote from my childhood.\n\nThey still don’t know that it never happened.",
   "created_utc": 1696115359,
   "score": 125,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x5rg9",
   "message": "Recovering gambling addict and none of my friends know I have a problem. They haven’t caught on that I bail every time they want to go anywhere near a casino.",
   "created_utc": 1696111233,
   "score": 115,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x4ir4",
   "message": "As an adult, \nI feel that I wasted my life.\nI deliberately held myself back in life ,out of fear of failure.\nNow I'm too old to reverse any of it, or reinvent myself for the last time.\nThere's just no time.\n:(",
   "created_utc": 1696110719,
   "score": 60,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x6lq5",
   "message": "I've been sitting on this for years and it drives me crazy. I know who did the original 'How do you become a mermaid' viral post on Yahoo Ask. It was a weird girl I went to school with who told everyone she burnt down a trailer park with a magical fireball. I'll never sell her out, especially now as an adult who understands she was a kid with a lot of problems, but it's not easy to possess these dark knowledges and do nothing with them. It's stretched my moral compass to the limit.",
   "created_utc": 1696111590,
   "score": 89,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x6h28",
   "message": "My aunt's brother-in-law tried to kiss me when I was 16. My brother was 7 years old and stopped him. He doesn't remember, but I do.",
   "created_utc": 1696111534,
   "score": 71,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xf405",
   "message": "I'm awaiting my possible arrest for fraud.",
   "created_utc": 1696115307,
   "score": 45,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x5tt6",
   "message": "My boyfriend went on a business trip. His mom went to his house and cleaned. She changed the sheets on the bed and organized everything. She arranged everything beautifully, including the bottles of lube! We now have a running joke about how she is monitoring the levels and will restock as needed. He is 55, I am 48. She is 80.",
   "created_utc": 1696111260,
   "score": 88,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x62u9",
   "message": "Per my recruiter's instruction, I hid my mental health history to get into the military. Two weeks in, I realized I had made a HUGE mistake in enlisting, and the military was definitely not for me. I told my Staff Sergeant about this so that I would be discharged.",
   "created_utc": 1696111366,
   "score": 75,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x8coi",
   "message": "I’m very afraid of other people so I overcompensate by trying to be as interesting/funny as possible but I can’t tell how well it works.",
   "created_utc": 1696112342,
   "score": 31,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x5rkc",
   "message": "In Japan, heart surgeon. Number one. Steady hand. One day, yakuza boss need new heart. I do operation. But, mistake! Yakuza boss die. Yakuza very mad. I hide in fishing boat, come to America. No English, no food, no money.  \n\nMy big secret: I kill yakuza boss on purpose. I good surgeon. The best!",
   "created_utc": 1696111234,
   "score": 70,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xeh7m",
   "message": "I was so desperate for some father figure attention I when I was young. I sought out a child sex offender",
   "created_utc": 1696115028,
   "score": 24,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x43os",
   "message": "I farted and blamed our old Labrador, who does have a gas problem. My wife is suspicious but can't be 100% certain it was me as we were having a few other couples over for drinks.",
   "created_utc": 1696110546,
   "score": 79,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x96lq",
   "message": "I stole a 50¢ mini globe when I was a kid and I told my parents I found it.  I was obsessed with globes",
   "created_utc": 1696112701,
   "score": 23,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xifqc",
   "message": "Ive become so accustomed to porn, which then became very specific kinks that I fear intimacy with another woman. The usual \"sexy time\"  kind of stuff doesnt do it at all for me anymore.",
   "created_utc": 1696116786,
   "score": 20,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xbikl",
   "message": "My sister had her first child at 26 weeks. The baby (Emily) had a bleed on the brain and at the time the doctor said it's very likely she'll be disabled. \n\nDriving my mum home from the hospital after a visit a few weeks later she said \"I hope Emily dies, she's going to ruin your sister's life\"\n\nI never told my sister as it would break her heart and their relationship but I don't talk to that cunt anymore (there are additional reasons but that's a big one). And my sister resents me for my nonexistent relationship with our mother.",
   "created_utc": 1696113716,
   "score": 71,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xgq9o",
   "message": "That I hate my best friends partner.",
   "created_utc": 1696116025,
   "score": 16,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xp5qt",
   "message": "That I have the potential to be extremely violent, and the only thing holding me back might very well be my mantra that anyone worth harming or killing, isn't worth the jail time.\n\nThere's a very fine line between myself and violent criminals, and I struggle with that. I've had a similar upbringing to several serial killers.\n\nI studied psychology hoping to give myself some peace of mind by finding out why I can't bring myself to hurt others, despite having so much fucking rage, and such an unfair childhood. I'm still no closer to the answer.\n\nI'm terrified that one of these days I'm going to snap like a cheap elastic band.",
   "created_utc": 1696119732,
   "score": 18,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x4itm",
   "message": "When I use the scroll feature on Reddit Mobile, sometimes I accidentally downvote people, but then I don't correct it.",
   "created_utc": 1696110720,
   "score": 163,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x5iaw",
   "message": "[deleted]",
   "created_utc": 1696111125,
   "score": 12,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xpnf9",
   "message": "I don’t know how much of a secret it is, but I’m dealing with some of the strongest off myself thoughts I’ve ever dealt with. \nI’m safe. \nThey just won’t stop.",
   "created_utc": 1696119948,
   "score": 12,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2wzm73",
   "message": "Nice try, FBI.",
   "created_utc": 1696108703,
   "score": 55,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x6vax",
   "message": "I wear my wife panties when she's at work",
   "created_utc": 1696111704,
   "score": 26,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xb82j",
   "message": "I'm sitting on quite a few thanks to attorney-client privilege. Unfortunately, I like my job and want to maintain my career and I won't divulge, even anonymously here. But one thing I will say is that I will never take on a friend or other close acquaintance as a client ever again. I've lost respect and ended friendships with a handful of people over the years due to things they needed to disclose to me.",
   "created_utc": 1696113585,
   "score": 30,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xmjgs",
   "message": "I shot a man in Reno, just to watch him die",
   "created_utc": 1696118573,
   "score": 18,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xhd2i",
   "message": "I saw one of my aunts (she was a teenager at the time) banging a random guy on my grandparents' house once.\n\nI was a little kid, so I just ran away, and they didn't see me.",
   "created_utc": 1696116298,
   "score": 10,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x31lo",
   "message": "I didn't think the final season of Game of Thrones was all that terrible (but if I say that aloud near my friends I'd be ritually sacrificed to the Seven)",
   "created_utc": 1696110114,
   "score": 33,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x33z0",
   "message": "Secretly, I’m a little bit naive.",
   "created_utc": 1696110141,
   "score": 23,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x3lbe",
   "message": "I stole 2 grapes once from the grocery store.",
   "created_utc": 1696110338,
   "score": 23,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x5sbg",
   "message": "My first sex was with one of my childhood female friends. This is coming from a female. We had sex a couple times through sleepovers and when she came over my house. My family didn’t know about it because we hid that. Ever since we never spoke again. Ive been only dating men. But still have that inner gay in me hidden.",
   "created_utc": 1696111243,
   "score": 28,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x9x7x",
   "message": "I’ve been dating a girl for a little over a month that I DO like, and she really really likes me. I miss and think about my ex every single day.",
   "created_utc": 1696113026,
   "score": 13,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xc6pn",
   "message": "If I have to fart in a store I’ll go by other men so nobody thinks that came out of me 😝",
   "created_utc": 1696114010,
   "score": 12,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xpqu5",
   "message": "I never feel enough. Especially with the bad stuff. Yes I was sexually assaulted as a child but I wasn't raped so I have no reason to carry trauma from that...yes I lived by the sea during the massive Christchurch earthquakes and spent months not sleeping due to worry over tsunamis,  but my house wasn't destroyed so I have no reason to have ongoing anxiety issues over it...yes I'm sick with an ongoing invisible illness, but I hold down a full time job, so I have no reason to claim being exhausted and have no energy for anything. \n\n\n\nI always feel not enough, not ugly, but not pretty either, just average. I'm always close, but no cigar with everything and my big secret is that I feel that way about the horrible things that happen in my life as well.",
   "created_utc": 1696119990,
   "score": 7,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x2dxo",
   "message": "I can neither confirm or deny any allegations",
   "created_utc": 1696109844,
   "score": 10,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x36u4",
   "message": "I hit someone with my car in 2011, He was driving a bike, he knocked down on his head, I took him to the hospital and told them I found him in the street, When he woke up he can't remember what happened during the accident, So I kept as a secret",
   "created_utc": 1696110173,
   "score": 27,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xh4hx",
   "message": "I have my ex-husband usb with all files of videos he take from the girls he have sex and used to black mail them ...",
   "created_utc": 1696116194,
   "score": 9,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xgcpm",
   "message": "How much I've actually spent on my lizards tanks.",
   "created_utc": 1696115863,
   "score": 6,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xn4ke",
   "message": "I can’t even admit to it here, I’ll die never saying",
   "created_utc": 1696118835,
   "score": 5,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x88fv",
   "message": "I cut the tag off our mattress that says .. under penalty of law don’t remove.",
   "created_utc": 1696112292,
   "score": 17,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xiosl",
   "message": "I bankrupted a business due to alcohol problems, and I'm getting my ass handed to me next Monday, I'm past the anxiety, currently bracing for impact.\n\nMy only regret is my only employee, second employee I've ever had, I really tried to be good.",
   "created_utc": 1696116901,
   "score": 9,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xhtts",
   "message": "Nice try, ex",
   "created_utc": 1696116510,
   "score": 4,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xlaqc",
   "message": "The one that got away",
   "created_utc": 1696118053,
   "score": 5,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xohb0",
   "message": "This one time at band camp....",
   "created_utc": 1696119435,
   "score": 4,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xrxzo",
   "message": "I’m an alcoholic. I’ve spent months on end without a second of it sober. Clean for 3 months now.",
   "created_utc": 1696120953,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x55yg",
   "message": "Guys- admit nothing, deny everything, and make counter accusations.\n\nEdit spelling",
   "created_utc": 1696110983,
   "score": 10,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2wykf2",
   "message": "[deleted]",
   "created_utc": 1696108280,
   "score": 3,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xjapl",
   "message": "I've been an alcoholic most of my life and mixed drugs with it and it's like a Dr jekyll and Mr Hyde affect, I don't steal from anyone or hurt anyone physically I just go all crazy and women man I like to talk crazy with women cause their power to turn our minds to mush especially the freaky ones",
   "created_utc": 1696117173,
   "score": 3,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xrz8s",
   "message": "From the immediate people around me, it's the fact that I pull out my hair. I love it. I can't stop. I don't think I ever can",
   "created_utc": 1696120966,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xipeo",
   "message": "I killed Mufasa.",
   "created_utc": 1696116909,
   "score": 4,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x724b",
   "message": "I’ve broken all Ten Commandments. \n\nAnd not in the “In my heart” way.",
   "created_utc": 1696111786,
   "score": 4,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xavpj",
   "message": "I switch out the fresh ground coffee for Folger’s Crystals.",
   "created_utc": 1696113439,
   "score": 4,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xsqm6",
   "message": "Heavy answer (*TW*)\n\nIt kills me that my sister has used abortion as her birth control for 20 years. I can’t tell a single soul because it’s polarizing. It’s a continuous lump in my throat when she and I chat. ☹️",
   "created_utc": 1696121270,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xjrci",
   "message": "My uncle sexually molested me when I was around 9 years old. \n\nI didn't realize that what he was doing was wrong until I was much much older. He would sit me on his lap and rub me down there with his hand non-stop. He didn't even really do it in private, he just hid his hand motions really well. I vividly remember a bunch of us family members were sitting in an office-like room, and I was sitting on his lap behind the computer desk... and yeah. \n\nTaking that secret to the grave, as he's a miserable old man now with a very unsuccessful life and if this got out it would only bring his poor mother shame.",
   "created_utc": 1696117382,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xklj8",
   "message": "I can’t stand the show “the office”",
   "created_utc": 1696117764,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xnyx1",
   "message": "That I have tried to kms on my birthday every single year since I was 14.",
   "created_utc": 1696119209,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xouli",
   "message": "My male teachers during elementary school used to stare at my boobs often (I hit puberty at a very young age) tried to harass me and I haven’t told anyone about it",
   "created_utc": 1696119597,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xpv7m",
   "message": "That my brother in law knew my nibling was being sexually assaulted as a child, but doesn’t count it as CSA because it was between two people of the same sex despite a 10 year age gap.  \n\nMy nibling begged me not to tell anyone because it won’t change or achieve anything. I can’t betray their trust by speaking up.",
   "created_utc": 1696120044,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xqkmo",
   "message": "I fucking HATE my parents.",
   "created_utc": 1696120355,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xqzlv",
   "message": "I was an accessory to the robbery of a convenience store I worked at. I wasn't there when my friend robbed the place. I was drunk and just kind of gave him a copy of the store key when he asked for it. He told me his plans and, in my suggestable state, still gave him the key. I regret it and feel super guilty as I still go to that store almost daily and I actually have good relationship with the owner.",
   "created_utc": 1696120542,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xr8zy",
   "message": "I've known for years how my life will end: I'm just waiting for my parents to pass so they don't have to see it. There's just no hope for me to have a life I'd want to live.",
   "created_utc": 1696120658,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xrc2k",
   "message": "I’m not interested in helping my parents when they become older.(I’m a teenager)\nI don’t want to live close with my Mom,As she already stated that she’s not staying where I live once my sister and I graduate high school.\n\nI want to go to college and then live in the same city I do now,I don’t want to live with my Dad out in the countryside,And I don’t want to tell them about my school life.I love them.But the constant pressure of growing up with the best grades,awesome life and how they don’t support my LGBTQ friends is too much.I’d rather not deal with it.",
   "created_utc": 1696120695,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xrg0c",
   "message": "I’ve been in a LTR for one year, and my GF has met my close friends group. However, I’ve never told her that my friendship with one of the girls of the group had initially started out as a dating fling, 2 years before I met my current GF. I had hooked up once with my friend, only up to foreplay, until we realized we were too incompatible to date, but compatible and mature enough to stay friends.",
   "created_utc": 1696120741,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xs8lz",
   "message": "I really enjoyed \"*Holmes and Watson.\"*",
   "created_utc": 1696121072,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xsvir",
   "message": "My now ex partner is responsible for killing her best friend",
   "created_utc": 1696121321,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xt2gc",
   "message": "Most of the time, my life is a fight against dark thoughs i take very seriously. Almost no one around me knows that, and the last time I talked about how bad I was, they just ran away from me. Know i'm with completely different people, but i belive the same thing could happen. So much people makes the promess of supporting me, but that exactly what they said before running away.",
   "created_utc": 1696121398,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xee8e",
   "message": "One time, I was a party and went up stairs, I was looking for the bathroom and opened the wrong door, I saw my friends wife having sex with a German Shepard, the dog was inside her just humping. I quickly walked way, don't thing she saw me. And I didn't want to tell my friend either because he probably wouldn't believe me",
   "created_utc": 1696114990,
   "score": 4,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xe8ju",
   "message": "I eat butt",
   "created_utc": 1696114918,
   "score": 3,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xit21",
   "message": "Getting the mistress pregnant",
   "created_utc": 1696116954,
   "score": 4,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xt0ea",
   "message": "I am a gay male in my 30s. \n\nAs a 14-16 year old, I was raped multiple times by men in their 30s/40s. No one, except my husband, knows. \n\nI’m a sex addict now and working through it. \n\nIt’s all connected, I believe.",
   "created_utc": 1696121375,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xe9mc",
   "message": "I gave oral sex to the guy my sister is seeing, after their first date.",
   "created_utc": 1696114932,
   "score": 3,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xcf14",
   "message": "I wish this dumb repeated thread would be auto-modded and locked every time it gets reposted.",
   "created_utc": 1696114111,
   "score": 3,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xahef",
   "message": "I'm not sure if the statute of limitations has run out on my plotting and scheming.  How do you calendar a post to pop back up in a year?",
   "created_utc": 1696113270,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xhhm2",
   "message": "I was a 27 year old virgin. Yesterday because I was high on drugs I went on Grindr and let a guy give me a blowjob so I wouldn't die a virgin. Now I want to have sex with men. I previously considered myself straight. I only get off to straight porn.",
   "created_utc": 1696116355,
   "score": 2,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x2xbi",
   "message": "God isn't real",
   "created_utc": 1696110065,
   "score": 0,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x2z3m",
   "message": "You thought you would make me fall in this trap, CIA? (Lmao)",
   "created_utc": 1696110085,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x8s6b",
   "message": "I know what's in Area 51.",
   "created_utc": 1696112527,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x9fux",
   "message": "It would be no secret at all if i posted it here 😕",
   "created_utc": 1696112813,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x5pwz",
   "message": "I have nothing to hide from the FBI",
   "created_utc": 1696111215,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x7pnk",
   "message": "i can fart all day long and they aren’t stinky",
   "created_utc": 1696112068,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xvp5p",
   "message": "Good try Mr. Officer!\n\nSo lets be light, the one that can ruin your sentimental relationship.",
   "created_utc": 1696122467,
   "score": 1,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xaxng",
   "message": "I know who farted. I just confessed to it to save their blushes.",
   "created_utc": 1696113461,
   "score": 0,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xaz3e",
   "message": "I'll never tell",
   "created_utc": 1696113478,
   "score": 0,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2x21ah",
   "message": "I'm not going to say anything beyond that it has nothing to do with me.",
   "created_utc": 1696109699,
   "score": 252,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xiuui",
   "message": "Like I'd spill it on reddit! Nope.",
   "created_utc": 1696116976,
   "score": 0,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xj8y9",
   "message": "It's a secret right ?",
   "created_utc": 1696117150,
   "score": 0,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xk7zd",
   "message": "Nice try!",
   "created_utc": 1696117593,
   "score": 0,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xkbop",
   "message": "I peed on my ex-girlfriend once.\n\nWe were arguing and I had to pee, so I went to the bathroom.  She followed thinking I was just walking away.  I told her to stay out, she didn't listen and she walked in right as I was about to start pissing, I turned my body and peed on the front of her jeans.  \n\nThis isn't the weird part.  The weird part is that she stayed there until I finished.",
   "created_utc": 1696117640,
   "score": 0,
   "submission_id": "16whpvh"
  },
  {
   "comment_id": "k2xi8m8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16whpvh"
  }
 ]
}