{
 "submission_id": "16yfmb0",
 "title": "What is the worst thing you have ever seen at a strip club?",
 "selftext": "",
 "created_utc": 1696298804,
 "permalink": "/r/AskReddit/comments/16yfmb0/what_is_the_worst_thing_you_have_ever_seen_at_a/",
 "score": 244,
 "url": "https://www.reddit.com/r/AskReddit/comments/16yfmb0/what_is_the_worst_thing_you_have_ever_seen_at_a/",
 "comments": [
  {
   "comment_id": "k38eu6k",
   "message": "Roxy shower in East St Louis. Girl held onto a pole and went spread eagle. Another girl fisted her violently for about a minute before she squirted all over the glass. Announcer said anyone throws a 20 in and she will do it in her ass. No one threw in a 20.",
   "created_utc": 1696301066,
   "score": 132,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38cbuq",
   "message": "This is not what you meant when you asked this but I was in one like 10 years ago using the bathroom and when I was leaving the only sink fell off the wall and water started spraying everywhere.\n\nThey also had a guy standing next to it with a towel to dry your hands to try and seem fancy I guess, and he got all pissed because without a sink no one was going to tip him anymore.",
   "created_utc": 1696300000,
   "score": 85,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38quw0",
   "message": "At a low ranked strip club.   I was drinking a Bud long neck.  I was by the stage. \n\nDancer came over, turned around to me and pulled her thong to the side.\n\nProceeded to lower herself onto my beer bottle.  Right up the old poop chute. Maybe a a foot from my face. \n\nI was appalled .  But not as appalled as when the greasy biker next to me asked if I wanted that beer anymore.   When I told him no…he grabbed the beer bottle and proceeded to vigorously lick the neck while staring at the stripper.",
   "created_utc": 1696307155,
   "score": 234,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38io7k",
   "message": "The sight of my own face in the mirror of the private room where I was supposed to be getting a lap dance.  The dancer asked for a back rub; I obliged; she started telling me her problems.\n\n*You schmuck*, that face said.  *The sex industry has a friend zone, and you just landed in it.*",
   "created_utc": 1696302780,
   "score": 10,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38lq7p",
   "message": "Some buddies and I were in a seedy strip club in the Chinatown district of Honolulu.\n\nThe usual stripper formula was come out and do one song in a bikini, another song topless, and the last song totally nude.\n\nSo this one chick goes through her routine and when she's down to the nude part She lays on her back and puts her ankles behind her ears and starts spinning herself in a circle like a... Well I don't know what else is like a stripper spinning herself in a circle on her back but it was like that.\n\nShe's encouraging the men to wad dollar bills up in a little balls and try to throw them into her vagina. \n\nThen suddenly she starts to Bear down and flex and starts popping ping pong balls out of her pussy.  By this time she's been on stage dancing gyrating spreading for good 10-15 minutes, and those balls have apparently been up there that whole time.\n\nEveryone's having a good time appreciating this girl's unique skills when she fires one out, and it hits this Marine looking kid square in the forehead... And I swear for the smallest of split seconds it's stuck there before falling into his beer mug.\n\nThe Marine picked up his beer, chugged it down, and showed everyone the ping pong ball in his mouth.\n\nAt the time we all cheered and high-fived the guy and slapped him on the back, but looking back and thinking about it I just gag a little",
   "created_utc": 1696304299,
   "score": 73,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38s7q7",
   "message": "My ex worked at a smallish business where everyone was tight knit and would regularly celebrate each other's birthdays, milestones and holidays together. It was someone's birthday, so my ex partner was invited to this birthday shindig and asked to bring me along. We went to a strip club called Dimples outside Carthage, MO. \n\nThis whole night went sideways but the cherry for me was when this dancer came out. She looked strung out, early 20s, quite thin. She couldn't dance for shit and mostly just kept twirling and talking dirty to the people up front close to the stage. \n\nOut of nowhere a much older woman pops up, she looks like she's in her hard 60s, leathery tan skin, reeks of cheap vodka and an ashtray. So, they begin dancing together and slapping each other's genitals and breasts. Next thing you know there's dry humping and open mouth kissing. The group I'm with is like, yeah this is part of it. That's why people come here. This is the show... It was bad. Then the older woman steps off the stage to make rounds to get tips and saunters over to us sitting on benches to the side and as the younger girl joins, the older introduces us to the younger girl and loudly announces..\"So fucking proud of her. She's so fucking sexy. This is my oldest daughter by the way. Isn't she hot as hell?\"\n\nWe were there maybe another half hour and they continued to make out and do some wildly inappropriate shit. Bar staff confirmed they were mother/daughter and she had two other daughters and out of three, two worked with her there. \n\n\nThat was my first and last strip club experience. \n\n😂😂🤦‍♀️",
   "created_utc": 1696307974,
   "score": 72,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38dwsz",
   "message": "Pregnant dancers water break on stage.",
   "created_utc": 1696300664,
   "score": 116,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38j0uf",
   "message": "While working at one in 2019, a girl had a BP fox tail in and a customer pulled it out while she was on stage and she…….sh*t……….ON THE STAGE…………… burned into my mind.",
   "created_utc": 1696302947,
   "score": 253,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38x58v",
   "message": "So I used to work in clubs so my stories are from both sides.  One night I was visiting one of the clubs, and a dude sitting at sniffers row kept grabbing the money on stage and throwing it on the girl after it was on stage. After the second time of telling him not to do that, she grabbed him by his tie and proceeded to punch him in the face multiple times.  I made it to them faster than the bouncers did and had the guy up and out of his chair ready to be escorted out. \n\nIn the middle of day shift when no one was around, I watched an easily 8’ snake fall out of the rafters.  \n\nOne club I worked at all the girls wore the old school knee high leggings, which I thought was just cool solidarity, instead it was because one girl had an ankle monitor and the other girls didn’t want her to feel weird. \n\nOne girls first night giving a lap dance and we were watching on the security camera making sure the guy didn’t do anything, and instead she tries to do the whole head stand in the crotch, her crotch in his face thing, misses the couch and busts her head open on the floor. \n\nAnother girl, her first night is giving a lap dance, again, making sure everything is copacetic, she’s trying to pull his dick out, so after the dance, call her into the office and ask what the hell she was thinking. “My mom said that’s what you do during a lap dance.” Her mom was also working that night.",
   "created_utc": 1696311150,
   "score": 69,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38dv74",
   "message": "A flapping prolapsed anus.",
   "created_utc": 1696300645,
   "score": 27,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38l8qt",
   "message": "A stripper shooting an ice cube out of her pussy and a guy catching it in his mouth and eating it.",
   "created_utc": 1696304054,
   "score": 135,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k392ccl",
   "message": "I was a dancer off and on for about 5 years here in PDX, we have a lot of clubs if you know. Man oh man. I worked in some bad ones and the good and always kept to myself.\n\nLet me tell you about the shit that goes on back in the dressing room. That hot ass girl that you're getting a dance from she's putting her booty in your face whatever. Soon as she goes back stage she's talking all about how she's got period diarrhea like a mothafuxka and then proceeds to baby wipe cause she just came from the bathroom, then spray the HELL out of her crotch and ass with some cotton candy perfume. Then go right back out like \"heyyyyyy ;)\" \n\nFights breaking out, braids and weaves flying everywhere. \n\nHaving to go tell the bouncer the old methy dancer is getting booty fingered in the private dance area. Sheer material between couches, I can see you, and I know it ain't going in the front hole. \n\nGirls passed out behind the dj in a overstuffed armchair. I ask if she's OK. Hes like \"yea, she got roofied or something just sleeping it off till I take her home\" all non chalant as if its an often occurrence. \n\nIf this pops off and I think of more I'll come back in.",
   "created_utc": 1696314879,
   "score": 127,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38sre6",
   "message": "The young kid comes in for his birthday. He has never been drunk before all his friends pressure him to do a suicide shot \n\nIt's the lick salt, sip tequila, and suck the lemon \n\nSuicide shot is \n\nSnort the salt, shoot the tequila, and squeeze lemon in your eye \n\nKids in  the strip club for about 5 min snorts the salt shots the tequila and squeezes the lemon in his eye and drops to the ground rolling around a lemon seed is now under his eye lid.\n\nHas about 6 strippers surrounding him try to get the seed out, \nMemorable first shot.\n\nThat kid was me, lol",
   "created_utc": 1696308311,
   "score": 139,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k397gyg",
   "message": "I went to one with some friends for one of their birthdays.\n\nThe first red flag was that they took our phones off us. Not just told us to turn them off, but actively took them at reception and gave us a ticket each to claim then back.\n\nWe get into the club and get drinks and sit at a table. A girl comes over and explains the rules. It's this price for a dance at the table, it's this price for a dance in the private room, OR it's another price for a special sexier dance.\n\nI see a girl who is exactly my type looks wise and she's got an incredible body. She sees me looking at her and comes over. After a bit of a chat I decide for one of the special dances to see what the deal is.\n\nShe leads me to the room and just before we go in she asks if I've been there before. I tell her no and she explains that the 'special' room has less rules. She takes me in, sits me down and says I'm allowed to touch them, and they're open to other things for a price. \n\nShe starts dancing and puts my hand on her hip. She takes off her top and tells me to squeeze her tits, so I do. My dick gets hard and she gets naked and grinds on it through my clothes, while pushing her nipple into my mouth. It's super fucking hot. \n\nWhen she dance ends she says she wants to introduce me to her friend that she thinks I will like and brings out another girl. What's odd is she does the talking for her. I quickly realise this girl doesn't speak much English, and I'm being offered to do anything with her that I want. I look over behind her and see some guy getting a blowjob from a girl who looks like she wants to kill herself.\n\nI politely say no thank you, go back out to my friends, tell them what happened and say that I'm gonna go because it's a dodgy front for a knocking shop. They decide to come with me and we headed to a different strip club which was totally legit. \n\nThe next day there's a thing in the local paper about the club being raided by the police as it was a front for a trafficking gang. If we had stayed there longer we'd have possibly been arrested.\n\nTL;DR - strip club was a trafficking gangs front and I almost got arrested.",
   "created_utc": 1696318937,
   "score": 230,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k39682j",
   "message": "My stories arent as good as some of these, but I was a dancer for years. Had a guy jerking off in the club, under the table. I guess he thought nobody could see. Other customers kept complaining, but security didn’t believe it at first, so it took a while for him to get put out. \n\nA stripper took a shit right before her set and didn’t wipe properly, so when she came out on stage, she didn’t know she had shit all over her ass. \n\nA customer had a heart attack in the middle of the club. \n\nOnce at magic city in Atlanta, this new girl started talking shit about one of the top girls. A ton of girls jumped on her and beat her to a bloody pulp. It was horrific. \n\nOnce I worked in a club where the VIP section was kinda far away from the main part of the club, and security wasn’t nearby because management didn’t give enough of a fuck about our safety to pay an extra security guard. And the music was so loud no one could hear you scream. A customer tried to rape one of the dancers. The people in the cubicle next to her heard her screaming, and the guy had to rush in there and pull the guy off her. She had two black eyes. Management denied it happened. \n\nAnother one of my friends had a customer drug her. They found her on the floor in VIP, not breathing. They refused to call 911 because it would lead to an investigation that could affect the liquor license, so they drove her to the ER themselves. She could have died. If I’d been there that night, I would have said fuck this job and called 911.\n\nETA: forgot this one. Worked with a girl who always wore a choker. One day in the dressing room she took it off, and it turned out she had a big trach hole she was covering. A customer had drugged her at her previous club, she stopped breathing, and they had to give her an emergency tracheotomy. I felt so sorry for her.",
   "created_utc": 1696317909,
   "score": 117,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38hua1",
   "message": "A poor old Thai lady shat a frog from her vagina into my hand. She then took it from my hand and inserted it back into said vagina, from where it fell straight to the floor in a splat. She pushed it back in and got on with the show. I still think about that frog.",
   "created_utc": 1696302398,
   "score": 132,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38enmu",
   "message": "My father",
   "created_utc": 1696300987,
   "score": 190,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38ntd2",
   "message": "a buddy of mine went to a strip club because they had 50 cent wings for wednesday lunch. a dancer asked if he wanted a show and he declined. dude just wanted his wings. \n\nfrom the perspective of the dancer, he was the worst thing she had seen.",
   "created_utc": 1696305409,
   "score": 206,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38g8fk",
   "message": "I watched a tweaked out stripper fall off the stage and break her back on a chair.",
   "created_utc": 1696301670,
   "score": 232,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38dtq8",
   "message": "Three generations of women.",
   "created_utc": 1696300627,
   "score": 209,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38agam",
   "message": "A buffet with both Tuna Salad \u0026amp; Chicken Salad",
   "created_utc": 1696299216,
   "score": 162,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38kje8",
   "message": "Third rate strip club close to a large Tradie job site.  No food but it served cold beer and fast.  We only had so much time for a liquid lunch before heading back to the hot ass sweaty turnaround.  Some poor, thin, pale AND ugly girl was doing her best and failing miserably to gain any attention from our beer guzzling crowd.  \n\nOne of our besties took pity on her,  chirped to fellow Tradies to buck up, she’s somebodies daughter trying to make a living and we should all chip in.  Up and down the rail he had his hat out.  Kinda a clown but good hearted guy.  Probably couple hundred bucks he dumped on the stage and politely ask her to just stop, please stop.  \n\nShe grabbed the money and ran off stage all while bawling her eyes out.  Bouncers came upon us to find out what the fuck just happened…….we explained, they nodded with knowing eyes……",
   "created_utc": 1696303696,
   "score": 209,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38qcvh",
   "message": "At a place in Lethbridge, AB and the strippers would play a game(maybe it's a Canadian thing?) where they would put a loonie just above their nethers, and if you threw a loonie and knocked it off, you got a prize(poster, magnet with their pic on it,etc). \n\nWell, there was a pos who was heating the loonies up with a lighter and throwing them at the strippers. That was the first time I ever saw someone get the shit beat out of them 😃",
   "created_utc": 1696306861,
   "score": 242,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38rp45",
   "message": "In Thailand, a lady put a glass coke bottle filled with a clear liquid into her downstairs, got upside down and ‘drank’ it. She then walked around for a bit, squatted down and the liquid came back out looking like coke. Then some guy in the audience drank the whole bottle.\n\nEdit to add; there were veterans who were way older then me that did the tricks like pulling out razor blades and blowing darts from down there and there were some younger good looking ones that came out and danced in between. This was from one of the vets",
   "created_utc": 1696307665,
   "score": 68,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38sqqs",
   "message": "Cockroaches falling from the ceiling while a late fifties stripper danced to the version of \"My Heart Will Go On\" with from Titanic that had dialogue in it. Watching her while listening to Jack and Rose swear not to let go was something else.",
   "created_utc": 1696308300,
   "score": 135,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38guqr",
   "message": "My first girlfriend from middleschool",
   "created_utc": 1696301950,
   "score": 237,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38ys6m",
   "message": "i saw a kid who was obviously there for his birthday, probably just became legal to drink. how did i know it was his birthday? other than the very obvious birthday special dance...both his parents were there acting like they were at Chuck E Cheese (minus the cameras and cake)",
   "created_utc": 1696312283,
   "score": 67,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k390zu6",
   "message": "Strip club in Texas, a fellow Airman, was obsessed  with the goth stripper. (Super emaciated skinny looked malnourished) to the point where he borrowed  some money from me and a couple of friends for a \"special dance she promised  him.  Next thin you-know-what he came running  back inside holding  his leg asking us to get him to the hospital. Evidently, she gave him a blow job for 350 dollars but bit a chunk  out of his leg as he was actively  finishing. She tried to follow us to the car and offered  to go to the hospital  with the dudes' blood and baby batter on her face and tits.  Fucking  disgusting. Fun fact after an entertaining friday safety briefing about how dangerous a bite to the leg could be (dude almost died from blood loss), we went back to the same strip club. THE PHYCHO WAS WAITING FOR US! She had decided  that him letting  her almost kill him was super romantic  and needed  to marry him, followed us around, hoping  he would show up, or we would give her his hospital room number. She offered  us all \"free use\" of all of her holes (classy) because  we were his friends  and promised  to not bite as long as one of us would give her the information she wanted.",
   "created_utc": 1696313872,
   "score": 168,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38c9ch",
   "message": "Ping pong balls being shot out vaginas at happy recipients and also someone “smoking”’a cigarette with their vagina. \n\nI wasn’t expecting all that. But as a dumbass exchange student in SE Asia, my naiveté left me with some stories. That I can tell only a few people in certain recollections.",
   "created_utc": 1696299971,
   "score": 166,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38jwen",
   "message": "My grandpa spitting his chewing tobacco into a strippers vag.",
   "created_utc": 1696303377,
   "score": 164,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38r8n7",
   "message": "My moderately autistic classmate from high-school spending $1,000 that he did not have to be in the presence of a nude woman for the first time ever at age 26.",
   "created_utc": 1696307388,
   "score": 58,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38fjgz",
   "message": "My reflection in a mirror",
   "created_utc": 1696301369,
   "score": 143,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38f0g1",
   "message": "I wasn't there, but some guys I work with took a young guy who'd never been to a strip club. They brought him back to the hotel and I just happened to be downstairs so I jumped in the elevator with them. I asked them how it went and the young guy turned beet red and everyone else was crying laughing. I didn't notice him covering his pants. I giggled thinking he must have blown a load in his pants because he was young, but no. He'd gotten a lap dance and the dancer was grinding on his leg. She was on her period. They called him young blood and blood in blood out and a hundred other until he quit a few months later.",
   "created_utc": 1696301141,
   "score": 157,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38jgvv",
   "message": "One stripper handing off her baby to another stripper so she could hit the VIP room",
   "created_utc": 1696303166,
   "score": 87,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38ej6i",
   "message": "Only saw the aftermath, but my buddy threw up on a dancer while getting a private dance.",
   "created_utc": 1696300931,
   "score": 128,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38utjp",
   "message": "A condom hanging out of a B-hole after vip room. Did she not know it was left there? 2as she trying to make a baloon animal when she farted?",
   "created_utc": 1696309619,
   "score": 82,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38wdp0",
   "message": "It was around 2 p.m. on a weekday.  As i'm getting out of my car, i noticed 3 young kids sitting in a car.  One of them leans out the window and shouts to the strippers standing near the door smoking (super classy place...i believe the name was 'The Chicken Ranch') 'hey!  Can you tell my mama to come out here after she gets off stage?'",
   "created_utc": 1696310636,
   "score": 87,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38jfvw",
   "message": "The door man get shot. RIP Kaipo.",
   "created_utc": 1696303153,
   "score": 114,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38lgi6",
   "message": "All right, let's give it up for Trixie and pixie... during their dance the police have arrived because they've been stealing from customers. If you are missing any personal items please head outside and talk to the cops.",
   "created_utc": 1696304163,
   "score": 117,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38on8j",
   "message": "Saw an old man pull hut dick out and rush the stage while the girl was facing the other way. Luckily he was tackled before it got to her.",
   "created_utc": 1696305869,
   "score": 75,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38v9fw",
   "message": "A 50 year old man being breast fed by a 19 year old for 20$",
   "created_utc": 1696309905,
   "score": 34,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38zi4w",
   "message": "This was in Vancouver about 30 years ago. The stripper was on her back with her legs open… she had large, long dangly labia which she proceeded to tie together in a knot! Never seen anything like it since - totally fascinating.",
   "created_utc": 1696312789,
   "score": 31,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38ds03",
   "message": "Well, one time when I walked out of a strip club I saw a homeless man giving another homeless man a blowjob, but the one receiving was passed out and very much flaccid.",
   "created_utc": 1696300608,
   "score": 205,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38e11v",
   "message": "Dancer blew out a book of matches and spit out a hard boiled egg. Hold on she could play Mary had a little lamb with a toy flute. Almost forgot that one.",
   "created_utc": 1696300715,
   "score": 134,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38l2da",
   "message": "My sister",
   "created_utc": 1696303963,
   "score": 53,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38mskd",
   "message": "One all the local 18 year olds went to because it was BYOB so anyone 18 and up could go in, had quite the rotation of specialty nights. Including but not limited to amputee night, scar night (every lady had a gnarly C section scar, bullet scars etc), and a favorite of a friend of mine, talent show night. \n\nThe carpet in that nasty ass place was also stickier then any movie theater floor.",
   "created_utc": 1696304856,
   "score": 58,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k393os2",
   "message": "Saw too much, driver and bodyguard for headline stripper back in 90s. Grossest, not worst, was when I was lazy and hadn't put on contacts. Stripper grabbed my glasses and made them disappear before my very eyes. I had to use soap and elbow grease before I could clean the lens. Like they had been dipped in petroleum jelly.",
   "created_utc": 1696315915,
   "score": 31,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k39865k",
   "message": "As someone who's never been to a stripclub before, this has been a truly fascinating read.",
   "created_utc": 1696319521,
   "score": 28,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38isw4",
   "message": "a stripper in Reeboks sneakers and a belly band post delivery. We had to leave",
   "created_utc": 1696302840,
   "score": 76,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38fkqy",
   "message": "The drunk guy who threw up on me while I was dancing.",
   "created_utc": 1696301384,
   "score": 107,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38iz8x",
   "message": "The girl (completely nude) lays on your table in the VIP room. She takes your $20 bill, folds it lengthwise twice. She inserts it halfway into her girl parts. By means of some spectacular muscle control she gets it rotating in a circle, stops reverses direction. Then come the ping pong balls. She could fit seven of them. She flexes and fires them one at a time across the room. Then inserts a peeled banana, and the fella eats it out of her. That part I thought was gross.",
   "created_utc": 1696302925,
   "score": 65,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38fjdk",
   "message": "Saw a women shoot a blow dart across the stage and pop a balloon.",
   "created_utc": 1696301368,
   "score": 45,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38c7br",
   "message": "Not sure about the worst; but certainly the dumbest: two dudes getting into a shoving match over who was getting the next lap dance from one of the strippers.",
   "created_utc": 1696299947,
   "score": 83,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38t7ws",
   "message": "Stripper with one arm in Sykesville PA.",
   "created_utc": 1696308599,
   "score": 21,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38woks",
   "message": "During this strippers routine she pulled out an rc car with a dildo attached to the top (parallel to the floor), and handed the controller to someone in the crowd. She then lays out on the floor and let's the guy controlling the car drive the dildo in and out of her.",
   "created_utc": 1696310839,
   "score": 21,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38mcdu",
   "message": "Vince Neil at Foxy Lady Providence",
   "created_utc": 1696304618,
   "score": 17,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k391gc9",
   "message": "in my 32 years of life experience i have only being at stripclubs 2 times, first one was okay like i didnt get the vibe but fine, and the second time i went with some childhood friends from the street i grew up, it was a low tier trash stripclub and i clearly remember a bow of peanuts that was being passed around at multiple tables by a girl, this guy was just doing the deed at his table and fingering this girl and as clear as day i saw his wet hand get some peanuts and this girl just didnt care i guess and went to all the tables giving wet pussy peanuts",
   "created_utc": 1696314206,
   "score": 18,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38sq5l",
   "message": "My girlfriend's dad.  I pretended not to see him and just waited ubtil he spotted me. Eventually he did, and he walked out.  Crisis averted.",
   "created_utc": 1696308290,
   "score": 16,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38x9hu",
   "message": "The stripper fingered herself and then stirred her finger in the pint of one of the gentlemen in the front row. Said gentleman finished his pint.",
   "created_utc": 1696311231,
   "score": 16,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38n97y",
   "message": "My friend got pink eye from letting a stripper sit on his face once",
   "created_utc": 1696305107,
   "score": 33,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38t7fo",
   "message": "Stripper in a wheelchair.",
   "created_utc": 1696308591,
   "score": 29,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38td09",
   "message": "The only attractive one on C-section tuesday went into the mens room with three guys and about 10 minutes later guys ran out and she was ODing on the floor naked",
   "created_utc": 1696308686,
   "score": 16,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38zu9j",
   "message": "The old Stop-light in Honolulu, now RockZa. I wouldn’t say the worst things I’ve seen - but actually pretty fascinating. Many of the girls had special “skills.”  One could shoot ping pong balls across the room, and another could blow out a match with a queef. The craziest was a girl that could squat on a stack of quarters placed on a beer bottle then drop them into the patron’s hand one-by-one!  Crazy control.",
   "created_utc": 1696313030,
   "score": 16,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38ph26",
   "message": "Girl was on the pole when her butt plug fell out, along with... what was being held in by it. Never been back to a strip club. And now I need a shower.",
   "created_utc": 1696306346,
   "score": 29,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38qosh",
   "message": "My buddies’ wife working",
   "created_utc": 1696307053,
   "score": 32,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k393ise",
   "message": "When I was in university one of the guys on my dorm floor taught me the skill of snapping your fingers with a coin to send it flying at fairly high speed.  We practiced with pennies to keep costs low.\n\nOne night there was a dorm floor outing to a strip club.  Canada had recently phased out our one dollar bill for the dollar coin, the loonie.  There was a customary girl on stage, fully nude and on her back.  Guys were underhand tossing loonies at her, clearly trying to hit the most obvious target.\n\nThis guy.  This fucking guy, who I'd seen shatter a lightbulb at 40 feet with a penny, took a loonie that is ten times heavier and snapped his fingers.  Over the blasting music we heard the buzz like an angry hornet then the meaty thwack as it hit her labia minora.  She sat bolt upright with one of the most outraged looks I've ever seen.",
   "created_utc": 1696315788,
   "score": 57,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k392qvh",
   "message": "Honest to God truth.  About 1997, downtown Atlanta.  The strip club was on the street level of a seedy motel. First stripper, slightly overweight, mid 40s women with flabby tits… she chugs a beer on stage and then crushes it between her tits…. Next stripper……… 8 months pregnant….. I’ve never felt so ashamed and dirty at them same time. Unreal. I often wonder if that place is still around.",
   "created_utc": 1696315182,
   "score": 11,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38f64a",
   "message": "3 generations of women danced the same night",
   "created_utc": 1696301210,
   "score": 40,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k3920e3",
   "message": "My ex husband was a bartender at a local strip club when we first got married. I used to go there all the time to get some free drinks. I've seen it all. In fact, I kind of became a den mother to the strippers because all of them were younger than me, and I had a lot more experience in life. The saddest thing I would see are men who say that they wanted to take a stripper away from it all. The next one was strippers who would get pregnant and still strip because they had children at home and they needed the money. Stripping is hard on the women. It's not a bed of roses.",
   "created_utc": 1696314628,
   "score": 39,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38kg7c",
   "message": "I guess this is comparatively pretty tame, but a dude just being completely seduced by this stripper wanting to sell him a private dance, hugging him and holding his hand and stuff.\n\nIdk why but there was something I found oddly depressing about that, a dude so lonely and/or so down bad that he paid a $60 cover charge for entry and God knows how much he'd spend for that stripper, a pure fantasy. And knowing I paid that same cover fee, idk, it just made me feel really skeevy and kinda pathetic for being in that place. It just wasn't for me.",
   "created_utc": 1696303652,
   "score": 76,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k39h8ia",
   "message": "Some friends and I went to a shitty little club one time. We were having a good time drinking stage side laughing and joking with the talent and tipping very well. Then a new girl we hadn't seen at all in the probably two hours we'd been there took the stage. This girl was hammered drunk, I figure she was probably in the back sobering up the whole time we hadn't seen her. She starts dancing and we're joking with her all seems well.  She starts some impressive moves on the pole and on the handle things this particular place had installed on the rafters. At some point while she was up there she managed to cut her hand somehow, not too bad but enough to where her hand was bleeding. She came back down to stage level and we realized she didn't realize that she was bleeding.  My buddy pointed it out to her and her reaction was to try to be sexy about it.(?)\nShe started waving her bloody hand around like she was casting spells learned at Hogwarts when she suddenly puts her hand right up to my friend's face. He recoiled in disgust which I guess had upset her because she then stuck one of her bloody fingers in his drink while saying \"what's the matter? Are you afraid of a little blood?\". I immediately made eye contact with the door man who was seated next to a bouncer and motioned for someone to come over. Bouncer guy comes over and immediately realized what was going on.  He scooped her up with one arm and carried her off to the dressing room. The manager immediately came over to our table and apologized profusely. My friend with the now bloody whiskey ginger was not accepting any apologies. Ended up getting our whole tab comped and a stack of about 50 free admission tickets. While they were replacing our drinks and the manager was still trying to smooth it over I noticed the drunk dancer in her street clothes being escorted out of the back door while being verbally berated and told to \"never set foot in this building again\" by what appeared to be the club owner. \n\nGood times.\n\nTL;DR: Drunk stripper cut herself and played wizard before sticking her bloody hand in my friend's drink.",
   "created_utc": 1696327049,
   "score": 11,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38l3uk",
   "message": "My girlfriend",
   "created_utc": 1696303984,
   "score": 24,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38n8ic",
   "message": "Stripper make a dollar bill fly in the air by queefing on it. Tbh it was beautiful",
   "created_utc": 1696305096,
   "score": 27,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38v77h",
   "message": "Used to go to this place that would do stage calls.  Basically your friends pay a buncha money for you to go on stage while 2 girls dance on you.  Then the big ending they blindfold you and tell you one of the girls is going to stick her boob in your mouth and you gotta guess which one.\n\nWell after you get blindfolded you bust out a massive rubber dong and put some whip cream on it and shove it in your mouth.  To top it off you get a polaroid snapped and given to your friends.  Seen multiple dudes go from cloud 9 to raging in about 3 seconds.  I think some homicides resulted from those stage calls.",
   "created_utc": 1696309864,
   "score": 27,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k38ssqq",
   "message": "First time ever going, I sat in perv row with a few other friends. Nights going well, when a group of 6-ish international businessmen walk through the door and sit beside us. Its one of their birthday tomorrow and they want to order the birthday guy a lap dance. So they call over the current dancer and ask her.\n\nAfter an inaudible conversation she continues her way across the stage. The men chatter back and forth about laying it on heavy. So they throw a couple hundreds down. The dancer makes her way over spreading her legs right in front of them as a \"thank you\".\n\nAt this point I'm way too many beers deep to really understand what's going on here and being that it's my first time in a strip club I just kind of laugh the situation off. \n\nWell the dancer and the birthday boy start exchanging conversation while gently arguing while she's spread eagle in front of him,  and in a sudden fit of rage he punches her square in the box. \n\nShe immediately proceeds to drag her body across the stage like a zombie screaming; the men get up and clap sarcastically and proceed to leave. Before they got to the door the bouncers dealt with them. \n\nEvery time I smell bleach I hear the sound of his fist hitting her oiled bits. I wonder where they are now.",
   "created_utc": 1696308334,
   "score": 35,
   "submission_id": "16yfmb0"
  },
  {
   "comment_id": "k39rhtc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16yfmb0"
  }
 ]
}