{
 "submission_id": "16yhva3",
 "title": "What is something that tells you that a male individual is safe to be around?",
 "selftext": "",
 "created_utc": 1696305335,
 "permalink": "/r/AskReddit/comments/16yhva3/what_is_something_that_tells_you_that_a_male/",
 "score": 100,
 "url": "https://www.reddit.com/r/AskReddit/comments/16yhva3/what_is_something_that_tells_you_that_a_male/",
 "comments": [
  {
   "comment_id": "k39alea",
   "message": "He’s not pushy. And no I’m not just talking about sexually I mean about anything. I’m usually down for any adventure but if I say I’m not in the mood for something or it makes me uncomfortable and your response is to keep asking until I say yes that’s a major red flag imo\n\nOr like a huge pet peeve of mine is if I match with somebody and they go “snap? Insta?” dude can we talk for like 5 whole minutes first?",
   "created_utc": 1696321576,
   "score": 194,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39jz1x",
   "message": "Nice try you dangerous individual.",
   "created_utc": 1696329068,
   "score": 122,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k396ooj",
   "message": "When a dude doesn't start peacocking the second a girl walks into the room",
   "created_utc": 1696318285,
   "score": 110,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38rjys",
   "message": "Soft spoken, polite, has a collection of Bionicles",
   "created_utc": 1696307578,
   "score": 162,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38or8d",
   "message": "Depends on the species. For most mammals tho, males are best avoided during mating season, when they tend to fight each others for females",
   "created_utc": 1696305933,
   "score": 92,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k390jun",
   "message": "How he acts when you're vulnerable",
   "created_utc": 1696313545,
   "score": 216,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39b5ld",
   "message": "Fork lift certificated",
   "created_utc": 1696322059,
   "score": 129,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38sdkg",
   "message": "Not trying to be trite, but nothing short of years of peaceful relations.  \nThing is, the truly dangerous men have \"looking safe and trustworthy\" down to an art form, like Ted Bundy.",
   "created_utc": 1696308073,
   "score": 192,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38w6nh",
   "message": "They’re chill and understanding about a woman’s caution no matter how long she’s known him for.",
   "created_utc": 1696310509,
   "score": 162,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38qceb",
   "message": "eye contact and maturity when being told \"no\" by women they are advancing. also conversations with no hint of ulterior motives.",
   "created_utc": 1696306853,
   "score": 175,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k399m2z",
   "message": "being genuine friends with women",
   "created_utc": 1696320740,
   "score": 40,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k399akt",
   "message": "I’m a guy and I really don’t want to like speak for everyone but once my female friend told me that girls can have this sixth sense when they know a guy is genuine by interacting with him and that genuineness of a guy comes to light only with time invested into the friendship/relationship. How he treats her, how he treats others, how emotionally intelligent he is, how mature he is, how much attention he pays to things. \n\nBut she also told me sometimes a very simple act can give an instant judgement. She told me the first time we took a picture together, she remembers putting her hand around my shoulder and I put my hand around her shoulder but did not grab it rather I just touched her shoulder with the base of my palm and my hands were open. \n\nShe said at that moment she felt safe and just knew I can be trusted. She even went on to tell me her deepest secret about being sexually assaulted by a man before so for her to say this to me, it moved me and I was really emotional. Partly because I have never been complimented like this before but also because of her past I didn’t know what to do except just hug her.",
   "created_utc": 1696320470,
   "score": 66,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38zjli",
   "message": "how he treats animals",
   "created_utc": 1696312817,
   "score": 109,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38pgog",
   "message": "They don’t wildly overreact to this question and get defensive",
   "created_utc": 1696306340,
   "score": 203,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k3982wr",
   "message": "Nothing that they say; men not having a temper makes me feel safe",
   "created_utc": 1696319448,
   "score": 127,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39c4mu",
   "message": "Doesn’t immediately push you into anything and makes sure your ok- respects your boundaries and opinions",
   "created_utc": 1696322880,
   "score": 24,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k396ry0",
   "message": "when he’s gentle and polite. you feel warm, and at easy around him.",
   "created_utc": 1696318361,
   "score": 40,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k398k7h",
   "message": "Considering the bulk of sexual violence and abuse comes from intimate partners and spouses... I would say no real way to tell.",
   "created_utc": 1696319846,
   "score": 45,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39qb11",
   "message": "When they’re cautious of boundaries. The cute kind of caution where they always ask if something is okay to do. Asking for consent. Steering well away from things they know are a no no. Just being overall respectful",
   "created_utc": 1696333083,
   "score": 7,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k396wo9",
   "message": "Generally, your gut. People waltz past way too many red flags in relationships and for women that can be fatal. Trust your gut.",
   "created_utc": 1696318469,
   "score": 52,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39fq8w",
   "message": "Gut feeling, accompanied by repeated respectful and caring behaviour when you’re at your most vulnerable. I have one, and quite incredibly lucky to have him. :)",
   "created_utc": 1696325855,
   "score": 6,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k391e8t",
   "message": "They have general awareness of women's issues in a way that shows they've taken time to listen to different perspectives and think about things that don't directly impact them.",
   "created_utc": 1696314162,
   "score": 67,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39d6eq",
   "message": "They aren't collating information on how to convince people they are safe to be around.",
   "created_utc": 1696323756,
   "score": 22,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k390t0h",
   "message": "Man it's a lot easier to say what sets off alarms rather than what quiets them",
   "created_utc": 1696313732,
   "score": 23,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38yscf",
   "message": "He has a sensitive and gentle demeanor towards you, is mature, secure with himself, and ultimately wants to protect your heart, mind, and protect you physically.",
   "created_utc": 1696312286,
   "score": 27,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k396hr5",
   "message": "I have a pretty good sense for people. If think instinct comes into it a lot. Our bodies and nervous systems can communicate much more and in much subtler ways than we realise. If you learn to listen to it then when you meet someone dodgy or not decent you’ll know it.",
   "created_utc": 1696318126,
   "score": 11,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38xus9",
   "message": "This is actually a really interesting question..while I definitely have built up a level of trust over time, I never fully let my guard down. Considering most things that happen is not by random strangers, but by people who have gained your trust..the longer you know someone, the odds something terrible will happen actually goes up.\n\nBut yeah, theres no \"something\" that tells me someone is safe.. Being sketchy, lying, having anger issues, hostile, demeaning..all that def tells me someone is not safe to be around, physically or emotionally. Beyond that, its not much more than just being a kind, thoughtful person who respects boundaries...trust will develop over time. But yeah, not sure I willl ever completely let my guard down for anyone.\n\nIve been in some pretty crappy situations though, so my perception and amount of caution is  based on personal experience.",
   "created_utc": 1696311634,
   "score": 15,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39it39",
   "message": "How he treats other women, from the waitress to the homeless woman on the street to the CEO. Is he respectful to them? Does he speak respectfully about them? Or is he cracking sex jokes and scrutinizing their appearances?",
   "created_utc": 1696328229,
   "score": 17,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k393anz",
   "message": "Just being a dude. I don’t judge guys with the assumption they aren’t safe to be around.",
   "created_utc": 1696315611,
   "score": 42,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k391fpt",
   "message": "Doesn't make your arm hair stand on end",
   "created_utc": 1696314193,
   "score": 4,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39sg6e",
   "message": "When he’s drunk he becomes a hugger instead of being violent.",
   "created_utc": 1696334248,
   "score": 3,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39ssx3",
   "message": "When I set a boundary, and he doesn’t question it or ask me to justify it, and then proceeds to respect that boundary.",
   "created_utc": 1696334436,
   "score": 4,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39z69e",
   "message": "how they react when you say no",
   "created_utc": 1696337582,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39dwpy",
   "message": "Unsure but perhaps a history of not murdering anyone.",
   "created_utc": 1696324357,
   "score": 6,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39hkzy",
   "message": "treating me like an equal, not a “female”",
   "created_utc": 1696327319,
   "score": 7,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k3923vf",
   "message": "Is it bad if I say nothing ? I’m sure 99% men are fine, but still can’t bring myself to let my guard down.",
   "created_utc": 1696314701,
   "score": 29,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k393umj",
   "message": "Nothing.  I don’t trust people in general.",
   "created_utc": 1696316040,
   "score": 12,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k393aw4",
   "message": "Not sure I *can* make people understand I'm safe to be around. I'm not particularly loud and I show no \"alpha male behaviour\" because I think it's cringe and I have no need to do so, but I'm tall, fairly muscular and I've been told I have a male resting bitch face.",
   "created_utc": 1696315616,
   "score": 3,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k399t57",
   "message": "If they are honest to a fault",
   "created_utc": 1696320910,
   "score": 3,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39a8gw",
   "message": "A general vibe of their energy. Gut feelings.",
   "created_utc": 1696321274,
   "score": 3,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39aouo",
   "message": "After an extensive background check and observing his behavior toward the women in his life, it’s seeing what he does when he thinks no one is watching. \n\nIntegrity is everything. If you do stuff because you think you can get away with it - literal trash. All I need to know.",
   "created_utc": 1696321657,
   "score": 3,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39uvfi",
   "message": "How he acts when he is angry. If he knows how to stay calm, I take it as a sign he is safe to be around.",
   "created_utc": 1696335503,
   "score": 3,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39xtxm",
   "message": "I am a man, and I understand why women feel the way do. I don’t think they over exaggerating at all, as men we take it for granted, but there are a lot of men who act differently when alone with women and are unsafe to be around.",
   "created_utc": 1696336945,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38u6yl",
   "message": "If my dog warms up to him quickly. Dogs are exceptional at reading people, and their first impressions can be eerily accurate.",
   "created_utc": 1696309219,
   "score": 12,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k393vf7",
   "message": "Most men are safe to be around in the \"not going to hold me down or choke me\" kind of way. For me, I have to watch out for pity seeking behavior and men who try to make everything \"about them.\"",
   "created_utc": 1696316057,
   "score": 9,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38se1b",
   "message": "They have a close circle of friends for a long time",
   "created_utc": 1696308081,
   "score": 11,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38tta7",
   "message": "How he respects and talks to his mother. That's a HUGE thing. How he talks and looks at the average woman. Does he freak out playing games? Or turn them off when he gets discouraged? I mean all these things. But I'd have to say the biggest 2 would be the first 2. \"How he respects and talks to his mother. That's a HUGE thing. How he talks and looks at the average woman.\"",
   "created_utc": 1696308978,
   "score": 14,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38pm99",
   "message": "I wouldn’t know, I’m a male, I would like to know too.",
   "created_utc": 1696306430,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39a55v",
   "message": "Gravelly cowboy voice:\n\n\"He ain't me...\"",
   "created_utc": 1696321199,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39bd35",
   "message": "His surname is Rodgers. Mr Rodgers",
   "created_utc": 1696322234,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39eu66",
   "message": "When he is polite but also abit awkward and isnt insisting in getting you to do things you said no to",
   "created_utc": 1696325122,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39fbu8",
   "message": "Consequences. Of he stands to lose by playing about, then usually safe enough. No consequences, long time relationship. Or how they interact with others when vulnerable. Know quite a few genuine guys who are the person who make sure people get home safe, get taxis, check in if you are sick, just good souls.",
   "created_utc": 1696325528,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39g2de",
   "message": "Is genuine and displays the ability to listen. Also the energy they are projecting.",
   "created_utc": 1696326123,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39g4da",
   "message": "The way the look at me, tone of voice",
   "created_utc": 1696326168,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39h160",
   "message": "How my body feels in their presence",
   "created_utc": 1696326889,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39hhix",
   "message": "If he asks you if you wanna do something (go get coffee, hang out at a bookstore, go on a date, etc etc) and you give a “no” and he just says “ok, cool. maybe next time!” And doesn’t try and whine or beg you to change you mind.\n\nIn other words, he can feel disappointment and still respect your no.",
   "created_utc": 1696327245,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39ibj2",
   "message": "He is polite to waitstaff.",
   "created_utc": 1696327873,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39m407",
   "message": "Nothing. \n\nI worked with someone for 3 years. Last week they sexually assaulted me while I was at work. I felt completely fine around them. I never thought they’d try anything like that.",
   "created_utc": 1696330528,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39mook",
   "message": "If he can fight a bear with his bear hands.",
   "created_utc": 1696330905,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39or1k",
   "message": "Same thing you would look for to identify safe female individuals: Emotional maturity, introspection, and correct communication.",
   "created_utc": 1696332185,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39peyq",
   "message": "As a straight man, I find good general manners a helpful index.",
   "created_utc": 1696332579,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39pt7i",
   "message": "Not approaching like the goal is sex.",
   "created_utc": 1696332804,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39qd0c",
   "message": "Nothing",
   "created_utc": 1696333113,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39qrl9",
   "message": "This answer may be more literal than you were looking for… but when I go on a date with a guy, before I get into his car for the first time I take a picture of his license plate and make sure he sees me doing it. I send it to someone in my family for safety in case something happens. MOST of the time the guy laughs about it or comments on how clever it is. If the dude is weird about it or gets offended, gtfo out there.",
   "created_utc": 1696333338,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39tcya",
   "message": "If there’s a Straight guy in public place, cafe etc. Broad daylight and gay men are hitting on him but are being turned down politely, he’s probably ok, it’s not 100% foolproof \nBut if he makes a gay man feel safe and confident enough in public to hav a crack and is honest in his polite refusal, that says a Lot I reckon.",
   "created_utc": 1696334726,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39u993",
   "message": "He calls out other men on their shitty behaviour. Especially when he has nothing to gain from it himself and no-one to impress.",
   "created_utc": 1696335185,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39wesp",
   "message": "He doesn’t make sexual comments around you or to you.",
   "created_utc": 1696336263,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39xfld",
   "message": "Years of them proving it to you. Some guys are great at being fake and you won’t know the truth until you are vulnerable",
   "created_utc": 1696336758,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39y1gq",
   "message": "As of 2023 I don't think men can do anything to make women feel safe, thank God I got married 30 years ago and don't have to worry about trying to find a wife. In men's defense 0..6% of all men are rapists. Don't tease a man if your not into him then u should be ok. 0.06% of men u tease will rape u so you should be ok",
   "created_utc": 1696337045,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39yp8i",
   "message": "I’m standing next to his grave",
   "created_utc": 1696337362,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k393bj1",
   "message": "You've got the question all wrong. It's not what make them safe, but rather what are red flags that makes them dangerous. \n\nI don't know what you have been through, but if you have to ask that question, it seems to me that you have been through a lot and should maybe talk to a therapist about it? It's not healthy to worry to that point.",
   "created_utc": 1696315630,
   "score": 7,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39ctpm",
   "message": "I hate this mentality of assuming the worst and trying to be proven wrong rather than the other way around.",
   "created_utc": 1696323460,
   "score": 6,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k395ly7",
   "message": "Most males are safe, what are you on about??",
   "created_utc": 1696317421,
   "score": 6,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k395wh4",
   "message": "You mean your default assumption is that males aren't safe to be around. Sounds like straight up misandry to me. Just saying...",
   "created_utc": 1696317652,
   "score": 6,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39f6my",
   "message": "Your question implies that men are threats by default. \n\nUGH…… GROSS.",
   "created_utc": 1696325410,
   "score": 6,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39akk8",
   "message": "Wheelchair bound.",
   "created_utc": 1696321557,
   "score": 3,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k397vzo",
   "message": "I had no idea women were so fearful of us. Sorry girls. 😔",
   "created_utc": 1696319290,
   "score": 7,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38qcqe",
   "message": "If they arent attacking you i guess?",
   "created_utc": 1696306859,
   "score": 4,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k392ibf",
   "message": "A gelding is typically more docile and easier to handle",
   "created_utc": 1696315003,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k397esa",
   "message": "Not assuming every male individual is not safe to be around for one.",
   "created_utc": 1696318887,
   "score": 4,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k398pv6",
   "message": "I don’t even know what to say specifically but I can usually tell just by being around them for a while. My feelings are usually correct.",
   "created_utc": 1696319982,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k399hs5",
   "message": "There are the normal dudes, the crazy dangerous ones who you see from a mile and there are the psychos who perfected the art of looking normal or safe and will pounce you any moment. I guess you can only learn from the experience of others or have to make that experience yourself.",
   "created_utc": 1696320640,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39aua7",
   "message": "How he treats his mom/grandmother, animals, and kids. Those interactions will tell you all you need to know about a person (in terms of good or bad) if you know what you’re looking at.",
   "created_utc": 1696321787,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39uxmm",
   "message": "Isn’t this a somewhat sexist question? Also doesn’t this rely on assuming everyone’s gender, which I thought I wasn’t supposed to do anymore? How is this different than asking “what is something that tells you a black individual is safe to be around”? Which is obviously racist, so isn’t it sexist to do the same for men?\n\nI’m not trying to be snarky, I’d honestly appreciate an explanation.",
   "created_utc": 1696335534,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k397yfd",
   "message": "Having a good relationship with their mom/sister",
   "created_utc": 1696319346,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k392s2h",
   "message": "Time. I'm generally scared of men due to experience.",
   "created_utc": 1696315207,
   "score": 5,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38wfww",
   "message": "If he’s not a Republican that’s a great start. I refuse to be around bigots. Very literally number 1 on my checklist of determining if a human is a piece of garbage or not",
   "created_utc": 1696310677,
   "score": 252,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38ntiu",
   "message": "Idk, what tells whether a female is safe to be around?\n\nSometimes you just have to trust that people aren't a danger to you. You can't go through life wondering if every man you meet is trying to make a skin suit outta u or something.",
   "created_utc": 1696305411,
   "score": 250,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k3927pl",
   "message": "Used to be a marked lack of tattoos, but that has changed over the past few decades",
   "created_utc": 1696314781,
   "score": 2,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k3934mr",
   "message": "That's a tough one. Time mainly. Not being pushy helps. I'm not saying men are bad by any means but caution is important until you know a man",
   "created_utc": 1696315480,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39wd30",
   "message": "if his instinct is to get defensive when talking to someone who is openly and loudly feminist then he is part of the problem !!!",
   "created_utc": 1696336240,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k3947lf",
   "message": "There isn't anything questionable in his fridge",
   "created_utc": 1696316323,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39x6r5",
   "message": "All these \"you shouldn't assume men are dangerous!\" posts are fucking dumb.\nWe _are_ dangerous to the average woman comparatively, we outweigh her by a third or more, we've got a half a foot of height on her and biochemical stimulants ramping us up and we're far more behaviourally primed to respond to aggression with physical violence, even when we do have a handle on our tempers.\nAccept that to any woman who doesn't know you you're probably a bit scary, then do your best to not be, it's part of being a good man.",
   "created_utc": 1696336640,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39xwj9",
   "message": "when they respect my pronouns, love when they do that",
   "created_utc": 1696336979,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39zp5d",
   "message": "You know how tired I am of men being considered default un-safe?",
   "created_utc": 1696337824,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k39zy0z",
   "message": "He doesn’t question the way you feel about anything, ever. Someone’s feelings are not up for debate.",
   "created_utc": 1696337939,
   "score": 1,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k38o7w2",
   "message": "Overly dramatic question.",
   "created_utc": 1696305632,
   "score": 245,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k395udo",
   "message": "What is this question ? Yeah we men are all garbage human beings try to find tall and handsome guys they are the exception",
   "created_utc": 1696317608,
   "score": 253,
   "submission_id": "16yhva3"
  },
  {
   "comment_id": "k3a0d4i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16yhva3"
  }
 ]
}