{
 "submission_id": "16yj00t",
 "title": "What’s a conspiracy with the most evidence to back it up?",
 "selftext": "",
 "created_utc": 1696309085,
 "permalink": "/r/AskReddit/comments/16yj00t/whats_a_conspiracy_with_the_most_evidence_to_back/",
 "score": 189,
 "url": "https://www.reddit.com/r/AskReddit/comments/16yj00t/whats_a_conspiracy_with_the_most_evidence_to_back/",
 "comments": [
  {
   "comment_id": "k39y05u",
   "message": "A hamster playing bingo determines the rotation of the approximately 30 questions on that AskReddit.",
   "created_utc": 1696337028,
   "score": 83,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3a0wqr",
   "message": "That these weird low quality NSFW games that pop out in the Steam popular list until you turn NSFW content off are money laundering targets to cash in Steam gift cards obtained via various phone scams. Steam gets their 30% of the stolen money, so they don't mind and ultimately it is super difficult to prove that real people do not buy the games since nobody would ever admit to buying them.",
   "created_utc": 1696338391,
   "score": 161,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3amk2n",
   "message": "The British government deliberately put the RMS Lusitania in harms way to get her sunk to bring the USA into WW1. The fact the records have been resealed for another 100 years adds credence to this conspiracy",
   "created_utc": 1696346960,
   "score": 105,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39h4zs",
   "message": "In the UK there was a recent boom in American sweet shops that sold grossly overpriced import candy. They were suddenly everywhere after COVID, they didn’t sell much, but they were everywhere. Someone on TikTok theorised that they were all money laundering fronts, people started filming in the shops laughing at the prices, and staff always seemed to get really angry about it. Then it was announced last year (?) that there was a HMRC (UK’s tax wing of government) investigation started because the theory held water, and suddenly they all shut. The one in Leeds centre near Trinity currently has a notice of abandonment in the window and you can see the shelves are still stocked: the owners just ran off and left it. \n\nSounds like another successful case for the TikTok detectives.\n\n\nEdit: ducking autocorrect ruined my spelling",
   "created_utc": 1696326972,
   "score": 50,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3b0r8f",
   "message": "modern art is just money laundering\n\nnobody pays 2.2 million for a blank canvas",
   "created_utc": 1696352153,
   "score": 184,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3a6qob",
   "message": "Putin bombed apartments killing 307 of his own people to help him come to power. https://en.wikipedia.org/wiki/1999\\_Russian\\_apartment\\_bombings",
   "created_utc": 1696340911,
   "score": 27,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39wdyq",
   "message": "US government involvement in the trafficking of cocaine",
   "created_utc": 1696336251,
   "score": 10,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3a2uym",
   "message": "There is something fishy going on at Mattress Firm. How can they stay in business with a store in practically every plaza when the average person buys a new mattress every decade or so?",
   "created_utc": 1696339259,
   "score": 23,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39ujh6",
   "message": "I feel like Luigi probably is in Super Mario 64, we just stopped looking a little too soon.",
   "created_utc": 1696335331,
   "score": 60,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3a96lt",
   "message": "The [same D.C.-area contractor](https://chicago.suntimes.com/2023/9/21/23884285/migrant-tent-city-company-accused-of-ties-to-controversies-worldwide) busing migrants north is taking no-bid contracts to build over-priced shelters for them. They are also implicated in human trafficking abroad.\n\nThe obvious actual conspiracy is that they're lobbying politicians in both border states and northern cities to keep the crisis as messy as possible and keep the money flowing.\n\nI'm actually more surprised that they aren't the same contractors who built the Wall than I am that they've already got their fingers in so many other pies. The company president is a former\\* intelligence operative and if you can think of a crisis that's been going on way too long, it's basically a guarantee they're making money off of it.\n\n\\*While it would be only theory that he is still an active asset, it would also only be theory to say he's not.",
   "created_utc": 1696341907,
   "score": 21,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k395vcs",
   "message": "The meta-conspiracy to convince dumb people that the word “conspiracy” means “a crazy person’s imagination”\n\nConspiracies happen every day.  There’s a global conspiracy of adults to convince kids Santa is real - it’s not necessarily a bad thing, but it’s a conspiracy.  \n\nSomewhere along the line, the word got hijacked and it immediately discredits whoever says it.  It’s practically a trap to use the word, so you have to dance around it if you want to describe people planning things in secret",
   "created_utc": 1696317628,
   "score": 126,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k393uqa",
   "message": "The government deliberately leaked false information to UFO investigators to discredit them because they were getting to close to the truth.\n\n(The truth being that Area 51 was a testing grounds for spy planes and stealth aircraft and was attracting too much attention for a secret weapons facility.)",
   "created_utc": 1696316042,
   "score": 118,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39ysbb",
   "message": "Jar Jar Binks is the ultimate Sith Lord",
   "created_utc": 1696337401,
   "score": 39,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k38xp1e",
   "message": "The theory that Bobby Kennedy was killed by the Mafia.",
   "created_utc": 1696311522,
   "score": 241,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3biug8",
   "message": "The switch in the US from employer sponsored pensions to self directed 401ks was done deliberately so that the average Joe would have a stake in the economy at large and be more likely to vote for business-friendly policies.",
   "created_utc": 1696358578,
   "score": 86,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3aly2m",
   "message": "Iran Contra comes to mind. Arms for hostages. \n\nAlso yes, the CIA really did sell crack cocaine to fund death squads in South America.\n\nAnd finally Nixon started the drug war to attack his political enemies.",
   "created_utc": 1696346736,
   "score": 43,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39rl5b",
   "message": "The media bury stories for the elite that control us:\n\nhttps://www.theguardian.com/us-news/2019/jul/13/jeffrey-epstein-alex-acosta-miami-herald-media\n\n\u0026gt;Michael Reiter told Brown he had been down this road many times and was sick of it. As Brown recalled in a WNYC interview last month, Reiter said he had talked to many reporters and told them precisely where to find damning evidence against Epstein. But nothing ever came of it.\n\n\u0026gt;“He was convinced that a lot of media had squashed the story and he was fed up,” she said.\n\n\u0026gt;Reiter warned Brown what would happen were she to continue digging: “Somebody’s going to call your publisher and the next thing you know you are going to be assigned to the obituaries department.”\n\nhttps://www.newsweek.com/abc-jeffrey-epstein-story-amy-robach-prince-andrew-1469893\n\n\u0026gt;\"Then the palace found out we had her whole allegations about Prince Andrew and threatened us in a million different ways”",
   "created_utc": 1696333791,
   "score": 57,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3aaflt",
   "message": "Iran Contra, probably. The sheer intricacy of that proven conspiracy kept most from understanding it, even with the mountain of evidence",
   "created_utc": 1696342407,
   "score": 93,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3912u8",
   "message": "MK Ultra\n\nFBI:s COINTELPRO\n\nCIA feeding crack into American urban centers to suppress a specific part of the population",
   "created_utc": 1696313934,
   "score": 15,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39yts9",
   "message": "A small group of people dominate the mainstream media to shape public opinion.",
   "created_utc": 1696337420,
   "score": 80,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39cexm",
   "message": "Benetton is a front for Italian mob money laundering. \n\nProbably wasn't at first back in the 80s but now...decent sized stores in expensive real estate all over Europe, **never** anyone in the stores, never seen anyone wearing the clothes, don't know anyone that's bought anything from them, ever, and neither do those people.",
   "created_utc": 1696323116,
   "score": 188,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k390x0z",
   "message": "My personal favorite is that OJ Simpson was covering for his son. It explains a lot of the weird shit in that case, like the undersized glove and why they were driving at low speeds during the chase.",
   "created_utc": 1696313814,
   "score": 143,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39x08k",
   "message": "The corporate conspiracy to push opioids on the US population",
   "created_utc": 1696336553,
   "score": 143,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k395anz",
   "message": "ITT: People confusing \"conspiracy\" with \"conspiracy theory.\"\n\nConspiracies are well documented and accepted as true. Conspiracy *THEORIES* could be born out of someone's ass and mean nothing at all.",
   "created_utc": 1696317170,
   "score": 159,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k39z3ej",
   "message": "Blackrock and Vanguard are buying up all the residential property they can in order to get the majority of americans renting from them. Estimates say by 2030 they will own 60% of residential property",
   "created_utc": 1696337544,
   "score": 243,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3aha4e",
   "message": "The FBI killed Martin Luther King Jr",
   "created_utc": 1696345011,
   "score": 103,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3acqt9",
   "message": "The petroleum companies knew burning fossil fuels would lead to global climate change but hid the evidence of their own funded studies and did nothing to curb consumption, instead funded groups opposed to renewable, non greenhouse gas generating energy to maximize shareholder value.",
   "created_utc": 1696343312,
   "score": 113,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k38zweh",
   "message": "Chuck E Cheese is a money laundering front for the Italian Mob",
   "created_utc": 1696313073,
   "score": 134,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k390twy",
   "message": "Dolly Parton’s arms are covered in tattoos",
   "created_utc": 1696313751,
   "score": 119,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3aamws",
   "message": "*Something* is wrong with the official narrative of the assassination of JFK.\n\nThere's no clear arguments for any of the common conspiracies over any other, but the evidence doesn't add up to the official narrative.\n\nOne theory I like is that there were 2 shooters, independent of each other. The FBI knew this but opted for a single shooter narrative because missing not one, but 2 plots to assassinate the president would make them look bad. \n\nAs for the theories of organizations like the FBI, CIA, or Mafia being responsible, they're all plausible enough, but so secretive that people within their organizations *believed* someone in their group was responsible. Even if they weren't. The second shooter might have been from one of them, but Oswald was a lone gunman. But it also doesn't take a grand conspiracy for someone involved in one of those groups to have taken it upon themselves to try and take the shot. That said, none of the evidence really leads towards any of them over the others and them working together is a bit unrealistic.\n\nSo we're back to just 2 random guys taking shots at the same time and the FBI claiming it was just 1. Then everyone thinking it was their guys even if it was just 2 randos.",
   "created_utc": 1696342488,
   "score": 162,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k38uhsk",
   "message": "The dismantling of the welfare state, the concentration of wealth for the upper class of the oligarchy.",
   "created_utc": 1696309412,
   "score": 47,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3axdh8",
   "message": "That our governments are turning us all against each other to distract us from the blatant wealth manipulation, corrupt practices, nepotism, cronyism, among hundreds of other big issue things. Their plans working a treat and the people as a whole can't see what's happening and start working together against it..\n\nWe are losing our privacy, our rights and our sense of connection with one another. We drift away while they get more and more powerful. People hand away their rights like they're going to get them back and never question it when it's not.\n\nOur planet had to deal with another of the world powers attempts at control and that's COVID or should I say the reaction to it. I was always a believer it happened naturally but as time goes on it becomes more apparent it wasn't. \n\nWe are bodies hanging from the roof being bled dry slowly but if this keeps up we aren't just fucked like a world war or nuclear war, if we don't do anything we will lose whatever control we have and we will never get it back.",
   "created_utc": 1696350887,
   "score": 115,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3bjw5q",
   "message": "Might not be a \"conspiracy theory\" per se. But I believe that the government works hard to cover up their own incompetence. Part of that is manufacturing insane conspiracy theories as a way to make anyone who asks questions look crazy.",
   "created_utc": 1696358944,
   "score": 14,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3938vv",
   "message": "The Bilderberg group. Every year in summer, they meet, and people keep track of who are there. Guest lists every year. Top politicians, royalty, corporate owners. Extreme security. No protocols. There is confirmation from a variety of these people that they were there. So, what do they talk about? Are they coordinated somehow after each meeting? How much influence do they have? Well, given the extreme security, it's difficult to say. I am sure it's nothing, though. Why would those groups of people want to influence the world to suit their agendas, right?\n\nEdit: Also note, anyone discussing this gets called a tin foil hat, or paranoid, or a conspiracy theoreticist whoprobablyalsobelievesinantivaxxreptiliansnibiru...",
   "created_utc": 1696315572,
   "score": 176,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k38v342",
   "message": "Epstein did not kill himself",
   "created_utc": 1696309789,
   "score": 215,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3biosj",
   "message": "That US Republicans coordinated with Iran to have the 1979 hostages held until after the 1980 election to politically damage Carter’s re-election chances. One operative basically admitted it not that long ago",
   "created_utc": 1696358523,
   "score": 26,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k397khb",
   "message": "The stock market is rigged and there's a revolving door between them and the ones \"regulating\" them. Some $200T worth of derivatives based on 50 or 100:1 leverage from the largest firms on the planet, all just funny money. None of it is real 😂",
   "created_utc": 1696319019,
   "score": 49,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3a01v2",
   "message": "Shorts never closed for Gamestop stocks",
   "created_utc": 1696337989,
   "score": 62,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3926p9",
   "message": "JFK's campaign was supported by the Mafia (who wanted back their Cuban playground) because he promised to get rid of Castro and was killed by the Mafia for his fuck up in the Bay of Pigs invasion and then the Missile Crisis.",
   "created_utc": 1696314760,
   "score": 87,
   "submission_id": "16yj00t"
  },
  {
   "comment_id": "k3azz07",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16yj00t"
  }
 ]
}