{
 "submission_id": "170mobm",
 "title": "What should people absolutely not do when visiting your country?",
 "selftext": "",
 "created_utc": 1696524074,
 "permalink": "/r/AskReddit/comments/170mobm/what_should_people_absolutely_not_do_when/",
 "score": 123,
 "url": "https://www.reddit.com/r/AskReddit/comments/170mobm/what_should_people_absolutely_not_do_when/",
 "comments": [
  {
   "comment_id": "k3lu98h",
   "message": "Approach wildlife, especially when they’re with their offspring. \n\nThe amount of idiot tourists I’ve seen outside their cars within mauling distance of a bear or moose is mind boggling.",
   "created_utc": 1696528835,
   "score": 51,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m9zzs",
   "message": "People frequently exaggerate the number of offences in Singapore for which you can be caned.\nIn actuality, you have to intentionally act like an asshole in order to receive a cane.\nYour risk is minimal.\n\n\n\nIn Singapore, drugs are one thing you ABSOLUTELY DO NOT WANT TO FUCK WITH.\n\n\n\nA MANDATORY DEATH SENTENCE IS INVOLVED FOR POSSESSION OF MORE THAN 500g (18 oz) OF WEED.\n\nThey do in fact enforce it.\n\nAustralians have been put to death.\n\nDo not be careless.",
   "created_utc": 1696534386,
   "score": 125,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lzyk7",
   "message": "When visiting Denmark, don't sit next to people on public transport, unless there are no other seats available. And don't speak to strangers on said public transport also. Danes are incredible sensitive about their personal space and privacy. Also, not big on small talk.",
   "created_utc": 1696530843,
   "score": 26,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lnuor",
   "message": "Order an ‘Irish Car Bomb’ shot. Doesn’t exist here, and the name has roots in The Troubles, a dark time in our history that people north and south of the border who are still alive lost people to.\n\nEDIT: shot, not cocktail, thanks karp70. Again, doesn’t even exist here.",
   "created_utc": 1696526592,
   "score": 168,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ljrwe",
   "message": "Don't walk the bicycle lanes 😞.",
   "created_utc": 1696525156,
   "score": 86,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m24au",
   "message": "If you are hiking through the austrian mountains with a dog, put it on a leash. The cows will hurt you if they feel threatened. In General don't disturb the cows and keep away from them.",
   "created_utc": 1696531602,
   "score": 210,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lztic",
   "message": "Don't do the Nazi greeting. In fact, just don't do it anywhere. But especially not in my country. Police will arrest you for it.",
   "created_utc": 1696530793,
   "score": 162,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m8hyh",
   "message": "UK here. Always queue. Even if there isn’t a queue, just look around politely and ask whoever’s around if they’re queueing. I know this reads like a joke but it really isn’t. There’s always a queue, and tourists always ignore it, and that’s usually why tourists get a bad rap in the UK.",
   "created_utc": 1696533855,
   "score": 182,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3luljb",
   "message": "Don't touch the King's guard.",
   "created_utc": 1696528957,
   "score": 9,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lh8ma",
   "message": "If you come across Canada, don't ever dare touching our geese, thanks.",
   "created_utc": 1696524270,
   "score": 195,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3liddi",
   "message": "Tell terroristic jokes at the airport / border crossing.",
   "created_utc": 1696524667,
   "score": 114,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m2gcl",
   "message": "Do not touch the bison. I don’t care that they’re herbivores and look fluffy. They are incredibly strong and will kill you if they’re in a bad mood",
   "created_utc": 1696531722,
   "score": 150,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lojof",
   "message": "If you are in Berlin and come across a monument, art installation or similar, treat it with respect. There is a 2/3 chance that it is some kind of world war 2/ holocaust/ german separation memorial. \n\nYou would not believe the number of tourists that climb or even picnic on the concrete coffins of the [memorial of murdered jews in Europe](https://en.m.wikipedia.org/wiki/Memorial_to_the_Murdered_Jews_of_Europe)",
   "created_utc": 1696526833,
   "score": 89,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lv7w4",
   "message": "In the USA,  don't haggle retail prices, especially at local one owner stores. You can ask for better prices at flea markets .",
   "created_utc": 1696529176,
   "score": 231,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lmrrh",
   "message": "America: assume this country is as small as a European one.  I constantly saw people saying they were going to visit California so they wanted to see San Francisco and LA... in the same day.  \n\nCheck a map for scale!",
   "created_utc": 1696526213,
   "score": 247,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lnb7t",
   "message": "Don't go to Hollywood expecting something. Also, don't spend tons of money just to see famous people's homes on one of those bus tours. You should go to all the cool museums around LA though, those are pretty neat. And the beaches aren't too bad either",
   "created_utc": 1696526404,
   "score": 163,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ljjdr",
   "message": "Do not mess with the Tomb of the Unknown soldier.",
   "created_utc": 1696525073,
   "score": 222,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lne4n",
   "message": "Visit 4 Corners Monument. This where four states meet, Arizona, New Mexico, Colorado and Utah. It's a sidewalk and a gift shop in the middle of nowhere in the desert.",
   "created_utc": 1696526431,
   "score": 147,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3luk1h",
   "message": "If you’re visiting Brazil, specially a big city, avoid using your smartphone while walking on the streets, as you become more prone to being robbed.",
   "created_utc": 1696528942,
   "score": 111,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lngvh",
   "message": "Don’t try ‘doing the accent’. It’s offensive.  Also if you learn only one thing make it how to pronounce the word ‘loch’",
   "created_utc": 1696526458,
   "score": 146,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lguuh",
   "message": "Don't get out of the car immediately when you're pulled over.",
   "created_utc": 1696524133,
   "score": 236,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mdcif",
   "message": "Don't go for a drive in the outback without making sure you're properly prepared if you get stuck. There's a reason you see so many abandoned cars on the highways out there.",
   "created_utc": 1696535561,
   "score": 27,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mv2de",
   "message": "I am in the US and apparently it is common in other countries when a cop pulls you over, to take your papers out of the glove box yourself and walk it up to them. \n\nDo not do this. It is a great way to get shot or tazed. \n\nDue to the gun culture here, the cop has no way of knowing if you are or are not armed. Getting out of your car without being ordered to do so will be perceived as a hostile act, and the cop will pre-emptively defend themselves. \n\nStay in your car, roll down your windows. Keep your hands visible (resting on the steering wheel is good). If you need to reach anywhere, tell the cop exactly what you're doing, aka, \"My passport is in my jacket pocket, I'm getting it right now.\" \n\nIf the cop asks if you know why they pulled you over, you don't. Be polite, be apologetic, and you'll probably get let off with a warning.",
   "created_utc": 1696541918,
   "score": 24,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mc2sj",
   "message": "There are two places in Norway where the borders of 3 countries meet. One is between Norway, Sweden and Finland. So you can walk around the border marker and say \"I am in Finland, now I am in Sweden, now Norway\". It is by a lake, so they have made a wooden walkway around the border marker so people can do that.\n\nNorway also have a point where the borders of Norway, Finland and Russia meet. If you try to do the same there, you will be arrested. If you throw a rock or pee over the border with Russia or even just in that direction, you will be arrested.\n\nWhile the Nordic countries are like brothers, Russia is the unstable, psycho living next door.",
   "created_utc": 1696535118,
   "score": 70,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ljogz",
   "message": "Queue-jump.",
   "created_utc": 1696525122,
   "score": 89,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lu0c8",
   "message": "You don't want to drive out in the desert in the southwest. That dirt road might not have had a car in ten years and if you blow a tire where it's washed out you gonna be a pile of bones faster than you think.",
   "created_utc": 1696528747,
   "score": 123,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m4p39",
   "message": "Compare everything and anything to your home country and complain how it’s “so much better back home!”",
   "created_utc": 1696532517,
   "score": 68,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lznz3",
   "message": "[removed]",
   "created_utc": 1696530740,
   "score": 163,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mchys",
   "message": "If you're not a strong swimmer, please don't wade out into our ocean expecting that you'll be okay. If you want to swim at our beaches, stay between the flags where there are lifeguards on duty.",
   "created_utc": 1696535266,
   "score": 21,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m7urs",
   "message": "If you can’t take some light ribbig at your expense or hear the C word in every second sentence your gonna have a bad time",
   "created_utc": 1696533629,
   "score": 63,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lo92d",
   "message": "Go to a favela at night",
   "created_utc": 1696526729,
   "score": 90,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lhh0b",
   "message": "Bragging what you have, you'd probably end up getting kidnapped.",
   "created_utc": 1696524353,
   "score": 32,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lpx6i",
   "message": "Don't ask for cocaine from everyone as if it's sold in a grocery store; ask for it through WhatsApp like everyone else.",
   "created_utc": 1696527316,
   "score": 37,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m5pn5",
   "message": "Don't ask where the animals are in South Africa, we do not have lions walking in the streets, you are more likely to run into wildlife in America.",
   "created_utc": 1696532874,
   "score": 32,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m1fxp",
   "message": "i'm from the czech republic originally, and something every tourist should be aware of is privacy. if you're some american influencer, DON'T GO TO CZECH REPUBLIC. you will get arrested if you push yourself into other people's lives. us czechs are not tolerant of that kind of behavior.",
   "created_utc": 1696531361,
   "score": 73,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ly60v",
   "message": "Be disrespectful in any way at Arlington Cemetary.",
   "created_utc": 1696530211,
   "score": 69,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mge54",
   "message": "Try to pet/feed bears. For some reason tourists to Banff seem to think bears are mascots or something.",
   "created_utc": 1696536634,
   "score": 16,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ln4h5",
   "message": "Don't throw away toilet paper, actually flush it.",
   "created_utc": 1696526338,
   "score": 29,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lkyvu",
   "message": "If you're traveling across Canada, you want to take the perimeter highway either north or south AROUND  Winnipeg. \n\nIt looks like a city, but it's actually just a toxic waste dump we keep in the geographical center of our country.\n\nYou can set the cruise control and nap through Saskatchewan. Nothing to see there.",
   "created_utc": 1696525579,
   "score": 41,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m83yh",
   "message": "Puerto Rico is cool with gringos (recommend you speak some Spanish) just don't act entitled and if they say stop recording stop unless your life is worth that crappy video and don't go near the projects or out at night. Also there is a hatred brewing against Americans in the islands so if someone yells gringo go home well it is time to go back to the tourist area unless confrontation and possibly assault is your kink.",
   "created_utc": 1696533719,
   "score": 45,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mguyz",
   "message": "Don't get out of the car immediately when you're pulled over. And never reach into your glove compartment or look around your car without asking the policeman first.",
   "created_utc": 1696536797,
   "score": 55,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lq6qq",
   "message": "Killing someone usually isn't the best move.",
   "created_utc": 1696527408,
   "score": 24,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lxc6d",
   "message": "Hawaii here -- don't go to Sandy beach, don't stick your head in the blowhole, don't go to toilet bowls.  We have far too many people die here while on vacation.",
   "created_utc": 1696529923,
   "score": 33,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3md345",
   "message": "Approach Canadian Geese. DO. NOT. DO. IT. You WILL meet an untimely demise with those long necked demon honkers. 💀",
   "created_utc": 1696535471,
   "score": 10,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ls6nz",
   "message": "Don’t call anyone a goof",
   "created_utc": 1696528106,
   "score": 9,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m0yob",
   "message": "Don't swim outside the flags on the beach.",
   "created_utc": 1696531194,
   "score": 9,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m9lo9",
   "message": "Try and get in all the sights in one day. New York and LA is about 2,800 miles.",
   "created_utc": 1696534243,
   "score": 9,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3met38",
   "message": "Show russian flag",
   "created_utc": 1696536075,
   "score": 11,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lw4yb",
   "message": "When visiting the liberty bell do not take a detour through Kensington",
   "created_utc": 1696529499,
   "score": 20,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m5gx0",
   "message": "Understand that although most Americans are friendly, personal space is real, STAY OUT OF IT.\n\nEspecially if your Chinese and visiting any of our national parks. \n(Absolutely horrible at the Grand Canyon) \n\nYou're in nature, don't stand close enough to someone where they're wondering if you're wearing a condom or not. Might be acceptable at home but you might take a unplanned trip into the canyon here.",
   "created_utc": 1696532790,
   "score": 35,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lopnw",
   "message": "Americans need to stop trying to bring their guns into Canada.\n\nJust stop it.",
   "created_utc": 1696526891,
   "score": 71,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lh5yh",
   "message": "DO NOT MESS WITH POLICE.\n\nUS cops are *not* your friend.\n\nIf you get lost while touring, ask a native or a firefighter.\n\nAll my homies love the fire department",
   "created_utc": 1696524244,
   "score": 162,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lvyn9",
   "message": "This is very specific, but from my experience working in a store North Americans expect small stores / local businesses to have a clients bathroom. And when informed it doesn't exist, some demand to use the employees one  with the whole \"then i won't buy\" and that isn't just rude, it's lack of consideration for the one's working.\nIn most of Europe you either pay for the bathroom, use one in a shopping mall or a coffee place/restaurant. While i do agree the access to public free bathrooms should exist, as well people being compensated to clean it, if the answer is no, don't demand special treatment.\n\nOh also, you can be a tourist, but do respect the fact the place you're visiting is where people live, study and work. So avoid clogging public transport in rush hours, do not occupy the whole side walk (this one pisses me off so much), do your research on food, do not expect the senior owner of some restaurant to know english and please... stop driving up the cost of housing for the locals. If you wanna live in another country that you say you just love and adore, pay the damn local taxes! \n\nDo your research how your staying can actually impact the country in a neutral or even positive away and not just act how it's your theme park.\n\n(Yes i ranted, sorry. Being portuguese ain't easy when wealthy foreigners can enjoy your country more than yourself and policies are not helping)",
   "created_utc": 1696529438,
   "score": 44,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3n8imr",
   "message": "Avoid tipping just because your smug ass thinks you shouldn’t.",
   "created_utc": 1696547392,
   "score": 7,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lhqwk",
   "message": "Do not go to Gary, Indiana. Totally unsafe shithole. I’ve been there a handful of times and it’s a very depressing crime ridden town.",
   "created_utc": 1696524449,
   "score": 29,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m8tlg",
   "message": "Speak highly of the government. 90% of the country is pissed and someone will argue with you lmfao",
   "created_utc": 1696533969,
   "score": 6,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m96oe",
   "message": "drink the tap water",
   "created_utc": 1696534097,
   "score": 5,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3m9rbx",
   "message": "Feed the wildlife. Doesn’t have to be a bear, even raccoons will fuck you up.",
   "created_utc": 1696534300,
   "score": 5,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3n1oqp",
   "message": "USA: Don’t get out of the car if police pull you over.",
   "created_utc": 1696544533,
   "score": 5,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lhtsm",
   "message": "Don't say anything about other countries with elder people . Our old peoples are very strong and if they can eork in garden at age past 60 they can pucnh you very strongly",
   "created_utc": 1696524477,
   "score": 19,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3lw59j",
   "message": "Not tip in America. Doesn’t matter how you personally feel about it, it’s what we do here and you’re a dick if you don’t.",
   "created_utc": 1696529503,
   "score": 65,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ltft1",
   "message": "Kidnap a swan. They all belong to the king.",
   "created_utc": 1696528546,
   "score": 10,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mcgnq",
   "message": "Italy. The amount of morons (mostly tourists) climbing, scratching and desecrating monuments is stupidly high. Do these people really think it makes them cool to scratch their idiot name on someone else's millenary heritage? Beside being barbaric and ignorant, Italian taxpayers pay millions each year for monument restoration. I am a meek man, but any time one is caught in the act, I would instantly shoot them in the face with a rifle.",
   "created_utc": 1696535253,
   "score": 11,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mct3o",
   "message": "decide to stay but refuse to learn the language",
   "created_utc": 1696535375,
   "score": 10,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3mbkg5",
   "message": "Attempt to bring in drugs - unless you want to take a one way trip to the gallows.",
   "created_utc": 1696534939,
   "score": 5,
   "submission_id": "170mobm"
  },
  {
   "comment_id": "k3ne692",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "170mobm"
  }
 ]
}