{
 "submission_id": "170vbrf",
 "title": "What's the most fascinating piece of trivia or fact you know that always blows people's minds?",
 "selftext": "",
 "created_utc": 1696544557,
 "permalink": "/r/AskReddit/comments/170vbrf/whats_the_most_fascinating_piece_of_trivia_or/",
 "score": 223,
 "url": "https://www.reddit.com/r/AskReddit/comments/170vbrf/whats_the_most_fascinating_piece_of_trivia_or/",
 "comments": [
  {
   "comment_id": "k3nbhur",
   "message": "A tyrannosaurus was closer to seeing an IPad than it was to a stegosaurus",
   "created_utc": 1696548684,
   "score": 158,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n7bk9",
   "message": "The existence of full solar eclipses is a totally cosmic coincidence. The moon's diameter is roughly 400 times smaller than the sun's diameter, but the sun is also roughly 400 times further away than the moon currently is. The moon is actually getting further away from the sun by almost 4cm per year, meaning it used to be closer to the earth in the past. So the fact that the size we view the moon and the sun in the sky is nearly identical is a phenomenon just for this particular time in history. In the future, the moon will never be able to obscure the sun completely like it does now, rendering full solar eclipses impossible forevermore.",
   "created_utc": 1696546878,
   "score": 14,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n38r1",
   "message": "A day on Venus is longer than a year on Venus: Venus rotates very slowly on its axis, taking about 243 Earth days to complete one rotation. In contrast, it only takes about 225 Earth days for Venus to orbit the Sun. This means that a day on Venus (one rotation) is actually longer than a year on Venus (one orbit around the Sun).",
   "created_utc": 1696545175,
   "score": 173,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n5vr7",
   "message": "Nintendo was founded in 1889",
   "created_utc": 1696546269,
   "score": 72,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3na5nq",
   "message": "When the pyramids were built, there were still mammoths roaming around.",
   "created_utc": 1696548097,
   "score": 32,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n2ujs",
   "message": "About 117 billion members of our species have ever been born on Earth...\n\nIf that were grains of sand that would only fill half of a cement truck",
   "created_utc": 1696545013,
   "score": 66,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n73vp",
   "message": "The pacific entrance to the Panama Canal is east of the Atlantic entrance.",
   "created_utc": 1696546786,
   "score": 214,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n29xx",
   "message": "That the egg that you were conceived from was inside your grandmother...I find it fascinating anyway",
   "created_utc": 1696544778,
   "score": 245,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9d8d",
   "message": "Sharks are older than trees.",
   "created_utc": 1696547757,
   "score": 129,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ng2oe",
   "message": "When they were making the Wizard of Oz movie, the costumer when to a thrift shop to find a old coat that used to be expensive and dressy, but was worn out and shabby, for the Professor to wear. She bought a few, but the one the professor ended up using had a name stitched inside. The coat had belonged the L. Frank Baum. The author of The Wizard of Oz.",
   "created_utc": 1696550671,
   "score": 63,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n5xni",
   "message": "The rocket boosters for the space shuttle had to be transported by train.  So they had to be designed to fit through the tunnel on the train route.  The tunnel was obviously designed to fit a train.  The train size in the US was copied from England.  The English made the railroads the size they did because they used the same tools they already had from making chariots and roads.  The chariots and road sizes were from the Roman Empire building roads all over Europe with standard chariot sizes, based on the size of a horse. \n\nThe space shuttle design was partly based on the size of horses.",
   "created_utc": 1696546291,
   "score": 53,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n7grw",
   "message": "Air Force 1 is on the ground, yet Air Force 1 has one more takeoff than landing.",
   "created_utc": 1696546941,
   "score": 61,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ncemx",
   "message": "If you shuffle a 52-card deck of playing cards, it is very likely that the resulting order of cards has never been shuffled by anyone else in the world ever.",
   "created_utc": 1696549078,
   "score": 57,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nd4gi",
   "message": "Not sure it's that mindblowing but I literally blew somebody's mind with it today..\n\nThe bridges on the Euro notes weren't real, as they didn't want to put any existing landmarks on it and make it look like they were preferring some countries to others.\n\nSo then a city in the Netherlands, Spijkenisse, built the bridges.",
   "created_utc": 1696549391,
   "score": 100,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9oyk",
   "message": "The white lines on interstate highways are 10 feet long",
   "created_utc": 1696547897,
   "score": 246,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nemjw",
   "message": "One fascinating fact that often surprises people is that honey never spoils. Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3,000 years old and still perfectly edible. It's a testament to the remarkable preservation properties of honey!",
   "created_utc": 1696550044,
   "score": 42,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9wrf",
   "message": "Larry Fitzgerald had more tackles than drops in his NFL career",
   "created_utc": 1696547992,
   "score": 120,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ndwlf",
   "message": "The shotgun Ernest Hemingway used to commit suicide was purchased at Abercrombie and Fitch.",
   "created_utc": 1696549733,
   "score": 43,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n5wzm",
   "message": "There are more tigers in captivity in America than there are in the wild around the world",
   "created_utc": 1696546283,
   "score": 156,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3namtv",
   "message": "The Burj Khalifa, the tallest building in the world and the supposed epitome of luxurious oppulence, especially by people looove going to Dubai, is not connected to a sewer system. [Loads of trucks](https://ichef.bbci.co.uk/news/624/mcs/media/images/67715000/jpg/_67715562_trucks624.jpg) gather Burj Khalifa's sewage daily to be trucked out of the city and be hauled off to...somewhere.",
   "created_utc": 1696548307,
   "score": 139,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n5o1a",
   "message": "1/6 are mentally handicapped.",
   "created_utc": 1696546179,
   "score": 30,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n82kn",
   "message": "Moving outward from the solar system: The next closest star to Earth beyond the sun is Proxima Centauri, at a distance of 4.3 light-years (i.e., 4.3 x 6 trillion miles). It is one among billions in our galaxy, the Milky Way. The Milky Way is a pinwheel of stars 2,000 light-years \"thick\", and 100,000 light-years in diameter. It holds over a hundred-billion (one followed by 11 zeros) stars. The next closest spiral galaxy is M31 in the constellation Andromeda. It is nearly 2 million light-years away (12 million-trillion or 1.2 x 1013 miles). M31 is near the limit of naked eye visibility. The Hubble telescope extends the limit of visibility out to 10 billion (10,000,000,000) light-years. From Hubble, we estimate that there are about 50 billion (50,000,000,000) galaxies in the observable universe! And if each galaxy contains a hundred-billion stars, then the observable universe contains 5,000,000,000,000,000,000,000 (\"5\" followed by 21 zeros or five \"sextillion\") stars. By contrast, a cube of water, one inch on a side, contains about 600,000,000,000,000,000,000,000 (\"6\" followed by 23 zeros, or six-hundred sextillion) molecules! **There are 120 times more water molecules in the cubic inch of water than there are stars in the observable universe!!!**\n\nsource: https://www.grc.nasa.gov/www/k-12/Numbers/Math/Mathematical\\_Thinking/stars\\_and\\_drops.htm",
   "created_utc": 1696547201,
   "score": 135,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9now",
   "message": "When you look up at night at the stars, you’re not actually looking up, you’re looking out.\n\nYou have a front row view staring directly out at the infinite, inky, void of space.. All of it. Quasars, nebula, stellar nurseries, alien, civilizations, galaxies, intense radiation,. You have an unobstructed front row view of it. And there’s nothing between you it but about 60 miles of air and a whole lotta space.",
   "created_utc": 1696547882,
   "score": 79,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3neero",
   "message": "You could give every man women and child in the U.S. a half-acre of land, and they would all fit inside the state of Texas.",
   "created_utc": 1696549951,
   "score": 25,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n8h08",
   "message": "The Baha Men, who asked “Who Let The Dogs Out?”, started their band in 1977. That’s closer in time to the last British conviction for witchcraft (1944) than today.",
   "created_utc": 1696547372,
   "score": 90,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9h7j",
   "message": "Chainsaws were invented to help pregnant women give birth. (You can probably imagine how)",
   "created_utc": 1696547804,
   "score": 50,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nat4q",
   "message": "Wombats poop cubes.",
   "created_utc": 1696548384,
   "score": 47,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nbl2w",
   "message": "The \"ABC\" song and \"Twinkle Twinkle Little Star\" are the same song. And it was written by Mozart.",
   "created_utc": 1696548722,
   "score": 43,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nd5rp",
   "message": "Percentages are reversible, what l mean is x% of y is the same as y% of x.\n\nAs an example if you need to find out what 34% of 50 is, you can calculate 50% of 34 (which goes easier when no calculator’s nearby)",
   "created_utc": 1696549407,
   "score": 43,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n4hpx",
   "message": "The pyramids were as old to Cleopatra as Cleopatra is to us.",
   "created_utc": 1696545692,
   "score": 124,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9efk",
   "message": "Tom Brady in his entire NFL career never took a single snap in which his team was mathematically eliminated from the playoffs. Not one",
   "created_utc": 1696547770,
   "score": 75,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ndcsj",
   "message": "The world’s most populous French-speaking city is not Paris, it is Kinshasa in the DRC.\n\nBrazil is home to the largest Japanese population outside Japan.",
   "created_utc": 1696549491,
   "score": 22,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nevun",
   "message": "don’t know if it’s mind blowing, but… tippi hendren- hitchcock fave and melanie griffith mom- is the one who helped redefine the nail salon business. she had her own manicurist fly to her in vietnam to teach refugees how to do nails. they came to america and basically made nail salons what they are today.",
   "created_utc": 1696550157,
   "score": 25,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nh7zd",
   "message": "Platypuses don't have a stomach, and scientists aren't fully sure why. Also the baby platypus is born with teeth but have no use for them. Once they fall out they don't grow back. There are more things about the Platypus that don't make any sense. These are just the ones I find funniest.",
   "created_utc": 1696551168,
   "score": 20,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n8vgl",
   "message": "I guess it sounds weird, cos technically this applies with any countries, but greenland extends south, east, north and west of iceland.",
   "created_utc": 1696547544,
   "score": 18,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n99y6",
   "message": "Sharks are older than the rings of Saturn and the North Star",
   "created_utc": 1696547717,
   "score": 68,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9oc0",
   "message": "Bill Buckner has more hits than Ted Williams",
   "created_utc": 1696547889,
   "score": 16,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nd8tb",
   "message": "The US has almost certainly already had a gay president. James Buchanan.",
   "created_utc": 1696549442,
   "score": 36,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nesur",
   "message": "Axl Rose is an anagram of oral sex",
   "created_utc": 1696550121,
   "score": 34,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n603l",
   "message": "The statues of liberty’s index finger is 8 feet long",
   "created_utc": 1696546319,
   "score": 63,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n2gba",
   "message": "The human body contains enough bones to make an entire skeleton.",
   "created_utc": 1696544849,
   "score": 171,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n96xx",
   "message": "The US defense budget for 2022 was 877 Billion Dollars, it was more than the 10 next countries combined.\n\n[https://www.pgpf.org/chart-archive/0053\\_defense-comparison](https://www.pgpf.org/chart-archive/0053_defense-comparison)",
   "created_utc": 1696547681,
   "score": 46,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ng4ne",
   "message": "Bit more of a terrifying PSA, but,\n\n\nNewborns can't drink water. Their kidneys are not yet developed enough to control the concentration of salt in their blood and drinking water will wash enough sodium out of their blood to cause fatal hyponatremia. This is because sodium, among other salt ions, are essential for nerve cells as they form the the electric potential gradient that neurons and nerve cells use for their signaling\n\n\nTldr; never water down baby formula",
   "created_utc": 1696550696,
   "score": 13,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nap14",
   "message": "The only American city that lies directly north of a Canadian city is Detroit.\n\nDetroit, MI lies directly north of Windsor, ON.",
   "created_utc": 1696548334,
   "score": 31,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nfcrf",
   "message": "President Biden's date of birth is closer to Lincoln's presidency than his own presidency",
   "created_utc": 1696550359,
   "score": 30,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n5trb",
   "message": "Atoms are 99% empty space",
   "created_utc": 1696546246,
   "score": 54,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ndkcc",
   "message": "Autumn goes until almost the end of December 🍂",
   "created_utc": 1696549583,
   "score": 10,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nj5x5",
   "message": "When the black plague was sweeping through Europe, people were being pronounced dead when they really weren’t. People were literally waking up in their coffins. So it started to dawn on people that they might’ve been inadvertently burying people alive. So they started burying people with a string tied around their finger and if they woke up, they could ring the bell and whoever was working in the cemetery would dig them up. And that’s how we get the phrase, “saved by the bell.”",
   "created_utc": 1696551994,
   "score": 11,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nemfx",
   "message": "We throw around a Trillion like it's not a big deal anymore (US is $32T in debt etc...). \n\nA million seconds is 11+days. A billion seconds is 32+ years. A Trillion seconds is 31 688+years.\n\nAlso; If you spent $1million a day starting the day Christ was born you would have spent less than 3/4 of a Trillion dollars.\n\nGood luck with that debt America",
   "created_utc": 1696550042,
   "score": 39,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nbn7u",
   "message": "Urine comes from your blood",
   "created_utc": 1696548748,
   "score": 10,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nevfh",
   "message": "You are exactly tall enough to get yourself killed if you fall the wrong way. Enjoy! :D",
   "created_utc": 1696550152,
   "score": 11,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n79d5",
   "message": "If you follow your ancestry line back far enough, you’ll have ancestors who weren’t human!…. We all have non human ancestry!",
   "created_utc": 1696546852,
   "score": 47,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ndkp1",
   "message": "Just the fact of Voyager 1. Freaking fascinating.",
   "created_utc": 1696549587,
   "score": 9,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ne6pj",
   "message": "Baby carrots are made from adult carrots",
   "created_utc": 1696549855,
   "score": 9,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n2kob",
   "message": "DNA from male babies permanently alters the DNA of their mother",
   "created_utc": 1696544898,
   "score": 30,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n8ps9",
   "message": "Pesticides save forests. If there were no pesticides, a lot more agricultural land would be needed to feed the world's population, and consequently a lot more forests would need to be cleared.",
   "created_utc": 1696547477,
   "score": 29,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ne4o2",
   "message": "About half of all dogs are not good boys.\n\nThey're good girls.",
   "created_utc": 1696549831,
   "score": 34,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ncyfm",
   "message": "everyone is made of stardust. long dead exploded stars seed the universe in dust and we end up made of the dust. every part of you is likely from a different star. your right hand and your left hand probably don't even originally come from the same sides of the universe.",
   "created_utc": 1696549317,
   "score": 16,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n7oif",
   "message": "The reason that most American men are circumcised is because the guy who invented corn flakes thought that it would help cut down on masturbation.",
   "created_utc": 1696547032,
   "score": 69,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ne2i6",
   "message": "Some deadly Amazon frogs become harmless once you change their diet.",
   "created_utc": 1696549805,
   "score": 9,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nkqea",
   "message": "Cookie Monster's name is Sid",
   "created_utc": 1696552664,
   "score": 1,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9jo7",
   "message": "Frankenberry caused a bunch of kids to visit the ER because of pink poop. [Yes, really](https://www.smithsonianmag.com/arts-culture/franken-berry-the-beloved-halloween-cereal-was-once-medically-found-to-cause-pink-poop-7114570/). This caused General Mills to reformulate the cereal.",
   "created_utc": 1696547833,
   "score": 15,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nho6v",
   "message": "John Tyler, US president in 1845 and born in 1790, still has a living grandson.",
   "created_utc": 1696551361,
   "score": 8,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3neaxv",
   "message": "Jaguars have the strongest bite of any big cat, and the 5th strongest in the entire animal kingdom, even more than a grizzly bear. They use those jaws to pierce the skulls of their prey, and drag them up into the trees. They can bite through turtle shells. They eat crocodiles and can swim completely silent. \n\nAbsolute killing machines, the last big cat I'd want to fuck with.",
   "created_utc": 1696549906,
   "score": 13,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n7win",
   "message": "If your shoe laces are always un-tied you are wrapping the knot the wrong way.",
   "created_utc": 1696547129,
   "score": 12,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nbt9r",
   "message": "If you laid out all your veins and capillaries in your body in a line.\n\nYou'd be dead",
   "created_utc": 1696548821,
   "score": 41,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3narem",
   "message": "Reno, NV is further west than Los Angeles, CA.",
   "created_utc": 1696548363,
   "score": 6,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nbax7",
   "message": "While the other planets orbit in a consistent track around the Sun, Mercury comes out of its perihelion--the closest part of its orbit to the sun--at a slightly different angle than each previous orbit, because it is so close and the Sun is so massive that we're able to observe the effect of temporal distortion.  It spends a different amount of time passing through that perihelion than we spend observing it.",
   "created_utc": 1696548600,
   "score": 6,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nd2sh",
   "message": "Sharks are older than Saturn's rings",
   "created_utc": 1696549371,
   "score": 7,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n9cr6",
   "message": "Electrons can travel faster than light in water.\n\nWhen people say nothing can travel faster than light they are getting that wrong. What they should be saying is nothing with a rest mass greater than zero can accelerate to match, or exceed the speed of causality. Light travels at the speed of causality in a vacuum as it has zero rest mass.\n\nLight slows down when it travels through different mediums and Electrons can travel faster than light in water. It creates Cherenkov radiation.\n\n[https://en.wikipedia.org/wiki/Cherenkov\\_radiation](https://en.wikipedia.org/wiki/Cherenkov_radiation)",
   "created_utc": 1696547751,
   "score": 15,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n6sni",
   "message": "Reno is further west than LA",
   "created_utc": 1696546653,
   "score": 22,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3ndvbo",
   "message": "Idaho has a seaport.",
   "created_utc": 1696549717,
   "score": 7,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nejoy",
   "message": "A giraffe has the same number of neck bones (vertebrae) as a human: 7.",
   "created_utc": 1696550009,
   "score": 5,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nhiqd",
   "message": "The only reason plutonium is abbreviated \"Pu\" on the periodic table instead of \"Pl\" (which would have made more sense since the element is named after Pluto) is because Glenn Seaborg, who was on the team to first produce Plutonium, submitted \"Pu\" to the naming committee as a joke.\n\nFrom *Los Alamos Science*, \"Reflections on the Legacy of a Legend: Glenn T. Seaborg, 1912–1999\":\n\n\u0026gt;Seaborg and coworkers considered the name “plutium” but it “…\\[d\\]idn’t roll off of the tongue like the name plutonium,” said Seaborg in one of his lectures. The obvious choice for the symbol would have been Pl, but facetiously, Seaborg suggested Pu, like the words a child would exclaim, “Pee-yoo!” when smelling something bad. Seaborg thought that he would receive a great deal of flak over that suggestion, but the naming committee accepted the symbol without a word.",
   "created_utc": 1696551296,
   "score": 5,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nibwl",
   "message": "San Juan, Puerto Rico is supposed to be Puerto Rico, San Juan. \n\nPuerto Rico was the city name until someone screwed up a map.",
   "created_utc": 1696551644,
   "score": 5,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3nmjpf",
   "message": "Bar stands for Beer and Alcohol Room",
   "created_utc": 1696553430,
   "score": 1,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3najrs",
   "message": "If you are of European ancestry?  You are absolutely, positively related to Charlemagne.  \n\nhttp://www.colleengenealogy.net/everyonecharlemagne.html",
   "created_utc": 1696548268,
   "score": 12,
   "submission_id": "170vbrf"
  },
  {
   "comment_id": "k3n6p7y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "170vbrf"
  }
 ]
}