{
 "submission_id": "171bv0s",
 "title": "What is something random you have to tell everyone?",
 "selftext": "",
 "created_utc": 1696597642,
 "permalink": "/r/AskReddit/comments/171bv0s/what_is_something_random_you_have_to_tell_everyone/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/171bv0s/what_is_something_random_you_have_to_tell_everyone/",
 "comments": [
  {
   "comment_id": "k3pve4m",
   "message": "Whale oil was used in automatic transmission fluid until 1973. \n\nThe King family sued the US government, accusing the United States of being involved in a conspiracy to assassinate Martin Luther King Jr. They won. Adamant to not make it about money, they only sued for $100 and donated that to charity. \n\nHoney bees can recognize human faces. \n\nFish can hear.",
   "created_utc": 1696601488,
   "score": 109,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q48eu",
   "message": "I'm in Ecuador and have taught a good 15 people or so that all mosquitoes that bite you are female. That they need the blood to produce eggs.\n\nFollow up statement. (Quite literally to the first fact)\n\nI tell them by killing a biting mosquito you're not just ending one mosquito, but all the future ones she would have produced. \n\nYou are the Slayer of generations, not one single mosquito\n\nEdit: based on the reception of this comment I think this makes this officially my most taught fact ever. \n\nThanks y'all for making this a possibly. I will wear this badge with honor.",
   "created_utc": 1696604854,
   "score": 179,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pt53g",
   "message": "Back up your hard drive. It's not a question of if it will fail, it's a question of when.",
   "created_utc": 1696600580,
   "score": 61,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pnr2q",
   "message": "The thing you stand behind to make a speech is NOT a podium. You stand ON a podium. What you stand behind is called a LECTERN",
   "created_utc": 1696598313,
   "score": 219,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qb71o",
   "message": "Extremely useful website most people probably don’t know about\n\n\n* [radio.garden](https://radio.garden/visit/novo-mesto/w1Wiki0r) : Listen to radio around the world\n\n* [Lp.deals](https://lp.deals/) : Products at their lowest price right now \n\n\n\n* [libgen](https://libgen.is/) - download almost any textbook as e-copy\n\n* [sci-hub](https://sci-hub.mksa.top/) - gives free access to download almost any paper.\n\n* [Terms of Service, Didn’t Read](https://tosdr.org/) summarizes terms of service and rates them for privacy.\n\n* [futureme.org](https://www.futureme.org/) you can use it to \"send emails to the future you\". been using it for almost 3 years. It helps put into perspective how much has changed over the course of a year.\n\n* [photopea](https://www.photopea.com/) Online image editor with Photoshop feature.\n\n* [12ft](https://12ft.io/) It bypasses all paywalls and removes all ads from any webpage I have found. Show me a 10ft paywall, I’ll show you a 12ft ladder. No install, just copy and paste your link\n\n* [oldgamesdownload](https://oldgamesdownload.com/) : This website has every single pc game from the 70's,80's,90's till the early 2000's.\n\n* [myAbandonware](https://www.myabandonware.com/) is a far better option than old games download\n\n* [flightradar24](https://www.flightradar24.com/52.52,13.39/4) : Wondering where that plane, jet, or helicopter is going? Check them out (NOTE :Dont buy anything on that site just use it for further info only)\n\n* [unsplash](https://unsplash.com/) : Tons of free-to-use images of damn near everything.\n\n\nUse the library for everything you can: textbooks, movies, games, music\n\nI hope all these would also help\n\nr/frugal\n\nr/discountedproducts\n\nr/povertyfinance\n\nBudgetbytes.com",
   "created_utc": 1696607416,
   "score": 125,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q4cuj",
   "message": "If you were to eat a different variety of apple everyday, it would take over 20 years to try them all.",
   "created_utc": 1696604901,
   "score": 137,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3prtiq",
   "message": "Always be polite because you never know who’s a violent psycho about to snap.",
   "created_utc": 1696600039,
   "score": 81,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pvsu3",
   "message": "Pigeons are fantastic pets. They're not just in cities either, if you have a good eye you'll see them nesting just about everywhere there's a large man made structure. They're not native outside of Africa. They're also domesticated like a cat or a dog. If you catch one you can tame them down in the same way you can tame down a feral cat.",
   "created_utc": 1696601649,
   "score": 77,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q1ycl",
   "message": "I am down 42 pounds in 4 months!",
   "created_utc": 1696603996,
   "score": 247,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q50p7",
   "message": "just because i have medium skin tone and dark hair doesn't mean i speak spanish.",
   "created_utc": 1696605148,
   "score": 166,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qdw95",
   "message": "I’m proposing today and getting through the work day is killllling me",
   "created_utc": 1696608396,
   "score": 149,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pw3hs",
   "message": "Sometimes the smallest gesture could mean the world to someone",
   "created_utc": 1696601765,
   "score": 204,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3psm4o",
   "message": "I saw a cardinal just now! The myth around cardinals is that they're the souls of our lost loved ones coming back to see us. I know it's 100% bullshit but I like to think that it's my brother coming by to say \"hello\" even though it's very silly.",
   "created_utc": 1696600367,
   "score": 21,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qa90w",
   "message": "Quitting anything addictive is a lot easier if you're as sick as a dog. I'm currently quitting weed again while sick with covid",
   "created_utc": 1696607074,
   "score": 123,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q4ksv",
   "message": "When I got with my first bf I was a college freshman and he was a junior. I fell for him fast and hard but I tried to play it cool because I didn't want him to get scared off. I kept this shit up for 7 months.\n\nAt the end of the school year he came by my dorm and told me he thought we should see other people because he was my first real relationship and, given my age, he felt I should have the chance to see what else is out there.\n\nI was devastated, but the only reaction I showed was a shrug and something like \"sounds reasonable.\"\n\n**Literally the moment he left, and closed the door behind him, I burst into tears. I was fucking sobbing when, about 30 seconds later, there was a knock on the door.**\n\nI didn't answer, but then I heard him saying \"hey, I left my bag in your room...\"\n\n**FUCK.ME.RAW.** \n\nIn that moment I would have honestly rather cut a finger off than opened the door...but he KNEW I was in there. So...I opened the door a crack (while hiding behind it) and stuck his bag out.\n\nHe LAUGHED (motherfucker!) and asked what I was doing, before pushing the door open all the way.\n\nUltimately it all worked out but I'm still mortified when I think back on it today.",
   "created_utc": 1696604983,
   "score": 2,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q2ed2",
   "message": "How clean my floors are. I got a Swiffer wet jet for wood floors and I clean my apartment with it. I like using that thing and am impressed by it's effectiveness. I am not a shill for Swiffer, but I may be autistic so I talk about floor cleanliness with my coworkers constantly. Anyone want to see some clean floors, I tell you what my floors are spotless. I got a cat and that thing leaves my floors a wreck, but not with the power of SWIFFER WET JET FOR HARDWOOD FLOORS tm. Dang thing even has headlights. Does it need them? Probably not, but if you want to swifferize yo nasty floor in the dark? Sounds like a good way to spend the twilight hours.",
   "created_utc": 1696604162,
   "score": 231,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qdnus",
   "message": "That my dress has pockets\n\nLOOK AT THEM!",
   "created_utc": 1696608311,
   "score": 187,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q0vja",
   "message": "you don’t need to throw a tantrum at a kids sports game if you’re an adult, if you’re a kid you still shouldn’t throw a fit but at least you have an excuse",
   "created_utc": 1696603595,
   "score": 223,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pth4k",
   "message": "If you clap above a house fly it will fly into your hands and die",
   "created_utc": 1696600714,
   "score": 65,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qk8wo",
   "message": "Sharks evolved before trees.\n\nIt’s probably annoying how much I love to share this fact.",
   "created_utc": 1696610721,
   "score": 92,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qkicu",
   "message": "I have a date tonight and think I like her and hope things go well 😌",
   "created_utc": 1696610819,
   "score": 82,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q5iop",
   "message": "I coach American football in the UK. It's a niche sport so we're always recruiting and you never know who will love it.",
   "created_utc": 1696605336,
   "score": 44,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qb22h",
   "message": "My IUD has made my iron levels so high I will need to donate blood, all because I don't get a period.",
   "created_utc": 1696607367,
   "score": 176,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pxz39",
   "message": "I’ve become hyperfixated on a show about an angel and a demon. It has provided me with a lot of serotonin and dopamine.",
   "created_utc": 1696602493,
   "score": 140,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q9jj0",
   "message": "Bananas are berries, but strawberries are not. Botanically speaking, bananas qualify as berries because they have seeds inside, while strawberries, technically known as \"aggregate fruits,\" have their seeds on the outside. It's a bit counterintuitive",
   "created_utc": 1696606816,
   "score": 220,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qfclq",
   "message": "That my son has a rare terminal genetic disease called Krabbe Disease, and even though it's very rare, it's not tested for at birth in 39 states in the US, so you should have no way of knowing until it's too late. In March of this year,  my boy was 20 months old and thriving. Walking, talking, and acting like any normal, almost two year old boy, until he wasn't. One day, he stopped putting weight on his legs. Within a week, he couldn't sit up on his own. We got the diagnosis within a couple of weeks,  much quicker than most families are able to. By then, he had lost his ability to crawl, and he was losing his arm and hand mobility as well. Through a series of what seemed like divine instances, we were able to have him evaluated to see if he could get a stem cell transplant to prolong his life. We have been in the hospital in Pittsburgh for 5 months now. He has gone through chemotherapy and the transplant, defying odds along the way. We hope to get him into a clinical trial for gene therapy, as that seems like the only path to a cure. \n\nMy point in telling everyone I can is to spread the information about this disease and others like it so people can be more prepared where we weren't. Every state should have newborn screening, as catching it at birth can let these children live longer lives before beginning to feel the effects of the disease. As of now, my son will never walk again. Never crawl. Maybe never talk. If we had known at birth, he would most likely still have those abilities. Get genetic testing if you can. Their are third-party companies that can run a full genetic panel to let you know what you may be at risk for passing onto your children. \n\nMy son has a page we use to spread awareness if anyone would like to see his journey through all of this. It's called Prayers for Arthur, hope for a cure. No child or family should ever have to endure this. I try to spread the word however I can.",
   "created_utc": 1696608928,
   "score": 103,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q4grz",
   "message": "I'm not ignoring you or trying to be rude. It's so much easier for me to hear what you are saying if I don't look at your face.",
   "created_utc": 1696604941,
   "score": 130,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q98uv",
   "message": "One inch of rain is equivalent to roughly one foot of snowfall.",
   "created_utc": 1696606710,
   "score": 100,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q04tj",
   "message": "I painted my front door lime green and it looks so fun and nice. Until I open the door and it clashes horribly with my fun and nice mint green living room wall. I don't know what to do.",
   "created_utc": 1696603316,
   "score": 89,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q4zwt",
   "message": "Just because you have a portable speaker, doesn't mean that everyone else in a 300 yard radius wants to hear your music too...",
   "created_utc": 1696605140,
   "score": 138,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q6hii",
   "message": "I'm the 1 in a billion. I'm allergic to THC and I hate it.",
   "created_utc": 1696605695,
   "score": 31,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3ptt8z",
   "message": "Out of all of the 42000 species of spiders, only 62 species can kill a person with their venom.\n\n\nEdit: I used poison instead of venom. Thanks for correcting me! 😄",
   "created_utc": 1696600850,
   "score": 184,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q8v6v",
   "message": "I have no idea what to do with my life and I am freaking out",
   "created_utc": 1696606572,
   "score": 57,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q9uv4",
   "message": "The original meaning behind the phrase “the terrible twos”. While we use it now for behavior problems in toddlers, it originally referred to the time period a child was most likely to die before the advent of germ theory and modern medicine / vaccines. This is the stage of development where they become more mobile, and are consuming more types of food that may be of varying levels of food safety, and have a greater likelihood of getting into things or getting injured. It’s a great fun fact at parties …",
   "created_utc": 1696606931,
   "score": 26,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q18bc",
   "message": "higher levels of testosterone dont make you more masculine. excess testosterone (\u0026gt;1000 ng/dl) gets converted into estrogen and has a feminizing effect. it also thickens the blood, which is why men are more at risk of heart attacks.",
   "created_utc": 1696603728,
   "score": 122,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q13e0",
   "message": "If you're stuck in a negative cycle, look for your role and how you play into the matter and why you allow it to keep happening..\n\nOnly you can save you",
   "created_utc": 1696603677,
   "score": 72,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q99j6",
   "message": "I tell everyone I'm ok..",
   "created_utc": 1696606716,
   "score": 21,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qk29c",
   "message": "I don’t technically have a hearing problem, but sometimes when there’s a lot of noises occurring at the same time, I hear them as one big jumble. \n\nAgain it’s not that I can’t hear, I just can’t distinguish between everything I’m hearing.",
   "created_utc": 1696610652,
   "score": 21,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pyamh",
   "message": "Start with the end in mind",
   "created_utc": 1696602617,
   "score": 19,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qg369",
   "message": "Type 1 diabetes is an autoimmune disorder, type 2 is metabolic. There is no known cause or cure for type 1.",
   "created_utc": 1696609199,
   "score": 19,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qc0lp",
   "message": "Bread is like junk food to ducks if you feed ducks bread they’ll swell up",
   "created_utc": 1696607711,
   "score": 16,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qeic9",
   "message": "Alcatraz means Pelican",
   "created_utc": 1696608620,
   "score": 19,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q97pn",
   "message": "If you don’t want to become a person that does [insert anything], don’t even do it once just to see. It instantly breaks down the most difficult barrier in your mind that appears whenever you consider doing the thing and building that barrier back up through force of will is far more difficult and time consuming. \n\nFor example, in my youth I would have never starting smoking cigs. In college, I started smoking at parties because I needed to get away and it was easier to have a personal conversation in the smoking areas. \n\nBut I never really considered myself a smoker until I decided to pay my friend back for all the cigs I had bummed off him by buying him a pack. It was for him right? It wasn’t for me so I don’t have to feel bad about it. \n\nThe problem was I had built up a mountain of anxiety around buying that first pack of cigs and suddenly I realized no one judges me more poorly while purchasing it than myself and it destroyed that barrier from buying cigs. I truly became a smoker for the next 6 or so years before I switched to vaping and eventually quit all together. \n\nI find that scenario is true for a lot of bad habits. After you try anything once, it makes it easier to try or rationalize trying it again.",
   "created_utc": 1696606698,
   "score": 34,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q5lag",
   "message": "Air Fryers are just convection ovens with better marketing.\n\nWhat you have attached to your toilet isn't a bidet. It's a butt sprayer attachment. Bidets are a standalone fixtures.",
   "created_utc": 1696605363,
   "score": 129,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qtpt6",
   "message": "I have a strongman contest on Sunday! I've never felt less mentally prepared for a contest before, but I've never seen myself this strong. I feel low levels of confidence but when I watch video of my training, I look like I've made huge improvements.\n\nI'm both ready for it to be over, and excited for it to happen. Such an odd mix of feelings.",
   "created_utc": 1696614161,
   "score": 16,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qbiq2",
   "message": "I once bought Robert Englund (Freddy Kruger actor) a glass of wine and we talked about movies for an hour and my MIL danced with Ed Gein at a mental hospital in Wisconsin.",
   "created_utc": 1696607531,
   "score": 15,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qmry2",
   "message": "Never knew why, but i like telling random shit about animals.... Like did you know male snails bite off their penises after sex!?",
   "created_utc": 1696611644,
   "score": 15,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qf1pn",
   "message": "It is Espresso not Expresso , smh",
   "created_utc": 1696608816,
   "score": 15,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q6zh4",
   "message": "When giving a hi five, if you look at the other persons elbow, you’ll never miss.",
   "created_utc": 1696605878,
   "score": 58,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q7359",
   "message": "I know a lot about clouds, I find myself bringing up cloud facts quite often. Especially when I see my favorite clouds, or clouds that indicate weather that contradicts what the weather channel forecasted.",
   "created_utc": 1696605915,
   "score": 36,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qf7q3",
   "message": "Giraffes tongues are blue/black cause they have extra melanin to prevent sunburns while they eat",
   "created_utc": 1696608878,
   "score": 12,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qjurc",
   "message": "Earth is round. If you are defending otherwise then you are not going anywhere in your life. That's a basic rule...",
   "created_utc": 1696610575,
   "score": 13,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q22bc",
   "message": "Loud pipes do not save lives. They can actually make it more difficult to determine where a biker is since the reverb will seem like it's coming from all directions in a cars cabin. This is an excuse Harley riders use to be obnoxious.",
   "created_utc": 1696604037,
   "score": 72,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qmjct",
   "message": "I’m passing a kidney stone right now and the pain is beyond imagination.",
   "created_utc": 1696611558,
   "score": 11,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q9yli",
   "message": "Butterflies don't poop.",
   "created_utc": 1696606969,
   "score": 37,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3pwgal",
   "message": "I’m going to be homeless at the end of the month.",
   "created_utc": 1696601905,
   "score": 51,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qg8et",
   "message": "I'm so glad we have brown cows, otherwise there wouldn’t be any chocolate milk.",
   "created_utc": 1696609250,
   "score": 63,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qkkml",
   "message": "Changing the clock twice a year was invented by the German Kaiser as a way to save coal. It didn't save coal. Wilson adopted it so he could play more golf. Farmers were against it when it came out. \n\nThere is literally no reason to change the clocks twice a year other than we have this delusion we have to change the clocks twice a year.",
   "created_utc": 1696610842,
   "score": 20,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qat6z",
   "message": "i have fantasised from a young age that a bomb would just randomly fall out of the sky and land on my home, killing me and my family so no one has to deal with the hell i cause or suffer at the words, hands and teeth of my mother.",
   "created_utc": 1696607277,
   "score": 9,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qe4bq",
   "message": "I'm not Asian or Latino. I'm Native American",
   "created_utc": 1696608478,
   "score": 10,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q48an",
   "message": "Nobody cares what job you have , what car you drive , what clothes you wear , how successful you think you are compared to what society tells you. Being a good person and doing things that help humanity are way more important and respectable.",
   "created_utc": 1696604853,
   "score": 55,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q5zci",
   "message": "Driving is not a competition.\n\nYou don't \"win\" if you get to your destination faster.\n\nI'm talking to people who feel that they \"lose\" if someone pulls out in front of them and slows them down *a little.*\n\nI'm talking to people who will do everything they can not to slow down when a car is making a left in front of them in a two-lane road, such as cut it *really* close, or go on the shoulder.\n\nI'm talking to people who HAVE to be first in a lane at the red light.\n\nI'm talking to people who have someone turning right in front of them so they will change lanes to the left lane, even if it's a risky fit. \n\nI'm talking to people who slam the accelerator off a red.\n\nI'm talking to people who speed up at yellows.\n\nI promise you don't win anything if you get to your destination faster.",
   "created_utc": 1696605510,
   "score": 8,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qb5vg",
   "message": "A baby platypus is called a puggle",
   "created_utc": 1696607404,
   "score": 8,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qfknn",
   "message": "Be kind to everyone.",
   "created_utc": 1696609009,
   "score": 7,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3qgtrs",
   "message": "The crackhead at the gas station is right...you are really beautiful. Don't ever think otherwise ❤️",
   "created_utc": 1696609464,
   "score": 9,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3q94gz",
   "message": "I probably have fecal impaction and I have no clue what to do and my flight is in two days :)\nSomeone help",
   "created_utc": 1696606665,
   "score": 16,
   "submission_id": "171bv0s"
  },
  {
   "comment_id": "k3r6eqq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "171bv0s"
  }
 ]
}