{
 "submission_id": "171h1zq",
 "title": "what is a beauty standard you cant believe people actually like?",
 "selftext": "",
 "created_utc": 1696610222,
 "permalink": "/r/AskReddit/comments/171h1zq/what_is_a_beauty_standard_you_cant_believe_people/",
 "score": 38,
 "url": "https://www.reddit.com/r/AskReddit/comments/171h1zq/what_is_a_beauty_standard_you_cant_believe_people/",
 "comments": [
  {
   "comment_id": "k3qlzbb",
   "message": "What people do to their lips is wild to me.",
   "created_utc": 1696611355,
   "score": 32,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qpcoo",
   "message": "Photos where the skin has been edited so heavily that it's lost all texture and character.\r  \n\r  \nPeople aren't plastic. Stop it with that shit.",
   "created_utc": 1696612590,
   "score": 24,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qqej5",
   "message": "Dentist: So what shade of veneer would you like?\r  \n\r  \nVeneer patient: I'd like refrigerator white please.",
   "created_utc": 1696612969,
   "score": 247,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qr7h7",
   "message": "When people do their lipstick way past their lip line to make them look bigger. It just looks weird imo but you do you",
   "created_utc": 1696613256,
   "score": 189,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qlvn0",
   "message": "Buccal fat removal",
   "created_utc": 1696611318,
   "score": 61,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qj2rj",
   "message": "orange-y tans",
   "created_utc": 1696610287,
   "score": 190,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qqr4x",
   "message": "Stupid eyebrows that look like perfectly angled stencils is a shade way too dark for their complexion. Like blond girls with 2 black geometric boomerangs on her forehead.",
   "created_utc": 1696613094,
   "score": 38,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qrbd1",
   "message": "Giant eyelashes that will make you take flight if you flutter them fast enough.",
   "created_utc": 1696613296,
   "score": 89,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qlfgs",
   "message": "Butt implants.  Just looks nasty as hell.",
   "created_utc": 1696611157,
   "score": 235,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qjad4",
   "message": "Extremely big lips from injections. Natural big lips are pretty; even a little filler is good. But it should fit your face, i think having your skin stretched out like that is just a no.",
   "created_utc": 1696610364,
   "score": 72,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qym9p",
   "message": "Super groomed men that look like their beards and eyebrows are tattooed on their faces and those cat eye trends. It gives me uncanny valley feelings.",
   "created_utc": 1696615925,
   "score": 162,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3r0jhv",
   "message": "Every nose looking exactly the same.",
   "created_utc": 1696616627,
   "score": 152,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qnlae",
   "message": "[deleted]",
   "created_utc": 1696611944,
   "score": 31,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qx9uk",
   "message": "ski slope/button nose. they are cute but not everyone’s face is meant to have that type of nose and it doesn’t look good on everyone and it sucks seeing so many young girls on tiktok get nose jobs and all have the exact same nose",
   "created_utc": 1696615439,
   "score": 130,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3rcopc",
   "message": "Any plastic surgery that makes random women look like they're all related. At one point we'll all start to think thin lips and big noses are hot solely because they'll stand out in a sea of copy/paste people.",
   "created_utc": 1696621107,
   "score": 192,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qu8mc",
   "message": "Comically large fake eyelashes. They look ridiculous and I imagine they’re uncomfortable. I genuinely don’t understand how people can see with them on or why anyone would think they’re an enhancement.\n\n*To be clear, I’m not talking about normal fake eyelashes. Those can be lovely!",
   "created_utc": 1696614348,
   "score": 71,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qpkli",
   "message": "unnatural looking cosmetic work/ the Instagram model look. It’s weird looking, and I can’t imagine that one would age gracefully with implants that need to be replaced every decade or so, filler that migrates on the face, that sort of thing. Basically any permanent change that follows a trend in what bodies or faces are promoted as attractive at the present. Not to mention that so many people go to the same five surgeons, so they get the same five faces, it’s a little uncanny valley for me.",
   "created_utc": 1696612671,
   "score": 250,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qmk0u",
   "message": "[deleted]",
   "created_utc": 1696611564,
   "score": 228,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qs13b",
   "message": "The giant fake butts. Looks deformed lol",
   "created_utc": 1696613556,
   "score": 225,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qrydx",
   "message": "Idk if I’d call this a standard but the hair style of “shaved all around with like six inches in a small patch on top” has never looked good to me on men or women. It’s not a hair style I really understand",
   "created_utc": 1696613528,
   "score": 12,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qk7t7",
   "message": "* When your lips look like you took a drink out of a can that had a yellow jacket resting on it\n* The entire face filled drastically to eliminate all wrinkles, making a person's face look like it belongs to a body that weighs 50 pounds more",
   "created_utc": 1696610709,
   "score": 160,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qo9i1",
   "message": "Laminated, combed-up, thick ass eyebrows. Why.",
   "created_utc": 1696612189,
   "score": 202,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qw1so",
   "message": "The fact that a huge portion of the world's population has successfully brainwashed itself into thinking that the Kardashians/Jenners are the epitome of beauty to the point that many are willing to imitate whatever moronic thing they do to their bodies is just wild to me.",
   "created_utc": 1696614993,
   "score": 237,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qmns3",
   "message": "i don’t know how to phrase this except.. all of it at once? there comes a point where if any one person tries to conform excessively to trend and standard that they become more of a caricature of beauty or femininity than actually perceived as beautiful.",
   "created_utc": 1696611602,
   "score": 162,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3quolb",
   "message": "Those grossly buff guys on all dating shows. They all look like Gaston from beauty and the beast and I hate it so much I don’t even watch those shows but the lack of variety is appalling",
   "created_utc": 1696614506,
   "score": 47,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qmd2t",
   "message": "ALL OF THEM, YOU'RE NOT THE BOSS OF ME I DO WHAT I WANT",
   "created_utc": 1696611494,
   "score": 248,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3rcffz",
   "message": "I’m from Stockholm. A lot of girls, particularly from rich areas, like to use so much fake tan that they are orange, and bleach their hair from what was usually dark blonde to platinum blonde. Then they style it to make it voluminous (which is easy to do because their hair is dead from all the dyeing) and apply lots of make-up, which typically includes black mascara or fake lashes. So, a lot of girls here bear a striking resemblance to Miss Piggy. There’s nothing wrong with looking like this, I just don’t understand it.",
   "created_utc": 1696621010,
   "score": 52,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3r0z3m",
   "message": "Lips that have been excessively augmented through injections can be unattractive. Naturally full lips can be quite appealing, and a subtle use of filler can enhance their beauty. However, it's important that the enhancement complements your facial features, as overly stretched skin can be unappealing.",
   "created_utc": 1696616784,
   "score": 218,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qp09y",
   "message": "Unnatural extreme white veneers. Many celebs get them even if they had overall nice teeth before.",
   "created_utc": 1696612465,
   "score": 233,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qj7nf",
   "message": "long nails",
   "created_utc": 1696610337,
   "score": 219,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qq397",
   "message": "[removed]",
   "created_utc": 1696612857,
   "score": 99,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qrmtk",
   "message": "Huge, planet sized bubble asses. Fucking gross.",
   "created_utc": 1696613412,
   "score": 199,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qqe0p",
   "message": "Cartoonish big butts/hips",
   "created_utc": 1696612964,
   "score": 62,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3rmkgg",
   "message": "People in India will choose an unattractive fair skinned girl over a darker skinned girl who’s objective beautiful. This is why they get better treatment in Hollywood than Bollywood. Fair skin is a MASSIVELY inflated beauty standard and people ruin their perfectly good skin over it.\n\nThere are some things that are objectively beautiful based on studies: Teeth, Specific Facial Features, Leanness, etc. There isn’t much evidence to support that fairer skin is more beautiful.",
   "created_utc": 1696624762,
   "score": 188,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qzkmh",
   "message": "That stupid look a lot of women blow tons of money on plastic surgery to get where their noses essentially become these tiny, thin, pointy, things while their cheeks look like someone inserted a pair of tennis balls into their faces topped off with comically large lips that look like those fake lips you use to buy at the arcade for like 20 tickets.",
   "created_utc": 1696616274,
   "score": 84,
   "submission_id": "171h1zq"
  },
  {
   "comment_id": "k3qyh3g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "171h1zq"
  }
 ]
}