{
 "submission_id": "171likm",
 "title": "Why do YOU think everyone is so miserable these days?",
 "selftext": "",
 "created_utc": 1696620869,
 "permalink": "/r/AskReddit/comments/171likm/why_do_you_think_everyone_is_so_miserable_these/",
 "score": 63,
 "url": "https://www.reddit.com/r/AskReddit/comments/171likm/why_do_you_think_everyone_is_so_miserable_these/",
 "comments": [
  {
   "comment_id": "k3rsc2s",
   "message": "Work. Home. Sleep. So many people are in this cycle and most hardly sleep. They do not give themselves permission to enjoy life or have hobbies. Social media is a huge issue as well. People have forgotten how to connect to other people. Dating these days? No fucking thank you. People do not take care of themselves anymore health wise. Mental and physical health.",
   "created_utc": 1696626963,
   "score": 107,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rn1y7",
   "message": "Dissolution of community bonds and a consequent lack of purpose.",
   "created_utc": 1696624945,
   "score": 239,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rcszn",
   "message": "No third place outside home and work",
   "created_utc": 1696621151,
   "score": 10,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rmqdq",
   "message": "The sense of community is dimming away. People need feelings and relationships and the this world is taking it from us. The most miserable people are alone people.",
   "created_utc": 1696624825,
   "score": 162,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s7wm1",
   "message": "Jobs pay shit, housing is unaffordable, earth is dying, mental health resources are shit(many personal experiences), anger has trumped love, social media is a soul sucking monster",
   "created_utc": 1696633487,
   "score": 184,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3roxla",
   "message": "Life is meant to be shared. And I've tried sharing my life with my family and friends (now former) but they aren't interested in sharing experiences with me. They. Don't. Like. Anything.",
   "created_utc": 1696625645,
   "score": 40,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rnx92",
   "message": "Reddit, twitter, instagram, tik tok, etc.",
   "created_utc": 1696625269,
   "score": 29,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rjibb",
   "message": "it’s literally the Internet. Everyone is stuck on their phones inside their home. No life, comparing themselves to everyone they see through social media.",
   "created_utc": 1696623616,
   "score": 238,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rcoxz",
   "message": "Late stage capitalism has reached a point where it is too expensive to live. Everything is moving towards a rental economy, where no one owns anything and pays monthly subscriptions for many services and products.\n\nThe added stress of declining buying power has everyone on edge. Couple this with rising rent and out of reach housing market, and it is a recipe for disaster.\n\nToss in the mix the lack of privacy, prevalence of social media, and constant comparisons with the fake portrayal of everyone else's 'happiness' causes people to measure their lives against a fantasy and be less satisfied.",
   "created_utc": 1696621110,
   "score": 22,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rdbkb",
   "message": "We're alienated and atomised from the society around us and the fruits of our work. Many people lack purpose. Modern life holds no meaning beyond the dull and tedious quotidian.",
   "created_utc": 1696621338,
   "score": 76,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rcdf5",
   "message": "They forget to enjoy the little things, constantly being in a race for success. This is how life flies by, without looking at the beautiful world, dwelling on their problems and mistakes",
   "created_utc": 1696620989,
   "score": 95,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t98o4",
   "message": "#✨Inflation✨ \n\n^and\n\n#✨Society itself✨",
   "created_utc": 1696651809,
   "score": 16,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3tfc1o",
   "message": "Can make economic, climate change...",
   "created_utc": 1696655643,
   "score": 14,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rektp",
   "message": "Social Media is the easiest way to be miserable",
   "created_utc": 1696621795,
   "score": 62,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rpvki",
   "message": "People weren't happy throughout the history either. Life is hard and full of trouble for most.",
   "created_utc": 1696626004,
   "score": 68,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rdwg4",
   "message": "Inflation",
   "created_utc": 1696621549,
   "score": 90,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3reco8",
   "message": "Things just suck and feel inconsequential \n\nThere's too many people, nothing feels special, no thought or idea. everyone sounds stupid and repetitive",
   "created_utc": 1696621712,
   "score": 132,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rci7t",
   "message": "Lower standard of living.\n\nBills cost way too much. Fuel, rent, internet, etc. Bills just eat up so much of our paycheck. There’s little to no disposable income for a lot of people to spend on things they enjoy.",
   "created_utc": 1696621040,
   "score": 70,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rhssu",
   "message": "We’re all broke",
   "created_utc": 1696622981,
   "score": 42,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rgn6u",
   "message": "American culture has become toxic, our leaders only care about the billionaires, and we don’t even pretend like our institutions are free and fair and un-corrupt. It’s the slow-motion rot of living in a country that’s swallowing up the poor and middle class.",
   "created_utc": 1696622553,
   "score": 48,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3tb0qy",
   "message": "i dont know that",
   "created_utc": 1696652894,
   "score": 8,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rxc3h",
   "message": "Less than 10% of the population holds more than 80% of the wealth while the rest of us break our backs and brains just trying to survive.",
   "created_utc": 1696628956,
   "score": 30,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sd71d",
   "message": "Everybody is an asshole and everything is expensive",
   "created_utc": 1696635893,
   "score": 5,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rs4f9",
   "message": "Because it’s almost impossible to afford normal things. Gotta work your butt off all week to make ends meet, better not get sick or you’ll go bankrupt, and if you’re renting there’s that fun rent hike each year. Nothing feels very stable and the gap between the peasants and the wealthy is getting bigger and bigger.",
   "created_utc": 1696626880,
   "score": 21,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rv2dk",
   "message": "Basic things like owning a home have become luxuries.",
   "created_utc": 1696628036,
   "score": 21,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rhybs",
   "message": "Because we have the internet. We can see what is possible. We can see the corruption. We can see how people gain power and wealth. We see those people controlling our elected officials to not do what the people want....and there is nothing we can do about it. We can't afford homes, Healthcare, food, dating. We can't afford life.",
   "created_utc": 1696623039,
   "score": 14,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rr37c",
   "message": "Our diets.  We are literally killing ourselves with highly processed foods.  Fatty liver disease, a disease that used to be exclusively confined to long term alcoholics, is now being seen even in children.  Type 2 diabetes, previously only seen almost exclusively in middle age, is also now being diagnosed in teens.  Obesity is skyrocketing.  Take a look some time at the stats for average weights of men and women.  It’s very hard to be happy when you’re fat and sick.  It’s particularly tragic if you are young, fat, and sick.",
   "created_utc": 1696626479,
   "score": 5,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sabv3",
   "message": "“The world didn’t end in 2012, but has anyone felt alive ever since?” —a random tweet I never stop thinking about.",
   "created_utc": 1696634589,
   "score": 6,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rtcy0",
   "message": "Most of the people I know are not miserable",
   "created_utc": 1696627361,
   "score": 27,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rpq8o",
   "message": "I don't think most people are. Get off the internet and look around.",
   "created_utc": 1696625949,
   "score": 37,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3slcnj",
   "message": "Lack of money.  Lack of community and genuine relationships.  Social media.",
   "created_utc": 1696639651,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3tda7u",
   "message": "Loneliness, cost of living and housing shortages\n\nThe gap between rich and poor keeps getting bigger and im feeling like we need to riot or somethin",
   "created_utc": 1696654314,
   "score": 4,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3tfoxk",
   "message": "The media (both social and legacy) use their 24hr news cycles to hammer us with doom porn constantly while the cost of existing is getting out of control, people’s worries are compounded by the complete lack of hope",
   "created_utc": 1696655883,
   "score": 4,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3tog6e",
   "message": "Too many social expectations, not enough \"let's find out what you want or what makes you thrive\", and too much selfishness and greed all around. World is becoming too material, not enough spirituality in some cases.\n\nI mean, we are body and soul, both are needed to be taken care of.",
   "created_utc": 1696662292,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rod2y",
   "message": "Spending too much time on social media.",
   "created_utc": 1696625433,
   "score": 6,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3scvhw",
   "message": "Very genuine answer: capitalism.\n\nEvery aspect of capitalism punishes people for having totally human needs.\n\n\u0026amp;#x200B;\n\nHomeless? You are unhirable until you get a house. Get a job so you can get a house.\n\nSick? Go to work, we lose money if you take care of your body.\n\nCustomer harassing you? Smile and nod. Tell them they are correct. Give them a discount.\n\nA number of people that would make your head hurt to think about all have jobs they hate and hurt their bodies and minds, and they have to do it for 8-10 hours per day with potentially 30-60 minutes of driving as well which means they work literally all of their waking hours save 2 days per week in a place they dont want to be doing things they dont want to do with people they dont want to see, and the alternative is basically death.\n\nAnd there are no alternatives. It costs money for you to own a car, even if you never drive it. You can't get a credit card unless you've had a credit card before,   You can't even find an unoccupied plot of land and build a home to farm food and get a well for water and live alone unless you manage to do it without the government finding you. (Which most homeless people are unable to do)\n\nAnd to top it all off, a vast majority of the services and goods offered to us for relief on our two days of freedom per week have even been slowly turning into methods to extract profit from us, causing many many people to now start to choose if they wanna spend their $20 on a single night of fun, or a single night of eating. I can't even reliably buy a video game anymore without expecting to continue shelling out in some way. Even casual hobbies have been turned into siphons of profit to line the pockets of people who do not need more than they have. \n\n\u0026amp;#x200B;\n\nNothing about our society needs to be like this. If our society truly requires humans to sacrifice 71% of their life then society needs to change. capitalism is not a proper way of living, it is a game that has clear winners and losers. No governing body should allow for people to \"win\" or \"lose.\" It should be making sure everybody is able to attain the same level of health and happiness as a baseline.",
   "created_utc": 1696635746,
   "score": 9,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rqes8",
   "message": "my theory is they’re not. \n\n1- we have the internet and social media now, so many people broadcast their thoughts and feelings that used to be personal, or at least not shareable to so many people with such immediacy \n\n2- given 1, i think you have a bit of heightened emotional response. people who are unhappy are more likely to vent than those who are content. now they have 1 and you get to read about their venting. \n\n3- mental health and therapy are far less taboo than they used to be (although still a ways to go). we are more comfortable expressing ourselves whereas in the not too distant past expressing these emotions was not as accepted.",
   "created_utc": 1696626213,
   "score": 10,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rxprp",
   "message": "Our economy sucks, the housing market is in crisis, grocery and gas prices are at an all time high, lay offs are happening left and right. But yeah, our administration is awesome.",
   "created_utc": 1696629110,
   "score": 9,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s8jwh",
   "message": "A lack of perspective. \n\nWe are by far the safest, richest, longest lived, and most technologically advanced humans that have ever lived. \n\nA waitress today has more food choices available to her on the drive home from work than the king of France had 1,000 years ago. \n\n100 years ago, we were riding around in horse-drawn carriages. \n\n50 years ago, the crime rate was twice what it is now.\n\nNow, even a poor person has a government subsidized supercomputer in their pocket with all the world's knowledge at their beck and call.\n\nIf you keep this level of perspective in the front of your mind, you will maintain a much more cheerful disposition.",
   "created_utc": 1696633779,
   "score": 24,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rdit7",
   "message": "Social Media - everyone likes to make their life look so perfect.",
   "created_utc": 1696621411,
   "score": 12,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3ros05",
   "message": "Each and every technological advancement is used as another way that the ruling class can control people.",
   "created_utc": 1696625587,
   "score": 11,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rslex",
   "message": "Economics. The wealthiest people on the planet study us so that they can extract wealth from us and our governments. This is a little hyperbolic, but considering that companies hire consumer psychologists, there’s a good chance it’s true. \n\n\nWhen you are someone with the goal of “live my life, be happy,” up against people whose goal is “extract every dollar from this rube,” you’re bound to be pretty unhappy as the powers that be systematically rebuild the system around you to milk you.",
   "created_utc": 1696627065,
   "score": 13,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rtpze",
   "message": "People started thinking they were the center of the universe and stopped following the golden rule.\n\nAnd we see the worst of us in the highest positions.",
   "created_utc": 1696627503,
   "score": 6,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3ru3sf",
   "message": "Because we are misled to think that other ppl throughout history have it better. Throughout most of history, life sucked for almost everyone.",
   "created_utc": 1696627651,
   "score": 5,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rvfdb",
   "message": "Social media. It’s toxic af.",
   "created_utc": 1696628182,
   "score": 8,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rk48d",
   "message": "Climate disasters, unaffordable everything, and a really messed up social culture just to name a few.",
   "created_utc": 1696623845,
   "score": 20,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s4auw",
   "message": "Human Greed. I think its lead to everything many already see as \"what's wrong with humanity\". Life is tougher than it was because every person up the chain of big and small companies wants more for themselves, even at the cost of others. That's why social media, something super controversial in its own way, can keep on keeping on even when they know things like Instagram is bad for young teens and false information and psy-ops run around on their programs. Its why your boss doesn't want to give you loyalty back, they just want to take all you have for as little compensation as possible. Why we can see our climate changing for the worse infront of us but some companies will do everything they can to squeeze every penny they can out before its time to change.  Its greed. Because money is survival and it gets you everything you could want. So we end up with greedy people with their blinders on chasing the dollar. Its depressing as fuck to see it infront of you, and it feels like the root of many issues.",
   "created_utc": 1696631885,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s5pmm",
   "message": "Because humanity has been sold to the highest bidder",
   "created_utc": 1696632504,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s7qpn",
   "message": "In real life I don’t agree that people are miserable. This seems to me to be a social media (Reddit/Twitter) phenomenon",
   "created_utc": 1696633414,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sd7zy",
   "message": "The rich get richer. The rents get higher. The paychecks stay the same.",
   "created_utc": 1696635905,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sld45",
   "message": "Illness (physical and mental), poor economics, relationship trouble, family drama, lack of an interesting and fullfilling job, hobbies, and just lack of interest in life in general. Things are just a lot harder than they used to be...",
   "created_utc": 1696639657,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3stjai",
   "message": "Because places say they're always hiring, but in reality jobs are very few and far between. Computers/AI is starting to replace creativity and human-made arts. There's no place for people anymore and we feel stuck. Not to mention one medical accident and we're fucked monetarily- so that's fun 👍 yay, existing! \nTrees are nice to look at while I dwell on this, though.",
   "created_utc": 1696643569,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t0byu",
   "message": "\\*gestures vaguely at everything\\*",
   "created_utc": 1696646956,
   "score": 3,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rdai0",
   "message": "They are not\n\nYou are just hanging around the wrong people",
   "created_utc": 1696621327,
   "score": 17,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rgvwr",
   "message": "I only encounter miserable people on Reddit. It's a different world out there.",
   "created_utc": 1696622643,
   "score": 12,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rg4w3",
   "message": "Isolation and/or weak social networks are a significant factor. The evidence for the importance of strong friendships and support structures is robust with respect to both happiness and longevity. \n\nWhy people are more isolated is a far more difficult answer and in practice varies by the individual. Fewer people attend religious/spiritual meetings, which have historically been central to our social structure and interactions. We’re a few years out from the pandemic, which had the effect of cutting out much of the casual socialization that people relied on in work and school. Internet communities are a decent enough facsimile of social interactions that they can replace what would otherwise be in-person, but with a much lower quality.",
   "created_utc": 1696622366,
   "score": 6,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rr5ko",
   "message": "Phones, everytime i have a phase where i reduce phone usage to a minimum I’m so much happier",
   "created_utc": 1696626504,
   "score": 5,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3re2c5",
   "message": "The internet has changed us. I think social media and the inability to be kind and understanding to EVERYONE. I am scared for those are so cynical and brainwashed, they can’t even interact with half the public",
   "created_utc": 1696621609,
   "score": 15,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s0bjp",
   "message": "I'd like to think that they really aren't that miserable. Sure, on reddit you see a lot of lonely depressed people, but if you go outside there are still a lot of people living a full life. Maybe now there are more people that are miserable, as evidenced by the opioid epidemic and the mental health crisis we are in in America, but not everyone is miserable though.",
   "created_utc": 1696630188,
   "score": 4,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t1vw2",
   "message": "Rampant wealth inequality, ironically its even bad for the 1% as they feel more insecure and \"hated\" for their position and less likely",
   "created_utc": 1696647763,
   "score": 4,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rp3l8",
   "message": "Everything is expensive",
   "created_utc": 1696625709,
   "score": 5,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3rse5w",
   "message": "Everything is remarkably more expensive than it was compared to only a few years ago, yet our wages continue to be stagnant through it all, leaving us with less money to do enjoyable things. Owning property is a pipe dream now, we're all going to be renting until we die. More and more people are staying with their parents and for much longer because of this. Retirement is a luxury that only the wealthy will get to enjoy, the rest of us will be working until we die.",
   "created_utc": 1696626986,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s824j",
   "message": "Social Media. in fact, let me log out real quick....",
   "created_utc": 1696633556,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s9a47",
   "message": "Because social media likes to highlight every thing good about other peoples lives that could seem unobtainable. It’s a constant doom and gloom IV drip feed. \n\nNational leadership hellbent on driving a wedge between people of all races, creeds, genders, sexualities, while simultaneously reeling off a list of 3000000 things for YOU the common man to be upset, and mad about on a daily basis. Also, while running the worst economy anyone has ever seen. Interest rates through the roof, inflation through the roof, prices in the stratosphere, no one can buy a home because of the prices or inability to get a loan. \n\nWhich is exactly what keeps the democrats and republican 2 party systems alive and well! So long as we just get to pick one shit-wing of the same shit-bird it’ll always be this way!",
   "created_utc": 1696634109,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3s9lbn",
   "message": "Keeping up w the Jones’s",
   "created_utc": 1696634255,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sg3m5",
   "message": "Porn and other instant gratification things paired with cost of living going up.",
   "created_utc": 1696637226,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sljs1",
   "message": "24 hour news",
   "created_utc": 1696639743,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3slm46",
   "message": "Social media.",
   "created_utc": 1696639772,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sqmrx",
   "message": "People are chronically online instead of being a part of their in-person community. This leads to polarization since you don't have to interact with your neighbors who might have different viewpoints/lifestyles. You are also in a cozy echo chamber online where nobody challenges your views/perceptions. \n\n\u0026amp;#x200B;\n\nWe are collectively experiencing the consequences of late stage capitalism. Cost of living is up. Want to raise a family? Good luck, hope you and your spouse are able to work and earn. Less people are having kids, so there are less people with a sense of purpose. Women are less happy not because of feminism, but because we are working/earning and also as responsible as men are for the economic health of our families.\n\n\u0026amp;#x200B;\n\nClimate change is real and even the biggest critics are slowly coming around. Big oil + plastics + every other industry that relies on fossil fuels will continue to lie and gaslight until the planet is cooked. \n\n\u0026amp;#x200B;\n\nPoliticians and governments have no ideas or solutions. They get into politics to line their own pockets. The rare times that we actually get working class folks into politics they are absolutely villified by the opposite party and basically ignored by their own.\n\n\u0026amp;#x200B;\n\nBillionaires are mentally ill but it's still not considered appropriate to say that. Imagine sitting on more wealth than you could spend in multiple lifetimes while simultaneously pushing for more oil, more pay cuts, less unions - the list goes on and on. Normal people who become wealthy would be excited to enrich the lives of the family/friends, not push to horde more wealth at the expense of others.",
   "created_utc": 1696642159,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sqt5j",
   "message": "depends where but in general loud minorities pushing crackpot agendas, getting in the faces of the majorities just trying to live (and let live)",
   "created_utc": 1696642245,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sqtqy",
   "message": "Smart Phones",
   "created_utc": 1696642253,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3srdoy",
   "message": "Comparison is the thief of joy. \n\nSocial media has made others' life accomplishments and once-in-a-lifetime experiences too common to see. I'm sure there is a huge psychological adverse effect to watching others live \"perfect\" lives.",
   "created_utc": 1696642521,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sw8wu",
   "message": "So much propaganda about one bullshit crisis after another. If you live long enough, and have the memory to remember the bullshit from 10, 20 years ago that never happened or ended up not mattering you will begin to get some perspective. In other words don't be sucked in by clickbait bullshit.",
   "created_utc": 1696644908,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sxlvd",
   "message": "everything being expensive and everyone bragging about their lives on social media that makes regular people have FOMO. then they take out credit card debts and loans to “catch up” and then work a minimum waged job trying to pay those bills",
   "created_utc": 1696645583,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sxyv6",
   "message": "I(90s kid) dont know about you but im culturally(music, tv, social media) conditioned to be depressed and cynical. That anyone whos not miserable must be too 'stupid' to understand whats going on and that 'stupid' is the worst thing anyone could be, so we'd rather be a bunch of cynical, miserable, whiney, self destructive, insufferable little shits.\n\n Or have i said too much.",
   "created_utc": 1696645765,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3szjcg",
   "message": "I think miserable people are more vocal. Im fantastic and life is great. Don't know if that is minority, but I feel like a lot of people I meet also love life.",
   "created_utc": 1696646550,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t030h",
   "message": "We are disconnected from each other. Social media was meant to bring us closer but it only creates weak, superficial bonds. \n\nRampant individualism. It’s great for us to have the freedom to be ourselves but I’m taking about the “I’ve got mine. Fuck everyone else” mindset. \n\nWe’re expected to compete each other. To be a good worker bee, go to work every day for shit wages and rarely have enough time to enjoy our lives. We are pitted against each other when the real enemy is the wealthy class that exploits us. We struggle financially then go on social media and see a carefully curated view of our peers’ lives. We can’t measure up because we’re struggling. But so are they. They just don’t show it. \n\nIf we want to be happy again, we need to come together. Form irl communities. Be honest with each other about our struggles and help each other.",
   "created_utc": 1696646827,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t09i4",
   "message": "Not to be that person but social media really has taken its toll.",
   "created_utc": 1696646922,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t14h2",
   "message": "Because product availability and personal service has so diminished that no one likes going out anywhere anymore.",
   "created_utc": 1696647363,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t1rvs",
   "message": "We are becoming more individualistic and bitter.",
   "created_utc": 1696647703,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t425i",
   "message": "Unlike many countries, people in the US work longer hours, for less pay.   And after work we fill our tires minds with tv and internet.   Our minds are not still. And our brains, in just the last 20 years, we need to keep working faster and faster!    Our minds don’t have time to recover and we are exhausted and overwrought",
   "created_utc": 1696648909,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t5wsw",
   "message": "Social media.",
   "created_utc": 1696649907,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t7k7r",
   "message": "Nobody takes the time to really talk and communicate, nobody really wants to be real friends. We want a circle of support but we don’t want to be anyone else’s circle of support",
   "created_utc": 1696650829,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t7yo3",
   "message": "Everyone is broke AF",
   "created_utc": 1696651060,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3t8crw",
   "message": "Knowledge that some people have it *so* much better than you, and there is nothing you can do to change it because they likely got their good fortune as a result of chance.",
   "created_utc": 1696651288,
   "score": 2,
   "submission_id": "171likm"
  },
  {
   "comment_id": "k3sm0wm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "171likm"
  }
 ]
}