{
 "submission_id": "171lcgd",
 "title": "What happened during sex that made you realize that is was a mistake?",
 "selftext": "",
 "created_utc": 1696620452,
 "permalink": "/r/AskReddit/comments/171lcgd/what_happened_during_sex_that_made_you_realize/",
 "score": 44,
 "url": "https://www.reddit.com/r/AskReddit/comments/171lcgd/what_happened_during_sex_that_made_you_realize/",
 "comments": [
  {
   "comment_id": "k3rk24u",
   "message": "When the room started spinning (under the influence).\n\nI was trying to thrust, while the room was going round, while my stomach was just holding on for dear life.\n\nFelt like having sex on a tilt-o-wheel. \n\nI don't recommend.",
   "created_utc": 1696623822,
   "score": 174,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rnmxe",
   "message": "This was a bit of a misunderstanding, but when my boyfriend and I first got together, I was going to give him a blowjob so I took the gum out of my mouth and I thought I put it in the trash bin. I did not. After we finished I went to the bathroom and saw gum all over my hair! I guess it was still on my hand when i put my hair up with a hair tie. So I said “man this takes me back to my childhood!”( referring to the gum stuck in my hair). When I walked back into his room, his face had changed from happy bliss to complete concern.\nHe finally apologises and explains that we don't need to repeat it after a brief pause. The gum in my hair had escaped his notice. He misunderstood what I was saying when I mentioned my turbulent childhood. After we corrected the error, he was still a little spooked by my early years.",
   "created_utc": 1696625161,
   "score": 167,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3reehy",
   "message": "She looked me in the eye and said \"I wanna be your baby mama.\"\n\nIt's like... Maybe save that one for after we've been doing this for more than a week?",
   "created_utc": 1696621731,
   "score": 231,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3re391",
   "message": "Reverse cowgirl position nearly lead to a broken dick... Shout out to my ex Kate.",
   "created_utc": 1696621618,
   "score": 55,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rnseu",
   "message": "In high school, I was dating a girl who was on top, and I had a severe urge to fart. I didn't know what to do, so I forced myself to keep it inside. She started to get into it more and sped up the pace, which every time she came down produced a series of little rhythmic farts. It made a machine gun sound. When she paused to ask whether I had farted, I apologised for the noisy bed. She was aware.",
   "created_utc": 1696625218,
   "score": 207,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rj1vu",
   "message": "We were having sex in the back seat of my car. She was bouncing on me for a couple of minutes, and then she ripped ass (she farted) harder than I thought was possible. I felt the fart air ripple on my thigh, and it smelled so fucking bad, I almost threw up. She didn’t stop, or even acknowledge what she’d just done. Felt myself get soft inside of her.",
   "created_utc": 1696623446,
   "score": 132,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rip15",
   "message": "Heard her parents coming back home. Talk about an adrenaline rush.",
   "created_utc": 1696623316,
   "score": 237,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rcjho",
   "message": "Under the stars on a camping trip and it was great up to the point where the sleeping bag caught fire",
   "created_utc": 1696621052,
   "score": 60,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rqium",
   "message": "Was high and going down on my wife and she squeezed her thighs together with my head in between. \n\nFor some reason I imagined my head as a panini and thought of an old American Dad bit, and loudly blurted out “delizioso!”\n\nShe kinda laughed in shock but it completely killed the mood… \n\nI have no regrets though, it was 100% worth it for the memory alone.",
   "created_utc": 1696626258,
   "score": 230,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rr4t1",
   "message": "When I looked up and him whilst giving him a bj and he looked down and smiled and waved at me.",
   "created_utc": 1696626496,
   "score": 249,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rv1ev",
   "message": "I met a girl at an after-hours club. I was rolling on a gram of sassafras MDMA and she looked cute enough wearing a patent leather gogo dancer outfit. \n\nShe pulled me into an Uber and insisted we go back to her place. I’m noticing that we’re going through progressively worse neighborhoods— but she’s rubbing my tombstone-hard dick through my pants and kissing my neck and honestly, at that point, we could be driving into North Korea— your boy’s just trying to bury his bone. \n\nThe Uber drops us off at a place that looks like a straight up trap house. Some tattered and busted 1940’s bungalow that, from the outside, looked abandoned. \n\nWe go inside and she tells me to sit down and make myself comfortable. I ask her to turn on some lights and she tells me that— whoopsiedoodle— she forgot to pay her electricity so she’ll have to light some candles. \n\nShe spends like 10-15 minutes lighting dozens of candles and the darkened room comes into focus. It looks **exactly** like John Doe’s apartment from *Seven.* Walls painted black, weird animal bones ornaments everywhere, piles of journals and drawings. \n\nOkay, whatever. I can power through it. She slips off into a back room to get into something more comfortable. I hear her speaking… and then I hear someone else’s voice speaking. \n\nShe comes out of the room wearing only her panties. I disregard all the warning signs and I get back into it. She comes over, straddles me, we make out, she gets my dick out and plays with it a little— and then she stops and looks at me. \n\n*”Hey. So… uh… I need to ask you something.”*\n\n“Alright.”\n\n*”Would you be alright with my husband joining us?”*\n\nAll of a sudden, I glance over to the hallway and there’s a huge grizzly bear of a man standing there, buck-ass naked, covered in a literal pelt of body hair… his *massive* hammer of a dick hanging between his legs pendulously. \n\nNow— EVERYTHING in my brain was screaming no. Run. Get out of there. This isn’t the cool kind of three way. Why does she even want my six inch when she’s got a five dollar footlong at home?! \n\nBut my drug-fueled brain and social anxiety took over and a weak *”….uh… yeah that’s cool, I guess…”* is what came out of my mouth. \n\nSo we get started and, to her credit, she’s doing some pretty great things to my dick and he just sorta fades into the background. \n\nShe pushes me into the couch and gets on top of me and I feel him get behind her and drop to his knees. She’s doing her thing when, all of a sudden, I feel a wet and pleasant sensation on my nuts. And then I hear a slurping sound. \n\nI kind lean her to the side to see this great silverback of a man *sucking my fucking balls.*\n\nAaaaaaand that’s where the three-way stopped. I like *instantly* sobered up and put my pants on so fast that I forgot to put my boxer shorts on and had to stuff them in my pocket. \n\nMeanwhile, she starts yelling at him like *”GODDAMNIT, ANDRE! I TOLD YOU NOT TO DO ANY OF THAT [GAY] SHIT WITHOUT ASKING FIRST? REMEMBER LAST TIME?!”*\n\nAnd he’s just effusively apologizing and telling me to chill and that he’ll go back into the bedroom and let us finish. \n\nNope. Too weird. Drugs wearing off. I opened their front door, mumbled something incoherent and left. I learned another hard lesson after that: finding an Uber at 4AM in one of the worst neighborhoods in the city is almost impossible.",
   "created_utc": 1696628026,
   "score": 132,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rj032",
   "message": "I was plaster drunk and this girl decide to take me home, both because the bar closed and apparently she wanted to fuck me. \n\nI was hard at walking at this point, and she takes me arm around her shoulder and carry me home. \n\nWhere she almost immediately start sucking my dick. \n\nI am trying to be nice still, like lady - i got whiskey dick, this is going nowhere.\n\nAnd then there is some blackout in my memory because the next she is on top of me, and i am inside - and she is yelling very dirty stuff, and things about her wanting my sperm and shit. \n\nLuckily i was so piss drunk that i puke there - all over her.",
   "created_utc": 1696623428,
   "score": 149,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rqu82",
   "message": "I once slept with this guy I was considering dating. He pulled out, came in his hand, and then ate it. And then went on like nothing had happened. \n\nI never saw him again.",
   "created_utc": 1696626381,
   "score": 197,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rn7mx",
   "message": "In college my girlfriend was riding me in my dark bedroom me summer night. She was vigorously gyrating that I could feel her sweat dripping on me. Afterward we kissed and cuddled. When we turned on the light we discovered she had had a bloody nose and her blood was all over my neck and chest.",
   "created_utc": 1696625004,
   "score": 131,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rfxew",
   "message": "she smelled like rotten cheese and dirt down there",
   "created_utc": 1696622289,
   "score": 133,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rkact",
   "message": "I thought I might be gay.   \nFound out people don't \"think\" they are gay.   \nStill finished the blow job cause I wasn't about to do that to a homie.   \nI've never had another doubt just how straight I was.   \n1/10 would NOT recommend",
   "created_utc": 1696623910,
   "score": 212,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rp371",
   "message": "my wiener didnt work",
   "created_utc": 1696625704,
   "score": 204,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rcf0p",
   "message": "MY beer goggles fell off.",
   "created_utc": 1696621006,
   "score": 118,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rhjbf",
   "message": "I had a thing for her for a very long time and we were very close friends. Never pursued it because I didn't think she was into me. Imagine my shock when she started throwing herself at me. We dated for several months until she came clean that she was using me for validation. It hurt but I respected and appreciated her honesty so we stayed friends. A couple months later she hit me up for a booty call. We were sexually compatible and I was still physically attracted to her so I figured why not. Got down to it and I realized I didn't give a single shit about her pleasure anymore. I apologized and said I just couldn't phone it in. She said it was ok and she understood. That was when I realized I can't do casual sex.\n\nETA: Since this got traction I'll tell the rest of the story. First of all, in case I gave the wrong impression I didn't cum either. She wasn't any better at dialing it in than I was. Idk if she couldn't do it because she was ashamed of herself or maybe her feelings were more complicated than she let on. I still stayed the night though. We just smoked a joint and watched Red Dwarf instead of having sex. We kept hanging out after that until she moved across the country to pursue a musical career. No hard feelings on either end. I guess I got good reviews because her BFF hit me up the day after she moved. It's pretty wild out sex can go from 10/10 to 2/10 just because your feelings toward somebody change. I still miss hanging out with her. We had a ton of fun.",
   "created_utc": 1696622883,
   "score": 110,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3romet",
   "message": "When he repeated \"I love you\" with each thrust on the first night..",
   "created_utc": 1696625530,
   "score": 208,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3ro4io",
   "message": "[deleted]",
   "created_utc": 1696625345,
   "score": 108,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3reeod",
   "message": "When husband and I were having sex after having Mexican food for date night and we both rushed to bathroom only one of us got toilet while other got trash barrel and our basements were exploding like fireworks",
   "created_utc": 1696621733,
   "score": 23,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rfkbl",
   "message": "Begging - and I mean, pleading - for me to give her a baby.\n\nShe later apologized but did it again during sex a few times and it was just too much",
   "created_utc": 1696622155,
   "score": 88,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rbisn",
   "message": "Butt stuff. Totally straight dude, for reference. My girlfriend at the time tried sliding a finger up there once. It’s great that she tried something new for us both, but I hated it. I knew within the first second it’s not for me.",
   "created_utc": 1696620670,
   "score": 100,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rfc2o",
   "message": "On the grass outside the cottage until we realized we had locked ourselves out.",
   "created_utc": 1696622072,
   "score": 158,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rbd4n",
   "message": "She started crying and apologizing (she initiated it).",
   "created_utc": 1696620612,
   "score": 30,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rnlgm",
   "message": "She looked at my dick and said, “I don’t think this is a good idea.”",
   "created_utc": 1696625147,
   "score": 28,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rdut0",
   "message": "Her ex called her phone right before i nutted.",
   "created_utc": 1696621532,
   "score": 173,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rzecl",
   "message": "When I was in college, I was getting bone from a guy, riding him hard, I was facing the door to his room and he was looking at (sucking) my tit.  \nThe door opens and in walks his dad, he looks me straight in the eyes and freezes for a few moments. The guy didn't notice, his dad woke up and gave me a thumbs up gesture and a hand gesture like \"go get them\", he left and closed the door.  \nThe guy had told me that nobody was home and after the sex I found his father smiling at me....I died of embarrassment.",
   "created_utc": 1696629802,
   "score": 117,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rm7vx",
   "message": "Had an absolute porn star scenario going with a girl, face fucking, gagging, total shit show in a good way. And then the smell hit. Oh the smell. I can push through some \"it was a long day\" vaginas, but this was some Victorian era stench. Super confusing because by all definitions she was a 10 physically. She clearly had a health issue but my empathy was not playing ball in the moment. I even gave the benefit of the doubt to her and tried it again months later. Nope, game over for me.",
   "created_utc": 1696624632,
   "score": 178,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rjlu2",
   "message": "My first time having unprotected sex, it was spontaneous and with someone new. Anxiety slowly kicked in after he finished in me because I wasn't on any birth control at the time. I got plan B and was tested clean. It was stupid and i got away with it. Since then I've been more vigilant and safety first.",
   "created_utc": 1696623652,
   "score": 88,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3riph9",
   "message": "I realized I shouldn't be thinking about David Beckham to be getting through this situation although it would have been fair if she was.",
   "created_utc": 1696623320,
   "score": 93,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rzryw",
   "message": "The sperm exiting my body… post nut clarity set in real quick. That maybe raw doggin a girl with “thug city” across her neck wasn’t a good idea….",
   "created_utc": 1696629959,
   "score": 239,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rld13",
   "message": "Bitch bit me fucking hard.  Love bites are fine, but she went for blood.  Lost all interest after that.",
   "created_utc": 1696624311,
   "score": 118,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rh1by",
   "message": "I was fumbling with the condom and she said \"I can't get pregnant...\"  Something she'd never told me before and she was 30 with 4 kids (edit: and had previously mentioned the possibility of having a child with me).  I didn't believe her for a second.  Instant boner killer.",
   "created_utc": 1696622698,
   "score": 159,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rm3ku",
   "message": "She laid there like a slug. Absolutely no interaction whatsoever. The sex was so bad I had to go back for a second time to convince myself it wasn't me.",
   "created_utc": 1696624588,
   "score": 137,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3ryaii",
   "message": "Her son walked in and stood at the end of the bed. I tried to get up and she pulled me closer and said ‘don’t worry he does this all the time’.",
   "created_utc": 1696629341,
   "score": 127,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s2yfo",
   "message": "He was fucking my thighs and thought he was inside. 😐",
   "created_utc": 1696631307,
   "score": 117,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rm5ih",
   "message": "When she had me put on one of her exs shirts and called my by his name",
   "created_utc": 1696624608,
   "score": 30,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rf2ye",
   "message": "[deleted]",
   "created_utc": 1696621978,
   "score": 83,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rnxjt",
   "message": "Tried gang bang with 7-8 horny but respectful men….it was an amazing experience until there was just so much cum on me and on my laminate floors that I slipped and fell and broke my arm. Never again.",
   "created_utc": 1696625272,
   "score": 54,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rhzhx",
   "message": "When the deed was about to start, I noticed the guys hands were dirty, like from working on a car or something, it really turned me off but at that point I felt like I couldn’t say no so I went with it but did not enjoy that encounter",
   "created_utc": 1696623051,
   "score": 143,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3ro57m",
   "message": "I gave him head and the smell was so putrid I puked in my mouth, but kept going because I didn’t want to be rude.",
   "created_utc": 1696625352,
   "score": 249,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rjkq6",
   "message": "Doesn’t matter, had sex.",
   "created_utc": 1696623641,
   "score": 212,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rtegr",
   "message": "He spat in my mouth without prior consultation I was into it, i very nearly vomited on him. Yuckers.",
   "created_utc": 1696627377,
   "score": 197,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rk8dx",
   "message": "Got crabs",
   "created_utc": 1696623889,
   "score": 23,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3ryhes",
   "message": "She lay there like a dead fish and said, \"fuck me.\"",
   "created_utc": 1696629421,
   "score": 160,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s13vu",
   "message": "I saw the confederate flag blanket.",
   "created_utc": 1696630520,
   "score": 18,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rjo65",
   "message": "Most of the time the epiphany moment comes the day after.",
   "created_utc": 1696623677,
   "score": 100,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rhx65",
   "message": "The first time, I put it in and was met with a wave of disappointment, everyone says your first time would be awkward, but this was just meh. In all of high school and college, I didn't get what the big deal was. Then I lost my virginity and still didn't understand what the big deal was. From movies and peers, i thought it would feel like heaven or something that would make me feel confident or like the man. But nothing happened.",
   "created_utc": 1696623027,
   "score": 176,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rj38y",
   "message": "My FWB at the time years ago started crying after she had an orgasm and started talking about her late father while I was still inside her.\n\nAs far as I know she was never sexually abused but from what I was told about him it was an abusive parent relationship.\n\nI truly hope she is in a much better mental headspace despite not seeing each other for 8 years.",
   "created_utc": 1696623460,
   "score": 240,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rhvep",
   "message": "Was giving it all I had and she laid there star fish no emotion, didn’t even nut I pulled out put my pants on and walked out.",
   "created_utc": 1696623008,
   "score": 168,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rh0my",
   "message": "I nutted in her friends ass instead of her.",
   "created_utc": 1696622692,
   "score": 91,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rx4i6",
   "message": "I was obsessed by FIFA 13 and had played Barcelona during seasons. I had faced someone and lost the game, although I had 100 shots on goal. The guy had only one. I got so mad. \n\nThe same night I had sex with a girl. While she was on top of me, I'm having pictures in my head of Messi missing an open goal, and I react by fucking her harder, in the hope of having those pictures disappear. I just can't let go of that game. The images return, and I literally whisper \"fucking bitch, do your job\" and spanks her.. I didn't whisper loudly but it was enough for her to hear it..\n\nShe stopped and got super mad. I tried to explain that it was Messis fault and that my 3-4-1-2 formation allows him a lot of creative freedom and that he always scores.. She understood nothing and was still mad. I had to go down on her for 30 minutes to make her happy. That's when I knew that it was a mistake to play FIFA before fucking.\n\nThanks a lot Messi.",
   "created_utc": 1696628871,
   "score": 65,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rubvp",
   "message": "when she said \"wrong hole\"",
   "created_utc": 1696627742,
   "score": 103,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rmmf6",
   "message": "Both too drunk and it went on and on and on and on, neither of us got a happy ending. Gave up in the end. Worst sex ever",
   "created_utc": 1696624784,
   "score": 153,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rgeqk",
   "message": "Smelly vagina 🤮",
   "created_utc": 1696622467,
   "score": 57,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s3ig4",
   "message": "She slapped me right in the balls.\n\nShe said she thought it was like... Kinky and that guys liked that.\n\nHoly shit, i almost threw up",
   "created_utc": 1696631544,
   "score": 215,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rbcx3",
   "message": "A knock on the door by his daughter. She's my best friend",
   "created_utc": 1696620610,
   "score": 126,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rzm3r",
   "message": "The time I went down wn on my girlfriend. I came home drunk and went to town, but it.... tasted horrible. Drunk me figured I just ignore and make her cum, which I did. \n\nThe morning after when I went to to bathroom to pee, I notice my mouth and beard was all red. Turns out she got her period that night and she was not aware. The taste was period blood..\n\nStill with her 18 years later though, so not sure how big the mistake actually was.",
   "created_utc": 1696629892,
   "score": 158,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rvagz",
   "message": "My ex and I were doing sex in the woods because we were teenagers at the time. There was a road behind the tree line but we figured any cars going by wouldn’t notice us being there, and we were right, until a bus full of school children stopped and let a bunch of them out. That was just the neighborhood bus stop and we had no idea.  One kid yelled that he heard something in the woods and we just ran. Never had sex in the woods again",
   "created_utc": 1696628127,
   "score": 123,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s4suf",
   "message": "What happened to the condom? [Stuck inside, had to go to Dr after 2 days for help].\n\nHappened several times.  Dr looked disgusted by my 3rd visit.",
   "created_utc": 1696632103,
   "score": 139,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s0gd1",
   "message": "She told me to put it in her butt and after feeling a gross sloshy sensation, my weiner was covered in green diarrhea",
   "created_utc": 1696630244,
   "score": 225,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s0p6s",
   "message": "His hips did not move, like no thrust… but his brain container was bobbing back and forth like he was confused as to which head to move….",
   "created_utc": 1696630347,
   "score": 94,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s3kav",
   "message": "Figured we'd try nutting on her face like in the pornos. Immediately after, post-nut clarity hit and it felt less like a sexy climax and more like I'd just completely disrespected her as a person. All I could do was apologise profusely and get tissues.\n\nShe was the one who proposed it, by the way, and we laughed about it after. Could've been worse.",
   "created_utc": 1696631566,
   "score": 206,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s7sgv",
   "message": "I had well long ago lost my virginity. I was in college I thought “we’ll everyone is fucking I should do that”\n\nIt’s not a fun story but I was feeling the pressure just to fuck for the sake of saying I fucked. So I had a FWB (that I actually had feelings for but she wasn’t in to anything aside from a quick screw). \n\nSo one day we’re going at it and in the worst timing ever I say “can I take you on a proper date?” Literally in the middle of raw dogging this woman doggy style. She says “um……………….no”\n\nWe’re engaged now but holy hell the second I spoke I thought she was about to tell me to leave. Crazy woman found it in her heart to actually not hate me fire it",
   "created_utc": 1696633436,
   "score": 95,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3sjq6g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s1mou",
   "message": "Me and an ex were going at it when her sister popped out from under the bed. She thought it would be funny to scare us. \n\nIt wasn’t funny! I was balls deep.",
   "created_utc": 1696630743,
   "score": 200,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rxdl3",
   "message": "Girl was on her period, decided to give it a go anyway. Was dark so couldn't tell what was going where. I must have grabbed my dick at some point and then leaned on the wall. Turned the lights on at the end and there was blood literally everywhere, including a hand print on the wall.\n\nThat's how I invented The Wilson.",
   "created_utc": 1696628972,
   "score": 195,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rupge",
   "message": "We were both very skinny, the hip bone on hip bone action was killing me, then he said he could go all night, so I said I needed to leave.",
   "created_utc": 1696627892,
   "score": 236,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s41ot",
   "message": "I never used to use lube. I thought i didn't need it. Then an event of extreme chafing after a marathon night happened. Now i firmly believe there is no such thing as too much lube.",
   "created_utc": 1696631774,
   "score": 211,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s5tux",
   "message": "Ah man, this girl picked me up from the bar and took me back to her apartment. I was so wasted I couldn’t string sentences together. It was really bad. She initiated by basically tackling me on to her couch. We made out, moved to her bed. \n\nI tried to ask her if she’d go down on me. But, again I couldn’t form sentences. My ability to communicate rivaled Jordan Belfort on quaaludes in that moment.\n\nI do remember her quizzing me on her name. To my credit I forgot… twice.\n\nI blacked out for a minute. When I woke up, I was getting the world’s driest hand job. She asked me her name again. I decided I embarrassed myself enough for one night. I said I should go and made the two mile hike home.\n\nSorry Emma.",
   "created_utc": 1696632556,
   "score": 30,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rx2v4",
   "message": "Not paying attention, caught up in absolute drunk passion and fell off the bed, and dislocated my shoulder. Because I was drunk, I was able to get it back in place, climb back on top, and finish off the both of us.",
   "created_utc": 1696628852,
   "score": 142,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3ruxl4",
   "message": "This happened over multiple encounters, but this girl was a squirter.  First time ever encountering it (19 at the time I believe) so I thought it was awesome.  \n\nIt was not.  I mean it happened every minute or two.  Constantly having to change my sheets when she would stay over.\n\nThe realization came when we were at a friends party and dipped off to bang one out in her back seat.  It was just a quicky, but I was on top and she just spray exploded all over my chest, soaking me from the fucking neck down.  I couldn’t even go back inside until my buddy brought me a shirt down.\n\nAfter that I was like “fuck this”.  Pretty weird afterwards though because we worked together.",
   "created_utc": 1696627983,
   "score": 239,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s1832",
   "message": "I don't wanna share this but my husband asked me nicely lol.\n\nCowgirl position with a bellyache... we had to shower afterwards...",
   "created_utc": 1696630570,
   "score": 122,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3sxzyn",
   "message": "Was about to fuck a guy that I knew-ish from uni. We’d hung out a few times with friends before. A couple of drinks, but no drugs to explain it away. All going well, he’d had head, other than him biting on my arm of all places as hard as he could whenever he felt good (why? Why would that feel good?)\n\nTip in and he bursts into tears accusing me of thinking he’s too small and I just need to “stop fucking lying about thinking it, you nasty cunt, I know you’re comparing me to every dick you’ve had!”\n\nI push him off me and pointed him towards the door. He was yelling and crying about how I couldn’t do this to him and how heartless I was. My god. Surreal.",
   "created_utc": 1696645780,
   "score": 56,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rvguv",
   "message": "She stuck a finger up my ass after I explicitly told her not to",
   "created_utc": 1696628199,
   "score": 103,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s7j41",
   "message": "A friend of mine told me once that he had given up having anal sex. He said he was with some gal he picked up in a bar and they were getting busy at her place. She told him she wanted him to “stick it in my ass”, which he did. After some vigorous in n’ out activity, he nutted and he said he looked down and stuck to the side of his still half-inflated dong was half of a French cut green bean. He said that was all he needed to give that shit up.",
   "created_utc": 1696633318,
   "score": 55,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rvqm8",
   "message": "He started repeating \"c'est bon\".... neither of us spoke french... it was 10 years ago but to this day that phrase brings up the bad memory.",
   "created_utc": 1696628308,
   "score": 86,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rvub4",
   "message": "She pulled the condom off while on top and tried to force the cum out of me",
   "created_utc": 1696628350,
   "score": 45,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3sk72u",
   "message": "The guy I met at a bar several weeks prior, immediately after finishing,  told me I was \"so much better at this than my girlfriend.\"\n\nLike, excuse me? What? \n\nThen 2 weeks later,  he invited me to his 18th birthday party.... \n\nDrinking age is 21; he never should have been in that bar.",
   "created_utc": 1696639116,
   "score": 45,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3rwwd0",
   "message": "She told me it was okay, she never gets pregnant. Just put it in. Lo and behold, 8 years later and here we are, still together with a 7 year old child. I was a careless virgin in my 20s.",
   "created_utc": 1696628779,
   "score": 111,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3swqym",
   "message": "While fucking me in doggy he said “I should be raping you right now”",
   "created_utc": 1696645159,
   "score": 38,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3s1ftt",
   "message": "I was sucking tf out of his dick, deep throating and I threw up.. everything I ate, chunky asf\n\nI wiped it up and kept going like a champ",
   "created_utc": 1696630663,
   "score": 103,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3slisu",
   "message": "He was a friend of a friend. Had a huge crush on him. We hung out for drinks and went back to his place. Got naked and went to his bed. \n\nI was straddling him, just rubbing our d***s together. He wanted me to sit in his face, and I said no that I hadn’t prepared for that.\n\nHe goes “that’s great I like it dirty”\n\nAudience. I swear to god I never clenched so hard in my life. He tried to get his tongue in there but it I was clenching so hard my ass cheeks went whiteknuckle",
   "created_utc": 1696639731,
   "score": 181,
   "submission_id": "171lcgd"
  },
  {
   "comment_id": "k3tv0i8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "171lcgd"
  }
 ]
}