{
 "submission_id": "171qu4x",
 "title": "What does a person feel during depression?",
 "selftext": "",
 "created_utc": 1696634012,
 "permalink": "/r/AskReddit/comments/171qu4x/what_does_a_person_feel_during_depression/",
 "score": 74,
 "url": "https://www.reddit.com/r/AskReddit/comments/171qu4x/what_does_a_person_feel_during_depression/",
 "comments": [
  {
   "comment_id": "k3sapnn",
   "message": "Lack of motivation to do much of anything, loss of interest in things that you like doing and a constant sadness.",
   "created_utc": 1696634764,
   "score": 121,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sakh1",
   "message": "Have you ever had a day where you wake up and you're like \"I don't want to get out of bed.  I don't want to do anything.\"  Like just a real lack of motivation.  It's like that, but all the time.",
   "created_utc": 1696634698,
   "score": 66,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sa90g",
   "message": "Nothing and everything at the same time",
   "created_utc": 1696634554,
   "score": 73,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sbz7o",
   "message": "For me, Killing yourself is a constant thought.  \"I'll swerve into the oncoming semi, I'll leave the car running without opening the garage, I'll put a bullet through my head.\"\n\nWhen I got stabilized it took me a bit to realize that I had gone through 3 hours of the day without thinking about dying.  It was the best day of my life.",
   "created_utc": 1696635336,
   "score": 34,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3s9li0",
   "message": "Sadness,anxiety,frustration,loneliness.",
   "created_utc": 1696634257,
   "score": 29,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sb3yw",
   "message": "You just go through life with minimal effort as possible. Sleep a lot and then sometimes feel immense sorrow and despair",
   "created_utc": 1696634943,
   "score": 15,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3scoa8",
   "message": "It’s a sadness that’s deeply rooted in you. it’s a complete and utter solitude - like imagine being in your bed at night, and you can hear your beloved ones from the other room and they’re laughing and having fun under warm lights but you just can’t get out of your bed and join them. Mostly because you’re too sad to do that, but also ‘cause there’s shame in feeling so hopeless. There’s no future and sometimes, for some people like me, the past is a crazy old lady keeping you in a wild and blood stained stare contest - but most importantly: there’s no present either for us. It’s just you and your void and your old bones, and sometimes you ask yourself if that is all that’s left for you to consume.\n\nI’ve been there for almost all my life. Hang on, seek help. There’s a way out.",
   "created_utc": 1696635654,
   "score": 16,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sd98e",
   "message": "Depression for me was deceptively seductive. \n\nI felt like shit, of course, like I didn't care to take care of myself or enjoy things anymore. But at the same time, depression made me feel kind of superior and smart. \n\nI felt like I had figured out something really important and fundamental about life that other, lesser humans missed. I thought I knew existence was inherently awful and unfair and anyone who seemed happy was either stupid, just lucky (so far...), or lying.\n\nI remember when I was starting to recover, I realized I didn't really need to feel that shitty all the time, that everyone's life has positive and negative bits and I could work on improving the negative and enjoy the positives. I remember giving myself that option and then thinking, \"eh, no thanks, I'm good like this.\"\n\nIt took a while for me to take that suggestion.\n\nThis is why I think cynicism is such bullshit. It makes you feel wise, but really it's the opposite. Believing everything is a lie is no better than believing everything you're told.",
   "created_utc": 1696635921,
   "score": 9,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3scrv2",
   "message": "So damn lonely.",
   "created_utc": 1696635699,
   "score": 7,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sbvmc",
   "message": "Basically it’s like accomplishing the most basic task is the hardest thing you’ve ever done.",
   "created_utc": 1696635291,
   "score": 6,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sf7uw",
   "message": "Hopelessness. Why Bother.",
   "created_utc": 1696636817,
   "score": 5,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sfbso",
   "message": "Immense hopelessness",
   "created_utc": 1696636867,
   "score": 6,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sd3js",
   "message": "It’s a strangely overwhelming feeling of nothing. Most wake up and have some innate drive to do something I’d imagine, be it have a meal or get moving for the day. For me I have to go through an abundance of convincing myself anything matters at all, and even things I enjoy often feel like “work” as I force myself to do them. Often I wake up and feel regretful, although it only is a distinct thought briefly.",
   "created_utc": 1696635849,
   "score": 6,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3se1mm",
   "message": "Not wanting to do anything. Not wanting to be anything. Not wanting to be at all. I don't necessarily want to die. I just want to have never existed.",
   "created_utc": 1696636277,
   "score": 6,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3see4d",
   "message": "Personally this is how it's been for me. I feel like nobody cares about me enough to show it. I'm there but I'm not 1st, 2nd or 3rd pick to be favorite. I get invited to stuff but I feel like it's out of obligation to keep me happy but I'm somehow bothering them. That I'm one of the most disposable people out of the friend group and one wrong move or word and I'm out forever. \n\nIt's hard to constantly keep on and keep myself in check. There are days where I need to break down and cry but if I do it too much or for too long, I'll be in a pit of depression and I feel like I'm not allowed to be around anyone. I feel like I constantly have to be happy and okay otherwise no one will want to be around me. It's exhausting.\n\n I go to my friends to vent and they don't know what to say or run away. I come on here to vent and I either get backlash or nothing at all. I vent to a therapist and they have their hand hovering over the phone just in case I say I'm suicidal, I can never say im suicidal. Any time I am, I gotta keep it to myself. I feel done. So I and only I can deal with it but at the end of the day I need help. It's a double edged sword.",
   "created_utc": 1696636433,
   "score": 6,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sca4k",
   "message": "Everything feels overwhelming to start- showering, cooking, talking to friends, exercising, etc. The only thing that feels manageable is scrolling endlessly on reddit, which gets boring after hours on end. That's when I close my computer and walk aimlessly around the house, only to end up in front of the computer again. All of this while not feeling much of anything.",
   "created_utc": 1696635474,
   "score": 4,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3s96ab",
   "message": "Nothing",
   "created_utc": 1696634061,
   "score": 9,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sde18",
   "message": "Emptiness",
   "created_utc": 1696635981,
   "score": 3,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sdk0s",
   "message": "Nothing. You just do things and say things because you're supposed to. Sometimes you want things to be better, sometimes you don't care if things get worse.",
   "created_utc": 1696636056,
   "score": 3,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sdlc1",
   "message": "Loss of interest in pretty much anything",
   "created_utc": 1696636073,
   "score": 3,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3selgv",
   "message": "Often, nothing.",
   "created_utc": 1696636527,
   "score": 3,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3scm01",
   "message": "Exhausted.",
   "created_utc": 1696635624,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3scw0s",
   "message": "Mental agony.",
   "created_utc": 1696635753,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sdjwt",
   "message": "Empty and nothing to look forward.",
   "created_utc": 1696636055,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sdr88",
   "message": "For me, it's fluctuating between feeling relatively \"normal\" but everything is muted, feeling incredibly empty and completely numb, and randomly having one single emotion just be out of control for a short while, almost always negative. \n\nLike I'll be chilling, feeling normal but somehow my emotions are too muted, like watching a TV show with a grey color palate, and then suddenly I'll feel so sad that it physically hurts, and that will last for a little bit, probably an hour or two, and then it'll go away and then there will be 0 emotions at all in my system. It's really hard to deal with because all of them happen at random times for random reasons and last random amounts of time.",
   "created_utc": 1696636146,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sdrt1",
   "message": "It’s a heavy blanket that engulfs you. You wake up feeling like you need to wind yourself, psyche yourself just to pull yourself out of bed. It is a lonely feeling, even when you are married to a wonderful understanding spouse who supports you. Treatment works though, whether it’s meds or therapy or both.",
   "created_utc": 1696636153,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sdw7v",
   "message": "Heaviness..mental,physical..like a weighted blanket is hanging over your shoulders",
   "created_utc": 1696636208,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sehsx",
   "message": "Depression is like living your life with lead boots trying to walk through slugged.",
   "created_utc": 1696636480,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sesuz",
   "message": "Pain, sadness, hopelessness, zero energy or motivation, feeling like a shell of your former self, fear, mental heaviness.",
   "created_utc": 1696636622,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3setho",
   "message": "The extreme desire to kill myself.",
   "created_utc": 1696636630,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sf1fv",
   "message": "Fuck everything and everyone. Except my doggo.",
   "created_utc": 1696636734,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sf2ka",
   "message": "Every minute feels like an eternity.  My body felt so tired and achy...like the physical effect is no joke.  Seeing no point of value in doing the things you're passionate about sucks too.  \n\nThis may just be me, but like I tortured myself a lot by thinking about how many people in the world were suffering like I was or worse.  Didn't help matters and it haunted me.",
   "created_utc": 1696636748,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sf64b",
   "message": "a grey cloud over your head 24/7",
   "created_utc": 1696636794,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sf6tz",
   "message": "I'm going through a really rough episode right now, and it literally feels like I am living in a nightmare.\n\nI don't know how common this is, but when I am anxious or having troubles, I often have nights full of one nightmare after another after I go to sleep. One dream leads to the next, I feel like I cannot get out of this surreal prison of tortures. Often I am aware these are nightmares, but I cannot wake myself and I know I have to suffer all night with these terrors.\n\nBut when I am very depressed, even my regular, waking life feels like that. Like there is no escape from the horror of it all. It feels like pieces of myself and my life are just breaking off and dying and there is nothing I can do about it. Every day is worse.",
   "created_utc": 1696636804,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sfata",
   "message": "Nothing, but nothing in the literal sence. Not necessarily feeling bad but not feeling good either",
   "created_utc": 1696636854,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sfm5f",
   "message": "The most dangerous part is when you’ve felt low for so long it becomes numbness of emptiness.",
   "created_utc": 1696637000,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sft10",
   "message": "Crushing sadness and anxiety.",
   "created_utc": 1696637092,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sftfo",
   "message": "It literally hurts. Like actually physically hurts. Combined with not caring about even eating, not getting out of bed, it sucks. And then you see how much a visit to a doctor costs, even worse. But oh well, not gonna let that run me down. Nobody’s gonna be at my funeral, because I’m not having one for a very long time.",
   "created_utc": 1696637097,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sg4hz",
   "message": "Nothingness",
   "created_utc": 1696637236,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sh2e7",
   "message": "Tired, mostly. Achy bones and muscles.",
   "created_utc": 1696637671,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shaho",
   "message": "Feel like while knowing I’m depressed I don’t think I am and am just struggling today but it’s everyday. Alsodidn’t thinki had anxiety but definitely do. \n\nOther problem is a lot of that can be from just doing what you need to to survive life’s challenges at school work social. Maintaining is a lot of maintenance but exercise and good diet also breaks a lot of the depressive cycles. \n\nI do better with more sunlight",
   "created_utc": 1696637771,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sho2u",
   "message": "In my case - almost nothing.",
   "created_utc": 1696637946,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3si6yc",
   "message": "This is me. I don't want to die and hurt my siblings. I feel like it would be easier for everyone if I just was never born",
   "created_utc": 1696638184,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3siaba",
   "message": "All I want to do is change the channel because it feels like I'm watching life on television rather than experiencing it.",
   "created_utc": 1696638228,
   "score": 2,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slrth",
   "message": "Knowing you **have** to do things and that there will be **big** consequences and still being unable to drag your ass out of bed because you just cannot make yourself give a single fuck about anything.",
   "created_utc": 1696639847,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3scdmh",
   "message": "As opposed to \"during recession\"?  During depression you have lost your job, so you feel under duress and anxious to find a new or temporary job \\[to\\] make ends meet.",
   "created_utc": 1696635518,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sblf1",
   "message": "Brain fog, full body exhaustion, and emotions are all or nothing. A cycle of misery",
   "created_utc": 1696635163,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3senp4",
   "message": "Why all the mental disorder questions? I must leave now. Good luck out there.",
   "created_utc": 1696636556,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sfvv9",
   "message": "I’d answer your question but what’s the point?",
   "created_utc": 1696637126,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sg9e1",
   "message": "feels like everything is ending and nothing will work out it's because e has lost hope and that's why he is depressed. So, he feels that all doors are closed and the only door that is left is the door to heaven.",
   "created_utc": 1696637299,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sgecl",
   "message": "It’s like going through the motions of your everyday life in slow motion where at anytime you find yourself sobbing uncontrollably again with no end in sight.",
   "created_utc": 1696637363,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sgg4q",
   "message": "No motivation at all no desire at all",
   "created_utc": 1696637385,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sgl1n",
   "message": "For me it’s the complete lack of feeling… just numb and no drive. I want to feel something but it all just seems pointless and fake.",
   "created_utc": 1696637447,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sgs5l",
   "message": "Its not sadness, its past that, its straight melencholia, no motivation and you don't even care that you aren't motivated. Its emptyness, and it gets to a point where you feel comfortable in it.",
   "created_utc": 1696637539,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sgsn8",
   "message": "Numb. Haplessness. Poor self-image.",
   "created_utc": 1696637545,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sguy8",
   "message": "If it gets bad enough, physical and mental pain. Suffering.",
   "created_utc": 1696637575,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sh5j0",
   "message": "Depressed",
   "created_utc": 1696637710,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sh5k1",
   "message": "Tired, loss of interest in anything, hopeless. The world is seen through darker tinted lenses. Bored and unmotivated and restless at the same time",
   "created_utc": 1696637710,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shkfk",
   "message": "Personally for me, I don’t want to leave the bed, I don’t want to talk to anyone and I pretty much just want to die.",
   "created_utc": 1696637899,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shlmi",
   "message": "Empty and alone.  I can stare at a wall for all I care.",
   "created_utc": 1696637914,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shmra",
   "message": "There’s no light switch in a dark room. In that dark room is something that wants you dead. There’s no exit door no idea of time. All the fight you have is gone and you’re forced to give in to the bleakness of self hatred for no reason. All your problems have no answers in sight. Your past taunts you and your future is absent. Waves of pain make you drown in helplessness. There’s no getting up from the relentless beating your mind is pummeling you with, you find yourself chained to the ground unable to move. \n\nIt’s soul purpose is to strip you all everything good and leave you empty beyond comprehension. So empty you know there’s only one way out of this room. It knows this and feeds off of your torment. It builds up a false confidence in yourself that you’re able to take a life. It waters the flowers of instability in your mind so much that reality is now gone and you find yourself rationalizing leaving this room permanently. I dunno I could go on and on",
   "created_utc": 1696637929,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shth1",
   "message": "not having any desire to act. having no desire to be anything. Not at all wishing to be. I'm not sure I want to pass away. Simply put, I want to have never been.",
   "created_utc": 1696638014,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shty6",
   "message": "nothing. its like being dead. its really awful.",
   "created_utc": 1696638021,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shuz9",
   "message": "Like being more bored than you could imagine but also not wanting to do anything at all, even breathe. So you want to do something, but you can't imagine anything that you would like to do so you're just sort of stuck.",
   "created_utc": 1696638034,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shxtb",
   "message": "Hopeless",
   "created_utc": 1696638070,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shylc",
   "message": "persistent inadequacy",
   "created_utc": 1696638080,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3shyth",
   "message": "Grey and like trying to move under water. Apathy and malaise are constant companions",
   "created_utc": 1696638083,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3si1j1",
   "message": "having the impression that you are alone despite being surrounded by caring individuals. It's merely a cloud that occasionally floats over my head.",
   "created_utc": 1696638117,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3si4e0",
   "message": "similar to being utterly bored but also lacking the desire to accomplish anything at all—not even breathe. You want to do something but are stuck since you are unable to think of anything you would like to accomplish.",
   "created_utc": 1696638153,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3si4g7",
   "message": "Sadness,  lethargy, hopelessness, etc....",
   "created_utc": 1696638154,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sic90",
   "message": "Loneliness. But it's not at all the same loneliness undepressed people feel. The English language doesn't have a word for it, so we just tend to call it loneliness, loneliness with a constant dread of being abandoned. It's a feeling I distinctly remember feeling as a child, that then disappeared when I grew into a healthy adult, never to come back unless you get hit with depression.",
   "created_utc": 1696638253,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sicgd",
   "message": "I don’t feel anything.",
   "created_utc": 1696638256,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sicyb",
   "message": "No desire, enthusiasm, or motivation for the future.",
   "created_utc": 1696638263,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sigas",
   "message": "Lack of motivation, numbness, and hopelessness. Sadness is one thing it is not—that's a different emotion and one I don't often experience.",
   "created_utc": 1696638305,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3siqzi",
   "message": " From my experience nothing,  no happiness, no anger just emptiness.",
   "created_utc": 1696638443,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sizy0",
   "message": "It feels like there’s an empty dark hole in your heart that no matter what you do can’t be filled",
   "created_utc": 1696638560,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sj2gi",
   "message": "Your sister",
   "created_utc": 1696638593,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sjbw4",
   "message": "Lack of motivation or care to do *anything*, even things you used to enjoy or proper hygiene activities (shower, brush hair, brush teeth, etc). Not really feeling anything, kind of just *there*.",
   "created_utc": 1696638714,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sjgb5",
   "message": "Imagine waking up, and going about your routine with little energy and feeling such a profound sense of hollowness, a tangible emptiness. It feels like time is an infinite desert of quiet suffering, even though you have a good job,  a house,  money, etc. You look out on the beautiful sunny day and think \"I hate everything\". You feel an incredible loneliness and you think to yourself \"I'm going to die alone. I'm not attractive. People think I'm ugly, gay, or creepy. I can't connect and make new friends. It's over.  I'm never going to heal. Never going to get better. Every day is going to be like this one.  Forever.\"\n\nAnd then someone asks you to help make breakfast.",
   "created_utc": 1696638771,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sji22",
   "message": "Nothing and everything. There is a deep whole that can't be filled by anything but things that are bad for you. You live your life trying to distract yourself form the emptiness inside but the distraction is never enough. Depression is the feeling of pure disappointment, in yourself, in others, in the world. But at the end of the day it's just exhausting without the relief of sleep.",
   "created_utc": 1696638793,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sjy6r",
   "message": "It’s like wanting to not be seen and feeling like you are better off being alone than being part of a collective because no one really cares. It’s a flatline on the heart monitor - it just keeps on going without a pulse, without reason to live.",
   "created_utc": 1696639001,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sjyb9",
   "message": "Hollow, never good enough so we, or at least I just give up. The best way I can think to describe it is, imagine putting all of your energy and effort into something you are passionate about. Whether it be art, music, a book, fixing a car, remodeling a house etc. Then finding out you did it all wrong, it wasn’t satisfactory, you didn’t try hard enough. You put all of your effort into right? It’s fucked up it didn’t come out the way it was supposed to? A person who experiences depression has that feeling frequently if not consistently. And what it leads to is just giving up. Why should I bother? If I do this, there’s going to be something wrong with it anyway. And that feeling can lead to either, 0 motivation and sulking and or anger, and then it bleeds to those around you.",
   "created_utc": 1696639002,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sk7uh",
   "message": "It feels like I'm feeling nothing at all.",
   "created_utc": 1696639126,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sk9nc",
   "message": "Absolutely nothing at all.",
   "created_utc": 1696639150,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3ske9i",
   "message": "Complete lack of motivation to do anything. Nothing is interesting, even things you would normally love. Getting out of bed can feel impossible. Being so exhausted all the time. Angry outbursts you can't control. It's a physical and mental heaviness pushing you down. Like living in a world with double gravity while everyone else walks on the moon.",
   "created_utc": 1696639210,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3skee3",
   "message": "Not much. I usually go from a negative neutral mood to a neutral neutral mood. I don't know the last time I felt a positive emotion.",
   "created_utc": 1696639212,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3skp09",
   "message": "Feel like a big useless hunk of crap no matter what you do in a day. Have to twist your own arm to get up and do basic shit. Could receive the best news or worst news in the world and the reaction would be \"meh\" like nothing matters. It's pretty fuckin' lame.",
   "created_utc": 1696639348,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3skw4n",
   "message": "Absolutely empty",
   "created_utc": 1696639440,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sl1ma",
   "message": "Nothing and permanent pain",
   "created_utc": 1696639510,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sl1ml",
   "message": "Total loss of motivation or drive; deep sadness for some,  numbness for others.",
   "created_utc": 1696639511,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sl1x1",
   "message": "Hopeless.  Helpless.  You may want to cry a lot.  You may not want to get out of bed.  You may leave your dirty dishes in the sink for days at a time.  It's different from person to person, but there are a number of common symptoms.  If you are questioning whether you are depressed, please reach out to someone (friend/family), or one of the telephone/online resources to talk to someone.",
   "created_utc": 1696639515,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sl5e9",
   "message": "Empty. I don't enjoy playing my favorite games or seeing my favorite shows. If I laugh at something, the joy is hollow and vanishes into nothingness as soon as the amusing thing stops. I can't remember what it felt like to smile genuinely, to feel at peace with myself, to feel like I can breathe and fill my lungs and enjoy existing.\nEvery time I feel like maybe I'll be better soon it's like a wave of despair overcomes me, and once it's over, I can't feel anything anymore, again. The world is too loud, scary, and overwhelming, it feels like it's crushing me, like it'sdriving a thousand needles under my skin. At the same time, it feels like there is a forcefield between me and reality, and I am not fully present, unable to truly touch things, unable to feel emotions that seem real.\n\nThe details are different for everyone, of course.",
   "created_utc": 1696639559,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sl80c",
   "message": "I liken it to dragging wet bags of cement with you for everything you do.",
   "created_utc": 1696639593,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sl8gx",
   "message": "Being tired constantly. Mostly just mentally, not physically, and a little existential dread maybe.\nBeing lazy isn't a part of it, but feeling unsetisfied with whatever it is you do is a part of it.\nContrary to common belief, you can be depressed *and* productive, although being depressed does make it a little harder",
   "created_utc": 1696639599,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slaka",
   "message": "Doom",
   "created_utc": 1696639625,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slemg",
   "message": "Pfft",
   "created_utc": 1696639676,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slfxl",
   "message": "From my personal experience:\n\nSleeping any chance I get. Even slept a whole Saturday away. Not taking care of myself. Not taking care of anything around the house. Feeling hopeless and like all the days are the same. Not wanting to talk to anyone.",
   "created_utc": 1696639694,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slgda",
   "message": "Numbness and boredom",
   "created_utc": 1696639699,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slizo",
   "message": "Darkness, easy fatigue, no interest in anh activity, prefers to stay in bed or shut alone in their room being unproductive, shutsdown from people, distances from everyone",
   "created_utc": 1696639733,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slj9p",
   "message": "I generally feel depressed. As in no motivation, just tired and listless, no interest in anything. Don't care if I live or die. Fortunately it doesn't happen often.",
   "created_utc": 1696639737,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sll4s",
   "message": "You feel the winter in you during the heat of the summer.",
   "created_utc": 1696639760,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sllhz",
   "message": "A sinking weight in your chest that pulls all your happiness in",
   "created_utc": 1696639765,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slnhe",
   "message": "I feel like I'm nothing. I have no purpose and no drive to find a purpose. I feel like a burden to everybody around me. I find no joy in anything, no emotional connection to anything or anyone, and I don't care. I wake up every day, and my first thought is always, \"Why did I wake up again instead of just dying in my sleep?\"",
   "created_utc": 1696639790,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slxpc",
   "message": "Possibly Tiredness, no motivation to do anything, dont find joy in things you used to love, just feeling negative or down (if that makes sense) those are a few things.",
   "created_utc": 1696639922,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sly1x",
   "message": "Sometimes I feel nothing; sometimes I feel like everything is happening in my brain at once and I feel overwhelmed.",
   "created_utc": 1696639926,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sly3g",
   "message": "For me it was Not wanting to fix anything, true depression is when you fester, you don’t grow you sink. Things ultimately get worse because you let them boil over, soon your even worse off than before, and they can turn into toxic complacency where you frankly stop caring in a desperate attempt at not confronting the issues. Trailer park boys quote summarizes ““Do you know what a shit rope is Julian? It’s a rope covered in shit that criminals try to cling to. Y’see, the shit acts like grease, and the harder you tighten your grip, the more you slide down it”. And that’s how it feels, like you fell down the shit well and you have a shit rope. It’s a hard climb but I got out",
   "created_utc": 1696639927,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3slzgg",
   "message": "Like you just got back from a funeral that nobody else remembers.",
   "created_utc": 1696639945,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sm0vj",
   "message": "Too tired to make progress, too restless to just sit or lie down, and too scared about either of those.",
   "created_utc": 1696639963,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sm5j0",
   "message": "It's physically, mentally, and emotionally exhausting",
   "created_utc": 1696640024,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sm9wq",
   "message": "Endless nothing. You don't want to do anything and you don't want to do nothing.",
   "created_utc": 1696640082,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sma6f",
   "message": "Hopeless",
   "created_utc": 1696640085,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3smftv",
   "message": "Nothing tbh, it's numbness, like you're not real anymore, you don't control your body anymore it's almost like you were on autopilot.",
   "created_utc": 1696640160,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3smktr",
   "message": "Nothing and everything- all at once",
   "created_utc": 1696640225,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sms3u",
   "message": "Empty. Stuck. Like the dreams where you run in slow motion. Like you’re in a hole and you’re climbing up the bottom is only getting lower. If you were in a tunnel there’s no light. Then you pull it together everyday, go through the motions get reviews that say you go above and beyond and compliments on how beautiful you are. But then you get in the car to get home and you don’t want to get out you want to freeze. You don’t eat all day or you eat all day no in between. Sleep is hard and you feel burned out all the time because it takes more energy to rotate your basic needs so hobbies are on the back burner and self care is a long shower.",
   "created_utc": 1696640322,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3smz4q",
   "message": "Extreme lack of motivation. Feeling dead inside. Apathy. Flat-lined emotions. Exhaustion. Insomnia. Feeling no pleasure or joy in anything. The desire to be left alone. Not able to take care of yourself. Brushing your teeth and showering feel like climbing Mount Everest.",
   "created_utc": 1696640415,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3smz7z",
   "message": "\u0026amp;nbsp;",
   "created_utc": 1696640417,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3smzbh",
   "message": "For me. Chester Bennington summed it up. \n\nWake in a sweat again\nAnother day's been laid to waste\nIn my disgrace\nStuck in my head again\nFeels like I'll never leave this place\nThere's no escape\nI'm my own worst enemy\n\nI've given up\nI'm sick of feeling\nIs there nothing you can say?\nTake this all away\nI'm suffocating\nTell me what the fuck is wrong with me\n\nI don't know what to take\nThought I was focused, but I'm scared\nI'm not prepared\nI hyperventilate\nLooking for help somehow, somewhere\nAnd no one cares\nI'm my own worst enemy\n\nI've given up\nI'm sick of feeling\nIs there nothing you can say?\nTake this all away\nI'm suffocating\nTell me what the fuck is wrong with me\n\nGod\nPut me out of my misery\nPut me out of my misery\nPut me out of my\nPut me out of my fucking misery\n\nI've given up\nI'm sick of feeling\nIs there nothing you can say?\nTake this all away\nI'm suffocating\nTell me what the fuck is wrong with me\n\nhttps://m.youtube.com/watch?v=LPgwY11jzK8\u0026amp;pp=ygUUZ2l2ZW4gdXAgbGlua2luIHBhcms%3D",
   "created_utc": 1696640418,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sn23m",
   "message": "Nothing \n\nYet everything",
   "created_utc": 1696640453,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sn7n3",
   "message": "Hopeless",
   "created_utc": 1696640526,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3snb3g",
   "message": "he doesn't feel like doing anything at all",
   "created_utc": 1696640571,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sncnv",
   "message": "he doesn't feel like doing anything at all",
   "created_utc": 1696640592,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sngis",
   "message": "Guilt for not enjoying things. I remember being very very clinically depressed in the summer and I felt very guilty for not going outside and enjoying the summer. I would look at people walking on the sidewalk out my window and think I could be doing that, I should be doing that. And I would stay in bed and I felt guilty for it. But also felt unable to get up and go out. It was a strange combination of knowing I should be doing things could be doing things but not really having the willpower to do them. And then feeling guilty for not doing them.",
   "created_utc": 1696640643,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3snmcj",
   "message": "1) loss of motivation \n2) everything feels pointless \n3) people will be speaking and you just feel like they are blabbing on—almost like nothing they say really matters \n4) hard to pay attention to anything \n5) lonely around people but lonely when alone\n6) physically weak and mentally burned out\n7) libido skyrockets out of nowhere and the sudden urge to masturbate takes over (sometimes lasting all day)",
   "created_utc": 1696640720,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3snywx",
   "message": "Tired and empty",
   "created_utc": 1696640882,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3so067",
   "message": "Right now I’m not feeling much, almost like a hole that needs to be filled.",
   "created_utc": 1696640899,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3soeys",
   "message": "Hopelessness. It's like everything goes wrong all the time.  Its like u can't count on anything, you always have to be on your A-game.  It's like all you want to do is go to work and *actually* just do your job right, but no one else wants to, *even the owner*.  It is frustrating.",
   "created_utc": 1696641094,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3somdt",
   "message": "It depends on how deep the depression is.\n\nSometimes I feel lethargic and stay in bed, feels like I'm wearing a lead suit of armour.\n\nWhen off my meds it could get to the point where I got: emotionless, dark, calm, used to get told off from an ex saying I spoke like a robot and was emotionless 🤷🏼‍♀️\n\nThen there was the deepest depression, the one you genuinely feel the world is better off without you.",
   "created_utc": 1696641192,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sontb",
   "message": "Most days, nothing. I feel hunger, so I eat. I get tired after a long day, so I sleep. I study, so I can sustain my self in the future. The brief periods of happiness with friends are fleeting, but memorable. I don't mind feeling nothing.",
   "created_utc": 1696641211,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sooqq",
   "message": "More than sadness. It feels heavy, like something is weighing you down.",
   "created_utc": 1696641224,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3soquf",
   "message": "Either nothing or just general sadness.",
   "created_utc": 1696641253,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sotu7",
   "message": "Nothing. When I get depressed, I feel totally dull and just want to sleep. I'm not tearfully sad but the anhedonia is unbearable.\n\nIt gets hard to attend to personal hygiene or clean the house because it takes so much energy and doesn't seem to matter. I don't want to talk to anyone because it takes energy. Eating an over-the-top amount of snacks and fast food  can provide a bit of dopamine, so can scrolling TikTok because every few secods there's something new to look at. I definitely dont want to prepare healthful meals, socialize or get some exercise because --say it with me-- I don't have the energy. And I don't believe that any of those things would help anyway. Sleeping passes the time and occasionally the dopamine hit from buying something I don't need provides a vital bit of relief.",
   "created_utc": 1696641293,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sovld",
   "message": "“Fuzzy nothing”",
   "created_utc": 1696641316,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sp3y4",
   "message": "Sometimes its nothing- thats why you sit there harming yourself by listening to sad music or thinking of terrible things- to feel something",
   "created_utc": 1696641429,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sp70s",
   "message": "Depression isn't the same for everyone. Some feel sad and tired lack of motivation. Some people feel isolated and full of rage and all the little things adding up should make you feel like your drowning or sad but instead fule the anger. Others withdraw, they try to disassociate. It's like trying to get away from something like it's poison or dangerous, except it's your friends your work your family and all the stuff that's causing the feelings. \n\nWe are all like a color chart. My red might look like your red but mine feels spiky and yours feels soft. \n\nLife is complex and ever changing. Change your view and change your mind. People need people now more than ever. A little understanding and some kindness goes a long way. Hope this helps.",
   "created_utc": 1696641470,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sp8ez",
   "message": "A lack of capability of explaining how I feel",
   "created_utc": 1696641488,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3spcmd",
   "message": "Nothing. Emotionally you feel nothing. Physically, however, is another story. Exhaustion, full body aches. But yes, nothing.",
   "created_utc": 1696641545,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3spg9o",
   "message": "Apathy. Apathetic about anything.",
   "created_utc": 1696641593,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sphfq",
   "message": "I feel like a corpse. Like I'm not here and yet I simultaneously feel everything and nothing. I hate it.",
   "created_utc": 1696641609,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3splin",
   "message": "Lost all ambition, all of your favorite activities no longer even remotely interest you. You wake up crying because you didn’t die in your sleep and you don’t wanna wake up and do this anymore.",
   "created_utc": 1696641664,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3spmnu",
   "message": "Want to get up but can't.\nNeed to shower but just can't.\nHave calls to make but can't.\nHungry, 2 or 3 crackers is enough.\nMake lists, make lists..do nothing.\nThink constantly about how tomorrow will be different.\nIt's not.",
   "created_utc": 1696641679,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3spoxo",
   "message": "I describe it as always living in a wet tent. Nothing is comfortable.  Every inconvenience is magnified.",
   "created_utc": 1696641708,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sprp0",
   "message": "Everything is meaningless. Sometimes I stop loving people I love",
   "created_utc": 1696641745,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3spufz",
   "message": "I think it depends on the level of depression. Mild may be fatigue, lack of motivation, apathy, sadness and just rlly feeling like you don’t want to do anything. When it gets more severe it’s really difficult to deal with bc it feels like your brain literally doesn’t work, it takes so much physical energy to even walk or answer a simple question, you’ll be on the verge of crying every single second and will easily start crying if someone talks to you or pushes you. Basically just doing literally anything takes 1000x more effort. And obviously if you’re going through this for a while you’ll get the thoughts of hopelessness and a lot of your thoughts will just be how you don’t want to be there anymore just bc you literally don’t have the ability to enjoy anything. Really not a fun time lol",
   "created_utc": 1696641781,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sq06m",
   "message": "Cold, tired, either numb or an anxious mess, and sometimes achey.",
   "created_utc": 1696641856,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sq52j",
   "message": "For me, oddly nothing.",
   "created_utc": 1696641922,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sq83s",
   "message": "Heavy",
   "created_utc": 1696641963,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqafx",
   "message": "When I am depressed I feel tired.  I just lack the desire or energy to get up and do ANYTHING.  No jokes are funny.  No game sounds enjoyable to play.  My body hurts.  Hearing other people speak irritates me.  I don't feel like talking. I don't feel like listening.  \n\nThere is no hope.  There is no reason to eat.  There is no reason to get out of bed, much less make my bed.  Music is just noise.  \n\nI am tired but I don't even want to lay down because that seems like a waste of time I could be doing... Well, whatever I would be doing, but I don't feel like doing that either.\n\nThe world seems muted.  Colors aren't as bright. The sun doesn't shine as bright.  The beauty in the world is dull.\n\n\u0026amp;#x200B;\n\nThat is what it feels like to me when I am in a bout of depression.",
   "created_utc": 1696641994,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqaya",
   "message": "Heavy and like the after effects of a hammer hitting every joint I have making me not want to use them to move around.",
   "created_utc": 1696642001,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqber",
   "message": "Dark everything you think about is dark. Someone could put a million dollars in cash on your bed and you wouldn't give a shit about it. You don't care about food current events you wish everything was gone dead.",
   "created_utc": 1696642006,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqcdh",
   "message": "Empty and numb majority of the time. Tired, sad, lonely, crying for no reason. Zero motivation to do anything, including daily hygiene. Having sleep for dinner instead of cooking anything because you don't want to do the dishes.",
   "created_utc": 1696642019,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqe6z",
   "message": "No hope at all, rotten thoughts, warped reality, static inside your head, numbness, restlesness, etc.",
   "created_utc": 1696642044,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqlht",
   "message": "To me it’s a dark \u0026amp; heavy blanket… worn in the style of a sheet ghost costume. You know it’s there and effecting the way you are seeing the world and feeling but it isn’t something you can lift",
   "created_utc": 1696642142,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqliz",
   "message": "Largely, nothing. JK Rowling came up with the concept of dementors during one of her depressions: creatures that suck all of the happiness and joy out of the room, before sucking your soul out of you, leaving you as an empty husk of a person. That’s strikingly close to my experience with major depression.",
   "created_utc": 1696642142,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqm58",
   "message": "For me: You wake up tired. You go to work tired. You get home tired. You are excited to go back to bed... because you are tired. You try and fall asleep knowing you are tired, but the sleep won't come. But why? You're so tired!\n\nRinse and repeat.\n\nThrow in a \"I have interests... why am I not interested in my interests? I'm interested in being interested in my interests. Why isn't it happening? \n\n....you wake up tired. You got to work tired. You get.... \n\n\nI think you get the idea.",
   "created_utc": 1696642151,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sqqq6",
   "message": "Hopelessness and emptiness. It’s as if you’re stuck in a deep hole in the ground, with no way out. You look up and see everyone else walking by, smiling, and living their happy lives while you slowly starve and rot.",
   "created_utc": 1696642212,
   "score": 1,
   "submission_id": "171qu4x"
  },
  {
   "comment_id": "k3sr84m",
   "message": "for me it was basically a cycle of this everyday\n\n\"Ugh I have to get up?\"\n\n\"I don't wanna do that\"\n\n\"I don't have to do that\"\n\n\"Is there a way I can get out of this?\"\n\n\"I don't wanna do this\"\n\n\"I'm just gonna take a nap\"\n\n\"I can't sleep\"\n\n\"I'm gonna have a snack\"\n\n\"Nevermind walking to the kitchen is too much work\"\n\n\"I'll just play some video games\"\n\n\"This is sort of fun\"\n\n\"Now I have to go to sleep\"\n\n\"I can't go to sleep\"\n\n\"It's 1 am I have to go to sleep now\"\n\n\"I can't go to sleep\"\n\n\"Why do I have to live?\"",
   "created_utc": 1696642447,
   "score": 1,
   "submission_id": "171qu4x"
  }
 ]
}