{
 "submission_id": "1725aca",
 "title": "Whats the most unexpected thing that happened to you while having sex?",
 "selftext": "",
 "created_utc": 1696681896,
 "permalink": "/r/AskReddit/comments/1725aca/whats_the_most_unexpected_thing_that_happened_to/",
 "score": 15,
 "url": "https://www.reddit.com/r/AskReddit/comments/1725aca/whats_the_most_unexpected_thing_that_happened_to/",
 "comments": [
  {
   "comment_id": "k3ugpxu",
   "message": "My college girlfriend was giving me head one morning after my roommate left for class. As I'm about to cum, my roommate walks into our room...My girlfriend flew off of me, grabbed the blanket and pretended to be asleep, leaving me completely uncovered. My roommate and I make direct eye contact as I finished all over myself.",
   "created_utc": 1696682657,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ufxtx",
   "message": "My ex was a screamer. And every time she came, without exception, my dog would howl in sync with her scream. Didn't matter where in the apartment we were. I can only imagine what the neighbors thought.",
   "created_utc": 1696682248,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uj93s",
   "message": "Half a broken condom coming out, attached to the tip of the one I was wearing",
   "created_utc": 1696683939,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uhfl2",
   "message": "My strictly nothing but fwb whispered 'I fucking love you' when dirty talking during sex.  I don't even think he realised tbh. I just turned over, bit the pillow and tried not to freak out while he kept pounding away.\n\nWe've been together three years in November and he is the love of my life ♥️ we can't even put point at what point it went from emotionally unavailable mates who fuck to soul mates but here we are.",
   "created_utc": 1696683023,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ufhtx",
   "message": "While she was on top she swapped holes on me. She took it like a champ",
   "created_utc": 1696682014,
   "score": 27,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ujt5z",
   "message": "I was having sex with a chick at a military training school. I was in a hotel room and someone started pounding on the door. Opened it and people were partying because Osama Bin Laden has just been killed.\n\nUnexpected",
   "created_utc": 1696684213,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ufs8g",
   "message": "I felt a sudden gush of fluid during her orgasm.... had to change the sheets!  wasn't expecting that as it had never happened before.",
   "created_utc": 1696682167,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ugvj4",
   "message": "Inadvertently found out I could squirt which was interesting.",
   "created_utc": 1696682736,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uinc6",
   "message": "Kitten somehow wandered up in bed, looked up onto my dangling balls and went for the kill.",
   "created_utc": 1696683639,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uklm7",
   "message": "We had just finished and I was still inside her, missionary style. We're both breathing heavily and suddenly, she ripped the longest, loudest fart ever. I mean she damn near blew the door shut. And I totally felt myself sink on her as she deflated like a popped pool floatie. She said \"Well, that was lovely,\" and I lost it. Haha. Poor thing.",
   "created_utc": 1696684597,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ugzb8",
   "message": "I cried, this started a few yrs ago when I was pregnant. I would just get a surge of emotions happiness, sadness, silliness, ect. Freaked my bf out a bit cause I’d be laughing and crying randomly. Still happens every so often",
   "created_utc": 1696682790,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uiuyb",
   "message": "She started playing “Zombie” by the Cranberries and was humming it",
   "created_utc": 1696683744,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uij40",
   "message": "She ate my ass during a BJ. Just went for it totally unprompted. What a champion.",
   "created_utc": 1696683580,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ujbq1",
   "message": "Saw my phone light up with a text that I ignored, followed by a phone call, which I also ignored. Then another phone call, always a bad sign, so I finally answer and I have to go pick up my aunt and uncle from a coworkers wedding because his cheating with a different coworker was exposed. (It was also a place I worked too, and I was oblivious to all of it before these calls)",
   "created_utc": 1696683979,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ul2y8",
   "message": "The guy with 10,000,000 power in rise of kingdoms walked in.",
   "created_utc": 1696684830,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uk9os",
   "message": "Honestly how out of shape I was. We both put on some weight during the relationship. While she got better looking by the day, and it was mostly “happy weight”, I gained 30lbs. It didn’t look good on me. As we’re doing the deed, I can barely catch my breath and my leg starts cramping up. I tried to push through it, but I honestly couldn’t. I needed a break, and more importantly a second to catch my breath. I was 27. I asked her to get on top and she started to get tired too. We both laughed, found a way to finish and went to bed. I started working out again lmao",
   "created_utc": 1696684436,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uhc1x",
   "message": "Her pitbull woke up, hears the noise and came into the room. I saw this big wide head peering at me from around the edge of the door, heard his nails clicking on the hardwood floor as he walked around to the foot of the bed, felt the bed shake as he jumped up onto the bed. Then, he started to lick my ass.",
   "created_utc": 1696682972,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uim0x",
   "message": "Cat attacked my ass",
   "created_utc": 1696683621,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uff4y",
   "message": "I woke up",
   "created_utc": 1696681974,
   "score": 8,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ulqst",
   "message": "I got with a guy that would sneeze when he came. I only hooked up with him a few times, but each time he was about to cum there was a sneeze, then the spurt. \n\nIs that a reflex? Was it just coincidence? I never knew and haven't really thought about it till now.",
   "created_utc": 1696685145,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uiwfy",
   "message": "Another person was there?",
   "created_utc": 1696683764,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uk7bz",
   "message": "Snapped the old bango string.",
   "created_utc": 1696684404,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uju6a",
   "message": "”hey guys, what’s the sexiest sex you’ve ever sexed???”",
   "created_utc": 1696684227,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ug6d9",
   "message": "The girl had her menstrual period in the act hahaha 😂",
   "created_utc": 1696682372,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ujwni",
   "message": "Things may happen during anal sex lol",
   "created_utc": 1696684260,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uk92a",
   "message": "Pregnancy 🤦‍♂️",
   "created_utc": 1696684427,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ullvo",
   "message": "The first time having sex with a girl I met on tinder and during sex she whispers “put a baby in me”",
   "created_utc": 1696685080,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ulp7h",
   "message": "She threw up all over the bed during doggy 🥲",
   "created_utc": 1696685125,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3uls7a",
   "message": "Preface this by saying I have a genetic condition that leads to hypermobility and joint dislocations.\n\nOne night, we're doing plain ol missionary, and both of my hips crack like an axe hitting a log. I burst out laughing as he stops, horrified wondering if he just broke my bones. I had to convince him it was OK to finish, because the relief outweighed the initial pain.",
   "created_utc": 1696685163,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ulty5",
   "message": "I've popped a knee out of place. Stopped long enough to get it back in and kept going. I've also stuck a thigh on the hot exhaust of an 18 wheeler.",
   "created_utc": 1696685186,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3um4ck",
   "message": "I was fucking her so good she blew out her ass and shit the bed. The first time I did it was missionary so it went all in the bed but the second time was doggy style and I shit all over my stomach not very sexy.",
   "created_utc": 1696685321,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3ums65",
   "message": "69ing with my ex and of all the moments she decides to deep throat me for the first time, and I came right then and there. She coughs a little, but still swallows every last drip of my cum.",
   "created_utc": 1696685626,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3umths",
   "message": "Her cat attacked my foot. She thought I was having the best orgasm of my life.",
   "created_utc": 1696685643,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3umvl9",
   "message": "Disappointing my wife and unintentionally driving a massive wedge in our relationship.",
   "created_utc": 1696685670,
   "score": 1,
   "submission_id": "1725aca"
  },
  {
   "comment_id": "k3umwn9",
   "message": "A condom broke and it made a loud pop sound inside her when it happened",
   "created_utc": 1696685684,
   "score": 1,
   "submission_id": "1725aca"
  }
 ]
}