{
 "submission_id": "1746zjx",
 "title": "What's a dirty little secret you found out about a company or service that made you stop using them?",
 "selftext": "",
 "created_utc": 1696895742,
 "permalink": "/r/AskReddit/comments/1746zjx/whats_a_dirty_little_secret_you_found_out_about_a/",
 "score": 217,
 "url": "https://www.reddit.com/r/AskReddit/comments/1746zjx/whats_a_dirty_little_secret_you_found_out_about_a/",
 "comments": [
  {
   "comment_id": "k48euxl",
   "message": "Companies like BetterHelp (mental health platform) exploit clients data/info and breached privacy - yet they still advertise everywhere. Somewhere in total about 3 lawsuits about it \n\nhttps://www.ftc.gov/business-guidance/blog/2023/03/ftc-says-online-counseling-service-betterhelp-pushed-people-handing-over-health-information-broke",
   "created_utc": 1696911975,
   "score": 36,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k485cil",
   "message": "Intuit lobbied to keep taxes complex. Fuck TurboTax.",
   "created_utc": 1696907073,
   "score": 196,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48b58c",
   "message": "Suuuuper petty I know, but Crumbl Cookies. \nTheir VP of HR did an AMA on LinkedIn I happened to see because they are fairly local and a few mutual connections. Any way she went off on why they were always understaffed in an area because “everyone one else is paying above market value for employees and they [we] only want to pay market value and hire people passionate about their [our] brand , and making cookies” \nIt really rubbed me the wrong way, because if everyone else is paying more than you it doesn’t mean they are paying above market value, it means you are paying below market value.\nI haven’t been back since, besides they also sued another company for also selling cookies in square boxes… and honestly the other companies taste better",
   "created_utc": 1696909929,
   "score": 243,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k488xx4",
   "message": "Nissan [spent a decade ruining the life](https://jalopnik.com/uzi-nissan-spent-8-years-fighting-the-car-company-with-1822815832) of the guy who owned nissan.com",
   "created_utc": 1696908785,
   "score": 29,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k481wec",
   "message": "Subway knew \u0026amp; covered up that Jared was a pedophile.",
   "created_utc": 1696905526,
   "score": 56,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47nr9u",
   "message": "Angie’s List.  Did work for a person and they left a good review on Angie’s List.  Next thing I know I’ve got a guy from their call center blowing up my phone.  He wanted me to pay them to put more good reviews under my company’s name and to steer potential customers towards my business for an additional fee.  Basically everything they say they don’t do on their ads.  I’m sure it was a trustworthy company when Angie still owned it, but it’s scammy as hell now.",
   "created_utc": 1696899608,
   "score": 160,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k488f5p",
   "message": "I used to work as the lead designer for BLUENOTES in canada, YM inc knowingly uses near slave and child labour and denies everything in the press, but they do know, and they don't care.   \n\n\nmoney is more important.",
   "created_utc": 1696908526,
   "score": 0,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48fdvc",
   "message": "I used to work for goodwill and in the back I saw one of the coworkers (who has a physical and mental handicap) come out of the office of our store manager crying.  I really liked this coworker,  I remember her as one of the nicest people I've ever known.  I asked her what was wrong and she said that her wages were going to be cut substantially.  She stated that the store manager was told by corporate that since she was not able to work as fast as others in the back doing pricing.  I asked if she would mind if I asked what they had cut it to and she said $3.30 an hour.  \n\nWTF!\n\nIt turns out that goodwill has a policy that they can pay workers a \"sub-minimal\" wage. \n\n This was pulled from a charity site on Google showing the policy:\n\nSec 14 (c) allows corporations to pay people with disabilities a subminimum wage. According to Labor Department records, Goodwill pays some of its disabled workers as low as 22, 38 and 41 cents per hour.\n\nI stood there and hugged her while she cried.  \n\nGoodwill does not show much goodwill towards their workers.",
   "created_utc": 1696912277,
   "score": 178,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48cv58",
   "message": "Frontier Airlines likes to post fake flights at good times and charge a premium for them.  Then they \"cancel\" the good flight that never really existed and stick you on a red-eye they sell for much cheaper and don't refund any of the difference in price.  Yeah you can refuse and get your money back and book with another airline, but you have to wait on hold an hour to do it and now all your options with other airlines have gone up hundreds of dollars since when you booked.",
   "created_utc": 1696910859,
   "score": 50,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48j0xd",
   "message": "Went to a small diner a few blocks away from me. I used to go there all the time. They were decent and the staff was great. Not the best ever, but it hit the spot.\n\nOne day I went in and the owner started going around berating the staff and yelling at them in front of everybody. He saw me staring at him so he comes up to me and says \"I'm sorry about that\". So I said to him \"if I worked for you, and you talked to me like that, I'd smack the shit out of you.\" Immediately got up and left. Never went there again.",
   "created_utc": 1696914508,
   "score": 207,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48o42m",
   "message": "Boycotting [Nestle](https://en.wikipedia.org/wiki/1977_Nestl%C3%A9_boycott) since 1977.  \nFuck Nestle, fuck them forever, baby murderers.  \nGave out free baby formula to 3rd world counties, then when the mothers milk dried up, they tried to charge for it. The mothers couldn't afford it and their babies died.  \n  \nThey still, to this day, engage in egregious tactics with their baby formula.  \nhttps://www.theguardian.com/business/2018/feb/01/nestle-under-fire-for-marketing-claims-on-baby-milk-formulas  \nhttps://www.theguardian.com/lifeandstyle/2018/feb/27/formula-milk-companies-target-poor-mothers-breastfeeding",
   "created_utc": 1696917965,
   "score": 41,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k489too",
   "message": "I will never buy anything from LG.\n\nSometime around 2008ish, they (like many other hardware/software companies) were messing around with what was essentially adware, seeing how far they could push things to get borderline-malicious advertising onto your home computer. Stuff like the pile of CDs that came with your new Gateway, the \"do you also want to install X, Y and Z? We're going to imply it's necessary\" when installing messaging apps, or the huge unnecessary printer \"software suite\" when all you needed was the driver.\n\nLG went a step further: they embedded adware *in the firmware* of their CD/DVD drives. Every X times you opened or closed the drive, you'd get a little popup from your system tray that served you an ad--pretty much indistinguishable from the legions of adware/spyware your aunt would get from clicking \"yes\" to all her popup ads.\n\nExcept nobody clicked yes on anything, and it couldn't be removed. It was embedded in the drive itself, essentially performing an AutoPlay exploit on a virtual drive to show you the ads, then disappear again.\n\nThey eventually were threatened with legal action and had to post a firmware update/removal tool on their website.\n\nThe ad software was called BlueBirds, and LG scrubs all mentions of it from their Wikipedia article every now and then.",
   "created_utc": 1696909233,
   "score": 8,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47htpi",
   "message": "Door dash keeping drivers’ tips for themselves.",
   "created_utc": 1696897213,
   "score": 142,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k482201",
   "message": "Stopped going to a nail salon after one of the employees shared that they have to sit in the backroom in the dark when they aren't with a customer.",
   "created_utc": 1696905596,
   "score": 121,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48lgdt",
   "message": "There is a small vintage toy store chain near me called the Toy Vault. The owner, Dan, has been ripping people off for years, offering them very little money for their toy collections. He treats his employees terribly. Many toy collectors in the area have their own Dan story. One time a couple of years ago I was setting up a pop-up shop to sell a massive collection of toys that my friend's parents had hoarded. We had been advertising for a couple weeks and were excited to make some people happy offering great deals on a lot of cool toys. The Thursday prior to opening Dan messaged me asking if there was a price we'd sell the whole collection for, saying that he could bring a truck that night and rid us of the burden. I said no because neither of us had the time and told him he could come Saturday with the rest of the buyers. He replied angrily calling me an \"amature\" and said that if we were \"serious about selling\" than we would make the time, and that he knows we shop at his stores. Well I don't anymore, Dan. \nFuck Dan Mayer of Toy Vault.",
   "created_utc": 1696916114,
   "score": 47,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k489d75",
   "message": "The weather channel app collected and sold user location data without disclosing it would it be shared with advertisers.",
   "created_utc": 1696908999,
   "score": 226,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48bsif",
   "message": "Chiquita - changed its name from United Fruit Company.",
   "created_utc": 1696910278,
   "score": 68,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k4812nw",
   "message": "Hobby Lobby was fined $3million for trying to smuggle looted ancient artifacts into the US.",
   "created_utc": 1696905156,
   "score": 37,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48lmvq",
   "message": "Nestle with their \"water is not a human right\"",
   "created_utc": 1696916233,
   "score": 126,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48n12f",
   "message": "Johnson \u0026amp; Johnson, knew for decades (possibly since their inception) that their talcum powder contained asbestos. Once it became a problem they continued to sell it in low income neighborhoods because the poor can’t afford doctors or lawyers.",
   "created_utc": 1696917195,
   "score": 126,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k4826a5",
   "message": "Most of the recycling bins just get dumped in regular garbage.",
   "created_utc": 1696905649,
   "score": 226,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k4878d3",
   "message": "Newegg After their broken open-box item scams.",
   "created_utc": 1696907947,
   "score": 94,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k488099",
   "message": "There's a SUPER expensive artisanal ice cream shop in my city. They pride themselves on their \"fresh genuine ingredients.\"  My mom has celiacs, and I wanted to take her there, so I asked for a full ingredient list of their ice cream. They really didn't want to give it to me, but it's law and \"it's gluten friendly\" wasn't good enough...\n\nTHERE IS ZERO REAL CREAM. It's all modified milk ingredients and artificial stabilizers and flavorings.",
   "created_utc": 1696908319,
   "score": 192,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47gsgt",
   "message": "The guy who runs my local Subway got caught with his hands down his pants",
   "created_utc": 1696896788,
   "score": 193,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48i98k",
   "message": "BJs Restaurant \u0026amp; Brewhouse stole funds that employees donated via paycheck deductions which were supposed to be used for employee emergencies and hardships - the Give A Slice program. This occurred during the COVID-19 pandemic/shutdown - the company laid off, furloughed, and subsequently fired furloughed employees without releasing the funds which would have been absolutely essential during that time without wages.",
   "created_utc": 1696914027,
   "score": 93,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47lg8a",
   "message": "Volkswagen manipulated the software on their diesel cars so they could cheat the emissions tests. Cost them a fine of $2,800,000,000.",
   "created_utc": 1696898676,
   "score": 152,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k487zf2",
   "message": "Any kind of small, locally-owned clothing boutique. 9/10 times, it’s nothing but fast fashion rebranded to be a small business owner. Most people don’t realize this, and will happily boast, “I don’t shop at Shein, I only buy from local boutiques!,” etc. \n\nThe worst, IMO, are the ones who claim to have some type of Christian/religious influence in their store, yet their clothing is literally made in sweatshops.",
   "created_utc": 1696908308,
   "score": 250,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47eifk",
   "message": "Everything nestle. Just Google it. It's way too much and it's inhumane.",
   "created_utc": 1696895855,
   "score": 106,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k481jfv",
   "message": "Anything self service or delivery. If you don’t get it yourself it’s likely been contaminated.\n\nI currently work in a restaurant but previously worked for a grocery store. Here’s a few things I have encountered:\n\nCustomers taking bites out of donuts in the self service donut case… and putting them back\n\nA grocery store pick up clerk grabbed a bare loaf of bread (pre Covid) with utility gloves that are also used on trash and wood pallets \n\nCustomers have been witnessed on multiple occasions licking the serving spoons in the self service soup bar then putting it back. This led to its removal.\n\nPeople sticking their bare hands in the lettuce pans at the self service salad bar.\n\nSomeone posted on Reddit a week ago confessing that they picked up a door dash order for a customer which was a coffee with whipped cream on top. They had their dog in the car which decided to lick the whipped cream off the top of the drink. OP lied to the customer saying that the whipped cream melted.",
   "created_utc": 1696905364,
   "score": 249,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47h0hd",
   "message": "Scamazon sells fake name brand goods and when you point it out to them, they tell you to go fcuk yourself",
   "created_utc": 1696896880,
   "score": 90,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48f05l",
   "message": "Uber giving their top executives millions in annual bonuses, then filing taxes claiming millions in losses.\n\nAlso: charging below local taxi rates for years to cause the local taxi companies to fold, then raising rates to above normal rate once they have a near monopoly",
   "created_utc": 1696912057,
   "score": 29,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k484rik",
   "message": "Cozy Earth - leave anything less than 4-5 stars and they won't post the review. They will also change low reviews to 5 stars themselves. I called and asked and they said they have full discretion (i'm sure a lot of companies do this) I guess they do but it makes a lot of sense now with their quality declining and their reliance on influencers to keep money rolling in.",
   "created_utc": 1696906810,
   "score": 126,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48m31u",
   "message": "Bath and body works using jail/slave labor at their contractor’s candle factory that the KY tornados hit a while back.",
   "created_utc": 1696916540,
   "score": 122,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48m71p",
   "message": "Hobby lobby was smuggling ancient artifacts from war torn areas in the middle east.\n\nhttps://www.npr.org/2018/06/28/623537440/hobby-lobbys-illegal-antiquities-shed-light-on-a-lost-looted-ancient-city-in-ira",
   "created_utc": 1696916618,
   "score": 66,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47wjdz",
   "message": "Long time back I played world of Warcraft, a news report came out about China forcing prisoners to farm gold and sell it for real money. After that any time I played and saw people spamming the messages to buy the gold and just knowing some poor bastard was on the other side forced to do what I was doing for fun completely killed the fun for me.",
   "created_utc": 1696903202,
   "score": 44,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48ik5p",
   "message": "Alaffias products aren’t as vegan as they say. They also love to hire immigrant women and treat them like dirt. The warehouse was so unsafe I quit after only two months.",
   "created_utc": 1696914217,
   "score": 59,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47zfxa",
   "message": "The way 100% orange juice (not from concentrate) is made.  I think the senate/congress sought answers on the 100%  label, but big orange made it go away.  https://reddit.com/r/ask/s/yXXq1xI7mQ",
   "created_utc": 1696904442,
   "score": 38,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48bhva",
   "message": "Walmart has/had “peasant insurance” on all of their employees. So, if you work in the bakery and die in a car wreck, Walmart gets a check for 30-50k and your family gets nothing. Haven’t given them a cent in 15 years.",
   "created_utc": 1696910117,
   "score": 166,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48el3d",
   "message": "The business model for Samsung appliances has planned obsolescence at its core, which is generally true for most appliances, but my current washer, dryer, dish washer and stove are not Samsung and I couldn't be happier. Oven has failed, but I use an air fryer anyways and didn't really lose any cooking ability.",
   "created_utc": 1696911819,
   "score": 240,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48ero7",
   "message": "Home Depot is so desperate for new credit card approvals that they pressure their own employees to apply for the credit cards, even the younger kids who they know won’t get approved, just so they can show they have people at least attempting to get one. They just need to hit a certain new credit lines open each month and they’ll do anything to get there. This probably applies to most retail shops so I don’t ever open credit at a retailer. I still shop at HD I will just never use their credit cards",
   "created_utc": 1696911923,
   "score": 101,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47kc3t",
   "message": "Papa John told us all that his employees don't deserve Healthcare.",
   "created_utc": 1696898226,
   "score": 188,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k485hqv",
   "message": "Mechanic wore a short sleeve shirt and reached for something. I saw he had a swastika tattoo.",
   "created_utc": 1696907140,
   "score": 131,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k481sds",
   "message": "Chase Bank. \n\nBeing the financial arm of JP Morgan, Chase Bank has funded both sides of nearly every single war on earth since WW1.",
   "created_utc": 1696905476,
   "score": 34,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48ad9b",
   "message": "Worked part time for a butcher, learned that the owner never eat his meat, never buy from that butcher ever again.",
   "created_utc": 1696909515,
   "score": 80,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48ac3i",
   "message": "Haven't bought Nestlé since 2015.",
   "created_utc": 1696909498,
   "score": 129,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48f4py",
   "message": "There is a huge book store chain that destroys the books they don’t sell. I go there so rarely now but every time I do go there to buy something they ask me to donate money for students who can’t afford books. Mf, just give them the books you gonna destroy. The bookstore owner is a literal billionaire.",
   "created_utc": 1696912131,
   "score": 249,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48t49y",
   "message": "An Olive Garden in New Hampshire. \n\nThe manager knew about and allowed the continued bullying and hazing of a young man who worked there through the Easter Seals program. For those who don't know, it's a program that gets jobs for people who are mentally disabled. This boy was about 16. \nHe did things like put silver in napkins.\n\nCo-workers pantsed him, spanked, called him names, emotionally brutalized him. His mom figured out what was happening because his behaviour at home changed.\n\nManagement was fully aware of the situation. They allowed it to carry on. All that resulted was the departure of the workers. No consequences for management. So I don't go to any Olive Garden anymore.",
   "created_utc": 1696921683,
   "score": 120,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48kd38",
   "message": "Just from experience, when you see a mall cop using his walkie talkie to call for other mall cops to assist because someone is shoplifting in the store that they are at, it is usually just the mall cop acting like others are going to come help him.  This was my go to technique because I was usually the only mall cop there.  Illusion of power, that's all my job was.",
   "created_utc": 1696915375,
   "score": 80,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48gtns",
   "message": "I saw the condition of Tyson chickens.  Never, ever will I touch anything Tyson, including McDonalds chicken products.",
   "created_utc": 1696913141,
   "score": 175,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k485utp",
   "message": "I used to use Go Daddy for my personal domains until their ceo put photos on their corporate page of him posing with the dead elephants he killed\n\nDude was smiling he was so proud of killing elephants.\n\nMoved my domains to 1and1.com",
   "created_utc": 1696907310,
   "score": 103,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k47sc7d",
   "message": "I used an environmental company that laid off people when Covid hit. After Covid they hired new people for far less so I bid them bye bye.",
   "created_utc": 1696901442,
   "score": 131,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48mb3j",
   "message": "Ashley Furniture- abysmal OSHA record,  repeat and willful violations. People are not expendable.",
   "created_utc": 1696916697,
   "score": 37,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48e9yw",
   "message": "I interviewed 5 PR firms for a monthly retainer of 8-20k.\nThe one that stood out was going to get my recommendation to the CEO until our 2nd meeting with the firm. They mentioned one of their media specialists was a former reporter who knew me. When they said her name, I tried not to cringe. It was the reporter who quoted an expert 10 years ago at my old job \"off the record,\" then put him on the record in the shittiest way to further her agenda.\nThey lost 20k a month because they hired someone because of their resume, vs. their reputation in the field their clients are from.",
   "created_utc": 1696911649,
   "score": 177,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48c4k1",
   "message": "To be intentionally vague, I found out one of the three primary providers for an item my company buys has some serious labor issues. We had some issues with them meeting deadlines with their product, but they were the cheapest option so we continued. After one passed deadline I decided to look into 2hat the hell was going kn. Which was literally just Google.\n\nMy boss is very apprehensive in seeking alternative sources which is frustrating as someone in procurement. I printed out the Google and Glassdoor reviews on this company and brought them to his attention. Apparently this company's policy is that new hires have to work 12 hours shifts 6 days a week at $12/hr for two months before they'll approve any additional days off. I usually take reviews with a grain of salt, there's always some jackass that has a bone to pick after they've been fired. But when a dozen people have a similar story, it means something. This is a relatively specialized manufacturing industry. As you might imagine, they run into some labor shortage issues that lines up with our delivery issues.\n\nWe'd been using them for a decade and now they're our second backup plan. My boss doesn't have a significant empathetic soft spot for labor rights, but he knows that underpaying people doesn't make for consistent performance.",
   "created_utc": 1696910456,
   "score": 112,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48ie4y",
   "message": "Special Olympics. One of my grad school professors was on the board some years ago and said the kids don’t benefit from the money donated.!he urged us not to donate, even.",
   "created_utc": 1696914112,
   "score": 86,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k481psp",
   "message": "Factory farms treat animals horribly, so I don’t buy their products any more.\n\nThe existence of so-called “ag-gag” laws is testament to the fact that people want to keep this stuff secret.",
   "created_utc": 1696905443,
   "score": 21,
   "submission_id": "1746zjx"
  },
  {
   "comment_id": "k48fqq5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1746zjx"
  }
 ]
}