{
 "submission_id": "175cjfv",
 "title": "What's your dirty secret?",
 "selftext": "",
 "created_utc": 1697026348,
 "permalink": "/r/AskReddit/comments/175cjfv/whats_your_dirty_secret/",
 "score": 120,
 "url": "https://www.reddit.com/r/AskReddit/comments/175cjfv/whats_your_dirty_secret/",
 "comments": [
  {
   "comment_id": "k4goowy",
   "message": "I saw my daughter walk before my wife did, but she thinks she witnessed it first and I'm playing along.",
   "created_utc": 1697054080,
   "score": 115,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4flsbz",
   "message": "I have a lot of money my wife has no idea about.  \n\nBefore you judge, she would spend it faster than you could possibly imagine on absolute crap. A few years ago I found a CC I didn’t know about with 20k on it.",
   "created_utc": 1697040180,
   "score": 11,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g7kih",
   "message": "The monk from a Buddhist temple where I was going regularly sent me WhatsApp videos of him inserting large objects in his anus. I’m a masculine lesbian so he suggested that I should bang him in the ass with my strapon.",
   "created_utc": 1697047959,
   "score": 146,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fxh8f",
   "message": "I'm addicted to annoying scammers to waste their time",
   "created_utc": 1697044378,
   "score": 180,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fl4vv",
   "message": "I’ve been on a low carb diet all year and my guilty pleasure is the sugar free low carb ice cream. It tastes great but if you overindulge it gives you horrible gas that always seems to come out in public so I seek out the elderly to lay my dirty bombs. Most recently I was in a grocery store and the flatulence came upon me with a vengeance, so I found a gaggle of old timers conversing in the middle of the aisle and proceeded to crop dust them and then listen to them blame it on each other while I walked away cackling manically",
   "created_utc": 1697039947,
   "score": 65,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fvhw3",
   "message": "There are times when I need to get high before having sex with my wife, because she's so fucking hot to me that I don't want things to end too quickly when having sex. \n\nWe've been married for 10 years and have a kid. It's fucking crazy to me that she just keeps getting more attractive every year. \n\nI am fortunate enough to have found her, smart enough to realize it.",
   "created_utc": 1697043672,
   "score": 65,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g3gn6",
   "message": "When I went on the first date with my now wife she asked me if I pee in the shower and I said no, because if she asked then she definitely hates it. I piss in the shower every time lmao.",
   "created_utc": 1697046507,
   "score": 133,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fkz4h",
   "message": "I had sex with my ex gf mom from high school after we broke up.",
   "created_utc": 1697039888,
   "score": 105,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4ezygt",
   "message": "I've shat my pants again.",
   "created_utc": 1697031871,
   "score": 147,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fpapb",
   "message": "Tried the deed with my cousins when we were 9 \nWe meet but don't bring up the topic",
   "created_utc": 1697041445,
   "score": 231,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fq8za",
   "message": "I extended my car's warranty",
   "created_utc": 1697041788,
   "score": 19,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fs7b6",
   "message": "I wear the same jeans several weeks in a row.",
   "created_utc": 1697042492,
   "score": 214,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g62ls",
   "message": "I really wanna bang my coworker. I’d also accept getting gangbanged by all of them",
   "created_utc": 1697047426,
   "score": 128,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fxt21",
   "message": "My mental and anxiety is worse now than it has been for a long time, but I am too scared of the consequences to admit it or say why",
   "created_utc": 1697044494,
   "score": 111,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fdm6z",
   "message": "My buddy’s girlfriend took advantage of me when I was drunk and we slept together. I remember bits and pieces of it. I woke up with her laying on my chest. I woke up and ran out of the apartment and walked two miles to my truck.",
   "created_utc": 1697037198,
   "score": 220,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4ftpg6",
   "message": "I dated a really feisty young woman who was into nipple clamps. She had several sets of clover clamps, and two sets were on chains. She attached one end to her nipples and the other end to mine. So we were chained together by the nipples while we had sex. It was amazingly intense and pleasurable on a whole new level.",
   "created_utc": 1697043034,
   "score": 148,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g5cbn",
   "message": "I won 41k a few years go. Immediately gave 25k to my parents to clear any debt. Left me with 16k. Shortly after I received my trust fund of roughly 4k. I was 18 years old with 20k in the bank. This should have set me up for a long time. All of my family think I have most of the money but the truth is it’s all gone. I went through a really rough patch with my mental health and threw it all away on drugs, alcohol and impulse purchases to try and feel something. Anything. Short term, sure it gave me a little buzz. Fast forward to Now, I’ve got nothing. It’s all gone and I hate myself for it. I live pay check to pay check all whilst trying to pretend I’m financially stable. Part of me wants to just tell them and get it off my chest. The other part is scared of their reaction when I tell them I blew 20k on total shit. I get it was my money but I’m so disappointed in myself. More so for the 4k in my trust fund. It took years for my parents to build that up. Literal years. And now it’s gone.",
   "created_utc": 1697047165,
   "score": 33,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fskvy",
   "message": "I was raped by a girl. She had been trying to get out of the friend zone for months even offering me a free trip to Ireland so long as we fucked while over there. One night she came out with me and some friends to get drunk. We barely stumbled back to my apartment later that night 4 blocks away. Woke up at some point still drunk and immobile to her riding my cock. I was too drunk to move or do anything but mumble a few unintelligible words. When I finally woke up the next morning she was gone and I never heard from her again. Her dad at the time was a cop. No one knows this except reddit. Never told a soul.",
   "created_utc": 1697042627,
   "score": 21,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4foxaf",
   "message": "Time for the burner account lol\n\nErotic Hypnosis",
   "created_utc": 1697041312,
   "score": 40,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4f5qzc",
   "message": "I’m HIV+ almost no one knows. My ex does and my old roommate. Pretty sure it’s why my ex left me because after I found out she acted differently and ended up leaving me sleeping with someone else then coming back just to leave again. Sometimes I want to kill myself but I have three kids and couldn’t willingly leave them in this world alone. I’m on medicine and undetectable but I honestly feel like I’ll never meet someone who will accept it and be with me. I’ve mostly accepted that I will be alone for the rest of my life and die alone.",
   "created_utc": 1697034211,
   "score": 161,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g4iz6",
   "message": "I’m a hyper sexual. When I’m not on birth control or SSRIs I’m literally thinking of sex 24/7. I want sex all the time and masturbate multiple times a day when I’m not on any meds that alter your libido. And no, I’ve never seen porn. I’m just low-key a freak and no one really knows lmfao. I’m on BC rn so my sex drive is much lower but that’s probably a good thing tbh. It’s so annoying to be thinking of sex 24/7 I want to be a regular human and think of literally anything else.",
   "created_utc": 1697046877,
   "score": 245,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gqp9y",
   "message": "I freaking love Cheese pastries and cannot stop eating them. I tell everyone Im dieting and eating clean but low key them dirty cheese pastries make my flesh weak.",
   "created_utc": 1697054798,
   "score": 72,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fferb",
   "message": "I’m a metal head but secretly love j-pop and nightcore.",
   "created_utc": 1697037862,
   "score": 239,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g3g3v",
   "message": "An atheist in an extremely religious family\n\nNot dirty but I wouldn't like it to get out",
   "created_utc": 1697046501,
   "score": 41,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4eq4ua",
   "message": "I get an erection whenever I see someone fall down.",
   "created_utc": 1697027464,
   "score": 37,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gg0tu",
   "message": "I like older women.",
   "created_utc": 1697050984,
   "score": 33,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4h8gsz",
   "message": "I'm a straight woman but my guilty pleasure is reading lesbian romantic fictional stories. And no one knows about it.",
   "created_utc": 1697061267,
   "score": 29,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fau3z",
   "message": "I masturbate in my kitchen with olive oil when nobody is home. There’s a whole fantasy.",
   "created_utc": 1697036152,
   "score": 201,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gvrbo",
   "message": "When I jerk off, I think about my wife, who is sleeping next to me, and doesn't want to have sex anymore, going on three years.",
   "created_utc": 1697056602,
   "score": 62,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fz4d2",
   "message": "I want to have sex with all of my brothers in law, they all look alike.",
   "created_utc": 1697044958,
   "score": 103,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gpto5",
   "message": "I hate everyone",
   "created_utc": 1697054484,
   "score": 25,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4hegy5",
   "message": "I like getting undressed infront of a window in hopes of being seen 💁🏼‍♀️🤷🏼‍♀️",
   "created_utc": 1697063625,
   "score": 27,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fmfv7",
   "message": "I keep money away from my wife.",
   "created_utc": 1697040418,
   "score": 74,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fjbgx",
   "message": "After I broke up with my fiancé after he cheated on me, I fucked his dad.",
   "created_utc": 1697039290,
   "score": 192,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4ergq1",
   "message": "I really want to have sex with my sister in law",
   "created_utc": 1697028103,
   "score": 44,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gdh32",
   "message": "I would love to get gang banged 😭",
   "created_utc": 1697050076,
   "score": 99,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fciim",
   "message": "I am 22m from a conservative Hindu family in india and I have slept with 2 prostitutes. And even a hint of this goes to my family i am dead. I am like super super dead if anyone finds out.",
   "created_utc": 1697036783,
   "score": 152,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4f8yza",
   "message": "Have been at a happy ending massage in the town I live in. I am afraid, that I will meet her one day I am along one of my friends",
   "created_utc": 1697035451,
   "score": 102,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fom55",
   "message": "I’m broke",
   "created_utc": 1697041202,
   "score": 62,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fqegk",
   "message": "I fantazise about seeing my girl having sex with other men but i'm not sure if it's something i would like in real life.",
   "created_utc": 1697041843,
   "score": 138,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4focjt",
   "message": "Nice try FBI.  But you have to tell us if you're a cop, right?",
   "created_utc": 1697041107,
   "score": 73,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4epk2l",
   "message": "i actually get paid to watch joe rogan all day",
   "created_utc": 1697027181,
   "score": 159,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4ez95w",
   "message": "Found my moms hitachi wand",
   "created_utc": 1697031574,
   "score": 96,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gp6dh",
   "message": "I have ripped those do not remove tags off of mattresses. Don't tell anybody.",
   "created_utc": 1697054252,
   "score": 94,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gy747",
   "message": "I'm still in love with my ex despite also not believing it would ever work out between us. \n\nPretty convinced I'll just die alone at this point lul. On the upside I'm moving into my own apartment soon and getting a dog.",
   "created_utc": 1697057475,
   "score": 17,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fn891",
   "message": "This account",
   "created_utc": 1697040702,
   "score": 34,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4ggzi4",
   "message": "This one time I was on a date and I said \"this food smells funny\" then I pushed my cheeks back and shit my pants.",
   "created_utc": 1697051329,
   "score": 34,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fxh21",
   "message": "My wife, who my family absolutely loves, was a porn actress when we met 15 years ago. We have been married 15 years and she still films, although less than when we first met and married, but no one has ever found out. No one on either side of the family has a clue.",
   "created_utc": 1697044376,
   "score": 74,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4goq7h",
   "message": "I enjoy entering open doors. Whenever i see door marked “pirate” is open? I must take a proper gander. \n\nI don’t do it with homes bc that’s a felony and also i would probably be killed, but in like restaurants or convention centers or hotels? It’s open season\n\nEDIT: (With hotels i mean exploring backrooms and whatnots, not entering people’s rooms)",
   "created_utc": 1697054093,
   "score": 16,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4ftiw2",
   "message": "I dislike my girlfriend, well about 80%. But I feel bad for her and the situation she is in as far as being 100% reliable on me. I have a soft heart so every time I think about breaking up with her it’s like shooting a puppy.",
   "created_utc": 1697042968,
   "score": 148,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fy6ch",
   "message": "I'm 18 and have been extremely suicidal since the 5th grade and I work 2 jobs and basically have no life outside of work because I dropped out last year and almost all of my friends are still in school and If I'm lucky I'll get 1 day off every orher week and I just can't take it anymore but I can't quit because I'm very good at being a line cook both of my bosses have told me I'm the best cook they've had since they've opened and so I can't leave or I'll feel bad because I just want to help everyone to make them happy since I can't be happy but earlier this year at a work party my boss gave me some coke so I tried it for the first time and was hook3d immediately. I started using it for fun with co workers but then it turned from fun to using it for energy now I'm a full blown addict doing at least 7gs a week and now am just hoping I od but play it as an accident so everyone in my life doesn't know I killed myself",
   "created_utc": 1697044627,
   "score": 73,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g98xx",
   "message": "Had sex with three friends on the same day, but not at the same time.",
   "created_utc": 1697048562,
   "score": 45,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g6l4p",
   "message": "Stayed at my mils house. Had a dirty dream about sil and had a nocturnal emission in her bed right next to my wife. Everyone involved is over 18.",
   "created_utc": 1697047609,
   "score": 29,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gvcad",
   "message": "I have a pretty unhealthy relationship with food. Everyone thinks I’m so lucky that I can eat whatever I want and still be really slim. On the outside, I eat loads of pizzas and burgers and go out to restaurants all the time and generally manage to stay in good shape without ever dieting. The truth is there are some days/weeks where behind closed doors I just don’t eat to make up for the days where I overindulge. It kinda works for me but objectively speaking I think I may have a bit of an eating disorder.",
   "created_utc": 1697056450,
   "score": 12,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gvwye",
   "message": "I have a kink for gingers",
   "created_utc": 1697056657,
   "score": 15,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4f692z",
   "message": "Love to be submissive  😂",
   "created_utc": 1697034408,
   "score": 113,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fo77p",
   "message": "One of my exes was an escort. While we were dating, she lost her job and could no longer afford her lifestyle, so she found a couple of sugar daddies. I never got jealous, but we also never talked about it unless something awful happened. I did get super paranoid about STDs and got tested very frequently.  Once she found a high enough paying job in her field, she stopped doing sex work.",
   "created_utc": 1697041054,
   "score": 77,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fkujd",
   "message": "[removed]",
   "created_utc": 1697039843,
   "score": 34,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4glna5",
   "message": "I love fat women 🤤",
   "created_utc": 1697052997,
   "score": 32,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fbnul",
   "message": "I’m very depressed and low energy around my girlfriend, and always tell her nothings wrong and I’m okay. When I’m out with friends or another room with family in another room I’m the life of the party, holding conversations enjoying my time. \n\nI always tell my girlfriend yes but my mind screams “no, stop being immature and spending money you don’t have. Stop being a hypocrite “ \n\nIt’s tough",
   "created_utc": 1697036460,
   "score": 45,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fb16c",
   "message": "I'm Batman.  \n\nSorry a typo, i mean I'm Bathman.  \n\nI love to take a bath.  \nThis is the opposite of dirty secret.  \nWrong thread, sorry.",
   "created_utc": 1697036226,
   "score": 114,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fz4w2",
   "message": "I fell in love with someone I will never see again.\n\n\u0026amp;#x200B;\n\nme: married.",
   "created_utc": 1697044963,
   "score": 66,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gxhi2",
   "message": "I dropped out of high school when I was 16 and almost no one knows except my mom. I'm now 30 and still haven't told anyone. It feels really shameful and it's always on the back of my mind, mostly because I never wanted people to know how troubled I really was, and also it's super embarrassing, but damn did I hate school. After my dad died, I would just stay home and play video games all day while my mom was at work. The few days of the year I did go before dropping out, I would loathe every second of it. I was always the one getting really good test scores, but failed classes due to literally never doing assignments or homework. \n\nI joined the Navy for 6 years, and got my associates degree while in. I now make over $200k a year but will probably never publicly admit that I'm a high school dropout.",
   "created_utc": 1697057221,
   "score": 10,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4h0ctf",
   "message": "When I was 22, (26 now) I hooked up with my friends Mom a lot, a lot. She was 44 at the time. One time my friend came home while we were having sex and he definitely heard his Mom say “oh my God I’m gonna cum” and he immediately left.",
   "created_utc": 1697058250,
   "score": 11,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4fxsbn",
   "message": "Iam german and jerk off to 80s Italy Porn oder France Beurette Porn",
   "created_utc": 1697044487,
   "score": 20,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4givrj",
   "message": "All my discipline and drive is fueled by self-hatred. I'm never happy when I achieve something and I'm always craving for the next goal. I don't know if I'll ever be truly happy...",
   "created_utc": 1697052014,
   "score": 9,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4ftpiu",
   "message": "Nice try.",
   "created_utc": 1697043035,
   "score": 6,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4g09t8",
   "message": "Okay, I’ll let you know… \n\nBut don’t tell anyone or you’ll be just another regret",
   "created_utc": 1697045369,
   "score": 8,
   "submission_id": "175cjfv"
  },
  {
   "comment_id": "k4gsp0q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "175cjfv"
  }
 ]
}