{
 "submission_id": "175erv8",
 "title": "For US residents, why do you think American indigenous cuisine is not famous worldwide or even nationally?",
 "selftext": "",
 "created_utc": 1697033000,
 "permalink": "/r/AskReddit/comments/175erv8/for_us_residents_why_do_you_think_american/",
 "score": 254,
 "url": "https://www.reddit.com/r/AskReddit/comments/175erv8/for_us_residents_why_do_you_think_american/",
 "comments": [
  {
   "comment_id": "k4f6xul",
   "message": "My pov as a Navajo native, there really isn’t a good definition of indigenous cuisine. Much of what is made by tribes now is using foods that were introduced after colonization and forced removals. My tribe specifically had food made from flour and lard like frybread and certain stews. Those ingredients came as rations during our time in captivity. They eventually became common after reservations were established since the treaties allowed for government assistance and reparations. Much if not all of many tribes’ ancestral foods and recipes have been erased. My tribe used to eat a lot of deer, elk, and some fowl. Certain berries and of course a lot of corn. It is true that some indigenous people can start restaurants but that also brings up many other socioeconomic factors. I hope this helps to explain.",
   "created_utc": 1697034674,
   "score": 63,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fld0q",
   "message": "There's a lot of confusion here in the comments. Indigenous food from the new world is wide spread, celebrated, and globally known but it's under the umbrella of Mexican food. When you eat a tortilla you're eating indigenous food from the Americas. There's evidence of tortillas being made as far back as 3000BC I don't think the OP meant that but it's an example of how a lot of people overlook that indigenous foods of north and south America are actually hiding in plain sight.\n\nEdit: I missed a couple of really good examples. There's evidence of people in New Mexico eating popcorn many thousands of years ago. Also beef jerky was derived from a method for preserving meats unique to south America.",
   "created_utc": 1697040027,
   "score": 140,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fblqn",
   "message": "Disclaimer—not indigenous, but my family lives in, and I grew up in, a remote, predominantly indigenous community in northern Canada (above 55th parallel, which many would still consider southern Canada) \n\nWhere I’m from, the traditional indigenous foods are sort of plain. When our schools/the community would have traditional feasts, the bill of fare was usually as follows: \n- dry meat (usually moose), dipped in lard, dipped in sugar. \n- boiled beaver or muskrat, seasoned with salt \n- boiled moose nose (locals love cartilage)\n- stew (usually moose), heavy on root vegetables \n- pemmican (powdered dry meat, mixed with fat and dried berries)\n- fried fish, usually trout, and fried fish eggs if it was spawning season (sometimes, boiled fish heads for special guests)\n- wild rice (boiled, salted) \n- bannock (fried if it was a really special occasion)\n- tea (invariably Red Rose Orange Pekoe)\n\nAs you can see, there’s a pretty obvious colonial influence, as well as a focus on meat. I must say that, while the food is good, it’s the quality and freshness of the meat that’s the real star. There isn’t a lot of complexity, and a variety of seasonings just don’t exist in the cuisine local to my home. The food doesn’t necessarily plate well. These feasts are always served buffet-style. \n\nIndigenous chefs who’ve tried to showcase indigenous country foods at restaurants in the cities seem to be picking a few traditional \n foods and making dishes more recognizable to the euro-Canadian palate—ie roasted moose tenderloin, with some kind of a wild rice/wild mushroom risotto/pilaf side dish, maybe some locally foraged greens, and a blueberry tart or something for dessert. They’re making even more of a fusion between colonist foods and indigenous country foods.",
   "created_utc": 1697036438,
   "score": 4,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fr4xz",
   "message": "Pretty sure Maple Syrup is American indigenous and famous worldwide.",
   "created_utc": 1697042110,
   "score": 235,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fd1un",
   "message": "I'm in Minnesota, so I'm curious. Does the rest of the world know about wild rice? If you haven't had wild rice soup on a cold fall day, you are missing out.",
   "created_utc": 1697036986,
   "score": 111,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fgrpp",
   "message": "Native American food IS American food. Dishes like succotash, clam bakes, corn on the cob, and baked beans are popular in New England while cornbread and grits are integral parts of Southern cuisine. It is the predominant cuisine in the Southwest, where there is overlap with Mexican cuisine (which is an indigenous cuisine itself), and it is available in every town and roadside stand there, particularly in New Mexico. But a lot of it has been lost (or has had to be reconstructed) particularly for the partially hunter-gatherer tribes of the Pacific Northwest and Plains. This is largely due to those somewhat nomadic groups being confined to reservations where they didn’t have to ability to eat the same foods.",
   "created_utc": 1697038365,
   "score": 192,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fkuu4",
   "message": "I’m actually waiting in line at a food truck rn for some corn soup and fry bread",
   "created_utc": 1697039846,
   "score": 54,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fjlyg",
   "message": "The indigenous people of the US “officially” number 574 nations. Even though some food and recipes were likely the same, there is no single indigenous source. \n\nYou do get restaurants that offer indigenous recipes, but most of them are likely different from what was eaten before the nations were put on reservations. After reservations they were given staples to keep them just barely alive, much of the food you see today came from those staples, and probably small additions of historical foods as well.",
   "created_utc": 1697039395,
   "score": 85,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4f7r0k",
   "message": "BBQ has indigenous roots! As does corn bread, hominy, and johnnycakes (yum). There’s a lot more food we eat all the time that has indigenous origins that isn’t always talked about that way.",
   "created_utc": 1697034987,
   "score": 149,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4ft7qd",
   "message": "Ever heard of a dish called chocolate?",
   "created_utc": 1697042857,
   "score": 35,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4figgi",
   "message": "You heard of corn?",
   "created_utc": 1697038978,
   "score": 45,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fsb2h",
   "message": "Because people are stupid and don't know where their stuff comes from... Corn, tomatoes, potatoes, chocolate, avocado,  peppers and chilies... All indigenous Americas.",
   "created_utc": 1697042529,
   "score": 18,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fuin4",
   "message": "This seems like an entirely inaccurate take",
   "created_utc": 1697043322,
   "score": 19,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fcy1k",
   "message": "Tamales are fairly popular I think",
   "created_utc": 1697036946,
   "score": 23,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fbxkq",
   "message": "Corn \u0026amp; potatoes?  Chili peppers?  All indigenous foods that have gone worldwide.",
   "created_utc": 1697036562,
   "score": 26,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4f2wio",
   "message": "I can’t name a single indigenous dish.",
   "created_utc": 1697033079,
   "score": 73,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fi3wf",
   "message": "Mexican food is in a lot of ways a descendant of \"Indigenous\" food, as are things like cornbread. Not to mention all of the ingredients that make up much of the dishes we eat today. \n\nIf you're wondering why Indigenous food *as it existed pre-Columbus* isn't popular, there's an easier answer. What we think of as good food today mostly requires a level of technology and wealth/logistics (to get the ingredients) that is extremely recent even in the wealthiest societies. Most of the dishes we think of as embodying different cuisines today are also fairly recent. Tomatoes in Italy is an obvious example, but even a dish like Carbonara was invented post-WW2. Barring extremely simple dishes like steak, almost every popular dish today was invented in its current form in the 19th century or later. \n\nThere's also the fact that North American Indigenous societies were simply relatively small. There were only around 3-7 million Indigenous people in all of North America before Columbus. If you look at societies that developed the most famous cuisines (e.g. France, Italy, China, India), they tended to have extremely wealthy classes to support private chefs. That level of wealth was less prevalent in North American Indigenous societies.",
   "created_utc": 1697038851,
   "score": 33,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4g25cb",
   "message": "There is actually a restaurant in Minneapolis called Owamni. Their stated mission is to highlight indigenous cuisine and ingredients.[their website is pretty cool and explains it well](https://owamni.com)",
   "created_utc": 1697046042,
   "score": 6,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4g2gif",
   "message": "Not indigenous, but I had the opportunity to eat at [Off the Rez](https://www.offthereztruck.com) in Seattle, and loved it. The only reason I can think of is that most Americans have the palette for it, they just haven’t had the chance to try it yet. Once they do, demand will follow, and with rising demand comes increased supply.",
   "created_utc": 1697046152,
   "score": 6,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4feiz4",
   "message": "Probably because of the genocide.",
   "created_utc": 1697037538,
   "score": 59,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fl9o5",
   "message": "Years ago we were passing through Denver and I was looking for a Native American restaurant to try while en route. Didn’t make it in time, but I think this was it \n\nhttps://www.tocabe.com/",
   "created_utc": 1697039994,
   "score": 11,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4gfmv6",
   "message": "Native New Mexican checking in. It’s complicated.",
   "created_utc": 1697050846,
   "score": 4,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4htwb6",
   "message": "Probably a lot do do with the large scale slaughter and long-term oppression of the indigenous population and the sense of ethnic superiority that fed into it.",
   "created_utc": 1697069944,
   "score": 5,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fh2h5",
   "message": "Something nobody else mentioned is just how massive the population decline for Indigenous North Americans was. Less than 3% of all Americans are Native, I don't know the numbers for Mexico and Canada. It's hard to become internationally famous restaurateurs when you're forced onto reservations and your culture is being destroyed.",
   "created_utc": 1697038476,
   "score": 13,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4g0pyc",
   "message": "Because the people were massacred and relocated and lost much of their cuisine.\n\nsame thing happened to the Irish, they only have glimpses of what their food used to be, and had to create a whole new set of foods.",
   "created_utc": 1697045527,
   "score": 11,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4frpws",
   "message": "We did a really good job (the British, French, Spanish, early US, Canada) of obliterating their culture from the pages of history. \n\nThere is a growing movement in Canada from First Nation’s Tribes, and it is awesome. \n\nAnother thing to realize is that their way of life is vastly different from the colonizers/today’s society. Things they hunted are now banned from hunting except for (in some cases) indigenous people. So you’re not likely to see too much crossover from them to a sit down establishment. \n\nBut, nothing is stopping you from being more aware and bringing awareness s",
   "created_utc": 1697042319,
   "score": 16,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4g7qq9",
   "message": "In this thread people learn what Genocide actually means and just how thorough the American genocide of its native peoples was. Few peoples have been erased as thoroughly as many American natives. Consider for a moment that there are whole tribes whose names we don't even know because their cultures were COMPLETELY eradicated. We only even know about the people that survived.\n\nEven the tribes that survive today often have had to completely reconstruct their own culture because it has been almost totally lost. There aren't a ton of native recipes because many of them were erased along with the people that knew them.",
   "created_utc": 1697048021,
   "score": 12,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4fpg0e",
   "message": "There’s plenty of Indigenous food that’s popular around the world, they’re just not widely known as ‘Indigenous’ food. Mexican food is rated highly worldwide, and so much of it is Indigenous (most Mexicans are descended from a mixture of Indigenous and European roots and many traditions celebrated today can be traced back before the European arrival). Tortillas, tamales, pozole are good examples. Tacos might be the best example. Chocolate began as a Mesoamerican dish. \n\nBut, of course, many Indigenous food traditions were also entirely wiped out. Loss of their normal sources of food, lack of access to your ancestral homeland where certain spices may be more common, many things were lost due to concentrated efforts to keep cultures from thriving.",
   "created_utc": 1697041497,
   "score": 8,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4frsq9",
   "message": "Well, we genocided them for one thing, then followed that up with some of the most unapologetic marginalizing of the survivors imaginable.",
   "created_utc": 1697042347,
   "score": 9,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4g08hf",
   "message": "Here’s the link to the only indigenous restaurant in America https://owamni.com/",
   "created_utc": 1697045355,
   "score": 7,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4gh8rz",
   "message": "There’s like 500 indigenous tribes in the United States so which one are you talking about?",
   "created_utc": 1697051422,
   "score": 5,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4f3y2i",
   "message": "I’ve wondered this myself and just don’t have a good explanation.",
   "created_utc": 1697033500,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4g1aq6",
   "message": "Are corn and chocolate not famous worldwide?",
   "created_utc": 1697045737,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4g7qwy",
   "message": "James D. Nicoll stated about the English Language: “The problem with defending the purity of the English language is that English is about as pure as a cribhouse whore. We don’t just borrow words; on occasion, English has pursued other languages down alleyways to beat them unconscious and rifle their pockets for new vocabulary.”\n\nAmerican Cuisine is the same way. It has pursued other cuisines down the alleyways to beat them unconscious - if not outright killing them - took what it wanted and then claimed it as its own.\n\nMany (all?) of the histories of US Cuisine acknowledge the fact that the Americans took indigenous cuisine and modified it to fit their tastes. That, coupled with the extermination of many indigenous cultures, both intentional and unintentional (endemic disease that was brought over from Europe and introduced without intent to harm - which probably cost more lives than the intentional exterminations that came later), mean that a lot of indigenous cuisine was lost.",
   "created_utc": 1697048023,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4gr05j",
   "message": "There’s some really popular indigenous restaurants in North America- not a ton but a couple. Owamni in Minneapolis is booked out for months. Depending on the type of food, it’s just not super adaptable to mass consumption. It’s local ingredients and meats that have been devastated by colonialism especially or are very local to the area. Wild rice is so tasty but wild rice beds can’t support exporting/becoming popular globally. \n\nTo me it’s more important that Native folks can have access to our traditional foods rather than it becoming popular. I don’t care if no one knows about it if we do. \n\nThat being said I really agree with what someone in this thread pointed out about Mexican food- a lot of Mexican food is derived heavily from indigenous people. Similarly in North America there are a lot of foods that originated with indigenous people but that history isn’t well known (maple syrup!).",
   "created_utc": 1697054906,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4h2qgi",
   "message": "What even IS indigenous American cousine? Mexican food is an absolute, indivisible mix. There are some things that are more \"\"purely indigenous\" but they are very rare.",
   "created_utc": 1697059119,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4h86qt",
   "message": "Because we did a cultural genocide on them.",
   "created_utc": 1697061161,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4hkk4f",
   "message": "Tomatoes and potatoes weren’t cultivated in the Old World, correct? There are theories that indigenous American crops such as beans, tomato, squash, potatoes, etc. we’re some of the reasons behind the population boom of the 18th century that directly led to industrialization.",
   "created_utc": 1697066125,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4hmdjc",
   "message": "Probably has something to do with the attempted cultural genocide.",
   "created_utc": 1697066867,
   "score": 3,
   "submission_id": "175erv8"
  },
  {
   "comment_id": "k4hngns",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "175erv8"
  }
 ]
}