{
 "submission_id": "175p38y",
 "title": "What is the craziest war tactic used in history?",
 "selftext": "",
 "created_utc": 1697058753,
 "permalink": "/r/AskReddit/comments/175p38y/what_is_the_craziest_war_tactic_used_in_history/",
 "score": 10,
 "url": "https://www.reddit.com/r/AskReddit/comments/175p38y/what_is_the_craziest_war_tactic_used_in_history/",
 "comments": [
  {
   "comment_id": "k4h82aj",
   "message": "The Persian Empire was noted as putting their largest men on their smallest ponies, and organizing them into parade units. Enemy cities saw them from far off and thought that they were giants riding normal sized horses, and would often either give up, or it would lower morale just enough in order to get the upper hand.",
   "created_utc": 1697061114,
   "score": 239,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hiehz",
   "message": "Invading Rome on elephant back has to be up there.",
   "created_utc": 1697065237,
   "score": 75,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i4yty",
   "message": "In the French Revolutionary Wars, a French Calvary unit successfully traversed the ice of the frozen Den Helder harbor and captured the Dutch fleet as it was stuck in the ice.  This was the first ever capture of naval units by a calvary detachment.",
   "created_utc": 1697074555,
   "score": 8,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hbw19",
   "message": "When the ANZACs pulled out of Gallipoli they converted some of their rifles to be self-firing, using string to pull the trigger and water dripping out of a can for the timer, and left them behind to make it seem like they were still occupying their abandoned trenches.\n\nSo for a few hours the Ottomans were defending against well armed beef tins.",
   "created_utc": 1697062596,
   "score": 169,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4h2xve",
   "message": "In wwi the britsh air dropped opium laced cigarettes on the enemy and then when they started smoking and fell asleep they attacked the trenches. This happened twice.",
   "created_utc": 1697059196,
   "score": 250,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hl5k2",
   "message": "Probably not the craziest,  but pretty creative.  Even the USS Texas was assigned to the D-day invasion they find the cannons didn't have the reach to keep supporting the troops,  so the captain ordered one of the torpedo blisters filled with water . This cause the ship to list ( lean to one side) which increased the arch of fire of its older guns",
   "created_utc": 1697066370,
   "score": 10,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hd92a",
   "message": "During World War II, Japan floated hot air balloons containing incendiary devices across the Pacific Ocean, hoping to start forest fires.\n\nNo fires were started, but one did explode and kill a few civilians. \n\nThe media was not allowed to report on it, which eventually led to Japan abandoning the tactic because they were hoping to hear results on the US news. \n\nhttps://en.m.wikipedia.org/wiki/Fu-Go_balloon_bomb",
   "created_utc": 1697063135,
   "score": 185,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hndf1",
   "message": "Tossing a dead body over the side of a submarine with top secret invasion plans in a briefcase cuffed to his wrist, to fuck the nazis when they fell for it.",
   "created_utc": 1697067277,
   "score": 15,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hmm8s",
   "message": "Not exactly a crazy tactic but Alexander the Great wanted to attack the island city of Tyre in modern day Lebanon - it was a half mile off the coast, key word WAS. They built a bridge of rock, to get close enough to for archers etc. Eventually turned it into a peninsula 2400 years later, it's still a peninsula.",
   "created_utc": 1697066966,
   "score": 79,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4heu8t",
   "message": "During WW2, US submarine commanders were generally only allowed 4 war patrols out of fear that they would either become too ambitious or too cautious after too many patrols. However, Cmdr Eugene “lucky” Fluckey of the USS Barb begged for and was granted a fifth war patrol. He then immediately asked that rocket launchers be fitted to the Barb. \n\nAlready famous for his tactic of maximum harassment, Fluckey became the first submarine commander to fire rockets at shore targets, but he didn’t stop there, noticing a supply train on one of the shores he watched. Unable to use his rockets on it Fluckey sent 8 of his sailors ashore to rig a bomb under the tracks. As the landing party returned to the Barb, the train set off the bomb and was launched 200ft into the air. This was the only time allied forces landed on the Japanese home islands during ww2 and the only known time a submarine has sank a train. \n\nFluckey was a wild man though. On his way back to port without any torpedos left, he was one sunk ship away from winning a bet so he rammed the Barb right into it. \n\nTl/dr: A wild man in command of a submarine blew up a train during ww2",
   "created_utc": 1697063778,
   "score": 167,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hlxp3",
   "message": "Biological warfare:\n  \n\nThe earliest documented incident of the intention to use biological weapons is recorded in Hittite texts of 1500–1200 BCE, in which victims of tularemia were driven into enemy lands, causing an epidemic.\n\nThe Assyrians poisoned enemy wells with the fungus ergot, though with unknown results. \n\nScythian archers dipped their arrows and Roman soldiers their swords into excrements and cadavers   victims were commonly infected by tetanus as result.\n\n\n In 1346, the bodies of Mongol warriors of the Golden Horde who had died of plague were thrown over the walls of the besieged Crimean city of Kaffa.",
   "created_utc": 1697066687,
   "score": 194,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4h5dkf",
   "message": "Releasing 100s of cats onto the battlefield to distract the Egyptian army",
   "created_utc": 1697060100,
   "score": 158,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hjzkm",
   "message": "Iraq vs Iran war. Saddam electrified a swamp full of Iranian troops. Then took all the bodies and built a road across the swamp and used it to attack.",
   "created_utc": 1697065889,
   "score": 236,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4he8wt",
   "message": "Canadians made Spam a war crime. \n\nIn WW1, allies would throw Spam to nearby German trenches. \n\nThey would share it, ask for more, and more Germans would gather. \n\nThen we threw grenades. \n\nTechnically, it’s the “is it food or a bomb?” tactic that’s now frowned upon.",
   "created_utc": 1697063534,
   "score": 92,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4h2rmh",
   "message": "I think it was ancient Cambodia who had the practice of dragging criminals to battle, and were instructed to cut off their own heads to demoralize the enemy, otherwise their families would be killed.\n\nEdit: it was Ancient China, not Cambodia. And after some digging around, it may have been a translation error.",
   "created_utc": 1697059132,
   "score": 125,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hq3qn",
   "message": "Marines of Fox company in Korea used their own dead as decoys for Chinese raids. Chinese would attempt to get close stab what they thought were sleeping Marines and lazy sentries just to get filled with lead. Also the one Chinese officer would speak fluent Chinese to make them think they came across friendlies.\n\nSeige of Malta 1565, the Militia took a dead turk replaced his head with a pigs head and tied the body to a post. When the Muslim turks saw the body desecrated with filth of a swine the rushed out in the open to recover the body which was in a kill zone for an ambush.",
   "created_utc": 1697068390,
   "score": 120,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hsb5k",
   "message": "#Olga and the Drevlians.\n\nTl;dr - A neighboring tribe killed her husband, she genocided them.\n\n I'll summarize as best I can, this should be a movie.\n\nOlga was married to Prince Igor I of Kiev. Igor was in the guardianship of Oleg who lead a tribal federation became known as Kievan Rus', a territory covering what are now parts of Russia, Ukraine, and Belarus. \n\nThe Drevlians were a neighboring tribe that participated in military campaigns with Kievan Rus' and paid tribute to Igor's predecessors. They stopped paying tribute upon Oleg's death and instead gave money to a local warlord. \n\nIn 945, Igor set out to the Drevlian capital to force the tribe to pay tribute. Confronted by Igor's larger army, the Drevlians backed down and paid him, but midway back Igor decided they didn't pay enough and took a small party back to get more money.\n\nThe Drevlians murdered Igor by a gruesome act of torture in which he was captured by them, tied to tree trunks, and torn in two.\n\nOlga ruled Kievan Rus' as regent on behalf of their son.\n\nThe Drevlians, emboldened by their success in ambushing and killing the king, sent a messenger to Olga proposing that she marry his murderer, Prince Mal.  Twenty Drevlians arrived in her court and told the queen why they were in Kiev: \"to report that they had slain her husband ... and that Olga should come and marry their Prince Mal.\"\n\nShe agreed and wanted to honor them infront of her people. She requested they return to their boat and in the morning she would send for people to pick up their boat and parade it through town.\n\nThe people lifted their boat brought them into the court where they were dropped into a trench that had been dug the day before under Olga's orders where the ambassadors were buried alive. It is written that Olga bent down to watch them as they were buried and \"inquired whether they found the honor to their taste\".\n\nOlga then sent a message to the Drevlians that they should send \"their distinguished men to her in Kiev, so that she might go to their Prince with due honor.\" The Drevlians, unaware of the fate of the first diplomatic party, gathered another party of men to send \"the best men who governed the land of Dereva.\" When they arrived, Olga commanded her people to draw them a bath and invited the men to appear before her after they had bathed. When the Drevlians entered the bathhouse, Olga had it set on fire from the doors, so that all the Drevlians within burned to death.\n\nOlga sent another message to the Drevlians, this time ordering them to \"prepare great quantities of mead in the city where you killed my husband, that I may weep over his grave and hold a funeral feast for him.\" When Olga and a small group of attendants arrived at Igor's tomb, she did indeed weep and hold a funeral feast. The Drevlians sat down to join them and began to drink heavily. When the Drevlians were drunk, she ordered her followers to kill them. According to the Primary Chronicle, five thousand Drevlians were killed on this night, but Olga returned to Kiev to prepare an army to finish off the survivors. \n\nOlga led her army to the Drevlian capital and laid seige for a year. Stuck in a stalemate, she offered the Drevlians to pay tribute and her army would leave.\n\n \"Give me three pigeons ... and three sparrows from each house\" was her request.\n\nOlga then instructed her army to attach a piece of sulphur bound with small pieces of cloth to each bird. At nightfall, Olga told her soldiers to set the pieces aflame and release the birds. They returned to their nests within the city, which subsequently set the city ablaze. \n\nAs the people fled the burning city, Olga ordered her soldiers to catch them, killing some of them and giving the others as slaves to her followers.",
   "created_utc": 1697069294,
   "score": 207,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hul4m",
   "message": "I can't believe no one has mentioned this yet, but Admiral Nelson at the Battle of Trafalgar. During the Napoleonic Wars, the British Navy was having a hell of a time getting into an engagement with the French Navy. Then one day, the French finally committed to a battle after sailing out of a Spanish port, WITH the Spanish navy at their sides. The total battle line was 27 British ships against 33 ships of the combined French and Spanish navies. The allied fleet formed a huge defensive line and invited Nelson to try to attack it. Come at me, bro. \n\nNow when talking about naval engagements, you'll often hear of the term \"crossing the T\". It was general tactical knowledge at the time that your best bet for winning a navel engagement was to cross the other party's \"T\", basically allowing your own ships to give a maximum broadside to the front ships of your enemy's line formation. Attacking as a line into the teeth of a bunch of broadsides was considered suicidal. But good ol' Nelson was convinced of the superiority of the British navy over every other navy in the world and he was honor bound to prove that shit.\n\nSo what did Nelson do? He yelled YOLO and, after dividing his command into two line formations, fucking charged his ships straight at the allied defense (thus crossing his own T), with his own ship, the HMS Victory, leading one of his two lines. His ship and the other lead British ship took terrible hits, but they reached and broke through the French and Spanish line.. But get this, when his two lines broke through, they kept right on sailing, which cut the French and Spanish navy into 3 parts, in-between his own two lines. Suddenly, the French and Spanish navies were having their own T's crossed, with British ships firing all guns and giving full broadsides in both directions as they sailed right on through to the other side. \n\nAs the smoke finally started to settle, 22 ships of the Spanish and French navies were destroyed. Not a single British ship was lost that day. Nelson (who died later that day from a bullet wound) and the British navy sailed into history that day as eternal badasses.",
   "created_utc": 1697070224,
   "score": 112,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i1fx2",
   "message": "In the war of 1812, the British/Canadians were trying to take Detroit but were severely outnumbered. They only had a couple hundred British soldiers, and a few hundred Militia and native warriors. They couldn't wait because another American force was on the way. So as they set up camp across the river, they dug trenches, and would march by in full view of the Americans, then duck into the trench and sneak back to march by again. At night they would light extra fires, and at dinner time they would do the same trench trick, the same guys repeatedly lining up to get pretend food. They also gave extra British uniforms to the Canadian militiamen so it looked like there were thousands of British soldiers. \n\nThe Americans had men but not the supplies or morale to endure a seige against an apparently superior British force. So they surrendered the fort without a fight.",
   "created_utc": 1697073064,
   "score": 46,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ikozz",
   "message": "Back in 1800, Thomas Cochrane (If you’ve ever heard of Master and Commander, Jack Aubrey is heavily based on this guy and his life), got his first command. A little sloop called the Speedy, with 14 guns (4 pounders) and a crew of about 80 men. He mostly did convoy duty but got a few ‘cruises’ where he was instructed to harass the enemy for a month at a time. Cochrane was really good at this and had sent off almost half his crew in prizes (captured ships) and pissed off the Spanish so much they sent a frigate after him called the El Gamo, with 32 guns (ranging from 8-32 pounders I believe) and about 320 men.\n\nSo one fine morning, the El Gamo catches up to the Speedy who Cochrane had disguised as a Danish vessel, evening finding someone who spoke danish to pretend to be the captain, and manage to get away.\n\nA little while later the El Gamo finds them again but doesn’t fall for the same trick. The 32 gun frigate with a broadside weight (total weight of cannon balls if the ship fired a salvo) of close on 200 pounds and 6x as many men was fighting the little sloop with a broadside weight so little, that Cochrane claimed he could walk with it in his pocket (28 pounds).\n\nCochrane knew he was done for, so closed with the El Gamo, pointed his guns up as high as he could, loaded them with 3 cannon balls each, and fired. This first salvo killed the captain of the El Gamo. \n\nThe El Gamo fired their entire broadside…and missed!\n\nThe Speedy was so small, the cannon balls of the El Gamo shot over the top and only damaged the sails. No matter how hard they tried, the El Gamo could not get their guns pointing down. So they tried boarding. Except The Speedy had pulled away. Each time the El Gamo tried to shoot at them, the Speedy came in close again, and then separated when they tried to board. \n\nThis went on until the Speedy couldn’t sail anymore. So Cochrane brought the two ships together and…boarded the El Gamo. 53 men stormed into the El Gamo (the doctor stayed behind), and managed to capture the quarterdeck and pull down the flag, causing the remaining crew of the El Gamo to think they had surrendered. \n\nFinal tally. \nSpeedy; 3 dead, 9 wounded\nEl Gamo: 14 dead, 41 wounded, and 300 captured\n\nThis was only one of his insane actions. And was possibly one of the best frigate captains of the age of sail.",
   "created_utc": 1697081582,
   "score": 20,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i2pok",
   "message": "What we think of as war is really about logistics and projecting power. Getting people and goods to where they need to be is the most important aspect of a war, everything else is just a series of inconsequential battles if you cannot project power and sustain momentum. \n\nTo that end, getting food to the troops is paramount, an army marches on its stomach. \n\nTo that end, one of the craziest tactics was done by Catherine the great of Russia against the ottomans. \n\nTo feed the army Catherine would issue bills of exchange to ottoman peasants to pay for grain, the assignat. This was a future promise to pay the bills. \n\nThe ottomans had a fixed price for grain, which was the price ceiling that nobody was allowed to sell above. This was paid in gold, which would have been to heavy to carry around and likely would have been stolen by Russian generals. \n\nWhen her army invaded, it was fed by paying above market rates of the ottomans own grain using these assignats, \n\nThis also deprived the ottoman troops of bread, and thousands of troops deserted or revolted. \n\nWhat backed these assignats if they were not backed by gold? \n\nThey were backed by the promise of conquered land, that the ottoman peasants were working for the sultan. \n\nCatherine bought ottoman bread by paying above market rates, backed by the land she intended to conquer. \n\nTo put it in context: You show up with a gun to rob a bank and bribe the security guard with the money you are intending to steal.",
   "created_utc": 1697073598,
   "score": 1,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i2wkc",
   "message": "Siege of Krujë, Albania (1450)\n\nOne night during the siege Skanderbeg sent out a herd of goats with a candle on each of the goats' horns. The encamped Turks believed it to be an Albanian attack and made a movement against the herd. When the Turks advanced far enough, Skanderbeg launched an attack against the force, destroying it. After the siege was lifted, Skanderbeg commemorated his victory by designing a helmet with the head of a goat on it, as a reference to his \"ingenious tactics\" used that night.\n\nThe entire story of Skanderbeg is astonishing. Every step.",
   "created_utc": 1697073678,
   "score": 114,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ibsva",
   "message": "In North Africa, the British put fake maps in a Jeep. It was driven driven by an English officer who had been giving secrets to his belly-dancing Egyptian lover, who passed them on to the Egyptian brotherhood, who in turn passed them on to the Nazis. The British found him out, and decided to kill two birds with one stone.\n\nThey put the maps in the glove compartment, and instructed him to drive a certain direction. A bomb planted in the Jeep by the British killed him, and drew the German’s attention. They found the maps, which indicated smooth driving at a certain narrow pass…which was actually sandy.\n\nThe German tanks got stuck, and were decimated by the British artillery hidden nearby.\n\nThe book “Bodyguard of Lies” is one of the most fascinating war books I’ve ever read. The British in WW2 were amazing at deception.",
   "created_utc": 1697077458,
   "score": 71,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i9o9d",
   "message": "The reason why Americans call The British *\"Limeys\"*.\n\nBetween the 16th and the 18th century a nasty disease called Scurvy plagued sailors, killing roughly 2 million during that time. A surgeon named James Lind, who worked for The Royal Navy figured out it was due to the sailors diet. A deadly vitamin C deficiency due to the kind of food being served aboard ships.\n\nIt became Royal Navy policy to squeeze citrus fruits like limes into their crew's grog to save them from Scurvy. As a result the British would often turn up with full manpower on every ship while other crews were still being devastated by Scurvy.\n\nThe British figured this out in the 18th century, but the Americans, didn't end up figuring it out until the **next century** and were wondering why the fuck the British kept trading for all their limes as nobody else ever bought them.\n\nThere's an article about here if anyone wants to know more: https://www.health.mil/News/Articles/2022/01/10/The-British-Limeys-Were-Right-A-Short-History-of-Scurvy",
   "created_utc": 1697076541,
   "score": 156,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hrxzi",
   "message": "US recruiting Navajo radiomen so that their radio signals would be hard to decode...They were insterumental in maintaining uninterrupted communications in Iwo Jima and Okinawa",
   "created_utc": 1697069148,
   "score": 47,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hy53y",
   "message": "Persian general was stuck besieging a city who’s walls were impenetrable. So, unbeknownst to him, one of his high commanders cuts off his own nose, and one of his ears. He then goes before the general, who is a bit disturbed, asking why his commander would do this. The commander says that it is part of his plan, and he knew that the general wouldn’t be on board with it if he asked first.\n\nThe commander then informs the general that he will go before the king of the enemy city, and claim that the general did this to him, and that he would like to betray said general for this mutilation. The commander then told the general to send his weakest men to a specific place so that the commander, leading the enemy forces could win a “major victory” solidifying his place with the enemy city. \n\nThe commander would then take over watch of one of the gates, and simply let in the general’s army. \n\nSave for a few hiccups, it worked and the city was destroyed. \n\nSource: The Histories by Herodotus.",
   "created_utc": 1697071686,
   "score": 139,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4h321c",
   "message": "Kamikaze pilots has to be up there",
   "created_utc": 1697059238,
   "score": 25,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i3gs3",
   "message": "I like the propaganda that the British were so accurate in their air attacks because  the pilots ate a lot of carrots which improved their vision. That caught on so well that people to this day still believe that eating carrots is good for your eyes.",
   "created_utc": 1697073914,
   "score": 108,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ig8m1",
   "message": "Julius Caesar plan at the battle of Alesia is so bizarre, can't believe the dude actually pulled off this strategy.\n\nDuring the final act of the war in Gaul, the Romans had the Gauls army and their chieftain Vercingétorix trapped in the town of Alesia. Instead of assaulting the city, Caesar decided to go ahead with a classic siege to starve the enemy. He then decided that a normal siege wasn't enough so he had his army build a 10 m high wall with watch towers AROUND THE ENTIRE CITY. Perfect plan right ? No one can get out, the city is fenced in lol\n\nUnfortunately words got out to a second Gaul army that Vercingétorix and his troops were in trouble in Alesia. This army was heading straight for Alesia and was threatening to break the Roman siege.\n\nSo Julius Caesar had another wild idea : Let's build a second wall around our Roman army and the first wall, so we can block the incoming Gaul army and keep the Alesia siege going woot woot!!\n\nRoman soldiers built that second high wall again in record time and the Gaul army that was suppose to save Alesia was instead welcomed by insane fortifications. They tried pushing through but the Roman defeated them thanks to Caesar super wall. \n\nVercingétorix and his soldiers also tried to break the wall, couldn't do it. He surrendered to the Romans and Gaul was finally conquered lol",
   "created_utc": 1697079442,
   "score": 5,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hu9s3",
   "message": "During the Normandy invasion the USS Texas intentionally flooded their compartments to lean onto one side. The lean gave their guns an elevated angle, increasing its range to shell German positions further inland.",
   "created_utc": 1697070097,
   "score": 92,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ik582",
   "message": "Imagine two drunk blokes in a row boat going out into the fog of the English channel looking for the periscopes of U-boats.  And if they find one, bash it with a huge hammer that would cause the periscope to twist, bashing the commander in the head with the periscope handle below.  Sounds like something Bugs Bunny came up with.",
   "created_utc": 1697081308,
   "score": 82,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hfart",
   "message": "I vaguely remember a siege where a Chinese city refused to surrender to Genghis Khan, so he asked for a tribute of thousands of pigeons, rats, and cats as a token of respect in exchange for his departure. The city rounded up the various animals and delivered them, and he had his men tie wicks to all the animals and set them aflame before releasing them.\n\nThe animals all fled back to their homes, setting the city on fire.",
   "created_utc": 1697063967,
   "score": 203,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ht3l2",
   "message": "William of Normandy sent his best cavalry into battle at the middle of the Saxon line. Then suddenly retreat in what seemed like disorganized panic. When they had retreated far enough the cavalry turned and troops concealed on the two hilltops converged on them. And thus went the Battle of Hastings.\n\nThe enveloping retreat is very documented and even used as recently as Iraq on IS. It works because the soldiers on the ground are so focused on the immediate proximity that they don’t think “hmm, they were laying down a pretty solid lick and now they’re retreating. This could be a trap”. Instead it’s just “CHARGE!!!!”",
   "created_utc": 1697069615,
   "score": 34,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ia78h",
   "message": "How the Australians cracked the hindenberg line in 1918. \n\nStep 1: at 5am, fire a shit ton of gas into german lines, Germans get into gas masks and get ready to be attacked. \nStep 2: Don't attack. Repeat every day for a month. Germans will get used to the routine. \nStep 3: after 3 weeks, at 5am fire a shit ton of smoke shells and send 30,000 screaming Anzacs through the haze at masked up and confused Germans. \nStep 4: be back for breakfast.",
   "created_utc": 1697076767,
   "score": 2,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4h2ch2",
   "message": "Inflatable tanks, trucks and fake paratroopers to make the Axis think D-Day was going to happen somewhere else.",
   "created_utc": 1697058976,
   "score": 123,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hg1ep",
   "message": "Bouncing bombs as in Dam Buster's the movie.\n\nBarnes Wallis came up with the idea and it's still brilliant to me now!",
   "created_utc": 1697064275,
   "score": 245,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hqqzk",
   "message": "In Mexico a native tribe once destroyed a Spanish attacking force by setting up huge trenches and filling them up with all the peppers they could get their hands on. They proceeded to ligh it on fire making a toxic smoke that was extremely painful to breath. Chemical warfare babyyyy!!",
   "created_utc": 1697068653,
   "score": 79,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hpkxt",
   "message": "Siege warfare.  Chucking dead horses over the castles walls.  For shock and awe effect and to poison the water supply.  Can you imagine dying from a falling rotting horse.?",
   "created_utc": 1697068179,
   "score": 126,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4h26hk",
   "message": "I don’t know if it was just a story but I heard about this Chinese lord who left the gates to his city open and unmanned before a superior army stormed them. They didn’t end up attacking because they thought it was a trap.",
   "created_utc": 1697058915,
   "score": 245,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ighpm",
   "message": "Not really a battle tactic, but American usage of shotguns during WW1. The guns used were 12-gauge shotguns that could be fitted with bayonets. Front-line American soldiers used the “slam-firing” technique, during which the trigger is held as the gun is pumped and fired from the hip, resulting in catastrophic injuries or death to anyone on the receiving end. The trench shotgun was so devastatingly effective that it spurred the German government to send an unusual request to Washington on Sept. 19, 1918, calling for the weapon’s removal from combat.",
   "created_utc": 1697079559,
   "score": 60,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hmhda",
   "message": "I don’t know if it’s crazy or brutal.\n\nBut Spanish conquistadors would unleash armored mastiff dogs on the indigenous people.\n\nThe indigenous people hadn’t encountered such large dogs nor had they seen them in war.\n\nThe dogs would be unleashed and would tear humans apart. The dogs were large, well trained, armored, and extremely energetic and enthusiastic when set loose on people.",
   "created_utc": 1697066910,
   "score": 30,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hsp6x",
   "message": "Russia strapped mines to dogs and taught them to run under tanks to take care of their nazi problem and dog overpopulation problem… only issue was they trained the dogs using Russian tanks",
   "created_utc": 1697069452,
   "score": 1,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4h33j8",
   "message": "In vietnam the Americans used haunted noises to scare the opps. Genius",
   "created_utc": 1697059253,
   "score": 242,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i39fw",
   "message": "Ancient Rome, while fighting Carthage, realized they suck at the whole navy thing. Their solution, put giant bridges on their ships so their infantry can board the enemy ship to turn it into a land battle at sea.",
   "created_utc": 1697073827,
   "score": 46,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ix07l",
   "message": "In the first Gulf War in 1991, the Iraqis piled up a large birm (\\~3-4 meters high) in front of their forward trenches. The intent was that they would shoot the vulnerable bottoms of the Coalition tanks when they drove over.\n\nSomebody in the Five-Sided Funhouse decided to mount bulldozer blades on the tanks. \n\nThey pushed the dirt into the trenches, burying the Iraqi soldiers before driving over their graves.",
   "created_utc": 1697088478,
   "score": 42,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4i8lmp",
   "message": "My history teach once told me Genghis Khan would mobilize his army and show up to the castle every single day and spend just six hours or so, just chilling. And he would do this for multiple months until the enemy just stopped caring. And one day the castle just stop closing its gates and he stormed the castle and took it over.",
   "created_utc": 1697076088,
   "score": 79,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hirku",
   "message": "The guy who founded my home town was known as Stovepipe Johnson. He was a Confederate Soldier (yeah, I know...) during the Civil War who captured an entire town that had been held by the Union Army by tricking them into thinking a length of stovepipe propped up on two wagon wheels was a canon.\n\n\"In July 1862, in his Newburgh Raid, Johnson captured the town of Newburgh, Indiana, bluffing its sizable Union militia force into surrendering with only twelve of his men and a stovepipe mounted and a burnt black log on the running gears of an abandoned wagon to form a Quaker cannon. His capture of the first Northern city to fall to the Confederates made the news even in Europe, and Johnson's men thereafter nicknamed him \"Stovepipe\".\"\n\nhttps://en.wikipedia.org/wiki/Stovepipe_Johnson",
   "created_utc": 1697065386,
   "score": 155,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4ho29c",
   "message": "The British announcing to the Muslim guerrelas that they were dipping their ammo in pig fat.  Fighting was over in 24 hours.",
   "created_utc": 1697067559,
   "score": 58,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4hrif5",
   "message": "I still think the Scots and their bagpipes.\n\nIf you don't know the backstory (and I'm not 100% I have it right, feel free to correct any inaccuracies) when Scotsmen went to war they'd play their bagpipes as a way of unnerving the other side. So you know they're coming...you can't see them but all you hear is the sound of bagpipes approaching.",
   "created_utc": 1697068969,
   "score": 58,
   "submission_id": "175p38y"
  },
  {
   "comment_id": "k4jto4a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "175p38y"
  }
 ]
}