{
 "submission_id": "1766bzg",
 "title": "What were you shocked to find out wasn't true?",
 "selftext": "",
 "created_utc": 1697115361,
 "permalink": "/r/AskReddit/comments/1766bzg/what_were_you_shocked_to_find_out_wasnt_true/",
 "score": 230,
 "url": "https://www.reddit.com/r/AskReddit/comments/1766bzg/what_were_you_shocked_to_find_out_wasnt_true/",
 "comments": [
  {
   "comment_id": "k4kxlnw",
   "message": "I literally believed, nay knew for a fact that a donkey is what happens when a horse and a cow have a baby together.   I don't know how i came to understand this natural fact.  For context i grew up on a farm around horses and cows.\n\nFlash forward to last year.  Im at a bar having a beer with my wife and our friends when i stated this obvious fact in casual conversation.\n\nEverybody at our table stopped everything and stared at me with a confused look.  My wife put her hand on my shoulder and said, \"oh my sweet summer child....\"  its been a year and the shame still haunts me.  Randomly my wife will just burst in to hysterical laughter and while wiping away tears ask me to explain where donkeys come from.   I can only hope in time my children will respect me once more.  I wont hold my breath.",
   "created_utc": 1697128116,
   "score": 9,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k8lms",
   "message": "When I was a kid, maybe three or four years old. I was in the car with my dad, and he spit gum out of the window onto the street. I told him that \"That's bad, that's littering!\" My dad told me specifically that gum wasn't littering because birds will use it in their nests. I had no reason not believe my dad, I was a very young child, and he was a literal *zookeeper* so somewhere in the back of my brain that became a truth. Just something that I inherently knew to be true. \n\nCut to fifteen years later, I'm driving with my girlfriend and I spit gum out of the car (the same car as it would happen) as I had done hundreds, maybe thosands of times since the first story. She looks at me, and tells me that I shouldn't do that, because it's littering. I laugh, and tell her that that's silly because birds will use gum in their nests. But I don't quite get the whole sentence out. As I said it, I knew it sounded ridiculous, but I had never re-exanmined that thought since that day. \n\nIt wasn't a truth I had built my life on, but it was such a weird feeling to realize that I had been Calvin's Dad'd without realizing it.",
   "created_utc": 1697118777,
   "score": 202,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4ksw3p",
   "message": "I thought that baby birds were abandoned by the mother if they smelled \"human\" on them but that's just an urban legend",
   "created_utc": 1697126417,
   "score": 144,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kuxuo",
   "message": "Food pyramid. It was talked about so much when I was a child. It wasn't until I graduated and started teaching that I realized my middle school kids had never heard of it. \n\n\nThen that spun into finding out that lobbying groups pushed it super hard so people would buy and eat more of their foods instead of others.\n\n\n\nI know standards change (I had to teach about electricity and waves when long-term subbing in the first year it was put into place), but I still think about this one often. I hated elementary school as a kid, and this is pretty much the only thing I remember from back then. But now it's all a lie and bad advice.",
   "created_utc": 1697127161,
   "score": 174,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k9dfz",
   "message": "People would disagree on exactly how long you had to wait to swim after eating. But no one disputed that you had to wait. 20 minutes, 30 minutes, an hour. But you gotta wait.\n\nNope.",
   "created_utc": 1697119087,
   "score": 217,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kzt03",
   "message": "My brother told me that if I dug deep enough I would reach china. He even threw some fortune cookies in the hole I dug to reinforce the belief.",
   "created_utc": 1697128912,
   "score": 176,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k5aiz",
   "message": "That fruit loops were all different flavors. 😥",
   "created_utc": 1697117403,
   "score": 19,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kld5o",
   "message": "Razer blades in halloween candy.  That was a real threat when I was a kid, so much so that the airport was using the xray machines to scan candy.  Turns out that never really happened, nobody actually tried to kill random kids on Halloween",
   "created_utc": 1697123686,
   "score": 244,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4knwuy",
   "message": "That you couldn't walk on clouds. I'd seen it in TV shows, cartoons, video games.\n\nI was really sad when I learned you'd just fall through.",
   "created_utc": 1697124622,
   "score": 237,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kmr70",
   "message": "That roadrunners are nothing like the size and shape of an ostrich, like in looney toons. I never even saw a picture of one until 7th grade zoology class. I admit I was a little disappointed.",
   "created_utc": 1697124196,
   "score": 104,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4l9z64",
   "message": "I was definitely shocked to learn that a Dingo definitely did eat that woman's baby, and that the claim that she murdered her baby and just used that as an excuse was not true. \n\n\u0026amp;#x200B;\n\nFor years I'd always used \"a Dingo ate my baby\" as an example of someone being totally crazy or making a nonsense claim until a couple years ago someone informed me that a dingo did, in fact, eat that woman's baby...",
   "created_utc": 1697132571,
   "score": 224,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lgh0y",
   "message": "The lady who sued McDonald's for hot coffee actually was seriously injured. Not a frivolous case.",
   "created_utc": 1697134877,
   "score": 48,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kar0q",
   "message": "As a kid my big brother told me that the FIAT car name meant Fix It Again Tony.",
   "created_utc": 1697119642,
   "score": 217,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4l1rsu",
   "message": "I'm beginning to think there might not be as many Nigerian princes needing to transfer astronomical sums of money to the US via my bank account as I was  previously led to believe. Fool me once, shame on me...",
   "created_utc": 1697129621,
   "score": 102,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kzyvk",
   "message": "That the plastic you put in the blue bin is not recycled.",
   "created_utc": 1697128970,
   "score": 142,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lfw8d",
   "message": "I have been 5'3 for the over 20 years since I was 14. I've measured myself occasionally over the years and doctors of course have too. A few weeks ago I randomly measured myself again. 5'5. I've tried 3 different tape measures and had my husband help too. 5 freaking five. Where and when and how have I acquired 2 inches in my late 30s?",
   "created_utc": 1697134672,
   "score": 86,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kimmr",
   "message": "The women's bathroom is cleaner than the men's room myth. The women's bathroom is a war zone.",
   "created_utc": 1697122666,
   "score": 215,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4l23d2",
   "message": "When I was 12 I was convinced that the jackalope was real. I found out the hard way when I asked about it up in 7th grade biology when we were discussing animal classification.",
   "created_utc": 1697129736,
   "score": 35,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4llq23",
   "message": "When I was growing up in the 90s, it was thought that  eggs were incredibly bad for you; specifically, that they jacked up your cholesterol. Turns out, they have little impact on cholesterol levels.",
   "created_utc": 1697136746,
   "score": 36,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k21xt",
   "message": "Politicians don’t work for the common people 😠",
   "created_utc": 1697116004,
   "score": 206,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k6679",
   "message": "When one homosexual loves another homosexual their penises don't somehow \"fit together\".",
   "created_utc": 1697117777,
   "score": 201,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4khgqa",
   "message": "Hard work pays off. It doesn't, the hardest jobs I've worked paid the least.",
   "created_utc": 1697122236,
   "score": 29,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kd6te",
   "message": "That dogs and hamsters didn't bred at one point to make cats.",
   "created_utc": 1697120602,
   "score": 89,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4l55lb",
   "message": "Santa doesn't exist apparently",
   "created_utc": 1697130846,
   "score": 64,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lepyi",
   "message": "My sister and I begged my parents for a pup tent when we were little.  Our dad, who liked to mess with us, told us that pup tents were for babies, and we wanted a doggie tent.  We, like fools, trusted that he knew a little something about this.\n\nSo, at the tender age of 24, I was telling a story about playing with our Barbies in the doggie tent while at my dad's house with one of his friends, and his friend said \"doggie tent???  Don't you mean a pup tent?\"  My dad couldn't speak for 5 minutes, he was laughing so hard.\n\nI don't know that I've been that humiliated since then.",
   "created_utc": 1697134250,
   "score": 27,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kb4fd",
   "message": "Parents not being smart or wise.",
   "created_utc": 1697119790,
   "score": 131,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k5q5r",
   "message": "The internet lied to me about Hot Single Women In My Area.",
   "created_utc": 1697117589,
   "score": 192,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4knp33",
   "message": "You CAN drive with the lights on inside the car.",
   "created_utc": 1697124543,
   "score": 66,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kuqvg",
   "message": "That black people can in fact get skin cancer from too much sunlight. Blew my fucking mind lmao.",
   "created_utc": 1697127091,
   "score": 67,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kglan",
   "message": "Not me but my coworker thought everyone universally loved Reagan because the 80s were such a happy time. She was shocked to learn that a lot of people think he was a real twat and that the 80s were not that happy of a time.",
   "created_utc": 1697121908,
   "score": 38,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4ki0vo",
   "message": "Popularity actually DOES matter a whole lot once you leave school.",
   "created_utc": 1697122443,
   "score": 116,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kqwy1",
   "message": "The story about the black hand assassin that killed Franz Ferdinand. How the initial assassination attempt failed and Princip (another conspirator) went to go get a sandwich at a local shop. While in there, he was stunned to find that the Duke's motorcade was driving right past the shop. He then ran out and killed the Duke and his wife. Setting of a chain of events that starts the first world war.\nWW1 was started because of a sandwich.\n\nBut that story isn't true. Princip was one of several conspirators lined up in various parts of the expected route. The first conspirator lost his nerve and did nothing, the second threw a bomb at the motorcade, blowing up the wrong car and injuring several people.\n\nThe Duke escaped, did his scheduled speech, and desired aftwards to go see the injured guards at the hospital. His driver, however, was never informed to take the new route and just continued the existing planned route. In doing so, he drove the Duke right past were Princip's was waiting at his assigned position. Princip then did what he was set there to do.\n\nPrincip's assigned spot was situated near a delicatessin and that is probably how the story evolved over the years to add the sandwich bit. Regardless, the point is that it wasn't a twist of fate that he wandered right into the Duke's path because he was hungry. Which is the Crux of the story.",
   "created_utc": 1697125713,
   "score": 47,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kv6vh",
   "message": "I grew up in New England and when I was a kid, more than one person told me that houses in our town with white chimneys with a black ring painted around the top were stops on the underground railroad, a fact I accepted without question.\n\n\u0026amp;#x200B;\n\nYears later I was thinking about that story, thinking about the fact that there were TONS of houses in our town with white chimneys with black rings, and it occurred to me that there was no way all of those houses were stops on the underground railroad. So I looked it up and sure enough, it's not true. (this isn't my hometown, but it's the same myth) [https://www.wgbh.org/news/local/2023-02-08/how-a-white-chimney-in-hanover-led-to-some-truths-about-the-underground-railroad-in-boston](https://www.wgbh.org/news/local/2023-02-08/how-a-white-chimney-in-hanover-led-to-some-truths-about-the-underground-railroad-in-boston)",
   "created_utc": 1697127251,
   "score": 25,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4loc5o",
   "message": "When I was a kid, everytime my dad farted he told me it was a trumpet Beetle.He had a whole story about them, that they lived in our wooden planks of our ceiling and stuff like that. \nOf course I knew about farting but I still believed trumpet beetles existed. I was 12 or 13 when I relized they didn't exist. Thanks dad for that embarissing moment in school in front of the whole class",
   "created_utc": 1697137682,
   "score": 22,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k2j0k",
   "message": "Porn stars really don't love each other.",
   "created_utc": 1697116215,
   "score": 35,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lm43s",
   "message": "My face would not, in fact, stay like that if I made that face for too long.",
   "created_utc": 1697136885,
   "score": 34,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lrdz7",
   "message": "A pony isn’t just a small horse…\n\nEdit: I mean baby* horse",
   "created_utc": 1697138778,
   "score": 18,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kszeo",
   "message": "There’s no chemical that turns colors if you pee in the pool",
   "created_utc": 1697126450,
   "score": 51,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k7by9",
   "message": "My parents aren't called Mum and Dad",
   "created_utc": 1697118259,
   "score": 13,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lbtqw",
   "message": ".\n\nSweet potato pie is 10 times better than pumpkin pie. (That really broke my heart)",
   "created_utc": 1697133222,
   "score": 15,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4m5uyx",
   "message": "Mikey died by eating pop rocks and drinking Pepsi",
   "created_utc": 1697143964,
   "score": 14,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lagsm",
   "message": "Many comedy writers don’t come up with their own ideas.",
   "created_utc": 1697132744,
   "score": 30,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lqz7m",
   "message": "Blood is blue inside your body until it is oxygenated. Always believed this as a kid, but now I realize how dumb it is.",
   "created_utc": 1697138632,
   "score": 28,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kfs4a",
   "message": "Adults know what the fuck they are doing",
   "created_utc": 1697121599,
   "score": 74,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4l79ch",
   "message": "History. It’s written by the winners.",
   "created_utc": 1697131596,
   "score": 42,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lmj4b",
   "message": "Mince pies don't contain actual mince meat",
   "created_utc": 1697137032,
   "score": 12,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k3n9m",
   "message": "That white dog poo isn’t from female dogs",
   "created_utc": 1697116704,
   "score": 23,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k6gw5",
   "message": "Santa Claus is not real 😔",
   "created_utc": 1697117901,
   "score": 29,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lfjak",
   "message": "That doctors knew everything and were always right. They were gods in the medical field.\n\nAs I got older it was pretty clear this wasn't the case and they often even disagree with one another.",
   "created_utc": 1697134542,
   "score": 33,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lj87a",
   "message": "I was so deep in the Mormon church it was quite life changing when I finally realized it was a crock.",
   "created_utc": 1697135859,
   "score": 32,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k1aqs",
   "message": "Benjamin Franklin wasn’t a president",
   "created_utc": 1697115656,
   "score": 41,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lnk1m",
   "message": "Wrestling is fake. At least I know where my trust issues come from...",
   "created_utc": 1697137402,
   "score": 11,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kxapn",
   "message": "MSG is bad",
   "created_utc": 1697128009,
   "score": 37,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4ku3yf",
   "message": "Skin suffocation from Goldfinger.",
   "created_utc": 1697126861,
   "score": 26,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4ka1ul",
   "message": "That power rangers aren't real\n\nI was 8 at that time. Gotta be one of the saddest moments of my life",
   "created_utc": 1697119360,
   "score": 16,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4l511d",
   "message": "It’s illegal to drive with your dome light on.",
   "created_utc": 1697130800,
   "score": 21,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4k5tie",
   "message": "santa. either he’s not real or i was apparently a really naughty kid. still haven’t figured it out, but all my friends got presents!",
   "created_utc": 1697117630,
   "score": 8,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4m7b5p",
   "message": "That turning the back light on in your car was in fact legal",
   "created_utc": 1697144492,
   "score": 8,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kz23m",
   "message": "Michael Jackson didn’t bleach his skin and that he actually had vitiligo, found out recently and now I feel kinda bad for MJ he didn’t deserve all that",
   "created_utc": 1697128644,
   "score": 48,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lo74p",
   "message": "That people aren’t inherently good people",
   "created_utc": 1697137632,
   "score": 7,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4l7rux",
   "message": "My husband’s faithfulness",
   "created_utc": 1697131780,
   "score": 25,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kkh16",
   "message": "Ted Nugent doesn’t sing Stranglehold.",
   "created_utc": 1697123354,
   "score": 6,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4kzjr9",
   "message": "When I was younger my brother told me a black cat in our town ate another cat. I told that to EVERYONE at school. Believed that for whole 4 years or more possibly! The cat never ate any cat and my brother lied to me 😭",
   "created_utc": 1697128821,
   "score": 6,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4lny9v",
   "message": "That the water will go down the toilet differently once you cross the equator.\n\nI first heard it in a 2nd or 3rd grade science class. The teacher suggested that if you were on a ship you could actually tell you crossed the equator. \n\nNo. It's a myth. Toilets are too small to exhibit the Coriolis effect. I even perpetuated this myth to others. Many years later I was GENUINELY SHOCKED my science teacher lied to me.",
   "created_utc": 1697137545,
   "score": 5,
   "submission_id": "1766bzg"
  },
  {
   "comment_id": "k4n8bwa",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1766bzg"
  }
 ]
}