{
 "submission_id": "176vkcn",
 "title": "What are some examples of body shaming towards men that go unnoticed?",
 "selftext": "",
 "created_utc": 1697192700,
 "permalink": "/r/AskReddit/comments/176vkcn/what_are_some_examples_of_body_shaming_towards/",
 "score": 28,
 "url": "https://www.reddit.com/r/AskReddit/comments/176vkcn/what_are_some_examples_of_body_shaming_towards/",
 "comments": [
  {
   "comment_id": "k4os44d",
   "message": "Unnoticed?\n\nAbility to grow body hair or having too much of it.",
   "created_utc": 1697193149,
   "score": 183,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oud34",
   "message": "we know our hair is thinning you dont have to keep mentioning it",
   "created_utc": 1697194649,
   "score": 141,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ov4ur",
   "message": "Little dick jokes are extremely prevalent.",
   "created_utc": 1697195140,
   "score": 66,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oweao",
   "message": "Making fun of men’s height, and if you are upset by it people will say you are insecure.",
   "created_utc": 1697195916,
   "score": 217,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4otxex",
   "message": "I'm a very skinny guy and have had tonnes of comments over the years about my weight, from suggesting I eat more, asking if I have a health condition, to straight up telling me they think it looks terrible. I feel as though skinny women are generally complimented on it whereas as a guy you get nonchalantly body shamed with comments that would be totally unacceptable to an overweight person",
   "created_utc": 1697194366,
   "score": 93,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4orr41",
   "message": "Height, size down there, muscles, dad bod, etc",
   "created_utc": 1697192892,
   "score": 16,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oytl4",
   "message": "Making fun of a man if he is uncircumcised.",
   "created_utc": 1697197315,
   "score": 157,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p1cls",
   "message": "1. Ever heard the phrases \"big dick energy\" or \"small dick energy\"? The latter is a very common example.\n2. I've been overweight since I was a late teen. Friends and family mention my weight completely offhand, and it's destroyed my self-confidence over the years. It's like people don't think you've noticed you're fat, and that they're doing you some favour by telling you.\n3. Height. I'm 6'1, and I've had a lot of women compliment my height even when it's obvious they like nothing else about me. Shorter guys get it BAD from women, to the point where they have to overcompensate in the personality department (hence the 'little man syndrome' thing). I genuinely feel bad for blokes that are 5'8 or below, they get mocked constantly. \n4.  Body hair. Doesn't matter if you can't grow a beard, or a full tache, or if you're thinning/ receding on top, you will get laughed at for it. Hell, I once got stick for having slightly hairy toes! (sorry to all that just grimaced at the thought).",
   "created_utc": 1697198665,
   "score": 78,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oveum",
   "message": "Small\nDick\nEnergy",
   "created_utc": 1697195311,
   "score": 141,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oscu6",
   "message": "Adding one to the mix, gynaecomastia.\n\nEither it's body shaming about a man having man boobs due to the large increase of breast tissue from hormone imbalances, puffy and enlarged nipples are mocked and picked on.\n\nOr sometimes I see it in body building spaces as accusations of steroid usage.\n\nI believe it affects between 60-70% of men, but it's a running gag against us.",
   "created_utc": 1697193319,
   "score": 249,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4owu1y",
   "message": "WAY to many people use small dick energy as an insult to anything they don’t like, and even though I’m a girl it always rubs me the wrong way when i see it. It just seems so unfair? So many people who are assholes happen to have big dicks and so many cool nice people happen to have small dicks so i just hate the phrase. It really reminds me of making fun of girls for having small boobs or flat asses, there’s just nothing they can do about it and it’s mean and unnecessary.",
   "created_utc": 1697196174,
   "score": 134,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ovwa8",
   "message": "Comments:\n\n* Skipping Leg day.\n\n\u0026amp;#x200B;\n\nYou are seen by other men and women as being less of a \"man\" if you have:\n\n* Bald head / hairline\n* Inability to grow facial hair (splotchy mustache/beard)\n* Sunken chest\n* Short (less than 5'8\")\n\n\u0026amp;#x200B;\n\nNon Physical:\n\n* Handshake\n* Handyman skills\n* Mechanical skills\n* Sport knowledge / fav team\n* College / Military experience\n* Vehicle you drive\n* Virginity / Sluttyness",
   "created_utc": 1697195609,
   "score": 47,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oxctp",
   "message": "Society as a whole has developed to be inclusive of women of all sizes but I think we all know you’d be hard pressed to find a man who wasn’t absolutely shredded or slim to be modelling for any big companies. The idea of the realistic male physique is very skewed",
   "created_utc": 1697196480,
   "score": 61,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oxx4x",
   "message": "The description difference for male/female in the press or clothing stores gets on my nerves\n\nWomen = plus size\n\nMen = fat/overweight/obese",
   "created_utc": 1697196808,
   "score": 94,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oua29",
   "message": "I don't think they go unnoticed, it's just not seen as a problem.",
   "created_utc": 1697194593,
   "score": 59,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4os26v",
   "message": "Height.\n\nLots of my friends don't date guys under 6ft. But I know from experience, there's nothing better than a short king x",
   "created_utc": 1697193111,
   "score": 124,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p1f53",
   "message": "Not necessarily “body shaming”, but the whole idea of “toxic masculinity” just sucks now.  I’m not overly emotional, don’t like touching people, and I internalize things.  I don’t do any of these things to be “manly” or whatever it is people dont like.  I just like to work things out myself and don’t like talking things through at all.  \n\nMeanwhile, I hug and kiss my teenaged sons and my wife, tell them I love them every single day.  They cried with me when my dad passed and didn’t make me talk about what I was feeling because they knew.  \n\nIf I’m having a bad day at work, I just like to sit by myself for 30 minutes to decompress.  Too many people think that’s a toxic attribute now and I just don’t get it,",
   "created_utc": 1697198701,
   "score": 46,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oy6qx",
   "message": "Both genders tbh, but sweating - I feel like women are self conscious about this too but I see more shaming towards men.\n\nYou can wear heaps of deodorant and shower like a germaphobe but your forehead still gets wet when its a bit too warm and your wet patches on your pits get called out as gross and disgusting. Antiperspirant doesn't always work and you get called out for sweating more as a guy is my point.",
   "created_utc": 1697196959,
   "score": 19,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oylg1",
   "message": "Height, length",
   "created_utc": 1697197188,
   "score": 8,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4orrc6",
   "message": "\"If you don't have unrealistic superhero abs and muscles, you're fat and a loser\"\n\nThere's also a lot towards skinny non-muscular men 🙄 yeah literally if you don't look like a celebrity who probably used photoshop, you're a joke.",
   "created_utc": 1697192896,
   "score": 95,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ox6gy",
   "message": "Everyone is mentioning the most obvious things,\n\n\"Did you know that men get shamed for dick size/baldness/height?\"\n\nI would say after that its things like unibrow or big ears, or hairy, general caveman attributes (which is still pretty common)",
   "created_utc": 1697196377,
   "score": 39,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4orncm",
   "message": "Imagine the meltdown if we used words like \"Mom Bod\" to describe women.",
   "created_utc": 1697192816,
   "score": 52,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oz7jf",
   "message": "Bald guys get made fun of. Bald women get called “brave”.",
   "created_utc": 1697197529,
   "score": 34,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ou739",
   "message": "people  can say what you like about men, but if you insult a women, its the worse thing. thats is what annoys me now",
   "created_utc": 1697194539,
   "score": 33,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p5c8b",
   "message": "Comments about the height. I had a bf who was smaller than me and people always commented on that. He was precious and I couldn't care less about his height. Idk why men aren't allowed to be small.",
   "created_utc": 1697200656,
   "score": 1,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4otta4",
   "message": "baldness",
   "created_utc": 1697194293,
   "score": 7,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4oulpg",
   "message": "Baldness",
   "created_utc": 1697194803,
   "score": 8,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4owwyy",
   "message": "As an American teeth. I know a few people who, if you're not rocking, bleached straight teeth, you will be talked badly. \n\nOr the opposite will happen too.",
   "created_utc": 1697196222,
   "score": 8,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p2hpx",
   "message": "I mean pretty much every form of body shaming towards men goes unnoticed.",
   "created_utc": 1697199253,
   "score": 7,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ozct9",
   "message": "Media is full of expectations of abs, dick size and toned muscle. Approximately 40% of dysmorphia patients are male gender.",
   "created_utc": 1697197610,
   "score": 10,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ozjy9",
   "message": "It's actually rife in the Western world. Some women target height, build and penis size. Ironically, the biggest female shamers tend to advertise themselves as feminists. Real feminists are egalitarians, not this nasty (but very vocal) minority.",
   "created_utc": 1697197719,
   "score": 8,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ot40h",
   "message": "Height.",
   "created_utc": 1697193829,
   "score": 9,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ov6cd",
   "message": "ITT: A bunch of people naming things that are DEFINITELY noticed (like height, dick size, muscles, etc)\n\nFor something unnoticed: hand shakes. This is more common among older guys (like Gen X and Boomers). When they go to shake your hand they make a point of trying to grip as strongly as they can without it looking like they're trying to hurt you. It's a subtle way to point out that they're physically stronger than you.\n\nI'm a tall guy, but I'm very scrawny and lanky. (I'm 37 and have been built this way my whole life.) Most people seeing me on first glance would assume I'm not very strong. They way I talk is also very intentional and technical, which tends to give the impression than I'm nerdy, or not very physical, or weak, etc, insert whatever stereotype you think fits. However, I also work construction. I'm not going to pretend like I'm some super ripped dude, because I'm not, but working in construction you can't help but build some muscles, especially in my hands and arms. And my hands are pretty calloused. So I see it ALL THE TIME when guys in their late 40s-60s who look like they put a lot of personal pride in their physical strength go to shake my hand. They lay on the grip as strong as they can, thinking they are trying to shame me about my size and strength, only to get surprised that I have a pretty strong grip and calloused hands, too.\n\nI benefit from the subversion of expectations, but it's disgusting and toxic that this sort of behavior happens in the first place.",
   "created_utc": 1697195165,
   "score": 5,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p31vh",
   "message": "Height biases seem to be completely acceptable",
   "created_utc": 1697199537,
   "score": 6,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4ovaxc",
   "message": "Height, genetics, shape, size, etc.",
   "created_utc": 1697195242,
   "score": 3,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p1ciw",
   "message": "Height shaming.",
   "created_utc": 1697198664,
   "score": 3,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p29wx",
   "message": "Lol everything.",
   "created_utc": 1697199141,
   "score": 3,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p2iir",
   "message": "Height . Always",
   "created_utc": 1697199265,
   "score": 3,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p3769",
   "message": "Smaller dick, small balls, small hands, small feet, small. Also bald",
   "created_utc": 1697199610,
   "score": 3,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p37oc",
   "message": "Height shaming for sure",
   "created_utc": 1697199618,
   "score": 3,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p37p5",
   "message": "Literally everything. I feel bad for men sometimes, I see the most insulting shit said about them online, usually lack of hair growth/balding, penis size, height and weight",
   "created_utc": 1697199618,
   "score": 3,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p7h3e",
   "message": "\"Small dick energy\"\n\n\"manlet\"\n\nEven \"incel\" fits pretty well\n\nAll seem to be common sayings for \"progressive\" women about men they don't like.",
   "created_utc": 1697201648,
   "score": 1,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p7vh0",
   "message": "It’s not that any of it goes “unnoticed.” It’s that no one cares and if you complain, you’re not a man. It’s a huge lose-lose",
   "created_utc": 1697201831,
   "score": 1,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4pakwd",
   "message": "Ever been to a dicks sporting goods? Every mannequin is built like Thor. It's ridiculous",
   "created_utc": 1697203033,
   "score": 1,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4pakyh",
   "message": "Height, hair, dick size, lack of muscle.",
   "created_utc": 1697203033,
   "score": 1,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4pb8ie",
   "message": "Women are “plus sized” in the media, men are fat.",
   "created_utc": 1697203316,
   "score": 1,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p3grz",
   "message": "This one doesn't apply to me because I dress like shit but I feel like fit, well dressed and put together men have their sexuality immediately questioned.",
   "created_utc": 1697199741,
   "score": 6,
   "submission_id": "176vkcn"
  },
  {
   "comment_id": "k4p7glz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "176vkcn"
  }
 ]
}