{
 "submission_id": "1780rhs",
 "title": "When did the class clown go too far?",
 "selftext": "",
 "created_utc": 1697322453,
 "permalink": "/r/AskReddit/comments/1780rhs/when_did_the_class_clown_go_too_far/",
 "score": 25,
 "url": "https://www.reddit.com/r/AskReddit/comments/1780rhs/when_did_the_class_clown_go_too_far/",
 "comments": [
  {
   "comment_id": "k4yh2du",
   "message": "Slightly off topic but our class clown choked on candy. We thought it was another one of his jokes. The whole class laughed at him, even the teacher. Then his face started to go red, eyes got bloodshot and he started slamming the table violently. Luckily somebody gave him the Heimlich maneuver and saved his life. Dude nearly died while everyone sat laughing at him😱",
   "created_utc": 1697362525,
   "score": 191,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yaui8",
   "message": "A classmate thought it would be funny to light somebody's mullet on fire in the middle of class.",
   "created_utc": 1697357552,
   "score": 207,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4y9f2v",
   "message": "When I was in high school we were on our way to the zoo for an excursion and a friend of mine who was the epitome of a class clown held a sign up to the glass back window of the bus that read \"bomb on bus\". One or more of the people driving behind the bus called it in and there was an absolute shitshow evacuating a busload of students onto one of Australia's busiest freeways. I should probably mention that this occurred a few months after the September 11 attacks when the world was still adjusting to new normal.",
   "created_utc": 1697356414,
   "score": 74,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ygnc8",
   "message": "Middle school in 2006, Kid I knew didn’t want to turn in his English essay on Monday so he wrote bomb threats a few of the bathroom stalls… we still had school Monday, he still failed the assignment, the EoD unit was at the school all day with bomb sniffing dogs, and one of the teachers eventually recognized his handwriting… Never saw him again.",
   "created_utc": 1697362186,
   "score": 153,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4wjya7",
   "message": "Dude announced a \"watch this\" to his friends at one lunchtime, and walked out of City Hall with a grin on his face and an (at that point, I'm guessing) empty suitcase. He was wearing a school colors jacket.\n\nShortly thereafter, the fire department rolled up and assisted with the evacuations. He'd smokebombed the hell out of the place.\n\nHis life after that was not a happy one, not because of that event but because he was fuckin' crazy.",
   "created_utc": 1697323316,
   "score": 40,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4xsqaw",
   "message": "Public school, small town. Graduating class only had 54 students in it. Kid smeared his shit all over the bathroom. Walls, floor, sinks, everywhere. The principal had no way of knowing who it was, so the solution......they took the bathroom doors off the hinges.",
   "created_utc": 1697344594,
   "score": 112,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4wpjze",
   "message": "He came back to the school during after hours, rubbed his balls all over the doorknobs. Put caulking in the locks, and spray painted pot leafs everywhere. \n\nOf course he didn’t know there were cameras so it didn’t take long for him to be caught. This was right before graduation too so needless to say, he didn’t walk at graduation and his parents had a hefty damage bill to pay.",
   "created_utc": 1697325703,
   "score": 32,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yeipa",
   "message": "He would flirt with the Spanish teacher, who I’ll admit was really attractive, and the flirting in class was always funny since he was genuinely funny. But one day he just did show up to class and the schools guidance counselor gave us an hour long lecture about how student and sexually harass teachers and it was heavily implied he groped her… \n\nVery disgusting.",
   "created_utc": 1697360481,
   "score": 161,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ya3b6",
   "message": "2 guys were messing with a short kid for being short. The next day, the short kid put a glock in one of their mouths. I think we were 13-14 at the time.",
   "created_utc": 1697356957,
   "score": 249,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ypdus",
   "message": "Stole the English teachers sub plans and rewrote them giving us all a free period.\n\nTerrance, wherever you are, you're a fucking legend.",
   "created_utc": 1697368945,
   "score": 15,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4x8jxl",
   "message": "He was secretly jerking off in class and before finishing he pulled down his pants and shot his cum on some random girl he was expelled and arrested",
   "created_utc": 1697334182,
   "score": 211,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4xz44b",
   "message": "He was showing girls his dick which a lot just laughed and walked away but one girl told the principal he got charged with sexual harassment and is now considered a sexual predator. Didn’t see him much after all that went down.",
   "created_utc": 1697348719,
   "score": 7,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yp47o",
   "message": "Someone in my school said our gym teacher was sexually harassing, turns out they were just unhappy with the grades. He lost in court and shot himself in a hospital a bit later",
   "created_utc": 1697368761,
   "score": 112,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yi1oq",
   "message": "I have a hard time picking between two:\n\n* Rub an eraser on a dirty desk for several minutes, disassemble a pen, snorted the eraser rubber as if it's drugs/tabaco/... He spent the next hours coughing and wheezing.\n* Some folks in our class used to throw wet paper that they chewed on against the ceiling quite often, it'd stick on there and looked disgusting. The clown wanted to one-up those folks and chewed a giant ball of paper and threw it at the blackboard. The teacher wrote around it and acted as if nothing happened and then shouted at him after class was over.\n\nNeedless to say, he didn't turn out particularly well after high school.",
   "created_utc": 1697363327,
   "score": 243,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yqbvv",
   "message": "Art class. \n\nTeacher leaves.\n\nClass clown says \"dare me to eat this paint!?!?!\" \n\nMy buddy and I ignore him. He gets real pushy about eating paint. We tell him to do whatever the hell he wants. He stands on a chair and eats 2 tubes of paint when the teacher walks back in. Gets marched to the nurse. We breathed a sigh of relief that he was gone.\n\nLater that day my buddy and I get called to the principal's office. Informed he is at the hospital getting his stomach pumped and it is OUR fault. \n\nI had never been in trouble before. Spent 1 hour in isolated detention to see if I \"wanted to share more.\" Literally just locked in a tiny ass room. Got a really long lecture about if I told someone to jump off a bridge and they did it, it would be my fault. I denied any fault again. Got put back in isolation until the end of the day.\n\nMy parents went nuclear when I got home and told them what happened. \n\nClown showed up the next day just grinning and laughing because he heard we got in trouble. Ayaya",
   "created_utc": 1697369592,
   "score": 3,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4xugz1",
   "message": "It was September 11, 2001 (9/11). The attacks on the World Trade Center had just happened. We were in our first class of the day, and the teacher prefaced talking about it all by asking \"Does anyone know where the World Trade Center is?\" The class clown quickly replied with \"On the ground now!\" A couple of his buddies chuckled a bit, but the rest of us were shocked. The teacher was so pissed off that she physically dragged him to the principal's office. He wound up getting detention. This happened in Ontario, Canada, not far from the New York border.",
   "created_utc": 1697345661,
   "score": 151,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yjd8e",
   "message": "He set his own chair on fire during an exam",
   "created_utc": 1697364396,
   "score": 189,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ydvmf",
   "message": "We were having an art project and this one guy in my middle school thought it would be funny to take one of those glue bottles to the bathroom, empty it out and fill it with his semen. \n\nThen came back and swapped bottles with one of the girls tables. He then went around telling everyone that he cummed on all the girl's hands.\n\nLater got found out and expelled. What a dumbass.",
   "created_utc": 1697359964,
   "score": 25,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4xj30i",
   "message": "There was an overhead projector in the back of the room. \n\nIt wasn’t plugged into the wall. Tuesdays and Thursdays we had classes that would be 90 minutes because they only met twice a week. \n\nOver the course of 90 minute class, he found this projector, fiddled with the plug, and then eventually cut the cord off the projector. He did this with a sort of metal piece from his desk. \n\nWell, one thing led to another and he ends up stripping out the insulation from the cord. \n\nThen I guess it sort of naturally progressed… he figured out that he had bare wire in one hand, and a plug on the other. \n\nSo he plugged it back into the wall and touched a desk. Big flash. Kids said holy shit!\n\nThen he touched a girl with it. She was fine, but it shocked her pretty good.",
   "created_utc": 1697339246,
   "score": 230,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yp5j7",
   "message": "Took his arse out to fart on someone. Bent over, did the fart, turned into a shart, turd rolled down his leg.",
   "created_utc": 1697368787,
   "score": 145,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ypjsk",
   "message": "In college, we had a guy in a philosophy class who was constantly talking trash to the teacher.\n\nAt one point he got on about tattoos and told the professor he should go get a tattoo.\n\nWithout missing a beat, the prof pulls up his sleeve and he's got a concentration camp number tattooed on his arm and looks the kid in the face and says \"yeah, I've got all the tattoos I need.\"\n\nThe kid went from \"badass\" to \"bad, ass\" in a picosecond.",
   "created_utc": 1697369060,
   "score": 192,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4wnxyk",
   "message": "He found a dead Lizard and tried to gift it to a teacher. The teacher fainted and hitted her head on her table. We had to call the school nurse.",
   "created_utc": 1697325036,
   "score": 113,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4wvmjm",
   "message": "Back in elementary school, we weren’t allowed to learn anything about sex until grade 4. The class clown got ahold of the book early and he would tell the class about it: naked people pics in it, the pp and the vajayjay, condoms etc etc. Unfortunately he got way too obsessed with it he started to go crazy, he would pretend to f*ck the chairs, he started touching girls inappropriately, and rubbing his crotch to feel the “pleasure”….ugh… One day he decided to flash his dick to a group of girls that reported him and got expelled. The end.",
   "created_utc": 1697328314,
   "score": 54,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ynlpz",
   "message": "Staples in the substitutes coffee... I went to school with some real monsters.",
   "created_utc": 1697367687,
   "score": 115,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4x0dta",
   "message": "One year after finishing high school when he was already in college he went to a feminist demonstration with around 300 people and used a moment of silence to shout 'go home and make dinner' to the atendees.",
   "created_utc": 1697330420,
   "score": 32,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4y2vxv",
   "message": "put some firecrackers into the toilet and blew it up (in high school)",
   "created_utc": 1697351423,
   "score": 189,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yq6u2",
   "message": "Kept making ‘Yo Mama’ jokes to my friend who’d just lost his Mom to cancer. My friend snapped \u0026amp; broke his nose.",
   "created_utc": 1697369497,
   "score": 35,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yis0s",
   "message": "I wouldn't categorize myself as the class clown, but there was a time when I took a 'joke' too far. A friend and I were asked to leave the class and ended up in another classroom. We were being quite noisy, prompting an angry teacher to come over telling us to stop making 'crazy sounds.' After class, we looked up her phone number, printed 100 pages with the message 'Do you know any crazy sounds? Call (teacher's phone number),' and scattered them around town. The following week definitely wasn't her best week, and, naturally, we were suspended",
   "created_utc": 1697363922,
   "score": 182,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4y3fa6",
   "message": "This was actually fairly tame, but hey, I went through high school in small small town in Wyoming so things never got crazy. But this guy keeps complaining, says his head hurts, finally the teacher asked him if he wanted to go to the nurse and he said “No Mrs. Moon, but do you have any midol?” Now Mrs. Moon replies “Yes, but that’s not going to help you with your headache.” And Brayden says “Sure it will, it’ll help Marina stop being such a bitch.” Some of us chuckled, Mrs. Moon’s face immediately got beet red and she screamed at Brayden before walking him to the office.",
   "created_utc": 1697351821,
   "score": 65,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4xz0su",
   "message": "I think it was freshman year. Some kid rode my bus that gave off a school shooter vibe. One day, I don't know why, but he proceeded to open the emergency window on the school bus and jump out. He was expelled for a while. Maybe 2 years? Was definitely someone we all avoided.",
   "created_utc": 1697348654,
   "score": 201,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yjt5n",
   "message": "Back in the 80s in public school history class black teacher. Old text books that still had the word negro in it. She told the students to read from the book in front of the class but where it said negro they were supposed to say African American. Nobody said African American.",
   "created_utc": 1697364752,
   "score": 149,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4y4mdr",
   "message": "He started jumping rope with the small intestine of a fetal pig during bio",
   "created_utc": 1697352716,
   "score": 190,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ypgs3",
   "message": "In highschool we had a gym teacher who was maybe a year out from retirement. Really chill guy who really wanted everyone to have fun and improve their health and fitness, was regarded as ‘the man’ and many graduates would return just to check in on him and say hey. He always remembered everyone and was just a good dude, took no nonsense but still knew how to have fun and make people feel welcome and included. \nWell he and his wife were getting up there in age and as that tends to go, she fell terribly ill. People rallied around him, raised funds, everything we could do.\nBut there was this one kid who always had to stir shit up and do his best to be disruptive- like it was his job. Really thought he was some sort of gangster tough guy. Anyway during roll-call attendance in the beginning of class he said something smart and understandably the teacher was not in the mood, there was a little back and fourth and the kid gets in his face and says something really disrespectful and terrible, something like ‘ i hope your wife’s c*** rots off before she dies’ or something. Needless to say everyone was ready to rush this idiot but before anyone could even shift a foot under themselves- teach pops him right in the face, just a quick jab- the muscle memory of an old boxer.\nIt was glorious, the kid fell on his ass so quickly and before the he could even react he was swarmed and pulled far away by the rest of the class.\nAt first the teacher was ‘suspended’ and there was talk of him being charged- but literally the entire class testified on his behalf and it was somehow swept under the rug, teach was able to retire early and the shit head was suspended. Pretty sure his parents knew how much of a pain he was and deserved the punch.",
   "created_utc": 1697369001,
   "score": 76,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yomnf",
   "message": "In 7th grade at a public school, our class was on the 2nd floor.  Class clown stood up in the middle of class, said \"I can't take it anymore\", ran to the back of the classroom, opened the window and jumped.  Teacher screamed, we all laughed.  There was an addition to the building and the roof was under the window where the class clown was standing with a big grin.  The teacher quit shortly after due to this and several other incidents in her class.",
   "created_utc": 1697368413,
   "score": 67,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yo1ah",
   "message": "Dude was caught drawing on desks with permanent marker. Teacher made him get some alcohol spray and paper towels to wipe it off. After getting off all the marker he started wiping the desk with the alcohol soaked paper towel and lighting it on fire. He'd wait til the fire disappeared and do it again. After about the 3rd or 4th time he didn't wait long enough and when he went to wipe the table again it lit the paper towel on fire. He ended up throwing the fireball onto the carpet in the middle of the classroom and the teacher had to grab a fire hose to put it out.",
   "created_utc": 1697367994,
   "score": 45,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ykaub",
   "message": "Had 2 clowns on my class, both bullied me by then. \n\nThe first one, got a non-planned son and after that ended being a solo father, heard he found another partner afterwards, happy for him tbh; The second one, which is the one that bullied me harder, ended having some kind of mental illness and now works as a public functionary on some civilian management place.\n\nSome years ago, they formed a whatsapp group and the first guy invited me, I said \"why not\" and when I entered after hearing how they were doing i felt both first happy then sad, because at the end they were not so bad dudes. Felt a bit sad for the second dude being ill, they tried to organize some meet-ups that didn't work.",
   "created_utc": 1697365146,
   "score": 108,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yptmm",
   "message": "Poke a pencil up a teachers butt when he was bent over to help a student at another table",
   "created_utc": 1697369247,
   "score": 22,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yq71c",
   "message": "High school in FL, 1980s. At the beginning of winter break, this guy broke into a second floor classroom and placed a duck, a kiddie pool with water, and like 4 loaves of bread. First day back the room was covered in duck shit. Duck was fine. Epic.",
   "created_utc": 1697369501,
   "score": 20,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yqa7i",
   "message": "In elementary we had a big angry gym teacher who took it waaaaay to seriously (he played foot ball at Texas A and M for ffs you will listen to him!) Anyhow he drove a brand new Cadillac and happened to park right in front of the second floor boys bathroom. My buddy who was kind of a clown decided to lobb the ridiculous large turd he had just shat out the window and onto the dudes new caddy. Apparently it baked into the paint over the over the next four hours or so and destroyed the paint job. There was an all out investigation but both of us were savvy enough to not tell anyone(until middle school) so no one was every caught. Did dude deserve it? I dunno. He's still a self important prick. 🤷🏼‍♂️",
   "created_utc": 1697369560,
   "score": 41,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ym7qv",
   "message": "Final day of middle school kid got dared to \"pants\" a random, keep to herself kind of girl. She was just standing there bottomless for what seemed like an eternity.",
   "created_utc": 1697366645,
   "score": 21,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ykzse",
   "message": "Everyone knew how easy it was to get a rise out of my Year 11 maths teacher - she was an elderly woman who could not control a class. I mostly just kept my head down to focus on doing the actual work, but one lesson, the rowdier kids started to try and throw things into her coffee mug - and actually got things like pins and an eraser in. At that point, I had a quiet word with the teacher to basically *not drink it*.\n\nI don’t make a habit of being a snitch, but I have to draw the line somewhere…",
   "created_utc": 1697365690,
   "score": 63,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yhj77",
   "message": "At biology class they gave us condoms to take home and try on. Well meant, but the potential for misschief was too great to withstand.\n\nWe turned one inside out and filled it with water, then tied it off. The thing was very floppy and *very* slippery indeed. We put it on the seat of mrs. latin teacher. She tried to throw it away. It escaped. She chased it. The class went absolutely bonkers. After a minute or two of futilely and hilariously trying to chase down the slippery bastard, she gave up, locked us in and stomped off to the rectors'. She came back with a very angry red face and just resumed class as if nothing happened.\n\nYeah I was/am an asshole. Was fun though!",
   "created_utc": 1697362905,
   "score": 95,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ysr19",
   "message": "We had a student teacher for like 6 months when I was in 6th grade and towards the end of her time with us she had to record herself teaching a lesson to the class then provide the video to her school (as a final exam or something). \n\nWe had this class clown who had to sit in back which happened to be near the camcorder. During the recording he apparently kept saying things like “shit, penis, fuck”, quiet enough for no one in class to hear but loud enough to be obvious on the recording. \n\nThe student teacher ended up having to redo the entire video and we had to sit through the exact same lesson a week later without the class clown present.",
   "created_utc": 1697371134,
   "score": 13,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yidx1",
   "message": "Back in grade 7/8 we had this one absolutely hilarious class clown. Menace to society, and an academic liability. Homeboy had a 1.2 GPA. Anyways, one of our teachers who, at the time to horny 7th/8th grade boys, was extremely “attractive” due to her large rack (we didn’t know any better). The teacher took him aside couple months before graduation, and ambitiously “attempted” to change his outlook of his future. The teacher sat next to him and said, “What do you want?, What do you want to do?, What do you want to see?” Simultaneously asking those questions in that manner. Without hesitation, he tells her “Bitch, I want to fu** you, I want to see your titties, and I want to see your ass.” All of us were dying of laughter, and she called security within seconds. I didn’t see much of him after that, probably serving detention. Still graduated tho, haha.",
   "created_utc": 1697363603,
   "score": 101,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ylew1",
   "message": "At my high school this one girl fucked with the nerd a little to much. Pretty sure it was grade 11, I can’t remember why (maybe birthday) but she brought in cupcakes for the class. For the nerd, she put ex-lax in his cupcake. Only his, no one else’s. Shortly after eating it he was on the shitter and had to leave school early to go home for the rest of the day. She did get caught, however I can’t remember how, but that was a bit wild for a prank lol.",
   "created_utc": 1697366022,
   "score": 19,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yoa87",
   "message": "I cannot imagine being the class clown in today's age.",
   "created_utc": 1697368169,
   "score": 21,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yotdw",
   "message": "The kid was flicking his lighter on an underclassman's hair (i THINK he assumed his lighter was empty and had no chance of actually hurting the kid) kid freaked out notified either his parents or the school staff and about a day later the lighter kid got expelled. Outside of this incident he was an ok guy not great with realizing when to stop though\n\nAnother kid with a rather extreme sense of humor decided to make an offhand remark sarcastically saying something along the lines of “just cause im weird and play a fuckton of call of duty doesnt mean im gonna shoot this shithole up” or something along those lines.\n\nLot of kids heard “ im gonna shoot this shtithole up!” And he was booted almost asap.",
   "created_utc": 1697368547,
   "score": 22,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yqb6q",
   "message": "In my school district, it was tradition for the exiting seniors to pull a prank. One year a few of the class clowns decided it would be funny to cover all the tile floors with cooking oil, cover the hand rails of stairs with Crisco, and put large puddles of oil at the top of each stair well. A girl already on crutches broke her jaw. We had to be evacuated to the bleaches outside. It was super not cool.",
   "created_utc": 1697369579,
   "score": 8,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yqrvn",
   "message": "Bought the girl with the monobrow a gift in a box. Was shaving cream and a razor.",
   "created_utc": 1697369880,
   "score": 10,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yruxx",
   "message": "When he decided to run for President.",
   "created_utc": 1697370584,
   "score": 8,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4ypuk4",
   "message": "TIL people don’t know the difference between “class clown” and “huge asshole”",
   "created_utc": 1697369265,
   "score": 33,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yejez",
   "message": "Either 6th or 7th grade, Jesse put a tack on Ms Parmeter's chair while she left the room for a sec. When she sat, she popped up and screamed. A student ratted him out. He was told she could've gotten him in serious trouble for assault, but wasn't going to, and sent him to the principal's office. No, I did not know he set it there until after everything happened or I would've tried to stop him.",
   "created_utc": 1697360497,
   "score": 34,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yolu1",
   "message": "For a \"senior prank\" pelted the nicest teacher in our school with dozens of powdered donuts. He rightfully got suspended.",
   "created_utc": 1697368396,
   "score": 9,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yvepp",
   "message": "Chemistry teacher, giving a brief lesson on alternative fuels: “What will we burn when we run out of fossil fuel sources?”\n\nThis guy, with no hesitation: “The Jews.”\n\nYou could’ve heard a pin drop.",
   "created_utc": 1697372713,
   "score": 7,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yilgt",
   "message": "Guy shit in the maths teachers draw and wiped his ass with his Nokia 3310.",
   "created_utc": 1697363772,
   "score": 20,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yrgvc",
   "message": "Uh reading all the posts here this is really tame but, basically we had this science teacher in high school who wouldn't teach, she would have us copy stuff down from BBC bitesize (UK school I should add) and this went on for a while so the clown said we aren't learning anything so fuck it... And brought in some playing cards, and him myself and 2 others just started playing cards in the lesson and the teacher went ballistic and sent us out of the classroom, which we then continued playing in the classroom we were sent to, and then again we played during detention later that day.",
   "created_utc": 1697370335,
   "score": 5,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yvwk3",
   "message": "The class clown thought it would be funny to get into my sons car at practice. My son was at practice and got his soccer bag out of our suv, he jogged away hitting the button to close the hatch. Class clown grabs the hatch  right before it closes engaging a safety feature he doesn’t know about that raises the door back to open and locks it. He crawls in the back of the car to steal a stuffed animal my son keeps on the dashboard and gets out. He starts to pull the door closed but you need the key fob to engage the safety lock. So he grabs the hatch with both hands and his full weight breaking the opening mechanism and slams broken hatch so hard the window also shatters. He then runs to practice. I get a call from my son about the broken window and drive over to the school. The resource officer greets me with my son, this prankster and video footage of the entire encounter. I ask said prankster kid to call his adult and he calls me a bitch while laughing in my face denying the entire thing so I call the police and file a report. He gets suspended from school, his mom cussed me out, then called me begging to go through my insurance, then called me to meet her to fight, then blasted me on our small towns Facebook page (where it didn’t go the way she wanted) then called me begging again. I won’t go through my insurance because I’m mean and they owe me 3700 dollars to fix window and damaged door. Went to small claims court and was awarded the money, she pushed me in the parking lot so now I have a restraining order against her, and when her son was out of ISS he made a gun sign at my younger sons (little brother) head in the cafeteria while pushing my sons lunch on the floor (also on camera) so he got sent to alternative school for the rest of this year. It was all just a prank so I’m being super extra and should just laugh and eat the money guys.",
   "created_utc": 1697372998,
   "score": 5,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yny92",
   "message": "He raped somebody as a \"joke\".",
   "created_utc": 1697367936,
   "score": 9,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4wicw4",
   "message": "When he broke a school laptop",
   "created_utc": 1697322630,
   "score": 21,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4wm0o2",
   "message": "He went to the bathroom and put shit, his own shit on his hand then picked the quiet kid in the class and gave her a small tap on the cheek.\n\nI broke his nose for that then I went straight home and scrubbed my face till it started to bleed.",
   "created_utc": 1697324201,
   "score": 104,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yux07",
   "message": "In 7th grade the class clown challenged our English teacher to sparring/wrestling match. The taunting went on for weeks until the teacher finally agreed. Last 10 minutes was spent with the class clown having his ass handed to him. No one was injured, and it was very entertaining.\n\nI learned years later the English teacher was active in the Reserves which explained his ability to quickly neutralize the class clown without taking it too far.",
   "created_utc": 1697372433,
   "score": 4,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4wifvs",
   "message": "It was a Thursday morning around 10:30",
   "created_utc": 1697322666,
   "score": 30,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yt0xk",
   "message": "The class clown at my middle school saw a kid having a seizure on the ground during recess and started kicking him and throwing dirt on him. We had a whole assembly about it where he had to get on stage and apologize to the whole school.",
   "created_utc": 1697371303,
   "score": 3,
   "submission_id": "1780rhs"
  },
  {
   "comment_id": "k4yxy78",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1780rhs"
  }
 ]
}