{
 "submission_id": "178bkz2",
 "title": "What is the biggest 'elephant in the room' that society needs to address?",
 "selftext": "",
 "created_utc": 1697361450,
 "permalink": "/r/AskReddit/comments/178bkz2/what_is_the_biggest_elephant_in_the_room_that/",
 "score": 75,
 "url": "https://www.reddit.com/r/AskReddit/comments/178bkz2/what_is_the_biggest_elephant_in_the_room_that/",
 "comments": [
  {
   "comment_id": "k4yr817",
   "message": "We've built a society that's completely lacking in community and it's making us miserable.",
   "created_utc": 1697370175,
   "score": 38,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4ym7tj",
   "message": "We need to get money out of politics.",
   "created_utc": 1697366647,
   "score": 147,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yuljq",
   "message": "Bacteria's growing resistance to antibiotics",
   "created_utc": 1697372247,
   "score": 157,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yp37x",
   "message": "Some politicians are too old to still be active in politics.\n\nIt doesn't matter what is the alternative, if somebody is lost on the stage, has a shutdown while he/she speaks, has a mental breakdown, suffers a stroke, gets terminal cancer or any other terminal disease, speaks incoherently, he/she needs outside help to walk or talk, ..., he/she is too old and should be removed immediately for the sake of decency and letting them spend their last time in peace and outside of public eye.",
   "created_utc": 1697368741,
   "score": 129,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zb9dz",
   "message": "Misinformation being used to weaponize beliefs.  It’s ok to have different opinions on the facts but we shouldn’t have to disagree on what the facts actually are.",
   "created_utc": 1697380444,
   "score": 251,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4ynnvb",
   "message": "The internet has ruined our ability to meaningfully communicate since it has devolved into a data farm for a handful of powerful cooperations that benefit from driving engagement by pitting people against each other.",
   "created_utc": 1697367732,
   "score": 208,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yq5ha",
   "message": "We are continuing to treat the world like it's a rubbish dump and keep expecting that life will go on as it always has.",
   "created_utc": 1697369471,
   "score": 106,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yvkr2",
   "message": "Lack of education. The percentage of adults who are absolute idiots is astounding.",
   "created_utc": 1697372811,
   "score": 65,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z5lva",
   "message": "Plastics. Recycling is an absolute joke. We were all deceived.",
   "created_utc": 1697377954,
   "score": 55,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yg69i",
   "message": "Corporations and billionaires have way too much power",
   "created_utc": 1697361802,
   "score": 111,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4ylcef",
   "message": "Putting “making a profit” as our main priority in society, no matter the sector, be it healthcare, housing, education, renewable energy, etc.",
   "created_utc": 1697365967,
   "score": 22,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zjrql",
   "message": "Our politicians **no longer represent us, they rule over us.** They do what they want and get rich doing it and nothing we say will change that because they are the ones that would have to make that change and give up their power and wealth.",
   "created_utc": 1697383918,
   "score": 62,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zbznf",
   "message": "Anti-intellectualism. We've gotten to a point where we think it's cool, edgy, or acceptable to purport the dumbest of people and ideology. And when challenged they say you're suppressing them. Despite the totality of evidence that grass is green they'll tell you it's blue.",
   "created_utc": 1697380748,
   "score": 91,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z1kbm",
   "message": "Don't know if it's the biggest, but one of them is certainly the death of nuanced and fair debate/discourse",
   "created_utc": 1697376002,
   "score": 69,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zex5b",
   "message": "Lack of affordable housing.",
   "created_utc": 1697381970,
   "score": 237,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yrlm4",
   "message": "The breakdown of basic civility and tolerance of nuance in public discourse.",
   "created_utc": 1697370418,
   "score": 106,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yykt0",
   "message": "Garbage food. The overwhelming majority of people eat poorly because that's what the giant corporations want them to do.\n\nAndrew Zimmern did a show where he talked about food in our society. One of them showed how a small town got a new  Dollar General Store, which forced the \"mom and pop\" grocery store out of business. He walked through the DG and noted, \"This is all the worst possible food.\" Nothing but chips. sodas, processed foods, candy, etc.",
   "created_utc": 1697374471,
   "score": 188,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4ym451",
   "message": "Child abuse in all forms is largely ignored and much more common than people realise. Many with PTSD and warped views on relationships that never really accept or realise they were abused.",
   "created_utc": 1697366567,
   "score": 100,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yn8xg",
   "message": "An economic system that calls for continuous growth is unsustainable when population is on the decline.",
   "created_utc": 1697367421,
   "score": 78,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yjsul",
   "message": "All too often rapists and human traffickers get sentences that are too light for ruining countless peoples lives. Shows like Law \u0026amp; Order SVU make it seem like the law treats them as especially heinous crimes (heck the opening narration even says so) but the reality is while most people agree they are some of the worst crimes and are almost as bad as murder, the law hasn't really caught up with the general consensus.\n\nAnd rape kits end up being backlogged cause the taxpayers money that goes to law enforcement does not go to testing them in most states. In most states a private citizen, such as a rape survivor and the victim's family if they died have to pay for it. Insane. And seeing all the bad players in politics the past eight years and the crazy people who vote for them, it's become clear this is by design.",
   "created_utc": 1697364745,
   "score": 20,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yul3v",
   "message": "Too much money being a politician",
   "created_utc": 1697372239,
   "score": 86,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z5egk",
   "message": "people shouldn’t have to work 50+ hour weeks to survive",
   "created_utc": 1697377860,
   "score": 30,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yposf",
   "message": "The sheer amount of people who are so strung out on the hardest of drugs, expediting the rate of deterioration mentally by adding in the stresses of living on the streets. I lost a number of childhood friends to this stuff, and the others are becoming more and more unrecognizable by the day.  \n\n\nIt's not an easy solution, but it feels like nothing is being done, and if something is being done it's completely partisan, either all compassion and no consequences/accountability or vice versa.   \n\n\nSimple possession surely doesn't warrant incarceration, but street folk are armed more and more from what I've seen lately. Big blades, baseball bats and more are pretty commonplace to see around high traffic areas. An old friend who got caught up in that life keeps getting let out of jail after being booked on felony charges of violence. It's happened 3 times this year.  \n\n\nSomething NEEDS to be done though, this is not sustainable and the people profiting off all this deserve nothing but the worst honestly. Not the people forced into trafficking, but the people choosing to distribute.",
   "created_utc": 1697369156,
   "score": 133,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yyog4",
   "message": "The room is crammed so full of elephants (climate change, wealth disparity, lack of education, religion in government, misinformation spread across social media, lobbying, gerrymandering, homelessness, corporate corruption) that I don't even know where to start. It is just a massive tangle of huge fat elephants. Climate change is probably the biggest, since the rest won't matter for much fucking longer if that's not dealt with, but that won't happen unless at least a few of the smaller elephants are addressed first.\n\nAnd I don't mean addressed, I mean *taking meaningful, lasting measures* to solve the problem. Which just won't happen. It's tempting to be cynical or even nihilistic, but I try to do what I can locally. That's where it starts.",
   "created_utc": 1697374524,
   "score": 143,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zoiv2",
   "message": "A very small number of people are just truly, irredeemably bad people. This doesn't mean we should be violent towards them or kill them, but nor should we ignore the impact their behaviour has while continuing to give them positions of authority. Dealing with people who have no internal failsafe against cruelty, dishonesty and exploitative behaviour  is an issue we can't afford to keep ignoring.",
   "created_utc": 1697385726,
   "score": 25,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k50c1m0",
   "message": "Everyone wants to be a millionaire so they can live their life on their own terms. We shouldn't have to be millionaires to do this",
   "created_utc": 1697394519,
   "score": 39,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yorfa",
   "message": "Corporations exploiting slave labor overseas to manufacture their products",
   "created_utc": 1697368507,
   "score": 96,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k50onnj",
   "message": "Not everyone should have children.",
   "created_utc": 1697399118,
   "score": 64,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zelo1",
   "message": "Nuclear power is very effective at reducing carbon dioxide emissions, environmentalists who don't accept this fact are just as bad if not worse than the evil greedy capitalists who want to keep the status quo.",
   "created_utc": 1697381839,
   "score": 123,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k5053v5",
   "message": "effect of social media addiction on kids/teens",
   "created_utc": 1697391985,
   "score": 31,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4ykm92",
   "message": "AI and automation are going to put a LOT of people out of jobs (truck drivers, customer support, actors, writers, digital artists, etc etc etc). We're rapidly approaching a breaking point where we will have more people than jobs because machines are simply better (more reliable, constantly available, cheaper to scale, etc) than humans at a lot of tasks.\n\nPeople who get put out of a job aren't just going to starve in the streets peacefully. We are going to need either a completely new set of jobs for them (specifically ones that require humans to perform) or we're going to have to embrace societal safety nets like universal basic income and universal health care to ensure people have an acceptable minimum quality of life even without a job.\n\nI get that there is a visceral reaction people have to this (\"I had to do this without government handouts so YOU SHOULD TOO\"), but that's an overly simplistic, reactionary mindset. And while that may have been a perfectly reasonable stance back when you could work at the grocery store and afford a home, that's clearly no longer the case and is only getting worse.",
   "created_utc": 1697365389,
   "score": 226,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yqd5q",
   "message": "In the US - the lack of facilities for the mentally ill.\n\nOur solution is to let them turn to drugs, wander the streets, shit on public streets, until they eventually go to jail or are killed by police.",
   "created_utc": 1697369615,
   "score": 46,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z7qbn",
   "message": "The way social media is dividing us.",
   "created_utc": 1697378916,
   "score": 85,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z7syj",
   "message": "Shitty education system that produces a generation of weak minded people.",
   "created_utc": 1697378949,
   "score": 82,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zvxr0",
   "message": "Tribalism. Too many people think in an \"us vs. them\" mentality and it is literally the cause of all of our problems.",
   "created_utc": 1697388559,
   "score": 13,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z9yra",
   "message": "If you don’t tax the rich, everything will go down to shits",
   "created_utc": 1697379890,
   "score": 58,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zjszt",
   "message": "Stop concerning yourselves with red vs blue and right vs left and start thinking about the ruling elite vs citizens.",
   "created_utc": 1697383932,
   "score": 97,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zrllw",
   "message": "in the USA - Having your health insurance tied to a job.  The moment you lose the job you can triple the cost of health insurance or do without and pray you don't have an accident.\n\nShould nationalize healthcare.  Force the drug companies to negotiate the lowest drug rates anywhere.",
   "created_utc": 1697386905,
   "score": 41,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yfyt2",
   "message": "It's challenging to teach children with learning difficulties, and we need a specialized approach for them to help them succeed in life.",
   "created_utc": 1697361638,
   "score": 68,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z2tld",
   "message": "That we need to bring back some type of mental health asylum system. There are certain mental health issues that are almost impossible to treat consistently, mainly due to the illness convincing the patient to quit taking their meds. These unfortunate individuals pose WAY more of a threat to themselves than others, whether they be engaging in extremely risky behavior, self neglect, etc…\n\nI know that there are extremely expensive private hospitals for this (along with the systems for the criminally insane), but getting the average person the help and oversite they require is almost impossible",
   "created_utc": 1697376626,
   "score": 48,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yu8mo",
   "message": "The population getting older.\n\nEventually the pendulum of the elderly and those supporting them will swing too far in the wrong direction.",
   "created_utc": 1697372033,
   "score": 88,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4z3kpp",
   "message": "You cannot make up your own truth. Facts are facts.",
   "created_utc": 1697376992,
   "score": 24,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k50bek9",
   "message": "Our politicians DO NOT work for us... no matter the party they represent.",
   "created_utc": 1697394288,
   "score": 22,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yirmt",
   "message": "corrupt expensive healthcare system and lack of high speed rail",
   "created_utc": 1697363914,
   "score": 165,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yjo9q",
   "message": "tipping. like why am i tipping just so YOUR employees can make ends meet. isn’t that your job? i mean of course i’m going to tip because i’m not a monster but like shape up god",
   "created_utc": 1697364643,
   "score": 222,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zbrl9",
   "message": "Project 2025",
   "created_utc": 1697380654,
   "score": 56,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zkgr8",
   "message": "Creativity is at an all-time low and dropping because it's not necessary, not valued, and (in many cases) not welcome.",
   "created_utc": 1697384181,
   "score": 51,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zejf8",
   "message": "Nobody’s getting paid enough\n\n\nCost of living and basic needs is too high",
   "created_utc": 1697381814,
   "score": 42,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4znyga",
   "message": "Social media is destroying our country",
   "created_utc": 1697385512,
   "score": 11,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yght9",
   "message": "Homeless people and prisoners being dehumanized so it's easier to ignore just how bad they have it. Even kids are taught to just ignore homeless people and to fear criminals and prisoners without ever going into further discussion when they're older. Just homeless people are to be ignored and can't always be trusted with money, criminals did bad things and thus are less than human",
   "created_utc": 1697362062,
   "score": 249,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4yne8d",
   "message": "Global Warming.\n\nThe rising seawater will flood coastal cities. The heat waves will cause droughts that reduce sources of freshwater. The harsher climate will reduce the living space and amount of arable land to the point that even at 100% efficiency it won't be able to sustain the global population. A lot of us is about to die a slow death due to famine, running out of livable space. Even more of us will die due to conflicts brought about by the slowly dwindling resources. Not tomorrow, not in a year or 10 years, but soon.\n\nIt's a huge problem that could've been solved if only governments were harsher and took more decisive action. Instead corporations and profits won out. The oil barons were able to bribe away the government and sell the future off since they won't be alive to experience the consequences. We saw it coming, but we didn't do enough to stop it.\n\nWe're now at the damage control phase because we failed the prevention phase.",
   "created_utc": 1697367532,
   "score": 112,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zcr12",
   "message": "Income disparity. How \u0026amp; why we’ve ended up here.",
   "created_utc": 1697381069,
   "score": 37,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k4zgpmn",
   "message": "People need to stop fighting on red vs blue and fight 99% vs 1%.",
   "created_utc": 1697382706,
   "score": 34,
   "submission_id": "178bkz2"
  },
  {
   "comment_id": "k536iyw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "178bkz2"
  }
 ]
}