{
 "submission_id": "178jgh6",
 "title": "What is the most common and easily avoidable mistake guys make with women?",
 "selftext": "",
 "created_utc": 1697388333,
 "permalink": "/r/AskReddit/comments/178jgh6/what_is_the_most_common_and_easily_avoidable/",
 "score": 210,
 "url": "https://www.reddit.com/r/AskReddit/comments/178jgh6/what_is_the_most_common_and_easily_avoidable/",
 "comments": [
  {
   "comment_id": "k50bvqa",
   "message": "Saying yes to everything, same with women. I feel like at beginning relationship, everyone kinda hides who they are and say yes to everything. I'm all for trying new things but don't lie or be fake about it. Also initiative, decide things, plan things, have an opinion. Relationships are built on communication and compromise, its important to lead things off right. Be open and authentic, people can feel good honest vibes.",
   "created_utc": 1697394460,
   "score": 216,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50czph",
   "message": "Continuing to pursue uninterested women, often by becoming a \"friend\" of the woman who is always hoping to date her, rather than cutting their losses, and moving on, and finding someone who is interested.  I've seen a guy follow this pattern for close to 20 years.",
   "created_utc": 1697394865,
   "score": 42,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zyawk",
   "message": "Don't talk only about yourself",
   "created_utc": 1697389458,
   "score": 215,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50dzpz",
   "message": "Start off with sexual comments off the bat",
   "created_utc": 1697395235,
   "score": 2,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zw5iz",
   "message": "Not asking for an actual date, and instead just asking to hang out.",
   "created_utc": 1697388642,
   "score": 160,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50dkk6",
   "message": "lack of situational awareness. it doesn't matter if you're Brad Pitt or the next Jesus himself, if you harass me for a date when I'm trying to work it's gonna be a no. if you follow me into the gas station and then camp next to my car so I can't leave - its gonna be a no. these aggressive displays of dominance are the biggest turn off I've ever seen.",
   "created_utc": 1697395079,
   "score": 194,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50btur",
   "message": "The number of women who think I'm a good listener just because I ask follow up questions is too damn high.",
   "created_utc": 1697394441,
   "score": 177,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50exwx",
   "message": "Treating it as if you have to prove something to her. You need to also see if she’s someone you’re compatible with. Its a two way street",
   "created_utc": 1697395590,
   "score": 23,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50dv0n",
   "message": "Thinking all women are a monolith and not treating them as unique people.",
   "created_utc": 1697395186,
   "score": 122,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k509uuk",
   "message": "Talking about their past relationship 🤦🏻‍♀️ as if they’re still holding on to it.",
   "created_utc": 1697393724,
   "score": 55,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50kwt9",
   "message": "Sending a dick pick. Nobody wants to get a dick pic.\n\nThey want a ~~collage~~ conversation.",
   "created_utc": 1697397769,
   "score": 216,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50iigp",
   "message": "Taking them for granted, especially if you’ve been in a steady relationship for a long time.",
   "created_utc": 1697396893,
   "score": 239,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50fd8r",
   "message": "Thinking that just because you have a sizable member doesn't mean anyone cares or that it means you know how to use it, or even know how to please a woman.",
   "created_utc": 1697395746,
   "score": 156,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50fmw2",
   "message": "Chasing them after they show little to no interest, hoping something will change.",
   "created_utc": 1697395844,
   "score": 164,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50kn42",
   "message": "Don't cheat",
   "created_utc": 1697397670,
   "score": 73,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zwlpn",
   "message": "Being afraid of them. They are just people too. So many guys are afraid to approach women. Being nervous happens to everyone but the fear of rejection stopping you from even interacting with a women you find an attractive will make you miserable.",
   "created_utc": 1697388814,
   "score": 77,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50kugh",
   "message": "Applying your previous relationships to your new relationships. \n\nFor example, I took it to heart when an ex called me clingy, which lead me to try and \"play it cool\" in relationships after, where big romantic gestures would have been appreciated, that I would have loved to have done, but didn't because I thought it would make me look clingy.",
   "created_utc": 1697397745,
   "score": 62,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50px3r",
   "message": "not washing their ass... hell basic hygiene",
   "created_utc": 1697399561,
   "score": 37,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zymfq",
   "message": "Learn to take no for an answer when we say we are not interested in you. \n\nA polite “no thank you” should be enough to let you know we are not interested. We would not have to make up pretend boyfriends/husbands just to reject you. Some males get more aggressive in their pursuit if they think you are taken. \n\nAccept the signs that we are not open to conversation. One morning I was on the subway headed to work. I was wearing headphones and reading a book, two clues that I wanted to be left alone. Some guy started talking to me. I did the smile and nod, but kept going back to my book. When he asked for my number I said no thanks. \n\nHe started screaming at me. Calling me a stuck up bitch and a few other not so nice names. It was a crowded train so I didn’t feel unsafe, but I was trying to find an escape route. Fortunately he ended up getting off the train after his rant",
   "created_utc": 1697389580,
   "score": 57,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zwld1",
   "message": "Sending dick pics.",
   "created_utc": 1697388810,
   "score": 212,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50h4ei",
   "message": "Don’t jump right into the sex talk; get to know us. Talk to us, ask about things. Have a conversation. Don’t let us do all the asking because it becomes an interrogation and not a conversation and we are not police officers. We want to know you and we hope you want to know us back. \nAlso, be clear with your intentions, nobody wants their time wasted.",
   "created_utc": 1697396388,
   "score": 70,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zwcbo",
   "message": "Thinking she owes you a sexual favor because you did something positive.",
   "created_utc": 1697388715,
   "score": 254,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50lda5",
   "message": "Be genuinely interested in the conversation. Ask them about themselves... Don't talk about yourself the whole time. Meaningful conversation is a dialog, not a monolog.",
   "created_utc": 1697397936,
   "score": 49,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zxk23",
   "message": "If you ask how we are doing or what we did today be prepared to listen to the answer and offer thoughtful comments/questions.",
   "created_utc": 1697389177,
   "score": 127,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50drfa",
   "message": "Treating them all the same.\n\nI've had boyfriends tell me \"You're not like other girls.\"  I suspect he meant that I didn't like the normal \"girl\" things like shopping and make-up and I didn't get jealous or worry about him with other women.  That's just having a preference and being an adult to me.\n\nMost women are not like other women any more than most men are like other men.\n\nTry to accept it and learn something when you run across a woman that is \"not like other women\".",
   "created_utc": 1697395149,
   "score": 76,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50f2oa",
   "message": "Treat women like they are a monolithic group, instead of recognizing women are people.",
   "created_utc": 1697395638,
   "score": 71,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k5057t8",
   "message": "Assuming we will be your fuck buddy AND replacement mommy. Nothing less appealing than a grown man acting like a helpless toddler and demanding we pick up where mommy left off.",
   "created_utc": 1697392025,
   "score": 189,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k512598",
   "message": "They dont listen. Or pay attention. You could know a man for years and he still wouldnt know what youre interests are or anything. Its insanely frustrating",
   "created_utc": 1697403981,
   "score": 15,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50me7p",
   "message": "Trying to look like you have plenty of options. Bragging to me about other women being into you is just gross and does not make us magically more attracted to you at all. I don’t want to compete for your attention just like I’m sure you don’t want to worry about all the people I could have either.",
   "created_utc": 1697398309,
   "score": 28,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50nhef",
   "message": "Don't put anyone on a pedestal",
   "created_utc": 1697398706,
   "score": 30,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50humf",
   "message": "Taking advice from guys who either don't have girlfriends or always cycle through 'em.",
   "created_utc": 1697396654,
   "score": 39,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50iaw4",
   "message": "Hygiene/Cleanliness.\n\nYou don't need to be wearing nice clothes, but at least wear clean clothes and be clean yourself.",
   "created_utc": 1697396816,
   "score": 38,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50jo77",
   "message": "Ask girls out based on their personality not just their looks. Respect them and have them respect you. Never lay hands on them . Set your expectations early.",
   "created_utc": 1697397316,
   "score": 46,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50go87",
   "message": "Asking Reddit for dating advice.",
   "created_utc": 1697396225,
   "score": 56,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50cjfh",
   "message": "Acting like women are the same and want the same things \nAnd listening to toxic men tell you what women want and how to trick them or coerce them into being submissive or useful to them somehow \n\nListen \n\nTo \n\nWomen",
   "created_utc": 1697394701,
   "score": 95,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50n53v",
   "message": "On dating sites when they message you first a picture of their dick like its God's greatest gift to human nature.\n\nFirst off rude.\n\nSecondly. I could easily play along, go on a date. Add you on Facebook, even add your mom and grandma on Facebook....and then blackmail you for money and say I'll leak your nudes if you don't pay.  Honestly I would never actually blackmail somebody. That's not my style.  But im just sayin whoever sends nudes to a random person is dumb.",
   "created_utc": 1697398584,
   "score": 23,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50bic6",
   "message": "Not being decisive on what to do or where to go on a date. Make decisions and don’t be so passive.  Don’t ask her what she wants to do constantly.",
   "created_utc": 1697394326,
   "score": 72,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50qhkg",
   "message": "Thinking that they are objects or that they owe you something. Forgetting that they are actually people with feelings and emotions that differ from yours.",
   "created_utc": 1697399762,
   "score": 18,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k516r6n",
   "message": "Not viewing them as a person to form a friendship with, but a woman to be conquested.\n\nThere are so many single fucking dudes that don't have a clue that the fact they are so desperately looking for another person to complete them, that it makes them insufferable and gross.\n\nHobbies first. Work on your goddamn life first. Anything but treating every woman you come across as a possible fuck, because the reason you think that first is the reason you are single. You have nothing to offer besides hormones.\n\nEverybody has those!!!",
   "created_utc": 1697405718,
   "score": 19,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50xuo7",
   "message": "Paying attention…. Listening to their stories and things they like/dislike… a lot of women I know (me included) are detail oriented, so paying attention to the small things matter. Some men feel that not cheating is enough to be a great partner, not true.. that matters but it doesn’t mean you’re the greatest man on earth.. we pay attention to your favorite food or snack, or to your life story and ask questions.. to get to know you better. It’s like putting pieces to the puzzle together to get to know the other person better. It really makes women feel like you’re listening and you actually care.",
   "created_utc": 1697402418,
   "score": 9,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50wv3t",
   "message": "Don't make rapey \"jokes\" ya dumb idiots.",
   "created_utc": 1697402071,
   "score": 33,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50op4j",
   "message": "Negging them. Don’t neg anyone, ever.",
   "created_utc": 1697399132,
   "score": 24,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k516eld",
   "message": "Not listening to what they’re saying. You may be hearing them, but until you actually understand what they mean, you aren’t actually listening",
   "created_utc": 1697405587,
   "score": 6,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50ntix",
   "message": "Wanting sex too soon",
   "created_utc": 1697398826,
   "score": 20,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50etep",
   "message": "Nader H is on point! Most guys I’ve met are short-sighted, in that if they don’t see the potential within the first “hangout” they will automatically think I’ve already labelled them as the friend zone.\n\nI want to add that it’s not because I don’t like you, it’s because you haven’t shown me that I can be comfortable around you. Of course it differs from woman to woman, but I’d like to observe first because taking a step further.",
   "created_utc": 1697395544,
   "score": 21,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k4zz066",
   "message": "ITT: a bunch of men who pretend to understand women.",
   "created_utc": 1697389723,
   "score": 48,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50vcez",
   "message": "In my experience, it's thinking she likes you when she's just being really friendly.",
   "created_utc": 1697401526,
   "score": 15,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k515swv",
   "message": "Choosing a confident independent woman and then try to make decisions for her.",
   "created_utc": 1697405354,
   "score": 10,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k51nnte",
   "message": "Making fun of our hobbies.",
   "created_utc": 1697412695,
   "score": 5,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50djo3",
   "message": "Underestimating her, and being inept in communication, then when misunderstandings occur, having the gaul to try to tell her not only what she’s saying, but also what she’s feeling. Seriously, work in a relationship doesn’t stop once you’ve gotten someone to fall for you.",
   "created_utc": 1697395071,
   "score": 12,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50c004",
   "message": "Treating her too well in the beginning. I’ll just call it trickin. You don’t need to do/pay for everything for her. You don’t need to pay for her hair or nails etc, take her on crazy expensive dates in the beginning. \n\nBe a genuine gentleman. Help her if she needs it. \n\nIf she asks for it. Be skeptical honestly. \n\nIf this is a girl you feel you’d be serious about, and want an actual relationship. Let the genuineness of it all lead the beginning of it. Once you’re deep in it with her. That’s when you start to do all the extras. It’s bad to do it in the beginning because they’ll start to expect it, be mad if they don’t get it, and only expect it to get better from there. You’re giving her 1yr+ relationship treatment in the first 3 months. You’re just shooting yourself in the foot honestly. And I can’t even necessarily blame the woman for being upset. You came out the gate like that. It shouldn’t lack later unless there’s certain circumstances",
   "created_utc": 1697394503,
   "score": 40,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50pak9",
   "message": "Trying to hard to be impressive/seem cool/important/etc. \n\nEveryone sees through this.",
   "created_utc": 1697399340,
   "score": 8,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50t1zl",
   "message": "Not being clear with their intentions. Also, not making an effort in a conversation as you get to know each other.",
   "created_utc": 1697400700,
   "score": 8,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k51hpns",
   "message": "Thinking lying is better than being honest and facing the music.",
   "created_utc": 1697410204,
   "score": 5,
   "submission_id": "178jgh6"
  },
  {
   "comment_id": "k50301p",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "178jgh6"
  }
 ]
}