{
 "submission_id": "178ltsu",
 "title": "What is abuse and people don't realize it?",
 "selftext": "",
 "created_utc": 1697395020,
 "permalink": "/r/AskReddit/comments/178ltsu/what_is_abuse_and_people_dont_realize_it/",
 "score": 157,
 "url": "https://www.reddit.com/r/AskReddit/comments/178ltsu/what_is_abuse_and_people_dont_realize_it/",
 "comments": [
  {
   "comment_id": "k51v9ks",
   "message": "[reactive abuse](https://breakthesilencedv.org/reactive-abuse-what-it-is-and-why-abusers-rely-on-it/)\n\nBasically, abusers will poke and prod their victim so much until their victim has an explosive reaction. The abuser will then use this reaction as justification for their abuse or to further manipulate and gaslight the victim.",
   "created_utc": 1697415935,
   "score": 9,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51xvbn",
   "message": "Sibling rivalry that goes unchecked by parents. \n\nMan, I can't believe how common/ignored sibling abuse is. Neglectful parents plus unruly children is a recipe for disaster.",
   "created_utc": 1697417058,
   "score": 137,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50ecbw",
   "message": "Manipulation under the guise of caring for what happens to you",
   "created_utc": 1697395366,
   "score": 141,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51us6e",
   "message": "Mothers who treat their sons like surrogate boyfriends/husbands. If their sons DARE to have a girlfriend or get married, these women act like they're being cheated on.",
   "created_utc": 1697415728,
   "score": 226,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k5234sc",
   "message": "Invalidating your feelings by making it about them and how you holding them accountable is upsetting them.",
   "created_utc": 1697419341,
   "score": 218,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50e5fu",
   "message": "Neglect - neglect IS abuse",
   "created_utc": 1697395295,
   "score": 13,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51zva3",
   "message": "Yelling. Years of walking on eggshells will damage a person's nervous system.",
   "created_utc": 1697417917,
   "score": 199,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51w1hh",
   "message": "Continuing certain behavior after the person you are affecting has (repeatedly) asked you to stop. \n\n*But-I’m-Not-Touching-You*-ism is a short route to abusive behavior.",
   "created_utc": 1697416271,
   "score": 142,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k518udh",
   "message": "Toxic spirituality. I think a lot of mental health problems hide behind spirituality. \n\nLike, maybe that person isn't your soul mate/twin flame, you just need to deal with some Internal issues buddy.",
   "created_utc": 1697406542,
   "score": 136,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50nzgo",
   "message": "trying to \"test\" people's food allergies because they don't believe them or trying to sneak a food someone doesn't like into a dish to prove them wrong.",
   "created_utc": 1697398884,
   "score": 24,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k523chr",
   "message": "Messing with someone’s sleep.",
   "created_utc": 1697419435,
   "score": 9,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50ko7q",
   "message": "Tethering a dog outside to a stake all day every day with a chain.",
   "created_utc": 1697397681,
   "score": 92,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51cnv6",
   "message": "Harnessing therapy speak to absolve oneself of accountability",
   "created_utc": 1697408092,
   "score": 28,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51hjix",
   "message": "Driving recklessly with you in the car",
   "created_utc": 1697410133,
   "score": 72,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50ijs9",
   "message": "Commanding both parties’ finances.  Not just being a breadwinner, but also shaming the other party for making purchases and/ or demanding their paycheck.",
   "created_utc": 1697396906,
   "score": 106,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50hygl",
   "message": "Gatekeeping hygiene and not teaching your child about normal hygiene and personal care. I didn’t even realize it was a common thing with narcissistic parents until recently.",
   "created_utc": 1697396693,
   "score": 61,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51oe2m",
   "message": "Stonewalling a partner.",
   "created_utc": 1697412998,
   "score": 65,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51po08",
   "message": "Uploading your childrens videos to youtube for fame.\n\nIm looking at you, Pinnay and Brazillian mothers.\n\nTheres wayyyy too many videos of girls doing trendy pool stuff in YT that get scavenged by weird men.",
   "created_utc": 1697413524,
   "score": 143,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k526567",
   "message": "Not providing seating for employees. Humans are not meant to stand for eight hours. Anyone who would be put off by a relaxing employee is sadistic and probably a danger to society under the right conditions",
   "created_utc": 1697420651,
   "score": 129,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50exsf",
   "message": "- Constantly reminding someone of their shortcomings/ past mistakes \n\n- parent’s competing with their child’s lover",
   "created_utc": 1697395588,
   "score": 254,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k5261fh",
   "message": "Telling a child how they should feel. \n\n“You should be grateful.”\n\n“You should be happy.”\n\n“You should be sorry.”\n\nIt shows the child just how little the parent actually cares about their feelings. The child is just a doll to them that they think they can control. \n\nI remember my cat’s leg and tail was broken and my dad told me “You should be happy because I didn’t shoot her.” I will never forgive him for that",
   "created_utc": 1697420605,
   "score": 65,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51zf2y",
   "message": "Finances.\n\nMy ex partner had a habit of monitoring my money, spending things on herself whilst I had to \"ask permission\"\n\nFinancial abuse is incredibly common but a lot of people don't realize that's exactly what it is: abuse.",
   "created_utc": 1697417722,
   "score": 12,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k515uvd",
   "message": "Im gonna say when guys are “ribbing” one of their friends too much. Ribbing is fine in friend groups but when it’s only happening to one person it’s only fun for the people not being ribbed. I left my high school friend group because of this",
   "created_utc": 1697405375,
   "score": 200,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51ix2i",
   "message": "Educational Neglect at home.",
   "created_utc": 1697410706,
   "score": 96,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51p7dv",
   "message": "Showing favoritism - family related. Not by directly saying \"I prefer x over y\" but by the little comments, actions/inactions. It can really mess with someone's self esteem, confidence, and overall thoughts of self and self worth.",
   "created_utc": 1697413327,
   "score": 247,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51wg3v",
   "message": "A lot of us talk like crap to ourselves in our head. I don't know if it's from upbringing or our friends, or are this supposed clever, cynical, sarcastic programing we watch. But that's got to stop.",
   "created_utc": 1697416446,
   "score": 246,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k520l98",
   "message": "Financial abuse is abuse",
   "created_utc": 1697418228,
   "score": 226,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51z747",
   "message": "Trying to convince someone that you know them better than they know themselves.",
   "created_utc": 1697417627,
   "score": 177,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51f8gq",
   "message": "Silent treatment,\nDoing/ paying something and waiting for something to return, make a person feel guilty about it,\nDon’t make a promise you can’t keep",
   "created_utc": 1697409163,
   "score": 57,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50fhws",
   "message": "Double standards in friendships.  E.g., it’s okay if they do something for any reason at any time, but you’d better have and provide a good excuse to do the same.",
   "created_utc": 1697395795,
   "score": 14,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52k89t",
   "message": "When you ask them to not joke about X, and they say something like, “Well, I guess I won’t speak at all anymore.”\n\nThey’re making it so difficult to set a boundary that you’ll want to give up.",
   "created_utc": 1697427074,
   "score": 126,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51zl89",
   "message": "Depending on context, the silent treatment.\n\nIf you live with someone or are a romantic relationship with someone and they refuse to speak to you or acknowledge your existence, even when you're right in front of them -- not just keeping their space, but literally pretending they cannot hear or see you, for days on end -- you're in trouble.",
   "created_utc": 1697417796,
   "score": 123,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50h9e9",
   "message": "Telling depressed people how good they have it.\n\nToo many people think that depression = sadness and that the afflicted person just needs to be cheered up. This is NOT how it works.",
   "created_utc": 1697396440,
   "score": 178,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52enh6",
   "message": "Using personal things someone has told you against them when you are angry. My husband does this and tries to pretend he’s being “constructive”, rather than just cruel. And I’m working on getting my shit together to get the fuck out because I’m tired of being painted as the bad guy when I get upset.",
   "created_utc": 1697424392,
   "score": 88,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52dqhu",
   "message": "Altruistic Narcissism. People that do their best to be extremely helpful to everyone around them, but it's all a manipulative act. They don't actually care about you or what you go through, they just want everyone to see them in a good light.",
   "created_utc": 1697423978,
   "score": 218,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51lg6y",
   "message": "toxic positivity and love bombing",
   "created_utc": 1697411770,
   "score": 238,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51snnv",
   "message": "Driving recklessly during an argument.",
   "created_utc": 1697414814,
   "score": 108,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50w5x1",
   "message": "Controlling someone else’s life. Telling someone else how to live their life. Using someone to make money. Ganging up on  one person. Using someone’s life as a game. Hacking someone.",
   "created_utc": 1697401831,
   "score": 162,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50wfsa",
   "message": "Subtle signs to me are:\n\n1. Subtly maintaining an upper hand in the relationship. That can be using money, influence etc... to unfairly control partners\n2. Lying by omission. It robs the other individual of pertinent information that provides them the consent moving forward to foster that connection.\n3. Not having clear expectations or boundaries intentionally to cause confusion\n4. Continually breaking up with a person and having them grovel to be back in your good graces intentionally\n5. Unrealistic expectations\n6. Continually displacing anger on to others",
   "created_utc": 1697401922,
   "score": 163,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51yl58",
   "message": "Your church telling you to tithe when they have a $100 B investment fund",
   "created_utc": 1697417366,
   "score": 157,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k529y93",
   "message": "Keeping you isolated. My ex tried convincing me that my parents and friends didn’t love me.",
   "created_utc": 1697422273,
   "score": 71,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k50enso",
   "message": "Telling children that they must believe in Jehovah or they deserve eternal torture.",
   "created_utc": 1697395486,
   "score": 16,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52a253",
   "message": "Excessive evaluation, Gossip (defamation), surveillance, financial manipulation (withholding financial resources for the purpose of control, limitation, or narcissism), pursuit after offense or insult, censorship, most actions that result in intrusion, accusatory approaches/ paranoia, literally any indignation or downplaying of someone’s rights or abilities, any form of contact intended to produce forfeiture or loss, and so forth.",
   "created_utc": 1697422320,
   "score": 30,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51f4jy",
   "message": "Being neglected in a relationship, emotionally or physically.",
   "created_utc": 1697409117,
   "score": 171,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51wtnr",
   "message": "A lot of so-called acceptable parenting like spanking your children and treating children like property.\n\nSee r/CPTSD, r/emotionalneglect, and r/narcissisticparents.",
   "created_utc": 1697416608,
   "score": 109,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52gcys",
   "message": "Parentification. I recently learned in therapy that it wasn’t normal that I was cooking \u0026amp; changing my siblings diapers when I was 8.",
   "created_utc": 1697425184,
   "score": 82,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52pyd6",
   "message": "\"Baby trapping\", committed by anyone. It's very much one of the most extreme ways to commit sexual/reproductive abuse a person because you've now forced a person to be tied to you for the rest of their life to ensure you're always able to have power/leverage over them. It's not something a victim can escape easily if they dint want an abortion or to give up parental rights, even them It's very difficult. It's very common, I see posts on reddit about this type of abuse everyday and no one really acknowledges how it's abusive.",
   "created_utc": 1697430139,
   "score": 28,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51woqh",
   "message": "It doesn't have to be violence, it's the implication that something bad will happen if you don't comply. Agreeing to pay for your kids college and pulling the rug out from under them over something petty like a political disagreement is abuse.\n\nI left home to go to college. I was going to work and save up a decent amount of money and wait a year but I was told to not worry about it. I went and within a few months we had a disagreement and they stopped helping at all. I'm halfway through a semester at that point and don't have a job or rent. The landlord was cool and gave me time to catch up.\n\nI racked up a ton of credit card debt during this time. My parents were not hurting for money. I never would have done it if my dad didn't tell me not to worry about it.",
   "created_utc": 1697416548,
   "score": 112,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k525w39",
   "message": "Tickling when the victim is begging you to stop",
   "created_utc": 1697420540,
   "score": 107,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k525idx",
   "message": "When your partner doesn’t ‘let’ you do something. You’re a whole ass person, if you have ask permission instead of discussing things, it’s abuse. I do what I like mostly, but I discuss with my partner if I want to do something that affects us both, and always tell them what I’m up to so they can organise their own plans. However, permission is never someone else’s to give!",
   "created_utc": 1697420376,
   "score": 48,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52fx4a",
   "message": "Weaponized incompetence",
   "created_utc": 1697424983,
   "score": 68,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51nl8q",
   "message": "Shifting blame and not taking accountability do the other person ultimately takes on the guilt.",
   "created_utc": 1697412666,
   "score": 75,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51mnok",
   "message": "The silent treatment is abuse. \n\nhttps://www.ananiasfoundation.org/stonewalling/?gad=1\u0026amp;gclid=EAIaIQobChMI1822ppn5gQMVykh_AB0orw29EAAYASAAEgLoJPD_BwE",
   "created_utc": 1697412281,
   "score": 125,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k525t1h",
   "message": "Neglect is abuse.",
   "created_utc": 1697420504,
   "score": 41,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k52ml6u",
   "message": "Ignoring your children's mental health and listening to others about your children. \n\nMy mom did everything to keep me and my sibling safe, fed, and clean. I thought I had a very wonderful upbringing until I caved and bought myself the shadow work journal and made some heavy realizations. She wasn't abusive per se but she was ignorant. \n\nMy second grade teacher told her I was always in lala land, never paid attention, and was always distracted. My mom took it as if I were doing it on purpose. I was around 7 years old back then and I was officially diagnosed with ADD at 32. \n\nEvery report card came with yelling, frustration, anxiety, etc. I started stealing from her. I considered it a payment to myself. She started calling me lazy even though my sibling and I always cleaned (I stopped cleaning after I figured I'd rather get yelled at and it be true than to do the work and get told I don't). later on when I turned 17, after confiding in her that I had lost my virginity, she told me how I was a disappointment and the only things she could see me doing in the future were either being a prostitute, being homeless, being in jail, or being dead.... \n\nI believe all of the horrible decisions I made in my life stemmed from my family members treating me like I was a problem child. I tried so hard to change and it just didn't work for me. My mother envisioned negative things of me and it all started because she rolled with what that horrible teacher said of me. \n\nI did stop stealing in my late teens and I became celibate 3 years ago (I'm now 34)\n\nI wish I could hug the little girl I used to be and tell her that there's nothing wrong with her, that her brain is just different, and that with the right help, she could do amazing, wonderful things. I wish I could educate my mother so that she could help me understand myself instead of damaging my self esteem and vision. \n\nI also wish I could say I've done good for myself but again, I made horrible decisions based on what I was raised to believe of myself and am still to this day suffering from those decisions. \n\nI suffer from major depressive disorder (also diagnosed) and have suicidal ideations even though I don't actually want to die... but if something were to happen to me... I don't see myself fighting the big sleep.",
   "created_utc": 1697428248,
   "score": 42,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51468s",
   "message": "Gaslighting",
   "created_utc": 1697404733,
   "score": 96,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51dep9",
   "message": "Touching someone without consent. Includes children.",
   "created_utc": 1697408405,
   "score": 111,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k51jztj",
   "message": "Asking someone what they did to cause their partner to abuse them or asking why they stayed in an abusive relationship.",
   "created_utc": 1697411158,
   "score": 131,
   "submission_id": "178ltsu"
  },
  {
   "comment_id": "k5404zb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "178ltsu"
  }
 ]
}