{
 "submission_id": "178ua0v",
 "title": "Older redditors, what do young people get completely wrong about past decades?",
 "selftext": "",
 "created_utc": 1697418962,
 "permalink": "/r/AskReddit/comments/178ua0v/older_redditors_what_do_young_people_get/",
 "score": 18,
 "url": "https://www.reddit.com/r/AskReddit/comments/178ua0v/older_redditors_what_do_young_people_get/",
 "comments": [
  {
   "comment_id": "k52yb0d",
   "message": "How on-time you had to be for your favorite shows because there was little to no chance you’d see that same episode again until they (hopefully) did re-runs during summer. \n\nI remember waiting anxiously for the nightly news to be over so I could watch my favorite TV shows. Commercial breaks were just mad rushes for the bathroom, or to the kitchen to get something quick to drink.",
   "created_utc": 1697435540,
   "score": 203,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52p8s6",
   "message": "Probably just how often you had to accept that you couldn't find out the answer to something. If you had a question you could ask your family, maybe your friends, maybe your teachers, and your last chance was the check the library. But if the library didn't have the answer, then you just had to accept that you weren't going to get an answer (or you'd have to hope to come across that answer someday in the future). Now you just ask Google and get 10 answers in just seconds.",
   "created_utc": 1697429719,
   "score": 92,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52t26u",
   "message": "Up until video rental stores in the early 80's, at school the next day every kid was talking about what was on TV the night before, as every single family was watching tv together every single night. With some exceptions, most people watched the same thing as their schoolmates or co-workers, just to be a part of the conversation.",
   "created_utc": 1697432029,
   "score": 0,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52c4kf",
   "message": "They understand restaurants had \"smoking sections\" and that bars \u0026amp; clubs were filled with cigarette smoke. But I don't think many understood how pervasive smoking was. There were ashtrays and people smoking literally EVERYWHERE. Jury boxes had ashtrays in front of every juror. Judge smoked, lawyers smoked, the gallery smoked. You smoked on planes, trains, busses, taxicabs, and all transportation centers. You smoked at the library, the PTO meetings at schools, the town hall and all city offices. Hell, you could smoke at the courtyard at my High School as a student. You smoked in the elevator and on the escalator. The mall. Sports venues. Doctor's offices. Hospitals. The movies. The plays, opera, concerts and every other public performance. A non-smoker would come home often smelling like smoke. One was constantly surrounded by smoke. It was insane.",
   "created_utc": 1697423244,
   "score": 119,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k538jid",
   "message": "That it was incredibly common to just not have pictures of events or other things we see as important now. Not only did we have entire vacations where no pictures were taken, we could go months without a single picture being taken of any member of our family unless it was particularly notable. A trip to St Louis? No pictures. A trip to Disney land? Maybe a picture at the entry gate or one of the souvenir pictures of us with a character. A trip to zoo? No pictures. An average day? Forget about it! Frequently, the only pictures taken were at major holidays like Christmas or on someone's birthday.",
   "created_utc": 1697443542,
   "score": 173,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52cog3",
   "message": "Probably under estimating how few choices there were.\n\ntoday, it seems like everything imaginable is available in a variety of sizes, delivered to your door overnight.\n\ncatalogs and mail order,  with 4-6 week delivery\n\nMalls were the best thing ever.  all the stores in 1 place, and not downtown.",
   "created_utc": 1697423496,
   "score": 20,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52nsu9",
   "message": "My grandmother smoked basically every second she was awake from age 13-75. She loved it and said she would rather die than stop. She smoked in her house and car. Even in bed. I used to stay with her a lot. I went to a strict private school for High School, they were on campus off campus, which meant you had to conduct yourself the same way at home as at school. My parents went out of town for 2 weeks, I had to stay with my grandparents. I was about 15 and knew i smelled like an ashtray- what could I do? I had to stay with her. Even my hair smelled like it. So I’m at school and I get called out of class and sent to the principal. He explained to me that several teachers had complained that I smell like smoke and he knows I have been smoking before I come to school. I told them I was staying at my grandparents and my grandmother smoked nonstop and that’s why. They said that was not true because my hair smelled like smoke and that only happens if you smoke. So they’re about to suspend me, they call my parents. My parents had to tell them I was staying with my grandparents and that’s why. I was so embarrassed and self conscious until my parents got back and I got to go home. Also when we moved my grandparents to another house, we took down everything from the wall. Realized the walls are yellow from smoke, where something had hung the walls were bright white. I often wondered what my grandmother lungs looked like after this",
   "created_utc": 1697428898,
   "score": 196,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52mr9t",
   "message": "I am definitely an older Redditor (born in 1949).  What today's young people don't appreciate is how, growing up, we had to invent our own sources of fun.  There were no video games (which I enjoy playing), just 3 channels on a black-and-white tv (we didn't get color until 1967), and no real entertainment aimed at kids.  All we could do is interact with each other and play established games like marbles or maybe an organized sport like Little League baseball.  There was a baseball diamond, overgrown with weeds, across the street from us, but mostly we played in the woods that surrounded us, climbing trees pretending to be pirates or some such.  I loved the bookmobiles that would visit my street, and I must have read every biography (all bound in blue covers) in my elementary school library.  It was a different era with many fewer distractions and much more time for sustained imagination.  Being a different place and time, we developed different skills for interacting with the world and each other than young people do today.  Was it better?  That's hard to say.  We tended to have an insular view of our own little world, while today it is hard to escape what it happening everywhere on Earth.  We had to wait days for a letter to arrive, and we shared a party line with our neighbor's phone.  That is a far slower pace than today's instantaneous texting culture.  (Yes, I do text.)  Some things have been lost while others have been gained.  That's the way it always will be.  Just wait.",
   "created_utc": 1697428337,
   "score": 134,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52igo4",
   "message": "how common drinking \u0026amp; driving was.  Until MADD came along, people did this routinely.  It's where \"one for the road\" originated.",
   "created_utc": 1697426197,
   "score": 145,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52ladf",
   "message": "A lot of people sound like they think we lived in silent bubbles because we didn't have smartphones and computers weren't common. \n\nOn the contrary, we talked a *lot*. Like, A LOT. If you had questions you talked. Then you went to the library. And then you talked some more. \n\nAnd wrote letters. And passed notes like crazy. The chatter never fucking stopped. People would scold women for gossiping and make jokes about it, but the men were just the same. \n\nEveryone is like, kids these days have no privacy, but you couldn't kiss your boyfriend on the street without hearing about it from every fucking rando in the neighborhood.",
   "created_utc": 1697427596,
   "score": 240,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k533n36",
   "message": "Landline telephones had seriously great audio quality. Better than anything for remote conversation today, in my opinion. I distinctly remember being a teenager and just talking on the phone with someone late into the night, hearing them breathe and sigh, hearing their every little sound. There wasn't the lag and the noise canceling and the high compression that ruins telephony today. It was a much purer way to feel like you were closer to someone than anything we have today.",
   "created_utc": 1697439539,
   "score": 83,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52uj01",
   "message": "How hard it was to get porn. You had to go buy it, in person... mail order porn was a possibility but then the postman knows. They always knew.",
   "created_utc": 1697432971,
   "score": 77,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52oqsj",
   "message": "People say that the 80s were all about consumerism, which is true, but the products were well made and fixable. Towns had repair shops for everything. You just didn't buy a disposable TV. If it broke you took it in to get fixed. Nowadays if your TV breaks its tossed and you get a new one. \n\nEdit: TVs are just one example that I used.  Look at many different examples under the comments e.g. shoes, household appliances, cars, et cetera.",
   "created_utc": 1697429428,
   "score": 51,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52geic",
   "message": "The 80’s was not day glow. The 80’s was brown and grey with a dash of pastel towards the end.",
   "created_utc": 1697425204,
   "score": 104,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52gnn4",
   "message": "Maybe not everyone’s experience but for me there was casual violence everywhere. Smacking kids was not only tolerated but expected. Hit by parents, friends parents, random adults in the neighborhood, teachers etc. Then you’d get beat for making the teacher hit you. “What will the neighbors think” was real",
   "created_utc": 1697425325,
   "score": 118,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52crle",
   "message": "9/11. Younger people don’t truly understand how the entire nation froze in shock. Security was never the same. For example, Traveling via air was never the same afterwards. I missed the days of walking my friends/family to the gate and drop them off.",
   "created_utc": 1697423536,
   "score": 135,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52tbfm",
   "message": "Travel. Reading paper maps and scanning for roadsides and landmarks to guide you to destinations you have never been to. Half of my younger coworkers couldn't point north if asked without their phones.",
   "created_utc": 1697432195,
   "score": 28,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k525o2r",
   "message": "Kids think Y2K was a joke, but the panic was real, people legit thought computers would end us.",
   "created_utc": 1697420446,
   "score": 29,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52mwie",
   "message": "I recently heard a 20 year old call a 35 year old a Boomer.",
   "created_utc": 1697428412,
   "score": 167,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52lmo9",
   "message": "The 80s was NOT colorful, it was brown and burnt orange as far as the eye could see.\n\nEarly 90s was the colorful time.\n\nGoths today have no idea how easy they have it. We had to raid our grandmas closet, go to thrift stores and learn to sew and alter lol.\n\nI also dont think people know just how important safety pins were as an accessory. We had at least 5 in every pair of pants. We also pierced ourselves with them. Early-mid 90s, I never knew there were piercing shops. At 40 I still have my nose piercing I did with a safety pin in 8th grade.\n\n In jr high I colored my fingernails black with a sharpie bc black nail polish was not really a thing you could buy.\n\nColored hair dye? Nope we had kool aid.",
   "created_utc": 1697427759,
   "score": 142,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k525a6m",
   "message": "I think younger people don't fully grasp what older generations mean when we say our parents had no idea what we were doing and really didn't care.  I see so many young folks angry about their parents not helping with grandkids or going no contact with their parents and they don't grasp that many boomers and Gen X's raised themselves. Dinner was provided, and basic needs were met (shelter, clothing, yearly medical physicals) but so little of everything else. I'm a Gen X and so many of my friends are only now realizing how bad life was for some of our boomer parents as they are suffering from dementia and their sexual and physical assaults are coming to light.",
   "created_utc": 1697420278,
   "score": 240,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52nv55",
   "message": "Kids think things weren't as simple as they see on TV. They were. For better and for worse.\n\nMom drove up to a service station, and when the car rolled over the small hoses on the ground the bell went off - DING DING! A young man in overalls came running out and began filling the tank, then checked the oil, washed the windows, checked the tire pressure, all before the tank was full. Then he'd complete the cash transaction, and off you went.\n\nThe world stopped at the edge of your town. If you knew someone far away, you wrote letters with a postage stamp. Most people had telephones, but answering machines didn't come around for a long time. And if someone moved without leaving a forwarding address, or didn't tell you, they stopped existing. There was just no way to find them.\n\nI'm going to the store. When will I be back? When I get back. What if you need me? I don't know what to say. Yes, I have the quarter in my pocket for a phone booth in case something happens. If the car broke down, you just walked until you found a phone booth, or sat on the side of the road until someone stopped to help.\n\nService stations all carried paper maps, but you had to talk to people, too. They'd say things like, \"Well, the last fuel for 200 miles is up yonder, so if you keep driving you'd best make sure you got a full tank before you head out.\"\n\nIf you had a bike, the world was your oyster on Saturdays, whether you liked it or not. The last cartoon stopped at 9:30am, and then you weren't allowed in the house until dinner. Riding with friends to the railroad tracks because you found a penny, and you could put it on the tracks when a train came and then pick up the smashed penny and keep it. And then you find a quarter in the dirt, and it's off to the corner market because they sell caps. You can't afford a cap gun, but you can find two rocks and you can smash caps for an hour or two. You have to pee? Find a grass field or the side of a warehouse because you're not allowed home until dinner. You're hungry? There's usually a blackberry bush or a crab apple tree you can swipe something from, and then wash off any bird poop in a creek. You're thirsty? Lots of houses have garden hoses out front. Don't get caught, or be faster on your bike than the person can run.\n\nPaper checks were another one. There weren't ATMs, so you got a paper check and had to go to the bank during banking hours. And you could withdraw money, and you could write a check. But if the place you wanted to go didn't take checks, like a movie theater, and you didn't have cash, you just didn't get to go. You had to wait until the bank opened Monday morning.",
   "created_utc": 1697428933,
   "score": 178,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k528bkz",
   "message": "That all 80's and 90's music was good. There was plenty of crappy music released then like there is now, it's just that the crappy music got buried quickly while the best hits continue to get played today.",
   "created_utc": 1697421583,
   "score": 91,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52xase",
   "message": "How brown the 80s was, everything furniture cars wall paneling everything was brown.",
   "created_utc": 1697434835,
   "score": 71,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52kvji",
   "message": "How pop culture amalgamates shit into one big blob, when in reality, it pisses out in little dribbles over decades until it’s distilled by time.\n\nLots of young folks in movie subreddit’s will talk shit about older movies when they finally watch them, and complain that “it’s not even that GOOD, why did anyone LIKE it??” and they have legitimately zero understanding that at the time, that was the *only* movie about X or Y that anyone had seen, EVER, and so yeah it *actually was pretty fucking exciting*. \n\nAlso, how rare it was to be able to watch media like TV or movies *repeatedly* - it just wasn’t a thing. You missed a show? Too bad, good luck catching a re-run at some point later. Really liked a movie? Well it’s out of theatres so you can’t watch it again until maybe it gets edited and played on TV. So many people just didn’t have VCRs! The way we consumed entertainment 100% does not exist anymore and it really did inform how we interacted with it.",
   "created_utc": 1697427404,
   "score": 215,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k5289yj",
   "message": "It's mostly that people tend to only have a pop-culture understanding of past times. Their idea of the 80s, when I grew up, is far too distilled a version of the times to be reality. ... It just occurs to me, people seem to think those times were like a John Hughes movie. His movies actually captured the spirit of the times pretty well, or, at least those of the socioeconomic classes he depicted, anyway. But real life in the 80s happened one day at a time, where as the movies, and younger folks' imagination of the time, was like the entire decade compacted into one Saturday afternoon in a highly stylized movie set of a boy's bedroom. \n\nAnd I'm not picking on anyone here, _of course_ you don't actually understand a time you didn't live in, anymore than my generation understood the 1950s. Though I have to admit I feel flattered modern young people bothered to remember us at all. The 80s and 90s were not a particularly dramatic time like the 1960s was. That's part of what made it so nice; we weren't being drafted, we didn't have an enormous culture war ripping us apart, the economy was relatively good and _lightyears_ more accommodating than it is today. You had the freedom to just breath and be who you wanted to be. It was in a sense an idyllic time, as close to idyllic as America probably ever came. \n\nThe 1980s and 90s were the last, possibly best gasp of old America, before 9/11 skewed it into this deranged culture we're currently enduring. That's the real story here, but probably outside of the context of this question. It's just important for modern young people today to understand that you probably don't grasp how profoundly different America was before that boundary and pop cultural understanding of the time is divorced from reality if you _don't_ have that understanding.",
   "created_utc": 1697421563,
   "score": 190,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52k4tk",
   "message": "That feminism isn't some mouldy concept from the distant past.  \n\nIn the US, sexual discrimination in education wasn't outlawed until 1972, which just happened to be the same year unmarried women were legally allowed access to birth control.  Additionally, prior to 1974 women were not allowed to have credit cards or loans in their own names, they were simply authorised users of their husbands' credit cards.  Some employers also required married women to have their husband's permission before they were offered employment.  \n\nWhen people talk about how women in the 1950s and 1960s stayed married even when the marriage was clearly rocky, it was less about devotion and more to do with the lack of equal access to education, work and finances.  The divorce rate skyrocketed in the '70's but not because women were suddenly wanton and looking for a good time, it was because they were no longer forced to remain in a bad marriage as a matter of financial survival.",
   "created_utc": 1697427025,
   "score": 244,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52tcyc",
   "message": "Funny how so many older redditors (I'm 53) are ignoring the question and waxing nostalgic.\n\nHere's my answer, OP: I think many young people see the decades I grew up in through the lens of survivor bias, and only know the cool/fun stuff. The mediocre crap that made up the mainstream has been forgotten. In other words, no, most teenagers were not listening to R.E.M. and The Cure in the 1980s. They were into Richard Marx and Starship.\n\nWhile I do miss some aspects of the era of my youth, there have since been many advancements in general quality of life that more than make up for this lost so-called simplicity.",
   "created_utc": 1697432222,
   "score": 69,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52olp9",
   "message": "How self sufficient you had to be. If you got a flat tire, you had to change it yourself or walk. You had to make arrangements to meet up with friends well ahead of time and then show up. The world before cell phones was completely different.",
   "created_utc": 1697429348,
   "score": 191,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52iqrh",
   "message": "Smoking and dui.  I'm 44yrs old.  But here are some things for context:\n\nWe used to have ash trays on grocery carts.  in my lifetime.  People smoked in the grocery store.  Every fast food restaurant used to have little tin foil ash trays for their tables.  Everyone smoked in their homes.  It wasn't unusual.  It wasn't vilified.  To this day, signs outside businesses that say you can't smoke outside on the sidewalk weird me out.\n\nDrinking and driving.  My dad told me a story about getting pulled over when he was too drunk to stand up one night.  Maybe 1980.  The cop followed him home to make sure he got there safely.  It wasn't until 1982 that MADD made DUI a political issue.  Before then, it just wasn't a big deal.",
   "created_utc": 1697426337,
   "score": 72,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52kijw",
   "message": "Just how unimportant politics felt.\n\nA lot of people only paid attention to politics every couple of years and only for a few weeks. Whoever won or lost, not that much was going to change and you could move on with your life.\n\nThe big shock of 2000 was that an otherwise dull election about nothing turned on the very narrowest of margins. So did the Senate and the House. Then the country went nuts after 9/11.",
   "created_utc": 1697427222,
   "score": 24,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52jagx",
   "message": "Journalism has changed.  You used to be able to trust in the integrity of the journalist.  Now, they're interchangeable, and all we know is the network.  It has changed the way we trust the new media, and it's not good.  We shouldn't underestimate the danger of this change.",
   "created_utc": 1697426601,
   "score": 85,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52ef1m",
   "message": "The other day I saw a comment on another thread where an older Redditor said that they remembered X thing that was in the news back when they were around four years old and some younger guy very authoritatively told them that you can't remember anything from before your preteens except for a few \"core memories\" unless you were directly involved in the events.\n\nThis comment got a fair amount of upvotes from what I assume are younger people who don't realize previous generations like mine didn't grow up with smart phones, tablets, the internet, a million channels on TV, etc, so yes, we actually were aware of a lot of stuff that was happening in the world, including the major events in the news, regardless of whether we were old enough to understand what they meant and we remember a ton of things from our actual lives. Why wouldn't we?\n\nI mean, we didn't have an avalanche of content to keep us distracted, no videogames that lasted hundreds of hours, no TV/film on demand, just a handful of channels that went \"off-line\" during the night and didn't exactly broadcast interesting stuff all day, etc.\n\nClaiming everything before your preteens is mostly a fog of vague emotions and you can only remember, say, the fall of the Berlin Wall or the explosion of the Challenger if you were directly involved is a *very* weird take IMO given how much I remember very clearly from my childhood, including a lot of the important news stories of the day. I don't know if the kid who said that is expressing a popular opinion among younger people that honestly reflects their experience, but I did find the claim really weird and also found weird that it got several upvotes.",
   "created_utc": 1697424285,
   "score": 19,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52i32i",
   "message": "The internet. Used to be cool, now it's a fucking cesspool of literal BULLSHIT.",
   "created_utc": 1697426009,
   "score": 252,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52i1t2",
   "message": "I'm 53 years old. I have never, ever been able to afford living on my own without financial support from a partner or roommate, and vice versa. None of my peers had their own apartment or house or whatever, costs were always split with someone else.\n\nI mean, I could afford to do it now, but that's after 35 years of working full time.",
   "created_utc": 1697425992,
   "score": 240,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k526eth",
   "message": "The judge, the things that we do out of context, and don’t understand what we mean when we say that’s the way things were back then. I grew up hearing stories of my uncles, driving home, drunk from the bar, and they were always told in a funny context. Then we started to realize as society that this was a real problem and worked to change that habit, or at least make people understand it’s a bad idea. Not once did I ever look back on my uncles and think they’re assholes for driving home drunk, it was just the way things were back then.",
   "created_utc": 1697420766,
   "score": 95,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k52o278",
   "message": "Sexuality and nudity was far more pervasive in media than it is today. In the 80’s there were a lot more r rated movies that were focused on losing your virginity and hooking up and i feel there was much more pressure on teens to be sexually active and if you weren’t scoring with members of the opposite sex you were considered a nerd.",
   "created_utc": 1697429043,
   "score": 211,
   "submission_id": "178ua0v"
  },
  {
   "comment_id": "k54lgeq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "178ua0v"
  }
 ]
}