{
 "submission_id": "1797q8i",
 "title": "What is something that the majority of people would find embarrassing to admit about themselves that you don’t care admitting?",
 "selftext": "",
 "created_utc": 1697467713,
 "permalink": "/r/AskReddit/comments/1797q8i/what_is_something_that_the_majority_of_people/",
 "score": 199,
 "url": "https://www.reddit.com/r/AskReddit/comments/1797q8i/what_is_something_that_the_majority_of_people/",
 "comments": [
  {
   "comment_id": "k5508jr",
   "message": "I have no real friends. And I'm desperately lonely.",
   "created_utc": 1697475938,
   "score": 81,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54fvwj",
   "message": "I’m in therapy due to mental health issues.",
   "created_utc": 1697468469,
   "score": 178,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54f05x",
   "message": "My multiple battles with addiction, and mental illness, in a much better place now :)",
   "created_utc": 1697468129,
   "score": 223,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54j0k6",
   "message": "Never been in a relationship and the big 3-0 is on the horizon. Meh.",
   "created_utc": 1697469662,
   "score": 222,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54zk62",
   "message": "I have battled depression and anxiety almost my entire life. I have struggled with various addictions. I have Crohn's disease. I'm overweight. My wife doesn't like me all that much and we haven't had sex in a year. My kids are assholes. I make $40K a year. \n\nBasically I'm an open book. You could try making fun of me for it, but I don't give a fuck. I'm actually pretty happy ,all things considered.",
   "created_utc": 1697475691,
   "score": 76,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54l6zq",
   "message": "Admitting I was in the wrong or being a jerk. Accountability is important",
   "created_utc": 1697470474,
   "score": 112,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54zz0q",
   "message": "Im a 31 y/o virgin.",
   "created_utc": 1697475842,
   "score": 71,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k551v3b",
   "message": "I've shit myself before.  Turns out many people have to they just never bring it up.",
   "created_utc": 1697476526,
   "score": 34,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54onmx",
   "message": "I was extremely overweight and unhappy.\n\nStill unhappy but fit at least.",
   "created_utc": 1697471737,
   "score": 53,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54eu9w",
   "message": "I am on my 4th marriage.",
   "created_utc": 1697468065,
   "score": 21,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54t6mx",
   "message": "Dang…my whole past, drug use, sexual partners, mental health etc. Better to admit ppl have issues sometimes than demonize yea?",
   "created_utc": 1697473396,
   "score": 21,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54zpsf",
   "message": "Ive experienced homelessness in my 20’s, now in 40’s and have a house and fantastic job.",
   "created_utc": 1697475747,
   "score": 19,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54rm2b",
   "message": "I still sleep with my teddy bear. I'm 15 and I dont plan on giving my bear up.",
   "created_utc": 1697472824,
   "score": 113,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55e6u9",
   "message": "Picking your nose. I'm gonna need people to be more honest and end the cleanliness olympics. Tissues don't get it all, if you don't pick your nose you've got boogers stuffed in your nose 24/7. Let's not pretend washing our hands isn't a thing.",
   "created_utc": 1697480979,
   "score": 54,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54z73g",
   "message": "a tad bit nsfw but penis size, like its not that big of a deal tbh",
   "created_utc": 1697475562,
   "score": 58,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54en38",
   "message": "I grew up poor, spoke with a horrible bumpkin accent, and had terrible parents.  \n\nI'd even tell people stories, if they were willing to listen.",
   "created_utc": 1697467988,
   "score": 42,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55ay6r",
   "message": "I’m very close to my parents and really enjoy hanging out with them.",
   "created_utc": 1697479801,
   "score": 29,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54gaw6",
   "message": "Prostate orgasms are amazing.",
   "created_utc": 1697468630,
   "score": 58,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k554ju8",
   "message": "I have lived with my parents multiple times in my adult life. I admit it now and I never kept it a secret at the time.\n\nI did it for about three years after college as I job-hunted and saved money from my meager entry-level position pay to be able to pay any kind of rent. I probably lived there at least three or four times since then when I was between jobs or had housing issues.\n\nIt was not an ideal situation. I often had to fly back from different states or countries, I had to sleep on some crappy piece of foam mattress in a room they used for storage, my mother and I have a very complicated and often acrimonious relationship, and it certainly put a crimp in my dating life. \n\nHowever, I view it as a privilege that my parents were willing (even if it was reluctantly and with many strings in my mother's case) and able to help me in those lean times.",
   "created_utc": 1697477502,
   "score": 13,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k557ku0",
   "message": "I think that the optimal thickness of a slice of meatloaf for a sandwich is the same thickness as the bread.",
   "created_utc": 1697478587,
   "score": 13,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55n89b",
   "message": "I hate having my picture taken and if you photograph me without my consent in a third person perspective I really want to sucker punch you",
   "created_utc": 1697484243,
   "score": 12,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54po2b",
   "message": "Did some very scumbag shit to feed my drug addiction..then 20 years in prison",
   "created_utc": 1697472110,
   "score": 25,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k559u9s",
   "message": "That urinary incontinence after childbirth is common and can be treated! Most women I know get to embarrassed to talk to their Docs about it!",
   "created_utc": 1697479399,
   "score": 10,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55qss2",
   "message": "That I am addicted to porn. Been clean for 3 weeks now and doing okay.",
   "created_utc": 1697485530,
   "score": 12,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55t4ph",
   "message": "I never plan on having kids bc I enjoy having my life, time, and money to myself. I'm too selfish and impatient to be a mother. And I'm OK w it!",
   "created_utc": 1697486367,
   "score": 10,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k562b30",
   "message": "I regularly call helplines/nightlines. I need help, and I find it more effective than antidepressants and sometimes even therapy. I call so often I’ve been told I’ve hit a cap. I don’t care. They’ve helped and I want to volunteer at a nightline one day to give back the hours I’ve taken.",
   "created_utc": 1697489641,
   "score": 11,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54have",
   "message": "I hate alcohol and hate everytime I am bullied into accepting it to please others.",
   "created_utc": 1697469013,
   "score": 44,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k5518mu",
   "message": "That I'm 26, almost 27 and just don't know what it is in life that will actually make me happy other than being in a relationship. I'm incredibly alone. For the first time in my life these last few months I feel like I need a relationship more than I need air to breathe.\n\nEven if I was able to make enough to live fairly comfortably and to travel to the places I'd like to see and live in the places I'd like to live, I'd still find it meainingless without someone to share it with. I've had long term relationships, flings, casual relationships. I've also been single for a good amount of that time as well. I at least don't have to worry about settling. I can't force feelings that aren't there, which makes it harder as feeling that genuine connection with someone is incredibly rare for me. But I wish I could bump into someone again who genuinely cared about and respected me and wanted to share life life together.  \n\n\nThere's a lot of stigma against that. People really say you should be happy being by yourself before being happy with someone else and for the longest time I've subscribed to that. But sometimes your unhappiness isn't deeply rooted in other issues. Sometimes those issues are just that you miss that physical touch, that look of desire, being thought of by someone through their day. Being someone's favorite person. You can't get those through friends, community or therapy in quite the same way as being someone's best friend and lover.",
   "created_utc": 1697476298,
   "score": 22,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k5558lv",
   "message": "I have herpes. \n\nIt’s actually not that big of a deal. I rarely have breakouts anyways, maybe once every few years. I cried when I first found out about it and thought my life was OVER but most people who are educated about it don’t give a fuck if you’re honest and safe about it.\n\nOne time I was trying to tell a guy about it and asking him to use a condom when things were getting heated but he steamrolled over me and shoved his dick in me without letting me talk or protest about him not using a condom.\n\nSo I told him the next day. He actually cried like a baby. I still savor those tears of his. He deserved a good scare after being so rapey.",
   "created_utc": 1697477749,
   "score": 18,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k556j7j",
   "message": "If someone cancels plans with me that I was also planning to cancel, I admit to them that I also couldn't or didn't want to do it. \n\nI think it makes them feel a lot better, and the only reason they had to do it was because they were more decent about it than me and did it earlier.",
   "created_utc": 1697478213,
   "score": 8,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55o7ec",
   "message": "I’m the black sheep of the family.   I view it as a badge of honor.\n\nSure marginalization stung a bit in my youth, but darn glad I didn’t keep trying to fit into the flock.",
   "created_utc": 1697484592,
   "score": 9,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54jrxq",
   "message": "When I’m wrong or have made a mistake. \nOwn it and fix it!",
   "created_utc": 1697469944,
   "score": 16,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55asew",
   "message": "I’m a woman and I fart.",
   "created_utc": 1697479742,
   "score": 17,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54zx80",
   "message": "Everything. Give me a couple drinks and know all the answers to questions you haven't asked.",
   "created_utc": 1697475823,
   "score": 8,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55njtm",
   "message": "I’m really bad with money.",
   "created_utc": 1697484356,
   "score": 8,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54fzpu",
   "message": "I’m a straight guy and I love trans girls.",
   "created_utc": 1697468510,
   "score": 95,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k5547jm",
   "message": "I like anime.\n\nIt’s great because I’m also a person who enjoys intellectual debate of various topic: and for some odd reason, people discredit me instantly if I’m wearing anime fan clothing or my pfp is anime.",
   "created_utc": 1697477379,
   "score": 13,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55eyuk",
   "message": "I have a very large amount of fetishes ...like way more than so called \"kinky\" people",
   "created_utc": 1697481262,
   "score": 7,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k561squ",
   "message": "I don't really have any friends and I enjoy doing things alone or with my husband",
   "created_utc": 1697489462,
   "score": 8,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k553n7e",
   "message": "That I worked really hard for a degree, to climb the corporate ladder only to find it all meaningless. I get so much more pleasure and joy from my family telling me I cooked an amazing dinner and outdid myself on my banana bread vs any raise, promotion or plaque I get from work. I am actually counting down the days until my husband can retire me or make enough so I can go back to being a waitress part time.",
   "created_utc": 1697477174,
   "score": 13,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k5673v8",
   "message": "I know absolutely nothing about vehicles and sports. I don't recognize logos or players or makes or models. You'd be lucky if I could recognize anything beyond Mustang for its horse, and if I remember a team, I'm unlikely to remember the sport.",
   "created_utc": 1697491377,
   "score": 5,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54o37n",
   "message": "That I have an eating disorder. It's a mental health problem. I'm not embarrassed about it because I didn't choose to have it. I can only choose to try to fix it.",
   "created_utc": 1697471532,
   "score": 10,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k558gne",
   "message": "I would actively tell people that I have slow swimmers whenever they asked me and my wife why we didn't have kids. When in reality my swimmers were fine, and I just wanted to take the focus off my wife's issues.",
   "created_utc": 1697478900,
   "score": 10,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54xqcy",
   "message": "My weight",
   "created_utc": 1697475036,
   "score": 6,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55hmy2",
   "message": "I won't do oral sex. :) \n\nThey get an expression like Lucifer just appeared in a cloud of brimstone smoke.",
   "created_utc": 1697482226,
   "score": 5,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55iypr",
   "message": "I have no ambitions and Im ok with it.",
   "created_utc": 1697482706,
   "score": 9,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55wqn0",
   "message": "I've never slept with any man other than my ex husband and we've been split up since 2004. I haven't had sex in over 20 years. Nor do I miss it.",
   "created_utc": 1697487664,
   "score": 9,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k5559do",
   "message": "I survived an eating disorder",
   "created_utc": 1697477756,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56mr2s",
   "message": "I have no friends. My relationship is falling apart. I’m broke. I’m over thirty. I failed at life.",
   "created_utc": 1697497584,
   "score": 4,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54k0er",
   "message": "I droll in my sleep.  I sometimes wake up to a wet pillow. Hey it happens so why should I be embarrassed?  I keep my pillows and bedding routinely washed",
   "created_utc": 1697470032,
   "score": 8,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55dcxu",
   "message": "I consistently go to therapy and it's improved my mental state dramatically",
   "created_utc": 1697480677,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55jfyp",
   "message": "I haven't been in an actual relationship for 17 years. And I haven't had sex since then either. Being cheated on sucks.",
   "created_utc": 1697482876,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55pa8e",
   "message": "antidepressants and the sexual dysfunction that comes along with taking them. at least I'm not suffering like before.",
   "created_utc": 1697484981,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55swh7",
   "message": "Ive slept with like 60 peeps and I loved pretty much every experience and have no shame.  5 relationships interspersed with that",
   "created_utc": 1697486285,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55tynw",
   "message": "I pick my nose. \n\nIts MY nose. \n\nIts not like Im picking someone else's nose. \n\nWe pick our butts, ears, belly buttons, etc. \n\nPicking your nose is fine.",
   "created_utc": 1697486670,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56cau6",
   "message": "I don’t think I will ever be loved again.",
   "created_utc": 1697493333,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56ese4",
   "message": "Washing my hair once a month? Its actually quite healthy for your scalp. Putting chemicals on it on a daily basis just cant be good. Hair doesnt even smell bad or become greasy.",
   "created_utc": 1697494318,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56h31x",
   "message": "I talk to myself a lot",
   "created_utc": 1697495237,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56y2rc",
   "message": "That I go to therapy weekly.",
   "created_utc": 1697502276,
   "score": 3,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55co38",
   "message": "I am a sub and love Post Orgasm Torture.",
   "created_utc": 1697480426,
   "score": 4,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k54jmub",
   "message": "I went through depression and suicide attempts\n\nI'm cured now, literally thank God.",
   "created_utc": 1697469892,
   "score": 10,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55a74j",
   "message": "I don't care to admit that I grew up with nothing but the clothes on my back, and I survived!\n\nPoverty will not bring me down!",
   "created_utc": 1697479528,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55bfyq",
   "message": "Liking and saying my favorite color pink.\n\nIt's such a stupid thing to not be embarrassed about but as a kid, growing up in the 90s, in a primarily stuck in the old ways Mexican family, that was probably a cardinal sin. To this day I'm sure some men wouldn't admit to something like that but I love the color pink and all its shades.\n\nI also like being affectionate, feelings? They're a thing and for the most part I'm all about sharing them to those willing to listen. Although I mostly leave that for my partner nowadays.",
   "created_utc": 1697479979,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55bv77",
   "message": "Had a drinking problem. Got sober.",
   "created_utc": 1697480132,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55l798",
   "message": "Alcohol addiction, depression, painkiller addiction, heroin addiction, chronic underemployment.",
   "created_utc": 1697483512,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k55vdog",
   "message": "Picking my nose. Sometimes I just need to get in there and get it out. Don’t act like you never have.  Just make sure no one sees you.",
   "created_utc": 1697487179,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k569h4w",
   "message": "I haven’t had sex is over 6 months. And I don’t think I can reconcile with my FWB so it honestly could be another year till I even try to find someone. I just don’t care that much about sex (38 cis straight F)",
   "created_utc": 1697492256,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56g8k2",
   "message": "I used to be a shitty person.",
   "created_utc": 1697494901,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56lzjd",
   "message": "I want to be a dog",
   "created_utc": 1697497261,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56m598",
   "message": "That I can be petty as hell if I’m brought down to it 😏",
   "created_utc": 1697497327,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56n0h4",
   "message": "I have multiple sclerosis so there are often times I can be walkin' then suddenly I stumble and flail around to regain my balance. So far no falls! I should probably buy a cane someday.",
   "created_utc": 1697497694,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56n79x",
   "message": "I like going on solo dates. I do lots of things by myself that most people will only do with company - take trips, eat at restaurants, go to the movies, see theater plays, attend workshops, etc.\n\nOh, and I read more fanfiction than “real” books.",
   "created_utc": 1697497773,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56pfhc",
   "message": "That I've IBS",
   "created_utc": 1697498697,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56t3wc",
   "message": "I spend way too much time on Reddit.",
   "created_utc": 1697500221,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56xrgf",
   "message": "I'm Autistic, a nudist \u0026amp; over 60 (three-way tie). No apologies nor shame.",
   "created_utc": 1697502153,
   "score": 2,
   "submission_id": "1797q8i"
  },
  {
   "comment_id": "k56bmbq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1797q8i"
  }
 ]
}