{
 "submission_id": "179deda",
 "title": "People who drive slow in the passing lane, what is your deal?",
 "selftext": "",
 "created_utc": 1697482007,
 "permalink": "/r/AskReddit/comments/179deda/people_who_drive_slow_in_the_passing_lane_what_is/",
 "score": 215,
 "url": "https://www.reddit.com/r/AskReddit/comments/179deda/people_who_drive_slow_in_the_passing_lane_what_is/",
 "comments": [
  {
   "comment_id": "k55mpuj",
   "message": "When I was in college I was hired to drive a cab, but I had to have a chauffer's license. For some reason this passage from the driver's manual always stuck in my head:\n\n*If you find yourself behind a slower driver in the left lane on a limited access highway,  flash your high beams once to signal that you'd like them to move over and let you pass. If they ignore your signal, pass them very carefully on the right since you are dealing with a poor driver.*",
   "created_utc": 1697484060,
   "score": 132,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k55m1kn",
   "message": "They don’t understand it’s for passing only, not for anyone going the speed limit or faster. They see road usage as competitive rather than collaborative.\n\nBasically, they have the mindset that anyone going slower than them is too cautious, and anyone driving faster than them is a maniac that doesn’t deserve to pass them.",
   "created_utc": 1697483818,
   "score": 14,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k55ycuq",
   "message": "I don’t hang out in the passing lane, but big rigs (semis, campers, trailers, buses, etc) will go in the left lane at busy entrance ramps to let oncoming traffic onto the highway. \n\nPlease don’t swerve into the right lane to pass them… just let them go back into the right lane after the ramp and pass on the left like normal people.",
   "created_utc": 1697488241,
   "score": 85,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56jazo",
   "message": "I remember seeing this question asked before or something similar and was shocked at how many people felt like they needed to police other people's speeds so they drove in the passing lane just to stop people from going too fast",
   "created_utc": 1697496144,
   "score": 30,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k569642",
   "message": "Yeah the left lane is a passing lane, not a “fast” lane.\n\nIf you’re going 10 over the speed limit and the guy behind you wants to pass, you don’t get to stay there just because you think you’re going fast. Move over.",
   "created_utc": 1697492141,
   "score": 120,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ns62",
   "message": "Let's stop with the \"drive slow\" stuff.  It's not about driving slow, it's about driving (as opposed to passing), in the passing lane.\n\nI swear it's people that say to themselves, \"I'm driving fast, I should use the fast lane\", that are the problem\n\nIf you're not passing, either currently or imminently, you shoudln't be in the passing lane, under any circumstance",
   "created_utc": 1697498015,
   "score": 12,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k5695si",
   "message": "It's the same as when someone blocks the aisle with a shopping cart, or they're walking and suddenly stop.\n\nPeople are oblivious and inconsiderate. Annoying AF, and they'll never change.",
   "created_utc": 1697492138,
   "score": 21,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k561c7u",
   "message": "They fall into one of three classes...\n\n1. They are ignorant...they don't know any better.\n2. They are entitled...this is my lane...why do I have to move?  You move if you want to pass.\n3. They are the jerks who think anyone going over the speed limit needs to be ticketed and/or get into an accident.",
   "created_utc": 1697489301,
   "score": 58,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56tso7",
   "message": "They are simply clueless….",
   "created_utc": 1697500508,
   "score": 6,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k563t77",
   "message": "\"People who drive in the passing lane, what is your deal?\"\n\nFixed it for you. Should only be in the passing lane when.. you know? passing. Then gtf back over.",
   "created_utc": 1697490181,
   "score": 25,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k55pw89",
   "message": "They need to start making street signs to remind people of this. Driving slowly in the left lane is more dangerous than mild to moderate speeding.",
   "created_utc": 1697485202,
   "score": 38,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k5625so",
   "message": "Slow people drive slow.",
   "created_utc": 1697489589,
   "score": 5,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k565aa7",
   "message": "People ride my ass for going the speed limit in the left lane but it’s because I have to stay in the left lane to get into the turn lane for my apartment complex. On the interstate though, no excuse",
   "created_utc": 1697490709,
   "score": 8,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k562ky6",
   "message": "Either I need to make a left turn soon or I'm TRYING to move into the right lane but impatient mofos keep undertaking me.",
   "created_utc": 1697489738,
   "score": 17,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56713b",
   "message": "If you think an actually person that drives slow in the passing lane is going to comment on this, then they are not even aware this thread pertains to them.",
   "created_utc": 1697491349,
   "score": 18,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56cypv",
   "message": "My observations on the issue of people who habitually drive in the passing lane:\n\n1.  they have low levels of driving skill, situational awareness, and/or emotional maturity.\n\nI was going to have a bunch of other points, but I realized they all are just sub-points of this one.",
   "created_utc": 1697493590,
   "score": 9,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56jokk",
   "message": "You really think they're gonna answer this? They don't know any better",
   "created_utc": 1697496301,
   "score": 5,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56npsd",
   "message": "As I’ve gotten older my philosophy has changed. It used to be “I’m already going 10 over the limit, screw this guy”. Now it’s “if this wants to get a ticket that badly then go ahead”.",
   "created_utc": 1697497987,
   "score": 4,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k562sad",
   "message": "They are either trying to police the roads and not allow anyone to speed or they're ignorant. I don't really see many other possibilities here.",
   "created_utc": 1697489813,
   "score": 16,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56azgq",
   "message": "\"SLOW TRAFFIC KEEP RIGHT\"",
   "created_utc": 1697492826,
   "score": 5,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56cqpc",
   "message": "Ignorance.",
   "created_utc": 1697493505,
   "score": 3,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56gbmv",
   "message": "Was behind one of these morons today, going exactly the speed limit in the left-most lane of a 4 lane stretch of highway where people tend to go 85+ in that lane.  Idiot was watching a video on their iPhone with their passenger, which was mounted horizontally on the dash.  I was absolutely furious.",
   "created_utc": 1697494933,
   "score": 3,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56gnbh",
   "message": "What infuriates me more is people who are slow af on single lane roads, but once there's a passing lane they suddenly have the balls to speed up so that none can overtake them without going maniacal speed",
   "created_utc": 1697495061,
   "score": 3,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56sxqb",
   "message": "I used to be this person.  When I was taught how to drive, I was not taught the concept of passing lanes.  Instead, a focus was put on minimizing how much merging I do which meant hanging out in the left lane when a left exit was coming up and hanging out in the left lane if there were a bunch of right onramps that I wasn't going to be using.  I was also taught to *never* go over the speed limit.  So, for my first few years as a driver I spent a lot of time in left lanes being confused about why people were getting so annoyed with me.  I had to kind of figure out the concept of defaulting to the right lane and having a passing lane on my own.  It helped that at the time, \"stay right except to pass\" was not in the law in my state so there were no signs expressing it nor cops handing out tickets to left lane sitters.",
   "created_utc": 1697500150,
   "score": 3,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56taut",
   "message": "People are ignorant of the world around them. Also foreigners.",
   "created_utc": 1697500300,
   "score": 5,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k5633b6",
   "message": "I wish I understood. When I have children, I will tell them the same thing I tell my wife- Those are the NPC’s of life.",
   "created_utc": 1697489923,
   "score": 12,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k564bks",
   "message": "Yes and people who are annoying in general and don't follow normal standard protocols..... why you do that?\n\nLookin at you guy hugging the subway pole like he's a stripper.",
   "created_utc": 1697490364,
   "score": 4,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k569snz",
   "message": "They’re too busy texting to notice what lane they’re in or how fast they’re going.",
   "created_utc": 1697492377,
   "score": 4,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56epmn",
   "message": "Define slow.",
   "created_utc": 1697494287,
   "score": 5,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56e04n",
   "message": "Those people can’t read well enough to comprehend this post.",
   "created_utc": 1697494002,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56srnn",
   "message": "Is this a cross post from r/NewJersey? This question is asked every other day.",
   "created_utc": 1697500080,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k574lff",
   "message": "Because they're an irritating combination of selfish, oblivious and stupid.",
   "created_utc": 1697504909,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k563cue",
   "message": "Assholes.",
   "created_utc": 1697490017,
   "score": 5,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56v50j",
   "message": "I drive very fast 4-6 AM (not weaving but 100 or so when roads are clear) and most people who camp the left are:\n\n1. On the phone\n2. Old\n3. Think they are macho and I am challenging their manhood (idgaf I just like to get to work early) \n\nYou get used to it. What you don’t get used to the wild reactions group 3 will exhibit.",
   "created_utc": 1697501076,
   "score": 4,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56jx07",
   "message": "Regardless of what lane I’m in, people still ride my ass when they’re going 15-20+ over the speed limit.",
   "created_utc": 1697496400,
   "score": 3,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56k4mc",
   "message": "Some people just want to see the world burn",
   "created_utc": 1697496487,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ma6g",
   "message": "You're not going to get a lot of great answers on this, because people can't really see their own crappy driving and are instead just answering what they THINK is the deal with slow drivers that they observe.\n\nI don't drive slow in the passing lane either, not as a general rule. But I can tell you what my thought process is during times when I'm spending the longest amount of time in the passing lane. \n\n- Usually it's when there is medium to heavy traffic in the main driving lane. If the line of cars in the driving lane seems endless and is all going slower than I want to go, then you bet I'm going to spend most of my time in the passing lane.\n\n- But I do still have a maximum speed that I go, in order to avoid tickets, and I won't let myself be goosed into going faster. In my opinion, that max speed is respectably fast, but not reckless or dangerous.\n\n- Sometimes, therefore, I'm in the passing lane but going slower than someone who is coming up behind me, and I assume they ask a similar question to the one you've posed here. If someone is behind me looking to pass, I always shift into the right lane at the earliest reasonable opportunity. But sometimes that can be several seconds, which I'm guessing feels like an eternity to someone who feels the need to drive 90mph.",
   "created_utc": 1697497386,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k562qja",
   "message": "You're talking about highways and freeways, right? Because if you're talking about anywhere else hahaha.",
   "created_utc": 1697489795,
   "score": 4,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k564lrc",
   "message": "My thinking is they feel they are keeping everyone from speeding, it must infuriate them and this is their bit of control.",
   "created_utc": 1697490467,
   "score": 5,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k564s80",
   "message": "I can say with full truthfulness that their “deal” is to drive me absolutely bananas.",
   "created_utc": 1697490531,
   "score": 4,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k55lr10",
   "message": "They’re from Nee Hampshire?",
   "created_utc": 1697483712,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56lf5i",
   "message": "Where I am, in Alberta, it is illegal to exceed the speed limit, even in the passing lane.\n\nAnd I am, of course, a 100% law-abiding citizen.",
   "created_utc": 1697497024,
   "score": 4,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ftg8",
   "message": "And what about super fast drivers passing in the slow lane?",
   "created_utc": 1697494734,
   "score": 3,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k569ybq",
   "message": "Some people just want to see the world burn.",
   "created_utc": 1697492437,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56e1w4",
   "message": "Oblivious to the world around them and completely inconsiderate of how they effect other people.",
   "created_utc": 1697494022,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56njut",
   "message": "They used to have big signs on the road that said, \"slower traffic keep right.",
   "created_utc": 1697497918,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56p7z1",
   "message": "Probably the same type of people who don't understand right of way for other cars and pedestrians.",
   "created_utc": 1697498613,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56slls",
   "message": "One time I was driving 20 mph over the limit in the passing lane. Guess is still wasn't enough because some dude came honking at me coming around the right going 40 mph over the limit.",
   "created_utc": 1697500010,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56u1kq",
   "message": "Look it was ONE time and I’m SORRY! I passed a semi, zoned out for a minute, and moved back over when I realized someone was trying to pass. Got a lot of thoughts going on.",
   "created_utc": 1697500611,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k560xvh",
   "message": "Spoiler alert: the people complaining about people in the fast lane are usually also the problem to a different driver",
   "created_utc": 1697489162,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k561r27",
   "message": "Most people don't actually know that's what the left lane is for anymore.\n\nAnd with so many people doing it, there's no way for it to be reasonable enforced.\n\nI am 100% someone who prefers the left lane.  However, I also pay attention behind me. So when I see a car creeping up behind me, I move out of the way, and let them pass.",
   "created_utc": 1697489445,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56c1ib",
   "message": "They're the main character. That's all it is, entitled ignorance.",
   "created_utc": 1697493232,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k565jwu",
   "message": "If it's a Prius and the driver is texting, that's the modern reason.",
   "created_utc": 1697490803,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k567015",
   "message": "My dad told me years ago, it’s because a lot of people set their cruise control and cannot be bothered to turn it off and speed up or move to the right lane. Makes sense.",
   "created_utc": 1697491338,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k567zv6",
   "message": "They are right up there with people crossing 2 or 3 lanes when turning.",
   "created_utc": 1697491702,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56i5n3",
   "message": "It's the passing lane.  Not your personal speedway",
   "created_utc": 1697495672,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56rgi9",
   "message": "I'm not driving slow, i'm going the speed limit.",
   "created_utc": 1697499538,
   "score": 2,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k568iy5",
   "message": "I drive really slow in the ultrafast lane, while people behind me are going insane!\n\nI’m an asshole.",
   "created_utc": 1697491900,
   "score": 0,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56dzpw",
   "message": "I'll give it a pass if you are giving you are switching lanes to let people on via the entrance ramp. If it's temporary.\n\nWhich brings me to my next point: HOLY FUCK!!! Get in the other lanes when you see people entering via the ramp. \n\nI had some assfuck FLIP ME OFF the other day because I entered the highway in a normal fashion. (I did \\*totally accidently\\* get off the same ramp as them and went to the same gas station.) \n\nIt's truly not that difficult.",
   "created_utc": 1697493998,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56igsv",
   "message": "I don't think anyone will admit it, but the majority of people that I have to pass on the right are on their phones.  \n\nIt is genius.  If you set your cruise to a bit faster than the right lane, you can have the entire road ahead of you empty.  You want to be safe after all.  Anyone who wants to go faster is an asshole and they deserve to be stuck back there.",
   "created_utc": 1697495798,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56m4xi",
   "message": "Too many drivers feel like it’s up to them to police others rather then just moving over. If you flash your lights they slow down and if you try to pass they sped up. It’s beyond silly.",
   "created_utc": 1697497323,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56m6xp",
   "message": "It's a plague. It's everywhere. Out here in the Greater Puget Region, 58 in the left lane is a way of life for many drivers.  As well as slowing down to about 25 or 30 to merge onto the freeway.",
   "created_utc": 1697497347,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ozwo",
   "message": "Remember this (at least in my state) is only for roads over 55 mph. Roads here that are say 4 lane roads (2 each way), the left lane is not necessarily a passing pane. Tons of people need to turn left at intersections.",
   "created_utc": 1697498521,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56emyc",
   "message": "US problem.",
   "created_utc": 1697494257,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56l17i",
   "message": "I may be driving slower than others in the left lane, but as long as I’m passing, it’s ok to be there. \n\nIf people that want to go faster cut me off before I can get back in the right lane (yes, I use my blinker) after I pass, then I can get stuck there. It’s stressful for me and others behind me. Give me a second to move over and we’ll all benefit.",
   "created_utc": 1697496861,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56lqi6",
   "message": "I’m only 13 miles from where i have to exit left.",
   "created_utc": 1697497157,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56nuxz",
   "message": "Are they going slow because they are keeping adequate spacing with cars ahead or just going slow?",
   "created_utc": 1697498046,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56su75",
   "message": "I don't hang out in the passing lane, but I think I get why people do. The passing lane is the only lane where you don't have to worry about people merging all around you. You are protected on one side.\n\nThe far right you have people entering and exiting the freeway and is probably the most chaotic lane to drive in.\n\nThe middle lanes have people merging from both sides constantly. \n\nDriving on the freeway can be stressful, so I feel like the drivers who are less-confident, or lazy, or just selfish, will immediately make their way over to the far left lane, and then hang out there because they have less to worry about in that position.",
   "created_utc": 1697500110,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ty67",
   "message": "LOL",
   "created_utc": 1697500572,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k5736kt",
   "message": "They are stupid and there is no other explanation.",
   "created_utc": 1697504335,
   "score": 1,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k568oep",
   "message": "Because I’m on the phone",
   "created_utc": 1697491958,
   "score": 0,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ciwt",
   "message": "I used to when I was younger, because I hated people that speed and wanted to make their day worse. I still hate people that speed, but I don't take up the left lane anymore because I'm not a 20-something and don't care \\*that much\\*. \n\nOnly thing I really hate is when I'm in the passing lane and actively passing someone, but some dude going 20 over wants to ride my ass and then go around me when I pass, nearly causing an accident as I'm trying to get back over. Like, dude, I'm not cutting that person off just because you're an impatient asshole. Wait five more fucking seconds and I'll be in the right lane.",
   "created_utc": 1697493421,
   "score": 0,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k55wspd",
   "message": "I like to increase the level of danger for everyone on the road. Pissing people off is just one angle I use to accomplish this goal.",
   "created_utc": 1697487685,
   "score": 253,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56izrg",
   "message": "Keep in mind that \"Keep Right\" laws are not universal. Only thirteen U.S. states have laws on the books requiring drivers to keep right except when passing (Arkansas, Illinois, Kansas, Kentucky, Louisiana, Maine, Massachusetts, Michigan, Missouri, Montana, New Jersey, Pennsylvania, and Washington). The remainder only require that \"slower\" traffic keep right, or that traffic in the left lane yield the lane when faster traffic approaches. Otherwise, it's legal to drive in that lane all day long. In several states, the law only requires you to move out of the left lane if you're driving under the speed limit (Alaska, Maryland, and a few others).\n\nMost states do have exceptions to these laws, allowing highways to have alternate rules posted. Texas, for example, technically only requires slower vehicles to keep right, and allows non-slow drivers to stay in the left lane \n\"except as posted.\" In practice, most of the interstate highways, and virtually all of the multilane rural state highways, are posted with signs declaring that the left lane is only for passing. But even within Texas, it isn't universal.\n\nI live in California, which is a yield-right state. I can drive in the left lane any distance I'd like, and the law simply requires that I move right when faster traffic approaches from the rear to allow that traffic to pass.",
   "created_utc": 1697496014,
   "score": 0,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56j4oz",
   "message": "We want you to suffer",
   "created_utc": 1697496071,
   "score": 254,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k5609bu",
   "message": "Just because you want to go faster than us when we’re passing someone doesn’t obligate us to recognize your exaggerated sense of entitlement.",
   "created_utc": 1697488919,
   "score": 249,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56aj7e",
   "message": "I don't believe people have the right to go whatever crazy speed they want to and demand that people (who are still passing cars, but just not going as fast as you want them to) are required to move over for drivers who are speeding and going well over the speed limit. Auto accidents are a leading cause of death that kill tens of thousands of people each year and injure millions more. It's a risk I take very seriously. Too many speeders in the left lane think they're Moses and have been ordained by god to part the seas of the highway and have everyone make room for them so they can go 90mph. You're sharing the road. People go different speeds. You might have to slow down for others. Be safe out there.",
   "created_utc": 1697492656,
   "score": 250,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k562qi4",
   "message": "I would like to put a reminder that the HOV lane is not the passing lane. At least not in my state. Yes, it’s on the left but it has restricted usage and I am not moving over for you. Use the passing lane if you want to get by, that’s what it is for.",
   "created_utc": 1697489795,
   "score": 251,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56icoy",
   "message": "People who have to speed around me when I'm driving 15mph over the speed limit already, what is your deal?",
   "created_utc": 1697495751,
   "score": 0,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56nu6f",
   "message": "“I’m passing. Slowly. And people don’t need to drive that fast anyways.”",
   "created_utc": 1697498037,
   "score": 0,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56wb6k",
   "message": "I'll always move over if there's space in the right lane. I'm usually driving faster (+10-15 over limit) than right lane traffic so it shouldn't take more than a few seconds to find an open space. However, when an asshole decides to tailgate me with high beams on. U can bet ur ass I'm not moving until he stops tailgating.",
   "created_utc": 1697501562,
   "score": 0,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k5689jy",
   "message": "What’s slow? I find myself going 15 to sometimes 20 miles an hour over the speed limit in the left lane and being tailgated and cut off trying to get around me when all I wanna do is be in a safe lane with limited distractions entering and exiting the highway.",
   "created_utc": 1697491803,
   "score": 251,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56cuig",
   "message": "If i happen to be in the passing lane (and driving faster then the cars in the right), and someone comes up behind me and tailgates the shit out of me - despite me going a decent speed.  Then I slow the fuck down to a snails pace until they back off.\n\nIf they don’t back off, and keep tailgating.  Well, they get to drive nice and slow for a while.",
   "created_utc": 1697493546,
   "score": 249,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ipm0",
   "message": "LEAVE US ALONE",
   "created_utc": 1697495897,
   "score": 255,
   "submission_id": "179deda"
  },
  {
   "comment_id": "k56ng0h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "179deda"
  }
 ]
}