{
 "submission_id": "179je8z",
 "title": "What’s the grossest thing you’ve ever seen someone bring to a potluck?",
 "selftext": "",
 "created_utc": 1697497037,
 "permalink": "/r/AskReddit/comments/179je8z/whats_the_grossest_thing_youve_ever_seen_someone/",
 "score": 33,
 "url": "https://www.reddit.com/r/AskReddit/comments/179je8z/whats_the_grossest_thing_youve_ever_seen_someone/",
 "comments": [
  {
   "comment_id": "k579yw3",
   "message": "Potato salad…with multiple hairs from his head, I hope.\n\nI just know they were human hairs, and they were tight and curly.",
   "created_utc": 1697507132,
   "score": 206,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57mv3c",
   "message": "We had a potluck today and someone brought some Doritos. People started eating them and complaining that they tasted like dirt. We looked at the bag and it had a promo for Mockingjay part 1. The chips expired in 2014! This was a mixed department pot luck and we haven’t found the person that brought the 9 year old chips.",
   "created_utc": 1697512762,
   "score": 185,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57jrdn",
   "message": "My cousin’s wife wanted to make pimento cheese sandwiches for a Super Bowl party. Problem is she had no idea what went into pimento cheese and refused to go to the store because it “couldn’t be that hard.” So she mixed a bag of shredded cheese, an ungodly amount of mayonnaise, and for the little red bits? Maraschino cherry halves 🤮 Then dumped approximately a half cup of garlic salt in for good measure. \n\nI thought they were a dessert because they were pink and couldn’t figure out what a pink sandwich would be. It was truly one of the worst things I’ve ever put in my mouth.",
   "created_utc": 1697511335,
   "score": 61,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k578p2a",
   "message": "Someone brought Devilled eggs and instead of sprinkling paprika on them they used cinnamon.",
   "created_utc": 1697506605,
   "score": 136,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57f4qw",
   "message": "She opened a can of tiny shrimp and poured it out, liquid and all, on top of a block of cream cheese. That was it. I guess we were supposed to eat it with crackers.",
   "created_utc": 1697509331,
   "score": 10,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56ojk9",
   "message": "Grandma's Jello salad, made with cottage cheese and celery",
   "created_utc": 1697498336,
   "score": 135,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57b02g",
   "message": "half of a pie.  not half of a pie that was sold that way by the bakery.  a leftover half eaten pie.",
   "created_utc": 1697507567,
   "score": 218,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k572fgh",
   "message": "Casserole with a side of roaches.\n\nNot even kidding. They crawled out of the bag she brought her dish in. I stopped participating in potlucks after that.",
   "created_utc": 1697504028,
   "score": 3,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k576a76",
   "message": "Some kind of “lasagna” made by someone who had no clue what lasagna is. There were layers of pasta; but the rest was things like chicken, grated cheddar cheese, canned jalapeños, mushroom soup, frozen mixed vegetables, spicy mayo etc.",
   "created_utc": 1697505600,
   "score": 223,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57k7wt",
   "message": "I know the neighbor's cat pees on everything. I've pet sat for them. I saw that critter pee on the patio next to the grill.\n\nWent over for dinner. Chicken asada on the grill.\n\nSmall piece of chicken went astray right on the patio next to the grill.\n\nNeighbor put it right back on the grill.\n\nI brought  salad.\n\nThat's all I ate.",
   "created_utc": 1697511538,
   "score": 97,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57k3yg",
   "message": "Someone made brownies with ground meat in them to a church potluck. My vegetarian friend discovered this when she bit into one. She was more confused and horrified about their existence than she was upset about eating meat-- it was the concept of this abomination itself that was disturbing and baffling. \n\nI thought she had to be wrong. \"You haven't had ground beef in years, you don't know what it tastes like anymore, it's probably something else.\" I tried them. It was beef. I was disgusted and really, really, really confused. \n\nYears later, I found out that apparently this was a thing. Someone came up with this-- putting beef in brownies-- as a substitute for walnuts for people with nut allergies.\n\nWhile this explains it a little, in theory, I'm still confused about why someone would assume that people who can't eat walnuts would prefer to eat ground beef brownies over just. Regular nut-free brownies.",
   "created_utc": 1697511490,
   "score": 234,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56o6r2",
   "message": "An office potluck - as everyone is eating, one of the girls says,\"I'm sorry if you find ant cat hair in the green bean casserole.   My cat kept getting up on the counter to nibble at the edges.\"    Cue everyone looking at each other like WTF??",
   "created_utc": 1697498185,
   "score": 20,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57fpn0",
   "message": "A custard pie that wasn’t made well so it tasted like cold eggs. It was like chewing farts. 🤢",
   "created_utc": 1697509585,
   "score": 231,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57puho",
   "message": "I love telling this story. \n\nI worked at a patient care clinic with mostly nurses. \nOne nurse brings mashed potatoes inside of a Walmart bag. Not inside of a bowl inside of a Walmart bag. \nMashed potatoes. Loose. Inside of a Walmart bag. That could’ve previously held raw chicken or some other gross thing. A NURSE. \n\nI ended up posting about it on Facebook later, after having forgot we were FB friends. Oops.",
   "created_utc": 1697514221,
   "score": 2,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57bz24",
   "message": "We had a lady who made her special pb fudge. But she wouldn't put it out with all the food. She would walk around with her Tupperware and offer the people she liked a piece. Not more than 1 piece you were allowed to take.  If she didn't like you,  you didn't get one.  This went on for years. \nThe last year she worked there,  we all decided to say no thank you when she approached us.  \nOh and 2 of us brought fudge for everyone at the table spread. She was furious that we foiled her shitty efforts.",
   "created_utc": 1697507980,
   "score": 151,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57degk",
   "message": "My sister would bring 2 crockpots …. 1 with spaghetti sauce… the other with water and the noodles. The noodles would be cooking in the water all day.",
   "created_utc": 1697508583,
   "score": 61,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k5711cc",
   "message": "I’ll fall on that sword. I brought Shepards pie to a Christmas party and thought it festive to colour the mashed potatoes green.",
   "created_utc": 1697503467,
   "score": 24,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56xr50",
   "message": "Lime jello with Vienna weenies and cherry tomatoes in it.",
   "created_utc": 1697502149,
   "score": 86,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57iawh",
   "message": "A korean american coworker brought homemade kimchi, but she admittedly didnt know how to make it and just \"winged it\". \n\nIt was fermented wrong and was covered in mold, which she didnt seem to understand was bad. The vegetables were basically half liquified and it smelled like dumpster juice. \n\nThe thing is...half of the chefs at work had learned to make kimchi correctly and safely since various different kimchis used to be on the menu before she was hired. So we all instantly knew it was wrong and unsafe, but no one wanted to tell her.",
   "created_utc": 1697510710,
   "score": 124,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57jdd9",
   "message": "An apple pie, but they didn't have apple pie spices, like clove, cinnamon, or nutmeg, and said they used taco seasoning by accident and expected people to eat it.  \n\n\nI, a dumb bitch who likes to torture themselves tried it, and promptly tossed it into the trash when they looked away.",
   "created_utc": 1697511169,
   "score": 171,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k571ol3",
   "message": "“Homemade fried chicken.” Which translated to ‘chicken that I covered in pancake batter and breadcrumbs and dropped into a frypan until the outside looked cooked.’ It wasn’t even seasoned.",
   "created_utc": 1697503730,
   "score": 101,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k572gty",
   "message": "Had a friend show up with “his wife’s specialty”.  It was deviled ham and cheez wiz scooped onto a ritz.  They were also made some time ahead because the crackers were no longer crisp.  \nTo make it worse, he walked around with them and his wife telling everyone to try them.  \n\n\nThat was the night I learned that it will be ok to strategically lie about having food allergies.",
   "created_utc": 1697504044,
   "score": 56,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57jmc6",
   "message": "Chocolate chip cookies but she didn't really mix the ingredients very well. So there were lumps of flour and baking soda (or powder). They were godawful.\n\nSecond worst was a macaroni salad that had some kind of white fish in it.",
   "created_utc": 1697511275,
   "score": 200,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56xyfz",
   "message": "Mushroom and wild rice full of dog hair.  Not a strand or two.  But FULL of dog hair.  Turns out she ran a sanctuary or something  🤮",
   "created_utc": 1697502227,
   "score": 201,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57ch2g",
   "message": "My husband and I went to a potluck at a park shelter one time.  Someone had brought vegetables and dip.  I was reaching for some when my husband nudged me and told me to look closely.  There were bugs all in the vegetables.  I don't think they were from being outside because none of the other food had bugs.  I think whoever brought the platter either didn't notice the vegetables were full of bugs, or didn't care.",
   "created_utc": 1697508193,
   "score": 153,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57cs6o",
   "message": "Hot dogs in a crock pot.. you haven't lived until you've had a melt in your mouth hot dog.",
   "created_utc": 1697508325,
   "score": 50,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57aqju",
   "message": "It was Halloween party and they brought a Jacko latern shaped meat loaf thing. It was just unseasoned ground beef.",
   "created_utc": 1697507455,
   "score": 59,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k574vvd",
   "message": "Cold pasta salad seasoned with cat hair",
   "created_utc": 1697505028,
   "score": 186,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57h084",
   "message": "My grandmother-in-law. Everything she brings. The first time was stale cake in a bowl of syrup(?). It was both cake and soup, while also being neither.  \n\nShe has meat in her deep freezer older than some of her grandchildren. She’s a depression-era cook, so expiration dates don’t apply to medicine, cupboards, or freezers. Once she tried to give my daughter (2yo at the time), cough medicine that expire 9 years before she was even born.",
   "created_utc": 1697510137,
   "score": 163,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56llbq",
   "message": "Their heroin addict \"girlfriend\" who didn't bathe in 3 years",
   "created_utc": 1697497096,
   "score": 163,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k570tw0",
   "message": "A “salad” that consisted of shredded carrots, miracle whip, and raisins.   \n\nI’m sorry grandma, but fuck that salad.",
   "created_utc": 1697503382,
   "score": 185,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57knxs",
   "message": "A half eaten chicken something dinner from their meal at Olive Garden the previous night.",
   "created_utc": 1697511733,
   "score": 129,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57qv3s",
   "message": "Sidewalk beans. They spilled beans on pavement scooped them back into the container with bits of stuff and served it with the warning that they’ve spilled them on the pavement and there’s a chance of finding pebbles in it.",
   "created_utc": 1697514755,
   "score": 129,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57i60x",
   "message": "I once made a brain dip for a work afternoon tea on Halloween. It was a homemade onion \u0026amp; herb dip with paprika that made it pink \u0026amp; used a large brain mould. It looked quite realistic. Very few ate it because it looked too real",
   "created_utc": 1697510651,
   "score": 114,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k5720ip",
   "message": "Church social.  Chicken wings baked so dry the looked like mummified body parts.",
   "created_utc": 1697503862,
   "score": 43,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57jeon",
   "message": "This one requires some setup because the dish is actually very popular at family gatherings. \n\nMy dad was well known for his cakes. Small variety of different ones. Nothing fancy, just good cake. \n\nHe made one and iced it to serve later that day at a family potluck. The dog comes along and can barely get his tongue over the edge of the pan and gets about 1/3 of the icing off the top. Dad had leftover icing. \n\nSo the moral of the story, eat from the same side of the dish that my dad serves himself from.",
   "created_utc": 1697511184,
   "score": 21,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57crzi",
   "message": "I still feel bad for one of the office ladies who once brought ice cold green bean casserole not knowing her crock pot was never turned on.\n\nAfter this; she literally brought 2 cans of green beans, a bowl and a can opener.\nOf course no one ever ate the canned green beans after she stood at the microwave warming them up for 8 minutes or however long.\n\nAt a later several year reunion, she was still working there and had grey hair.\nAnd it occurred to me in that moment that she never had much in life.\n\nLife isn’t lucky or full of joy for everyone.",
   "created_utc": 1697508323,
   "score": 4,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k571gzn",
   "message": "Liver Stroganoff.",
   "created_utc": 1697503644,
   "score": 70,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56x5wb",
   "message": "Chicken spaghetti crockpot with come Campbell's soup dry packets of onions or something in it.   Fucking nasty.",
   "created_utc": 1697501917,
   "score": 144,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k571qyw",
   "message": "A dessert made to look like a cat’s litter box. It had Tootsie Roll “poop” hanging off of the sides.",
   "created_utc": 1697503757,
   "score": 84,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56rafn",
   "message": "Himself. Always first in line, plate big enough to feed 2 people.  Never brought even a bottle of soda. Called him out on it once. He had no shame",
   "created_utc": 1697499469,
   "score": 63,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57i9fb",
   "message": "Grandma brought the 1 yr old fruitcake she kept in a glass bowl covered in foil out from under her bed to the family potluck.\n\nWhen the foil came off everyone gagged as it smelt like booze and death and then she lit it on fire and poured cream on it and insisted everyone try it.\n\nIt was simultaneously super dry and sopping wet, tasted like hand sanitizer, and had the texture of cat litter.",
   "created_utc": 1697510692,
   "score": 222,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57g0ly",
   "message": "A girl in our group is great at cooking. Then we noticed she changes the diaper of her 1yo kid and doesn't wash hands later. Never. \n\nCovid and TV tutorials on how to wash hands were her last socially acceptable opportunity to learn this ancestral trick. But after she had a kid, her habits never improved",
   "created_utc": 1697509713,
   "score": 183,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57he9t",
   "message": "I have seen several people bring food that is supposed to be cold or hot and leave it at their desk all morning so I’d say any of those. I usually just eat the chips and salsa.",
   "created_utc": 1697510310,
   "score": 195,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57ei86",
   "message": "Supposedly ambrosia, but it was just Cool Whip with those red and green candied cherries they sell around Christmas. Georgetown University faculty party.",
   "created_utc": 1697509059,
   "score": 96,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57p039",
   "message": "Went to a work party where someone took a pot of overcooked and dried-out spaghetti and plopped the cheapest canned bean chili on it and called it Cincinnati Chili. As somebody who lived in Cincy for a few years, I wanted to hunt that person down and punch them in the mouth so bad.",
   "created_utc": 1697513788,
   "score": 91,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57q63j",
   "message": "Does Thanksgiving count? One year our small apartment complex came together for potluck dinner. A couple people had relatives, including someone’s older aunt. For dessert, one of the neighbors made a lime jello mold, but used weed-infused vodka. He was VERY clear about it to everyone. Some ate it, some didn’t. The older aunt knowingly had some. “Aw hell, why not?” She declared. That old auntie was the most engaging and entertaining person for like 20 minutes. Absolutely hilarious, owning the room with stories, and just loving life. Then she quickly snuck into a bedroom and immediately crashed out. To this day (if she’s still alive), I wonder if she considered that jello good or horrible.",
   "created_utc": 1697514389,
   "score": 171,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57l418",
   "message": "Chili with a sock in it. An actual sock. She called it “dirty sock chili.” I don’t think anyone tried it.",
   "created_utc": 1697511936,
   "score": 169,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57npi8",
   "message": "Once at a church potluck, a lady made chicken noodle soup, but instead of chicken it was raccoon. She didn’t tell anyone. We found out because her sons were laughing and we finally got them to tell us why 🤠👍🏼",
   "created_utc": 1697513151,
   "score": 169,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57sobs",
   "message": "A work colleague brought in a half filled casserole dish of little smokies (mini cocktail sausages, probably made up of 2+ animals) to a potluck. I asked her about the recipe and she said that she didn’t know.  Apparently they were leftovers from a 3 day camping trip she had in eastern Washington.  That means they were prepared by someone else at some outdoor site, picked over, and then packaged up (hopefully in a cooler? But who knows) and driven at least 5 hours through a mountain pass before they ended up on our conference room table in Seattle.  Blech.",
   "created_utc": 1697515743,
   "score": 167,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57os3a",
   "message": "When I was in high school we had an \"around the world\" day and we were tasked to get in a group and make a dish from a chosen country. My group cooked at one girl's house... the condensed milk seemed a little weird but we used it anyways. As we were cleaning up we saw the can was 5 years expired but it was too late. My group was afraid to taste test it.   \n\n\nAlmost every kid had explosive diarrhea within a few mins of Around the World Day ending. Some were crying. Nobody knew who poisoned the school but I'm suspicious it was us.",
   "created_utc": 1697513677,
   "score": 220,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57j8pb",
   "message": "“Corn salad” canned corn, crushed doritos, shredded cheddar cheese, shredded carrots, \u0026amp; thousand island dressing. Orange abomination. Did not try.",
   "created_utc": 1697511116,
   "score": 157,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57i7z7",
   "message": "My in laws have 2 holiday potlucks on holidays. Noon and 5 with 2 different sides of the family.\n\nEvery holiday for the 5 pm she reserves the leftovers from the noon potluck every time. Dip that has been double dipped, casserole that hasn’t been stored a safe temp- you betcha!",
   "created_utc": 1697510674,
   "score": 156,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57ocqi",
   "message": "Calf liver raisin casserole.",
   "created_utc": 1697513465,
   "score": 74,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56w4eq",
   "message": "Chicken soup 🍲…… but not delicious chicken soup! This was a putrid green colored broth with an entire chicken in it! Organs! Bones! Skin! Whole chicken just plopped in and cooked. It was gross",
   "created_utc": 1697501483,
   "score": 64,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56wkqr",
   "message": "Dude made chili on Saturday for the potluck on Thursday.  Fuck you, Larry.",
   "created_utc": 1697501671,
   "score": 38,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57jw4b",
   "message": "Not really a pot luck, but,  a person I used to work with would bring baked goods to quarterly meetings she conducted. Sometimes we'd go in as a team and sometimes we'd go1:1. Everyone would rave about her baked goods, but all I could taste was moth balls. She lived in an old house. I think she had moth balls in her cupboards to keep mice away.  It happened the first time, I thought I was imagining it. The second time I tasted it again. Moth balls are poisonous so I had to discreetly spit it out! In later years I had to politely decline her baked goods.",
   "created_utc": 1697511392,
   "score": 139,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57hrt8",
   "message": "Chocolate covered shrimp. No, not mole sauce. Just sweet chocolate sauce.",
   "created_utc": 1697510477,
   "score": 247,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57jujf",
   "message": "We had a Buche de Noel baking contest in French class in high school and one girl brought one in that when the teacher cut it had a bunch of hair baked through it. This was my first experience with “never trust what someone else baked at home unless you’ve seen their kitchen”",
   "created_utc": 1697511373,
   "score": 72,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57fuag",
   "message": "My Cambodian coworker brought chicken feet. I felt bad for him because no one would try them.   I mustard up the courage and had one.  It is the best part of the chicken.   10 out of 10 need to try.",
   "created_utc": 1697509640,
   "score": 227,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57txz5",
   "message": "We used to do a lot of dept breakfast pot lucks.  We'd bring things to make quesadillas and other goods, there was always yogurt, boiled eggs, fresh fruit, etc.  There was this one coworker who would ALWAYS complain.  \"Oh I can't eat that\" \"Oh I don't like that\" or if it were a little ethnic, like a Chinese bao \"Oh, I don't trust that.\"\n\nSo one pot luck were like, how bout we all chip in and you go out and buy breakfast potluck items?  What does she get?  All sweets.  Those gross super frosted cookies, jelly bellies, random breads with no spread or anything to eat it with, but it was mostly just sweets.  None of us ate any of it and she took it all home.  Fucking Jessica.",
   "created_utc": 1697516467,
   "score": 65,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k5793a2",
   "message": "Spaghetti with about cup of cat hair mixed in. 🤮",
   "created_utc": 1697506769,
   "score": 177,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57ijuj",
   "message": "We were having an outdoor barbecue and someone decided that it would be a good idea to bring sushi aside from that being gross as it was outdoors in the summer. It gets worse instead of buying it like a normal person who doesn’t know how to make sushi would do she decided to wing it got some salmon from Costco cut it up into bite-size pieces didn’t cook it at all. And brought it on a floral tray with the skin still on it no rice, cucumber any other thing that one would normally put in a sushi roll just raw skin on salmon chunks in 90° heat all day, not a single one of those things got eaten.",
   "created_utc": 1697510819,
   "score": 114,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k56v2wc",
   "message": "Surstromming to a potluck where they were the only Scandinavian",
   "created_utc": 1697501049,
   "score": 18,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k573na4",
   "message": "There was one in my office many years ago that I still remember. I wasn't even involved, it was a team nearby doing a taco potluck. There was a crockpot of ground beef that looked and smelled like cat food. I heard someone from across the office ask, ew why's it so wet?",
   "created_utc": 1697504522,
   "score": 148,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57pjbf",
   "message": "Orange Rolls. For those that don't know these are cinnamon rolls that have orange zest or extract in the dough recipe. Usually delicious.\n\n**This maniac took a cake pan, poured orange juice in it. Dropped Biscuit dough in it and then baked it.**",
   "created_utc": 1697514060,
   "score": 147,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57fkw9",
   "message": "Someone brought [little sweet peppers stuffed with something creamy and topped with sprinkles](https://imgur.com/a/FNpx8oQ) to a church potluck I attended.",
   "created_utc": 1697509526,
   "score": 51,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57m1sv",
   "message": "I have two. They are the reasons I never participated in another pot luck again.   \n1.   A woman who I knew from outside the job. She brought a head of lettuce, tomatoes, etc. At lunch time in front of everyone she went into the restroom to use the sink to make her green salad.\n\n2.   A female administrator for public services brought a crock pot of some thick bubbling liquid. It was a grey color. Every pot luck it was the same grey bubbling goo. No one ever knew what it was.   \nforgot one more. Young woman who only wore St. John suits, she told everyone if asked or not. She brought a box of corn flakes.",
   "created_utc": 1697512375,
   "score": 131,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57ml3n",
   "message": "My mom always made this layered salad that was like normal salad with lettuce, spinach, tomatoes, ect  but then layered miracle whip, red jello, and topped with cheese. I've never tasted it but the jello mayo sends a fright up my spine. My mom is not from Minnesota",
   "created_utc": 1697512631,
   "score": 89,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k57c1dv",
   "message": "Her husband. Dude had no social skills. Took his shoes and socks off and was picking at his feet.",
   "created_utc": 1697508009,
   "score": 180,
   "submission_id": "179je8z"
  },
  {
   "comment_id": "k591685",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "179je8z"
  }
 ]
}