{
 "submission_id": "17a0keg",
 "title": "Which musician has the worst toxic fan base ?",
 "selftext": "",
 "created_utc": 1697555406,
 "permalink": "/r/AskReddit/comments/17a0keg/which_musician_has_the_worst_toxic_fan_base/",
 "score": 220,
 "url": "https://www.reddit.com/r/AskReddit/comments/17a0keg/which_musician_has_the_worst_toxic_fan_base/",
 "comments": [
  {
   "comment_id": "k5a62bv",
   "message": "I once commented something mildly critical of Jared Leto (I essentially said that his fat suit in House of Gucci looked bad) and I was getting weirdly vindictive replies/messages about it for days on end.  His fanbase is fucking intense.",
   "created_utc": 1697562531,
   "score": 60,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k59n4c3",
   "message": "Chris Brown. His fans constantly defend him despite him being a colossal piece of shit.",
   "created_utc": 1697555622,
   "score": 102,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5adphs",
   "message": "The wiggles, their fan base just acts like a bunch of children.",
   "created_utc": 1697565236,
   "score": 51,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k59p3cb",
   "message": "Most k-popgroups. It wasn't fun when idols were mostly known in Asia and it certainly didn't get any better after it went international.",
   "created_utc": 1697556354,
   "score": 203,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k59nx69",
   "message": "K-pop fanbase seems mad sometimes",
   "created_utc": 1697555921,
   "score": 55,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5arbva",
   "message": "I feel uniquely qualified here, though my answer is dated.\n\nIn the '90s and early 2000s, I worked for AOL managing their music forums.  Full time, paid, etc.  Moderators monitored all boards, every post, but didn't mete out punishment.  Instead, we could remove a post if it was a clear TOS (Terms of Service) violation, and report it to the TOS department and they'd take it from there.  But that was usually limited to any swear harder than \"damn\" or \"hell.\"  (Early internet services were ridiculous.)  We could remove particularly bad flame/troll posts, but it was conditional.  The person could appeal and TOS might reinstate it, because without the overall context, it looked okay.\n\nThat meant we to address trolling and flaming, we had to diplomat the shit out of it and... build cases.  I had mail threads, files, paper printouts of \"cases\" I presented in hopes of getting a troll (aka \"disruptive party\") removed from the area or banned from the service.  (Which was always temporary. ALWAYS.)  AOL was very reluctant to take any action against that kind of behavior, to the point where I lost a friend and had people quit over it.  (Hi, LoneStarK.)  I spent a ridiculous amount of time trying to talk members into \"playing nice.\"  \n\nThis was required of us on every board, every forum, while I was there.  No matter how bad it was, we had to keep doing this.  \n\nExcept for one board.\n\nIt had the most vile flame wars, the most hateful \"fans,\" the most nasty gatekeeping.  They absolutely hated each other and they kept coming back for more.  Without the ability to mute, ban, or lock, and with limited clearance to remove posts, I could spend a full day trying to quell just one of their weekly flame wars.  It was hell.  Even TOS got so sick of it that they finally told me to stop moderating them for anything other than swearing and death threats.  It was just too much work for everyone, but the artist was huge so they didn't want to close the board, I guess?  Out of hundreds of boards, it's the only one where I ever got that direction.\n\nThat board was not a metal group.  It was not rap.  It was not 2 Live Crew or Motley Crue, it was not Ted Nugent, it was not even a controversial artist.   \n\nIt was Barry fuckin' Manilow.\n\nI've been on the internet for over 30 years and involved in offline fandom since well before then, and those Manilow fans were the nastiest, meanest, most hateful, acid-spitting, derogatory, aggressive, malicious group of fans I have ever seen anywhere in my 30+ years on the internet and lifetime in offline fandom.\n\nBarry is great, but his fans gave me scars.\n\nEDIT: Shout out to the NCMCs, Dazy, and the amazing, life-changing DJ Dre.  Much love.",
   "created_utc": 1697570028,
   "score": 100,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5agjtc",
   "message": "Chris Brown. He shouldn’t even have fans.",
   "created_utc": 1697566244,
   "score": 63,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5afls8",
   "message": "The general fanbase of Taylor Swift is fine, but segments of the hardcore fanbase—the Swifties—that are in a parasocial relationship with Swift, are fucking cultists.",
   "created_utc": 1697565909,
   "score": 57,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a70lu",
   "message": "Cannot stand Travis Scott fans.",
   "created_utc": 1697562875,
   "score": 74,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5ajxi7",
   "message": "Wagner",
   "created_utc": 1697567423,
   "score": 53,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5ab63v",
   "message": "gg alin",
   "created_utc": 1697564350,
   "score": 43,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a773r",
   "message": "You know whose fan base is surprisingly awful (at least at live shows)\n\nMotherfucking Wilco.\n\nFor every regular, chill person who enjoys extremely intricate indie dad rock about crushing sadness, there have to be 50 boomers/older gen x-ers who literally never go out except to Wilco shows and as a result act a got damn fool the entire time.\n\nEveryone screaming out bad jokes throughout the show trying to banter with the band in a crowd of 5k people (“this next one’s a new song” cue 100 middle age dads all yelling “UH OHHH!”), ALL of them getting piss drunk on a Wednesday and complaining about the drive back to the suburbs when you’re trying to get out at the end \n\nWas shocked the last time I saw them at an indoor venue what a mouthbreather crowd they attract",
   "created_utc": 1697562939,
   "score": 163,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k59q8oa",
   "message": "Smashing pumpkin fans.  Specifically the two ‘super fans’ who sat behind me at a rock festival and bad mouthed all the others bands and anyone who enjoyed them.   They said things like “ these kids won’t know what to do when pumpkins comes on stage”.  “ I can’t believe they like this trash music”. “Pumpkins is on such another level”\n\nSo annoyingly pretentious.",
   "created_utc": 1697556776,
   "score": 81,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a59da",
   "message": "As a KISS fan, KISS fans",
   "created_utc": 1697562241,
   "score": 108,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5ar1t7",
   "message": "Beyonce and Taylor Swift have some really toxic fan bases that make it their whole personalities. They're so delusional with how important an artist is to them and how much they have to \"stick up for them\" when they have no clue you even exist.",
   "created_utc": 1697569929,
   "score": 151,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5ajvrt",
   "message": "As a fan of both Tool and Death Grips, their fan bases are absolutely insufferable.",
   "created_utc": 1697567407,
   "score": 108,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5amicw",
   "message": "Tool fans, yikes. Maynard is literally just a guy.",
   "created_utc": 1697568328,
   "score": 87,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5ahl3h",
   "message": "Kind of a throwback, but I had an acquaintance who was really into heavy metal (as am I) and he used to brag about how he used to beat people up for wearing Poison shirts, and now they open for bands he likes (Motley Crue).\n\nFirst of all, if you ever thought MC and Poison were that different, that's bizarre. Second, if you've ever beaten someone up for wearing the shirt of a band you don't like you're at least a bully and probably some kind of psycho",
   "created_utc": 1697566608,
   "score": 108,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a6l9w",
   "message": "Jared Leto",
   "created_utc": 1697562722,
   "score": 248,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5akv5k",
   "message": "The Barbs are the worst fans imaginable.",
   "created_utc": 1697567749,
   "score": 215,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a53qi",
   "message": "KANYE.... they will defend him from anything... its gross.",
   "created_utc": 1697562184,
   "score": 67,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a5jlg",
   "message": "The K-pop fan base. I don't understand Korean so I don't listen to K-pop. I feel the same way about music in any language I don't know. A K pop fan called me a racist and xenophobic because I said I don't like K-pop coz I don't understand Korean. I received death threats and rape threats because I once said that I don't like BTS. I decided to give it a shot and I liked Blood Sweat and Tears by BTS and all these fans called me a fake fan. Never took interest in kpop again. Y'all won't let me live peacefully and express my opinion about my likes and disliked and if someone shows interest you wanna gatekeep the community. I have never met a non toxic kpop fan ik they exist but I've never come across one.",
   "created_utc": 1697562344,
   "score": 177,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a8a9a",
   "message": "Kanye West’s fans are something else. Bro could fart into the mic and call the album done yet his fans would defend it say “YoU dOn’T gEt IT!!1!”\n\nI should also clarify that I’m not saying Kanye is bad, in fact he’s one of my favorite musicians.",
   "created_utc": 1697563327,
   "score": 9,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a6vhd",
   "message": "Tool apparently.  When the lead of the band hates his fans you know it's an issue. Edit:  for the record no issue with Tool and think MJK is a genius musician",
   "created_utc": 1697562823,
   "score": 215,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5b5fcu",
   "message": "Chris Brown? Bunch of fans of women abuse.",
   "created_utc": 1697574927,
   "score": 74,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5ahn59",
   "message": "The Dave Matthews Band fanbase in the late 90s was pretty unbearable.",
   "created_utc": 1697566628,
   "score": 179,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k59n2n7",
   "message": "Beyonce",
   "created_utc": 1697555604,
   "score": 24,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5agquw",
   "message": "Kanye fans. “Erm you do know your favorite music wouldn’t exist without Kanye right??” so annoying",
   "created_utc": 1697566312,
   "score": 244,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5bu27w",
   "message": "Marilyn Manson. \n\nIf you breathe a word about what he’s done to women ….",
   "created_utc": 1697584411,
   "score": 44,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k59sdju",
   "message": "Probably that Norwegian metal singer who burned all those churches and killed his rival.",
   "created_utc": 1697557556,
   "score": 201,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a53zt",
   "message": "Honorable mention for a small size but apparently Death Grips fans are losing their fucking minds? Apparently it’s a “meme“ to dress in a propeller hat, pull out your dick and piss in the middle of the crowd?",
   "created_utc": 1697562186,
   "score": 169,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5axiic",
   "message": "Any fan base that identifies themselves through a strange name. \n\nSwifties, beliebers, Bey Hives, Stylers…",
   "created_utc": 1697572186,
   "score": 171,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5b808e",
   "message": "Nicki Minaj",
   "created_utc": 1697575830,
   "score": 19,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5beubq",
   "message": "Not sure if the worst, but in terms of being the most toxic towards the person they follow- Lady Gaga fans\n\nAnd I say this as one of her fans. The amount of criticism she gets from them for everything she does is insane. \n\nNot to mention she and her team constantly get attacked for not “promoting her music enough” or in “in the right way” because they think getting number 1’s on pointless charts means something to an artist like her",
   "created_utc": 1697578326,
   "score": 19,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5b2rp4",
   "message": "Hanson has by far the meanest fans that I've experienced.  They don't just hate people who aren't Hanson fans; they also hate other Hanson fans.  At a Hanson show, they view everyone else as \"competition\" and are complete bitches to each other.  At metal shows we pick each other up when we fall, but Hanson fans will kick you while you're down and use you as a step to get closer to the stage.",
   "created_utc": 1697574004,
   "score": 18,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5asptx",
   "message": "Even though I’m a Swiftie, Swifties are a fucking cult",
   "created_utc": 1697570517,
   "score": 89,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k59zavp",
   "message": "Travis Scott, his fans are bonkers with how they worship him. Someone needs to stop his shitty career in music.",
   "created_utc": 1697560093,
   "score": 153,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a5oxp",
   "message": "Ted Nugent/Kid Rock",
   "created_utc": 1697562399,
   "score": 111,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5b4f3w",
   "message": "Tiny Tim.  Never mess with a Tiny Tim fan.  They will f*** you up.",
   "created_utc": 1697574575,
   "score": 17,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5a8dkk",
   "message": "Ariana grande",
   "created_utc": 1697563361,
   "score": 90,
   "submission_id": "17a0keg"
  },
  {
   "comment_id": "k5cfk35",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17a0keg"
  }
 ]
}