{
 "submission_id": "17b3eqb",
 "title": "What’s the most unexpected sex you’ve ever had?",
 "selftext": "",
 "created_utc": 1697668405,
 "permalink": "/r/AskReddit/comments/17b3eqb/whats_the_most_unexpected_sex_youve_ever_had/",
 "score": 148,
 "url": "https://www.reddit.com/r/AskReddit/comments/17b3eqb/whats_the_most_unexpected_sex_youve_ever_had/",
 "comments": [
  {
   "comment_id": "k5i9jpi",
   "message": "up against a tree waiting for a train to pass.  ( at night, in city)",
   "created_utc": 1697691730,
   "score": 90,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ig1iy",
   "message": "I was hammered at a friends house, saw a cute girl at the party and clocked her as cute but didn't really flirt with her much or anything. Played beer pong - played some drinking games. 4 am rolls around I lay on his futon to sleep.   \n\n\nCute girl crawls into the futon with me, little spoons, rubs her ass on me and then we go at it. Morning comes and I realize one of the people sleeping on the floor 5 feet from us was a dude who apparently had a huge crush on her. Then I realize a week later that she was the sister of a girl who had a crush on me.  \n\n\nWhat a mess.",
   "created_utc": 1697696089,
   "score": 150,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h7k9v",
   "message": "Slightly older woman drove me home from work (closing shift at Wendy’s) one night. Ended up fucking her on the floor in the back of her minivan, parked in the street in front of my house.",
   "created_utc": 1697673701,
   "score": 88,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i97wq",
   "message": "Got in a very minor fender bender where I rear-ended this gal’s car in the parking lot of Whataburger. Totally my fault but very minor cosmetic damage. I apologize profusely, give her my insurance info, and somehow we get to talking. She invites me back to hers, and the rest is history.",
   "created_utc": 1697691521,
   "score": 176,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ibn7v",
   "message": "I was at a bar near my apartment. I went there frequently, but usually kept to myself, just drank my beers and monopolized the juke box.  Two ladies I had never seen before were there together. At closing time, one of then came up to me and asked where I was going to next and I said I was going home. It didn't really occur to me to say anything else so after a brief awkward silence, she said, \"You don't get picked in bars up alot, huh?\" I said no and she said, \"Well tonight you're going home with me.\"  The car ride was a little bit weird at first because I really didn't know anything about her, except that I was going back to her place to bang her. In the morning, she asked me to take her to the house of the guy her friend had picked up so we could pick up her friend and take them both back to the car they had come to the bar in. They discussed their evenings right there in the car in front of me. Mine spoke favorably of her time with me, but her friend was less pleased with hers. So that was nice.",
   "created_utc": 1697693071,
   "score": 66,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iji9t",
   "message": "Weirdly enough, the most unexpected sex I've ever had is with my long time gf. Though it was our first time together.\n\nI've known her since 5th grade. I got into a private high school, so we lost touch after junior high. Years later (in my early 20's) I commented on one of her social media posts and then, the very next day, I ran into her at a bar in the town we grew up in. Total coincidence. We were hitting it off, but she had to work at 6am the next morning.\n\nSo, two days later we actually meet up in the afternoon at a secluded nature trail to walk and talk and smoke some weed. Didn't make it too far before we found a bench and started making out....then she started sucking me off, but made it clear that \"we're not having sex HERE\" (I never asked)....30 seconds later she looks up at me, then stands up and says \"okay...\" and undoes her jeans and bends over the bench. \n\nFuckin glorious. We're still together. Going on 14 years.",
   "created_utc": 1697698637,
   "score": 226,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h8fi4",
   "message": "I went to get a tattoo in a foreign country. The woman who did the ink was nervous around me, but I just assumed it was because I barely spoke her language. After she finished we went for pizza and a beer, then I walked her back to her shop for her next job. When I left I asked her to text me the pics of the tattoo because I could barely see it (was on my back).\n\nLater that night she said I should walk over to her place so she could take pictures of the ink with better lighting. I headed over, and when I got to her place she just jumped into my arms and started kissing me!\n\nWe fucked for two weeks, then parted ways. I can never get another tattoo, that experience was too good!",
   "created_utc": 1697674069,
   "score": 158,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i54qu",
   "message": "Took a first date to the movies, she took me into the handicap bathroom got sucked off when we got out there was a couple waiting to enter I suspect they were gonna do the same lol",
   "created_utc": 1697689064,
   "score": 219,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h2fy3",
   "message": "Hung out with a friend who had just broke up with her boyfriend, didn’t really think anything of it as I wasn’t actively pursuing her. She went to the bathroom and came back out only wearing her underwear. It was then that I pursued.",
   "created_utc": 1697671533,
   "score": 52,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h5kc5",
   "message": "Got home from the bar one night and my roommate had some coworkers over whom I had never met. Immediately one of the girls asked me if I wanted to go to her house and I said sure. I didn’t get her name until the next morning.",
   "created_utc": 1697672852,
   "score": 12,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h380f",
   "message": "I person I'd been non-sexual friends with for a really long time just straight up asked me if I'd like to do it with her, she was single and curious about it. I couldn't quite believe my eyes. But it worked out great!",
   "created_utc": 1697671861,
   "score": 239,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gvogq",
   "message": "Visited my highschool best friend after seeing him at our 10 year class reunion. Ended up having sex with his older sister while he went out for beer",
   "created_utc": 1697668676,
   "score": 98,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iaotq",
   "message": "I was cooking lunch while unexpectedly snowed in up in the mountains with my long term friend from so long I can't remember when we met. We were running out of provisions and she just said, \"hey, we've never had sex have we?\"\n\nDidn't end up dating. Didn't get weird. Just sorta happened.",
   "created_utc": 1697692449,
   "score": 155,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5hrf28",
   "message": "Had met this girl on the train and we traded numbers. She calls me up, she decides to come over. At the time, I was in between jobs, recently left home and was rooming with my brother in a two bedroom apartment. She came over, she smelled all good but nothing really stuck out as a hint. She ended up given me an unsolicited hand job but put it away when she thought she heard someone. Fearing a serious case of blue balls, I was dreading what was going to NOT happennext until she told me to lean over the couch where we were sitting to the table bhind us and reach for her bag. In those few seconds i was distracted, she pulled my joggers down and was sucking so fast and hard if i lasted three minutes I woud be lying. She got off on that we were banging all night right after that",
   "created_utc": 1697682178,
   "score": 20,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5hz9e2",
   "message": "My former boss. Met up with her and some former coworkers right as the lockdown was ending, we all had some drinks, and then when I told her I was gonna head out she followed me to my car and said “…but if you leave now, we won’t be able to have sex…” and grabbed my dick. We both basically went three months without seeing a fuckable member of the opposite sex and it was a one time thing that didn’t go anywhere, but it’s definitely not an experience I regret.",
   "created_utc": 1697685892,
   "score": 101,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ib7nc",
   "message": "I was just friends with my current partner for a little while - though we met on hinge but we hit it off as good friends.\n\nWhen I met him I was attracted to him in a I like him but don’t know if I want to fuck him way but when we touched it was electric.\n\nI went to his apartment after a concert and we were hanging out watching tv, I wore a turtle neck and boots so I wouldn’t be tempted but… we kissed and it was freaking magic and next thing you know we were on the couch with his head between my legs for like 30 minutes and then the grand finale…. It was fast but holy shit it was good.  He said I had to come back and let him redeem himself because he finished too fast and I’ve been going back for about a year now lol.",
   "created_utc": 1697692789,
   "score": 74,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gyvi5",
   "message": "I was staying at my friend’s house and his female friend was over. We hung out as a group a few times, but never together.\nI went to take a shit and I got a message saying “why do I wanna kiss you so bad?”\nTold her meet me in the bedroom in 5 mins 😭",
   "created_utc": 1697670018,
   "score": 195,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h2sr8",
   "message": "My best friends older sister. I was 22 on Christmas eve at my friends house. We were in a group of people and no one wanted to go in the hot tub with me but his sister. She was probably around 29 and pretty cute. Our friends always tried to get at her but she denied them all. Once in the hot tub, we're talking and out of nowhere we just start making out,. Next thing I know, she's heading to her room and tells me to come. I go to ask my friend but before I even said anything, he said go for it bro, just dont tell me about it. I go to knock on her door and before my knuckle even hit the door, she pulled me in. We fucked all night and I still can't believe that happened lol",
   "created_utc": 1697671683,
   "score": 19,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ib7is",
   "message": "Some girl randomly send me a Snapchat after adding me. Didn’t know who she was so I asked why she added me, she said it was from quick add. Asked her where she was from she said the same city as me. Next thing you know she’s sending me nudes. I’m like nah this is some kinda scam so I just was like “yeah you should quit playing before I send you a Uber” the next message was her address. She lived about 6 miles from me. Sent her a Uber (down the block from my house I’m not crazy) waited to see her get out alone and then walked back to my house, had sex a few times before she left. Still craziest thing that’s ever happened to me but no doubt I probably won’t do that again\n\nJust wanted to add that we actually did become friends and occasionally hangout but I guess she had just gotten of a relationship when she added me and I just happen to the lucky guy that was cute enough for her to say “fuck standards”",
   "created_utc": 1697692787,
   "score": 173,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gz344",
   "message": "A friend and I were hanging one night when an ex of hers got a bit mouthy when he saw us together. He eventually fucks off because he realizes I'm not going to stop at talking. We decide to cut the night short because now we're both too frazzled to have fun. \n\nWe head back to her place and the moment the door is closes, she jumps on me. Apparently she got turned on by me defending her lol",
   "created_utc": 1697670107,
   "score": 237,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i888n",
   "message": "losing my virginity, im not even kidding when i say my friend said “if you sneak out w us i’ll let you and my gf fuck” and he did.",
   "created_utc": 1697690902,
   "score": 247,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ilewx",
   "message": "Unexpected? Maybe not that much but it was sure for me as I wasn't expecting that outcome at all. Here is the story:\n\nTen years ago, I worked as a bartender in an international bar in Japan(was a student there from the EU and needed money). There was this co-worker – cute, but I always thought, out of my league(even with the foreigner card). One day, on a shift I asked her if she wanted to grab dinner at a Mexican restaurant in the centre. To my surprise, she said yes.\n\nWe enjoyed some really nice food and good chats. Walking towards the station after I wasn't quite ready to call it a night yet and pointed at a Karaoke bar. All of a sudden she got really animated so we went there for a good 2 hours.\n\nNext, I offered that we could taste a wine from my homeland that I had at my flat so we jumped in a taxi and continued our chats on my balcony.\n\nI mean at that point I was feeling so calm and happy. City views, cigarettes, and a beautiful girl. The next moment she sat on my lap and we kissed for the next hour there. She led me inside after and the rest is history.\n\nI do relive this moment still up to this day many times. The whole night was just so magical and perfect.",
   "created_utc": 1697700074,
   "score": 249,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ibn6a",
   "message": "Flight from Miami to L.A. chatted up the gal next to me and 15 minutes in she says “follow me to the bathroom. It was a wide body plane with 2 longer bathrooms at the back. Good times but found out after that she was flying in to see her fiancé.",
   "created_utc": 1697693070,
   "score": 215,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h6pse",
   "message": "Went on vacation, hit it off with the tour guide. We ended up chatting well after midnight. \nI was in his bed the next day. It was the best I had after two failed relationships. We still talk almost everyday a year and a half later",
   "created_utc": 1697673341,
   "score": 188,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5icq18",
   "message": "This girl I knew who was real cute, a little on the big side but I always thought she was cute.\n\nWe had talked a few times and I think it was flirtatious but I wasn't sure because she was just one of those social butterfly types who talked to everybody. \n\nAnyway we were at this party at a work friend's house and she sits down next to me on the couch, and I see she's got this tattoo on her thigh, and she notices me looking at it. She says \"I spent a summer in Bangladesh. It's Bengali for friendship. I think you and me should be friends, how would you feel about that?\"\n\nAt this point I'm pretty sure it's going somewhere so I'm like \"Yeah, I think you're cool. What if I asked you out sometime?\" And she goes \"How about now?\" I'm like sure, where to? \n\n\"How about your house?\" And she takes my hand and puts it on her thigh, high up. Not touching her between her legs, but so close I could feel the heat coming off of her down there. \n\nSo we went to my house and had sex I think 5 times over the span of 10 or so hours, and it was amazing. Just instant chemistry. She was so soft and feminine but she was a fucking brick house.  Big hips and thighs and ass, and when she got on top of me and started riding I was like \"holy shit this is why people love sex\" because I had never experienced that kind of intensity before. This chick could really throw down, I mean I was sore from the waist down for two days after.\n\nAnd I brought her home the next morning. No drama, no fuss. We hooked up a couple more times after that and stayed friends for several years, then she moved away. \n\nBut that was when I realized I liked bigger girls and started noticing them more and more, and then eventually I married one.",
   "created_utc": 1697693799,
   "score": 132,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gxodo",
   "message": "Either the time I was on a date with a girl, and she said, \"you ever just had a connection with someone right after meeting them?\" and then we uh, went to my car and did it.\n\nOr the time a decently close friend of mine was like, \"you know, you could totally have sex with me\"\n\nAnd I was like, \"Er... what? Uh... sure, we could do that\" and so we did",
   "created_utc": 1697669511,
   "score": 221,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ib47m",
   "message": "I met a girl in the gym. I saw her squat form was ass and she was clearly just starting so I gave her some pointers and we exchanged info. We saw each other again in the gym but this time a lot more touchy and flirty. Fast forward a week or so and I’m in the gym and she asks me to come find her she’s outside nearby and gives me a couple hints. Let me tell you how fast I jumped out the gym to go and find her. Took her back to my place showered and smashed. \n\nTldr: went to gym for weights ended up doing cardio at home",
   "created_utc": 1697692729,
   "score": 222,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iba2c",
   "message": "A hot blonde bartender in my small town didn’t believe men shaved their balls. I said I did and after a lot of disbelief, she said “prove it” and told me to show her. We went to the bathroom and I pulled down my pants. She lifted my dick to see and out of nowhere gave me a spectacular BJ…",
   "created_utc": 1697692833,
   "score": 149,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iiqil",
   "message": "I got laid at a chess tournament.  Asked me back to her hotel room and we drank then played strip chess. Cute girl, very petite, rated 2100, was better than me at chess.  I ended up completely naked before taking a game off of her.  Then we had fucking amazing sex.\n\nShe was from out of town and we had sex for the weekend (was a multiple day tournament), then sent nudes for a few months afterwards.",
   "created_utc": 1697698061,
   "score": 36,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5icdv7",
   "message": "A long time ago… the girl who babysat my kids on occasion offered to have her big brother come mow my lawn since I was a single mom and always either busy or broke. He showed up…18 and shirtless on a summer evening. He mowed the yard and said I didn’t have to pay him. I told him if he would come back after I went to the ATM and then got the kids to sleep I would give him some cash. He came back after sundown and we were talking, standing in my driveway in between our two parked cars. He was flirting and I was lonely and horny. We stated kissing and I had a dress on so we eventually ended up fucking right there in the driveway, with me leaning against my car and him holding my thighs",
   "created_utc": 1697693574,
   "score": 142,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ifq99",
   "message": "A friend of my roommates came over, my roommate left for work and she stayed. We were watching T.V. and just chatting, I don't remember exactly what I said, but it wasn't sexual or trying to come on to her. She looked me dead in the the eyes and said \"Fuck me right now.\" I\n was so surprised all I replied was\n \"wait,what?\"\n\"I want you to fuck me right now on the couch\"\nI was so shocked that, like an idiot, I said \"Like right now??\"\nFortunately, I quickly recovered and we ended up dating for a couple years after hooking up that day.. She would bring it up all the time, laughing at how she could still remember how shocked my face was.",
   "created_utc": 1697695867,
   "score": 8,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h6bsi",
   "message": "Like 2 weeks after I turned 18 I was hanging out with some friends in my room watching some movies and one of the girls there started talking about how I wouldn’t sleep with her right now. Which… obviously I was totally down. So we kicked everyone out of the room and went at it.",
   "created_utc": 1697673174,
   "score": 17,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gxcqn",
   "message": "In my car on a FIRST date.",
   "created_utc": 1697669379,
   "score": 117,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5hsmjt",
   "message": "It was phone sex with a chick that had the wrong number.",
   "created_utc": 1697682719,
   "score": 73,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5hrqs5",
   "message": "Went on a date with a girl to a bar then to a club. We got fairly drunk. She called us an Uber and I was assuming she was setting up 2 drop offs, one for me then her to be dropped off. We arrived at my apartment and to my surprise she got out of the car too and came with me to my room.",
   "created_utc": 1697682323,
   "score": 242,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i5xxe",
   "message": "Any of the sex I’ve ever had, I still can’t believe it",
   "created_utc": 1697689531,
   "score": 58,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iccv5",
   "message": "My grandma died many years ago. I was 15, the girl I did it with was like 17. Her mom is a close friend with my family, so they both went to the funeral.\n\nIt was late at night. We were falling asleep, so my uncle brought us to his house so we could take a nap and he went back to the funeral. \nWe talked a little bit, watched a couple of YouTube Ghost videos, and all of a sudden she said \"you know what? I really want to kiss you\". We started making out and well, you know the rest.\n\nThe next mourning I felt like shit because I slept with this girl just after my grandma passed away.",
   "created_utc": 1697693555,
   "score": 94,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i3c5n",
   "message": "Had a one night stand with a guy who turned out to be my grandmother's neighbour. Still says a cheery hi every time I visit. And has not stopped trying to ask me out on dinner dates. It's been 7 years since that one night stand.",
   "created_utc": 1697688055,
   "score": 145,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5igjnl",
   "message": "After reading these stories it's really making me regret not having more female friends",
   "created_utc": 1697696453,
   "score": 6,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h69p9",
   "message": "At a spa that had a coed steam room. It was during the day so it was pretty empty. We met in the steam room and got pretty flirtatious.  We teased each other in the steam room but ended up having sex in the women's change room.  First and only time I saw him.",
   "created_utc": 1697673149,
   "score": 76,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5hqy8f",
   "message": "Walking around a boat marina. Suddenly shes spreading her ass cheeks for me in public",
   "created_utc": 1697681972,
   "score": 131,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gytlj",
   "message": "Ran into ex at a target and we boinked in a dressing room",
   "created_utc": 1697669995,
   "score": 234,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h6qqr",
   "message": "In college I was at a pregame with my new girlfriend, everyone was getting ready to leave for the bars but I didn’t see her. Went looking and she was in the bathroom, pulled me in by my dick leaned up on the counter and basically put it right in. What a fun surprise",
   "created_utc": 1697673352,
   "score": 179,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5hrqdp",
   "message": "Every. Single. Time.",
   "created_utc": 1697682318,
   "score": 80,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ivl8w",
   "message": "Was 18 and at a party. A girl I'd had no interaction with all night just came upto me and flat out said \"take me upstairs now and fuck me\". Myself being extremely drunk and horny was only too happy to oblige. I think I spent about an hour eating her pussy out. No idea why. We ended up getting married and having 2 kids.",
   "created_utc": 1697708270,
   "score": 183,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i0d5z",
   "message": "Okay, so we went to the theaters early in the afternoon and couldn't stop feeling up on each other throughout the movie which was hot but disgusting when you're hearing about it instead of experiencing but he made me so wet and excited by just softly rubbing my thighs.. 😩\n\nNobody was around after the movie ended in the female bathroom that I couldn't resist but pull him in with me and got it on for one of the best nerve-wracking sex in my life. 😂",
   "created_utc": 1697686461,
   "score": 122,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gzrqr",
   "message": "with my ex girlfriend, we both wanted to have sex right now but we were at a family reunion, we went to the bathroom which was a room away from the kitchen where everyone was, two or three member of this family had doubts because her cheeks were red, it was insane when I think back",
   "created_utc": 1697670397,
   "score": 60,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iowuj",
   "message": "All sex is unexpected when your partner has incredibly low sex drive",
   "created_utc": 1697702887,
   "score": 62,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5icd2k",
   "message": "My 60 year old aunt's friend. She takes extremely good care of herself,  body is better than most 20 year olds, honestly.\n\nShe was going through heart ache, I was too. Ended up hanging out to share each other's sorrows in some weed and food.\n\nTo add a little dash more of the unexpected, she laughs hysterically when she orgasms.   Please people, if you have a quirk like that... Let someone know.   \n\nPretty sure I heard Mario lose a power up in her vag when she burst into a full on cackle.",
   "created_utc": 1697693559,
   "score": 4,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i874x",
   "message": "Was having a mini staycation with my then boyfriend at the time and unfortunately was on my period. He didn’t care, we barely made it to our hotel room before my clothes were off. Sometimes I wonder if we even closed the door all the way. Did it in the shower, laid a towel down on the bed, then again on the floor. Anyways, we’re married now.",
   "created_utc": 1697690883,
   "score": 49,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5icfzx",
   "message": "I had just moved into a new apartment with a few friends. I invited over a few girl friends one of which I knew but had maybe had a brief interaction or two with in highschool years prior. \n\nWe all party the night away and this girl and I at some point are sitting on the couch not even talking when she out of nowhere jumps on my lap and starts making out with me which progresses to me picking her up and carrying her to my room (making out the whole way) to do the deed. \n\nMy friends said that was the most big dick energy they’d ever seen. \n\nShe and I still never talk sometimes…",
   "created_utc": 1697693614,
   "score": 80,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ioi67",
   "message": "Hehe, well I certainly didn’t expect to go this long without having sex.",
   "created_utc": 1697702553,
   "score": 57,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iljr7",
   "message": "Years ago I was like maybe 29 or 30...just becoming the fetishized 'milf' age and at the same time I was responsible for a lot of things at the place I working (temporary assignment, I was there for like 9 months or something like that). \n\n\nOne random summer day some interns started and hR gave them the office tour and one guy who was maybe 22 or 23 was looking at me with his chin basically on the floor and I thought, you know what, yes, yes I would like to play out the boss lady gets fucked by the intern on her desk scenario.\n\n\nI asked him to pop back to my office to help me with something after the tour. He did. And said something like, the blinds are closed, just lock the door, Ill let you have this. \n\n\nBent over the desk, no condom. Total risky move.\nHe stayed for the summer, he fucked me everyday, sometimes I needed it twice a day. It was just so kinky and taboo and hot to be in the office where we could get caught. \n\nThere were rumors, but he left and my assignment came to an end.\n\nReally fun time!",
   "created_utc": 1697700179,
   "score": 36,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i40sa",
   "message": "Me and a coworker flirting on a smoke break. She was more interested in a throat break",
   "created_utc": 1697688437,
   "score": 21,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5inrux",
   "message": "Years ago, the head of my department (my supervisor’s boss) lived approximately two minutes down the road from me. She lived alone and had relocated away from her family for this job. Over the course of the prior year, we had gotten decently friendly and when we learned we lived so close to each other she started calling me to ask for help with things around the house or to come get a plate of something she had cooked. I was mostly single at the time with no kids so I had an abundance  of free time so I was always down to help out. We’ll eventually we just started hanging out sometimes. Watching movies or playing cards, pretty much just chilling. After a few months of this, one day she called me and asked if I wanted some orange juice that she had bought but didn’t like, it was too tart for her taste. I love OJ so I was absolutely going to snatch the carton. I got there about ten minutes later. She gives me the juice and we start chatting. We decided to watch the first episode of season three of Scandal. Half way through the episode she just looked at me and said, verbatim “let’s fuck”. I think I just nodded and we got down to business. 10/10 the best lay I had ever had up to that point in my life.  Up until that point I had never really thought of her like that. She was a friend and my boss and that was it. But the moment she opened those doors, I realized just how much of an absolute smokeshow she was. We did the deed and afterwards we had the conversation- we can’t tell anyone and this was just sex (her reasoning was that she was long way away from husband and kids, but she still had the need for physical intimacy and my reasoning was that I was a single 20 something year old that never turn down  a woman as awesome as her).  And honestly it never bled over into our professional or working relationship. I got no special treatment and I didn’t expect any. It was never awkward in the office but there were some slip ups and I do believe some people had suspicions. There were a couple of times where I referred to her by first name instead of Mrs. X and I think we were slightly more familiar with each other than would be expected. It’s really hard to be super formal with someone 100% of the time when you’ve seen your jizz run down their chin or they’ve sat on your face. And it wasn’t all sex all the time. She still called me just to come over to change a light bulb she couldn’t reach or I’d grab dinner for us both and we’d just watch a movie.  It was like we had three separate relationships : a professional relationship, a true friendship, and sexual relationship. \n\nFunny little anecdote  - After the first time I came inside of her instead of pulling out, she very seriously told me that she would buy the Plan B because she knew I how little I got paid. I don’t think I’ve laughed so hard in my laugh due to the totality of the ridiculousness that made the statement possible. \n\nShe died unexpectedly a few years ago after moving back home. She was way too young, with so much life she deserved to live. I miss her everyday, not because of the sex, but because she a was great person, great mentor, and great friend.",
   "created_utc": 1697701957,
   "score": 93,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5i1evw",
   "message": "I was eating my lunch at McDonald's randomly one day downtown. A pretty girl smiles at me and we strike up a conversation. I had nothing to do so we walked around all day doing random things and basically had a date/ hangout and  then went back to her place... it was a 2 night stand. Haven't heard from her since.",
   "created_utc": 1697687017,
   "score": 103,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ielwb",
   "message": "On holiday in Majorca, 17 at the time. Passing by a hotel at night there were a bunch of girls. Me and the boys passed by and started chatting, after a few minutes one of the girls asked me to come meet her friends in another part of the hotel complex. I was like \"ok\" then she took me to a secluded part of the gardens and pounced on me. Obviously I couldn't believe my luck and the rest is history.",
   "created_utc": 1697695085,
   "score": 56,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5ii2az",
   "message": "I was a team leader for a skit that we were about to present in about a week. So I arranged an after-school meeting at a nearby mall. We all left and then my Korean classmate did not understand anything at all so we met that same day (afternoon). Afterwards we decided to just chill by the 7/11 at a gas station. She bought a canned redhorse, we went to my place and we watched Naruto (Yup, coz I thought she’ll get it, my bad lol).\nAfterwards, I told her that she might want to take a shower before heading home so they won’t notice tjat she’s tipsy. So she went, came back with just a towel and laid on my bed. The rest is history.\nTurns out she actually thought, I asked her to shower coz I wanna do the deed. We did, but I regret it. Coz I saw her boyfriend when we did the skit. She also unfriended me on facebook.",
   "created_utc": 1697697558,
   "score": 100,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h46io",
   "message": "Stripper in the couch room while getting a lap dance 5 years ago after I moved back home after my most recent relationship imploded",
   "created_utc": 1697672265,
   "score": 139,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5j02u0",
   "message": "I was casually seeing this FWB for a couple of years. We orbited each other for a while with the same friend group, but the VERY first time she got it though my dense skull that she wanted to be more than just friends was quite the shock.\n\nWe were meeting up with our friends for dinner but she shows up to my place a few hours early dressed in this gorgeous sundress that was blue that faded to green on the way down. I did not expect her so early so when I opened the door I was just speechless. She just smiled, sauntered over to me put her arms around my neck and said,\n\n\"You're a really nice guy whose always made me laugh and been respectful to me...but for the next few hours I NEED you to disrespect me.\"\n\nI'm a firm believer in the sexist thing a woman can do is give her permission.",
   "created_utc": 1697711595,
   "score": 140,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5iaas5",
   "message": "A few months after my marriage ended I had a lunch date with a bumble match. The chemistry was real so we met again later the same day for our second date. She came hard grinding on me, but we stopped there because she had her period. It’s been 7 months now of one surprise after another and I can’t believe my luck 😊",
   "created_utc": 1697692201,
   "score": 47,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5icxmm",
   "message": "Was at a friend’s wedding recently and my fiancée says “So I noticed the doors on the stalls in the bathroom go all the way to the floor, you want to try something new?”\n\nMade it back just in time for the bouquet toss.",
   "created_utc": 1697693945,
   "score": 88,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5icfsr",
   "message": "My wife and I had sex on a golf course.  Something something 1 wood off the 10th hole.  It was fun, exciting, and spontaneous.",
   "created_utc": 1697693611,
   "score": 37,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5j5zol",
   "message": "Stayed up all with a friend trolling people on dating sites. One dude asked for nudes (it was her pics we were using), I started typing some smart-ass response but she said the guy was cute so she wanted to, so she sent me a bunch of her nudes and told me to send whatever I thought was the best. The conversation with the guy got more intense, talking about the type of sex she likes and the sex he likes. Eventually he asked how good she was at sucking dick, she said amazing, I told her it's been way too long since I had a good blowjob, so she casually told me to take it out. Ten minutes later, we were sending pics of her sucking my dick to the guy (he asked for them). Ended up having sex all night.",
   "created_utc": 1697715301,
   "score": 39,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5h53ir",
   "message": "I was homeless when I was a kid as a runaway and when I was like 17 I really liked this girl and I told her I’d take her out to eat so she wanted Sonic and I asked her what she wanted and called the restaurant and told them I’d came through earlier and they messed up my order and they replaced everything I said and after a few tater tots we were in the backseat of a 96 eagle talon in a sonic parking lot butt nekkid",
   "created_utc": 1697672655,
   "score": 119,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5gv7t0",
   "message": "An unexpected cumshot.",
   "created_utc": 1697668485,
   "score": 32,
   "submission_id": "17b3eqb"
  },
  {
   "comment_id": "k5jcgdx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17b3eqb"
  }
 ]
}