{
 "submission_id": "17b9ytc",
 "title": "What made you say \"Do people actually do this?\"",
 "selftext": "",
 "created_utc": 1697687458,
 "permalink": "/r/AskReddit/comments/17b9ytc/what_made_you_say_do_people_actually_do_this/",
 "score": 36,
 "url": "https://www.reddit.com/r/AskReddit/comments/17b9ytc/what_made_you_say_do_people_actually_do_this/",
 "comments": [
  {
   "comment_id": "k5jacm4",
   "message": "Stealing someone else's lunch from the fridge in the company break room.",
   "created_utc": 1697717657,
   "score": 104,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ijuxy",
   "message": "Job recruiters saying \"I'll call you back\" and not calling back, even when they say something like \"I'll call you back by Thursday and I want you to be ready to start working then\"",
   "created_utc": 1697698896,
   "score": 13,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ja4fg",
   "message": "I work at a movie theater and I’m in concessions , I sold this couple their items and a hotdog happened to be one thing I sold to them that night. The guy came back and claimed I just sold him a bun no dog. My manager was the one who was handling the complaint and confronted the guy on why he was lying. Their had been grease from the previous hotdog on that bun he had tried saying I sold him no hotdog in. Like why would you lie to get another hotdog, I would have understood if they dropped it grab another one but he really tried to say I sold it to him like that . People are low bruh",
   "created_utc": 1697717541,
   "score": 19,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i8qu1",
   "message": "Might be not applicable but those weird ass mobile game ads (badads). I always wonder if anyone actually plays the games after those ads.",
   "created_utc": 1697691221,
   "score": 180,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i3shs",
   "message": "Those videos where people are climbing insane structures without any safety line. I get sweaty palms just watching.",
   "created_utc": 1697688309,
   "score": 51,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jsiay",
   "message": "I worked in the veterinary field for years and recently switched to working in a criminal justice job where I regularly supervise felons. Multiple people have commented how it must be such a difference from working with puppies all day to working with felons. \n\nAnd they’re floored to find out that I get yelled at less in this job than I ever did in vet med. People are downright nasty to their veterinary team. And this really shocked people and I don’t think they believed me at first! \n\nBe nice to your animals veterinary team. I shouldn’t have to get a sigh of relief by working with felons.",
   "created_utc": 1697725591,
   "score": 103,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ix9bw",
   "message": "I live near a major city but don't go into the town centre often (I don't like crowds), I had to go one day and I had a phone call I'd been waiting for so I stood in a doorway when I answered. I wasn't really paying attention at first but there was a man on the floor nearby who was just writhing around like a zombie on the floor and his arms and legs just twisting around in such a painful way, he was groaning and his eyes were all the way back. I was frantic when I saw him. I sat with him and talked while I called an ambulance  but what really got me was when I looked up there were like 4 or 5 people filming him and me on the floor with him. I didn't know what to do except try to reassure him that help was coming\n\nI was gutted. This poor guy had taken too much of whatever it was and he was in hell, he was panicking and was struggling to breathe. They kept filming. While we were waiting a lady came over, told the 'filmers' to fuck off and told me she was a nurse and she took over. The paramedics arrived pretty quickly and they took him. I still wonder about that guy and wish he is well. \n\nPeople filming others in their weakest and darkest moments for clicks and views disgust me, especially in a medical emergency. The nurse told me it was probably Spice and that she sees it a lot.",
   "created_utc": 1697709572,
   "score": 179,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ii9wt",
   "message": "The first time I tried DoorDash and saw all the fees",
   "created_utc": 1697697714,
   "score": 203,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5isaab",
   "message": "Prince Albert piercings. Somebody told me about it. A hoop earing through the penis hole and out from the bottom of the penis head. \n\nAt the bar, friend came back with pee on his pants. We made fun of him. He said he couldn't help it because of his piecring. We didn't believe him, then he showed us. \n\nWhy? Why the fuck? Whyyyyy?",
   "created_utc": 1697705637,
   "score": 239,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5iezme",
   "message": "Seeing people go to bed with their shoes on",
   "created_utc": 1697695342,
   "score": 42,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jmqb8",
   "message": "Spelunking. “Hey guys I’m currently in makawakapeepoo caverns, 25 miles under the surface, and in order to get through this 6x6 inch opening I’m going to have to dislocate both my arms. A little earlier while I was slinking through I think a spider crawled up my ass and started laying eggs but that’s all good! I love doing what I love, see you guys and have a blessed day!”",
   "created_utc": 1697723276,
   "score": 36,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5j1gzn",
   "message": "Answer those \"Street interviewers\"",
   "created_utc": 1697712535,
   "score": 228,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5if7w0",
   "message": "Browsing apartments for rent on Zillow makes me thing \"can people actually afford any of this?\"",
   "created_utc": 1697695502,
   "score": 23,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5iao9d",
   "message": "Read all those posts on aita and all those other dubs and said do people actually just make up fake stories for internet points",
   "created_utc": 1697692438,
   "score": 67,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5k0ta1",
   "message": "Have a second child when their first one has lifelong disability, \"so that they can take care of their sibling later in life\"\n\nMy jaw hit the floor but everyone around me acted as if that's a common thing people do.\n\nAm I the weird one?   How can you dictate what your child will do later, especially if it is burdening them with something so significant??  How do you believe it'll just magically work out??? And most of all no one thought this was selfish and a little crazy...?",
   "created_utc": 1697728751,
   "score": 134,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i62ib",
   "message": "the popularity of the obviously fake/scripted clips/videos. how do people actually enjoy watching that? i just cannot wrap my head around it.",
   "created_utc": 1697689606,
   "score": 50,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jbzfj",
   "message": "Cave diving, or small cave exploring. I get the shakes just thinking about it",
   "created_utc": 1697718454,
   "score": 144,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5je7z6",
   "message": "People smearing excrement on walls at work.  These are allegedly sane adults.",
   "created_utc": 1697719527,
   "score": 133,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i5hpb",
   "message": "poop knife/reusable washable toilet cloth",
   "created_utc": 1697689266,
   "score": 56,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jh29k",
   "message": "Saw a video yesterday of some dude jumping on a trampoline made from barbed wire.",
   "created_utc": 1697720840,
   "score": 54,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i2me4",
   "message": "Some people actually shower with their clothes on",
   "created_utc": 1697687667,
   "score": 17,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i8ye7",
   "message": "Licking toilet seats just to get views.",
   "created_utc": 1697691354,
   "score": 255,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ih367",
   "message": "People clapping after an airplane lands",
   "created_utc": 1697696843,
   "score": 159,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ig70z",
   "message": "Buy worn panties from ladies such as r/sexsells",
   "created_utc": 1697696200,
   "score": 174,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jf3l6",
   "message": "Believing in the flat-earth-„theory“",
   "created_utc": 1697719939,
   "score": 133,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5j8uyn",
   "message": "I always wonder what people are watching random YouTube ads and thinking.. you know,that ad makes me want to buy that product! I think I'll go buy that product because that ad was so tempting!\n\nThey have the exact opposite effect on me.. same as radio and basically any other ad..",
   "created_utc": 1697716881,
   "score": 246,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ifrvv",
   "message": "Meet someone and sleep with them within the first hour of meeting.\n\nI've never been that charming and/or attractive that I could just get a woman into bed that easily.",
   "created_utc": 1697695898,
   "score": 30,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i72wy",
   "message": "bodily waste kinks",
   "created_utc": 1697690209,
   "score": 198,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5j3pdj",
   "message": "r/selffuck had me saying that",
   "created_utc": 1697713950,
   "score": 36,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jfi9m",
   "message": "Cut ties with their own children for the sake of their beliefs. Your own child!\nCrazy.",
   "created_utc": 1697720127,
   "score": 194,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jkk5l",
   "message": "Scat",
   "created_utc": 1697722369,
   "score": 33,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5j1xcb",
   "message": "Giving their hard earned money to streamers",
   "created_utc": 1697712826,
   "score": 27,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jrjck",
   "message": "My soon-to-be-ex-husband. For years, I was bringing home ALL the bacon, while still doing ALL the chores, while still handling the ENTIRE mental load, while simultaneously enduring his verbal, emotional, and psychological abuse (and his chronic unemployment, hoarding, alcoholism, and financial irresponsibility issues), while ALSO simultaneously dealing with chemo, immunotherapy, and annual surgeries for my autoimmune disease. \n\nI just left a month ago. I'm in therapy twice (sometimes thrice) a week. I ***SERIOUSLY*** don't understand how you can hand someone the white picket fence lifestyle on a silver platter - that THEY so desperately wanted - and then also treat that person like complete and total shit. If someone facilitated the same lifestyle for me that I gave him, I would be grateful as fuck to them, and I sure as shit wouldn't treat them like utter crap whenever they opened up doors to opportunities for me.",
   "created_utc": 1697725209,
   "score": 134,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ietqc",
   "message": "Tolerating corporate exploitation to the point of risking health",
   "created_utc": 1697695230,
   "score": 79,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5i90fq",
   "message": "When I went to college and met PhD students.",
   "created_utc": 1697691390,
   "score": 101,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5ievlr",
   "message": "I’m Mexican American from Los Angeles, the Coca Cola and hot cheetos in the morning type. When I would see white people on TV or in the movies drink milk with lunch or dinner I never thought anyone actually did that. Milk, to me, is a morning or night time with cookies or bread kind of drink. Then I met my boyfriend who is white. His whole family has no problem drinking milk with every meal. On our second date he made me spaghetti for dinner. I saw milk on the table and thought, this cannot be real. It was. Just different cultures I guess. I’m not gonna lie, I get kinda grossed out sometimes when we eat greasy food or just dinner in general and he’s downing some milk with his food. It just doesn’t seem appetizing to me. It was what his grandparents on both sides grew up doing, they passed it on to his parents, who passed it on to him. I’ve learned to live with it and he compromises sometimes by drinking something else. I just never thought anyone actually did that.",
   "created_utc": 1697695265,
   "score": 220,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jpd68",
   "message": "Working five days a week all year while having five days vacation per year.",
   "created_utc": 1697724341,
   "score": 19,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jyyla",
   "message": "Those people who tan their buttholes",
   "created_utc": 1697728053,
   "score": 20,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5k3ju0",
   "message": "Religiously follow a celebrity or politician.",
   "created_utc": 1697729769,
   "score": 16,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5irhce",
   "message": "I walked into a Buffalo Wild Wings restroom and I seen a guy pissing in the sink lol not a urinal or a toilet hell not even the floor but the sink and I said to myself how many dudes actually do this shit",
   "created_utc": 1697704988,
   "score": 124,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jn8qe",
   "message": "People who give people who wear masks a hard time about it.\n\nLeave them the fuck alone. There's a multitude of reasons why people are wearing them. They aren't bothering anyone and you're acting like bullies.",
   "created_utc": 1697723483,
   "score": 152,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5iax2l",
   "message": "Losing their foodstamps card like it’s not important",
   "created_utc": 1697692600,
   "score": 46,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5il0ae",
   "message": "A few months ago, I watched a video about a community (forgot the country) who'd excavate their dead relatives' bodies out of their graves on their death anniversary, and then perform some sort of rituals on them. \n\nI'm still in utter disbelief.",
   "created_utc": 1697699761,
   "score": 69,
   "submission_id": "17b9ytc"
  },
  {
   "comment_id": "k5jp5zl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17b9ytc"
  }
 ]
}