{
 "submission_id": "17bjpuv",
 "title": "Guys, where do you draw the line between “she’s just being nice” and “she’s flirting or leading me on”?",
 "selftext": "",
 "created_utc": 1697723679,
 "permalink": "/r/AskReddit/comments/17bjpuv/guys_where_do_you_draw_the_line_between_shes_just/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/17bjpuv/guys_where_do_you_draw_the_line_between_shes_just/",
 "comments": [
  {
   "comment_id": "k5jo65v",
   "message": "[deleted]",
   "created_utc": 1697723859,
   "score": 46,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kbqhm",
   "message": "My line used to be touching my thigh.  Only one girl had ever casually, intentionally placed her hand on my thigh (during a first date, no less!) so I lost my virginity to her and ultimately married her.\n\nWe were married a long time, but after we divorced a female friend kept repeatedly, casually and intentionally touching my thigh every time I made her laugh.  Hey, message received, let’s do this!\n\nTurned out she was just being nice.",
   "created_utc": 1697732733,
   "score": 188,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jpmti",
   "message": "Something I didn't notice back in the day when my wife was flirting with me before we dated (I was very naive at that age): she would talk with me about various things, but she would also go out of her way to do so and talk with me often. Obviously it doesn't guarantee a woman doing this is flirting, but at the very least if she's using a lot of her time and energy to openly and blatantly choose to be around someone and interact with them, she finds them interesting and probably feels safe around them.",
   "created_utc": 1697724449,
   "score": 241,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jnyzg",
   "message": "I'm married to her and I'm still sus of this bitch.",
   "created_utc": 1697723779,
   "score": 214,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kuz0k",
   "message": "until her hand is down my pants and she says \"I want you to put your penis in my vagina for several minutes\" . otherwise, she is just being nice.",
   "created_utc": 1697739647,
   "score": 181,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jsbbn",
   "message": "My lonely ass is picturing our whole life together the second we exchange a smile\n\n\u0026amp;#x200B;\n\n(/jk I can get social clues... well most of them)",
   "created_utc": 1697725515,
   "score": 53,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5khmdd",
   "message": "In the exact opposite place I should.\n\nIf she's flirting, I'll probably assume she's just being nice.\n\nIf she's just being nice, I'll probably assume she's flirting.\n\nBut hey, consistently wrong is still consistent, right?",
   "created_utc": 1697734815,
   "score": 249,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5k3jwh",
   "message": "If she will listen to my bullshit stories for more than a few minutes then she is flirting because nobody is that nice.",
   "created_utc": 1697729770,
   "score": 116,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5joobs",
   "message": "Depends on who they are, a bartender or waitress is almost never flirting. And if they actually are, they'd ask to exchange numbers.",
   "created_utc": 1697724061,
   "score": 166,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ku2uz",
   "message": "I have this trick where I’m unattractive and therefore know that she’s never flirting with me",
   "created_utc": 1697739324,
   "score": 200,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kwqg7",
   "message": "I just assume everyone is friendly until im more or less pinned to the sofa with them trying to rip my clothes off. Even then I think 'haha, maybe she's just having a laugh or something haha lol'..",
   "created_utc": 1697740292,
   "score": 86,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kife9",
   "message": "The problem is that the line is different for every woman.  So you can never really tell.   There have been times when I could have *sworn* she was flirting, but nope.  And vice versa.",
   "created_utc": 1697735107,
   "score": 142,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jr49d",
   "message": "She's almost certainly just being nice\n\nI think when the innuendos start is when you can get the flirt detector out",
   "created_utc": 1697725044,
   "score": 178,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jp5xo",
   "message": "Until she does an unquestionable move, \"she's just being nice\"...",
   "created_utc": 1697724260,
   "score": 184,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kk50y",
   "message": "My SO kissed me goodnight after our first date and I remember thinking \"Oh she likes me?\" So apparently after they kiss me.",
   "created_utc": 1697735732,
   "score": 114,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ktfq4",
   "message": "I'm married, I rely on my SO to tell me when I'm being flirted with\n\nPrior to that, it has to be blatantly obvious or I'll assume they are just being nice.",
   "created_utc": 1697739091,
   "score": 56,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5juri2",
   "message": "Eye contact and physical contact congruence.  If shes looking right at me and touching me? She's definitely flirting.",
   "created_utc": 1697726469,
   "score": 47,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lme4d",
   "message": "If she has sex with me at least three times. First two times could be a fluke, but if she fucks me thrice I figure she might be interested.",
   "created_utc": 1697749585,
   "score": 34,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5juhvn",
   "message": "Idk, no girl has ever talked to me. But if it ever happened, i wouldn't ever figure it out.",
   "created_utc": 1697726367,
   "score": 95,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5junhx",
   "message": "I don’t. Flirt back, and if you’re wrong handle rejection without being a dick.",
   "created_utc": 1697726426,
   "score": 15,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5joiao",
   "message": "I don't draw the line, because it's never in the same place. Communication and flirting is like a river. Either stay in the shallows or swim into the depths.",
   "created_utc": 1697723994,
   "score": 82,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jr3q0",
   "message": "She needs to use her words to make her intentions clear. Without explicit words (pun intended) I have to assume she's just \"being nice\".\n\nI've been married to my wife for 17 years and that standard still applies with her.",
   "created_utc": 1697725038,
   "score": 42,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ksehq",
   "message": "If there’s a question, she’s just being nice. There’s always a question.",
   "created_utc": 1697738712,
   "score": 22,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5karp8",
   "message": "Its just on a case by case basis.\n\nIn GENERAL, if a woman touches you (hand/shoulder) she's a bit more interested than friends. If you like her, you can make a flirty comment back and she how she responds. If you ever need clarity, simply tell her that you like her and be straight forward about your feelings. If she just likes you as a friend, she'll tell you!",
   "created_utc": 1697732385,
   "score": 43,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jtfel",
   "message": "Never assume she’s flirting with you.",
   "created_utc": 1697725953,
   "score": 24,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lf0g3",
   "message": "Isn't it obvious? We have no fucking clue where the line is. EVERY SINGLE HETERO MAN you've ever met has done both these things at least once in their lives:\n\n- Mistaken politeness for flirting and made an ass of themselves \n\n- Mistaken flirting for politeness and not pursued someone who obvious wants it\n\nThere is no fucking line. It's just fog as far as the eye can see.",
   "created_utc": 1697746899,
   "score": 10,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jo4le",
   "message": "When they make it blatantly obvious. Like you'd have to be an idiot to think they weren't flirting. Otherwise I auto assume they're just being nice.",
   "created_utc": 1697723842,
   "score": 43,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jwmfa",
   "message": "It's never flirting and I act accordingly.",
   "created_utc": 1697727174,
   "score": 9,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jwrli",
   "message": "The most definitive way to know is to ask her out. If that’s too much for you, you can give her the opportunity to spend more time with you and if she makes an effort to do that, you know she wants to do that at least. Otherwise, human interaction involves risk. Risk nothing, gain nothing. Your feelings are not her responsibility. You just have to learn to live with it.",
   "created_utc": 1697727228,
   "score": 8,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l122j",
   "message": "I'm a girl \u0026amp; I still don't get the hints. \n\nSo I feel you.\n\nThat you have to tell me.",
   "created_utc": 1697741853,
   "score": 8,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kl4im",
   "message": "Girls are nice to you?",
   "created_utc": 1697736090,
   "score": 14,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5klos1",
   "message": "If she's at work, she's doing her job. Unless she actually tells you that she wants to see you outside of her work.",
   "created_utc": 1697736291,
   "score": 13,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kh5rt",
   "message": "I'm very socially inept, so anywhere up to the point of being chained to a bed with a ball-gag in my mouth is \"she's just being nice\".",
   "created_utc": 1697734648,
   "score": 6,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kqloy",
   "message": "Married now and my radar is all gone but back when I was single and dating, I generally just paid attention to body language. If she was attentive, conversation was flowing and she was closing distance physically (touching me, leaning in, etc),  I took that as a \"shoot your shot\" (respectfully). Wasn't 100% successful but enough to end up married.",
   "created_utc": 1697738061,
   "score": 7,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5k9hxl",
   "message": "I was never good at figuring it out so default answer is \"being nice\" so I can move on about my day.",
   "created_utc": 1697731926,
   "score": 5,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kig1w",
   "message": "There is never any flirting with me.",
   "created_utc": 1697735114,
   "score": 6,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kjpkn",
   "message": "I give her my number, suggest we hang out sometime, and then let it go from there.",
   "created_utc": 1697735576,
   "score": 5,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5klbtl",
   "message": "Unless she directly asked me out, she's being nice.",
   "created_utc": 1697736164,
   "score": 5,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l9ohk",
   "message": "You can't.",
   "created_utc": 1697744958,
   "score": 4,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jzurv",
   "message": "There is no such line, she’s just being nice.",
   "created_utc": 1697728391,
   "score": 14,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ju1hf",
   "message": "If she's seeking out interaction and not just responding",
   "created_utc": 1697726190,
   "score": 4,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kviwf",
   "message": "Honestly unless a girl is obnoxiously obvious about being into me I just assume she’s being nice\n\nWe equals now use your goddamn words",
   "created_utc": 1697739846,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kle3e",
   "message": "It depends on how firmly she grips your penis.",
   "created_utc": 1697736185,
   "score": 6,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lwwfk",
   "message": "It's called subtext, do you have it? -  \\*wink\\*\n\nFlirting has a number of elements, you need most of them, and not everyone is aware enough to put out or comprehend the signs but the biggest mistake is to think of it as something that's one sided.\n\nIs she flirting ***with*** you? -Or ***at*** you? -In flirting there is an interplay and reciprocity so even if one person is clearly trying to initiate but the other person doesn't get it, it isn't really flirting. Are you tossing this social ball back and forth? -Or has it become a game of tug of war. The more its like a ball being tossed back and forth the more of a flirting encounter it is.\n\nYou ultimately have to look at context clues, with flirtation there is an attempt to break down barriers. They're opening themselves up to vulnerability in an attempt to get you to do the same. And that isn't the case in other situations. There may be an attempt to close physical distance, there may be an attempt to make time less important and protract the encounter, there may be an attempt to disarm and break down your emotional facade, there may be an attempt to break down an information barrier to learn more that's personal...  You don't need all these things but its a certain inclination and direction of the conversation. And importantly its happening on both sides of the interaction. It's personal, it's done playfully and its pervasive and persistent through the conversation.\n\nWhen it's just someone being nice you will much more quickly reach a point where there is pull back and an intentional attempt to maintain those social boundaries we normally maintain to protect ourselves. Like stepping back if you lean towards them or being resistant to sharing details, information, or their time outside the immediate context at hand. Are they tossing the social ball back and forth, or are you just throwing things at them? -Trying to pull them back as they pull away? -You might say something flirtatious and they make an excuse to break off, or in more extreme situations mention they are in a relationship.\n\nA person that's leading you on and trying to be deceptive is generally going to be more resistive to introducing themselves, they'll express flirtatiousness to more people than just you. They will give mixed signals, going back and forth between being hot and cold towards you. There attitude towards you will be more inconsistent. Ultimately they are there only for themselves and are resistant to investing time or energy if it doesn't benefit them. They live on the ambiguity of whatever there is between you two and are trying to create a more one sided interaction getting more out of you then they give back. The want to walk away with your ball.\n\nWhile a flirtatious interaction doesn't have to be long, if your encounter hasn't lasted long enough to make these distinctions clear, it wasn't really flirting.",
   "created_utc": 1697753611,
   "score": 7,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5k1j0g",
   "message": "I assume shes being nice until she tells me otherwise",
   "created_utc": 1697729018,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5k5cf7",
   "message": "That's the neat part we don't\nSo unles somebody points out the this was flirty we think its just beeing nice",
   "created_utc": 1697730429,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5khl0t",
   "message": "Oh that's easy, they're never flirting with me.",
   "created_utc": 1697734802,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kqcog",
   "message": "I assume she's just being nice so I don't act foolish presuming it's flirting.",
   "created_utc": 1697737972,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kqoec",
   "message": "Until she makes a glaringly obvious move, assume she’s just being nice.",
   "created_utc": 1697738088,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ksrwv",
   "message": "Every woman is different you will never know. If she's not repulsed by me and like her, I ask her out.",
   "created_utc": 1697738849,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ktgot",
   "message": "When she drags her tots across you in some fashion. Or perhaps her ass.",
   "created_utc": 1697739100,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kvuwl",
   "message": "You can’t. You just have to be open about your own intentions, take initiative, and take every rejection like a reasonable adult and move on.",
   "created_utc": 1697739970,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ky1es",
   "message": "I am incapable of picking up on flirting so I assume it’s always just “being nice”",
   "created_utc": 1697740765,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lcyfb",
   "message": "9/10 times she’s just being nice",
   "created_utc": 1697746152,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lhe27",
   "message": "I learn to avoid those questions. Think positive and get a good time unless it is blatantly obvious",
   "created_utc": 1697747755,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lrzqu",
   "message": "Ask?",
   "created_utc": 1697751706,
   "score": 3,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jtyd1",
   "message": "Without outright stating it, treating you much differently/giving you much more attention than others",
   "created_utc": 1697726157,
   "score": 8,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5knh7r",
   "message": "It's that extra look she gives you, the one that says she's interested. Either you get it, or you don't. Odds are you don't.",
   "created_utc": 1697736943,
   "score": 8,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5jqwoh",
   "message": "When she offers to let you sleep in her bed while her husband watches Netflix in their living room.",
   "created_utc": 1697724961,
   "score": 6,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kbkag",
   "message": "I never know if it is one or the other until 6 months later.",
   "created_utc": 1697732673,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kktm5",
   "message": "They never flirt they are always being nice",
   "created_utc": 1697735981,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kqbk2",
   "message": "No fucking clue.",
   "created_utc": 1697737961,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ktsbv",
   "message": "If she  undresses in front of me while fully aware that I'm there, then and only then, will I assume she isn't just being nice and making pleasant conversation.",
   "created_utc": 1697739217,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kw2tq",
   "message": "She's not flirting with me in any circumstances whatsoever unless she explicitly says so.  And even then she's probably just kidding and I shouldn't read into it",
   "created_utc": 1697740051,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5kxigm",
   "message": "Well unless she tries to do something that surpasses the “only nice” part. Horseplay for example, starting to touch or tickle when we clearly arent that close. The fuck me eyes as well, i mean its a game of guess, and its nothing wrong with thinking she is flirting with you, u just flirt back if I want and if u happen to be wrong she will definitely let u know or give deadway signs that she aint interested. Often u either have both or none of the ability to take a hint when they arent interested or they r flirting with you. Nothing wrong with asking tho, as long as u r a good sport and can take it to the chin when the rejection comes.",
   "created_utc": 1697740574,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l16lo",
   "message": "That’s the neat thing: I don’t!\n\nI just assume they’re all being nice.",
   "created_utc": 1697741897,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l2247",
   "message": "I am entirely unable to process this sort of stuff so I just assume nothing is flirting and then spend the next several years second guessing myself.",
   "created_utc": 1697742214,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l23b2",
   "message": "When she starts touching",
   "created_utc": 1697742226,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l44rd",
   "message": "Touch. If they start touching me in anyway, it's go time.",
   "created_utc": 1697742963,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l4jrs",
   "message": "I always assume they're just being nice right up until they start getting up in my personal space.",
   "created_utc": 1697743114,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l6hex",
   "message": "Seeing if she does the same thing to other guys around. If theres something she does with you (i.e. resting her hand near or on yours when sitting near each other) but she doesn't do with other guys, even if given the chance to, then you're in",
   "created_utc": 1697743811,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l7xpu",
   "message": "I just always assume she is being nice. If she wants me bad enough she can come get me",
   "created_utc": 1697744333,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5l98iw",
   "message": "It's hard to articulate, but I know it when I see it except I'm wrong about 80% of the time.",
   "created_utc": 1697744800,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lbvuv",
   "message": "I just think everyone's just being nice except for the one person I know is in love with me",
   "created_utc": 1697745762,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lc8jk",
   "message": "There is no line. There is no flirting. The answer is always \"being nice\"",
   "created_utc": 1697745891,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5le3m0",
   "message": "Unless she grabs my ass or pulls me in and shoves her tongue down my throat, I'm assuming she's just friendly",
   "created_utc": 1697746569,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5leh8b",
   "message": "Normally her voice will go up a higher pitch and she will try to hang out with you  more if she’s into you, and that’s when the flirting starts. It’s the small things you gotta pay attention to men.",
   "created_utc": 1697746708,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5len0g",
   "message": "She pretty much has to send me a formal document in writing to confirm her intentions. \n\nBeen married for many years and my wife pretty much had to send me a formal document in writing on the dance floor when we met.\n\n“What? Me? Really? Me?….”",
   "created_utc": 1697746766,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lhvlz",
   "message": "It’s genuinely impossible to tell nowadays and I am NOT gonna embarrass myself. That’s why I only have violent and sweaty sex with DUDES now.",
   "created_utc": 1697747935,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5ll5o3",
   "message": "Here's a video that explains everything.\n\nhttps://youtu.be/xa-4IAR_9Yw?si=XpkMZaFh4v6alNpj",
   "created_utc": 1697749128,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lmhmp",
   "message": "If she starts kissing you, there's probably 99% chances that she's at least being nice to you",
   "created_utc": 1697749622,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lpi2p",
   "message": "Is she working? Like retail or hospitality staff at a place your shopping at? She's only being nice",
   "created_utc": 1697750756,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lsq3z",
   "message": "I only know when my fiancée puts herself physically between me and the woman in question.  She doesn’t get mad at me or even the woman, because she assumes that my (hypothetical) charisma and sex appeal are just overwhelming within a certain radius.  But she does shut it down.",
   "created_utc": 1697751988,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lwsvg",
   "message": "Any sort of body pressing. If a woman presses a portion of her body against me that is larger than 450cm² in area then I immediately get suspicious that she may be flirting with me. This is especially true for any of the hip or chest region.\n\nCaveat: does not apply on the dance floor",
   "created_utc": 1697753572,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lzsuj",
   "message": "Getting touchy and focusing on just me.",
   "created_utc": 1697754784,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5m5t5p",
   "message": "She’s just being nice, if she is flirting, you won’t realise until 3 years later whilst emptying the dishwasher.",
   "created_utc": 1697757303,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5m62wb",
   "message": "Normally I assume that if she is the first to bring up anything sexual or initiates physical contact with me then it’s a pretty safe bet that she’s trying to convey interest",
   "created_utc": 1697757420,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5m6nnj",
   "message": "When she starts having sex with you, she’s still probably just being nice!",
   "created_utc": 1697757662,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5m9xvo",
   "message": "I'm the type of guy who doesn't understand flirting, you either tell me you love me, admit your feelings, or nothing will ever happen.\n\n_only one girl has told me their feelings when I was in my last year of highschool, but I was not in the right mental health or behavior to worry about that, so I pulled the wait card... perhaps it was for better, but now I have no way to communicate to her, it's been 7 years or so...oof_",
   "created_utc": 1697759044,
   "score": 2,
   "submission_id": "17bjpuv"
  },
  {
   "comment_id": "k5lh895",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17bjpuv"
  }
 ]
}