{
 "submission_id": "17caujp",
 "title": "Sexy Halloween IX: AskReddit Goes to Sexy Hell",
 "selftext": "**Please keep all sexy top level-comments as sexy questions, to be answered by the sexy-comments.**\n\n*The sexy purpose of the sexy megathread is to serve as a sort of sexy subreddit of its own, an /r/AskReddit about sexy Halloween, if you will. Top-level comments should mimic sexy thread titles, as sexy questions for the sexy-comments to answer. Non-sexy question top-level comments will be removed, to keep the sexy thread as easy to use and navigate as possible.*\n\nUse this sexy thread for asking fellow sexy redditors sexy questions about all things sexy Halloween-related, from [sexy costume ideas](https://i.imgur.com/4dBVGSA.gif), to sexy scary movies, and anything and everything else. And please. feel free to browse it by /new to contribute to new sexy discussions as they arise!",
 "created_utc": 1697807153,
 "permalink": "/r/AskReddit/comments/17caujp/sexy_halloween_ix_askreddit_goes_to_sexy_hell/",
 "score": 0,
 "url": "https://www.reddit.com/r/AskReddit/comments/17caujp/sexy_halloween_ix_askreddit_goes_to_sexy_hell/",
 "comments": [
  {
   "comment_id": "k5qxt8a",
   "message": "If your Birthday is in July, did you ever consider that your parents probably dressed up and raw dawged on Halloween?",
   "created_utc": 1697838100,
   "score": 23,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5ooxiu",
   "message": "What are you planning to _sexily_ dress up as this Halloween?",
   "created_utc": 1697807700,
   "score": 12,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5ooyoq",
   "message": "Sexy redditors of Reddit, what’s the sexiest sex you have ever had with somebody who was dressed as a mummy?",
   "created_utc": 1697807714,
   "score": 18,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5qygih",
   "message": "How many times have you fucked at a Halloween party?",
   "created_utc": 1697838362,
   "score": 3,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5rfw3f",
   "message": "What's your secret to turning Halloween into a spooky-sexy celebration? Any costume or party ideas that mix tricks and treats in a fun and flirtatious way?",
   "created_utc": 1697845778,
   "score": 3,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5r8zli",
   "message": "If you had the opportunity to do porn on Halloween night, which character would you choose to shoot?",
   "created_utc": 1697842787,
   "score": 1,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5rmbrd",
   "message": "Spooky sexy redditors? Whats the spookiest sexy spook sex you've ever sex spooked?",
   "created_utc": 1697848556,
   "score": 1,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5rz20a",
   "message": "Sexy redditors with mommy or daddy issues, how have they shaped your kinks?",
   "created_utc": 1697854445,
   "score": 2,
   "submission_id": "17caujp"
  },
  {
   "comment_id": "k5tqlkn",
   "message": "What character would be suitable for me at a Halloween party if I want to be the sexiest girl at the party?",
   "created_utc": 1697893199,
   "score": 1,
   "submission_id": "17caujp"
  }
 ]
}