{
 "submission_id": "17ck3zr",
 "title": "What's the worst thing you've ever done when horny?",
 "selftext": "",
 "created_utc": 1697832268,
 "permalink": "/r/AskReddit/comments/17ck3zr/whats_the_worst_thing_youve_ever_done_when_horny/",
 "score": 151,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ck3zr/whats_the_worst_thing_youve_ever_done_when_horny/",
 "comments": [
  {
   "comment_id": "k5qz7j4",
   "message": "Went to buy a vibrator from a local large supermarket and bought a happy birthday card and gift bag with it too so it looked like a gift",
   "created_utc": 1697838664,
   "score": 88,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqmje",
   "message": "One time I made love to a stack of bathroom towels.",
   "created_utc": 1697835288,
   "score": 15,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qql5l",
   "message": "Not me but my step brother when he was a teen put his dick into the mouthpiece of a plastic flute and \"blew\" himself. My step mom walked in on him and now every few Christmas he gets one as a gag gift.",
   "created_utc": 1697835274,
   "score": 77,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqd26",
   "message": "October 30, 1991. I walked eight miles through hurricane force winds on Nantucket Island to spend the night with my girlfriend",
   "created_utc": 1697835189,
   "score": 211,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqoai",
   "message": "I ended up making out with and going home with an attractive but completely crazy woman who used to hang around our local bar. Back at her place she puts on her Lauren Hill CD, strips completely naked, attempts to dance provocatively (we were both pretty drunk) and starts giving me a bj. It was at this point her 18 year old son wandered into the lounge and started protesting violently about what was going on. She tells him to fuck off and huge argument erupts between them - remember she's drunk and naked and I'm sitting on the sofa with my jeans around my ankles and a rapidly deflating hard on. I came to my senses, zipped back up and gtfo. Apparently she's currently doing time for violently assaulting and attempting to stab her boyfriend, so I think i got off pretty light.",
   "created_utc": 1697835307,
   "score": 195,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqf1q",
   "message": "Drunkenly called a phone sex line, but was so horny and drunk that I didn't clue until after I hung up that I had used my father's landline instead of my cellphone. That was an awkward talk the next day.",
   "created_utc": 1697835209,
   "score": 114,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qlpze",
   "message": "Joined a sperm donation app, and met with a girl from there on a whim.",
   "created_utc": 1697833425,
   "score": 216,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqot2",
   "message": "Stuck my dick in a vacuum cleaner hose.\r  \n\r  \nDon't make my mistake.",
   "created_utc": 1697835312,
   "score": 255,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqe4q",
   "message": "jerked off in the private work bathroom forgot to lock the door and the new guy walked in on me and he quit a week after...",
   "created_utc": 1697835200,
   "score": 172,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qonzd",
   "message": "Send nude to stranger recently met on internet, they then sextort me. Fun times",
   "created_utc": 1697834540,
   "score": 192,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qobhf",
   "message": "Masturbated to the archer queen in clash of clans",
   "created_utc": 1697834407,
   "score": 183,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qnc1v",
   "message": "I was sick with something that forced me to the toilet for literally the entire day. If I thought I was done i would go lay back down only to get right back up and have to shit again. Well I figured since I was gonna be in there so long I had time to rub one out. I mean, that wasn’t false I had the time. So I did just that. Well it worked up the sickness and shortly after I finished I was overheating and sweating and just not feeling good. I started shitting again pretty good and felt a vomit coming on. So here I am with shit all over my ass, cum on my stomach, and I’m hunched over a toilet throwing up who knows what. Not my finest hour",
   "created_utc": 1697834036,
   "score": 2,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qt5u7",
   "message": "Tried to hire an escort from tinder. Sent her a $35 “deposit”, and she unsurprisingly ghosted me right after. I was 18 and dumb as a box of rocks.",
   "created_utc": 1697836265,
   "score": 207,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqki9",
   "message": "Very drunk and horny, dry humped my first fling at a college party.\n\nEveryone was there.\n\nThe lights were still on and everything.\n\nI still cringe. At least he seemed to enjoy it I guess. And at least everyone was as drunk as me.",
   "created_utc": 1697835268,
   "score": 96,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qrr4x",
   "message": "[removed]",
   "created_utc": 1697835720,
   "score": 226,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5r34kl",
   "message": "Whacked off with my wife’s butt plug in my ass until I came everywhere. I regret nothing and y’all the only one who knows",
   "created_utc": 1697840262,
   "score": 6,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qrllc",
   "message": "[removed]",
   "created_utc": 1697835662,
   "score": 27,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqi9l",
   "message": "Pretty much everything I have done while horny.\n\nIt's just a generally undignified state to be in.",
   "created_utc": 1697835244,
   "score": 215,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5rbnen",
   "message": "Jacked off in my car waiting for my friend in a job interview and he got to the car right when I was cumming and he saw me",
   "created_utc": 1697843945,
   "score": 174,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qr03x",
   "message": "Midway into taking my time with this girl making ruthless sex she said in broken moans \"cum for me\" which I thought she said \"comfort me\" so I stopped and gave her a hug.",
   "created_utc": 1697835432,
   "score": 169,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qlx2o",
   "message": "The standard… fucked myself with a vegetable, masturbated at work, sexted some guy from back in the day, etc",
   "created_utc": 1697833502,
   "score": 81,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qyhmp",
   "message": "Jerked off on the freeway on the way home from a trip to my girlfriend's place (still horny) and missed my exit. Had to drive an extra 50 miles on an alternate route to get home.",
   "created_utc": 1697838375,
   "score": 25,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qs3s8",
   "message": "[removed]",
   "created_utc": 1697835859,
   "score": 132,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qvxb4",
   "message": "I smelled my friends mom’s panties that were on the floor and did a dry heave because it wasn’t good at all.",
   "created_utc": 1697837342,
   "score": 232,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qr8c3",
   "message": "Female friend in our group was super upset at a karaoke bar, some drunk guy said something, she’s in tears. As the least drunk I am voluntold to driver her home and do not have sex! She invites me in for coffee so I can sober/wake up to drive home and we agree no sex. \n\nWe had sex twice before passing out and twice again the next day.",
   "created_utc": 1697835519,
   "score": 92,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5r3drz",
   "message": "Was completely shitfaced at a party and lost my friends, met a girl there while smoking. Next thing I know we’re in the restroom, have no clue how I got there. Proceeded to have sex until we heard knocks on the bathroom door. Made up a story about her being sick and me helping her. They don’t buy it. Got kicked out of the club and all my friends had to leave the party, because I couldn’t get in anymore.\n\nMeet a girl 2 years later who I’m into, turns out that girl from the bathroom is her girlfriend.\n\nEdit: sooo I think some of you might be misinterpreting my use of the word ‘girlfriend’ and my story. I’m a girl, all three of us are lesbians. Girl from the bathroom and new girl I was into were/are in a relationship. Hope that clarifies it haha",
   "created_utc": 1697840367,
   "score": 250,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5r0i1d",
   "message": "Put my dick inside a toilet roll and fucked it. \n\nI end up with a bruised penis head.",
   "created_utc": 1697839191,
   "score": 133,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5r1ff7",
   "message": "I live in  a state with pretty harsh winters. I was at a buddy's house partying during the holidays and we got hit with pretty good storm that closed the roads. My buddy's place was in a canyon where the snow fall was even greater making leaving that much more impossible.\n\nI was dating a girl at the time who was a bit of a freak. She was not with me at the party, she was hanging out with a friend who was visiting from out of state, but they were going to come to the party after they were done doing their thing.\n\nWell, they got to talking and decided that we should have a threesome, I'm notified of this development via text message, and am instantly both ecstatic and mortified. I'm stuck. They can't get to me. And they are on their way to my house.\n\nI explain the situation to my buddy, and he did the only thing a bro could do in that moment.\n\nHe helped me cut apart his mom's wicker chair that had belonged to her grandmother so we could try to make snow shoes!\n\n....They worked for about 50 feet.",
   "created_utc": 1697839567,
   "score": 120,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqkt9",
   "message": "jacked off in an airplane bathroom on a 45 minute flight.",
   "created_utc": 1697835271,
   "score": 50,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qsgy8",
   "message": "Got married and raised a family",
   "created_utc": 1697836000,
   "score": 214,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qrc40",
   "message": "Just incase anyone will need this, before going on a date or going out drinking or if you feel that you are going to cheat on your partner or basically whatever that you know you’ll regret because you are just horny, masturbate first. The postnut clarity will provide you wisdom on the next decisions you will make. Thread lightly.",
   "created_utc": 1697835560,
   "score": 184,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qp5h7",
   "message": "Flew 15 hours to another continent to see a former FWB, completely forgetting the important \"why\" regarding \"former\".  Charmed my way back into her good graces, spent two days not leaving the room of a pricey hotel with her...  only to be stabbed with a fork.\n\nStill had sex with her one more time and then left with blood running down my arm for the airport.\n\nI still get the occasional passionate message from her and I would be lying if I'm not tempted to go back.\n\nSometimes toxic sex is *the best sex*.\n\n\nEdit:  Additional context - she kept the fork, after I left the hotel.  Sometimes she sends me a sexy selfie.  Sometimes she sends me a picture of the fork.  Sometimes both.",
   "created_utc": 1697834726,
   "score": 101,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5rvupx",
   "message": "Jerked off in a portaloo while listening to the Pope give a sermon to 350,000 people.",
   "created_utc": 1697852895,
   "score": 106,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqgyk",
   "message": "Helped a hot coworker stalk her supervisor.\n\nI'm in my early 20s working a small warehouse job for the summer in my hometown. I've got the awkward hots for this older woman Tina (none of these names are real) who just seems so much out of my league that I don't even try. One day we've got a bit of banter going and before I realize what I've done I ask if she wants to hang out. She asks if I have a car, I do, she says yes.\n\nSo we're hanging out at her place, she's telling me stories that are like holy shit and the beers are going fast. Then she gets a bit of a lost look in her eyes, goes quiet, and then asks if we can go for a ride.\n\nWe're out driving around. She's telling me how she used to go driving every night but got a dwi hanging over her for another few months. Then she starts giving me direction on where to go.\n\nA bit later we're in a cul-de-sac and she tells me to park and points out a spot. Cool, we're gonna make out I think. Instead she just sits there staring at this one house. Looking in the front window I see Bill (again, not his real name), our supervisor. Holy shit what is going on here?\n\nShe tells me that her and much older Bill used to have a thing but he refused to leave his wife and kids. That he has totally ghosted her because he thinks she's to obsessive but she can't stop thinking about him.\n\nI hear RED ALERT go off in my head and I get the car started.\n\nShe turns to me, looks me straight in the eyes, and start undoing my pants. I turn the car off.\n\nFor the next half hour we just sit there silently staring straight ahead at Bills place while she gives me a slow handjob, eventually finishing me off with a blowjob and me driving her home.\n\nSo we ended up doing this for the rest of the summer. Never had sex, her pants never came off, never kissed. September came and I left town for my next semester at Uni.",
   "created_utc": 1697835231,
   "score": 6,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qosxh",
   "message": "Masturbated through my pants in class under the desk. Teenage hormones.",
   "created_utc": 1697834592,
   "score": 4,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qzr1f",
   "message": "Idk if this counts but I accidentally threw up a little on my SO penis and he thought it was spit so I just played it off bc I was so embarrassed…ya that’s a secret I’m taking to my grave.\n\nEdit: not that anyone asked but I also had tuna before hand and somehow I only threw up like water/bile so it wasn’t like nasty asf but also babe if you’re reading this. I’m sorry but just know I love you and I did it out of love and…to not kill our mood.",
   "created_utc": 1697838884,
   "score": 8,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qqjr8",
   "message": "Like twenty years ago, I was heading to my friends house when I remember that this cute girl from class said she worked at a Starbucks but one that was like 45 minutes away. I impulsively drove the whole way there for a chance to see her. She wasn’t there. When I showed up to my friends house they were like why are you like an hour and a half late.",
   "created_utc": 1697835260,
   "score": 137,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5rjagb",
   "message": "Paid for not one but two porn subscriptions. 2 years later was going through my credit card statement and noticed two charges I don't recognize that month. Went back and checked previous months and they all had these charges.\n\nCalled this suspicious looking payment processing company and, slightly indignant, I asked the agent what these charges are for. She bluntly told me the names of two famous porn sites. There was a pause. I said \"oh\" and hung up.\n\nI've been paying for porn for two years. I think I used those sites for less than a month... then went back to the free ones. Takeaway? HD porn does not enhance the jerking off experience.\n\ntl;dr: Been unknowingly paying for porn for two years.",
   "created_utc": 1697847245,
   "score": 86,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5r3sck",
   "message": "38/F here. When I was a teen, I turned a freestanding hat stand sideways and humped it until I came. Logistically, it was a nightmare - but strangely effective.",
   "created_utc": 1697840537,
   "score": 241,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5r2tq3",
   "message": "When I was 15 I got a quick add from Snapchat to a girl my age from California asking if I wanted to hook up, this was thanksgiving night and she was visiting in Washington to see her family. This girl never sent me a snap of what she looked like only a photo of her in the mirror from her camera roll. She was pretty but looked fake. \n\nIt was snowing that night and super cold but I was desperate and young. So I put on like 6 layers and grabbed my bike out of the garage after everyone had left, my uncle caught me and told me not to leave but I didn’t care, I was horny and as I said before I was desperate. He said if I left I wouldn’t be allowed back inside but I left anyways, it was a 12 mile bike ride in about 3 or 4 inches of snow.\n\n As I got about a mile in my uncle told me he called the cops. “In Washington there is a curfew for people under the age of 17” I finally got about 4 miles away from the address she had sent and she was still actively texting me but the way she texted me was Interesting and weird she was saying things like “ I hope the experience you have with me will be that of a lifetime and other things like do you feel the rush of lust in the air” I knew these things were weird but I didn’t care. \n\nIt had been about 2 hours by now and I was only a mile away, my phone was dying and I stopped at a gas station that was closed and waited for a car to show up so I could ask for their charger. The car that stopped was rusted and the windows were taped  but I asked anyways they invited me in their car, it was a younger couple probably early to mid 20s looking back at it they were probably on drugs.  They asked how old I was and what I was doing out so late I think I told them I was coming back from thanksgiving at a friends house. They began making out and the woman started giving him head while I was in the car and it made me very uncomfortable so I left. \n\nI got on my bike and rode for another 10 mins in the pitch black in the heart of the pacific north west with high wind and snow. She hadn’t responded for a bit so I began to think she bailed, I texted her again when I got to the address. \n\nThe address of the place was outside on the street of these very nice houses with a bunch of trees around them right on the water. I told her I was there and she said I would have to wait for about 20 mins before she could come out.\n\nI sat down and fell asleep, I woke up to a woman whistling and stood up and saw a woman walking towards me as she got closer I realized this was not the woman I had seen in a picture. The woman in the picture was a 15 year old light skin woman with an Afro, the woman that I saw in front of me was in her 20s and was still light skin but had a weave. I didn’t even question it at that moment  I had already came to far to care. \n\nI thought we were going to go inside but she told me we couldn’t go inside because her family was still awake. She and I walked down this dark path for over a mile because she had a beach house by the water. We didn’t say a word the entire time. We got to the so called beach house and it was an abounded run down “idk what to call it so let’s just call it a shed” we went in and she pulled up on the floor board and grabbed 3 blankets and laid them on the ground.\n\nAt this point my post nut clarity had settled in before I had even done anything and I realized I was either catfished by a lonely woman or about to die. She tried to kiss me but I asked her if we could play truth or dare instead. She agreed. “ My plan was to pry as much information from this woman as I could and then decide if it was worth it. I asked her the most basic but alarming question right off the bat, I asked how old she was. She told me she was 24, she then said that she knew she lied but didn’t want to scare me away and thought I was really handsome. She told me that she had 3 kids with 3 different men and was a stripper in San Francisco, she was a recovering heroine user. She said that she liked sleeping with younger boys because it reminded her of when she was younger with older men.\n\nNow I admit, this woman had lied to me about everything, was a drug addict, a stripper and a pedophile but I didn’t care. She was hot, had huge tits and a face meant for a facial. My next time asking her truth or dare she chose dare and I won’t go into what I asked her but let’s just say an hour late and many nicknames along the lines of “my baby boy, young man, and “child” my trip became worth it. It was great and I could tell this woman had more experience than anyone I knew of any age. \n\nWe were done and that was that she said I could sleep there till the morning but she had to go back inside and that’s it. She put on her clothes and left with my cum still on her face, \n\nI slept till the morning and got home my uncle wasn’t there so I went to my room. I went to text her but she had blocked me immediately after she left. \n\nJewels if you’re reading this you definitely were a pedophile and a catfish and need serious help but you were hot and I was young and didn’t care. \n\nAnyways that’s my most horny moment.",
   "created_utc": 1697840139,
   "score": 99,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5rcpc1",
   "message": "When I was a kid, I masturbated to the hot coffee mod in San Andreas",
   "created_utc": 1697844396,
   "score": 73,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qnhrv",
   "message": "I will spare everyone the gory details, but there is a reason I only buy creamy peanut butter now",
   "created_utc": 1697834095,
   "score": 9,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qzdo0",
   "message": "Fucked a small clay vase my mom made me.\n\nAlso snuck into my HS gf's room thru the window one night and while we were fucking her dad comes in her room. I was mortified so i hid under the covers like a 5 year old while her dad stood there and she kept telling me to come out coz he knows. Finally came out and had to walk past him in shame to exit.",
   "created_utc": 1697838731,
   "score": 67,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qvpqt",
   "message": "I was single for a long time...not ready to date yet but horny as hell. I had a very attractive ex-coworker who had a thing for me, she once hit on me after a work party like two years prior. I was married so I turned her down. Horny, single me wonders if she's still interested. She's moved across the country but its a city I visit here and there. I randomly DM her on Instagram. She replies. We converse back and forth. I mention the fateful work party. She says she doesn't remember. Bad sign. But then she says she's kidding. A few weeks later when I'm set to go to that city again, I message and without being vague or too forward, I say \"When I'm in town, do you want me to come over to your place to hang out?\" She says \"Sure\"...So I'm not completely sure we are on the same page but I figure I'll know soon enough. So after like 8 weeks of DM's, a 2,500 mile flight, renting a car and driving to this girl's house, having sex three times - I feel guilty as hell and realize I'm not ready to have emotionless sex or date.",
   "created_utc": 1697837258,
   "score": 234,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qv3jz",
   "message": "I am quite relieved to read that most women seem to do stupid things when horny. I honestly thought we men held a monopoly on that.",
   "created_utc": 1697837013,
   "score": 96,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qs618",
   "message": "Drove three hours to fuck a Tindr hook up lol. She was super hot dont get me wrong, but driving so many hours starting at midnight is a bit of a trip. What makes it worse is we went for a good two hours so I hit rush hour traffic on the way home. Drive there was about 3 drive home was around 5. Got home at 10 had to be at work at 12 for what felt like absolute hell.",
   "created_utc": 1697835883,
   "score": 27,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qo024",
   "message": "[deleted]",
   "created_utc": 1697834287,
   "score": 190,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5r16zv",
   "message": "Definitely regret all the nudes I’ve sent to shitty guys and one night stands I’ve had. They were not all fun times 😵‍💫",
   "created_utc": 1697839473,
   "score": 186,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5rf95y",
   "message": "Might be vanilla compared to everyone else, but my gf at the time still lived at home (strict parents) and we were on a date when we she gave me the “take me” look. I lost all self respect and spent my last $30 on a shady AF motel room. We banged and left a half hour later. We still laugh about it today (Married 14.5 years!)",
   "created_utc": 1697845510,
   "score": 93,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qlqhr",
   "message": "Started daytrading",
   "created_utc": 1697833431,
   "score": 123,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qujnz",
   "message": "Jerked off in a walmart dressing room and wiped my mess on the seat. I was 13. To whatever walmart employee that had to clean up my load I'm so so sorry.",
   "created_utc": 1697836801,
   "score": 16,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qmyih",
   "message": "Let my ex husband and three of his friends have sex with me when they finished helping us move into our new house, while I was six months pregnant.",
   "created_utc": 1697833895,
   "score": 170,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qz7q7",
   "message": "I let \u0026lt;famous athlete\u0026gt; from \u0026lt;local sports team\u0026gt; rawdog me, while his wife was asleep in a different room on the same floor. Apparently, he hadn't bust a nut in weeks, because his wife was pissed off and withholding sex. I remember he had that deep guttural growl, and he ejaculated for what seemed like a minute straight.\n\nAs a bonus, I had him leave behind a cap with his autograph on it, which I sold two days later at a sports memorabilia store so I could buy ecstasy.",
   "created_utc": 1697838666,
   "score": 130,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qpvif",
   "message": "Drove 6 hours just to get nothing",
   "created_utc": 1697835001,
   "score": 185,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qt16g",
   "message": "Hooked up with a girl with the stinkiest you know what I’ve ever smelt. Probably a PH issue or something, but it was putrid. \n\nAfter she left it clung to the bed sheets and walls, I had to wash everything, put out some candles and open the windows",
   "created_utc": 1697836216,
   "score": 18,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5rob92",
   "message": "Had a buddy who was a nymphomaniac. He was with a different girl every 3 days, like it was nuts. This dude jerked off 3 times a day on top of whatever pussy he was getting. So one week he was going on a vacation and couldn’t find any girl in the area he could fuck for the week. He got so desperate he even went to a beach near his vacation spot to try and find some pussy. Needless to say, he comes home, and we don’t hear from him for like 3-4 months. It gets to the point where we were worried about him, and hadn’t seen any new pictures or videos of him with the girls he hooks up with. We went to his house unannounced and saw a car parked in the driveway. We figured it was a girl. We all had spare keys to his house so naturally, we just went into his house and started calling for his name. We come to find clothes all over the house, and there’s music blaring in the basement. We go down and we cannot believe our eyes… our buddy, on the couch getting Eiffel towered by 2 dudes. He was mortified. We all ran out because we didn’t know how to react. About 3 days later he messages us and asks us to his house for dinner. We all go, and when we get there, the same car from when we walked in on him getting Eiffel towered is there. We go in, they’re all at the table and he explains, he went to the beach on his vacation and the only people there were these 2 dudes and they were all there for the same reason: to find a hot girl to fuck. After nothing they all agreed to just do each other out of pure desire to cum. They enjoyed the experience so much, that they stayed in touch and were doing it multiple times a week in between pussy appointments. To this day, the 3 guys all ended up finding women, and they are all married and have groups orgies with their wives",
   "created_utc": 1697849431,
   "score": 152,
   "submission_id": "17ck3zr"
  },
  {
   "comment_id": "k5qufvv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ck3zr"
  }
 ]
}