{
 "submission_id": "17ct0aj",
 "title": "What is the most creative way your girl/boy-friend has turned you on?",
 "selftext": "",
 "created_utc": 1697857703,
 "permalink": "/r/AskReddit/comments/17ct0aj/what_is_the_most_creative_way_your_girlboyfriend/",
 "score": 178,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ct0aj/what_is_the_most_creative_way_your_girlboyfriend/",
 "comments": [
  {
   "comment_id": "k5t1nub",
   "message": "Maybe snapping their finger like \"come on, let's start\" with that look on her face. I am not really hard to get, tbh.",
   "created_utc": 1697878340,
   "score": 53,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tdam3",
   "message": "Uhh, she was sitting on the couch, and I was sitting on the floor facing away from her but my head and shoulders were beneath her legs. She was initially scratching my head, then picked up her guitar and started playing it and humming\n\n\nTHEN she started giving me a mild foot job through my pants. I went from turned on, to very impressed, then went back to being VERY turned on. She’s got some pretty fine motor control 😅",
   "created_utc": 1697886013,
   "score": 255,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5svq8k",
   "message": "Idk about creative but sometimes we’ll be playing video games together and she’ll just stand up, drop her pants, and walk away",
   "created_utc": 1697874339,
   "score": 183,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t4nl8",
   "message": "I used to date a very nerdy guy who loved to play chess and one day we had the idea to play but every time we killed a rival piece, the other person had to take off an item of clothing and said things to turn the other on meanwhile. It was such a turn on seeing him so focused but also getting more and more naked as the game went by. *chef's kiss*",
   "created_utc": 1697880316,
   "score": 38,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5su6u6",
   "message": "He’s teaching me how to use power tools and do my own renovations \n\nHe bought me a tool belt and that has inspired a whole new sexual role playing",
   "created_utc": 1697873311,
   "score": 195,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sw86q",
   "message": "Was fixing an issue with the dishwasher when my girlfriend appeared and said “let me take over, you tell me what to do”.\n\nNot expecting much, she then blindsided me by bending down in low rise jeans displaying a godly plumbers crack. \n\nIt definitely did the trick.",
   "created_utc": 1697874668,
   "score": 37,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5ssjmm",
   "message": "Girlfriend allowed me to shave her, it was an insane turn on",
   "created_utc": 1697872198,
   "score": 114,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5ta4y9",
   "message": "Honestly, initiation, I love it when I just kiss her goodnight, then she just starts kissing back, properly, and starts feeling me, I've also started working out lately, and I've developed muscles, so it's hot as fuck when she feels them during spicy time.",
   "created_utc": 1697883951,
   "score": 138,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sw9va",
   "message": "\"Hey, get in here. I'm literally in my underwear in this bed and have been trying to sleep with you for years, I can't code it anymore and just....get in here.\"\n\nShe was never super subtle but that made me actually go \"ohhhhh, so I wasn't imaging all of those hints for the last 10 years\"",
   "created_utc": 1697874698,
   "score": 109,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5syi0i",
   "message": "Me and my gf work at the same place.  It really turns her on when I wear suspenders with a long sleeve button shirt.  Idk why.",
   "created_utc": 1697876195,
   "score": 241,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5srdd0",
   "message": "my girlfriend crawled towards me in bed and leaned right over me, and for some reason that was such a turn on",
   "created_utc": 1697871408,
   "score": 21,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5td31r",
   "message": "She has a big chest, but always wears turtle necks or stuff that doesn't show any skin. \n\nShe once showed me a new sweater when we were alone, asked me how she looked, and I said it was cute.\n\nShe then pulled down the sweater, creating this massive cleavage, and said \"only cute?\"",
   "created_utc": 1697885879,
   "score": 99,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5s761n",
   "message": "I was not feeling well around new years. She was going to stay the weekend at my apartment. I got the flu called her told we need to cancel . She said we’ll I can come over and take care of you while you’re sick. I get home from class and my internship. She decorates my apartment with get well ballon’s and had made be soup. It was awesome",
   "created_utc": 1697858531,
   "score": 62,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sr2t9",
   "message": "Tied me up, blindfolded me, did her thing for a very very long time and right when it was my turn to finish she brought out a pinwheel and very delicately used it on some seriously sensitive places. I am not kidding you that was the most intense shit I have ever experienced.",
   "created_utc": 1697871213,
   "score": 169,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5s5rgk",
   "message": "Dancing, I can't dance but I loved watching her dance",
   "created_utc": 1697857809,
   "score": 28,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5so8yr",
   "message": "I once dated a girl that had a thing for doing stuff while on the phone. She once called a good girlfriend and was a little less secretive during the call while still putting up the pretence of it being a normal conversation. Apparently they had discussed it before hand but it was still a fun and surprising little encounter.",
   "created_utc": 1697869219,
   "score": 57,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sl6e4",
   "message": "Few exes ago. Just chilling, I start rubbing her shoulders. She gives a few low moans as I got some tender spots. Then said I was definitely getting lucky. But it was the tone of her voice and the look. Writers use the word smoldering and she was that, one hundo. That slow burn that you know can get blazing.",
   "created_utc": 1697867077,
   "score": 30,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tbbgq",
   "message": "For her birthday one year, my girlfriend and I got undressed as per usual, but instead of sex she pulled out a ribbon and put a little bow on Mr Happy so she could 'unwrap her present.' It was weirdly cute, endearing, and aexy at the same time.",
   "created_utc": 1697884727,
   "score": 70,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t2k1d",
   "message": "He has “surprised” me a bunch of times. For example one time I was sleeping on his lap and then he just leaned over and kissed me on the mouth. Might not be that creative but it was such a turn on just because it woke me up",
   "created_utc": 1697878944,
   "score": 184,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sq1f3",
   "message": "She had landed herself in a tv series and managed to sneak a line I find really hot into the script intended just for me. She didn’t tell me anything about the line beforehand, I found out while we watched the episode together.",
   "created_utc": 1697870524,
   "score": 33,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t4z4w",
   "message": "Girlfriend asked me to put lotion on her..needless to say there was more than one lotion in the place",
   "created_utc": 1697880531,
   "score": 110,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5supy9",
   "message": "By loving me unconditionally in a way no one else has ever done",
   "created_utc": 1697873669,
   "score": 87,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5smpiw",
   "message": "They sang ‘Business Time’ by Flight o the Concords 🤣",
   "created_utc": 1697868130,
   "score": 129,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sv67s",
   "message": "My gf likes when I talk to her in a British accent for some reason. It just does it for her for some reason",
   "created_utc": 1697873972,
   "score": 85,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5th5p8",
   "message": "I'm about to go shopping so I'm putting on a bra, hubby just walked into the room saw I was topless and sucked a nipple into his mouth and walked out. Now I have to think about that till tonight...\n\nI had just been reading though these answers on reddit so I had to come back overshare.",
   "created_utc": 1697888376,
   "score": 43,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t5ddg",
   "message": "I was sucking off my partner and decided to look up at him and go cross eyed. He came immediately lol",
   "created_utc": 1697880796,
   "score": 143,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t79dx",
   "message": "According to my wife when I play videogames it's a huge turn off for her. Except this one time when I was playing Soul Calibur 5 and I said \"Hey, look, in doing a new character that looks like me\" and she jumped on me with a glint in her eyes saying \"What if I do YOU instead?\".  \nI've never dropped a joypad quicker.",
   "created_utc": 1697882017,
   "score": 136,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5thb75",
   "message": "My ex and I used to sext while I was at work, mostly playful, no photos. So one time, she got my motor going at work, then with only a couple hours of work left, she told me she was tired and going to bed. Normally if we did this, it ended in me getting home and is having sex. I was pretty disappointed and annoyed at the blue balls. So I get home and I'm let down, but I go in quietly because she's sleeping. I get in and all the lights are off, except I see flickering coming from the bedroom. Sometimes she would leave candles on and I told her that was unsafe, so I would put then out for her. Well, she knew that. I go into the bedroom and there she is, laying on the bed, new lingerie on and a smoldering look. Not sure I've ever undressed faster. \n\nSame ex, another story. One of my turn ons is skirts with no underwear. So we live below this single mom, and she had a thing for me. I went outside to smoke with my ex and she was out there. She didn't see my gf and started to flirt a little. My ex was pretty annoyed and a little jealous. She went back in the apartment and I stayed out to finish my smoke. When I got back inside, there she was in a skirt with no top on and she bum rushed me into the wall and kissed me super hard. I was so turned on I spun her around and lifted her up and we had sex right there by the door. Windows open, thin walls and ceilings, she moaned super loud. I was well aware she was marking her territory and I loved her even more for it.",
   "created_utc": 1697888459,
   "score": 35,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5se8er",
   "message": "A spontaneous dirty pic at a random moment",
   "created_utc": 1697862535,
   "score": 225,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5ser38",
   "message": "Ex just sent a random nude out of nowhere. Good way to get me going, simple yet effective.",
   "created_utc": 1697862859,
   "score": 162,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tamjd",
   "message": "My girlfriend started using Linux.",
   "created_utc": 1697884275,
   "score": 78,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sek3q",
   "message": "My girlfriend will occasionally conduct “inspections”. This consists of her working through a laundry list of tasks, including checking the moles on my tummy, looking for pimples in my armpits and smelling the inside of my ear. \n\nShe takes it completely serious. For some reason it gets me going more than any thing else in the world.",
   "created_utc": 1697862738,
   "score": 127,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tawye",
   "message": "My GF loves when I do an impression of John Lithgow from Cliffhanger (he does a weird pan-european accent) in bed. Unfortunately for her, it's an instant bonerkill for me",
   "created_utc": 1697884467,
   "score": 20,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tcxbu",
   "message": "An ex once said to me that she loves how it doesn't take much to turn me on. She said it with a fascinated, but proud tone, and surprise, surprise, it really turned me on! To be fair, our sexual chemistry was off the charts.",
   "created_utc": 1697885774,
   "score": 25,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5swllz",
   "message": "She did a nude Bollywood dance.  Hilarious as well as sexy.",
   "created_utc": 1697874921,
   "score": 79,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5su5x8",
   "message": "She was talking on the phone in Galician with her bare feet propped up on the table. It wasn't her intention, but it really worked.",
   "created_utc": 1697873296,
   "score": 56,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tb7mc",
   "message": "It was my fantasy for her to wear my county's rugby shirt, white stockings and suspenders. Well, she did it along with a tiny thong which undid at the side.\nNot one wink of sleep was had that night",
   "created_utc": 1697884659,
   "score": 15,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t86x7",
   "message": "Not a partner but a FWB. Texted me that she had dinner ready as I was on my way over and she's left the front door unlocked for me to walk in. When I entered the house she was on the dinner table, legs spread wide open. I never was as surprised or as hungry in my entire life. Plus going down on a woman has always been my favourite thing.\n\nAlso an ex of mine had us play a game. When one of us got a call off a friend or family member, the other would go down on them to see who could make it difficult for the partner having a conversation on the phone. She randomly did it once when I was online with all my friends too.",
   "created_utc": 1697882632,
   "score": 29,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tlsxy",
   "message": "My wife yawns just before we start the act, I have been pavloved.  I get a boner every\n time she yawns now.",
   "created_utc": 1697890881,
   "score": 13,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5sw1ab",
   "message": "Man. It really seems to be the ladies doing the creative heavy lifting in bedrooms all over. Y'all get up to the damndest things, I gotta step my game up as do other men.",
   "created_utc": 1697874544,
   "score": 150,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5svufl",
   "message": "Breathing",
   "created_utc": 1697874416,
   "score": 23,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t351i",
   "message": "When we first met, she did not like my beard(!). Group consensus was it should come off,  but I said only if she went topless.  She did, and removed the beard.",
   "created_utc": 1697879317,
   "score": 38,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t3qc4",
   "message": "I wanted to watch rugby on telly.  She came in and handed me a beer while wearing her racing gear and boots.\n\nI watched the replay.",
   "created_utc": 1697879716,
   "score": 41,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tc83k",
   "message": "Not from my perspective but my GF. Turned out when she found me early in the morning reading a book with a blanket on, she turned on at the sight of it.\n\n\u0026amp;#x200B;\n\nAlso she was aroused when she saw me fixing the bidet like a plumber. Yeah I'm italian, and I don't get why any of you lot most definitely don't have that in your bathroom lol",
   "created_utc": 1697885313,
   "score": 12,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5ti6dp",
   "message": "Just wait until you've been married for 20 years. Never stop being creative. Creativity doesn't end just because you are married, have kids and job stressors.  Keep it up like you're still dating always because you never know  when the last day will be.",
   "created_utc": 1697888970,
   "score": 10,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t49pl",
   "message": "When we were on the bed making out getting ourselves into the whole mood to do the deed she slid my pants off using her feet",
   "created_utc": 1697880064,
   "score": 23,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t3wcd",
   "message": "She comes to me without underwear",
   "created_utc": 1697879824,
   "score": 18,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t8cxf",
   "message": "Showed up at my front door in red high heels and a long jacket. She stepped in, dropped the jacket, revealing that she was only wearing the high heels and carrying baby oil. She doesn't say a word, She walks to my bedroom, lays on my bed, face down, and does an over the shoulder squirt of baby oil onto her back, ass and it runs down to her vajayjay. Then she waits silently, looking over her shoulder with a \"it's your move\" look.",
   "created_utc": 1697882742,
   "score": 22,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tierb",
   "message": "I rem. Last gf I had came over after work. She was a teacher, and this day she decided to wear some glasses and these short shorts and sit down, cross her legs and say, “hey..”\n\nThat was it for me",
   "created_utc": 1697889102,
   "score": 5,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t5g81",
   "message": "I remember one time she rolled over in bed next to me. Drove me wild!!!",
   "created_utc": 1697880849,
   "score": 11,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tnhps",
   "message": "TL;DR: I can't describe this one very well, but this girl has mastered body language. She'll stand near me, but adjust her posture so her ass is just barely in my view, or she'll pull her shirt in just such a way that her breasts are barely visible from my height as she's standing next to me. It's hard to describe, but if I give her glance, she might give me a wink or a smile that lets me know she's doing it on purpose, even though she's pretending it's innocent. \n\nShe came into my office one time and sat on my desk wearing a skirt, and had her legs crossed showing off her thighs. She asks me to look something up for her in my main codebase, and right as I go to grab the mouse, she adjusts her legs so I am looking right up her skirt. She made it look so innocent, like it was just a coincidence. \n\nAnother time, I'm sitting in the break room eating lunch and she comes in to microwave her food, she's leaning on this table right next to me, but how she is sitting, she's about 2\" from sitting in my lap instead of propping herself up against the table. \n\nA different time, we're in her office and she tells me that she's got some suspicious looking mole on her back. She pushes the door closed and pulls her shirt up. She's showing me her back, but she's wearing this sexy bra and matching underwear and I can just see the top of it poking out of her jeans. Instant boner, especially as I'm looking at this mole (and she knows damn well I'm not a physician), but she's calling me \"Doctor\" anyway.\n\nNow before you say \"You know she wants to fuck, right?\" Yes. We are and have been for years, but it's a secret we keep at work which only makes it sexier when she does things like that at work.",
   "created_utc": 1697891713,
   "score": 1,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tbyah",
   "message": "She said she wants to take charge... she did everything. Ended with her putting a dildo on my ass and sucking my dick. So hot seeing her take charge. Fucked the shit outta her",
   "created_utc": 1697885138,
   "score": 9,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tjyui",
   "message": "Not that creative but he only needs to massage my lower back and butt \n\nworks everytime lol",
   "created_utc": 1697889973,
   "score": 5,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tonr1",
   "message": "Not sure if it’s very creative, but she woke me up with a bj in the morning before work.  That was pretty rad.",
   "created_utc": 1697892282,
   "score": 1,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5t67xk",
   "message": "Girlfriend allowed me to watch her while urinating in front of me. The rest is history.",
   "created_utc": 1697881344,
   "score": 21,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5th6bh",
   "message": "I remember reading on this sub a few years back the story from a girl saying that one day in bed her boyfriend started pinching her rib or something like that while having sex. \n\nHe did this every time they had sex for a year or so. Then one day out of nowhere in the middle of the day he pinched her rib and it immediately turned her on. \n\nDidn’t have the occasion to try yet but man this shows patience.",
   "created_utc": 1697888385,
   "score": 7,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tr3wp",
   "message": "I dunno about \"creative\", per se, but my girlfriend and I were baking a cake for her family once and as she was mixing the batter she put the spoon in my mouth, told me to swallow, then tongue kissed me to taste the sweetness.\n\nAll this occurred within like twenty seconds and I was rather disoriented following it all. Cute and hot, just like her.",
   "created_utc": 1697893427,
   "score": 1,
   "submission_id": "17ct0aj"
  },
  {
   "comment_id": "k5tqd0f",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ct0aj"
  }
 ]
}