{
 "submission_id": "17e5rqq",
 "title": "What's a piece of advice you received that you initially ignored but later found to be incredibly valuable?",
 "selftext": "",
 "created_utc": 1698015364,
 "permalink": "/r/AskReddit/comments/17e5rqq/whats_a_piece_of_advice_you_received_that_you/",
 "score": 102,
 "url": "https://www.reddit.com/r/AskReddit/comments/17e5rqq/whats_a_piece_of_advice_you_received_that_you/",
 "comments": [
  {
   "comment_id": "k61731g",
   "message": "Floss",
   "created_utc": 1698016362,
   "score": 2,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61eipw",
   "message": "We judge ourselves by our intentions. We judge everyone else by their actions.",
   "created_utc": 1698019585,
   "score": 150,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k615qbo",
   "message": "Cave quid dicis, quando, et cui.  \n*Beware of what you say, when and to whom*",
   "created_utc": 1698015795,
   "score": 174,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k618kdy",
   "message": "Taking care of your back",
   "created_utc": 1698016986,
   "score": 97,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61crjm",
   "message": "Your reputation takes years to earn, but only a moment to destroy.",
   "created_utc": 1698018811,
   "score": 2,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k618mtt",
   "message": "Don’t fall in love with anything that can’t love you back.",
   "created_utc": 1698017015,
   "score": 167,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k618o68",
   "message": "My grandma always used to say if you have a butthole you have a way to make money.\n\nAnd in this economy she's not wrong.",
   "created_utc": 1698017030,
   "score": 53,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61fvgx",
   "message": "Read instruction manuals. Everything from electronics to setting up a tent, you will get so much more out of your things. The one disclaimer, some manuals are shit. So... good luck.",
   "created_utc": 1698020181,
   "score": 24,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61bdz3",
   "message": "The associations you keep will inevitably be the qualities you develop.",
   "created_utc": 1698018205,
   "score": 29,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61ff2l",
   "message": "Be careful with the toes you step on. Might be the ass your kissing later.\n\nNever experienced it first hand but have seen it happen with many others.",
   "created_utc": 1698019980,
   "score": 234,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61f8g3",
   "message": "Procrastinating leads to a burden. It's the root of most problems, whether you are a kid or an adult.",
   "created_utc": 1698019898,
   "score": 34,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k618wpp",
   "message": "In all seriousness...\n\nDon't drink alcohol if you are suffering from anxiety.",
   "created_utc": 1698017132,
   "score": 217,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61q1sc",
   "message": "In a fit of mean-girl-ness, my best friend in 6th grade decided she would only be friends with me in private. She wanted to hang with a popular crowd at school and she didn't want to seem close to me there.\n\nNaturally, I was pretty upset about this. At the time, my father advised me to stop hanging out with her, and when I saw her in school, I should be \"polite but cool.\" Essentially, this was a sort of grey-rocking. \n\nI did not take this advice. In retrospect, I definitely think it would have worked. She was no idiot, knew I was a quality friend, and losing me wasn't worth it. But she saw me as expendable when she thought I would just cling to her anyway, which I exactly what I did.\n\nI did end up taking this advice of my dad's in other circumstances multiple times later in life and it is fucking perfect. \n\n(My \"bestie\" and I went through that one tough period and became close again afterward and still are.  However, my dad never forgave her.)",
   "created_utc": 1698024550,
   "score": 174,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61tlve",
   "message": "Bail somebody out once, you're a hero.  Do it 3,4,5 times, you're just enabling a problem.",
   "created_utc": 1698026081,
   "score": 55,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61chao",
   "message": "Care for your teeth.\n\nI could've done better",
   "created_utc": 1698018686,
   "score": 129,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61pvha",
   "message": "“The worst thing you can do when someone shouts, is to shout back.”\n\nThe amount of confrontations I’ve managed to de escalate just by calmly talking back…",
   "created_utc": 1698024475,
   "score": 252,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61nbum",
   "message": "Don't sweat it.\n\nI live that way now. It pretty much means that I don't give a shit anymore. I don't worry about things out of my control. And if I do fuck up, I don't let it get to me. I learn, and move on.",
   "created_utc": 1698023387,
   "score": 116,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k619mbh",
   "message": "A piece of advice that initially fell on deaf ears but later proved invaluable was to 'embrace failure as a stepping stone to success.' While I used to fear failure and its associated setbacks, I've since realized that every failure is an opportunity for growth and learning, and it has indeed paved the way for my successes",
   "created_utc": 1698017437,
   "score": 245,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61immh",
   "message": "“Never assume you know what a man is thinking.”\n-My dad\n\n“Watch how a man treats his mother and that will tell you a lot about how he will treat you.”\n-My grandmother\nEdit: This of course is just her advice coming from a time that’s long since gone, which I’m sure it applied to more than it might now. There’s always exceptions. \n\n“Never trust a fart”\n-Also my dad",
   "created_utc": 1698021371,
   "score": 80,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61al1d",
   "message": "Don't go grocery shopping when you're hungry.",
   "created_utc": 1698017854,
   "score": 30,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61ewha",
   "message": "Stop worrying about the opinions of people you don't respect anyway.",
   "created_utc": 1698019751,
   "score": 171,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61hx3k",
   "message": "An older friend once said to me \"Talk to women the same as you talk to men.\"  \n\n\nSounds ridiculous, but when I was a teenager I was very shy around women, but as soon as I started talking to them as if I was just talking to another guy, I noticed that they became attracted to me more often, I made more female friends, and completely lost my anxiety. You're showing women what you're really like, so they wont be disappointed when they get to know you and you suddenly drop the fake personality. I used to pretend to be sad or really uber confident, and it didn't work, but when I just spoke to girls as if they were guys, they related to me far more easily. I think you can spot false confidence, so you just have to speak your mind, and maybe occasionally say something nice about them. If they're into it, they'll respond.",
   "created_utc": 1698021073,
   "score": 84,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61g6do",
   "message": "You’ll never convince a narcissist that their behaviour is wrong, is abusive, etc because their ego is too big to admit they are wrong so there is no use trying.",
   "created_utc": 1698020316,
   "score": 181,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61avpr",
   "message": "Understanding math is essential to succeed in life.  \n\nYou don't always use a calculator for everything, but to be able to intuitively understand how exponential or compounding patterns work, how statistics can be manipulated, how to negotiate, how to budget, etc.  Even just intuitively understanding things like \"If I do this maybe it is a little risky but its probably like 0.5% chance so its fine.... but if I do that every week ehh then statistically it would result in a big problem every few years so that's not really a sustainable risk to take.\"  without actually calculating anything just understanding the concepts.",
   "created_utc": 1698017983,
   "score": 206,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k616s37",
   "message": "Don't stick your dick in crazy.",
   "created_utc": 1698016232,
   "score": 100,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61f27y",
   "message": "If you cant get along with your significant others family than don't marry them. Words of wisdom there people. Also don't fuck crazy.",
   "created_utc": 1698019823,
   "score": 42,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61dxz1",
   "message": "Wear sunscreen",
   "created_utc": 1698019333,
   "score": 61,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k616e6e",
   "message": "don't give a shit about what people think about you.",
   "created_utc": 1698016068,
   "score": 51,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61mveu",
   "message": "When I left a cushy and secure job at a television station to freelance in film \u0026amp; tv production services, my father cautioned, **\"Put away 10% of each paycheque for a rainy day.\"**\n\nI didn't take his words to heart -  and when, shortly after my first anniversary as an independent, the industry slowed to a crawl, and I encountered some tough times that I barely survived. I recall that at my lowest point I had the next month's rent in hand - just barely - but no money for food besides a small baggie of pocket change. My heat had been shut off in the middle of an Alberta winter, and I had to ask my father for a loan to pay the gas bill and for groceries. So by the time work eventually picked up again, I had learned my bitter lesson and began to follow his advice assiduously.\n\nForty years later, I retired with a surprisingly well-capitalized retirement account, and membership in a gold-plated private healthcare plan. And in three weeks, for the third straight  year, I'm forsaking frigid Canada to winter in Mexico.\n\nIn my young adulthood I suffered through 18% mortgage rates, 12% unemployment and a decade of stagflation, but I think in many other ways young people today are facing at least as fraught an economic climate as I did back in '81. And I understand that today, others’ ability to \"put something aside for a rainy day\" might be more limited than was mine. But I strongly encourage those who can, to do so.",
   "created_utc": 1698023194,
   "score": 231,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61q633",
   "message": "Comparison is the thief of Joy. \nDon’t keep up with the Joneses, in many cases the Joneses are mortgaged to their eyeballs, or are being helped by well heeled parents, or are secretly miserable. When I got to the point where I was genuinely happy for other’s success more than I was upset at how it contrasted my shortcomings/failures, I was much happier",
   "created_utc": 1698024601,
   "score": 107,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k619vj6",
   "message": "\"Banks are out to get you, stick with credit unions\"\n\nLearned that one the hard way.",
   "created_utc": 1698017547,
   "score": 218,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61ks6w",
   "message": "“Don’t let your mouth write checks your body can’t cash.”\n\nTook me a few overdrafts.",
   "created_utc": 1698022295,
   "score": 93,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61h863",
   "message": "If you're driving in heavy snow, stay in the right lane so you can see the yellow lines, that way you know you're still on the road. At 16 I thought the instructor was being dramatic, but having  driven in many a storm, he was absolutely correct",
   "created_utc": 1698020770,
   "score": 43,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61maoy",
   "message": "Pee after sex.",
   "created_utc": 1698022950,
   "score": 87,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61gl2g",
   "message": "'Your metabolism will catch up to you.'\n\n☹️",
   "created_utc": 1698020494,
   "score": 128,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61guyr",
   "message": "Don't sell your 401k just because you're in a pinch or want some time off",
   "created_utc": 1698020611,
   "score": 87,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k622onr",
   "message": "Write the date on the top or any document your receive or note you write.\n\nA stupid old man once told me that. Now I am the stupid old man.",
   "created_utc": 1698030065,
   "score": 42,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k627l84",
   "message": "Don’t cheap out on shoes, beds and tires.\n\nPretty much anything that keeps you off the floor\n\nRead this in Reddit about 12 years ago",
   "created_utc": 1698032423,
   "score": 42,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61wvxz",
   "message": "Don’t be afraid to let family members go if they’re toxic…learned my lesson the hard way with this one",
   "created_utc": 1698027532,
   "score": 41,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k62a050",
   "message": "You're job doesn't' care about you, your family does... stop giving your life to the one that doesn't care and invest yourself in the one that does",
   "created_utc": 1698033739,
   "score": 39,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k615j6l",
   "message": "I made a comment to my Journeyman when I was fresh out of high-school. I questioned why someone was paid so much. He asked why I cared and that everyone should be entitled to make as much as they want. That was 42 years ago and I've never forgotten. He was right.",
   "created_utc": 1698015712,
   "score": 99,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61cho8",
   "message": "Travel the world before you settle down. Once you get a partner / mortgage / job, it's much harder to travel.",
   "created_utc": 1698018691,
   "score": 186,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61gwda",
   "message": "For college-Go to office hours.",
   "created_utc": 1698020627,
   "score": 58,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61h159",
   "message": "Trust your instincts, even if you really don't want to.",
   "created_utc": 1698020685,
   "score": 56,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61l1q3",
   "message": "The one comment I taken to heart is, 'Just walk'.\n\nIt applies to everything. When we get excited, nervous, upset, we all have a problem with rushing and screwing things up.  I heard it as a Paramedic, when my partner said that to me as I was running to some scene. In that case I was physically running, but we all need to slow down, think about what we need to do and what is safe. If we apply to every situation to spend a few moments to consider our actions, the repercussions of doing something wrong, and running headlong into bad circumstances does do the victim, the problem or yourself any good.  Take the time to walk through mentally and physically what is best and right thing.",
   "created_utc": 1698022407,
   "score": 54,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61l55g",
   "message": "The financial rule of thirds.\n\n1/3 to costs, 1/3 to spend, 1/3 to save.\n\nNow, I couldn't ever do this, but aspiring to it made all the difference.\n\nNo I don't expect, in this economy, that you're gonna get close. That's not the point, it's making sure you have savings, and minimising costs.",
   "created_utc": 1698022448,
   "score": 59,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61m9bm",
   "message": "Stop chasing happiness. Start seeking fulfillment. It will bring a natural flow of emotions as you succeed, fail, or experience life and you'll grow as a person. It will also help with you finding a purpose in life other than work, Netflix, bills.",
   "created_utc": 1698022933,
   "score": 54,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61v9am",
   "message": "Save money for the future and don’t spend it on things you don’t NEED",
   "created_utc": 1698026814,
   "score": 27,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61xilx",
   "message": "Watch your weight now because it’ll be harder to lose it the older you get.",
   "created_utc": 1698027784,
   "score": 29,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k619drd",
   "message": "Fake it till you make it. (Just like everybody else.)",
   "created_utc": 1698017335,
   "score": 89,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61wpzy",
   "message": "Live below your means.",
   "created_utc": 1698027457,
   "score": 48,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61nvg6",
   "message": "If your friend or coworker complains about others to you, they are saying bad things about you to other people.",
   "created_utc": 1698023618,
   "score": 72,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61f0pc",
   "message": "Don’t make assumptions",
   "created_utc": 1698019804,
   "score": 22,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61gy4d",
   "message": "Leave a blanket in your car. Great for hiding things, and when it’s cold in the morning ❤️",
   "created_utc": 1698020648,
   "score": 24,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61lycf",
   "message": "Don’t smoke.",
   "created_utc": 1698022798,
   "score": 19,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61tzim",
   "message": "Fate doesn't care about plans\n\nSeems ridiculous, but I always think about it",
   "created_utc": 1698026251,
   "score": 22,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k628g63",
   "message": "'You have two ears and one mouth - use them in that portion' - My father",
   "created_utc": 1698032882,
   "score": 21,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61czhv",
   "message": "If you don’t like your SO’s parents’s behavior there’s a great chance you won’t like your SO after a few years. \n\nI’d heard this while dating my ex-wife. We got married. 15 years later she became a total conspiracy nut and Q,Anon junkie. She became cruel and a total GOP nutter. Her behavior was so like her parents but when I pointed it out she became enraged, called me a Dem sympathizer, and filed for divorce. I was republican at the time but switched parties after Trump came into office. I guess she was partly right.",
   "created_utc": 1698018909,
   "score": 139,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61u5gj",
   "message": "Rest is part of the process",
   "created_utc": 1698026325,
   "score": 39,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61p70n",
   "message": "Learn another language while young",
   "created_utc": 1698024187,
   "score": 16,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61v1lz",
   "message": "“Don’t try to bullshit someone that’s an expert at bullshitting” - My Dad",
   "created_utc": 1698026721,
   "score": 14,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k626hk4",
   "message": "Not everyone needs to know your business.",
   "created_utc": 1698031848,
   "score": 15,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61f4r3",
   "message": "Protect your back. Always use proper lifting techniques at work or home.",
   "created_utc": 1698019854,
   "score": 14,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61m8t4",
   "message": "Wear sunscreen",
   "created_utc": 1698022927,
   "score": 13,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k627dfw",
   "message": "“You might think we are mean parents but you will thank me later when you have to deal with kids who’s parents don’t care about them”",
   "created_utc": 1698032308,
   "score": 15,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61p348",
   "message": "What you permit, you promote.",
   "created_utc": 1698024141,
   "score": 31,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k621rv7",
   "message": "A friends dad told me to move out asap after highschool. He could see through my parents. I couldn't see how fucked up everything was until I moved away.",
   "created_utc": 1698029658,
   "score": 14,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61d3x7",
   "message": "Wait til your in love before having sex. I know I'm lame I'm just speaking for me",
   "created_utc": 1698018963,
   "score": 63,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61vb57",
   "message": "You only live once and life is short",
   "created_utc": 1698026837,
   "score": 12,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61hhrz",
   "message": "Don’t marry your high school sweetheart",
   "created_utc": 1698020889,
   "score": 54,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61t3so",
   "message": "“If people gossip with you, they’ll gossip about you.”",
   "created_utc": 1698025860,
   "score": 11,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k627qqu",
   "message": "The only person-centric advice continually given and continually ignored but right every time: when someone tells you who they are, listen.",
   "created_utc": 1698032503,
   "score": 12,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k61o7rw",
   "message": "Don’t start a business needing to make money",
   "created_utc": 1698023762,
   "score": 11,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k62h60s",
   "message": "Another saying that serves as advice, “El pez por su propia boca muere.” Meaning, “the fish dies by its own mouth.”\n\nSo watch what you say, it can have bad consequences.",
   "created_utc": 1698038119,
   "score": 8,
   "submission_id": "17e5rqq"
  },
  {
   "comment_id": "k624izu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17e5rqq"
  }
 ]
}