{
 "submission_id": "17e9k28",
 "title": "What was the “Gut Feeling” that you listened too that saved your life?",
 "selftext": "",
 "created_utc": 1698026742,
 "permalink": "/r/AskReddit/comments/17e9k28/what_was_the_gut_feeling_that_you_listened_too/",
 "score": 186,
 "url": "https://www.reddit.com/r/AskReddit/comments/17e9k28/what_was_the_gut_feeling_that_you_listened_too/",
 "comments": [
  {
   "comment_id": "k620303",
   "message": "Driving uphill behind a flatbed truck carrying I-beams and I envisioned them sliding off the truck and hitting my windshield. I changed lanes so I wasn’t behind the truck and two seconds later, the I-beams were sliding off onto the road where my car would’ve been, sparking and gouging the pavement. Terrifying. To this day, I won’t stay behind a truck with anything that’s “strapped down.”",
   "created_utc": 1698028899,
   "score": 151,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64cur0",
   "message": "I was 18, freshly out of high school and got a job at a newly opened pizza place. The crew was all younger kids around my age, I quickly befriended another girl working there but there was a guy, maybe a year or two older than me, who just gave me the weirdest vibes. I just felt uncomfortable being around him. He didn't really do anything outright strange, he hit on me and kept asking for my number, but I had a boyfriend (now my husband) and kept turning this guy down, he was never rude or about it or anything, so I had no real reason to feel anything was off about him, but I did.\n\nSometimes while I was working, I'd feel like someone was staring at me and I'd turn around and he'd be watching me from the other side of the kitchen. I remember telling the girl I had befriended that I just felt something was *off* about that guy and he made my skin crawl. Another coworker, who had gone to school with the guy, overheard the conversation and told me that he understood, his friend could be intense and off-putting but he was mostly harmless. The other girl and I just kind of tried to laugh it off but she agreed that something just didn't feel right. \n\nI always worked the late shift, so I could start after my college classes and I worked until close, one night the creepy guy got off work maybe an hour or two before close and I was scheduled to close. So he leaves at his scheduled time, and I work until close and then go to leave and walk to my car. It was around 1:00AM at this time and super dark, as I'm walking to my car I notice someone else in the parking lot, it was the creepy guy and he was just... standing there. Watching me. His car was still there so he wasn't waiting for a ride, he had just waited for me to leave. I got in my car and felt just incredibly weirded out by the entire thing so I left, went home to my apartment, told my partner what happened and then sent my manager a text and said I was sorry, but the creepy guy was making me uncomfortable to the point that I couldn't work there anymore and that had been my last night. I never went back.\n\nAbout a month later, I see on the news that the creepy guy from the pizza place had followed the other girl from work, the one I had been friends with, one night after a closing shift. He had waited outside her house in the dark, broke in when everyone was asleep, murdered her dad, and held her hostage/assaulted her for hours while the police and swat team tried to get him out of the house. \n\nI still think about her a lot, and at the time I felt genuinely guilty about what happened to her, as if I could have done something to prevent it.",
   "created_utc": 1698077131,
   "score": 91,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k6311it",
   "message": "Not mine but my mothers \n\nI was five and walking with my mom to visit a friend. We were going to have lunch and see her new kitten. \n\nWe walked up the driveway and my mother stopped to look at the front of the house. She noticed all the windows facing the street were closed with the curtains down. Very unusual for her friend who enjoyed watching birds at the feeders placed throughout the yard. \n\nShe quickly picked me up and began back down the driveway. I protested that I was hungry and wanted to see the kitten. My mom hushed me and carried me home.\n\nThis was in the late 70’s before cellphones. She called her friend several times and then called my father and asked him to check on her friend as she was worried. \n\nMy mom was right to be  worried. Her friend had been raped and murdered by an intruder. He was never caught. \n\nSomething about those closed drapes warned my mother away from that home and may have saved us from an encounter with an evil person.",
   "created_utc": 1698053729,
   "score": 154,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64upvf",
   "message": "When I was \\~13 I  was walking to the bus stop in the morning. A car was going through my neighborhood *very* slowly, which made alarm bells go off in my head. When it passed me, I glanced over my shoulder to keep an eye on it and saw it was doing an immediate U-turn. \n\nNope'd right out and dove through the bushes, crossed a bunch of driveways, and found a neighbor who was washing his car. I looked back to where I had been standing. The strange car had stopped, a seriously scary looking dude had gotten out, and was looking in the bushes. \n\nIdk if I would've died exactly, but I would not have had a good time.",
   "created_utc": 1698083553,
   "score": 176,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63e2t8",
   "message": "The lump wasn't a cyst and the rib pain wasn't just from coughing too hard. That was cancer.",
   "created_utc": 1698062475,
   "score": 122,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64pg5p",
   "message": "Not my life but my son's. I was 33 weeks pregnant and I  noticed my son wasn't moving as much as usual. I waited a day and nothing changed.  Despite advice by doctors and family saying I should just stay home and he wasn't moving as much because he was just running out of room to move I went into the ER and had my son that night due to fetal distress. He had his umbilical cord wrapped around his neck 8 times and weighed just 3 lbs.  He spent 30 days in the NICU and now is a happy 2 year old.",
   "created_utc": 1698081668,
   "score": 137,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64x7qo",
   "message": "My grandmother accidentally saved my mom's life by not allowing her to go to a sleepover when she was young.  During the night the father murdered his entire family and would likely have killed my mother had she been there.",
   "created_utc": 1698084450,
   "score": 144,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64esmt",
   "message": "It was very late driving \u0026amp; there were minimal cars on the road, I came up to a red light \u0026amp; as it turned green something inside me said “don’t go yet” \u0026amp; a van blew through their red.",
   "created_utc": 1698077836,
   "score": 243,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64rfef",
   "message": "About 2 years ago me and my dad loved going on night walks, It was something we’ve always done more less every night. One night however as were about half way through our daily route we got to an alleyway. Now normally I’ve never thought anything of it but something this night just told me not too walk through , I had a really bad feeling and I urged my dad to just go back home. He kept brushing it off and saying I was just scared of the dark and nothing was going to happen. After a couple of minutes of arguing we finally turned back and walked home. \nTurns out about 20 minutes after we left there was a completely random attack in that exact alleyway that left a poor young girl stabbed thankfully not to death but with life changing injuries . I still dread to think what would of happened if we didn’t walk back.",
   "created_utc": 1698082375,
   "score": 73,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62hhp3",
   "message": "Not saved a life but definitely serious injury, we had a workshop in our place and we had to book them in.\n\nSo Brad (not real name) thought it'd be fun to hold a nail gun in for repair on someone's hand. \n\nWe both told him off for it, but he retorted \"it's alright I checked its got no nails in it\" \n\nAnd then used it on the table instead, and *bang* goes right through the table.\n\nTurns out while it didn't have any nails, the firing pin had snapped inside and that nailed into the table before being reset back into the nail gun.\n\nHe never messed about with nail guns again.",
   "created_utc": 1698038336,
   "score": 124,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62ttaa",
   "message": "I was pregnant in the very early weeks (5/6 weeks), and started getting these intense pains on the right side of my abdomen. Like so extremely painful that I woke up in the middle of the night and couldn’t make noise or move. \n\nWent to my doctor the next day, and he said I was being hysterical and it’s completely normal to be in pain when you’re pregnant. He refused to get me to an OBGYN, and said I could go private if it was such a big deal. \n\nWent to a private scan, and my pregnancy was ectopic (stuck in my fallopian tube), and my tube had ruptured and I was bleeding internaly. Was rushed to hospital, and had surgery to remove my tube that night. \n\nIf I hadn’t booked that scan I would have died in my sleep that night due to internal bleeding.\n\nEdit:\nWow thanks for all the upvotes, it really makes me feel seen and heard 🫶🏻",
   "created_utc": 1698047709,
   "score": 103,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63bgbv",
   "message": "I was riding my bike around my school building on a weekend, there was nobody else around. I liked to zoom along the sidewalks and hop off the curbs into the parking lots, it was fun to have the place to myself. At one point I was going along one side of the building, and I would usually have just continued off the curb and gone straight ahead. For some reason, I decided to brake hard and try to make the 90 degree turn to stay on the sidewalk at the corner.\n\nA garbage truck rumbled by, exactly where I'd just decided not to be. I wasn't aware of hearing it coming, I was kind of zoned out, but some part of me must have. That really rattled me.",
   "created_utc": 1698061006,
   "score": 251,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63k50y",
   "message": "Husband went to pick up takeout in the winter while it was snowy. As he was leaving he got a feeling to stay inside the restaurant and not go to his car. So he stayed for an extra minute and right then a van slid on the ice and hit his car on the driver's side where he would have been had he gone out.",
   "created_utc": 1698065577,
   "score": 50,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k633mtv",
   "message": "Guy asked me for help with bus fare, offered to take me to an ATM. I got a bad feeling and dipped. Saw him on the news a week later for robbing somebody at gunpoint.",
   "created_utc": 1698055766,
   "score": 145,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k658elt",
   "message": "Not me, my mom. \n\nGoing through a divorce. Drinking heavily. Fighting with my dad a lot. Really toxic environment. She started drinking one night but something in her gut just wasn’t feeling right. Not sick, but the alcohol just wasn’t sitting right. \n\nShe stopped drinking. Went to bed. Woke up to the house completely on fire. She made it out. Our pets did not. \n\nHad she been drinking like she usually did (a bottle or more per night), there’s a strong chance she never would have woken up. Her ex husband (my dad) set the fire in an attempt to kill her and cut ties.",
   "created_utc": 1698088451,
   "score": 247,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64ks1m",
   "message": "A friends feeling saved me from my gut.\n\nI had just finished hosting a meeting (I swear it was productive) and a friend said \"you dont look so good\".  I had just come off a weekend boat diving in the Red Sea and figured I was just tired.  My friend said \"nah man, Im taking you to the doctor.\"  The doctor at our clinic poked me a few times and said \"take him to the ER and tell them its his appendix\".  I was in surgery less than 90 minutes later.   My surgeon said I was 2-3 hours from it blowing up.  I lived alone and no one would have missed me until the next day.",
   "created_utc": 1698079984,
   "score": 226,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k6243w5",
   "message": "Had a weird feeling in my chest, experienced some shortness of breath, decided to drive to the ER and have it checked out.  Was having a heart attack. Fixed me up with a stent.",
   "created_utc": 1698030688,
   "score": 204,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62moya",
   "message": "Once I was walking back from a store with my friend. We were already in a neighborhood area near a little park, it was pretty safe where we were, she had her headphones in but I didn't. At this point, I'd noticed a white van that'd been trailing behind us since the Trader Joe's parking lot, I did not think much of it..but I realized that the windows were TINTED, like DARK. Now this was a red flag for me, where the gut feeling started. We walked for about 2 more minutes and it was still there. There were 2 guys in the car and one of them rolled down their window, he smiled at me and then turned to the driver. He spoke Spanish, but so did I. I swore I heard him say \"This should be easy, hm?\". Then I noticed the van about to park next to us. At this point, my friend noticed too, and glanced at me. One of the men was about to speak to us, but we ran full sprint down the sidewalk to the park at the end, there were always people with dogs there so it was the safest place at the moment. This was at about 4PM, so it wasn't that late. I don't know what would've happened, but if we would've kept walking like normal, id have an idea of what wouldve.",
   "created_utc": 1698042012,
   "score": 92,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64x95b",
   "message": "This guy invited me over for wine when I was new in LA. When I got there, he was just being weird, and said let’s wash your feet. Took me by surprise, and I took off. Years later and he is currently in jail waiting for trial for the murder of two women he apparently drugged in his apartment.",
   "created_utc": 1698084463,
   "score": 146,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64os7b",
   "message": "I was driving along a rough mountain road heading home from work. The mountain pass ends at a lake, and you drive around the lake to meet up with the main road. \n\nI got to the bottom of the mountain and started down the lake road, and saw this stunning bright rainbow over the lake. I had this weird gut feeling and urge to stop and look at it, with the way the sun was shining it didn’t make sense that there would be a rainbow but it was mesmerizing. So I stopped and stared at it in awe. \n\nA couple of seconds later, as soon as I looked back at the road, a massive boulder came barreling down off the cliff above about 20 metres in front of me, hit the road, and smoked all of the concrete barriers as it went into the lake. I 100% would have been killed if I hadn’t stopped.",
   "created_utc": 1698081429,
   "score": 20,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64epqj",
   "message": "I refused to get in the car with the guy who said:\" i can still drive\"  after the party.\n\n3 people crashed into a bridge and died.\n\nLucky me i guess",
   "created_utc": 1698077807,
   "score": 149,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63npxu",
   "message": "When on vacation in a foreign town, I went to a public toilet with my 4y old. In front of the entrance was a woman, talking on the phone and taking a quick look at us. Something in that look felt really off and I decided to keep my eyes and ears open for her. Entered the restroom with my kid and heard the front door open and close but no stall door being moved or locked. I quickly grabbed my son and walked towards the main door, where said woman was already standing, looking at a map and trying to involve us in some form of conversation. I tried to keep moving towards the main entrance, but she stood in the way. Suddenly I got a strange feeling, looked to the men's toilets and saw a huge guy quietly leaving a stall, that wasn't all closed. Pushed the lady aside and got the hell out of there with my son. \nWe would have been robbed or worse, pretty sure about that.",
   "created_utc": 1698067249,
   "score": 189,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k651qne",
   "message": "My wife was going to go on a road trip with friends down to a bigger city for a concert. She had done this several times before. Friends were close friends of ours but for some reason, I felt off about it that one day. I said to her ‘babe, I don’t know why and you can ignore me if you’d like. but I don’t think you should go. I don’t know why, but i feel like something is going to happen’ \nShe knows I’d never tell her not to do anything she wanted. It was out of the blue and out of character for me. So she decided to stay home and watch movies with me. \nAbout 2 hours later after the rest of the crew left, we got a phone call that they had gotten into a severe accident. 2 friends in the hospital and someone from the other vehicle dead on scene. Had she gone along, she would have been sitting in the seat where they had been hit by the other driver and most likely killed. \n\nSomeone, somewhere, somehow was warning me. And I’m glad we both listened to it.",
   "created_utc": 1698086070,
   "score": 94,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62i6cz",
   "message": "Went to the gas station for snacks \u0026amp; something just told me to park in the spot second from the door instead of the one directly in front. About, 15 mins later, a truck comes flying through that very spot \u0026amp; into the door \u0026amp; out the back wall. Most surreal moment of my life.",
   "created_utc": 1698038798,
   "score": 122,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63i2iq",
   "message": "About to overtake a truck loaded with scaffolding poles. It was raining really heavily. For some reason I sat 5 car length’s away when suddenly a car in front of him braked and the truck hit him   That scaffolding went every where. I got past it with milliseconds to spare. I could see the mayhem in my rear view mirror.",
   "created_utc": 1698064561,
   "score": 31,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k61x097",
   "message": "Decided not to skip school and go to the mall on a day there was a shooter downtown",
   "created_utc": 1698027584,
   "score": 133,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64pq2y",
   "message": "My husband and I were snorkeling in the late afternoon/early evening in Hawaii on our honeymoon. It was this beautiful bay, and the marine life was unforgettable. My husband got excited and waved me to swim out further to where he was. He is a very strong swimmer and likes to push boundaries as well. \n\nWhen I got there, there were all these fish tightly packed into the rocks. Hundreds of them squishing in as tight as possible.  When I saw that my gut feeling was \"we need to get the fuck out of here\". \n\nHe didn't realize this was a fear response from the fish and was so excited to see so many. I begged him that we need to get out of the water, something is wrong, fish don't behave like this. I got desperate and even tried pulling him with me. Finally instinct took over and I took off back to shore. He followed me around ten minutes later--annoyed that I had cut the swim short.\n\nNext day it was on the news that a tiger shark had been in the area and attacked two locals. One man lost a leg. Now, I'm not saying the tiger shark was there licking its chops, it could have been something else that spooked the fish, but now my husband listens to me when I say \"gut feeling says no\".",
   "created_utc": 1698081768,
   "score": 138,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k6205s6",
   "message": "I felt completely normal, but had a gut feeling something was off, I was sick, *something* was wrong and I should go to the doctors. After spending the entire day asking my dad to take my temperature, he finally did and I had a 105.3°F fever. Literally almost dead. He rushed me to the ER and I spent my Easter in the hospital for a kidney infection.",
   "created_utc": 1698028934,
   "score": 185,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k655k97",
   "message": "In middle school, I was up late one night. Mom and brother asleep, dad gone on business. I had let the dog out, and when I went to go get him, I got a bad feeling like someone was out there. There wasn't really a reason to feel this way, it was just dark, and I got spooked, so I put the chain lock up on the back door when we got back inside. Back then, we never locked our doors. A few minutes later, the dog is drinking by the back door, and he suddenly stops and starts growling (like a low grumble) at the door. I was sitting where I could see the dog but not the door. Then I hear the door pull open and the chain lock catch. The dog started barking like crazy and I ran upstairs to wake my brother up. He went out and looked around, but no one was there. I think the dog's barking scared them away, but I dont know who it was or what would have happened if I hadn't locked the door.",
   "created_utc": 1698087434,
   "score": 157,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63mknn",
   "message": "I was in a straight city road in the late evening with no cars and few intersections and was driving along with my friend following in the car behind. I was on autopilot more or less and I saw my friend flash their lights, and looked up and saw a car broken down with no lights in my lane. I was able to break and get out of the way in time but would have totally collided if my friend hadn't flashed their lights. After we get where we're going, I thank them for flashing and tell them how I hadn't seen, only for them to say huh I didn't flash my lights. \n\nI think they had gone over a bump and their lights had just directed up briefly. And I was just really really lucky.",
   "created_utc": 1698066722,
   "score": 28,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62xr71",
   "message": "Walked away from a bomb in 2001 (no one was killed, and injuries were fewer than intended); I'd been dithering about going home when something in my head said \"don't hang around, head for the station now\". Heard it go off a few minutes later.   \n\nMedically, kept telling GP something wasn't right despite reassurances, and begrudgingly they sent me for a scan. Spinal tumours. When I got the same not-right feeling a decade later and pushed for tests, a different GP believed me. It was still luck the sonographer found the pancreatic tumour so quickly, as the first scan was booked for lower GI/pelvis, not upper GI, but at least she did!",
   "created_utc": 1698051044,
   "score": 3,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k61vvuc",
   "message": "My ex wife attempted to invite me to a get together \"to help mend old wounds\". I felt off about it and turned it down. I found out a week or so later from a friend she had a falling out with that she wanted me there so she could say I tried to rape her.",
   "created_utc": 1698027092,
   "score": 247,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k6291p0",
   "message": "A few times I just listened to the voice that said don't just go,  when it turns green.    Hold and look hard,  and some asswipe just plows through the red right where my door would have been.",
   "created_utc": 1698033208,
   "score": 141,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63rr52",
   "message": "I was walking home in the dark one night, and as I approached my building I seen a man cross the road to follow me. I had a bad feeling and ran up to the close door and made sure it had locked behind me. Shortly after, the man was banging against the glass trying to get in. Don’t know what would have happened if I hadn’t ran.",
   "created_utc": 1698069011,
   "score": 87,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k61y5ki",
   "message": "Was driving to work one morning and my phone buzzed a few times. I only know one person that messages me like that but I thought it was weird because she would have been on her way to school so I dunno what she could possibly need from me at that time. Pulled over and checked, she'd sent me pictures of her English homework (ESL) and asked me to help asap. Looked up from my phone and there was a massive car accident that I very likely would have been in the middle of had I not pulled over.",
   "created_utc": 1698028046,
   "score": 122,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64iro7",
   "message": "On one of the last weeks of high-school years ago I decided to skip and walk home as it was a fairly short walk only a couple blocks away. I had to cross a couple side streets and 1 really busy main road on my way. Something deep down told me to stop and wait before I got to the crosswalk to hit the button and walk across. So I stopped for only a few seconds to double knot my shoes and as I'm looking up a f150 looking truck runs the red and plows thru the lamp post and the crosswalk button I was only about 15ft from.",
   "created_utc": 1698079262,
   "score": 250,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64zx95",
   "message": "I was a rower (like the rowing that’s on the olympics where everyone is sitting backwards) in high school and college.\nWe practiced an a massive river in my city and there where tourist boats, rowing teams, sailboats, you name it.\n\nOne day I was leading a 4 seater and sitting at the stern of the boat, when i noticed a small sailboat coming towards us with some serious speed, but I didn’t say anything because those boats can turn on a dime.\n\nI looked over again a few seconds later and thought to myself “they aren’t going to turn” even though they easily could have. I screamed for more pressure and everyone was confused, but did it anyways.\n\nLess than 10 seconds later the sailboat crashed into us, missed my torso by about 6 inches, snapped my oar in half bruising 2 ribs, and crushed the stern of the rowing shell.\n\nWithout the extra bit of power I would have died, and some of my teammates would have most likely been seriously injured.",
   "created_utc": 1698085413,
   "score": 253,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64kdxx",
   "message": "I was working at a Dollar General running the cash register. It was pretty slow and there were some boxes that needed to go to the back room. Something kept telling me not to take them back yet. When it finally felt right, I took them back and heard a loud crash. A girl who was just learning to drive drove the car through the store. It stopped on top of the cash register. There would have been no easy way out if I was there. It was a very surreal feeling and I still think about it 16 years later.",
   "created_utc": 1698079844,
   "score": 194,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k655yfp",
   "message": "I went to see a film with my girlfriend and after we picked our seats, I felt we were sitting too close so we moved back a few rows. \n\nHalfway through the movie (Blair Witch Project), the ceiling tiles fell and crushed the two seats that we had originally chosen. Creepy as hell, but we got vouchers for 2 movies tix so I guess that’s nice.",
   "created_utc": 1698087575,
   "score": 120,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64d7fr",
   "message": "Not my story; my fiance's father decided to sprint to the gate and get on his plane, and had to argue to be let on the flight because he was late. Had he missed his plane, he'd have been on one of the two flights that hit the world trade centers on Sept. 11th, 2001.",
   "created_utc": 1698077258,
   "score": 172,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k6425u3",
   "message": "Was on a date with a guy years ago, and had met with him before in public with no red flags or anything weird happening. To all intents and purposes he seemed totally fine and was perfectly polite, if a little bit of an odd nerd (I’m a nerd too). Was hanging at his place one day and got a weird gut feeling that said go home NOW and don’t let him drive you. I listened and left, made up some excuse at the last second when Uber arrived and got out. He switched from being normal to obsessive, begging me to come back, to date him, to then angry and rapey and gross. Found out from some people in the community he was on his way off the deep end (mental health issues I wasn’t aware of and he didn’t disclose and masked very well when I was with him) and I jumped ship at the last second. Guy ended up being a stalker to another person who had to move because of him, thank god he never found out where I lived",
   "created_utc": 1698073162,
   "score": 238,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64qbzy",
   "message": "When I was in grad school, I took the bus back to Chicago after spring break, but we got delayed and it was 3am when we got to Chicago. I didn't have cab money so I was stuck walking to the El, dragging my suitcase.   \nThe backstreets were deserted that time of night, so I was hurrying. Then a car came up behind me and started following me, just a bit slower than I was walking so I couldn't quite see them. They would drop back and then roll up again.  \nI considering running. At the time, I was in the best shape of my life. My intuition told me to just turn around. Turn around and look them in the face. I don't know what my face actually looked like to them but they drove away after that.",
   "created_utc": 1698081984,
   "score": 50,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64pmcc",
   "message": "Weird intuition runs in my family. I have tons of stories of super weird shit I \"predicted\" when I was a kid that I ended up coming true. And of course instances as an adult of being right about gut feelings many times, but my favorite story is:\n\nEveryone was at home but my brother. I was chilling in the living room and my mom was in her room. My mom comes BARRELING out of her room out of breath in absolute panic. Grabbing my arms and going \"When's the last time you talked to brother?!?!\" I told her to relax and that he had JUST left for a ride on his motorcycle. She wouldn't relax and made everyone call him and she called him multiple times. At first he wouldn't pick up, but then he finally did. He had been hit by an SUV maybe five miles from our house and the SUV took off. He ended up in a ditch, but he was wearing his protective gear and thankfully the car hit the bike not him. Just a couple bruises, thankfully. But somehow she knew the moment it happened. \n\nMothers truly know everything. She said a lot of stuff that seemed extremely odd and like she was completely out of it when she was dying in the hospital, and some of that ended up being true too.",
   "created_utc": 1698081731,
   "score": 124,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62vpwu",
   "message": "After treatment and getting clean, an old using buddy that used to steal cars with me pulled up, told me to get in the car and for some reason I did not and then I didn’t see him for 6-7 months, and it turned out that that same day he crashed that car into a house and was trapped there for like six days. He lived if I remember correctly legs, arms and pelvis were broken. People are on vacation.",
   "created_utc": 1698049329,
   "score": 106,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64n6k8",
   "message": "I have to thank my drivers Ed teacher for this one. \n\nI was drive by with a bunch of friends stopped at a light when it turned green I hesitated and a car ran his red and hit another car in the intersection. I didn't think anything of it, but a friend in the car said wow you saved us, why didn't you go on the green. The only reason I can think of is our high school drivers Ed teacher repeating things like a car is a coffin, always check the intersection before proceeding, etc.",
   "created_utc": 1698080850,
   "score": 15,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62cgo5",
   "message": "My ex saved both of us. I was driving on a curving 2-lane connector to another freeway, in the left lane, and he said, Move over, there's a car stopped in the left lane. Instinctively moved over, and farther around the curve there was a stopped car in the left lane. He was so calm about it, and I was totally freaked out.",
   "created_utc": 1698035168,
   "score": 86,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k6534uq",
   "message": "My mom and grandpa were putting out a kiddie pool for my siblings and I in our backyard when we were little. My grandpa had set it up, and my mom kept insisting that for some reason she felt like they should move it to a different spot. Thankfully they did, and while we were all playing in the pool, a huge branch from a tree in our yard snapped and came crashing down exactly where the pool had originally been.",
   "created_utc": 1698086567,
   "score": 77,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62q5pa",
   "message": "Didn't save my life but I was standing next to a car with an open door and suddenly I got an \"alert\" in my head that something was wrong.  So I moved my left hand.  Immediately at the moment I began moving my hand the door slammed shut with a ridiculous amount of force.  In doing so the edge of the door banged into the side of my hand instantly making it numb.  Had I not received that alert and moved my hand instead my hand would have been crushed inside the door against the frame of the car likely causing permanent damage rather than just 15 minutes of tingling.",
   "created_utc": 1698044707,
   "score": 108,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64wq93",
   "message": "Didn’t save my life, but when I was 18 I went to a bar and me and one the servers were making eyes at each other- when I left the bar he followed me out and gave me his number. He told me he was in his 20s and asked me out, and I just had a gut feeling that I shouldn’t (which was strange for me because I made a lot of bad decisions with men at that age). A few months later I saw him in the news as he’d been arrested for voyeurism for videotaping himself having sex with women who didn’t know they were being recorded and the police were trying to ID the other victims. And he was actually in his 30s.",
   "created_utc": 1698084274,
   "score": 199,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63tvoy",
   "message": "It was early morning. Was at a stop light heading to work. For some reason I kept feeling the need to jump over to the next lane and make a left and go what would be the longer route. I switched over to the left lane, light turned green, I made the left and as I was driving I heard  screeching and a loud boom.  A big rig spun out of control in the intersection because they were going too fast and their cab slid across the lane that I was in and hit the pole.  The lane I was originally in was still red. If I didn't switch over to that left lane in that turned green, I probably would be dead.",
   "created_utc": 1698069902,
   "score": 128,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k653ix6",
   "message": "Not mine but a friends. One day he was working a closing shift at the barber shop he worked at. He had decided that day to do a little bit of extra work around the shop after closing, wiping down surfaces and some computer shit. Normal shit yknow. He didn’t have to but just felt like he should. That same night someone shot up the train that he used to get home, specifically the very back car, the car he always chose. And based on the timing it would have been the exact train he got on if he had left at his usual time. We are both very grateful that the shop was slightly messier than usual.",
   "created_utc": 1698086708,
   "score": 63,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62xzvs",
   "message": "I have to cross a busy road every day on my way to work. Standing while waiting for the light to change one day the speed of the cars going by bothered me, so I stepped back a few steps. The light changed, and as I started to walk forward a car crash happened as someone ran a red light.\n\nEveryone was ok, but if I'd not stepped back I'd have been stepping out into the intersection instead of still on the sidewalk.\n\nAnother time I decided I was too tired to ride (I often ride my bike) and took the bus instead...the bus rolled up to the intersection on a crash I very likely would have witnessed had I decided to ride my bike that day. The crash was one car pinning another to the big lightpost with the \"crosswalk request\" button on it where I would have been if I'd ridden that day. Emergency hadn't even yet arrived, and the fire station is close enough you could see it if there weren't a line of trees. That was just me being lazy though, not a gut feeling. Very disconcerting all the same.\n\nEver since I hit the crosswalk button and then back up or circle around so I'm well back from the crosswalk apron, two close-calls is two too many and I'm not pushing my luck.",
   "created_utc": 1698051242,
   "score": 220,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62od6c",
   "message": "I was driving home on a dark busy highway and saw a black truck with red writing on it that gave me an uneasy feeling. I stayed a lane over from it and behind. Not more than a minute later an suv came and sideswiped the suv a car infront of me and it rolled and hit the concrete barrier on the roof. Had I been closer to the suv I wouldn’t have been able to stop fast enough and I could’ve been the one in the wreck with my head smashed into the ground",
   "created_utc": 1698043297,
   "score": 165,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63wf9x",
   "message": "i walk alone sometimes. i can usually tell if someone is about to shout something obnoxious out of a moving car at me. once or twice i’ve gotten an entirely different feeling from an approaching vehicle and known immediately that i needed to turn a corner. change directions, go somewhere more well lit, or otherwise get away. i don’t know what [if anything] this feeling has saved me from, but i obey it immediately.",
   "created_utc": 1698070927,
   "score": 4,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65bqze",
   "message": "Not my life, but helped a friend. Was meeting up with a friend I hadn’t seen for a couple of years (we used to work together) and was waiting outside the boba tea place we agreed to meet up at. They drove up and parked, she had a strange look on her face and another car pulled up nearby. I immediately walk up to my friend’s car door to greet her and talk to her. We go inside the boba tea place and get our drinks and by the time we got back outside, the other car was gone and she told me they had been following her for a while and she was so glad that I was there waiting for her. And that I greeted her in an overly bubbly manner haha. Scared off the shady guy with good vibes ✨",
   "created_utc": 1698089644,
   "score": 60,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k655jov",
   "message": "When I was about 7 I was by all accounts an extremely trusting kid. One day when my dad was out with my brother going to his frisbee game (my dad coached) they took me and my dog too and I stood on the sidelines. For context the field is about two soccer fields next to each other and it’s fenced all the way around by a metal wire fence. I was sitting with my dog outside this fence and my dad was a considerable distance away from me and couldn’t really see me as they had to go to the middle of the field. A random man came up to me and asked to pet my dog and of course I let him and started rattling off facts about her. He told me that he wanted to get a dog but he was nervous and wanted to see how they were first. I told him my dog is very nice so he could practice with her. He asked me if he could walk her around the park area and I (completely straying from my usual instincts) told him I wasn’t sure how she would react to other people. He told me it was fine and that I could walk along with him. This seemed completely reasonable to my 7 year old self and I agreed and he told me to come over to his car where he had dog treats. Something clicked in my mind and I told him that my dad was probably worrying about where I was by now. His face went GHOST WHITE and he sprinted away. I thought nothing of it and didn’t even tell my dad about the whole interaction until I saw his face on tv. He had been caught after kidnapping and killing a child.",
   "created_utc": 1698087428,
   "score": 104,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64kioe",
   "message": "They hired this guy who sat in the aisle away from me and i could tell he was \"off\".  Just too aggressive, really outdated attitude towards women, kept changing his name and had this military fetish.  I took a random day off, just out of nowhere, to find out that he got fired for saying he was going to kill a coworker.  I guess the cops were called and had a pile of guns in his trunk.",
   "created_utc": 1698079891,
   "score": 228,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65db25",
   "message": "I got high and missed the Dawson school shooting in Montreal. I was supposed to meet a friend but figured smoking a joint was a better idea.\n\n She called me during the shooting asking where I was, that it sounded like someone set off firecrackers. She was fine. The scary part was not being able to call her or text her back as all the towers were jammed up.",
   "created_utc": 1698090186,
   "score": 52,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64o57s",
   "message": "I canceled on a trip only to find out later that the train I was supposed to catch got in an accident!",
   "created_utc": 1698081198,
   "score": 100,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k651qqa",
   "message": "Not life saving, but it is only one I really distinctly remember! It certainly saved me some emotional turmoil. \n\nI kept a journal when I was 12-13, fairly common thing. Some of my journal was truth and some of it was not. I was a nerd who imagined friends / popularity I wanted and wrote stories in the journal as if they were true. It had poetry and also had real secrets and thoughts of mine.  \n\nOne day I got this gut feeling that I REALLY need to rip out 2-3 key pages that dealt with my mom.  No clue why…. Just felt I should get rid of them immediately. So I did!\n\nAbout 3 weeks later my mom snooped in my room. Found my journal, xeroxed it, distributed copies to a few friends of hers and sent me to therapy as punishment.  ( the fake stories I had written claimed I had a boyfriend and snuck out of the house to listen to sinful music). I found out about the journal when 5 minutes into my first session the therapist pulls out the highlighted journal and asked why I wrote certain things and where the missing pages are.  \n\nAny info my mom got about real friends was used against them and their parents were told their secrets.  Lost those friends.  My lies were obvious as these people just didn’t exist but I was sent to therapy to question why I fantasized of such a worldly life and to see if I had been impure. \n\nThank goodness I destroyed the pages about my feelings toward my mom and the fact I didn’t think I was Christian anymore.  Those would have made the rest of my teen years just awful.  Not to say there were great…. But as long as my mom didn’t feel directly attacked or shamed we were OK.",
   "created_utc": 1698086071,
   "score": 103,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64yj56",
   "message": "Traffic light turned green while I was the first car waiting behind the line. I didn’t immediately put my foot on the gas pedal and hesitated for a second, then someone ran the light in the opposite direction doing about 50mph.",
   "created_utc": 1698084922,
   "score": 46,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65dbmj",
   "message": "Woke up around 4am with a mild but persistent pain in my chest when I was 27. Sort of like a muscle cramp, like maybe I slept in a weird twist. Couldn’t fall back asleep and had work at 8am, so just figured I’d stay up. The pain persisted, didn’t get much worse but didn’t go away. I texted my boss at 6am that I was sorry but couldn’t make it. I was living with my father at the time and asked him to drive me to the ER because my gut was telling me “something is not right”. They hooked me up to an EKG and the young doctor looked at me, an almost perfectly healthy 27 year old with no history of heart problems and said “holy shit, dude, you’re having a heart attack…”\n\nWhisked into the back of an ambulance and taken to the nearest hospital with a proper cardiac department and after several tests, I had an infection causing Myocarditis. They pumped me full of blood thinners and I rode it out for 3 nights at the hospital. On the last day they snaked a camera up through my wrist to check for long term damage and I had made it out relatively unscathed. Sent home to “take it easy and slowly get back into an exercise routine. Take 1 aspirin a day for the first month and come back for a checkout”\n\nMoral of the story: don’t fuck around with or ignore chest pain.",
   "created_utc": 1698090192,
   "score": 93,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k63y8ta",
   "message": "Spent 14 hrs with a pain in my side it wasn't crippling pain but noticeable well after 14 hrs I thought this ain't going so I went to the  hospital and it was appendicitis \nDoctor said it was swollen to the point of bursting and I was very lucky. Never been so quick getting seen to than that time I told them I had a pain in my side so they felt it and the nurse literally grabbed my hand took me to a bed a doctor came round and did the same then they wheeled the bed to the room they put you under. It was like a total of 20 mins by the time I was in surgery.",
   "created_utc": 1698071649,
   "score": 157,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62w3pa",
   "message": "when i was younger two friends asked me to go deer hunting up in the ozarks, sounded fun but i didnt go, later i found out, they ran out of beer 2nd day, went looking for beer, found a man with moonshine,they caused so much trouble that night both got put on probation for several years, unlike them i came from a poor family, had i been with them i might have gone to prison. i felt very lucky",
   "created_utc": 1698049655,
   "score": 180,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64w3sw",
   "message": "I ride a bike a lot and you get used to the feeling of approaching cars that come out of the blue and one day I was in tune with that feeling and I didn't know why I couldn't tell why to stop but I just knew I need to stop and sure enough a car whipped around the corner right in front of me into a parking lot without any warning they would have it would have slammed into me hard as s*** but I survived that because I listen to the random feeling that I should just stop in my gut",
   "created_utc": 1698084045,
   "score": 73,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k656nn4",
   "message": "Up in Northern PA had a gut feeling I need to turn around and walk put of the woods I was hiking. Turned out to be a good idea because I saw the big cat that was tracking me on my way back out",
   "created_utc": 1698087826,
   "score": 39,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65oild",
   "message": "Don't go out with friends tonight. Convince them to watch Netflix instead. Pulse shooting in orlando happened that night in 2016.",
   "created_utc": 1698094105,
   "score": 37,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k6362q4",
   "message": "The first summer I learned to drive a tractor my grandfather asked me to pick him up in the bucket so he could take a live chainsaw to go cut a small tree that got tangled in some powerlines. I can still here him cussing and shaking his head when I walked all across about 3 different fields of farm and got his wife to yell at him.",
   "created_utc": 1698057556,
   "score": 202,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62zmdr",
   "message": "Was picking up some takeout very late at night to bring back to my buddies, decided to take a detour as my Spotify crashed on my phone and I am simply a person who refuses to not have Slipknot blasting in the car\n\nTurns out some drunk guy caused a big accident at an intersection on my way home and I would have been hit if I didn’t take that detour.",
   "created_utc": 1698052586,
   "score": 43,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k654bvu",
   "message": "When I was 16 years old I was supposed to go visit my dad on the weekend but I ended up not going for some reason. That weekend my best friend and his friends ended up rolling a convertible and one of them died. I have no doubt in my mind that I would have been in that car if I would have gone to my dads.",
   "created_utc": 1698086995,
   "score": 32,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k655v3s",
   "message": "I was riding my motorcycle on the highway. In front of me was a pickup truck with some nice wooden kitchen cabinets on it. It gave me a bad feeling so I dropped behind it like25 meters, much to the anger of the car behind me. However a minute later, one of the cabinets bounced up and out of the back of the truck and smashed into the highway, since I gave him ample space, I was easily able to avoid the debris.  \n\n\nI don't know if it was a \"gut feeling\" or a \"Never ride behind pickup trucks with stuff in them common sense.",
   "created_utc": 1698087543,
   "score": 30,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k658qg1",
   "message": "Not getting into car with some dude when I was leaving video arcade (yes, this was many moons ago). He was plying me with how hots girls would be there at a party and could put my bike in back l, etc. I was naive but a bit of a toublemaker in 8th grader and this sounded like fun. But my gut (really my mom's intuition she instilled) told me not to and mentioned mom be worried. Dude had answer for everything. It was  not until many years later that I realized this guy wanted to abuse me. As a guy, it just did not dawn on me. Dodge death? Maybe. Dodge a life changing in a bad way experience? No doubt.",
   "created_utc": 1698088569,
   "score": 31,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65anqe",
   "message": "Not me but my aunt decided one weekend to visit my grandmother who was suffering from lung cancer. She stayed through Tuesday and called out of work Monday and Tuesday. She worked on the 92nd floor of the World Trade Center for an engineering company. Everyone that showed up to work on 9/11 (that Tuesday) was killed, I believe the plane hit below her floor trapping them. Lots of funerals.",
   "created_utc": 1698089250,
   "score": 34,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65uzn1",
   "message": "It was 4 in the morning, and I had to walk 15 min drunk home.\n\nA few streets from home, I don’t know how, but I had the gut feeling I was being followed.\n\nTurned right, the guy turned right. « Fine, a popular street during the day ».\n\nTurned left, and he turned left. Then I changed crosswalk, in order to « see if he followed ». He did.\n\nThank god I had my keys ready, and was 50 meters from the grid protected common parts of my apparement. I opened and closed as fast as I could.\n\nAnd then this guy. He was standing right behind the grid and said « so that’s where we’ll stop? » with his blue eyes wide open and a strange smile.\n\nI simply said « yes » and turned, then took the stairs calmly and went to my room. \n\nAnd then I had a semi panic attack lol.",
   "created_utc": 1698096424,
   "score": 30,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65k0mj",
   "message": "Back when I was 18/19, I had taken a couple of days off work due to feeling very flu/cold-like. I was laying in my bed feeling out of it, very groggy, sleepy, and weirdly, confused. I also had weird, sharp, jabbing pains in my gut when I woke up.\n\nIt was the middle of the afternoon, Mom was at work, Dad at work, and sister at school. Then, shortly, I heard my Dad come home (my bedroom window was above the garage).\n\nThen suddenly, I felt this super-intense, deep-seated feeling of impending doom. Like, if feelings were put into words, \"Omg, OMG! ***OMG!!!*** Get to the hospital!!! *NOW! NOW! NOW!*\" \n\nI've never, ever felt such an unreal sense of urgency and much less to a hospital. It scared me, but I listened to myself and called shakily out for my Dad downstairs to please come up quick.\n\nYou do not tell my Dad what to do, even if it's important.  I heard him puttering downstairs, so I yelled again, louder, \"Dad! Please, come here, quick!\" He yelled something back, like, \"Hold on. I'm busy.\"\n\nA couple more minutes, this terrible, urgent feeling is only getting worse. \"DAD!!!\" \n\nHe comes bursting up the stairs yelling for me to \"Shut up, stop yelling in the house! I just got home! I don't need you yelling and screaming in the house! The whole damned neighborhood can hear you scream!\"\n\nNormally, I would shut right up, but not this time. I interrupted him and told him in a scared, loud voice, \"Please, take me to the hospital! Now!\"\n\nHe looked at me and said, \"Why? What's wrong? I'm not going anywhere, I just got home. Your Mom will be home, she can take you.\" He turns to go into the master bedroom. \n\n\"DAD! I don't know what's wrong, but you HAVE TO TAKE ME, NOW! PLEASE!\"\n\nHe sees my scared face, \"Well, you're not going *anywhere* until you get into that shower.\"\n\nI jumped in, took the quickest shower ever, and urged him to get in the truck and go.\n\nMy sister came home from school, and she took her time grabbing what she wanted to take with her, and we finally got into the truck and left.\n\nOn the way there, he said he may as well stop at the university photographic history for photos he's had on order on the way to the hospital.  (!!!)\n\nAt this point, I'm fading. I'm in my seat belt all shlumped forward, I don't remember too much. Dad was inside the building, for I think about 15, 20 minutes. Sister kept asking if I was alright. She was worried.\n\nFinally, he comes back in the truck and starts to show us the photos of the old west in our town. I perked up enough to tell him, \"I don't think I'm going to make it.\" That lit a fire under his butt, I think it was because he saw how pale I was.\n\nHe ended up taking me to this tiny, dinky urgent care facility in an old small strip mall, thinking it wouldn't cost as much as a hospital emergency room.\n\nUrgent care staff took one look at me and told him either they call the ambulance or he fast-tracks it to the ER ASAP. He *finally* got how serious it was. 🤦🏼‍♀️\n\nThere was a bottleneck at the OR (busy, crowded), and they got me right in for exploratory surgery. The next morning, my surgeon told me that had I been just 35, 45 minutes longer, I wouldn't be in bed right now.\n\nMy appendix had burst hours earlier, lilely while I was asleep, and I was in the advanced stages of deterioration/bacterial infestation (whatever it's called). I had to spend 12 days in isolation in the I.C.U.\n\nIf I hadn't felt that \"impending doom\" and acted upon it, I wouldn't be here.",
   "created_utc": 1698092524,
   "score": 59,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k62ckbk",
   "message": "Someone else's gut feeling actually saved my life.\n\nI was studying abroad and there were torrential rains that slightly raised the level of the river but more importantly dumped downed trees, trash, and other hazards into the river, as well as caused its current to become extremely fast.  I was walking home from the bar alone, very drunk, and thought it'd be funny to jump off one of the historic bridges into the water.  I knew I was a good swimmer.\n\nThis kid in my class had texted me around that time and I told him I was hanging out on the bridge checking out the water.  He had a gut feeling that something was off and he showed up and immediately wrapped his arms around me and wouldn't let me climb the bridge wall to jump.\n\nStill not sure if I was trying to swim or kill myself.  It was a time of deep depression for me, but I also like jumping off stuff into water in general so idk.",
   "created_utc": 1698035228,
   "score": 65,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65g5fz",
   "message": "Sibling and I were playing on the grounds of an elementary school near our house on a Saturday, back in the day when local schools didn't lock up their grounds on the weekends. A man on a bike circled us a couple of times on the playground, then stopped, dropped his sweats, and started asking us questions as he jacked off. I didn't even think of protecting myself, I was thinking about how to get my younger sibling out of there and away from this fucking pervert. By instinct I politely answered a couple of questions as I took sibling's hand \u0026amp; backed away. He was too busy jackin' it to follow us, fortunately (?). When we got around the corner of the school building I told sibling to \"RUN, we're going home,\" and half-dragged them back to our house. I kept looking back to make sure he wasn't following us because it was just so obvious this guy was sick and dangerous, targeting young girls like that. \n\nI was 11. Sibling was about 8. Turns out this guy had been going around the neighborhood doing this to other girls around our age, the cops had him on their radar and it wasn't until he actually assaulted a girl that they were able to arrest him. \n\nI don't know what he might've done to us other than flashing us, but 11-year-old me wasn't planning on sticking around to find out. F that.",
   "created_utc": 1698091175,
   "score": 25,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65h01z",
   "message": "Went on a class trip to Latvia, Riga in my last year of high school. I was year older than the rest cause I was a fuckhead who took a year off to do dumb shit with friends at the time. Several of my friends got in to trouble for various petty crime stuff while I tended to avoid it or leave before things got too heated. \n         Now back to the trip. We met some students from another school who talked about a club where we all could meet and party. While looking for this spot we met three locals who said they knew the place and that we should follow them. It was me, 3 girls and a guy from the class at the time. I noticed that the street they took us down had almost no Street lights and many of the buildings were halfbroken/burnt/deserted. Also noticed that the third guy was now way behind us. Looking side-to-side at the main street we came from. Scouting to see if others saw us walking in. He turned towards me and he looked started for me noticing. Then I heard the front guy say. It's in the basement of this warehouse. There was no people, no sound, no nothing. I shouted to my friends in Norwegian that these guys were trying to set us up too no good. Rob us or something. They instantly ran back with me to the street all while we heard the guys running after us and shouting obsceneties. The one with best English screamed \"Typical rich Norwegians. You come here to our country to party and take what's ours fuck you!\"\n\nThe day after we heard that one of the students looking for the same club from the other school got kidnapped near that street. They took him to the forrest, ripped off his clothes and beat him up in the snow. Took him to an atm and had him withdraw the little cash he had. Beat him again cause they thought he was rich and had more. He was found naked in the curb near the hotel he slept at. They threw him out of the car while speeding by.\n\nI like to think that the little street smarts I learned from hanging with the wrong crowd taught me to be wary of certain body language and vibes that certain people give off. Who knows what would have happened to us if we went inside that basement with those wackos.",
   "created_utc": 1698091475,
   "score": 27,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k661bxt",
   "message": "Years ago I went into my garden at night, after my husband had left for a roadtrip minutes before, and saw a pair of sneakers in dark, in the gap between the fence and our house. I didn’t think, I just said very loudly “what are you doing there?”  When he didn’t reply I shouted GET OUT OF MY GARDEN!  He muttered “yes ma’am” and scuttled off. \nAlso not thinking, I picked up a bbq knife that happened to be right there, went through the house to the front windows and saw him crouched by my car in the driveway. I called the cops, they arrived, we discovered that someone - probably the same dude - had just broken into our neighbour’s house and stolen a gun. \nThe cops gave me a condescending talking to about the ‘risks’ of confronting a criminal but I am convinced to this day that my instincts saved me from a life altering and horrible experience. We humans are animals and one animal know when another will fight like hell. \n\nWe got an alarm system after that. And the guy came back several weeks later. I looked up to see him on our porch, about twenty feet from the sidewalk. Called the cops again. They sent a SWAT team this time. And a helicopter. They got the guy. He was a serial rapist they’d been looking for for years.",
   "created_utc": 1698098798,
   "score": 27,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k64p8hk",
   "message": "     I was walking on an old rail bed trail that runs along a river and leads into about a 600m tunnel which pops out into a residential neighbourhood. I was on the river side of the tunnel where it is forest and water that's it. Through the tunnel on the other side I could see a person enter the tunnel at about the same time I did. As we got closer to crossing paths I noticed he had a limp and was walking quite fast towards me.  The hair on the back of my neck stood up and something in my head was like, something isn't right, gtfo of here. So I called out \"Hey there\" in a friendly tone - dead silence, he said nothing back. I turned around and ran as fast as I could.  I only looked back once to see this guy was in a full out sprint after me. As soon as I got out of the tunnel I started screaming for help and turned up an embankment that I knew led to the closest house. And I just kept running until I stumbled in their front door. I had an asthma attack and scared the shit out of the home owner, but I just know something terrible was about to happen to me in that tunnel.",
   "created_utc": 1698081591,
   "score": 154,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k622z2v",
   "message": "I can’t describe the feeling. It was an eternity of debating packed into a single second. \n\nFor the first time ever, despite all my training, I ran from my bio parent.\n\nI knew the consequences. I couldn’t imagine there was anything worth those consequences but something said GO and I did.\n\nI fled to the neighbors house. My new and first friend’s mom I barely knew from school hid me in her daughters room while she confronted my bio at the door. \n\nI don’t know what was said but my bio left me there. I’d broken a cardinal rule and instead of consequences I was safe.\n\nA few months later my friend’s mom was my mom and I was her sister. She gained full custody of me and I learned how many times over I nearly died and all the ways. The local sheriff even stopped by to thank her because he thought I was going to end up dead in a ditch somewhere.",
   "created_utc": 1698030192,
   "score": 20,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k654482",
   "message": "Someone offered me a chocolate and told me there was no peanuts in it. I almost took a bite, stopped, picked up the box and there was peanut oil on the ingredients list. It was like an automatic reaction, without thinking I just halted before putting the chocolate in my mouth -  it is still trippy to think about.",
   "created_utc": 1698086919,
   "score": 50,
   "submission_id": "17e9k28"
  },
  {
   "comment_id": "k65ntp3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17e9k28"
  }
 ]
}