{
 "submission_id": "17f49dp",
 "title": "adults of reddit, what advice can you give an 18 year old, just coming into the real world?",
 "selftext": "",
 "created_utc": 1698121127,
 "permalink": "/r/AskReddit/comments/17f49dp/adults_of_reddit_what_advice_can_you_give_an_18/",
 "score": 2,
 "url": "https://www.reddit.com/r/AskReddit/comments/17f49dp/adults_of_reddit_what_advice_can_you_give_an_18/",
 "comments": [
  {
   "comment_id": "k67jfq4",
   "message": "Take care of your back. Even if it's 10m of yoga in the morning, and work out too, a little is better than none.\n\nOh and take care of your teeth.",
   "created_utc": 1698122082,
   "score": 44,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67hyx3",
   "message": "Value your time. Don't let those who ain't worth it, steal it from you.",
   "created_utc": 1698121230,
   "score": 91,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67iae4",
   "message": "Stay curious! Learning is such a joy of life",
   "created_utc": 1698121409,
   "score": 131,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ro50",
   "message": "Your life isn't ruined just because something doesn't work or pan out like you planned.",
   "created_utc": 1698127481,
   "score": 118,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ig2a",
   "message": "Buy a plunger before you need a plunger.",
   "created_utc": 1698121499,
   "score": 198,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67hzbe",
   "message": "Debt is slavery. Treat it with great caution.",
   "created_utc": 1698121237,
   "score": 19,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ijfg",
   "message": "Start saving. Compound interest is a strong force",
   "created_utc": 1698121554,
   "score": 165,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67jyrf",
   "message": "No matter how smart or right you think you are now, just remember every 10 or so years you'll look back at your younger foolish self and laugh at how misinformed you were.\n\nDon't bother with gambling",
   "created_utc": 1698122391,
   "score": 111,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qjo5",
   "message": "Slow..The Fuck…Down. \n\nThat’s not a criticism. Sooo many kids just outta high school, out of their parents house, think they need to start life with a bang and live it all right away. You have (statistically) 50+ years to live. You don’t need to get it done right now.\n\nDrinking isn’t worth it, not that much fun, and expensive as hell. The fun isn’t the drinking, it’s the friends. You can have a great time drinking soda while they drink all the crazy stuff. There’s something to be said about being the sober one around a bunch of drunk folk. I know, I did it for a looong time.\n\nSex is fun, and kids can be too. When it is time. Some diseases can be cured, others not so much. Whether you have had sex or not, have a current partner or just going free-style, or are holding off, guess what. It is nobodies business but your own (and partner(s) if you have any). Don’t be pressured by people that seem to think that your sex life is in any way something they need to worry, think, or care about. When you get to that point in your life, if a partner wants to criticize one way or another, you just got yourself a great message that you need to get out. My wife and I have different pasts in that regard. But in no way do we think that the past means anything to each other. Neither of us feel that they should have lived one way or another just because we were going to meet in the future. Cause how could we have known.  People are who they are.\n\nMoney is great. Can get you many things. But can also lead to trouble. I worked a career for 20 years, 40 hours a week, responsibility, paperwork, licenses required to be able to do the job. Then Covid hit and I was furloughed, eventually laid off. Now I work as a prep cook at a pizza place. With hourly and tips (not a tip-wage state, so I get at least minimum wage before tips are applied) I make 70-80% what I did in a high-stress (for me) medical career job. And this has almost no stress, except for when I have to deal with customers, but that’s the autism showing. For a while I did Amazon flex delivery, and occasionally did some in affluent areas. I was amazed at how many of these expensive, beautiful homes were fully dark in the afternoon/evening times. If you spend your whole day/week working to sleep in a nice house, is it really worth it? A single bedroom home gets you the same place to put your bed. Make what you need to live your life, not work it away. \n\nFind friends that, when you are texting at 2:00 in the morning cause one of you is having a hard time, you can call “brother” or “sister”. When my life was hell, and I mean that in all the ways imaginable, I had a married couple as friends that treated me as family. Invited me over every day for a while, never expected me to leave. Included me in normal family things, like when the wife was doing a class for her job. She was doing the at-home test, and we all three were working on it together. Fed me like I was one of them. They knew, and saw, what the state of my life was. I had money in the bank, a nice house to live in that I shared with my brother. A nice car. But I was alone. Surrounded by friends and family, I was more alone than a polar bear in Siberia. And they saw that, they felt my pain, and decided that they were going to help me bear it. Nothing expected in return, didn’t even mention that was why they were doing what they were doing. That’s a friend.\n\nSo take your time. Things will come as they do, people will enter and leave your life. I once asked an older co-worker who knew how to be honest, frank, and kind. I asked her once “When will ______ happen.” And in her soft, caring voice, she responded with one of the best, truest statements I have ever heard. \n\n“When it is supposed to.” \n\nSo don’t force it, ride the wave of life as it goes. Enjoy it, you only get it once. You will get older, you will look back and wish things were different. That’s not despair or regret, that’s how life goes. We know much more about the past than the present cause we have seen it. So take your past and use that to go forwards. But always forwards. Yesterday can’t be changed, today is to be lived, and the future to be planned for. But plans can and will change, so keep plans firm, but not solid. Smack a stone with a hammer, it breaks. Smack a puddle of water with a hammer, it goes everywhere. But smack jello with a hammer, and it wiggles. So make plans like jello. And also eat jello, it’s yummy. \n\nYou are at a wonderful time of life. The future is there, it will come, and enjoy it. And in that future, when you hear someone else young ask for advice, share yours. It’s the only way we as a people will learn.",
   "created_utc": 1698126684,
   "score": 45,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67itzu",
   "message": "Always be a nice guy, and friendly at work. Otherwise you’ll be stuck at the bottom forever.",
   "created_utc": 1698121725,
   "score": 61,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67k7oq",
   "message": "Avoid social media, protect your privacy and keep photos and videos off the internet",
   "created_utc": 1698122541,
   "score": 52,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67mtuc",
   "message": "For guys: don't stick your dick in crazy\n\nFor women: don't let crazy stick their dick in you",
   "created_utc": 1698124182,
   "score": 45,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q08w",
   "message": "1) if you go to college, make sure you get an internship at a good place. It’ll make finding a job easier and possible.\n\n2) if you decide to do a trade, look into a union apprenticeship program. A union is a good option with benefits and protection compared to a crappy job without those things…\n\n3) if you decide to be an entrepreneur, look into getting skilled in something first with your job, because if you have a good job that pays the bills and expense then itll shave off time building a biz. You can also learn in a job and branch out Eg start your own electrician business.\n\n4) know basic finances: Get good credit. Don’t get into debt. Don’t use your credit card over limit, try to use cash or debit. Save % money you earn. Look into index funds. Be very careful about spending money because money give you options in life. Something that flies, floats, or f***s, rent it.\n\n5) one day when you’re older you’ll realize that health, happiness, and harmony is what you really want, meaning get good sleep, diet, and exercise now. Make it a fun thing to do. You don’t want to wake up at 30 and have tinnitus or crackly joints and skin etc. your mind and body is all you got. Nothing, no money in the world can replace them… if you got achy teeth, every problem in the world can’t compare to that constant pain. Same with headaches. Same with chronic sleep deprivation……\n\n6) how much you go up depends on your relationships and one thing I wish I can impart is to ask more. Go for the no if you’re asking someone out. You can learn something from everyone. Take a retail job if you have to break out of your shell. Again, always go for that fast no. Would you go out with me? No. Would you like fries with that? No. Would you give me one dollar for starving kids in Africa? No. But I guarantee you going for no fast is better than hesitation and regret. And one person might say yes. Then you got somewhat a bond.\n\n7) don’t do stupid shit in gambling, drugs, and sex. These 3 vices are dangerous because they can single-handedly ruin your life or set you back years and years. Other vices like gluttony and greed could too. But those 3, due to their addictive nature, can make a vibrant young man into a beast, someone without control over themselves. Control in your thoughts are important so you don’t express them in those ways and ruin yourself with the consequences. Fill your void with something less like video games, best if you find a purpose that can replace games but oftentimes purpose only comes after the desire to get out of hardship and the trials of life.\n\nIdk if I make sense but these are some things I would say to my younger self. Probably one more thing id say is to go experience life. McDonald job don’t have to be bad. Etc.",
   "created_utc": 1698126310,
   "score": 21,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67idgu",
   "message": "Remember, everything you do now has adult ramifications. Want to be a dick to some guy with your buddies? You're a legal adult now, so he might well beat you up the same way he would a 40 year old guy. A cop will now treat you like an adult, no different from a 30 year old. You go to real jail. Real prison. I think a ton of 18 year olds are so close to being a teen, they don't realize how much the \"legal adult\" thing changes everything.",
   "created_utc": 1698121458,
   "score": 85,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67i0e4",
   "message": "Using names like \"13yodruglord\" on social media might of been cool when you were 12, but now it just makes you look like a moron.",
   "created_utc": 1698121254,
   "score": 109,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67jplk",
   "message": "Stupid behavior quickly brings harsh results.  Guaranteed.  Smart behavior brings better results but it seems sooo slow.  It’s not.  It just seems that way. While stupid behavior may seem easier, faster, and a chance to beat the odds of bad rewards, it always results in stupid.  Net advice:  don’t be stupid.",
   "created_utc": 1698122241,
   "score": 13,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67s2io",
   "message": "Treat everyone with respect. Whether they’re a CEO or a janitor. On that note, when you’re going for a job interview it starts when you’re in the vicinity, the subway stop before you get there, the elevator etc. you never know if you’re gonna be a dick to your interviewer before you’ve even sat down in front of them. It’s happened more than you’d care to think!",
   "created_utc": 1698127773,
   "score": 12,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67kh0a",
   "message": "Protect the following:\n\nYour credit score \n\nYour driving record (keep it clean)\n\nYour criminal record (don’t have one)\n\nYour sexual health ( fuck often safely)\n\nMore\n\nDon’t get fat \n\nDon’t get married young \n\nDon’t have kids very young or very late (do some planning)\n\nGet a passport\n\nTravel cheap and light \n\nAlways be learning \n\nAlways be looking for a new job\n\nFind stuff you enjoy at which you can also support yourself\n\nLearn to cook on a budget\n\nSave in tax deferred or tax free accounts \n\nDon’t post anything online under your name you wouldn’t tell your mother (or someone who’s opinion you value)",
   "created_utc": 1698122699,
   "score": 33,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67hvbp",
   "message": "Ain't it fun?",
   "created_utc": 1698121176,
   "score": 7,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67jgcj",
   "message": "Boundaries!!!! And stick to them",
   "created_utc": 1698122092,
   "score": 8,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67k5gb",
   "message": "Have some effective way to process emotions. Shit catches up if you sweep them under the rug.",
   "created_utc": 1698122503,
   "score": 8,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67jhsa",
   "message": "Wait a sec, there are adults on Reddit?!",
   "created_utc": 1698122115,
   "score": 8,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qa9z",
   "message": "Be honest and be kind. That is all.",
   "created_utc": 1698126502,
   "score": 8,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67i76g",
   "message": "9-5s are hell.",
   "created_utc": 1698121359,
   "score": 6,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67jldn",
   "message": "Set yourself little daily goals and then do them consistently",
   "created_utc": 1698122174,
   "score": 6,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q8n1",
   "message": "Get a degree in something you can tolerate doing. Bonus points if it's a straight 9-5. Then learn to \"Work\" when you get home on one or two things you are passionate about and let them eventually take over what pays your bills.",
   "created_utc": 1698126472,
   "score": 6,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ryb1",
   "message": "Take more risks.\n\nI remember my HS grad speaker quoted the song \"I Hope You Dance\", and at the time I thought that was just what old people who wanted to say something cool would say.\n\nBut now that I'm older (if I had a kid in HS they'd be legal this year) that's what I would say. Esp. when you're younger, mistakes are easier to fix.\n\nHopefully though, you'd do more \"calculated risks\".",
   "created_utc": 1698127688,
   "score": 7,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67lcg8",
   "message": "No one gives a shit about you except for your mom and dad, siblings. Stop acting like you own the place, you’re a damn ant trying to survive like the rest of us.",
   "created_utc": 1698123236,
   "score": 5,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q6s3",
   "message": "Go back it’s better there",
   "created_utc": 1698126436,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qgwg",
   "message": "credit cards are not \"free money\" you have to pay them back IN FULL every fucking month, not just the minimum payment",
   "created_utc": 1698126631,
   "score": 5,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qh58",
   "message": "As a 47yodruglord, I can say that buying cheaply is a false economy, and paying for the label is not a guarantee of quality. Know the intrinsic quality of the item, follow the money and know that even when deeply discounted, what you buy will always still be at profit to the seller.",
   "created_utc": 1698126636,
   "score": 5,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67obkh",
   "message": "for fellow girls, dont get into manipulative relationships with elder men, they will ruin your lives forever and scar you more than physical pain.",
   "created_utc": 1698125166,
   "score": 8,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67i576",
   "message": "Don't go above and beyond at a new job. It sets a higher standard that they will forever hold you to while everyone around you is shit.",
   "created_utc": 1698121329,
   "score": 20,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q5mf",
   "message": "Go into yourself, question your values and morals, as they will most likely change in the next years, also start saving as much money as you can for your future, you never know whats coming or when you need it. Also if you do experiment with drugs, don't overdo them or think of them as a \"cure all\" as some have the potential to push you into thinking that and before you know it you're addicted - safer use is key",
   "created_utc": 1698126414,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q6iz",
   "message": "Learn to tell yourself no.",
   "created_utc": 1698126431,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qswt",
   "message": "Don't be too critical of yourself",
   "created_utc": 1698126863,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qwzn",
   "message": "For any object you plan on putting inside someone you care about, you need to know how you'll get it back out if there's a problem BEFORE you start. This applies to sex toys, food, medication and anything else you might be able to fit inside your mouth.",
   "created_utc": 1698126942,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qwzx",
   "message": "Don’t buy shit just to be cool or fit in with friends.  Live within your means and start a savings!",
   "created_utc": 1698126942,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67r1hn",
   "message": "Don't do it. It's a scam. Run away.",
   "created_utc": 1698127031,
   "score": 5,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ra28",
   "message": "Humility will be much more beneficial than your pride.",
   "created_utc": 1698127200,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67rdhf",
   "message": "Take care of your health now because it ain't gonna get easier.",
   "created_utc": 1698127265,
   "score": 5,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67sun4",
   "message": "The best advice is to plan your life not only for the future but also as if your life span is of 2 to 5 years…\nLet me explain: I am 25y (f) and became a year ago physically disable because of an accident. I spent my last 6 years of my life only for the future… i was finishing med school when it happened, I didn’t got to end it (I am missing 3 semester). I strongly regret not living my life more fun… i missed loads of events because I was studying… since a night out with friends… a vacation… some days in the pool.. and it was because I thought I had time. But we never really know. So… make plans not only for the future, but also for today",
   "created_utc": 1698128357,
   "score": 5,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67td3h",
   "message": "It's time to curate your social media profiles. This WILL affect your employment prospects.\n\nEmployers stalk the social media profiles of applicants to see if you're a good fit, or if there's a chance you'll publicly embarrass the company with an opinion. Get those memes out of the public eye and put up a respectable, professional look, showcasing pictures of you volunteering or doing extracurriculars, your achievements, etc.",
   "created_utc": 1698128737,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67tnt8",
   "message": "You may be an adult but employers will see you as a kid whos inexperience they can exploit.\n\nMake sure you get contracts in writing and read your job description so you know if what they're asking you to do is actually appropriate.",
   "created_utc": 1698128961,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67msad",
   "message": "Learn how to do things with your hands. Take care of your teeth. Save 15% of every paycheck. Wear a condom. Say yes to things that make you nervous.",
   "created_utc": 1698124152,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67natg",
   "message": "The time value of money is not to be overlooked. Save now. Even a little",
   "created_utc": 1698124490,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q4tk",
   "message": "Run while you still can.",
   "created_utc": 1698126398,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q5hm",
   "message": "Enjoy your time. Once you have kids all that is gone.",
   "created_utc": 1698126411,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67q5ir",
   "message": "Hope for the best, but get ready for the worst",
   "created_utc": 1698126412,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67r4zz",
   "message": "Never stop exercising completely. Wear sunscreen when possible. Become comfortable with condoms and always use them. Take special care of your teeth. Don't develop a drug and alcohol problem. Always take the opportunity to travel somewhere new. Call your grandparents parents often. Learn first aid. Be kind when possible.",
   "created_utc": 1698127099,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67rl6p",
   "message": "Don’t be afraid to do activities alone!!!",
   "created_utc": 1698127420,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67rmao",
   "message": "1. Save your money. I'm not saying don't ever eat out or grab a drink, but try to put what you can away, especially if you still live with parents. \n\n2. Get in shape. There is nothing worse than being in your 30s and fat, and now you have knee problems and back problems.  It's easier to never have an injury than try to get rid of one later on.\n\n3. Trust me, dude, it's not that bad. Even if it's a breakup or not talking to a friend anymore, if you're still breathing, you can still push forward.  As my First Sergesnt said in the Army, \"regroup and carry forward with the mission.\n\n\nEDIT. People will die, and it sucks. You don't know who, so just keep those close to you in your sights. When I was 18, I was trying to party, and I always felt my Mom was annoying, typical 18 year old bullshit. Now at 34, I wish I could give her a call or text her and get lunch with her.",
   "created_utc": 1698127443,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67rn7x",
   "message": "Run!",
   "created_utc": 1698127462,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67smb0",
   "message": "Don’t spend so much time on social media. It’s not an accurate window to how the world works. I’m personally not gonna be on Reddit for much longer.",
   "created_utc": 1698128184,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67t00i",
   "message": "Don’t be afraid to fail. You will need to fail a lot of times to get good at anything. Just make sure you learn from the experience and don’t repeat the same thing over and again.",
   "created_utc": 1698128465,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67thse",
   "message": "Go back, this shit is ass.\n\n\nMaintain a healthy diet and sleep schedule. Once you fuck them up it's hard to unfuck them.\n\n\nTry to save something from every paycheck, even if it's only 10-20$. Make a budget and save what you don't use up. There will eventually be a time when things are rough, having that financial cushion has personally saved me at least 20 shitty scenarios. And fuck that asshole who shoved a beer bottle under my tire while I was at work, ruined my shit for no good reason. 3 punctures in one week, total horseshit.",
   "created_utc": 1698128834,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67u75v",
   "message": "Don't trust anyone. People change. Their priorities change. Be with yourself and and make yourself happy. Don't be dependent on others for happiness or enjoyment.",
   "created_utc": 1698129358,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67u87z",
   "message": "Read a lot! Stay curious! And search for a life philosophy and morals that resonate with your soul. When you get to a certain point you'll need something deeper to sustain you than just career and hobbies",
   "created_utc": 1698129380,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67unvf",
   "message": "Live in the REAL WORLD with REAL skills and an ACTIVE mind that can LEARN.. not on social media, the internet, or in games.",
   "created_utc": 1698129705,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k684dym",
   "message": "Under-promise and over-deliver.\n\nUnderstand the difference between being productive, and recreation. Keep those in balance.\n\nModeration in all things, including moderation.\n\nRegulating your emotional behavior will get you far. But be prepared to express yourself in unexpected ways when necessary.\n\nEat more vegetables, just always try to eat more vegetables.",
   "created_utc": 1698137569,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k684m3z",
   "message": "dont stress out if you are a virgin. Quite a lot people just lie about loosing virginity anyways lol.\r  \n\r  \n\r  \n\r  \nLost mine at 22 . you can chill and relax.",
   "created_utc": 1698137758,
   "score": 3,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ie9p",
   "message": "Stay in school until you get your Master's. Ignore people who say you don't need it. You may not need it now, but you will later. You can get your Master's from the same school as you BA/BS. No one cares after your first job. Don't spend your money on \"stuff.\" Read books for pleasure, it doesn't matter what kind. Get a hobby that is physical exercise: martial arts, biking, walking, running, gym... just don't become the hobby as a replacement for a personality. If you can, travel as much as possible. Don't have a baby.",
   "created_utc": 1698121471,
   "score": 13,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67i5ux",
   "message": "Don’t take any advice from r/antiwork. There’s a reason a lot of them complain about being poor.",
   "created_utc": 1698121339,
   "score": 9,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67lnqw",
   "message": "Go to trade school and specialize in a practical skill. You’ll be able to own your own business by 30 and retire by 55 if you feel like it. Fuck college, also lay off the weed if you want to succeed",
   "created_utc": 1698123438,
   "score": 4,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67mi6h",
   "message": "learn to find joy in small things- you will smile much more often, its cheaper, and people will like you better.",
   "created_utc": 1698123972,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67mij8",
   "message": "No nicotine (it’s a helluva drug)! Wear sunscreen (you only get one skin)! There is no sex in the champagne room!",
   "created_utc": 1698123979,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67neoz",
   "message": "I'll leave you with the words of wisdom my grandfather left me the night of his death back in 92. (He clearly knew he was gone soon because he spoke to every family member individually before we all — minus him and my great aunt — went to dinner) \n\n\"You're only a kid once.... Hold onto that for as long as you can.\"",
   "created_utc": 1698124561,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67o6vn",
   "message": "Nothing is the end of the world. There will be times where you’ll feel everything went wrong and you messed up your whole life, you’ll be tempted to let go and accept being stuck in the most depressing situations… it’s not true. You can always restart differently and be happy again.\n\nAlso, wear sunscreen.",
   "created_utc": 1698125077,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67o77h",
   "message": "Trying is the first step towards failure. Success comes after countless failures. Learn from your mistakes and try not to repeat them. But most importantly, never give up because you never truly fail unless you don't try.\n\nIn almost every do-or-dont situation, it is always better to do than dont.",
   "created_utc": 1698125083,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67oxmw",
   "message": "Big sex *nods head in approval*",
   "created_utc": 1698125586,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qdo9",
   "message": "Start saving as soon as you can, look into building your credit, don't rush life let it come naturally, do what you want to do in life but be mindful about the process to get there, make close friends that will last you a lifetime I cant stress that one enough.",
   "created_utc": 1698126568,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qfor",
   "message": "I know a 401k sounds really boring but just start now",
   "created_utc": 1698126609,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qzu3",
   "message": "Save us your genius and just listen for a couple of years.",
   "created_utc": 1698126999,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67r6vb",
   "message": "Create the moments and enjoy them, live in the present, ofc u think on future and past but dont lose focus on present, bc without present theres no future and no past. Also keep ur circle small and real ☀️",
   "created_utc": 1698127136,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67re21",
   "message": "Plan your life as what you want to be in 10 years and work out nk matter how little it is.",
   "created_utc": 1698127276,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67rmqo",
   "message": "Make good on your gap year, if you're taking one. Sure, go off \u0026amp; travel to other parts of the world but do it on your own dime. Work a few months in retail, or light packaging/ assembly line, or a loading dock. \nTHEN off ya go roaming with funds of your own that you can take pride in earning, instead doing it all on credit cards your parents end up paying off. Someone who learns personal day-to-day monetary management skills has a huge leg up on the other freshmen once off to uni/college.",
   "created_utc": 1698127452,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67sbz1",
   "message": "You actually have about 10 more years of being a child. Enjoy your time while you have it.",
   "created_utc": 1698127971,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67sf6e",
   "message": "As an 18 year old adult myself, don't use all your money on useless shit. It is too late for me 😔",
   "created_utc": 1698128036,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67sm3l",
   "message": "Look after your teeth.\n\nWear eye and hearing protection wherever it's a good idea to: work, gardening, concerts etc. Seriously, every time.\n\nSave money into a separate account that's not easy to spend.\n\nDon't have children.\n\nDon't hang out with fuckwits.\n\nBe kind.",
   "created_utc": 1698128180,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67snfj",
   "message": "Don’t ruin your credit thinking you’ve got time to fix it later.",
   "created_utc": 1698128208,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67t2ni",
   "message": "Well I'm 21 and still figuring A LOOOT of shit out. If there's anything that really gets me everytime it's paperwork. Holy shit there's so much paperwork. I recently had to get my own medical aid (can only be on parents up until 21yo) and I missrred one of the 20 emails they sent me that contained the 7!!!! documents I had to fill and submit:/ don't ask, I know it was stupid. I waited 2 weeks and we couldnt understand why it wasnt active yet.\n\nIt helps to have all necessary info in a spot easily accessible like Google drive. ID/passport/drivers/all necessary phone numbers and their ID#/etc. Also don't just skim emails lmaaooo, that one important email's attachments looked like mundane company pictures that just makes it look professional that's why I neglected it... *facepalm*\n\nAlso, talk to your parents and work out a sound budget. DO NOT DEVIATE. It's easy to spend money when you're on an allowance and not working for it. I'm getting my first job in December to make my own, first paycheck and my parents made it clear that the money I make there will go towards my usual monthly expenses, they won't add to it. I've had budgeting issues because again, easy to spend money that you just get. Don't fall into that habit. Start saving now, a little build up even if it's only like 10$? a month (idk, I'm not American so idk how big/little amount that is lol)\n\nBut also, just enjoy it. If you're going to uni/college, it's a lot easier to make friends than you'd think. If you're an extrovert it'll come naturally, and if your an introvert, there's loads of others as well that you'll get along with perfectly.",
   "created_utc": 1698128519,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67t74a",
   "message": "Value your time, but don’t forget to have fun. Avoid drama because that’ll do you no good.",
   "created_utc": 1698128612,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67t7z3",
   "message": "Be responsible and frugal, work your butt off and you'll own a home by 35, Piss away your 20's on parties, drugs and friends you end up an apartment renting loser living with those friends to afford rent.",
   "created_utc": 1698128631,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67taqi",
   "message": "Good luck kid lol",
   "created_utc": 1698128688,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67thwa",
   "message": "The world can be a tough place. Stay working and find a steady career with room for advancement. Don't over indulge on one thing. Always keep in mind consuming things in moderation. Otherwise you will lose focus on the now. Don't rush into relationships especially marriage. You have plenty of time ahead of you. Work on yourself and your future. Prepare yourself financially before creating a family of your own. Don't try to keep up with the Joneses. In other words, just because people have things that you may want, doesn't mean that your budget can handle it. Most people are deeply in debt. Treat others how you want to be treated. Be an honest, loyal, and decent member of society and you'll go far. 😉",
   "created_utc": 1698128836,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67tia6",
   "message": "Stay true to you, avoid drama, be humble, leave all the harmful addictions if you have any, learn as much as you can, keep your friends close, beg nobody for nothing, work hard not only for money but also on yourself and tell your family often you love them.\nYou can lose everything without even noticing it, watch your steps.",
   "created_utc": 1698128844,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67tob3",
   "message": "Go back! Its a trap!\n\nAlso so many of the comments at the top are gold. Take them to heart. I would be a multi millionaire by now if I put 10% of my income into retirement when I started working and I have 20 more years to go.",
   "created_utc": 1698128970,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67tq5n",
   "message": "Get on the property market as soon as you can",
   "created_utc": 1698129009,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67tsz0",
   "message": "Learn the art of active listening, however smart you are",
   "created_utc": 1698129065,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67tuyo",
   "message": "You're an idiot. Luckily, so is everyone else. \n\n\u0026amp;#x200B;\n\nNever assume you're the smartest person in the room.\n\n\u0026amp;#x200B;\n\nEat lots of fiber. A good dump is often underappreciated.\n\n\u0026amp;#x200B;\n\nStay fit, it's a *lot* harder to lose weight than it is to put it on.\n\n\u0026amp;#x200B;\n\nTell your friends you love them. You don't know how many chances you'll get.",
   "created_utc": 1698129107,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67u3rh",
   "message": "Welcome to the jungle motherfucker.",
   "created_utc": 1698129288,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ue55",
   "message": "Don’t become an adult, it’s a trap",
   "created_utc": 1698129502,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67uese",
   "message": "I'll let you in on the secret we've been hiding from you all these years.\n\nWe are all faking it.   Yep.  All of us.  We've been winging it this whole time.   Sure we look like we know what we are doing, because a lot of the small stuff we've done over and over again, but throw something new our way?   We haven't a clue.  We have to muddle through it just like you.\n\nSo, be patient with yourself for taking way to long to do the thing that's obvious in retrospect.  We've all been there.  We are all still there.",
   "created_utc": 1698129516,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67ueu2",
   "message": "Save your money",
   "created_utc": 1698129517,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67uj9v",
   "message": "\n\nThe people you make friends with will affect the course of your life.  Take the next few years slowly and build up as many as you can because it's more difficult later in life.  These are the people who will help you then and in the future.  The best way to make those friends is through shared misery.  Keep an eye out for geniuses, too.  They have long coattails, and making friends with one is usually as easy as listening.\n\nAlso.  Here's a pocket knife.  You'll need it.",
   "created_utc": 1698129609,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67vkyd",
   "message": "You have a very narrow window of time to put on as much size and shape as possible. Start working out. Pick up a physical hobby. You can literally build superpowers at your age. \n\nAlso when you're 30, those who got in shape and those who don't really starts to show.",
   "created_utc": 1698130407,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67x061",
   "message": "You are about to get repeatedly shit on. Good luck",
   "created_utc": 1698131504,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67xwtd",
   "message": "Be hungry, helpful, and humble.\n\nTreat people with compassion and respect regardless of how they treat you.\n\nDo what you enjoy, with the people you love, and live in the moment.",
   "created_utc": 1698132216,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k681sln",
   "message": "Take care of your fucking teeth, dental work is expensive af",
   "created_utc": 1698135407,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k681y7g",
   "message": "Turn off social media. Stay in shape. Continue learning everyday.",
   "created_utc": 1698135537,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k682run",
   "message": "Hold off on marriage for as long as possible.",
   "created_utc": 1698136223,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k6837eq",
   "message": "Dont Start Smoking. I throw half of my money out the window for this shit . And always have enough bananas at home,because who doesnt like a good Banana",
   "created_utc": 1698136579,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k683gnp",
   "message": "With alcohol remember you are drinking tomorrow's happiness today. Take care to think how much you will need it tomorrow. Other drugs can take multiple days happiness in exchange for having it today. They are a ton more fun, but will leave you in a worse spot.\n\nLive your life how you want, but just make sure you are keeping in the question in mind, \"Is the reason why I want to get intoxicated because I get intoxicated too much and it is leading to problems I don't want to face?\"\n\nProbably something to keep in mind with most feel good hobbies. Is it healthy stress relief or just making today's problems, tomorrows?",
   "created_utc": 1698136793,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68iqff",
   "message": "Start planning for your future and working towards a career/good job. The number one things that’s been consistent in my life is a good job. If you get along with your parents, live at home as long as you can and save money. \nYou don’t need the newest car, the best shoes etc. Materialistic things are fun to indulge in but they aren’t important. \nWork on your confidence! Be the person you want to be in a relationship with. \nDon’t let break ups affect your life too deeply. The people you date now (unless you’re lucky!) are nothing compared to who you’ll date as you grow as a person. \nBeing happy takes work but you can do it! Yoga, swimming, eating right - it all really does help!",
   "created_utc": 1698147748,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68iu93",
   "message": "Don't treat your body like a rental. \n\nIt's your body till the end. Eat your greens. Don't consume an excess amount of junk food. Learn to live alone. Learn to cook a meal for yourself, not just the microwave or oven pizzas. Keep educating yourself after school. And occasionally disconnect from the digital life we live in now and enjoy nature.",
   "created_utc": 1698147806,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68k6zl",
   "message": "People will come \u0026amp; go. Make yourself a priority.",
   "created_utc": 1698148548,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68tvd7",
   "message": "2 things. \n\n1. Nothing is ever a sure thing. Unless somebody tells you otherwise by reassuring you, never take things at face value. \n\n2. Imagine half the population as being stupid. Half that, and there's a group of people even stupider than that. Don't be in the second group. Always try to be half stupid. Never be fully stupid.",
   "created_utc": 1698153269,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68u58z",
   "message": "Always take advice from reddit with a grain of salt",
   "created_utc": 1698153389,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68uc3p",
   "message": "Girls are just as nervous and insecure as guys.  Take risks early cause later on your choices get more narrow.  And volunteer for everything, not routine.  Any chance you get for special training or experiences, take em.",
   "created_utc": 1698153472,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68uo3h",
   "message": "1) learn personal financial skills and start saving.\n2) take good care of your teeth",
   "created_utc": 1698153618,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68upwv",
   "message": "Have as much sex as you can while you are young but don't do it for the sake of it either.  I regret not doing it.\n\nDon't let your other vices get out of control.\n\nBe careful with money but not mean.\n\nYour career doesn't define you. It's a means to living your life.\n\nHold on to your good friends.\n\nDo as much of what you enjoy as you can while you can because you never know what's around the corner.",
   "created_utc": 1698153640,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68v3f0",
   "message": "Drug lord is not a realistic career choice. 🤣",
   "created_utc": 1698153801,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68v3w6",
   "message": "take it easy\n\nstay away from drugs apart from a healthy dose od psychedelics once per year max.\n\nstay away from toxic people and false people\n\ndont stick to bad jobs\n\ninvest in yourself\n\nlearn to love heal and respect yourself",
   "created_utc": 1698153806,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k68vn6d",
   "message": "Walk in the mountains and woods as much as possible. Someday when you’re old you won’t be able to.",
   "created_utc": 1698154032,
   "score": 1,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67qbt4",
   "message": "Save as much money as you can and live within your means. Fight the urge to increase your expenses as your income increases.\n\nThis is a very rough general rule but, if you can’t buy it twice, you can’t afford it. \n\nDon’t ignore exercise completely but diet and portion control are much more integral to keeping your weight at a healthy level. \n\nLastly, do NOT get anyone pregnant.",
   "created_utc": 1698126532,
   "score": 2,
   "submission_id": "17f49dp"
  },
  {
   "comment_id": "k67y0u0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17f49dp"
  }
 ]
}