{
 "submission_id": "17f6l29",
 "title": "[Serious] People who are 'good at sex' - what's one piece of advice you would give to someone of your own gender and orientation to help them improve their performance?",
 "selftext": "",
 "created_utc": 1698130168,
 "permalink": "/r/AskReddit/comments/17f6l29/serious_people_who_are_good_at_sex_whats_one/",
 "score": 244,
 "url": "https://www.reddit.com/r/AskReddit/comments/17f6l29/serious_people_who_are_good_at_sex_whats_one/",
 "comments": [
  {
   "comment_id": "k67v9eo",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1698130169,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67vrrw",
   "message": "Listen to what your partner is saying and don’t be afraid to ask questions",
   "created_utc": 1698130553,
   "score": 140,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67w68n",
   "message": "Just be attentive to your partner’s wants and needs, that what makes a great lover in you make sure your partner is satisfied then they will think you’re great.",
   "created_utc": 1698130860,
   "score": 115,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67yxg2",
   "message": "This is a long one, unlike mine.\n\nStraight guy giving advice to men about being good at sex with women. Here goes!\n\nWomen aren’t all the same. Some wear the hood over their clit for stimulation and some expose that little guy to all kinds of abuse. Some have a tendency towards slow and gentle, some prefer rough etc.\n\nSince people are individuals, the way you get good at sex is to be confident but not cocky, patient but not apprehensive, intuitive but not assumptive, you get the idea.\n\nCommunicate and pay attention. Some shit just pops off and you didn’t have time to communicate as much as you could have beforehand, per se. Well, whatever you noticed, great. You can’t please everyone. Maybe the woman you’re with would *love* it if you paused, communicated and asked her about things she liked etc. Some women aren’t gonna be turned on by giving directions or pausing to communicate, it is what it is.\n\nYeah, being good at sex boils down to learning. Learn from everything and learn the person you’re with. Build that experience and probably most of the time if YOU have a great vibe, don’t take yourself too seriously, and maintain a great energy and desire to satisfy her, you’ll get few if any complaints. \n\nThe women I’ve been with have almost unanimously made it a point to emphasize how I compared to other men by telling me I’ve been great and (often times) most partners before haven’t been anything to write home about. That *still* doesn’t necessarily make me good at sex. The next one might not like what I’ve got going on, you never know. Since sex is a people skill, you can’t be good at all people all the time. \n\nOh, and have the patience to make her cum. Women can make a lot of noise and move a lot and say oh fuck oh fuck and all this for 10 minutes and still not have reached orgasm yet. Doesn’t mean you’re done bucko. If she actually reaches orgasm she’ll gently move your hand or mouth away from her clit. Don’t switch it up if she’s getting close to orgasm as a general rule. \n\nIf you have issues like ED or cumming too fast, don’t be overly negative because chances are she’s fine and it’s fine. Shit happens. Work on those things together and work together. You’re fucking a person, not a problem that only you’re trying to solve.",
   "created_utc": 1698133038,
   "score": 238,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68ad3x",
   "message": "Okay got carried away, but as a guy my main (explicit) tips:\n\n\n- know the vibe, like whether slow and sensual or hot and fast, roll with whats natural\n\n\n- foreplay is essential, kissing body, sucking nipples, licking and kissing your way down there. Plenty of attention around the inner thighs and vulva before you ever actually touch her pussy. You'll know youve done it right if she shivers when you first lightly touch her clit\n\n\n- give enthusiastic head\n\n\n- no matter what the vibe, take the first insertion slow. The first stretch feels good for everyone\n\n\n- you dont have to be having a conversation during sex if you can read her body language. When she moans or squirms take note of what you were doing (angle, tempo, how hard you thrust etc) and do more of that.. but change it up after a bit\n\n\n- give enthusiastic head\n\n\n- if she's getting close, just keep doing what youre doing. Its not like us where we want to go harder and harder until we finish. Hang on for dear life until she cums\n\n\n- make your own noise, girls love seeing a dude enjoy it. Imagine how off putting a silent girl would be\n\n\n- give enthusiastic head\n\n\n- probably the top way to improve performance is physical fitness. So many things improve the fitter you are \n\n\n- give enthusiastic head\n\nE: sorry for shit mobile formatting",
   "created_utc": 1698142353,
   "score": 40,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6801g8",
   "message": "Nothing anyone here tells you will be as useful as asking your partner. Ever.",
   "created_utc": 1698133947,
   "score": 37,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67y5km",
   "message": "Focus on her pleasure. If you’re the kind of guy who nuts after three thrusts, you’ll be forgiven if you have already taken care of her thoroughly with your tongue.",
   "created_utc": 1698132416,
   "score": 90,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67znpw",
   "message": "Work out",
   "created_utc": 1698133632,
   "score": 98,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67xgxy",
   "message": "Focusing on performance is a sure way to take the fun out of sex. It's not NASCAR. The first thing to do is to get the idea that it's a performance out of your head and focus on sensuality. Men probably have a harder time with that.",
   "created_utc": 1698131870,
   "score": 164,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67wipy",
   "message": "Foreplay and teasing is a good thing to do for whoever wants to experience a goodtime. Oral receiving and giving is amazing, but knowing the right motions and touches can be tricky, so communicate often it sounds weird, but it honestly helps so much to better  understand your partners pleasure spots and what's feeling good to them. But also pay attention to changes in breathing or moanings as well! Those are subtle cues!",
   "created_utc": 1698131124,
   "score": 45,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67xk13",
   "message": "Show enthusiasm and let them see you're enjoying it. Smile. Look happy. Don't be a starfish ever.",
   "created_utc": 1698131938,
   "score": 49,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67yce9",
   "message": "Stretch. Stretch a lot!",
   "created_utc": 1698132570,
   "score": 20,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68d1jw",
   "message": "SLOW DOWN. \n\n\nFor men. The best piece of advice I ever got was go as long as you can and then drop that another 50%.\n\n\nThis means excruciatingly long foreplay. Most guys go right for sex and even the ones that think they do a lot of foreplay chances are it's not enough.  This will put you in the top 1 percentile and you'll start blowing minds.",
   "created_utc": 1698144255,
   "score": 17,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67woqk",
   "message": "Remember it's about pleasing your partner as well as yourself.",
   "created_utc": 1698131253,
   "score": 15,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68d1ug",
   "message": "Get a grip. No, not like that, a vaginal grip. Train your pelvic floor and grab him hard. Guys aren't used to getting that on command, and it's a great trick to surprise them.",
   "created_utc": 1698144261,
   "score": 27,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6813v2",
   "message": "You aren’t ever going to be ‘good’ at sex until you realize that every partner is different and no one technique or skill that you think you’ve mastered is going to work for all.\n\nExplore a variety of positions and options and see what works for different people. Have a ‘toolbox’ of options and find in it the tool that works best for the current job (partner).\n\nTry to read your partner and don’t assume their current experience based on your own.\n\nAny person who professes to be amazing at sex probably just has a big ego.",
   "created_utc": 1698134834,
   "score": 12,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68gwm0",
   "message": "If they tell you they're close to cumming, don't change what you're doing.",
   "created_utc": 1698146695,
   "score": 10,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67wya2",
   "message": "My own three top tips would be: \n\n1. Honest and open **communication** about one's sexual needs, issues and desires is 90% of the solution to *any* problem. \n2. Unless other power dynamics are involved, **\"the woman cums first\"** is a good starting point. If you build her lust and desire, focus on her pleasure, and make her a sweaty puddle of mess, then the rest of the sex will be good as well. Because when a man cums, the prolactin release and dopamine crash after orgasm together make him lose a lot of the drive - this isn't true of most women - they're just getting started after the first one. \n3. After a year or two, the honeymoon phase is over and sexual salience and incentive will decline rapidly due to biology and a thing called the \"Coolidge Effect\" - look it up! - and we go from being easily aroused and ready for copulation at the flick of a skirt to needing a lot more effort to get started. This means it's sometimes a good thing to schedule appointments for sex \"we do it on Thursdays at 1 PM\". We also don't really feel like having sex all that often, but **once we get started** we find ourselves liking it. So the solution is to initiate it without 100% feeling it - because after a few minutes, we *will* feel like it.",
   "created_utc": 1698131463,
   "score": 85,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68aybp",
   "message": "Gay guy here: Prep the bottom with lots of tongue. Rimming relaxes things and gets him physically and psychologically ready. Use a lot of lube. Enter SLOWLY. Listen. Make tiny thrusts but don’t go full bore until he wants it. \n\nGood sustained rhythm, strong breathing and using your hands to stimulate elsewhere (nipples, cock, balls, butt) will push him closer. \n\nGood sex is not a race to ejaculation. It’s an amazing sensation that builds between two strong and sweaty men, turning them into a sticky pile of mutual satisfaction. Take your time and you’ll reach that big finish.",
   "created_utc": 1698142787,
   "score": 9,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k683gm4",
   "message": "When she says don’t stop, don’t change what you’re doing. Don’t speed up, don’t slow down…just carry on doing exactly the same thing.",
   "created_utc": 1698136792,
   "score": 8,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67y1o2",
   "message": "Going down on a woman. You want to start off like a butterfly landing a petal and end like a bull dog eating porridge",
   "created_utc": 1698132328,
   "score": 21,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6822e8",
   "message": "If you and your partner didn't laugh at least once you're probably doing it wrong.",
   "created_utc": 1698135634,
   "score": 38,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k687819",
   "message": "My experience with men:\n\nUnexpected things can always happen. Laughing and joking around during the deed is normal. Don’t base your expectations off of corn, it’s not real and usually the actors are incredibly uncomfortable. \n\nListen to your partner, discuss boundaries beforehand, and don’t skip foreplay or aftercare. Aftercare is necessary because it eradicates the hollow feeling you might get after. It strengthens your bond and staying in bed or showering together after is fun and relaxing.\n\nThere’s no key to good intercourse, each and every person has a unique experience and has different wants and needs. Don’t be afraid to tell each other during the deed if your uncomfortable, need a different tempo, a break, a different position…and don’t be ashamed if you ask for any of these things.\n\nStay hydrated and use a condom. Always practice safe sex unless otherwise discussed.\n\nStay safe out there folks, hope this helped a little",
   "created_utc": 1698139895,
   "score": 7,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6800dg",
   "message": "Its not about what you do, \nIts about how you do it. \n\n\nSkill matters most. Size comes after. \nCause size dont make up for skills.\n\n\n\nOne can google the rest.",
   "created_utc": 1698133921,
   "score": 14,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68dsq5",
   "message": "As a man, listen to the noises she is making and the way her body reacts to what you do, leave her shaking. Also, ‘keep going’ does not mean faster, it means keep going at the same tempo etc. When you’re inside her, use your thumb on her clit at the same time. Foreplay is so important, both ways, give her the best head she’s ever had, using both the top of your tongue and the bottom, two different textures on her clit. Most, but not all, women’s nipples are extremely sensitive, make use of that with your tongue, teeth (lightly) and fingers. In missionary, put a pillow under her lower back. Can’t think of any more, I have just woke up. Enjoy pleasuring your ladies, men!",
   "created_utc": 1698144756,
   "score": 7,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67zujw",
   "message": "Get right in there and try and do a good fucking job.\n\nLike idk what mindset people are going in with, but it's not that.\n\nSeriously, the number of adults who kiss like... A dog?! Like wtf are y'all doing?! Slow down, learn wtf technique is. Both of y'all will enjoy it more if you are both good.",
   "created_utc": 1698133792,
   "score": 16,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k681n1i",
   "message": "Ask your partner what they like, then do that.",
   "created_utc": 1698135277,
   "score": 5,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68a9wg",
   "message": "Make it about the other person.",
   "created_utc": 1698142286,
   "score": 5,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68bnob",
   "message": "Your partner don't necessarily get off on the same thing as you do, so you need to embrace both aspects of the act. \n\nThere's a mental aspect to sex too, which I used to find weird to do, but it really improves the experience",
   "created_utc": 1698143291,
   "score": 6,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67y5ju",
   "message": "habanero pepper in the poop chute.",
   "created_utc": 1698132415,
   "score": 15,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67vqgi",
   "message": "Honestly, when it feels good and I’m on top, I press my finger from one hand into the other, not too hard but enough to get my mind off the feeling. You can bite your tongue a bit too, again not too much. And of course the good ol “think of grandma” lol. But that’s kinda weird.",
   "created_utc": 1698130525,
   "score": 9,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67zjur",
   "message": "For guys, communicate and see how the body of a woman responds.try not to skip foreplay and take your time with it. Do not be that jerk and finish first and leave the lady unsatisfied. Don't be scared to go down and have an open mind to her suggestions. Don't be afraid of using toys and do not let your ego get the best of you. You want her to be happy too so if a toy makes her happier don't feel bad about it. Compliment her body and talk if you can. Be a giver. \n\nFor women. Communication is the key. Try not to be too reserved, be a lady in the street and a filthy whore on the sheets. Try not to fake an orgasm instead guide him about your body. Men like being complimented too. There's more to a man's body than his penis so work on that. Be an eager recipient and excited giver. Do not make sex feel like a chore. Initiate sex and enjoy it too. Explore new things and spice it up. \n\nTo both parties- please keep the environment and your body hygienic.",
   "created_utc": 1698133545,
   "score": 15,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k680cot",
   "message": "For the Girls,you know what a man likes…, do it cause you love it,do it messy,do it to the end😅 easy",
   "created_utc": 1698134203,
   "score": 6,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67zmat",
   "message": "Above all, communicate. Other than that some more practical tips for men: Learn to increase stamina. Learn to edge and be comfortable with high levels of stimulation by controlling your breathing. Hydrating yourself also helps with this. Do kegel muscle exercises as they will allow you to control the muscles surrounding your junk. If you’re on the larger the side, good for you, just remember to not shove it all in at once, work your way up to full speed slowly and gradually - it will have a better effect when you’re doing it with full “force”. Direct your penis in a slightly upwards direction so you make good contact with the g-spot - putting a pillow under her lower back (not her arse as you wont have free space to thrust properly) will help with this. Oh and if you’re on your back, learn to stay still while providing a well grounded “platform” for her to move against. That’s all I can think of off the top of my head. Oh and don’t be a fuck boy who irresponsibly makes women feel good and then shit again - you’ll get a reputation and women will start to avoid you/not see you as a serious option.",
   "created_utc": 1698133600,
   "score": 3,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68hbfb",
   "message": "I'm gay, but not all dudes have dicks. So some advice for my inexperienced bros.\n\n- Trim your fucking nails and make sure they're clean.\n\n- If you're having a long sesh, having a drink like Powerade or Lucozade Sports really helps keep things fluid (pun intended), as you dont need to go off and make a drink (although sometimes a nice break for tea is lovely).\n\n- Buy a good **paraben free** lube. Not all vaginas are as lubricating as each other; not all dicks precum as much as each other, anal mucus only goes so far etc. It pays to be prepared.\n\n- Tuck your lips over your teeth whilst giving head, and don't be afraid to use your hands to stimulate the shaft\n\n- lightly tease things with your tongue before going 100%. Dont beat the clit with your tongue like you're in UFC. Tease them gently and let them enjoy the sensations, get comfy and slowly move your tongue to stimulate other parts. If they're overstimulated; move to the inner thigh for a bit until they're comfortable with you resuming. But dont just go down there with the intention of smacking your tongue against their clit (unless they've discussed that they like the feeling of that, in which case....)\n\n- **Communicate**. Oh my god, I can't stress this. It's supposed to be fun. You're an electrical lump of meat on a rock fiddling with a magic dopamine button, and you're not gonna tell your partner if something feels unfulfilling, or if they're going too hard, etc?  Just talk, crack jokes, and laugh a little. Sex shouldn't be serious or scary. Just enjoy it. Talk to your partner about what you enjoy, dont be afraid to try things.",
   "created_utc": 1698146935,
   "score": 3,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68l5i1",
   "message": "Turns out the secret is paying attention to your partner. Guys pretty much always finish but the paying attention to how they react and learning this is good or this is better can make it exponentially more satisfying",
   "created_utc": 1698149062,
   "score": 3,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68ayg9",
   "message": "Learn cunnilingus. Do it well, and make her orgasm before you start having sex.",
   "created_utc": 1698142789,
   "score": 7,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k680rvm",
   "message": "I learned this recently:\n\nIf your tool is bigger than average, you have to take your time penetrating. I was rushing too much too often because porn and stuff, but my partner prefers when I take my time to “warm him up” before we get to full blown penetration. The good thing is, I have been enjoying the extra foreplay too and it makes both of us connect and enjoy the experience more!",
   "created_utc": 1698134559,
   "score": 6,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k682a30",
   "message": "I'm a woman - learn to be turned on by turning him on. I have a fetish for making men go crazy with desire and I enjoy all the sex i've ever had.\n\n\u0026amp;#x200B;\n\nDon't be so hyper focused on orgasm. In my opinion orgasm isn't the goal of sex. It's the connection with someone you're super attracted to.\n\n  \nDon't have sex with someone you're not already crazy about. If you're barely into the person you're fucking of course the sex is going to be bad.",
   "created_utc": 1698135811,
   "score": 5,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67zgkb",
   "message": "I never fuck the same way. I go with the flow.\n\nI guess it's just about following instinct and shutting down your brain.",
   "created_utc": 1698133470,
   "score": 4,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67z5yf",
   "message": "Listen to your partner don't change anything if they say something like \"yeah just like that\"",
   "created_utc": 1698133228,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k681rfp",
   "message": "ask, listen, comply",
   "created_utc": 1698135379,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k681t7y",
   "message": "Over performing is obvious. It's supposed to be a fun, playful thing. You're not in a movie.",
   "created_utc": 1698135421,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68761j",
   "message": "Being able to talk about what they like. Listen to directions.  If she is saying ‘just like that’, it means JUST LIKE THAT, not go faster or deeper or harder, t means ‘just like that’. \n\nIf she doesn’t like her nipples played with rough, be gentle, even if you think it’s fun to pull them off her chest. Ask her ‘Is this good?’   I’ve been with women who just didn’t like their nipples touched at all and I’ve been with some who really like something more aggressive.  It isn’t one size fits all, so listen, pay attention to clues and timing matters. Going after her nipples immediately can be unwanted at first but enjoyable later.   \n\nAnd ladies...tell us what works for YOU personally.  If it’s our first time with you, we don’t know, you’re all different.  You all enjoy different activities and even then, what is fun when you’re a little  worked up isn’t as much fun in the morning when you might like something more gentle.\n\nPs...don’t dive for the center immediately or aggressively, start around the edges and work your way in.  \n\nPas...I’m talking about clits, nipples, anuses.  Give her some warning about your intentions and she’ll let you know of you headed the right direction.  Jump fight into the middle and you’ll likely startle someone and trust that startled people don’t feel sexy.",
   "created_utc": 1698139847,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68akv7",
   "message": "Listen, ask questions.",
   "created_utc": 1698142512,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68bbd4",
   "message": "Be willing to leave someone who’s been with you for years at the drop of a hat. Lots of undercover weirdos out there just waiting to bank on your attachment. Makes everything less complicated and frees up your mind",
   "created_utc": 1698143043,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68bjf1",
   "message": "Listen to the other person. What they say, what their body says. \n\nThe worst thing about any sex is the lack of communication.\n\nAnd communicate back. \n\nSex is like a great, satisfying conversation.",
   "created_utc": 1698143206,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68bu2s",
   "message": "FOREPLAY !!!\nLots!",
   "created_utc": 1698143417,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68d21v",
   "message": "Work on your cardio fitness for stamina.\nDon't drink too much alcohol before sex as it impairs performance.",
   "created_utc": 1698144265,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68dzlf",
   "message": "Have fun. Literally. Don’t take it too seriously. It’s not an exam.",
   "created_utc": 1698144882,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68fa6w",
   "message": "Communication. Talk and LISTEN. \n\nSome like it gentle, some like it rough. Some cum with deep hard thrusts and some can’t come with a dick at all. It takes practice and experience which will come as you get to know eachother. \n\nIf she likes you she won’t care if you’re not that experienced, but what she will care about is of you don’t try and don’t care about what she wants. Always ALWAYS make sure she has cum. Whether you need to get your mouth down there after you have finished, do what you have to, don’t be a selfish fuck. If you can do that then you’re already better than a lot of blokes she’s probably had.",
   "created_utc": 1698145710,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68h2fw",
   "message": "1) Communication. 2) Have fun!\n\nThe best sex involves a bit of giggling and laughing, in my experience. And, it's a HUGE boost when your partner genuinely says how much they look forward to \"next time\" because of it. This in turn gives you confidence and makes you improve more and more... a winning cycle 😉.",
   "created_utc": 1698146789,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68j112",
   "message": "Male kegel exercises",
   "created_utc": 1698147910,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68j653",
   "message": "Slow the fuck down and pay attention to your partner - watch their responses and those will tell you what you need to know and where to go.",
   "created_utc": 1698147991,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68jem8",
   "message": "Feeling good about your own body generally makes you more free imo...",
   "created_utc": 1698148121,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68jkak",
   "message": "Works for both genders: there's nothing as intoxicating like feeling intensely desired. Make you partner know that you're really into them - initiate, smile, show enthusiasm. But at the same time, being too into it can be a little scary too, so it's important that you pay attention to them - not only to gauge their response to what you do, but also to show you're not too deep into your head. Look at them in the eye, talk, ask if they're liking it.",
   "created_utc": 1698148208,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68kgz0",
   "message": "Just go down on her dude, literally any kind of foreplay before you stick it in. Don't just assume she's ready to go, you gotta get her there first",
   "created_utc": 1698148697,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68kp9n",
   "message": "Be at least a 6/10.\n\nBe clean.\n\nBe the owner of larger than average genitals.",
   "created_utc": 1698148821,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68kssr",
   "message": "Dont try to “perform”. Performative sex is unlikely to lead to orgasm for you. Focus on truly enjoying your partner and allowing  your body to ride the ride.",
   "created_utc": 1698148874,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68kutd",
   "message": "Do it with the right person. In other words, do it with someone you genuinely enjoy sleeping with and not because it’s convenient.",
   "created_utc": 1698148903,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68kxdf",
   "message": "Don't just masturbate using their body",
   "created_utc": 1698148940,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68l3nw",
   "message": "Don't be afraid in general. Just don't. Simply enjoy the time and be happy to have someone you can share intimate moments with. Feel free to be yourself. Times are tough and it's very rare nowadays to find someone kind and loveable. So don't mess it up by overthinking things. Life is short. Make the best out of it.",
   "created_utc": 1698149035,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68m0ht",
   "message": "Enthusiasm",
   "created_utc": 1698149512,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68m2of",
   "message": "Don't base anything you do, expectations, etc on porn.",
   "created_utc": 1698149543,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68migl",
   "message": "Stop watching porn",
   "created_utc": 1698149768,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68ob9x",
   "message": "I always ask my man “do you like this” and “do you prefer this”? It’s interesting to know 😈",
   "created_utc": 1698150672,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68ov7c",
   "message": "Laugh! If you can't laugh together they ain't the one! There's no reason there should be tension between you two because you're trying to \"do good\". If you can laugh, sex will be 100x better I promise",
   "created_utc": 1698150946,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68ovbm",
   "message": "Be gentle at first and let your partners wild side come out. Encourage them to be comfortable in their own skin (if they’re insecure) in the bedroom. \n\nAlso understand the differences between intimacy and sex. Intimacy results in sex and sex results in intimacy. Make sure the sex part is focused on during sex and the intimacy after. Also tell your partner how much you’re turned on by them. \n\nGradually build up to trying something different, that’s your goal, over time. Also prioritize their pleasure over your own. Once you do that they’ll become more receptive of your wants and needs. \n\nPlus always go for oral and foreplay when starting out. That time and build up really makes it worth it. \n\nWatch porn too, it can help for inspiration.",
   "created_utc": 1698150948,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68oxj6",
   "message": "As a hetero man about 15 years in the game I’ve learned a few GENERALITIES that vary massively…\n\n1) decent strength/conditioning/athleticism \n\nIt’s not everything (think the mindless jack hammer) but all things being equal a well crafted and efficient instrument will play better for longer \n\n2) foreplay \n\nonce you learn how to make women regularly orgasm with your hands/mouth it’s a literal game changer, no pussy should be dry upon entry \n\n3) psychology \n\nthis is highly individual of course but ime most women like to be dominated by a strong man. What “domination” and “strong” can mean are subjective. It also doesn’t necessarily mean you’re choking this person out against a wall. It’s more about unspoken intentionality and dynamic frame setting. You can be locked eyes missionary going rather slow and still be “dominating” in a sense. \n\nAlso, specific to hetero men: more women are into rougher sex than you think if you too were raised on Disney channel conditioning. Don’t go grabbing throats and pulling hair willy nilly but I’ve found many women who like this sort of thing and are afraid to ask for it. Setting the stage with the next point is vital to figuring this out safely/respectfully \n\n4) listening + communication \n\nProbably the most important as literally everything is down stream from here. Being able to assess body language, understanding what the person (\u0026amp; you) like, having the vocabulary/confidence to speak, having the humility to change course or drop your preconceived notions. Being adaptable, being kind.\n\n5) personal identity \n\nWhat is sex to you? How does your personality uniquely influence your sexual lens? What do you want to communicate during sex? What do you want your sex life to be a demonstration of? How is sex a tool for you to better understand yourself and the world around you? These types of questions/thinking are not technical bits but I think they’re massively under considered when we think about the ethics of male sexuality. Having a well defined understanding of yourself (not at the expense of understanding others) is huge towards confidence.\n\nOn the topic of oral sex\n\nThe clitoris is where the money is at. People like their clitoris touched in different ways. Some people like it dj’d like a boxing bag. Some people squeal when a slight breeze crosses it. Ymmv. What seems to be consistent is consistency: when you’ve found a good rhythm don’t stop/change what you’re doing. Think of it like your penis. It kinda sucks when someone is doing something great and then just arbitrarily switches it up while you were building. It’s like that for women but 10x worse because the penis is a much simpler organ. Small circles, East/west, north/south, it’s all good. Communicating on how much pressure is good for them is vital.\n\nGetting the fingers/g spot involved while giving head is a game changer. Again, consider the penis. Not only do the best blowjobs involve handwork, the best of the best involve two hands working. Best way to assess the g spot is the come hither motion with the fingers. You can add fingers/adjust pressure/speed based on the individual. With the other hand I’ll generally push up on the abdomen to expose the clit more, just generally grab them in a sexy way, or even put a hand on the throat if they’re into that.\n\nDifferent wild positions are cool I guess but it’s primarily the psychological novelty. It’s hard to stay hard in some positions that’re clearly for show. The fundamentals are the fundamentals for a reason. Show me a man who can pull the hair just right while stimulating the clit in doggy and that’s worth way more than something more novel but ultimately inconvenient.\n\nALWAYS HAVE A SAFETY PROTOCOL\n\nI’m not even into bdsm/super gnarly stuff by that metric but anytime you’re getting rough with someone you need to have a built in function where they can control the situation. Some people use safe words. Personally, I use the tap out method from jiu jit su. Yes I will explain/have the woman practice this maneuver/communication on me before anything happens. Words can get fucked up but everyone understands a tap out. A big part of this is actually just communicating that you give a shit about them and plan for their comfort/safety in a real way. Sadly, that alone puts you ahead of many dudes.",
   "created_utc": 1698150977,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68oz8s",
   "message": "In missionary position put a pillow under her hips, toss one or both of her ankles onto your shoulders and pay attention to her responses to figure out when you’re hitting the right spot. Don’t be shy about including a vibrator either.",
   "created_utc": 1698150999,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68pycd",
   "message": "It ain't about you.",
   "created_utc": 1698151477,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68qrcl",
   "message": "Go slow.",
   "created_utc": 1698151859,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68qwqf",
   "message": "You need to take your time. As a man , don't go directly for the honey pot, unless it was made clear before hand. Be sensual ,LEAD your lips,hands touch towards more excitement , you'll know when to go further, she'll tell you. Remind yourself guys we are more than just a dick dangeling between our legs. Patience, have fun.",
   "created_utc": 1698151927,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68ritk",
   "message": "I'm shy and can't really let my wild ass out in front of to anyone, that is til I get some vodka in me. Idk it does something to me and the most fun wild sides come out and things get way freaky and so fun. I don't hold back when I drink vodka. Not a lot of people have had that experience with me. I don't think many would be able to handle that freaky bitch. But damn it feels so good to let my freaky side all out and even better when the person I'm letting it out with just really flows with it. I always have bruises from head to toe when finished but it's only because that shit was fun and I bruise easy but damn it's hard to find anyone who can keep up and handle that ass like it needs handled lol",
   "created_utc": 1698152214,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68savh",
   "message": "Deep penetration w/ simultaneous clitoris stimulation.",
   "created_utc": 1698152569,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68w1hp",
   "message": "30M here - Listen to her breathe. Adjust your speed according to that. It'll be amazing for both of you.\nAlso, talk how or what they want, it's not awkward to ask.\nAlso, the angle matters, find what's best for you.",
   "created_utc": 1698154202,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k684chx",
   "message": "Don’t masturbate often, try to avoid porn.",
   "created_utc": 1698137535,
   "score": 6,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67yl3z",
   "message": "Slide your hands around their body softly and don't be shy when squeezing her titties, it's not that sensitive.",
   "created_utc": 1698132765,
   "score": 3,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k683sb0",
   "message": "Can we please please please stop with the sex questions",
   "created_utc": 1698137067,
   "score": 3,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k680vum",
   "message": "I don't know if I'm good at sex. Never got any complaints. My advice would be to listen to your partner. Not only what they say but their moans and body language. If you are a guy and you see your girls hands shoot down towards your pelvis and she pulls back a bit something might be uncomfortable for her so stop and find out.  Also actually communication is good.  If you are unsure if she or he likes it a certain way just ask.",
   "created_utc": 1698134654,
   "score": 2,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67worb",
   "message": "None, the more y'all keep fucking up the lower the competition.",
   "created_utc": 1698131254,
   "score": 253,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68djtx",
   "message": "Be egoistic. Try to fullfill your own needs rather then tiptoeing around what your partner might like or not. You eather match or you don't but bottom line, the experience is a **lot** more intense for the both of you if you do.",
   "created_utc": 1698144595,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68eqd6",
   "message": "Stop asking shit like this on Reddit you fucking losers. It's pathetic that this is the first shit I see every time I open Reddit.",
   "created_utc": 1698145364,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67wk7l",
   "message": "You have to love yourself. Your body. You must know how to pleasure yourself first. And as to your performance, it's all about knowing your partner. Their wants, needs, what turns them on/off. Read lots of information and test it out.",
   "created_utc": 1698131156,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k67y7nv",
   "message": "Scent",
   "created_utc": 1698132463,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k681g67",
   "message": "foreplay boys, foreplay. hit the g spot and ure good to go",
   "created_utc": 1698135116,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6884v0",
   "message": "She probably wants it rougher than you think, but you’ve gotta warm her in lightly.",
   "created_utc": 1698140628,
   "score": 1,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6850um",
   "message": "Stop numbing yourself with porn and sex toys",
   "created_utc": 1698138099,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k683g3i",
   "message": "When doing a blowjob, spit A LOT. You need to get your face full of saliva, and get that dick dripping",
   "created_utc": 1698136779,
   "score": 255,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k681jrv",
   "message": "Don't be afraid to be rough, but read the signals. Just hold her hair gently, and if she responds pull it a bit. Put your hand on her neck, and if she responds well, hold it more firmly etc. Most women I've been with like a bit of domination in bed, and the mental part of sex is like 70 percent of the orgasm.",
   "created_utc": 1698135199,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6884zg",
   "message": "Eat their b00ty hole",
   "created_utc": 1698140631,
   "score": 255,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k680xuj",
   "message": "Men: work on deadlifts, good mornings etc. Itll help a lot",
   "created_utc": 1698134701,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k681ikm",
   "message": "Learn anatomy and physiology.\n\nBodies are important. You have one. You \\_are\\_ one. And so does your partner!\n\nAnatomy and physiology are like... the instruction manual on how people work.\n\nCar people can make cars go faster. Computer people can make computers do magic. People who know anatomy and physiology can...\n\nGive \\_really\\_ good massages.",
   "created_utc": 1698135172,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k6833mu",
   "message": "Women are ovens and men are microwaves. Quickies are nice but if you spend enough time on her orally and exploring her body, she’ll have completely forgotten there is still the main chorus to come.",
   "created_utc": 1698136492,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68d0jy",
   "message": "People here talk about the G spot but as a woman. My favourite spot is the A Spot. Deep inside the vagina is the A spot. It takes long and slow thrust to get there and it’s delicious \n\nA-spot men. Read about it.",
   "created_utc": 1698144237,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68fryz",
   "message": "Nice guys finish last.",
   "created_utc": 1698146016,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68opyz",
   "message": "Assuming she knows her own body… really pay attention when she’s on top. Her pace, her rhythm, the angle of her pelvis and how she moves as she’s climaxing. Everyone woman is different but this is the best way to learn what the difference is",
   "created_utc": 1698150874,
   "score": 0,
   "submission_id": "17f6l29"
  },
  {
   "comment_id": "k68fu8h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17f6l29"
  }
 ]
}