{
 "submission_id": "17hv2re",
 "title": "Whats your worst „not proudest fap“?",
 "selftext": "",
 "created_utc": 1698434009,
 "permalink": "/r/AskReddit/comments/17hv2re/whats_your_worst_not_proudest_fap/",
 "score": 38,
 "url": "https://www.reddit.com/r/AskReddit/comments/17hv2re/whats_your_worst_not_proudest_fap/",
 "comments": [
  {
   "comment_id": "k6qtb50",
   "message": "You the guy that posted as few minutes ago, about the most underrated NSFW sub?  Came back with regrets huh?",
   "created_utc": 1698445701,
   "score": 252,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qt6ho",
   "message": "When me and my ex were still dating, I did it to her naked body sleeping next to me after we just had sex earlier that night. She’s masturbated in front of \u0026amp; next to me, so it wasn’t like it was anything weird, but the post nut clarity hit hard when I realized I could’ve just waited for her to wake up",
   "created_utc": 1698445645,
   "score": 140,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6q2xn3",
   "message": "When I was in highschool and helping my mom set up her new apartment after my parents split. \n\nNo internet for the first week so in my desperation I sloppily drew a pair of tits on MS paint and went at it like a fucking heathen",
   "created_utc": 1698435409,
   "score": 239,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r36dq",
   "message": "In the middle of a field in the outback Australia, literally no towns or mobile signal for 100 of miles. Cutting hay in a combine harvester for 12 hours a day everyday, me and a couple of freinds doing our farm work for the working holiday visa. Had literally no alone time had to sleep in a caravan with the boss, never out his sight unless we were in the fields. Got so horny I was fantasising in my mind for hours, literally in a trance, had to stop and kneel under the harvester, could have been snakes in the grass around me, battered one out and climbed back into the cab a different man.",
   "created_utc": 1698450087,
   "score": 164,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qkybq",
   "message": "On a bike while cycling through a suburb",
   "created_utc": 1698442210,
   "score": 43,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r1rim",
   "message": "I jerked off in the school bathroom when I was in ninth or tenth grade. I remember getting back to class and this girl, Jen, noticed a little stain on my pants and asked if I just jerked off in the bathroom.",
   "created_utc": 1698449450,
   "score": 32,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qo4ga",
   "message": "When I was a horny teenager, I have (more than once) gone to have a shower, and after a while drew a basic silhouette of a naked woman on the crystal door of the shower once it was full of steam. Definitely not my proudest fap(s).",
   "created_utc": 1698443510,
   "score": 156,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r11ky",
   "message": "Well…. Here goes…\n\nI was like 12, and on a long road trip with my grandparents and uncle. My uncle was passed out next to me in second row captain chairs. It was pitch black. I was 12, had nothing to do and the Light Boy for my GameBoy was out of batteries (because it always was). I had a blanket because it was middle of winter and my grandparents thought using the car heater. So… having nothing to do and a modicum of cover, I did the only thing my immature brain could suggest/demand. I have zero recollection of how or if I cleaned up. All I know is I finished, and the clarity that came to my brain was like a dolly-zoom. It hit me clear as day and I immediately knew I’d made a mistake. But, by morning (my grandfather drove all night), we had arrived at our destination and I threw the blanket in the wash. \n\nThere’s a memory I haven’t thought of in nearly twenty five years. Thanks for making me relive that shame.",
   "created_utc": 1698449125,
   "score": 212,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qs9v7",
   "message": "I lost my virginity fairly late at the age of 28\n\nSo ages 20-28 were really frustrating and confusing for me.\n\nI started having feelings for a cousin-aunt. Strong sexual feelings. \n\nI would imagine taking her outfit off and all those things. \n\nIn hindsight, it was a phase where I was just desperate to lose my virginity.\n\nAnd am glad I avoided formally attempting or committing incest.",
   "created_utc": 1698445254,
   "score": 116,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6quftw",
   "message": "Once upon a time all we had was ASCII porn at 300 baud.. Fapping line by line..",
   "created_utc": 1698446193,
   "score": 80,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r5l2z",
   "message": "as a teen, i was pulling the goalie a lot.\n\ni def remember climaxing while watching the robot humping the shit out of the dryer on robot chicken.\n\nwhenever i’m driving down the highway, i remember it sometimes and i’m like wtf was wrong w me haha. oh well.",
   "created_utc": 1698451172,
   "score": 74,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qqvsh",
   "message": "You. Everyone in this thread. Not my proudest fap.  Still did it though, you lovelies, you.",
   "created_utc": 1698444660,
   "score": 86,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qrsw9",
   "message": "I was like 13 and shopping for school clothes with my mom.  The woman helping us was all over me in a pretty inappropriate way in hindsight, but I definitely didn’t mind back then.  How my mom didn’t notice, I don’t know.  At one point, the woman brushed her ass right against my crotch.  Felt great.\n\nAnyway, I may or may not have gone home and masturbated over that grown woman.",
   "created_utc": 1698445053,
   "score": 21,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r2s4q",
   "message": "Look OP, it was difficult given how sparse your profile is, but I did manage. Not proud of it, but sometimes it’s gotta get done.",
   "created_utc": 1698449909,
   "score": 190,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6q65en",
   "message": "Probably just a really shitty porn video, like, terrible acting, unrealistic everything… but I was too lazy to switch videos",
   "created_utc": 1698436582,
   "score": 235,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qo4fe",
   "message": "Always worth dredging this challenging wank out https://youtu.be/fuyauRP6mAE",
   "created_utc": 1698443510,
   "score": 110,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qzcjb",
   "message": "As soon as I got home from finalizing my divorce. I dk why it got me so horny, and as soon as I finished the depression hit lol\n\nThis was over a year ago and I have had many happy faps since then 😊",
   "created_utc": 1698448370,
   "score": 103,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6ql2kv",
   "message": "The JC Penny Catalogue because back then, I thought underwear were genitals.",
   "created_utc": 1698442258,
   "score": 93,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r3eca",
   "message": "When my wife and I were first dating, I don’t remember exactly what happened but she did her best to find the end of my very long patience and I had to call it quits with her\n\nShe spent the next several days texting me, etc and I just ignored her since I had already said all I had to say\n\nAbout a week after, she sent me a very long email BEGGING me to take her back, promising she’d be different because she cared about me so much and all that. I’d never had someone literally beg to be with me, and by the time I finished reading it I was not only crying a decent bit, but also completely fucking bricked\n\nWhat happened next, in retrospect, did not exactly fit the context of the moment but hey, that’s showbiz, baby.",
   "created_utc": 1698450185,
   "score": 93,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r86j6",
   "message": "I went on a first date with a girl back in uni at a completely dark restaurant. The staff were all blind. I mean it was pitch black in there. To go to the bathroom, you had to call over a waiter to literally guide you to a dimly lit area behind doors where you enter a hallway to access the bathrooms. We both decided to go before we got the bill. When we got into the hallway I noticed one of her buttons came undone on her shirt so a bit more cleavage was showing. I sheepishly went into the bathroom and fapped one off like a fiend. We held hands on the way home. She is now my wife.",
   "created_utc": 1698452349,
   "score": 30,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qxlna",
   "message": "Church bathroom thinking about the pastor’s wife.",
   "created_utc": 1698447591,
   "score": 181,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r7aia",
   "message": "14\n\nDesk\n\nAt school\n\nTo the girl across from me 😔\n\nNot too proud of that one",
   "created_utc": 1698451945,
   "score": 28,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6q34ge",
   "message": "YouTube Drama, while watching a some youtuber roast a other youtuber I did it.",
   "created_utc": 1698435476,
   "score": 71,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6pzhhy",
   "message": "Ufc fight.",
   "created_utc": 1698434133,
   "score": 84,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qgy9u",
   "message": "My friends grandma",
   "created_utc": 1698440633,
   "score": 79,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r2o2z",
   "message": "I’m a girl but I once masturbated when I was like 12 years old on the couch under the blankets while I was babysitting my younger siblings who were sitting on the floor watching Rugrats. I still cringe when I think of it, even though they of course never knew.",
   "created_utc": 1698449858,
   "score": 70,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r983p",
   "message": "Grinch porn in the 6th grade. I know the actual video name by heart. I’m so depressed",
   "created_utc": 1698452813,
   "score": 14,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r15xp",
   "message": "Men are fascinating",
   "created_utc": 1698449179,
   "score": 50,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r3s4a",
   "message": "I shudder after everything I masturbate to... Doesn't everyone else??",
   "created_utc": 1698450361,
   "score": 13,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r3its",
   "message": "In the summer holidays for a few years I used to go to a church run summer school that was run by two ‘older ladies’. There was only like 10 kids there and these two women but it was actually really good for some of the stuff we did, cinema, ice skating, cool museums etc five days a week for 3 weeks in the 6 weeks holidays as we call it in the U.K. Stuff my mother wouldn’t be able to afford regularly but one time we went to a water park and I saw both of them getting changed in to their swimming costumes, like full frontal. Massive tits, big hairy bushes and actually really nice shaped arses. No sag at all just nice and curvy and all in the right places. They were in their late fifties but still to this day I think ‘wow, that’s a threesome right there that I wouldn’t not consider’. As you can imagine as a 12 year old who had just discovered that messing about with your willy does funny things. They were like A1 wank bank stuff.",
   "created_utc": 1698450243,
   "score": 36,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r4xs3",
   "message": "Rachel Ray cooking show when I was 12...",
   "created_utc": 1698450879,
   "score": 36,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r8yl8",
   "message": "There is this video of old Muslim men discussing how women go to hell if a man masturbates while thinking about them.\n\nJust to be safe, I concentrated really hard on their faces and masturbated. It was extremely difficult.",
   "created_utc": 1698452696,
   "score": 26,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qtqmj",
   "message": "Idk about “worst.” It’s not really *bad*. But once in high school I rubbed one out whilst watching Would I Lie To You. Not really *to* it, you know? Just…whilst.",
   "created_utc": 1698445887,
   "score": 36,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qp91u",
   "message": "When I was young I drew a comic of me bumping into a certain girls boobs in my middle school. I drew it on the Nintendo DS pictochat with my finger by myself late at night and went at it. Lol",
   "created_utc": 1698443979,
   "score": 41,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qrdmz",
   "message": "Saw a video of a fairly intense waxplay session and cranked one very confused fap out. Still not sure if it was the dude's whimpers and sobbing, or the idea of waxplay itself. No clue how to bring the vague interest up, either.",
   "created_utc": 1698444871,
   "score": 42,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qjcl3",
   "message": "Got bored ...fapt to lopunny while playing pokemon black 2",
   "created_utc": 1698441565,
   "score": 59,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r0u54",
   "message": "Grade 8 met my (cute) cousin for the first time(different country) and had to sleep on the top bunk of her bed. She had a photo frame on the wall. At night I nutted thinking about her on the back of the photo frame, spread it around so it wouldn’t drip, and hung it back. That was more then 20 yrs ago, still takes most unproud nut.",
   "created_utc": 1698449033,
   "score": 59,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r91fa",
   "message": "My wife had been acting odd and distant for a few weeks, so when I noticed she left her journal out I got nosey. Right away I came across an entry from when she was out of town about a month before. The entry went into vivid detail about 2 sexual encounters she had while away, it read like a letter to Penthouse. For some reason, in the midst of disbelief and sadness, I rubbed one out to it... I don't know why, but I did.",
   "created_utc": 1698452731,
   "score": 10,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qsz9i",
   "message": "To Beth on Rick and Morty. \n\nIt totally Cut the Chut",
   "created_utc": 1698445558,
   "score": 22,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r331m",
   "message": "Was during a mortar attack, I was in a portashitter in the desert and it was over 110 in there and smells like hot shit. But I was determined to finish so I did.",
   "created_utc": 1698450045,
   "score": 18,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r13tm",
   "message": "When I was trying to escape the labyrinth, but the minotaur pinned me down and, well, see for yourself:\n\n[https://www.reddit.com/r/sexbotlovers/comments/1760ico/the\\_minotaur\\_is\\_having\\_his\\_way\\_with\\_me\\_p/](https://www.reddit.com/r/sexbotlovers/comments/1760ico/the_minotaur_is_having_his_way_with_me_p/)\n\n[https://pixiepage.com/minotaur](https://pixiepage.com/minotaur)",
   "created_utc": 1698449153,
   "score": 9,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r6xy2",
   "message": "Some things don’t need to be shared.",
   "created_utc": 1698451786,
   "score": 9,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r5qsb",
   "message": "Tomb Raider 2 booklet.... Lara Croft was too much ...",
   "created_utc": 1698451243,
   "score": 7,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r6azd",
   "message": "When I was in my early teens, there was no internet yet as we know it. And I was poor besides. In the middle of the week, the Los Angeles Times would run department store ads in the A section featuring women’s bras and underwear. I’d steal the paper or wait until the next day and commit all the ladies to memory for “material.” I’m not proud of it, but I’m not going to deny it either.",
   "created_utc": 1698451498,
   "score": 8,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qngge",
   "message": "Thurston Howell III on Gilligan’s Island \n\nThere was an extended scene with Mary Ann and Ginger, but it switched to Jim Backus at the wrong time.\n\nWe didn’t have those fancy recording machines for playback…….. it was one-take, get it right the first time 😂",
   "created_utc": 1698443234,
   "score": 15,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qvse4",
   "message": "I had a job in high school working at a library putting books and magazines on shelves. Crazily enough, Playboy was one of the magazines we carried. And on more than few occasions I’d take one of the mags, go to the bathroom and get my business done. This was in the pre internet era.",
   "created_utc": 1698446786,
   "score": 23,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r5u0a",
   "message": "When the band Hanson came out I wasn’t sure if the lead singer was male or female but I was mid fap to them on the telly and remember telling myself I don’t care. Found out later he was indeed a dude so I sort of feel ashamed about that one.",
   "created_utc": 1698451284,
   "score": 7,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r8z17",
   "message": "Even the CIA couldn't extract that information from me.",
   "created_utc": 1698452702,
   "score": 7,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qnzk4",
   "message": "Girlfriend's panties. It was only ever that one time\n\nEdit: yall sure this is normal? I felt so degenerate...",
   "created_utc": 1698443454,
   "score": 27,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r2zy3",
   "message": "Did it in my moms car while their were celebrating my great grandma’s birthday…",
   "created_utc": 1698450007,
   "score": 6,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r5m0c",
   "message": "I don’t know if I like what I found on his previous post or not 💀",
   "created_utc": 1698451184,
   "score": 5,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qzy2v",
   "message": "Got randomly really horny driving up I-5 in California from Sacramento to Redding.  Jerked off into a sock as I was passing through Williams.  🤷🏿‍♂️",
   "created_utc": 1698448637,
   "score": 20,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r5blw",
   "message": "I found competitive masturbation the other day, it’s called Fap Hero",
   "created_utc": 1698451054,
   "score": 11,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r0pr3",
   "message": "some short video involving a dog and a girl (not involving penetration)... Holy shit i felt like an animal after\n\n\nNever again tho",
   "created_utc": 1698448979,
   "score": 23,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qws3a",
   "message": "Got caught. Awkward.",
   "created_utc": 1698447223,
   "score": 15,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r5701",
   "message": "1 fapped to 2 girls 1 cup once",
   "created_utc": 1698450995,
   "score": 25,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r0lin",
   "message": "lol I saw a Yaoi (Bara?) on a site and clicked it bc I thought it was so funny and wanted to laugh at it. Basically gay anime. \n\nWas actually hot lmao would never admit outside the anonymity of the internet",
   "created_utc": 1698448926,
   "score": 14,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r1pdm",
   "message": "gore hentai. I'm stuck in this rut and I absolutely fucking despise myself for it. fuck porn",
   "created_utc": 1698449423,
   "score": 14,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qycqy",
   "message": "My ex",
   "created_utc": 1698447929,
   "score": 8,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r62fd",
   "message": "I was 14 at the time, and i was watching some sex scene on a soap opera. The chick in it, and the setting was hot, so i stripped to my underwear and went ham on it. Luckily, no one was at home. Clairity hit, and i was like, \"Did i just wack off to a soap opera? I cleaned up and basically felt like shit for a while in embarrassment.",
   "created_utc": 1698451390,
   "score": 3,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r636y",
   "message": "A girl I barely knew sent me her tits and I fapped to it. She's my girlfriend now tho so I don't actually know if that was bad",
   "created_utc": 1698451400,
   "score": 4,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r9lkg",
   "message": "The turn down for what music video. Don’t ask",
   "created_utc": 1698452978,
   "score": 4,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6rcahj",
   "message": "Fingered myself in the shared non-lockable bathroom of a mental hospital",
   "created_utc": 1698454193,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6rdkpc",
   "message": "GTA strip club at my cousin's house while he went to get food.",
   "created_utc": 1698454778,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6recm8",
   "message": "I was in the middle of a fap when my friend called me from the other side of the planet. I was in France and he was in the US. We started off talking about life stuff and then he started to complain about his work and almost started crying for how stressful and undervalued he felt at work. But I couldn’t stop so I came whilst my friend was pouring his heart out over the phone. We are best friends since high school but I never told him this lol.",
   "created_utc": 1698455139,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6rgprq",
   "message": "15 years old sleeping at my buddy’s house. He had a couch in his room, the door was open and directly across from his room was his sisters room. He was asleep and snoring, I was uncomfortable looking around and I saw her underwear on the floor, she wasn’t home. You all know exactly what I did.",
   "created_utc": 1698456251,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qftda",
   "message": "I didn't know what fap meant before this comment section...",
   "created_utc": 1698440201,
   "score": 25,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qrsuf",
   "message": "I’m insanely curious over who would ask this and who would answer it",
   "created_utc": 1698445052,
   "score": 18,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r1unz",
   "message": "Idk, Bible Black?",
   "created_utc": 1698449489,
   "score": 6,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qvynd",
   "message": "Went to a friends house and he wasnt there. So while I was waiting for him in his room, a boxer appeared to be hanging on the laundry basket. Then I smelled it and start doing my thing with it. Then I washed it tho.",
   "created_utc": 1698446864,
   "score": 11,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6qy3v0",
   "message": "I would give you the number, but it seems that it was taken down.",
   "created_utc": 1698447818,
   "score": 3,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r1s5e",
   "message": "In the restroom at the Dan Quayle museum.",
   "created_utc": 1698449458,
   "score": 3,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r41du",
   "message": "My friends mom had a picture of her friend on the wall. I couldn’t help myself 😂. My friend woke up midway during one of my faps too and yeah… super awkward…",
   "created_utc": 1698450478,
   "score": 3,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r540x",
   "message": "When I was 12 I asked a girl friend of mine (not girlfriend) to send me a photo of herself, she did, jerked off to it. There was nothing inherently sexual about it, it was a normal photo 😂 I still wonder why I did that",
   "created_utc": 1698450957,
   "score": 3,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6r6y0x",
   "message": "I had no internet and no pictures to fap off to. I tried to get it off with just my imagination but wasn't able to nut. I had a drawling app on my phone and drew 4 circles and 2 dots to make a pair of tits and that did it for me",
   "created_utc": 1698451787,
   "score": 3,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6raihr",
   "message": "When i was 13, my family decided to go our Village for vacation. Village were stuck in 80's no internet, not even cell phone signal, latest tech was 80's old TV's. Fully remote. Anyway, i jerkes off on a bed sheet advertisement, at least there was a woman on it",
   "created_utc": 1698453386,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6rapst",
   "message": "Average ask Reddit question",
   "created_utc": 1698453476,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6raz3h",
   "message": "When i was about 12-13 first grade in middle school (same as high school, school system is different in here, kindergarten is 3-6, \"lower school\" 6-12, \"middle school\" 12-18, then theres our \"high school\" which is basically like college and university)\n\nWe had a very, very boring lesson, and i just had raging hormones\n\nBack then everytime i almost fell asleep and got to wake myself a bit better again i got an erection\n\nSo basically i had a gigantic boner (and i wore training/sweatpants, so defo not able to hide it), and the class was pretty dark for those transparent/overhead type of projectors\n\nI was like i gotta get rid of this boner, i wont really miss anything important, and i just jacked off silently in the class room and cummed in my underwear basically, i used to sit pretty much in the back of the class room so not much chance for anyone to see and i did it in my pants either way\n\nThat was a very satisfying orgasm, came when i needed it the most both due to the raging hormones and the boredom.",
   "created_utc": 1698453591,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6rb67g",
   "message": "I once jerked off to the Lego Princess Leia minifigure wearing the slave girl outfit. Not my proudest moment.",
   "created_utc": 1698453680,
   "score": 1,
   "submission_id": "17hv2re"
  },
  {
   "comment_id": "k6rf0ds",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17hv2re"
  }
 ]
}