{
 "submission_id": "17hyk8d",
 "title": "What's the most bizarre coincidence you've ever experienced?",
 "selftext": "",
 "created_utc": 1698443587,
 "permalink": "/r/AskReddit/comments/17hyk8d/whats_the_most_bizarre_coincidence_youve_ever/",
 "score": 106,
 "url": "https://www.reddit.com/r/AskReddit/comments/17hyk8d/whats_the_most_bizarre_coincidence_youve_ever/",
 "comments": [
  {
   "comment_id": "k6rcf87",
   "message": "I went to a used book store in Calgary with a friend. We were both teenagers. I spotted a yellow rectangular collection of *Garfield* cartoons and said, “Hey, I used to have that book.” My friend grabbed the book, opened it up and started flipping through the black and white panels when something small and thin fell out of the book. I picked it up. It was a school photograph of me from elementary school.",
   "created_utc": 1698454253,
   "score": 217,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qti9y",
   "message": "Took 23andme test, couple years later, found my biological sperm donor father. we connect on facebook, he shows me his daughter's page, i see she has a mutual friend with me, it's one of my best friends. I text him, how do you know this girl I just found out she's my half sister. He goes, call me right now. Turns out they're cousins, and so are we. My friend's dad married my sister's aunt.",
   "created_utc": 1698445788,
   "score": 175,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rgdlq",
   "message": "OK, here we go. About 20 years ago, a friend of mine wants me to help eBay his high end audio equipment from the early 80s, really nice stuff, original boxes, etc. Stuff was selling well, a few smaller pieces had to be shipped international.  \n\nLast item were two rather large speakers, really nice cabinets, original boxes the size of small refrigerators. Was really nervous, because the high bidder on the last day was in South Korea, and we had NO idea how we would ship them there.  \n\nAs we watched the bids come in toward the close of the auction, there was one in Australia, one in Japan, we were like, shiiittt!. Bid comes in last couple seconds, USA buyer! Phewww...  \n\nTurns out, he lived in the same block as my friend, their back yards almost touched. We literally delivered the speakers through the back yard. We had a hard time believing it ourselves.",
   "created_utc": 1698456093,
   "score": 250,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r733p",
   "message": "I'm from a small town in Idaho. Less than 5,000 people. The first time I ever traveled to Europe, we landed in London, and stayed in a bed and breakfast. Got in very late went straight to bed. In the morning we went downstairs for breakfast and had to share a table with another couple. They were from the same town!",
   "created_utc": 1698451850,
   "score": 238,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qogdj",
   "message": "I once bumped into my childhood best friend at the Louvre in Paris, completely unplanned. We hadn't seen each other in years.",
   "created_utc": 1698443647,
   "score": 164,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qp18x",
   "message": "I once moved from a random suburb in Georgia to a random suburb in Virginia in high school. A few months after I started at my new school, I ran into a kid I'd gone to school with since elementary school in the hallway.",
   "created_utc": 1698443890,
   "score": 181,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qt6wx",
   "message": "My Dad moved to Boston from Chicago in the early 70s when he graduated high school. He got a job at a local store where he met my Mother. After a few months of dating, his Mother drove out to visit him. He introduced her to my Mom and they went to dinner at her house. When the two Mothers met for the first time they both realized they were best friends growing up before my Grandmother on my Dad's side moved to Chicago with her family when she was young.\n\nThere was no other connection for my parents to meet, it was random. And it just so happened that my Grandmother's were best friends in grade school before one moved to Chicago.",
   "created_utc": 1698445651,
   "score": 118,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r7ykb",
   "message": "When my grandmother passed away on my father's side, we were cleaning out her things, going through old documents, etc. We found the newspaper clipping of my dad's baptism. My mom goes \"thats where I was baptized\"! Turns out, my dad and mom were baptized at the SAME service when they were babies. It was such a cool fact to learn, they had no idea!",
   "created_utc": 1698452246,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r0olt",
   "message": "A friend I work with have so many past syncronicities and we continue to have little ones now. In the past we dated brothers without meeting each other, we lived in the same street one house apart without bumping into each other, we hung around same places, w head two same surgeries at the same times, like same music and comedians and now we do things like both bring homemade brownies to work without knowing the other was, wear same colours, it’s kids cool",
   "created_utc": 1698448965,
   "score": 116,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r0ea6",
   "message": "Decided to wear my 'Lucky Shirt' for a job interview. The interviewer had the same shirt. She said, 'Anybody with this shirt has great taste, and is definitely hired.' Best. Coincidence. Ever.",
   "created_utc": 1698448838,
   "score": 57,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qqair",
   "message": "My late best friend and I were ships in the night on multiple occasions over several years before we actually met and didn’t put the pieces together for years. I miss him so much.",
   "created_utc": 1698444412,
   "score": 66,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rokqu",
   "message": "There’s cliche about Canadians having conversations with non-Canadians that goes like “Oh you’re from Halifax? Do you know my friend Danny in Calgary?” For context, that’s roughly the distance from Boston to Phoenix.\n\nSo I am in Hong Kong, talking to a woman. She asks me where I was from. At the time I lived in Toronto. She said, “Oh, do you know my friend Alan Last Name?” He was my dorm neighbour at university.\n\nETA: Neither she, Alan or I are Asian or from Hong Kong.",
   "created_utc": 1698459973,
   "score": 63,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r4du0",
   "message": "I'm not going to use our real last name, but it's something like St. Croix and it's my husband's surname.  \n\n\\------\n\n**His** paternal grandmother lived on St Croix Street when she met and married his grandfather, X St Croix (this was in a midwestern state)\n\n**My** father is from St Croix, *Northern State*  and lived on both the St Croix river and Lake St Croix in that northern state\n\n**My** childhood best friend was not from the US and their first name was St Croix\n\n**My** maternal grandmother went to St Croix High School in a different midwestern state\n\n**My** paternal Great grandfather's middle name was St Croix",
   "created_utc": 1698450632,
   "score": 58,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qri2o",
   "message": "Not a massively crazy coincidence, but quite a cool one, I think.\n\nI go for a walk every evening, and my usual rout takes me along the canal towpath close to my house. I like to go that way because it's a scenic walk, and there's one particular stretch of canal that has a great view of Solsbury Hill, which is a pretty well know local landmark. It's the hill from the [Peter Gabriel song.](https://www.youtube.com/watch?v=_OO2PuGz-H8)\n\nSome time last summer I was out on my usual walk. At that time of year the canal is busy with holiday makers in canal boats. I saw two couples sitting on the towpath next to their boat, they were chatting and listening to music. As I got closer, I realised they were listening to Solsbury Hill. I assumed they were listening to the song because they were sat in the place with the best view of the hill in the City, so as I walked past, I said something to them about being in the perfect place to be listening to that song, which seemed to confuse them.\n\nTurns out they were just listening to music on shuffle. But one of the couples was really taken aback because the song actually meant something to them, like it was a song they listened to often when they were first dating or something, and was one of 'their songs'. They had no idea that they were pretty much sat in the hills shadow. It made their day. I gave them directions on how to get up to the top, and as far as I know they went on a hike up there the next day. It made me happy knowing that it had made them so happy and had given them a cool holiday memory.",
   "created_utc": 1698444924,
   "score": 173,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r32bl",
   "message": "I've found a girl on Reddit that looked EXACTLY like me. I even showed her picture to my family and they were all flabbergasted.",
   "created_utc": 1698450036,
   "score": 57,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rkquw",
   "message": "Flight from Nashville to Dallas. Sat next to a gentleman, got to talking. Turns out, he grew up in my hometown (small, Midwestern town), two streets away in the same neighborhood, graduated from the same high school, just 10 years earlier. His Mom was my Kindergarten teacher.",
   "created_utc": 1698458152,
   "score": 57,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qy4lr",
   "message": "My dad had a son with an ex-wife before meeting my mom, but it’s a dark part of his past that he despises talking about. So I have an older 40-something step-brother I’ve never met, supposedly living somewhere in my county (which is a rather big area).\n\nI’m a pharmacist in a small town in this county, and a few days ago I got a prescription from a woman in her 40s. Her surname was the same as mine, and since it is a very uncommon one, I kindly asked her at the counter if there was a chance we were related.\n\nWe connected the dots, and I found out that she was my stepbrother’s wife… So, of all places, it’s at my job that I unexpectedly met my previously unknown sister-in-law and that I learnt my stepbrother’s whereabouts.\n\nEDIT : half*-brother, sorry English not my primary language! 😂",
   "created_utc": 1698447828,
   "score": 109,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qqyou",
   "message": "I one encountered James LaBrie of Dream Theater coming out of a 7-11 with a Big Gulp as we were both going to his concert.\n\nA few weeks earlier my friend had called the concert line of the local radio station in order to buy those tickets and was greeted with “Congratulations, you’re our fifteenth caller;  you’re going to see Sammy Hagar!”  Turns out she called the contest line, not the concert line.",
   "created_utc": 1698444694,
   "score": 101,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qzdc9",
   "message": "An 11 year old girl ran away from home and the police/family were desperately searching for her across a few neighborhoods (including mine) in rural Pennsylvania; a call to action was sent out. The sun was coming down and I figured I’d drive around a bit looking on my way to run errands. I thought a bit about where she might be. I drove to that spot and arrived at the exact location and the exact time she was found/reunited with her family. The mom had just pulled up a moment before me; I sat and watched as they embraced and got in the mom’s car.",
   "created_utc": 1698448381,
   "score": 104,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rhz0e",
   "message": "In 1992, I flew 1,500 miles from my home in NYC to run a marathon. At the pasta dinner the night before I got to talking to the woman seated next to me.  She was at the race to cheer on her husband and daughter, both seated at another table that only had room for two.  We never discussed where we were from — she could have been local to the race, for all I knew. We dined and chatted and then went our separate ways.\n\nAbout a year later I joined a running club near me for training partners and met many other local runners.  Six months after that I attended the annual awards gala, which non-running spouses of team members also attended.  And there she was; it turned out the running husband was someone whom I had known for several months by the time of the gala.  He had never mentioned having been at that particular marathon, and at the dinner she had never mentioned being from NYC.",
   "created_utc": 1698456851,
   "score": 37,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r6brl",
   "message": "My past company was located in the Philly suburbs. There was a client from DC we had dealt with for a couple years but never met. She decides to come visit our office because of a project. She mentioned she had never been in Pennsylvania before. My boss, the client and I go out to lunch. So while we're chatting in the car she mentions she has a good friend, who she used to date, who lives in our area but didn't know exactly where.  Then she mentions a few details and that his mom had murdered his dad. I turned to her (I wasn't driving) and I said, his last name isn't xxx is it? She's like, yeah, it is. Turns out I grew up with him, he was about my age, his family lived right up the street from me. Well, until the murder took place. But we had lost touch after high school, which was before the event. I just thought it was so bizarre.",
   "created_utc": 1698451508,
   "score": 40,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ria13",
   "message": "My roommate and I studied abroad spring of our junior year, me in London and her in Madrid. For my spring break I visited her and then we both went to Berlin. On our last night we both drank a lot and were honestly still a little drunk when it was time to get our early morning flights. We got lost transferring to get to the train to get to the airport. It’s like 5 am. A young man sees us struggling with a map and asks if we need help. He’s like our age, and also American. We tell him we’re lost and he shows us the way to the right train platform. \n\nWe’re chatting on the way. He’s also studying abroad, but he studies in Dresden, is in an ROTC program back home and is visiting Berlin for the weekend. It starts to sound familiar, so I ask where he goes to school - and it’s the same university we go to. My roommate and I both yell “NO FUCKING WAY” and I even show him my regular university ID. of all the people to stop and help us, what are the odds we manage to run into a person from our school thousands of miles away?",
   "created_utc": 1698456996,
   "score": 38,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r195f",
   "message": "I’m from the south and went to college in CT. I met awesome people and had a tight knit group of friends. I moved back to the south and later met my now husband. During the peak of COVID, CA, where my husband is from, was doing a lot of work releasing inmates and his brother seemed to be the ideal type of person they were releasing. I told him that one of my college friend’s dad was a retired public defender in CA and maybe he could pull some strings to get his case looked at for possible release. I called him and his dad was more than willing to help. Turns out that my friends mom, also a public defender, represented my husbands brother during his appeal. It was a case she still had on her desk! Small small world. \nMy BIL had his sentence commuted by Gov. Newsom and he was home before Christmas",
   "created_utc": 1698449219,
   "score": 33,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rnpb7",
   "message": "Parents went to Costa Rica. In a tiny village, they stopped for a beer. Sit down in this place with mabey 6 chairs. There is one other couple there also having a beer. It was there old neighbors from across the street when they lived in Saskatchewan...",
   "created_utc": 1698459555,
   "score": 33,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rn0ep",
   "message": "Went to China on vacation and was taking a riverboat tour on the Li River. Was taking photos of the beautiful scenery when another boat passed us going the opposite direction. On the other boat, also taking photos and facing me, was a colleague. Neither of us knew that we would be in China. He was on a private tour with a completely different itinerary than I had. I was on a group tour with my family and we left on different days, not somehow ended up in the same place at the same time.",
   "created_utc": 1698459223,
   "score": 28,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rbs2e",
   "message": "Met a girl in a hostel in Edinburgh. We then ran into eachother in the botanical gardens later that day, despite neither of us having originally planned to go there. Then ran into her a month or so later in Munich. I'm half expecting to run into her again somewhere else, but it was seriously weird.",
   "created_utc": 1698453958,
   "score": 47,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rgwtr",
   "message": "When I was 16 we had just moved to a new house, in a new province. A few months after moving (we still didn’t know anyone in the neighbourhood really) my family dog had gotten out and we initially didn’t realize (back gate was open, we never had a yard before so it wasn’t a habit yet to ensure the gate was locked). I noticed he was gone and went to the front yard to start looking around and as I was walking out looking concerned, a car with 2 women in it pulls up and asks if I was looking for a dog. They had our dog in their car and said they found him about half an hour prior a few streets over. One of the best coincidences I experienced for sure. Still grateful for those ladies over 10 years later!",
   "created_utc": 1698456344,
   "score": 22,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6robfx",
   "message": "In the space of 12 hours, I randomly encountered 16 different people I knew from various points in my past at different places in New York City. \n\nA place where none of us have ever lived.",
   "created_utc": 1698459845,
   "score": 20,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r9p62",
   "message": "I once shared a diving boat in Mauritius with someone who went to the same University diving club as me in Liverpool. I hadn't met him in the 3 years I was there as he had been in Singapore all the time I was at that club.",
   "created_utc": 1698453023,
   "score": 18,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rnj1c",
   "message": "I was walking down a street in Florence, Italy. Someone called out my sister’s name. We look alike. It was her friend from school.",
   "created_utc": 1698459470,
   "score": 17,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rno39",
   "message": "I went to Florida for a vacation and met a kid from Texas on the beach.  We played together all day, then went our separate ways.  A few months later, he walks into my classroom in a parochial school in Ohio as our new student.  He had just moved from Texas.",
   "created_utc": 1698459539,
   "score": 17,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r5hcf",
   "message": "We moved to a neighboring state last year and we narrowed down our desired areas to 2 neighborhoods after driving to over 40 recent listings and ended up with our first choice house. The house is so close to so many things and places that were major parts of my childhood and favorite places of my grandpop who passed away suddenly a few years ago. This move wasn’t really planned and the area we ended up in wasn’t even on our radar before. It absolutely feels like we’re meant to be in this house and it makes me feel like my grandpop knows we’re hear even though he never got to see us move from our first house and he would have loved the new house.\n\nEdit to add - my bf’s childhood best friend’s parents who had basically never left the city they lived in sold their house and live about 5 minutes from us. They had no idea we moved here and now whenever his best friend brings his kids to see their grandparents he comes and hangs out with my bf.",
   "created_utc": 1698451126,
   "score": 15,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ro0vb",
   "message": "My wife’s friend growing up was named John L. \n\nJohn was a quirky guy who went to a tiny college in the ozarks I had never heard of until he went there, while my wife and I met each other while we were at Texas A\u0026amp;M.\n\nFlash forward years later, and I had transferred divisions within a company I worked for. I’m chatting with one of the other guys about college football, and he says, “Oh, I don’t have a team. I went to a tiny college in the ozarks you’ve probably never heard of.” \n\nI find out that he went to the same college as John L., and I tell my new co-worker, “I know that college. My wife’s friend John L. went there.”\n\nMy co-worker proceeds to say, “You know John L.?! He was wild our freshman year.” And we proceeded to share stores about a guy who went to a tiny college in the ozarks that most people never heard of.",
   "created_utc": 1698459707,
   "score": 18,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rgcgi",
   "message": "We had the same desk manager at 3 hotels in three different areas in two countries.",
   "created_utc": 1698456079,
   "score": 15,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rfg8p",
   "message": "Once I was dreaming that I kept trying to turn on a light in a dark room but the switch wasn't working. When I woke up I tried turning on my bedroom light and the bulb had burned out",
   "created_utc": 1698455662,
   "score": 28,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ri17u",
   "message": "My parents got married almost 50 years ago now. They both grew up in small towns, but in different states. They met, etc (not relevant to the story) and eventually married. \n\nMy dad's grandparents met my mom's grandparents for the first time at the wedding, and they sat down to chat at the reception. The grandmothers both had an interest in genealogy, so they started talking about the first person in their respective family trees to come over to the US from Europe. \n\nIt turned out that the first immigrant in each family came from the same small town in Denmark and had come to the US at about the same time in the mid 1800's. Their records/information about who was who back in Denmark was pretty thin, but they think that the two immigrants probably knew each other before they left home a few years apart. And about 125 years later, a descendent of each of the two immigrants met and they (my parents) married.",
   "created_utc": 1698456880,
   "score": 31,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rlf5a",
   "message": "Accidentally left my laptop at a cafe at a train station.  Went back of course it was gone.  They had an information booth and I went to report it missing.  They told me to find a police officer…while walking around trying to find one the information desk person was outside and waved me over…I followed her thinking she found a cop…she then went into the booth, came out and handed me my laptop…I was so excited and happy…I said thank you and ran to get on one of the buses that came to the station…passing by a young man who was sitting down.  He said I’m the one that turned in your laptop…the case was distinctive so I’m sure that’s how he recognized it…I also had my passport inside…I was shocked that I picked the exact bus he was on and I ended up handing him 20 euros…",
   "created_utc": 1698458469,
   "score": 11,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rlfsp",
   "message": "In a high school history class, I would read a book after finishing tests. Also, that teacher would generally give us a bonus question or two when everyone was done,  usually related to what the test was about but nothing we covered in class. One test was while we were doing Roman history, and the book I was reading was Rainbow Six. The bonus question he asked was something one of the characters mentioned in the part of the book I had just read after finishing the test. It has stuck with me all this time because of how trivial it was.",
   "created_utc": 1698458477,
   "score": 26,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qzkf1",
   "message": "Made friends with a random guy on Runescape. Turns out ve was the cousin of a friend throughout my entire time in Middle school.",
   "created_utc": 1698448469,
   "score": 21,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rfif8",
   "message": "I was in the Army at some training thing in another state and we were talking about our first homes.  I lived in this tiny town of 300 next to the armory I was working at for a couple years.  \n\nOne of the guys in the unit said he’d lived there too, which was wild enough, but when I described the house across from Casey’s; he had lived in the exact same house.  So weird!",
   "created_utc": 1698455690,
   "score": 17,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rg1dm",
   "message": "Had some friends/drug dealers i knew and bought from (stuff like E, K, coke) back in the early 00’s. We partied together at clubs and raves a lot. \n\nOne weekend i’m helping my mom move from on part of the state to another (in a very big state). We’re hundreds of miles away from the city i lived in and mom decides she wants to make a detour to a scenic lake an hour off the beaten path. We get to the lake and start hiking around. Round a corner and run into my drug dealing friends and their girlfriends kicking back on the shore.\n\nI stare at them, they stare at me as we all (excluding my oblivious mom) try and decide if this is some weird setup. Eventually I introduce my mom to my “friends” and we all have a wholesome visit on the shore of this random alpine lake 300 miles from the city of many millions were we lived.",
   "created_utc": 1698455937,
   "score": 19,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rimvb",
   "message": "Very recently, my father quit drinking. While he was drinking, every time he'd go to the grocery store, he'd buy at least one beer (typically more), so the automatic checkout would summon an employee to check his ID. The first time in several years he didn't buy anything age restricted, the machine had a malfunction and summoned an employee anyway!",
   "created_utc": 1698457164,
   "score": 19,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rkmqc",
   "message": "Many moons ago, I met a kid who we will call A in my first year of community college. We got along through our mutual interests and he had hung out with me and my friends a couple times so my friend circle all knew him except for 1 friend named B.\n\nB and his family were from another country and he had 3 brothers. He was in the military so he wasn't home all the time. He comes back to town to visit and asks if all want to come over to hang out. We all say sure. We all make our way over to his place and are hanging out in his backyard drinking and catching up with him. \n\nOne of B's older brothers comes into the backyard to say what's up and asks if one of his online friends can join us. We say sure. Who is it other than A, the kid I knew from community college. We were all flabbergasted. How the hell did A, this random kid I met at community college, know B's brother, someone from a whole ass different country?\n\nTurns out A and B's brother used to WoW together way back in the day before B and the family moved to the US. They moved to the same city and state that A and us lived in. So A and B's brother reconnected and began hanging out in real life. I just happened to meet A at community college and was unaware of B's brother being friends with him until this point. The whole thing was a total mindfuck.",
   "created_utc": 1698458098,
   "score": 7,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rkui0",
   "message": "Was on an open top bus in New York and got talking to a British couple it worked out they lived 5 doors away from us in a new house we had just moved into both from Liverpool England .",
   "created_utc": 1698458201,
   "score": 9,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rf7df",
   "message": "Once when I was in 6th grade I ended up with the same pair of shorts my step sister gave to the thrift store",
   "created_utc": 1698455544,
   "score": 16,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rq0ce",
   "message": "I was walking next to a beautiful girl in SF and we talked for a few minutes. For some reason I broke my norm of being polite and saying bye and asked if she wanted to go out sometime. We did go out and then realized we grew up 15 mins from each other. That chance meeting led to 3 kids and 20 plus years married.",
   "created_utc": 1698460673,
   "score": 15,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rg9w1",
   "message": "Back in 2004 my company had a mass lay off I ended up getting moved over to customer service/parts supply.\n\nThen in 2006 I was laid off I went to Missouri and stayed there for 2 years. I came back to the same town. I temped for a company for about a year,  didn't get hired, got laid off, went to another one and was hired but fell sick later and this was 2013.\n\nI then got hired at another company and I was testing printers. Stay there until I had my hip surgery in 2017. While recuperating, I happened to go over to the community center and begin chatting with a another person who was there.\n\nHe asked me if I would read his resume that he's trying to get a job at a food distribution place for charity.\n\nI find out his last job was the one I got after he was laid off in 2004 from the company.",
   "created_utc": 1698456046,
   "score": 8,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rnrr5",
   "message": "My friend was on the phone talking to another mutual friend and passed the phone to me to chat with him.  There was another conversation cutting in.. I recognized the voice. It was my sister, calling from a friend's house to her friend.  \"Sister? Is that you?  What are you doing on this call?\"\n\nNeither my friend nor my sister's friend knew of the other and had no way of connecting and we lived in a very populous area. This still puzzles me as the most bizarre coincidence I've ever experienced.  It's so rare to have cross-talk in a phone call (it's never happened to me before or since) and for it to be my sister on the other line is just weird.",
   "created_utc": 1698459588,
   "score": 7,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ro980",
   "message": "Went to Club Med in Mexico with my family, we met a couple there, after returning home after a week there, the next weekend me and my father went to a football game at the Coliseum in LA, and bam, they were two rows up behind us.",
   "created_utc": 1698459816,
   "score": 6,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r0v8z",
   "message": "I'd started a new job in London, two weeks in and a female turned up to deliver and install some new software package. The boss asked if he could take her for lunch, but she respectfully declined. On her way out she said to me \"Are you coming then?\" She and I had been uni friends with benefits, had lost contact and the office thought I was a babe magnet. I'm not.",
   "created_utc": 1698449047,
   "score": 42,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rr1cb",
   "message": "Flew from USA to London England with my father on vacation unrelated to work. Ride train from Heathrow to Earls Court tube Station. Ride escalator up to street.\n\n\"Is that you, Mr. EMBNumbers?\" \n\nOne of my father's coworkers happens to walk past and recognize us on the side walk in the instant we emerge from the underground in a city of many millions of people thousands of miles away from work.",
   "created_utc": 1698461164,
   "score": 5,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ru5jo",
   "message": "My husbands ggggggreat grandfather mapped roads with my ggggggreat grandfather in Massachusetts. They each named a road after their family name and both roads still exist today. Discovered this going family tree research.",
   "created_utc": 1698462733,
   "score": 6,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ru6uo",
   "message": "My dad accidentally hit the same dog three years apart when it strayed onto the same stretch of a busy road, 5 miles from our house. Dog survived both times. I was in the car, both times.",
   "created_utc": 1698462753,
   "score": 7,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s5sdm",
   "message": "I was shopping at a vintage store, looking at frames, when I saw a really old one, that looked hand carved. Looking closely, I realized that the painting in it looked familiar. \n\nThere was a signature in the corner that I  recognized. It was my father’s signature. He had been dead for 20 years, and lived all the way across the country from the small town I was shopping in. \n\nMy father was an artist and also an art conservator. Once he purchased a painting for $1500 as an investment, to restore, and resell. \n\nAs he was working on the piece, he realized there was another painting under the top layer. When he removed the top layer he saw a painting of ballerinas. \n\nHe sent it to the Metropolitan Museum of Art to be authenticated. It was an original Degas painting. The Met purchased it from him for $1,5 million. \n\nHe didn’t live many more years after that, and he spent most of his money before he died.",
   "created_utc": 1698469491,
   "score": 6,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rlell",
   "message": "My sister bought a house after the elderly owners of 50 years died. The day they moved in, she gets a call on her phone and the caller ID says the name of the guy who used to live there. Turns out it was the moving company and they had just changed their number and the old couple’s number had just been recirculated. Seriously, the odds of this happening kind of blow my mind.  \n  \nAnother one recently was a year+ after having a kid, on two separate occasions meeting parents who had babies within 3 days of us in the same delivery room, one the day before and one two days after. One was randomly in a park and the other was at a new job, and I live in a fairly large city.",
   "created_utc": 1698458463,
   "score": 16,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rfw1x",
   "message": "My college roommate married my brother’s wife’s college roommate. Neither couple met in college and this was unknown until after the fact. \n\nBut yeah, my brother and my college roommate married women who were also college roommates.",
   "created_utc": 1698455867,
   "score": 10,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rnfbu",
   "message": "Back in either late junior high or early high school, I was chatting on Yahoo messenger with a friend from school. He said something like \"hey, I'm gonna add my friend\" and made a group chat. The other person ended up being my cousin, who lived an hour away and went to a different school. I only saw him a few times a year. I still am not 100% sure how they knew each other, but knowing both of them, it was probably from some relatively local online gaming group or something. \n\nAt first I thought my friend was just messing with me, but my cousin was able to answer things about times we had hung out, inside jokes, etc.",
   "created_utc": 1698459420,
   "score": 6,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6roreb",
   "message": "My partner had a classic car that had been on a trailer in his driveway. When they were unloading it, the car got away from them, and rolled into the garage and crashed into the freezer. He later sold the house, and took the freezer with him. We met a guy in a car club who had the same type of car. His car also crashed into a freezer they put in the same spot in the garage…in the same house! He was the new owner",
   "created_utc": 1698460064,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rql33",
   "message": "My grandmother was diagnosed with alzheimers in my late teens. I had moved far far away after high school. One night I had a creepy dream about my nana. I told my mom about it and she said she had a similar dream the same night. Apparently my Nana was found wandering outside near her apartment that night. Very very interesting.",
   "created_utc": 1698460949,
   "score": 5,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rs6gm",
   "message": "When I was 14, I was walking through a neighborhood with my middle school best friend in Indiana. She pointed to a house and told me about how her childhood best friend Martha used to live there and told me a few stories of memories she had at the house with her. She also told me how Martha moved away to Florida and they grew apart.  \nFast forward 3 years, I moved to Florida. I went to a new high school and made a ton of new friends. My middle school friend visited me down there and posted photos on her Facebook, and her friend Martha commented on it saying how we were right down the street from where she lived. Turns out, Martha was friends with a ton of my new friends.   So me, my middle school friend, Martha, and all my new friends all hung out together and it was kinda the wildest experience ever realizing how small the world is.",
   "created_utc": 1698461727,
   "score": 6,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s12so",
   "message": "This sounds so unbelievable but I was on a first date with a guy I met on a dating site. Years ago.  He had mentioned he's picky about where he will eat because he knows of some places that have bugs. So he decided on one and we met there. We hadn't even ordered yet when he was talking about places which have bugs when , no shit, a bug fell out of the vent above our table and landed on the center of the table right in front of us. I could not help but bust out laughing because it was so unreal and coincidental. We never saw each other again, but damn. It was pretty funny.",
   "created_utc": 1698466534,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rpzql",
   "message": "Ran into an old coworker. I hadn’t seen in years at a café in Paris. Five years later, waiting in line at Newark airport to fly to Paris and there she was again.",
   "created_utc": 1698460666,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rqss0",
   "message": "Went to a family reunion in Nashville.  After, I was headed East to hike the Smokey Mountains and my sister was headed West to go to Graceland.  It rained heavily, on the first day hiking and the forecast was continued rain for the next 2 days.  I decided to go caving in Mammoth Cave instead.\n\nIt was my sister.   We were supposed to be 440 miles apart.  Neither one of us had mentioned Mammoth Cave at any point previously.  They got bored at Graceland and decided to check out Mammoth Cave.  We were at the exact same place at the exact same time.  5 minutes later, or earlier, and we would have totally missed each other.\n\nIt was my sister.   We were supposed to be 440 miles apart.  Neither one of us had mentioned Mammoth Cave at any point previously.  They got bored at Graceland and decided to check out Mammoth Cave.  We happened to be at the exact same place at the exact same time.  5 minutes later, or earlier, and we would have totally missed each other.",
   "created_utc": 1698461049,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rtnaq",
   "message": "I bumped into my estranged father in an airport in a state that neither of us lived in. I hadn’t seen him in four years at that point, and only once in the previous 10 years.",
   "created_utc": 1698462469,
   "score": 5,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rue5l",
   "message": "I got stuck in traffic on my way to work and was 2 minutes late for my serving shift. I got sent home early that day, but I’m glad I was because I was just in time to catch my next door neighbor attempting to climb through the kitchen window. I grabbed the biggest, sharpest knife…pulled the curtains aside and told Crazy Karl to FUCKING BEAT IT.",
   "created_utc": 1698462861,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ruqwf",
   "message": "I decided to go to a farmer's market the next city over. While shopping a guy decided to have a shootout with cops outside. Turned out to be a movie style shoot out because apparently cops took cover by a propane tank which got shot and blew up. Cops killed the guy and I think a few cops were injured by the blast. I got the heck out of there afterwards without buying anything because the area was now a crime scene plus it was just a bit scary. A year later I'm now living in they city and get called to jury duty. First case they call me to is that exact case. The cops were there in a type of trial to see if there is enough evidence of wrongdoing to see if an actual trial needs to happen. I told the court I was present during the shooting and was dismissed immediately. I was the talk of jury duty that day.",
   "created_utc": 1698463048,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rw93n",
   "message": "This happened three weeks ago.\n\nI had formed a group for the college lab before lab day. I formed the group personally with a boy, and then he invited a girl (detail here that I didn't know what her face looked like).\n\nLab day has arrived. The boy said he couldn't go anymore, and the girl would arrive a few minutes in time. I arrived on time. I spent a long time in the laboratory and the girl didn't show up. Until after a while I understood why she didn't show up: I was in the wrong room. And an hour had already passed.\n\nAfterwards, I found the right room. And I did the work with a girl who was alone. And I also couldn't look for the other girl I had already formed the group with before the lab because I didn't know what her face looked like. Anyway, I did it with this girl who was alone and in the end it all worked out.\n\nThen I got home and started talking to the girl whose face I didn't know, and she said that she had gone to the laboratory, that she had done the work with a boy. And I said I had done it with a girl who was alone.\n\nAt this moment, a question appeared in my head and I asked:\n\n\"What was this boy like?\"\n\nShe said he wore glasses and had lent her his pencil. And I also wore glasses and had lent the pencil to the girl who was alone. Then I realized: The girl who was alone was the girl I had formed the group with before the lab!\n\nWe ended up doing the experiment already being part of the same group without really realizing it. Especially because we didn't know each other's faces.",
   "created_utc": 1698463852,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ryx7x",
   "message": "When I was 18, I flew to Germany from Canada. I was staying in a hostel in Berlin, and met two girls from the US who were heading to Munich. They asked me to cancel my last few nights in Berlin and come with them— we were having a great time so I agreed. \n\nWe ended up in a hostel in Munich the next night, staying in a room with 2 other people. We all got chatting and it turned out the two guys were also from Canada— in fact, also from the same province as me— the same city in fact… in the end, it turned out they went to high school with my older brother. Small world.",
   "created_utc": 1698465296,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6shmr9",
   "message": "Not me but my dad. He, his sisters, and my grandparents got home from church one morning to find their old black cat had passed away on the front porch. They decided to bury him in the back yard immediately. When they opened the back door there was a little black kitten sitting there looking up at them, which of course they adopted straightaway.",
   "created_utc": 1698478120,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6r7r77",
   "message": "Maybe not the most bizarre, but one was when I moved towns and like...everytime I was behind a car the license had my first 2 initials of my name.\n\nLike I would be telling a passenger about it and boom, red light, my initials. \n\nWhen I would park, the car I parked in front, would have my initials.\n\nI happened like...a hundred times over 2 years, not just once or twice.\n\nI kind of felt I was in the Truman show.\n\nOr hallucinatory, or was when everyone was into simulation theory or glitch in the matrix stuff.......\n\n\n(Later I found out the local Dmvs had switched over to that 2 letter combo for all the new plates they issued....)\n\nAnd I never got a plate during that time....so was one of the few that DIDN'T HAVE that combo......for my plate, ironically enough....\n\nThen it switched over to another letter combo and stopped happening......",
   "created_utc": 1698452153,
   "score": 9,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rp5d1",
   "message": "When I was young watching tv with the family (early 80s), I jump up and exclaimed, ‘I’ll get it”. Started walking towards the phone and then it rang.",
   "created_utc": 1698460255,
   "score": 6,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rn3z7",
   "message": " my friend once had her nails painted, and since my mom owned a nails shop i said “i can paint my nails for free, i can bribe my mon becauses shes the owner of the shop to give you a free nail paint.” and then they asked what nail salon did my mom own? “*insert place name*” i said. appears that they got their nails painted at that same exact shop.",
   "created_utc": 1698459270,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rnnhq",
   "message": "I went to school with a girl whose mom worked at the same summer camp my dad, and even got sent home on his first day. Turns out the girl’s grandpa was also my grandpa’s scoutmaster back in the day.",
   "created_utc": 1698459531,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rr9gj",
   "message": "\n\nIn a study group where there were people from all the corners of the country studying the same course we were assigned exam centers for our upcoming exams. In my city, there were 5 to 6 exam centers available.\n In the group chat, I asked if anyone was also from my city, and a random girl replied. So I decided to reach her out privately to talk about our exam center and query related to it and it turned out that we were both assigned to the same one out of the 5 to 6 options. \nWe continued texting until the day of the exam when coincidentally, we discovered that we were in the same class out of 10 classes and it already felt like a incredible coincidence and thinking it would be even crazier if we were seated next to each other. \nTo our suprise that's exactly what happened and yes we even rechecked our roll number because it seemed crazy. This extraordinary coincidence led to us becoming study partners, and now, we've been close friends for two years, thanks to that coincidence",
   "created_utc": 1698461277,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rs7p6",
   "message": "Two stories.\n\nI met my wife in Thailand. After a few years I finally got her to the US on a visa. The first Summer she was here, she ordered some Thai seeds from another Thai person from somewhere in the US. A few months later we went to Six Flags over Texas. It's several hours from where we live. We were walking through the park and my wife said something to our son in Thai. A woman walking by heard her and said (in Thai), \"Oh, you're from Thailand?\" They began chatting and it turns out this is the person she has purchased the seeds from. Totally weird and random. \n\nAbout 20 years I began making occasional trips to Georgia to go hiking on the Appalachian Trail. It's about a 13 hour drive. At the time, I knew two people in Georgia. I had hiked around Blood Mountain, then hiked down and ran into one of the two people I knew. (Completely unrelated, but also saw a 70ish year old man hiking the trail totally naked. This happened about 45 minutes before I ran into the person I knew.)",
   "created_utc": 1698461744,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rsnss",
   "message": "Experiencing the same day a whole year apart. It was so bizarre when I realized what I was talking about and doing on the second day. Felt like I time traveled or something",
   "created_utc": 1698461964,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rusv8",
   "message": "Theme park in my town had go-karts.  I drove to *win*, baby, and I always got my kart shut down and yelled at by some guy in the operator's booth.  Dude was a migrant worker, had a pretty thick accent.  \n\nYears later I move from America to South Korea.  One night I'm out at a hookah bar in some out of the way corner of town when I strike up a conversation with some nice Irish lads sitting at the table next to me. \n\nTurns out, they'd heard of my (small) home town.  Turns out, they used to live there.  Had jobs at the theme park. \n\n. . . Operating the go-karts.",
   "created_utc": 1698463077,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rw0cb",
   "message": "In 2005 I moved in next door to a guy who turned out to be best friends with my first boyfriend. We broke up in 1973 a few towns away from where I live now. \n\nNow we’re all pals (again) and it actually worked out fine. But I still can’t get over it.\n\nETA after I read a few more comments, this same ex-BF once ran into another mutual friend of ours in Paris, totally unplanned. What weird magnetism is going on there?? We’re in Western Washington.",
   "created_utc": 1698463726,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rzcrv",
   "message": "When I was dating my husband, we were hanging out with a friend of mine. She was telling us a story about when she was a kid and was running through her house and ran into a sliding patio door and cut her arm and leg pretty badly requiring stitches. \n\nShe said she was screaming her head off for no reason other than she was scared to get the deadening shots and the stitches. So she was just screaming. She said she remembered the nurse saying to calm down it would be OK and that a little boy her age was in the area next to her and he had fallen out of a tree and broken both his arms and wasn't even crying. \n\nMy husband was suddenly like, \"OMG! That was you?!\" He fell out of a tree when he was a kid and broke both arms. He said he'd just watched Rambo and remembered how tough Rambo was and that Rambo had said something like you had to focus on something to not feel the pain. So that was what he was doing so he would be Rambo tough and not cry. Lol but this little girl next to him on the other side of the curtain thing was screaming her head off so it was hard to focus on something.",
   "created_utc": 1698465538,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rzehm",
   "message": "When I was 14, I visited D.C. for a few days with my family. The hotel we stayed at was over over a train station that happened to have an arcade. \n\nSo, I'd go down there at night a play some. \n\n\n15 years later, the business I worked at got a new GM.   After about a month of working with him, I recognized him as the attendant at that arcade and he confirmed he worked there.",
   "created_utc": 1698465565,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s45t0",
   "message": "When I was ~13, my best friend was ~11, and we liked to troll people online, especially on Runescape. We catfished Runescapers to try to get them to give us gold in the game.\n\nOne of the people we catfished was someone with the name \"pk4bjs\" or something like that. We trolled the guy hard, when he asked for pics of her, we sent random pictures from google (e.g. \"fattest butt in the world\"). It was hilarious.\n\nThen one time, after a family gathering, her \"creepy uncle\" (somewhere in his 20s) was messaging her. She asked him if he played Runescape. He said, \"Yeah, wow, do you play it too?\" She said yeah and asked for his username. He said, \"Pk4bjs. You?\"\n\nShe did not reply and stopped talking to the uncle after that. And also dumped pk4bjs.\n\nInsane.",
   "created_utc": 1698468417,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s4b61",
   "message": "A few years ago I went to a local ComicCon dressed as Bob Belcher from Bob's Burgers. All through the show, I kept getting comments that people were seeing my kids. I knew this meant three other people were dressed as the Belcher kids, which was rad, but I didn't run into them at all.\n\nLater on, I hosted a karaoke event and three women walked in. One of them, immediately seeing my costume, comes up to my DJ booth and says, \"Hey, cool costume, we were dressed as Tina, Gene, and Louise, but we had to take off our costumes before coming because they were a bit difficult to wear\". She showed me a picture, and sure enough the three women there were dressed like the Belcher kids. Apparently people were telling them that I was walking around the floor and they were actively looking for me but we just kept near missing. It was wild.",
   "created_utc": 1698468514,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6sapiu",
   "message": "I have an INCREDIBLY unique first name (never met anyone else with the same spelling).\n\nMy family and I have an ongoing joke about Mexican squash/calabacitas because I introduced it to them and they had no idea what it was.\n\nI have deep ties to the navy and submarines.\n\nThen…..\n\nLast year, My brother found a mug at the goodwill, printed on it is a Mexican squash made to look like a submarine, with a thought bubble coming out of the submarine snorkel that says my name, exact spelling. \n\nHe gave it to me for Christmas last year, and it was the best present I’ve ever received!! I’ll forever wonder what the backstory of that mug is.",
   "created_utc": 1698472951,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6scc67",
   "message": "I call school and school was calling me at the same time. Phone didn’t ring on either side.",
   "created_utc": 1698474163,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6se2zq",
   "message": "Me and my fiance have this crazy connection to the point that we are borderline telepathic at times. I know there's such a thing as coincidence but there's just things I can't explain like, \n\n The time we both got out of the car, looked at each other and at the same time said \"I'm having Deja Vu\".\n\nMe thinking of a song (not one currently playing) and singing it in my head and then my fiance starts singing it out loud. \n\nSaying the same thing at the same exact time in a funny specific tone.\n\nEven the other day I was laying in bed thinking about how a hot dog would hit the spot and then he says \"You know what I'm craving to eat tonight?\" I said \"Hot dogs?\" He looked at me with this crazy expression like how did I know as it's something we RARELY eat but somehow we were both craving it at the same time. \n\nThese are just some that come to mind.",
   "created_utc": 1698475469,
   "score": 3,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rfv9z",
   "message": "My friends and I were on the college paper. Some of our stories ran with our bylines and photos.\n\nAt the end of that semester, four of us decided to take a trip through Europe together.\n\nOne night, like at 2 am in some podunk train station in Italy, while we were waiting for a transfer, we were approached by a group of American girls.\n\n\"Hey, do you all write for \\[University Newspaper\\]?\" they asked.\n\n\"We do,\" my friend said.\n\n\"Cool, we go to \\[University\\], too.\"\n\n\"Nice,\" we said.\n\nThen we went our separate ways.",
   "created_utc": 1698455857,
   "score": 5,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rrt2y",
   "message": "Boarding a DC-10 to fly to Hawaii. As we got to the boarding door, looked out the window at the left engine and said to my buddy \"It is incredible that small pylon holds the engine on.\"\\*\n\nLanded in Honolulu to the news that a DC-10 had crashed, killing 271. Later it was determined that the left engine had fallen off the left pylon.\n\nStill blows my mind to this day.\n\n\\*I'm an airplane guy from early childhood. I've never questioned the reliability of an airframe - before or since.",
   "created_utc": 1698461542,
   "score": 5,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rqzvt",
   "message": "I grew up in Australia. While at university I met a visiting Canadian grad student. A few years later I moved to western Canada, and there I dated a girl who had just moved out from eastern Canada. It turned out her ex back there was that Canadian guy I met in Australia.",
   "created_utc": 1698461144,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rtb2m",
   "message": "I have a very uncommon last name (I have never met anyone I wasn’t related to with it).\n\nA woman with both the same first and last name as me not only lives in the same state (which we both moved to following graduation from schools in other places) and works in the same general field, but has additional credentials which have the same acronym as mine, although they stand for different specialties. Due to the nature of our work we each sign documents with our credentials included, making them virtually identical. \n\nDifferent e-signature codes solve this problem for the most part, but it does lead to the odd message every now and then from someone who mixes us up.",
   "created_utc": 1698462293,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ruh1w",
   "message": "My dad was at a cottage in his 20s and was run over by a motor boat. One of the friends he was staying with sewed up the cuts the propeller made. (They were all doctors and nurses.)\n\nMy now husband’s very good friend, who was the best man at our wedding, had a mom who was a doctor. His mom was the same person who sewed up my dad about 30 years or so before. We figured this out the first time my husband and dad met and were chatting. My husband and I grew up in totally different cities and didn’t meet until after university.",
   "created_utc": 1698462904,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ruugc",
   "message": "When I was an undergrad at a large Midwestern university,  a student organization I belonged to, took a visiting prof out to dinner.  His behavior was so bizarre that I hoped I'd never have to work with anyone like that. Because the restaurant was dark and noisy I didn't catch his name, or the name of his institution. \n\nAbout eight years later, I started out in a grad program at a  university in the Rocky Mountain region. The first day i was told to go meet my advisor.\n\nIt was him.",
   "created_utc": 1698463101,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rwgex",
   "message": "My stepfather had close genealogical links to my late biological father. Both of their mothers' family's partly hailed from the UK and Germany. Over a few hundred years, they wound up in Pennsylvania as Pennsilfaanisch Deitsche (there was a marriage between his and my father's ancestor over 100 years ago), went to New York, then up to settle southern Ontario, Canada, off to Manitoba and then finally out to western Canada. They had also once worked in the same workplace before I was born. 23andme shows distant genetic links as well. Too cool!",
   "created_utc": 1698463961,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rwm34",
   "message": "My wife and I lived in Nevada. On a whim we decided to move to Iowa. Found a house we liked on line and on a decided to take a trip to see it in person. Neither of us had ever been to Iowa and knew no one there. While we were touring the house with the realtor the doorbell rang. I thought I'd be funny and went to answer it and pretend I lived there. It was a guy trying to sell cable service, but wait..I knew him. He was a pretty good friend I had met years ago when I lived in Colorado but I thought he now lived in Nebraska. We hadn't talked in about 6 months but kept up with each other on social media. Neither of us could believe what was happening. Turns out his company covered parts of Iowa and he was randomly going to houses that didn't have his service. Just the odds of everything were incredible. The chances of me just opening that door were high. Then the chances of it being someone I know were off the charts. Then deciding to prank the person and pretend I lived there and it turns out to be a fairly close friend, he had to be freaking out more than me. My brain was so overloaded that my first thought was \" wow, they got my friend Tim to play the cable guy\", and not even like it was a set-up, it was like I was actually thinking the universe was using the same actors for different things.",
   "created_utc": 1698464044,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ry04t",
   "message": "When I moved into my first apartment, two of my 3 roommates and I had the same name. Not only that, but I shared a middle name with one and a birthday with the other. \n\nThe three of us had no prior connections and were all new to the apartment. The one that didn’t have the same name as us was the one who found us on fb marketplace.",
   "created_utc": 1698464792,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s0c6e",
   "message": "My sister and I drove to visit our older sister at college. We stopped at a cvs to pick up snacks, and heard a couple men talking in the next car. My sister said, “I’ll bet they’re from Ghana” based on their accent. We talk with them and when we finally told them our names, they said, “Oh, are you Bob ____’s daughters?” Half a world away, 10 years after my parents were in the peace corps with 5 little kids in tow, in the parking lot of a CVS!",
   "created_utc": 1698466106,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s8h4v",
   "message": "I've posted this story in a thread just like this and was told I wasn't believed cause it was too coincidental.\n\nI dated a man from when I was 19-24. When I was 26 I moved into a bigger house and got a random roommate from Craigslist. When she came to see the house she brought someone. While she was looking around her friend and I chatted. He currently lived in the same complex id just moved from that was 20+ miles away. Coincidence 1. \n\nShe never once spent the night at the house, which I found strange, but whatever. She's a grown ass woman.\n\nI had a friend coming in from out of town and text my roommate to remind her since I wasn't home when she got in and I gave her access to the house. In that convo roommate told me she was going to have a guy over for the night.\n\nThere was no street parking in my neighborhood. We'd have 4 cars there, so my friend, roommate and her guest all worked to clear space in the garage so 2 could park in the garage and 2 could park on the driveway. Apparently they were all getting along well and chatting, which all completely changed when they came in the house. I guess the guy got weird and left.\n\nWell, it was my ex. He saw the dog, who had a weird name he'd given him! I guess he asked roomie what the dog's name was, and then asked again what my name was, and then about 3 min later said he had to go. My friend told me all about this when I got home. I started asking questions and realized who it was. The roommate had left too. \n\nRoommate had a month to month lease with me. I planned to stick w her as a roommate since neither of us did this on purpose! But then we started sharing stories and realized we dated him at the same time. Again, not our faults, but then she got a little shitty w me. She got that snotty look on her face and said, \"wait, was your car blue?\" I said yes and she said \"it drove really nice\". I wasn't going to say anything, but I'm also not gonna let her be like that. So I said \"so, did you give him the HPV he gave me? Or did he get it from someone else?\" He had attempted to reach out to me 2 weeks beforehand. I said \"aww, he was going down his contacts. I was first, but not dumb enough to let him back in to my life, unlike you\". I also told her that she'd need to leave.\n\nShe moved out that weekend and I've never talked to either of them since. She stole a brand new router I'd just bought on her way out, too.\n\nTL;DR: random roommate from Craigslist happens to bring my ex over. Had to kick her out.",
   "created_utc": 1698471354,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s9paj",
   "message": "I live in a different state than most of my family. I work in the medical field. I had a patient I have been caring for awhile with a chronic disease who decided to make an Instagram page following her journey. I went to look at the page while in a visit with her and noticed one of my second cousins followed it which was very odd as it had a small following. I mentioned this to her and she goes on to tell me her dad is dating my cousins mom (my great aunt). Turned out they were actually in town visiting and so she called them and they came by the office and I got to see my great aunt whom I had not seen in over five years. They are still together and it still blows my mind. We are several states apart. Keeping vague for HIPPA reasons.",
   "created_utc": 1698472233,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s9wqi",
   "message": "On the road coming back from months of work abroad, in the last city I stopped (which was 3 hours away from home) I took the subway to the bus station. When the doors opened, my roommate was standing right in front of me, ready to embark. He had decided to travel abroad for work too.\n\nHad I chosen another any other door, we never would have seen each other.",
   "created_utc": 1698472378,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6sb3v1",
   "message": "I have one of those 23\u0026amp;me stories except it was on GEDmatch which now that I think of it sounds like a dating service for the not-college-bound. \n\nAnyway I got an email saying “omg you’re my dad !” Whelp I’ve got a 26 year old kid!! Wait .. I was 40 at the time. Ok …. I don’t have a kid. But the genetics don’t lie. After a solid hour of panicking I remembered that i had uploaded an uncles DNA. So my uncle has a kid!!! So that was crazy …. But that’s not the coincidence. A month later I get another “omg you’re my dad” email. At first I was like hey you already told me. But it was a different email. It was another kid of my uncle !!! Like jfc dude save some for the rest of us. It turns out he was in a band and really good looking back in the day.",
   "created_utc": 1698473247,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6sdnk3",
   "message": "Was in Croatia summer of 2019, took a boat to a small island off of Dubrovnik and was walking around when I hear someone yell my first name, I don’t respond because I assume it’s not for me, then they yell my full name. It was an old best friend I had last touch with and hadn’t seen in 7 years; he was my first boyfriend too (in 4th grade, super serious) Blew my mind",
   "created_utc": 1698475151,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6seh8g",
   "message": "I live in a decent size city and had had two long term relationships to date. We were leaving new years eve fireworks downtown so it was packed. My then boyfriend collided with someone and when I looked up it was my ex whom I had never seen in all the years since we broke up. They apologized to each other and shook hands as I stood there gobsmacked and didn't say a word. Felt like the twilight zone. What the chances of that!",
   "created_utc": 1698475767,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6sfraf",
   "message": "When I was younger I bought the book Scribbleboy from the book fair at school. Loved it, read it loads of times. Not sure what happened to it.\n\nLast year I randomly remembered it and bought a copy off of ebay, opened it up and there was my name written in the corner of the front cover in my 11 year old handwriting.",
   "created_utc": 1698476726,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ra26m",
   "message": "It's probably feeding my delusion more than necessary, but I met my current situationship on a hookup app, and we've hung out a handful of times, but on the most recent one, the topic of birthdays came up, and lo and fucking behold, we have the same exact literal birthday.\n\nThen I was like hmmm because he was born in Asia, and I was born in California, but even with the time difference, we're still technically born on the same day.\n\nWe pulled out licenses to confirm lol.  IF YOU SEE THIS PLEASE MANIFEST FOR ME SO OUR SITUATIONSHIP CAN BECOME MORE.  K thanks.\n\n\\- #1 resident of Delululand.",
   "created_utc": 1698453185,
   "score": 8,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ru150",
   "message": " We hadn't seen each other in years.",
   "created_utc": 1698462669,
   "score": 7,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6qudx1",
   "message": "One night, I was at my companies open house. Talking with people, Yada Yada.\n\nThis college kid stuck around afterwards. Thru clean up.\n\nThen joined us at the diner we went to.\n\nWeird but whatever.\n\nNext morning my friend and I drive from MA down to NYC to see a Broadway show.\n\nWe're in Manhattan walking around, Im about to cross a street, and there's the kid. He's with his parents. \n\nThey're going to the st Patrick's day parade. \n\nOmg. I hate everything.",
   "created_utc": 1698446170,
   "score": 4,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6roqg0",
   "message": "When I was around 19, I went to a dance and went out to my car and some drunken guy was sitting on it and pretending was his, he being a super creep and I luckily some passerby's came by and I asked them if they could help me get rid of him.  Later when I got to my house, he was sitting on the fence of my next door neighbours house.  He saw me and came running to my car and started hitting it and I ran into my house and woke my boyfriend up and he chased him around the neighbourhood.  Someone called the police due to the commotion and it turns out he was the brother of my neighbour visiting from out of town. Totally random coincidence and I live in a city, not a small town",
   "created_utc": 1698460051,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rosd8",
   "message": "Dreaming about someone you haven't seen in years and then randomly seeing them the next day.\n\nWatch me continue to be delulu everytime I have a good dream because I think it may just happen in real life.",
   "created_utc": 1698460077,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rpb8v",
   "message": "met a friend at work. she came over and was sitting in my kitchen. my brother comes in. she looks at him and asks “who are you? what is you name?” i thought he had done something to piss her off. no. they’re cousins. i dont know the specifics but they are related",
   "created_utc": 1698460333,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rrflh",
   "message": "Dropped my keys at night in a grassy area, went back and found them within a minute",
   "created_utc": 1698461360,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rsa6j",
   "message": "Saving two babies from choking on a bottle cap a few weeks apart",
   "created_utc": 1698461778,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rv34b",
   "message": "My daughter was born on the same day as my best friends that are twins.\n16 years later, one of my best friends had her baby boy on my birthday!!! What are the odds??",
   "created_utc": 1698463230,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s5jtk",
   "message": "When I was 11 years old I was in a ballet recital that had a jack in the box jump out at the end. It was a little 5 year old boy that never went to my classes or rehearsals and just did 1 time for the performance. He kinda stumbled back, I caught him and helped him up.\n\n17 years later I am watching my husband's childhood movies with his parents. They start showing a ballet recital from the audience perspective. I hear familiar music, I see little girl friends of mine in familiar costume and then I see myself! We watch the whole performance and me catching the little boy jumping out of the box at the end.\n\nWe are from the same small town but never met growing up, except that one performance on stage : )\n\nWe later \"met\" as adults in junior college in our 20's in a big town far away.",
   "created_utc": 1698469330,
   "score": 2,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6ryawo",
   "message": "Bought a used car, a few years old. Moved for work about 6 hrs away. While in the new place I needed an oil change so I decided to stop by the local jiffy lube. Tech asked if my car had been there before. I said no. He corrected me, and said that it in fact had been to that location a year prior, a couple months before I purchased the vehicle.",
   "created_utc": 1698464959,
   "score": 1,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rx6na",
   "message": "My brother had twins, I had twins, I'm adopted. We both have zero twins in our bloodlines. My adoptive mother has 2 sons that have twins but are biologically unrelated.",
   "created_utc": 1698464350,
   "score": 1,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rn6rk",
   "message": "I have so many non life changing ones everyday.",
   "created_utc": 1698459306,
   "score": 0,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6rwyx8",
   "message": "Ran into a college acquaintance randomly at a visitor center in the middle of very remote Skagway, AK.",
   "created_utc": 1698464235,
   "score": 0,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s0bqu",
   "message": "Happened to my friend, but here goes: She lost her teen daughter suddenly, and when her other daughter was pregnant, she wanted to name the baby after her dear sister. However, the baby turned out to be a boy. My friend said, no problem, just name him the male version of that name (the male version is very uncommon but nice.) The pg daughter had not heard it before, and my friend told her, \"I went all through elementary school with a nice boy named that.\"\n\nThis was across the country from where she grew up and attended elementary school with the boy. A few years later, he saw her on Facebook and, both divorced for several years prior, they ended up reconnecting, falling in love and getting married. So her husband, whose first wife was unable to have children, wound up being the grandfather of a baby boy named after him before he even knew his grandson existed!",
   "created_utc": 1698466099,
   "score": 0,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s1a40",
   "message": "I started a new job and found out the girls who was training me had the same name and that i was named after my mum’s best friend,,who happened to be her mum.",
   "created_utc": 1698466653,
   "score": 0,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6s1kej",
   "message": "Wife and I were born *only a couple of days apart -- in the same year AND in the same hospital.*  Also moved to nearby cities during the course of our lives more than a few times. Eventually met in our 30s.  True, soulful love.",
   "created_utc": 1698466823,
   "score": 0,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6runy4",
   "message": "Life",
   "created_utc": 1698463004,
   "score": 254,
   "submission_id": "17hyk8d"
  },
  {
   "comment_id": "k6tbjmm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17hyk8d"
  }
 ]
}