{
 "submission_id": "17i435c",
 "title": "What’s the sluttiest thing you’ve done?",
 "selftext": "",
 "created_utc": 1698460435,
 "permalink": "/r/AskReddit/comments/17i435c/whats_the_sluttiest_thing_youve_done/",
 "score": 22,
 "url": "https://www.reddit.com/r/AskReddit/comments/17i435c/whats_the_sluttiest_thing_youve_done/",
 "comments": [
  {
   "comment_id": "k6s79pq",
   "message": "Not me, but a woman I dated. She was a graphic novel artist. A few days after we had sex the first time, she sent me a five page comic she’d drawn that detailed everything we did that night. And I mean everything!",
   "created_utc": 1698470507,
   "score": 248,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6ruma5",
   "message": "Met up with my husband a few times on his work route and had sex in the back of my car. \n\nThe first year my husband and I were married, he stocked for Pepsi. He worked 7am-7pm, I worked 7pm-7am, we had one day off together every three weeks. He texted me one morning saying he was horny, he kept texting me about it.. so of course I was now horny. Our next day off together was two weeks out. So.. I met up with him at one stop, parked as out of sight as possible and we climbed into the back of my Explorer. Then.. did it again a few hours later and again, an hour after that.",
   "created_utc": 1698462980,
   "score": 61,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s8hre",
   "message": "Had sex with my best friend in school washroom. \n\nWe were just friends, i dont know what happened. I just kinda flirted with her, she responded well. Then made a sexual joke on her, she respomded well and even made a sexual comment on me. On3 thing led to another and we ended up kissing. We then went to a washroom (which was almosy always empty) and had sex. We were sweating like crazy and the washroom was stinky as fuck but the sex was super hot. It was the best sex i had till date. \n\nBut out friendship got ruined. It was never really the same after that. And now we rarely speak.",
   "created_utc": 1698471366,
   "score": 46,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6san5v",
   "message": "Used to fuck my manager every time we closed the store together at an outlet I used to work at.",
   "created_utc": 1698472903,
   "score": 27,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s7554",
   "message": "Disclaimer: remember all these people posting are at least 4x uglier than you are picturing in your head.",
   "created_utc": 1698470422,
   "score": 140,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s3q44",
   "message": "Use to fuck my coworker during lunch/break at my first job. She was in her mid 30’s cheating on her incarcerated husband I 18 was fresh outta hs …",
   "created_utc": 1698468136,
   "score": 222,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rq6tx",
   "message": "Ate half of a tub of ice cream in one sitting",
   "created_utc": 1698460759,
   "score": 36,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rpveo",
   "message": "MFM threesome, had 2 cocks in me at once and it was quite the experience",
   "created_utc": 1698460609,
   "score": 36,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6scilc",
   "message": "I (f) had a \"rotation\" in my early 20s. 2 casual work FWB, enter a 3rd coworker rebounding from a recent breakup, and then an old highschool flame that lived an hour away but would come back to town regularly to do laundry at his parents or whatever. Between all of them I was getting laid at least every other day. \n\nEnter drama: coworker #1 says we should grab lunch one day (instead of going to my place on our break like normal) and tells me there's a \"bit of an epidemic\" going around work. Coworker #1 I knew was sleeping with at least two other female coworkers besides me. Coworker #2 I knew was sleeping with at least two other coworkers besides me.... Yea apparently half of the restaurant had Chlamydia and when I went to the free clinic I definitely had it too. \n\nRestaurant life is wild sometimes",
   "created_utc": 1698474295,
   "score": 121,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s14xk",
   "message": "Went to a bar with a high school friend when I passed through my hometown.  Got piss drunk and picked up a (smoking hot) nurse.\n\nFucked like rabbits all night.  She and I wrapped around each other like pretzels butt naked.  Woke up in the morning, on my buddy's sofa with her, and I didn't even know her name.\n\nMy buddy was married and thought it was fucking awesome.  His wife was pissed that he allowed it to happen.  He got divorced shortly after.\n\nStill don't know what her name was.",
   "created_utc": 1698466568,
   "score": 86,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s1j6c",
   "message": "Geez. Reading the comments makes me feel virgin lol",
   "created_utc": 1698466803,
   "score": 45,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rqmhr",
   "message": "Her name was Madison.",
   "created_utc": 1698460967,
   "score": 100,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rse35",
   "message": "I had sex with 3 girls in under 12 hours, although 2 of the 3 were at the same time. Ate all their butts",
   "created_utc": 1698461833,
   "score": 109,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s5yto",
   "message": "i had positioned my vagina to the water flowing in the tub, i came to the flow while listening to my favourite song.\n\ni still chase that high.\n\nps the song is Keep Me High - Adaline.",
   "created_utc": 1698469612,
   "score": 148,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rs6uo",
   "message": "She wanted to be the dominant one for once. We established the safe word and we both had a great time.",
   "created_utc": 1698461733,
   "score": 228,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6scfvx",
   "message": "[deleted]",
   "created_utc": 1698474239,
   "score": 118,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s9vr4",
   "message": "Act as a beard for a lesbian to help her deal with some very uptight parents. Sent some nudes to her so she could \"accidently\" get some gossip started by her sister.  Gave her a t shirt and a pair of boxers. \n\nThey were some chill friends. I would do it again. Was slooty for a purpose!",
   "created_utc": 1698472359,
   "score": 68,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s9pc5",
   "message": "Had sex with a girl on the dance floor during a warehouse rave.  Absolutely no one paid attention.",
   "created_utc": 1698472233,
   "score": 188,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rpq1r",
   "message": "Made eye contact once they were the opposite gender and everything.",
   "created_utc": 1698460536,
   "score": 5,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s7te5",
   "message": "Slept for 13 hours straight",
   "created_utc": 1698470888,
   "score": 114,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s4dpc",
   "message": "Let my girlfriend put an 8 inch dildo up my ass.",
   "created_utc": 1698468559,
   "score": 64,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6syana",
   "message": "In highschool early 2000s I came out as gay. At that time I was the only 'out' gay guy at school. Some guys didn't believe I was gay and asked me to proof it by giving them a blowjob. I did and they enjoyed it. After a while they wanted it again and I asked them to give me 10 euro for it. I spend the last two years of high school sucking off many guys for 10 euros each.",
   "created_utc": 1698490506,
   "score": 148,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rxo5d",
   "message": "FFM threesome and had sex at a sex club. I’d do both again",
   "created_utc": 1698464611,
   "score": 160,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6saoxu",
   "message": "I broke into Tiffany's at midnight. Do I go for the vault? No, I go for the chandelier. It's priceless. \n\nAs I'm taking it down, a woman catches me. She tells me to stop. It's her father's business. She's Tiffany. I say no. We make love all night.",
   "created_utc": 1698472940,
   "score": 65,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6scvsi",
   "message": "Cheated on cheating gf, then banged gf, then banged her mom, over like 76 hours. I went for deranged and fulfilled. Grandmas were already dead, or I'd have kept going.",
   "created_utc": 1698474578,
   "score": 212,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6sjdw6",
   "message": "I had thus pair of brothers that used to string me along all the time. I was only good enough for them at house parties, in the dark and away from people. I'm ashamed to say I was in love with both but I highly doubt they knew I would kiss them both at parties. \n\nCome one night, one took me to the park and he pushed my head down so I blew him, swallowed and I went off hoping he'd fall in love with me. \n\nThen his brother came and just pulled me somewhere and shoved his tongue down my throat. I was so sick of them just using me at this point I pushed him away and said 'so how does your brother taste'.\n\nThe end.",
   "created_utc": 1698479430,
   "score": 184,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rv0pw",
   "message": "Sucked 3 cocks at a party,  made out with the host's dad, left,  fucked a different guy,  and then the next day slept with another dude.",
   "created_utc": 1698463195,
   "score": 148,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6siws1",
   "message": "Was at a bar NYE, met a gal that was way out of my league, an Ex of mine was there and saw us lol. I took her home, hooked up, she spent the night and I found out she was a flight attendant and had a flight in a few hours. She talked me into booking a ticket on her flight to LAX (The only time I turned down a free upgrade). \n\nShe slipped me a bunch of snacks and booze and the woman next to me was all “I think she’s flirting with you”\nAnyway when we got there we went out with a couple others from the flight crew, found out I was flying back with another gal from the group, spent the night with the gal I came out with. And flew back the next day.\nI spent the flight back flirting a bit, found out it was her first time staying in PHL so I showed her around and we hooked up.\n\nMy ex was also jealous, so she texted me and we hooked up after I got back. \n\nSomehow I lucked into hookups with 3 women with one trip to a bar. This was one of two times in my life going to a bar got me laid lol",
   "created_utc": 1698479077,
   "score": 92,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rt1t4",
   "message": "Masturbating with my left hand.\n\nI'm right handed.",
   "created_utc": 1698462161,
   "score": 203,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6ryzyy",
   "message": "I am from Hong Kong.\n\nI was always a bit dodgy and did anything for a buck.\n\nWell, us international school kids loved america so we have a prom but we had a UK system. So our big exams happen 15/16 and 17/18. We had a \"prom\" at both but both were new.\n\nSo I found a way to make bank. I had an older brother with a credit card. I booked a bunch of rooms in hotel next to prom. I over charged everyone. I only took cash. Back then there was no other option.\n\nI got about 200 people in.\n\nI had an unbelievable amount of cash on me.\n\nAt this time in HK, at these types of hotel there are hookers every were. I was used to rejecting them even at 15. I was catholic. Sex was sin to me.\n\nAfter prom we go out to the bars. Some older kids saw me. Brought me a round of shots. I was fucked but I am a big chap, no one thinks I am off my tits. We go back to the hotel.\n\nOne of friends needs to be sent home. His girlfriend, still a dear friend, asks me to put in a taxi.\n\nI do.\n\nA couple of street walkers ask me if I was interested. I laugh and continue to walk to the hotel.\n\nStop by 7/11 and have two hotdogs.\n\nThen my drunk ass thinks. \"My socks and wallet are exploding with money and no one will know\".\n\nI sprint after those whores. They want a hotel room. I filled them all up. We go to basketball court I played at all the time. I got a blowjob from both them in a public toilet.\n\nI thought the world would open and hell would take me.\n\nWhen I got home my mother was excited about my prom \"Tell me a blow by blow account\".\n\nShe fucking knows!\n\nI slept in my parents room for a week.",
   "created_utc": 1698465338,
   "score": 225,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s7730",
   "message": "I don’t want to brag, but I did once hold a woman’s hand for a full five minutes. Bare skin and all.",
   "created_utc": 1698470458,
   "score": 239,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s23bs",
   "message": "Lol there's a lot of made up stories up in here.",
   "created_utc": 1698467136,
   "score": 205,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s3s1b",
   "message": "I had the sex with my friends wife while he watched. He doesn't talk to me anymore 😭",
   "created_utc": 1698468170,
   "score": 250,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s81ho",
   "message": "I banged the guy my friend had a crush on because she called me “manly”. He didn’t think so, lol.",
   "created_utc": 1698471049,
   "score": 116,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s89dt",
   "message": "A man 30 years my senior tied my hands behind my back and put me in the doggy position. I twerked the cum out of his dick.",
   "created_utc": 1698471205,
   "score": 232,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s3qji",
   "message": "I’m male and my female cat stared at me while I showered, so I stared back",
   "created_utc": 1698468144,
   "score": 49,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rua1p",
   "message": "Washed my ass with soap in the shower",
   "created_utc": 1698462800,
   "score": 26,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6sb3mn",
   "message": "A girl I met online wanted to be my “sex Elijah.” I’d greet her at the door, naked with a glass of water, and we’d get to it without saying a word.\n\nIn the moment it was too awkward not to speak a little bit, but it was a lot of fun.",
   "created_utc": 1698473242,
   "score": 57,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s1wvg",
   "message": "I've not led a exciting life lol sluttiest was sex in public",
   "created_utc": 1698467026,
   "score": 38,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s1xm6",
   "message": "Let myself get picked up by a guy at a language exchange event (Mundo Lingo). We had a few drinks, then he walked me back to his flat, did sexy things in the shower, fucked, and stayed the night.\n\nHe left early the next morning, leaving me there at his flat not knowing any of his flatmates, so I quietly got dressed, couldn't find one of my socks, sneaked out of the flat, then did the walk of shame all the way back into town and took the train home, missing one sock on one foot. Then after a really quick shower, I got back on the train out to town to get to work, now with two socks.\n\nMay sound relatively normal, but I spent a lot of that time evaluating my life choices.\n\nI'm a dude btw.",
   "created_utc": 1698467039,
   "score": 240,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6sao3v",
   "message": "I was in college, went to a party and met a hot redhead. Finger blasted her on her period and she wouldn’t ket me fuck her for some reason. Then I banged her friend 20 minutes later, then the redhead let me fuck her after she found out I fucked her friend.\n\nEdit: I made this story up",
   "created_utc": 1698472923,
   "score": 220,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s8ilb",
   "message": "Had sex with a guy that would kick me out of his apartment after having sex with me… he did that like 3 times before I gained some self love and told him to go fuck himself.",
   "created_utc": 1698471382,
   "score": 117,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rsfyk",
   "message": "Orgy in a gay sauna.  It was a towel-free theme night with all cubicle doors left open, so lots of voyeurism and group sex.",
   "created_utc": 1698461858,
   "score": 221,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rrnai",
   "message": "That 5 firth slice of pizza...sometimes I just can't resist even if full.",
   "created_utc": 1698461463,
   "score": 188,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s76p1",
   "message": "Fucked 2 sisters in the same bed on the same day without either of them knowing about the other.",
   "created_utc": 1698470450,
   "score": 99,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rsevf",
   "message": "Showered naked",
   "created_utc": 1698461844,
   "score": 165,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s9y2o",
   "message": "Was out bar hopping with this guy I liked and our friends when my old high school crush whom texted me that he was in the same area partying. \n\nI left the group to use the ‘bathroom’ and went around the corner and fucked high school crush guy in his car on the side of the bar he was at. Said see you later and went back to the first group. \nEnded up with the first guy for 8 years. \nTerrible and toxic relationship to say the least.",
   "created_utc": 1698472404,
   "score": 33,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rxdo6",
   "message": "The closest I got was letting a guy watch as my bf fucked me\n\nBut I was so nervous I kept drinking and I got wayyyyy too drunk and passed out so it never happened.\n\nI wish I had gone through with it ):",
   "created_utc": 1698464453,
   "score": 71,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s5c1x",
   "message": "Was doing a gig with a fellow muso and we met Doris there, and we were all drunk, and we went back to his place and we got wild with Doris, spit roasting and more, and at some stage and in some outrageous porno position he said \"(my name), your balls are on my leg.\"",
   "created_utc": 1698469187,
   "score": 17,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rq2wy",
   "message": "Slept with four or five guys in one week",
   "created_utc": 1698460707,
   "score": 17,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6sfjm9",
   "message": "I used to work in the produce department of a grocery store. My girlfriend at the time would sometimes visit me at work. The boss wasn't working that day, so we went into the cooler and fucked on top of the vegetables that we sell to customers.\n\nYep, straight out of the movie Ted, but it really happened. And yes, I was considerate enough to cum in her mouth instead of the on produce.\n\n**Edit: And for those who might ask, YES I came while she sucked my dick, and YES she kept sucking. It was the most sanitary disposal of semen that could've happened if you think about it.**",
   "created_utc": 1698476567,
   "score": 78,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6sd9gp",
   "message": "Tax evasion",
   "created_utc": 1698474863,
   "score": 70,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s3270",
   "message": "Fucked my then girlfriend in a hotel room while her best friend listened in the other bed 3 feet away (she was super tired and couldn’t keep her eyes open) and got herself off twice to us.",
   "created_utc": 1698467726,
   "score": 56,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6satao",
   "message": "Had a foursome with the 3 guys who lived in the apartment below me while the 4th watched and jacked off.",
   "created_utc": 1698473030,
   "score": 14,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6sindo",
   "message": "Accidentally made eye contact with a coworker while eating a banana.",
   "created_utc": 1698478881,
   "score": 25,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6sne5x",
   "message": "Held a house party in the small village I lived in in Wiltshire (UK) back in the late 90's. I was seeing a nurse at the time and she came over on the morning of the party, to let me know that she couldn't make it and she felt the relationship wasn't right for her (she was coming out of a bad divorce) but she gave me a farewell bang, so it wasn't all bad news...\n\nA few hours later I got a text of one of her friends saying she was sorry to hear the news and she's around if I wanted a shoulder to cry on, told her I was doing a beer run into town to collect some booze and 'stuff' for the party and if she's in, we can have a quick coffee... long story short, shag No.2 down the range.\n\nHeaded back to the village stocked up with beer and party food and was unloading the car when my boss' daughter drove past, (he lived around the corner from me) pulled in and helped me unload, she ended staying a few hours as the party got going, we'd had a bit of previous history, so inevitably shag No.3 occurred once the mood relaxed.\n\nSo party kicks off, it's now about 11pm, shag No.3 left the party as she had an early start next day, and I was feeling pretty fucking tired and I needed to freshen up, so I went upstairs and threw myself quickly in the shower, yeah... one of the bored wives from the village decided she needed some spice so offered to dry me off, and there was shag No.4.\n\nI look back on it with fondness, but deep down, I knew I was a proper slag.",
   "created_utc": 1698482504,
   "score": 25,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6rtbrh",
   "message": "Met up with 3 random strangers and we all decided to go down with each other to the first floor.",
   "created_utc": 1698462304,
   "score": 102,
   "submission_id": "17i435c"
  },
  {
   "comment_id": "k6s7ipw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17i435c"
  }
 ]
}