{
 "submission_id": "17ijimm",
 "title": "What are the things that you secretly judge people for?",
 "selftext": "",
 "created_utc": 1698516720,
 "permalink": "/r/AskReddit/comments/17ijimm/what_are_the_things_that_you_secretly_judge/",
 "score": 210,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ijimm/what_are_the_things_that_you_secretly_judge/",
 "comments": [
  {
   "comment_id": "k6v835b",
   "message": "I love coming on here and judging other people’s judgments",
   "created_utc": 1698524823,
   "score": 244,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6ur7iq",
   "message": "I judge people for their lack of use of their vehicle’s turn signal.",
   "created_utc": 1698517970,
   "score": 109,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v9j54",
   "message": "People who don't cover their nose/mouth or redirect when they sneeze.",
   "created_utc": 1698525402,
   "score": 224,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6utv71",
   "message": "People who use speaker phone for music or conversations in public places. I hate it.",
   "created_utc": 1698519049,
   "score": 75,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v1nvv",
   "message": "Not taking good care of their children or being there for them",
   "created_utc": 1698522259,
   "score": 138,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6ut8vv",
   "message": "Lack of manners.",
   "created_utc": 1698518795,
   "score": 115,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v3buu",
   "message": "People with no self-awareness. For example, when someone watch video with high volume in public or when they suddenly stop walking, blocking the path for other people..",
   "created_utc": 1698522917,
   "score": 85,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v14na",
   "message": "Imo you can tell everything you need to know about a person by how they leave a public space after using it.",
   "created_utc": 1698522042,
   "score": 7,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v05f8",
   "message": "Kids’ names",
   "created_utc": 1698521647,
   "score": 93,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uxjtb",
   "message": "Being a part of an MLM",
   "created_utc": 1698520567,
   "score": 181,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6utqhp",
   "message": "What part of their life are they posting on social media.",
   "created_utc": 1698518996,
   "score": 12,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v6mcq",
   "message": "How they treat people that are working \n(waitresses, baristas, cashiers ecc…)",
   "created_utc": 1698524235,
   "score": 89,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v9rr0",
   "message": "Littering and not secretly either.",
   "created_utc": 1698525497,
   "score": 219,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vbtrq",
   "message": "When people barge in while I'm trying to walk out of the elevator.",
   "created_utc": 1698526314,
   "score": 159,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vj0y5",
   "message": "Having their dogs off leash in public places… my mom was attacked by a pit bull that was off leash",
   "created_utc": 1698529232,
   "score": 142,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w5m2e",
   "message": "Their bullshit ass blinding LED headlights at night",
   "created_utc": 1698539121,
   "score": 3,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vaaur",
   "message": "Letting their kids run around screaming and terrorizing stores, restaurants, or any other public place really",
   "created_utc": 1698525707,
   "score": 81,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vj34l",
   "message": "Before I say this, let me preface it with: I'm disabled myself. I'm in a wheelchair part-time due to my autoimmune condition. \n\nIf you leave your shopping cart in or halfway in the parking spot, you deserve a slap upside the head. If I can put my cart away while confined to my wheelchair, so can you. \n\nSigned,\n\nI'm with cart narcs on this one.",
   "created_utc": 1698529258,
   "score": 119,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6us0ky",
   "message": "How they treat people with higher social status compared to the average person",
   "created_utc": 1698518297,
   "score": 61,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v9o0o",
   "message": "Those who take photos of others in public....I'm judging you.",
   "created_utc": 1698525456,
   "score": 154,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vjf6f",
   "message": "I am browsing the thread, judging others for their judgments. Does that count?",
   "created_utc": 1698529398,
   "score": 86,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w08ic",
   "message": "Not picking up their dogs shit",
   "created_utc": 1698536689,
   "score": 227,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v8bie",
   "message": "People who cheat rather than just break up first. There's something about secretly sleeping with someone else and not telling your partner that feels like it breaks consent boundaries. \n\nI may not tell you to your face, but I'm thinking it...",
   "created_utc": 1698524915,
   "score": 205,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uyrhg",
   "message": "A tattoo that says 'Only God can judge me'. Nobody was judging you until they saw that tatoo dude. Now I'm thinking you're either a criminal (likely drug dealer) or have a persecution complex/anxiety disorder.",
   "created_utc": 1698521070,
   "score": 213,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v03zg",
   "message": "I have MS, I normally pick my daughter up from school. I park in the disabled spots. I frequently see able bodied people use those spots. They have no placards or plates, it doesn't help that they drive 100k+ cars.",
   "created_utc": 1698521631,
   "score": 96,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vd97q",
   "message": "chewing really loud while eating... that shit grinds my gears",
   "created_utc": 1698526890,
   "score": 138,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v2xir",
   "message": "Not training their pets well or at all.",
   "created_utc": 1698522761,
   "score": 113,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v8xsy",
   "message": "People who don’t correctly use “their”, “they’re”.",
   "created_utc": 1698525159,
   "score": 240,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uqijw",
   "message": "Whenever I go out of my way to hold the door for someone and they dont say thank you",
   "created_utc": 1698517687,
   "score": 27,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v1z14",
   "message": "Everything. I love to judge",
   "created_utc": 1698522380,
   "score": 94,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v28ax",
   "message": "People that gossip to me about other people. I always wonder what they say about me behind my back.",
   "created_utc": 1698522483,
   "score": 94,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6veqnu",
   "message": "I secretly judge people who cannot function by themself and have to have something social to do 24/7.",
   "created_utc": 1698527486,
   "score": 165,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vjrok",
   "message": "People taking endless selfies at a public space",
   "created_utc": 1698529541,
   "score": 53,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v1z8w",
   "message": "I’m not a judgmental person at all, but yesterday at the gym I judged a girl who monopolized the one and only hip thrust machine at the gym. It was the first exercise for my workout and I saw her on it when I got there. I warmed up for about 15 minutes and she was still on it. I thought no big deal, I’ll just skip it and come back to it. Well, I ended up doing my entire workout and she was STILL on it. It had been at least 45 minutes. She had some dumbbells and bands beside it and kept rotating between them. Working in on that machine is not really an option, and I didn’t really feel like asking her how much longer because I could tell that it was a long program she had. I just did them today with my other workout. Either way, it’s just so self absorbed and rude.",
   "created_utc": 1698522382,
   "score": 254,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vjzjw",
   "message": "Pushy religious people or people who use religion as a basis to judge others.",
   "created_utc": 1698529631,
   "score": 92,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vitry",
   "message": "Wearing form fitting clothes the exact same color as their skin tone.",
   "created_utc": 1698529149,
   "score": 133,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v1o1t",
   "message": "How they treat service staff. Waiters, clerks in stores, janitors, hospitality workers etc. In general, people who think they are better or more important than anyone else.",
   "created_utc": 1698522261,
   "score": 201,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6urd6c",
   "message": "Being dead broke and having a huge family.  I get it, we shouldn’t shame poor people for being parents.  But at the same time, I also think you shouldn’t be having 5+ kids if you can’t afford the ones you already have.",
   "created_utc": 1698518036,
   "score": 188,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v8h7k",
   "message": "People who passive-aggressively air their relationship problems online.",
   "created_utc": 1698524978,
   "score": 73,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vbqzx",
   "message": "Excessive flirting to get their own way with the opposite gender. When men do this, it's just creepy to me, for women its annoying to watch. I'm judging you either way.",
   "created_utc": 1698526284,
   "score": 36,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uybqy",
   "message": "overlong nails, looks awful and is cumbersome",
   "created_utc": 1698520889,
   "score": 235,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v8ega",
   "message": "People who seem too full of themselves",
   "created_utc": 1698524948,
   "score": 70,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w071a",
   "message": "Having too many children.",
   "created_utc": 1698536671,
   "score": 72,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vdtu2",
   "message": "Long, dingy, unkempt facial hair.",
   "created_utc": 1698527124,
   "score": 148,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v3llo",
   "message": "Taking phone calls in public on speaker with both callers basically screaming at each other.  Oblivious in every way to the world around them.",
   "created_utc": 1698523025,
   "score": 65,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v6t7w",
   "message": "I judge people at the gym when they can’t put their weights back where they belong. Seriously, how hard is it to put the dumbbells back in their right place? It’s inconsiderate to everyone else because it makes them have to go on a hunt just to find the ones they need. My gym is pretty good at this but my gfs gym is LA fitness in LA and I’m not sure if it’s the staff not organizing them daily or the people there are just trash, but the dumbbells are an absolute hell hole. It’s a mission to find any matching pair of dumbbells. I couldn’t believe how bad it was first time I went.",
   "created_utc": 1698524312,
   "score": 31,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v08xi",
   "message": "Lack of self reflection. \n\nI am 23 and work with coworkers between the ages of 35-50 and the lack of self reflection at my workplace baffles me to no extent.",
   "created_utc": 1698521687,
   "score": 115,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v5l4z",
   "message": "Owning Huskies or other high energy dogs (but especially huskies) in small city apartments.",
   "created_utc": 1698523817,
   "score": 148,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v8b11",
   "message": "People who judge others for being poor, disabled, or overweight.\n\nYou're astonishingly close to being at least one of those things, and don't pretend you aren't.",
   "created_utc": 1698524910,
   "score": 141,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v60gu",
   "message": "Generally, I judge no one because glass houses and all. However, I HARSHLY and IMMEDIATELY judge people who stick their noses where it doesn’t belong, such as watching people go out of their way to go to a designated smoking section so they can cough at them. It’s a labeled smoking section, outdoors, a significant distance from where you were heading - what is the purpose? (I actually saw a woman leave her spot in line to go across the street and up A BLOCK to go cough at a group of three smokers who were in a designated spot and think she then had the right to go back and return to the line where she has been). Or going to the dog park and then as the owner is picking up what was left behind by their pet, approaching from a different part of the park to explain that they should have had their dog do that at home because they COULD HAVE stepped it in. Or walking up to someone that is just trying to unlock their front door to pepper them with judgment on their dating choices because they saw someone pick them up for a date and assume that it was the first time they were meeting up and that makes them “trashy.” Finally, attending a multi-baptism at a church (where multiple babies are being baptized at once), and approaching a mother after the service about how they should “control” their fussy baby in church and that all of their parenting choices that preceded fussy baby are wrong and abusive to the child, despite not knowing the parents or the child at all. \n\nI’ve seen all of these, and I gotta be honest: I don’t judge the people that they’re trying to shame, I judge the doofus who decided they had a right to go out of their way to comment.",
   "created_utc": 1698523990,
   "score": 79,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vyj00",
   "message": "Bathroom hygiene.\n\nWash those hands!!!!!!! You know what I mean; you're washing your hands and someone beelines it to the exit.",
   "created_utc": 1698535942,
   "score": 52,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w0xl8",
   "message": "Leaving the shopping cart in the middle of the goddamn parking lot.",
   "created_utc": 1698537000,
   "score": 60,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uyf7s",
   "message": "made up names for their newborn baby",
   "created_utc": 1698520928,
   "score": 89,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6ve381",
   "message": "Cruising in the left lane. Move the hell over, ffs.",
   "created_utc": 1698527226,
   "score": 97,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6veq5f",
   "message": "The way that someone speaks about the unhoused and addicted population. How they treat servers and waitresses, etc. Someone’s attitude about the disabled and other oppressed populations.",
   "created_utc": 1698527480,
   "score": 49,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uq2id",
   "message": "Bad grammar",
   "created_utc": 1698517504,
   "score": 0,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w25ik",
   "message": "Men dating women waaaay too young for them. Just because they're legal doesn't mean you're not a creep.",
   "created_utc": 1698537547,
   "score": 80,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vd240",
   "message": "Using Comic Sans",
   "created_utc": 1698526810,
   "score": 44,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v4zq9",
   "message": "Facebook Marketplace haggling.",
   "created_utc": 1698523580,
   "score": 24,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vjwi4",
   "message": "People that are oblivious to their surroundings. The shoppers that clog up the lane moving like snails right down the middle so no one can get around them. The people that stop with their cart blocking walking spaces or cut right in front of you because they’re absolutely oblivious to everyone around them. The people that decide to have a social gathering in walking spaces on a busy day, or have to hold everyone up in line bitching at the checker about grocery prices or giving their entire life story.\n\nI just fucking hate shopping.",
   "created_utc": 1698529596,
   "score": 23,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vn6vq",
   "message": "How they treat and train kids and/or animals. I don't care if they're yours or not, if you abuse kids or animals, if you don't care for them, or help them or teach them, you're not a good person. \n\nI was on a second Tinder date with a guy, and he hit the gas to try and hit a squirrel in the road. The second date was cut short, and there wasn't a third. I don't even like squirrels, but instant judgment.",
   "created_utc": 1698530961,
   "score": 23,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vno4i",
   "message": "Sense of entitlement",
   "created_utc": 1698531168,
   "score": 20,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w3rr9",
   "message": "People who are dicks to the “new person” at work for no reason other than the fact they are new. \n\nI see this ALL the time in the fire service. Dudes (and women) will be dicks to new people simply because they have more time on the dept.",
   "created_utc": 1698538283,
   "score": 20,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v4tc6",
   "message": "Not saying thank you when someone holds the door open for them.",
   "created_utc": 1698523507,
   "score": 66,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uoxtf",
   "message": "The way they look, speak, and act in a public setting.",
   "created_utc": 1698517055,
   "score": 81,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v81h1",
   "message": "If you snapchat me driving with kids in the car.\nIf you snapchat driving with me in the car. \n\nIf you don't put your buggy (shopping cart) where it goes when you're finished with it.",
   "created_utc": 1698524805,
   "score": 16,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vipcz",
   "message": "talking with their mouth full 🤢",
   "created_utc": 1698529099,
   "score": 18,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w0wk5",
   "message": "A lot of people seem like they don't have a sense of honor. Like they do the right thing because they are afraid of consequences instead of doing the right thing because they genuinely strive to be a good person.",
   "created_utc": 1698536987,
   "score": 17,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uw8tf",
   "message": "People who talk like they’re god’s gift to the world.  Be proud of your accomplishments, sure.  But don’t act like you’re better than other people.",
   "created_utc": 1698520031,
   "score": 38,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uuj20",
   "message": "Giving their child an iPad or a phone when they're literally 2 years old.",
   "created_utc": 1698519319,
   "score": 111,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v0o53",
   "message": "the size of their truck",
   "created_utc": 1698521860,
   "score": 56,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v3nu3",
   "message": "Spelling and grammar. Can't help it, it just bugs me. But I keep it to myself, until you asked.",
   "created_utc": 1698523049,
   "score": 56,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uxy04",
   "message": "How they treat other people but more importantly animals.",
   "created_utc": 1698520733,
   "score": 87,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v9eo8",
   "message": "People who have Don’t Tread On Me flags.",
   "created_utc": 1698525353,
   "score": 111,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vbs19",
   "message": "Hocking phlegm and loogie on the sidewalk/street.",
   "created_utc": 1698526295,
   "score": 66,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6uu1pg",
   "message": "What don’t I judge people for",
   "created_utc": 1698519121,
   "score": 28,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6v9lib",
   "message": "How people treat people in any customer service worker or in trade jobs such as construction or garbage men.",
   "created_utc": 1698525429,
   "score": 13,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vd0wd",
   "message": "People blaming everything else rather take responsibility for being rude, unkind, bullying etc etc.",
   "created_utc": 1698526796,
   "score": 13,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6w4krm",
   "message": "eating with their mouth open.",
   "created_utc": 1698538653,
   "score": 14,
   "submission_id": "17ijimm"
  },
  {
   "comment_id": "k6vvh2o",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ijimm"
  }
 ]
}