{
 "submission_id": "17iofxz",
 "title": "How do you feel about celebrating your birthday a day early? Is it generally considered acceptable or a bit unusual?",
 "selftext": "",
 "created_utc": 1698530965,
 "permalink": "/r/AskReddit/comments/17iofxz/how_do_you_feel_about_celebrating_your_birthday_a/",
 "score": 223,
 "url": "https://www.reddit.com/r/AskReddit/comments/17iofxz/how_do_you_feel_about_celebrating_your_birthday_a/",
 "comments": [
  {
   "comment_id": "k6vnk24",
   "message": "I'm planning a week-long trip to Seattle and will be returning to work the day after I get back, which happens to be my birthday. Would it be alright to celebrate my birthday a day early? I'm not sure why I'm seeking validation from strangers.. But just feel unusual celebrating it a day early.",
   "created_utc": 1698531119,
   "score": 18,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vncib",
   "message": "It's my birthday, my rules.",
   "created_utc": 1698531029,
   "score": 7,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vouvr",
   "message": "Not a big deal.",
   "created_utc": 1698531679,
   "score": 8,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vzhcw",
   "message": "Good job alerting the police about your plans. They have to arrest someone for pulling the tag off their mattress first and then they are on their way to you.",
   "created_utc": 1698536359,
   "score": 11,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vnazg",
   "message": "you can celebrate it whenever you want",
   "created_utc": 1698531011,
   "score": 4,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vnzk6",
   "message": "People born on leap day can celebrate their birthdays the day before or after. No big deal.",
   "created_utc": 1698531305,
   "score": 3,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vnaoa",
   "message": "YOLO! Get in as many bday celebrations as possible! \n\n😊",
   "created_utc": 1698531007,
   "score": 2,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vodof",
   "message": " It’s considered bad luck to wish someone happy birthday ahead of time in Germany. It’s just some weird superstition, but do whatever suits your lifestyle",
   "created_utc": 1698531475,
   "score": 2,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vrd73",
   "message": "Nah mate. You only have 1 day that is your bday and it’s illegal to celebrate it any other day",
   "created_utc": 1698532765,
   "score": 2,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w63as",
   "message": "As with all holidays you can celebrate it when it’s most convenient. You telling me you all didn’t have birthday parties as a kid on the weekend that didn’t fall in your actual Birthday.?",
   "created_utc": 1698539338,
   "score": 2,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6voszp",
   "message": "I don't even celebrate it. My birthday make me sad",
   "created_utc": 1698531657,
   "score": 4,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vnzsl",
   "message": "Celebrate it from day before until the next morning after. Ahhh youth",
   "created_utc": 1698531307,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vptfp",
   "message": "I'm literally celebrating my brother's birthday right now.",
   "created_utc": 1698532092,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vr3r6",
   "message": "Me myself personally, the day before is September 11. Not much of a celebration day for me.",
   "created_utc": 1698532651,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vrhbe",
   "message": "No Go in Germany. It is bad luck and never wish a German happy birthday before the date.",
   "created_utc": 1698532815,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vsbur",
   "message": "Not a big deal. You can’t always do things when you want to do them\n\nEnjoy your birthday!!",
   "created_utc": 1698533191,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vst39",
   "message": "I usually celebrate off-birthday if it's on a weekday and I want to celebrate on the weekend.",
   "created_utc": 1698533402,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vstyw",
   "message": "Bad luck on Italian culture, they think celebrating your birthday early is taunting the universe and will cause you to get hit by a bus/struck by lightning/crushed by a meteor/etc before your actual birthday",
   "created_utc": 1698533413,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vszjl",
   "message": "i forgot i had a birthday, i turned 20 last September",
   "created_utc": 1698533481,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vu3xy",
   "message": "It doesn’t when a birthday is celebrated. It doesn’t even need to be. You did nothing except not die during the year.",
   "created_utc": 1698533973,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vuucw",
   "message": "Yeah I pretty much always celebrate either early or late. I'm right before Christmas so people are usually busy on my actual birthday, I tended to celebrate right after finals (when I was in school) or when we got back from Christmas break. Now it's usually just rolled into whatever christmas party..",
   "created_utc": 1698534307,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vv0co",
   "message": "If something that trivial stresses you, you need to get over yourself.",
   "created_utc": 1698534381,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vv54e",
   "message": "I say celebrate it whenever you want. I often celebrate on the nearest weekend, if my birthday is on like a Tuesday or something.",
   "created_utc": 1698534442,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vvbyw",
   "message": "It doesn't really matter.",
   "created_utc": 1698534530,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vvdob",
   "message": "don’t see the big deal about celebrating birthdays a day earlier/later. whatever suits you!",
   "created_utc": 1698534551,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vvvuf",
   "message": "Eventually it just get to when things are convenient at least that's how I feel. Things can get so hectic during the week I'd rather just do it on a weekend when I have time to enjoy it",
   "created_utc": 1698534779,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vx2j0",
   "message": "I usually celebrate my birthday on the nearest convenient weekend. When you're an adult, you can throw yourself a party whenever you want.",
   "created_utc": 1698535310,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vyfxz",
   "message": "I’ll be celebrating mine a week early because I have to have surgery and will be bed ridden on my actual birthday. Celebrate it whenever you want!!!",
   "created_utc": 1698535906,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vylfi",
   "message": "When you have a holiday birthday it's usually before . Thanksgiving birthday here every 3 or 4 years. It sucks",
   "created_utc": 1698535971,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vypto",
   "message": "Absolutely not!  Your birthday MUST be celebrated on the exact day or you are in breach of The Birthday Code!\n\nOr not, whatever works for you.",
   "created_utc": 1698536025,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vyt1q",
   "message": "Had it happen a lot growing up as not only my birthday is usually on a holiday weekend but I had family who usually had theirs on that week. I will either have it the week before or the week after it\n Yes it sucks when my friends were on summer vacation but I got used to it.",
   "created_utc": 1698536064,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6vzvme",
   "message": "Mine being on Christmas, I usually celebrate mid-november-ish",
   "created_utc": 1698536533,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w03tg",
   "message": "You are celebrating another year of living, not the fact that you plopped out of your Mom. Do it whenever you want!",
   "created_utc": 1698536632,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w0mhq",
   "message": "I think a day is fine. I know grown ass adults who celebrate their birthday week, and even birthday month. It's ridiculous when they expect everyone from family , work, acquaintances to rally around them for an entire month or even a week. Then they pout and don't want to talk to you if you don't celebrate every fiber of their being.\n\nSource: my sister.",
   "created_utc": 1698536863,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w0rj3",
   "message": "As someone born on April Fool's Day, I never celebrate my birthday the day of. I always celebrate the day before or the day after, otherwise, the service at the restaurant is always just a bit off. There's that quickly-hidden skepticism, the waiting-for-the-punchline, I got sick of it.  \n\n\nAnyways, birthdays are a social construct. Depending on how quibbly you want to define a year. There's lunar calenders, and then there's the difference between the Julian and Gregorian solar calenders is like, 4 months. What's a day, either way?",
   "created_utc": 1698536925,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w106c",
   "message": "Except for little kids, I fully support celebrating birthdays when convenient. I'm just happy when someone remembers.",
   "created_utc": 1698537031,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w1pxt",
   "message": "My birthday is too close to deer season for me to give it much thought.",
   "created_utc": 1698537350,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w1zad",
   "message": "Do whatever you want. I usually don’t celebrate it but just take the day off.",
   "created_utc": 1698537469,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w22ab",
   "message": "Celebrating a day early or late so it lines up with the people you want to celebrate with's schedule. If your birthday is on a Thursday but you want to do something Friday night instead then there you go. Same for a day early. I'd say a day or so before or after is always understandable, and week still seems reasonable. An longer and its just a bit weird.",
   "created_utc": 1698537507,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w2nu3",
   "message": "Lmao, I think it's weird that you're even asking this question tbh. It would never in a million years have occurred to me if it's +/- one week.\n\nIf it was a month away I'd be like \"huh\" but still not think more of it",
   "created_utc": 1698537777,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w31mk",
   "message": "Yea it’s fine. Nothing wrong with it.",
   "created_utc": 1698537952,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w3bsu",
   "message": "I don’t always celebrate my birthday in the same week",
   "created_utc": 1698538079,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w4f0u",
   "message": "Born on Christmas but celebrated on the Sunday before Christmas",
   "created_utc": 1698538580,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w4gjf",
   "message": "I usually celebrate the weekend before or after. Who wants to celebrate in the middle of the week when you have to get up and go to work the next day?",
   "created_utc": 1698538599,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w4ryb",
   "message": "ACCEPTABLE",
   "created_utc": 1698538744,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w4zm9",
   "message": "My wife and I shift our birthdays as nuch as a whole week, nothing be weird about it.",
   "created_utc": 1698538839,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w4zpb",
   "message": "All week baby! All month too, to feel good and celebrate me!",
   "created_utc": 1698538840,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w59bk",
   "message": "I normally celebrate on the nearest weekend.",
   "created_utc": 1698538961,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w6onp",
   "message": "Growing up no one really gave a fuck bout my birthday so to me it's just another Tuesday in the books",
   "created_utc": 1698539606,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w6w4l",
   "message": "If your birthday is on a Monday or holiday, that's a perfectly acceptable reason to celebrate early. I always do the most convenient day within a week of mine.",
   "created_utc": 1698539701,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w726r",
   "message": "Shit, I know people who make the whole month about themselves.",
   "created_utc": 1698539775,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w78xz",
   "message": "I acknowledge my whole birthmonth.",
   "created_utc": 1698539860,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w7g6z",
   "message": "Completely fine. Who's going to stop you? I think it's pretty normal to celebrate your birthday on the weekend when it falls in the week.",
   "created_utc": 1698539952,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w7pyz",
   "message": "We have birthday week at my house lol. It means you get a buffer of days around your birthday where if you don't want to do something, you can say \"but it's my birthday week ☹️\" and someone else has to do it for you.",
   "created_utc": 1698540077,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w826j",
   "message": "Y’all still celebrate your birthday? That’s literally the day your problems started. \u0026gt;!/j, which means joking!\u0026lt;",
   "created_utc": 1698540235,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w8g51",
   "message": "My birthday is just another day for me",
   "created_utc": 1698540413,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6w93la",
   "message": "Celebrate your birthday whenever you want. As long as you don't get obnoxious and entitled, your friends are just happy to celebrate with you.",
   "created_utc": 1698540717,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wa6cr",
   "message": "Not weird at all.  Celebrate it for the whole month!",
   "created_utc": 1698541220,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wa885",
   "message": "no one will give a single thought to this ever, celebrate your birthday on a day that's convenient. i know people whose birthday is near christmas so they celebrate mid year. my birthday is a few days away from my brothers so we have generally had a joint birthday somewhere in the middle all our lives. why is this something you are worried about? your friends won't care about this any more than they care about if you wear a red shirt or a blue one.",
   "created_utc": 1698541245,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wac1z",
   "message": "I personally wouldn't mind doing it, but I know that I wouldn't get people to come if I would do that. Where I'am from it's considered bad luck to wish or celebrate your birthday, before your actual birthday.\n\nBut if you want to do it, do it. It's your birthday after all.",
   "created_utc": 1698541295,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wagfs",
   "message": "My husband’s birthday is this coming Monday. We both have work and I have an evening commitment. We’re celebrating with our son on Sunday instead - grilling, pie and ice cream, etc. Celebrate for convenience, not calendar.",
   "created_utc": 1698541353,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wameo",
   "message": "I celebrate my birthday whenever a place will give me something for free. My wife quietly says \"It's his birthday today\" and free cake and sometimes a song ensues at the end of my meal. Magically deliciouso.",
   "created_utc": 1698541431,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wark5",
   "message": "I do it two days late because one of my favourite musicians birthdays. It’s my birthday, my celebration.",
   "created_utc": 1698541501,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wavho",
   "message": "I haven't celebrated a birthday in over 20 years and see no point at all in doing so unless you are under 16 or over 100. Celebrating it a day early or 3 months late makes no difference to me at all.",
   "created_utc": 1698541554,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wbcw5",
   "message": "It's completely fine. If my birthday is during the week then I always end up celebrating it on the weekend instead.",
   "created_utc": 1698541785,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wbd80",
   "message": "This year I honestly forgot it was my birthday.  A day or two later, I was like \"wait, wasn't it just my birthday?\".  So yeah, anything goes.",
   "created_utc": 1698541789,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wcgzr",
   "message": "I thought all the kids were doing \"birthday month\" now?\n\nidc, do whatever you want. It's your life.",
   "created_utc": 1698542333,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wcmk7",
   "message": "I celebrate it whenever is the most convenient. If if falls on a day during the week, I'll usually just go out with friends on the weekend before or after.\n\nIt's just a day, who cares?",
   "created_utc": 1698542408,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wd3af",
   "message": "I'm born on 01/01/2000; I'm fine as it is. 🙃🫠",
   "created_utc": 1698542630,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wdlm3",
   "message": "Depends on why; If it's the day before bc your family **absolutely HAS** to do things like go to school or work on your actual birthday, then it's fine. If it's because of a superstition or for no real reason at all, then it makes no real sense.",
   "created_utc": 1698542880,
   "score": 1,
   "submission_id": "17iofxz"
  },
  {
   "comment_id": "k6wdxsi",
   "message": "Eh, sometimes schedules line up better that way.  Earlier or later, it's not a big deal either way.",
   "created_utc": 1698543046,
   "score": 1,
   "submission_id": "17iofxz"
  }
 ]
}