{
 "submission_id": "17ipo7i",
 "title": "How do you invite someone over (ages 25-35) to your apartment in the evening without leading them to think sex is on the table?",
 "selftext": "",
 "created_utc": 1698534634,
 "permalink": "/r/AskReddit/comments/17ipo7i/how_do_you_invite_someone_over_ages_2535_to_your/",
 "score": 148,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ipo7i/how_do_you_invite_someone_over_ages_2535_to_your/",
 "comments": [
  {
   "comment_id": "k6vw1qr",
   "message": "Tell them sex is on the bed",
   "created_utc": 1698534852,
   "score": 49,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vyh4m",
   "message": "\"Hey, do you want to come over tonight for a platonic hangout?\"",
   "created_utc": 1698535920,
   "score": 9,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vvp41",
   "message": "Invite several friends",
   "created_utc": 1698534695,
   "score": 193,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w641j",
   "message": "Just tell them. A little awkward versus a potential lot awkward.",
   "created_utc": 1698539347,
   "score": 86,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w7vk8",
   "message": "One time this girl I was seeing invited me over really late and she said \"just so you know sex isn't going to happen\" and then I didn't expect sex. We did end up having sex though, which was particularly rad because I didn't expect it. I hope this is helpful",
   "created_utc": 1698540149,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vzmxd",
   "message": "In any adult relationships in order to avoid confusion from either side you should just be up front. I know this is easier said than done but it will save a lot of time and miscommunication in the long run",
   "created_utc": 1698536427,
   "score": 207,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vyezb",
   "message": "Unless you’re in a relationship, don’t overthink it. Simply don’t give any signs that you’re interested in physical intimacy, and if they make a move, decline their advances and clarify you aren’t interested in them in *that* way.\n\nIf you’re scared they’re going to force themselves on you, then don’t invite them over.\n\nIf you think there’s some confusion about the status of your relationship tell them that you’re happy they’re your friend and you hope they understand that’s all this is.",
   "created_utc": 1698535895,
   "score": 88,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vx7y5",
   "message": "I would just tell them to come over but say you have to do work after. They will know that you just want to hangout before haveing to do work.",
   "created_utc": 1698535376,
   "score": 54,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vvp5r",
   "message": "Call it board game night and invite other people perhaps",
   "created_utc": 1698534695,
   "score": 97,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w8pmj",
   "message": "If it's a friend just be honest. \"I know I probably don't have to say this, but I just want to hang out, I don't mean this as a date or a time to hook up.\" If they're remotely mature and interested in friendship, they'll be cool with it.",
   "created_utc": 1698540537,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vw535",
   "message": "Well, in the first place, the table is a terrible place for sex, better off in the bed, far more comfortable, especially for the post coital snooze...",
   "created_utc": 1698534893,
   "score": 10,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w7s53",
   "message": "I think someone said something similar, but.\n\nInvite them in the early afternoon. It's usually less suspicious that you'll want to sleep with them. If whatever you are doing drags to dinner time or beyond, suggest an activity outside of your home so then you'll get to part ways outside.\n\nOk, that second step isn't nearly as important, but yeah, if you invite them over at, say, 1 PM instead of 5 PM, ut's usually less suspicious (and if you are not legitimately are not looking to have sex with them, it'll give you more time to do activities)",
   "created_utc": 1698540105,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w9u01",
   "message": "It's nice that reddit thinks the best of everyone... Reality is that *most* men will see this as a date. That's the hard truth of it.\n\nYes, men can have girl friends. Yes, they can hang out without sex. This isn't the type of situation where that is normal. If there is any ambiguity around this, then it's most definitely a date in their mind.",
   "created_utc": 1698541057,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wbhry",
   "message": "I think you write the invite on a piece of paper shaped like a bicep and write NOTHING SEXUAL on it",
   "created_utc": 1698541849,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w57jh",
   "message": "Sex should be on a bed.\n\nBy all means, experiment with different locations later.\n\nBut first time, sex should be on a mattress and not on a table",
   "created_utc": 1698538938,
   "score": 4,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vw6nt",
   "message": "Genuine question: why are you intending to invite a single person of the opposite sex over to your house alone in the evening if you don’t want sex to be on the table?\n\nIf they’re a longtime platonic friend then of course they’ll know you’re just hanging as I imagine they’ve hung alone with you many times before…but a newish opposite sex person over at night 1-on-1? I mean come on you’re sending signals.",
   "created_utc": 1698534913,
   "score": 56,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w435h",
   "message": "You say to them .. would you like to come over to my flat tonight ? \nFood wine and chat ? \nI have crabs",
   "created_utc": 1698538432,
   "score": 3,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w4l99",
   "message": "Be explicit about what *is* on the table.",
   "created_utc": 1698538659,
   "score": 3,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w61ki",
   "message": "Hi, would you like to come over to hangout, not for sex.. easy",
   "created_utc": 1698539316,
   "score": 3,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w9km4",
   "message": "Have sex with them before they come over",
   "created_utc": 1698540934,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w9n6m",
   "message": "Idk, but the concept of just hanging out and playing videogames and ordering a pizza or playing chess/ board games and popcorn  with no strings attached sounds amazing.   Hanging out like kids on the weekends in the 90s.   I'd totally be down for it and I'm honestly bummed that most people consider a one on one friend night something sexual related.",
   "created_utc": 1698540968,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w2rgh",
   "message": "What the hell is wrong with people? What world do you all live in where you cant invite someone of the opposite sex to your house without them thinking its about sex or thinking they are going to rob you?\n\nJust be honest that you are looking for friendship, hang out with them a few times before you invite them over, and be clear about your goals. And listen to their goals, it should be relatively clear if they are flirting with you or are leaving the door open to see what happens.",
   "created_utc": 1698537823,
   "score": 21,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vvp1z",
   "message": "Ay bro tryna chill?",
   "created_utc": 1698534694,
   "score": 5,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w4ibn",
   "message": "Invite them over but let them know sex is on the couch, floor, bed, in the shower, pretty much everywhere but the table!",
   "created_utc": 1698538621,
   "score": 2,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w8zpz",
   "message": "Are you a man or a woman? I’d start by brewing some coffee when they get there and keep alcohol completely out of the interaction. Don’t act flirty, keep things professional. If  you think they might be presumptuous about sex, say things like “could you meet me at x____ location (or say my apartment if they already know where you live) for a visit to discuss topic x_____? (Or partake in activity x_____) Rather than “wanna come over to my place?” Also try not to mention your bedroom at all if possible.",
   "created_utc": 1698540668,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w95bn",
   "message": "well what is on the table then?",
   "created_utc": 1698540740,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w9kku",
   "message": "Tell them sex is on the floor",
   "created_utc": 1698540934,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w9o6e",
   "message": "“I’m not gonna fuck you, I might blow you”",
   "created_utc": 1698540981,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wa0tc",
   "message": "“Wanna come over and chill? Strictly platonic though so don’t read into it or anything ;)”",
   "created_utc": 1698541147,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wam91",
   "message": "Why don't you wanna have sex with this person",
   "created_utc": 1698541429,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wc3cs",
   "message": "If you are a man, it is easy.\nIf you are a woman, give up the dream.",
   "created_utc": 1698542147,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wc65t",
   "message": "I suggest using the words \"friend\", \"buddy\" or \"family\" to describe them. \n\n\"It's really great having a friend like you to hang out with\"\n\n\"Thanks for being my movie-and-snacks buddy\"\n\n\"You're like family (or a brother) to me\"\n\nPeople will get the hint",
   "created_utc": 1698542185,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wc6p2",
   "message": "I've a Muslim friend, she invited me over to see her new apartment, now clearly I knew there's no sex as... well she's Muslim\n\n\u0026amp;#x200B;\n\nBut if you're inviting a friend over tell them you want to do them a dinner and then go out (Notice the going out part after the activity you plan) implies no action after.\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\nCould do that, IF they try to be more forward with you... WELL now you know they always planned to have sex and can either ditch or have sex.",
   "created_utc": 1698542192,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wc72b",
   "message": "Do people really go to peoples houses/apartments thinking sex is an option? Have I been adulting wrong my whole life?",
   "created_utc": 1698542197,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wc9xp",
   "message": "Just tell them if they want to come over as a friend to hangout, tell them no innuendo or anything physical, you simply enjoy/appreciate their company.  Clarity is always better and appreciated by reasonable people, if for some reason they thought it was weird or off putting that you said that, then they probably werent worth hanging out with.  At some point as we get older we have to make an effort to hang out/make friends with people, it doesnt happen as easily as when we were younger and you saw the same people every day, go for it and try not to over think it.  Also make sure they respect your boundaries, people get weird and start assuming things even when you set boundaries.",
   "created_utc": 1698542237,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wcbfb",
   "message": "Hey (person). You wanna come over, hangout and chill for a while?  \n\nThat’s what I usually do.",
   "created_utc": 1698542257,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wcikc",
   "message": "\"hey do you want to not have sex with me at my place tonight?",
   "created_utc": 1698542355,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wcn59",
   "message": "You can come over but just so we’re clear, let’s not Netflix and chill.",
   "created_utc": 1698542416,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wd3fo",
   "message": "“Hey I don’t want you to think there’s sexual undertones to this at all, but would you like to come over and hang out”",
   "created_utc": 1698542633,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wdg3v",
   "message": "Make flyers for cool like minded people getting together, bonus points if it’s shaped like a super ripped bicep",
   "created_utc": 1698542804,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vw263",
   "message": "Wanna come over? We can just Netflix no chill",
   "created_utc": 1698534857,
   "score": 3,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vw4z7",
   "message": "If you are a beautiful woman inviting any one of many types of men? Good luck with that. \n\nI will refrain from making the obvious, \"then move it to the bed,\" joke that immediately came to mind.\n\nBut seriously, like others have said, invite other people too.",
   "created_utc": 1698534892,
   "score": 4,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w0kd2",
   "message": "How do I not lose all my karma on this post? Most of you guys say that I shouldn’t be nervous about speaking my truth, but I went out of my comfort zone and asked this on Reddit and I feel seriously sad right now",
   "created_utc": 1698536837,
   "score": 5,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vzvm8",
   "message": "Well usually the way my wife lets me know there isn’t going to be any sex is when she says “we are definitely having sex”",
   "created_utc": 1698536533,
   "score": 3,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vz58p",
   "message": "When you want to invite only person over, it’s always Netflix and …",
   "created_utc": 1698536211,
   "score": 2,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w7cty",
   "message": "If it's a guy, you can't",
   "created_utc": 1698539909,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w3q2s",
   "message": "Why would you want that?",
   "created_utc": 1698538261,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w1gtb",
   "message": "Be clear about intent. 'Dinner at my place but no sex.' But I'm also ace so my perspectives might be off.",
   "created_utc": 1698537235,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w80io",
   "message": "Literally after you invite them over just say \"Hey, sorry if this comes off as rude but I just wanted to clarify and say that I really do mean it as just friends. I don't want more than that. I hope that's okay\"",
   "created_utc": 1698540213,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w9dzq",
   "message": "\"we can hang out, but I do not have sex on the first meeting\"\n\nSure it's direct, but you'll either impress them or weed them out. So it's a win/win.",
   "created_utc": 1698540849,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vvulx",
   "message": "Make sure your other friends or family are there too. Its unsafe otherwise.",
   "created_utc": 1698534764,
   "score": 0,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w6ime",
   "message": "Ask them if they want to come over and watch Netflix.",
   "created_utc": 1698539529,
   "score": 0,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w6z57",
   "message": "[deleted]",
   "created_utc": 1698539737,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wawvw",
   "message": "You must be a woman asking this on Reddit.",
   "created_utc": 1698541571,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vvzcd",
   "message": "[deleted]",
   "created_utc": 1698534822,
   "score": 255,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w00wr",
   "message": "Tell em you have 🦀",
   "created_utc": 1698536598,
   "score": 255,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vwbgw",
   "message": "Sometimes, just lie about your sexuality to protect yourself. If its someone of the opposite sex, tell them you’re LGBTQ or vice versa. If that person cancels the plan, still comes over, then th",
   "created_utc": 1698534974,
   "score": 251,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vvwmp",
   "message": "Games, drinks etc",
   "created_utc": 1698534789,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vvxbn",
   "message": "Make it a group event",
   "created_utc": 1698534798,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vyzeh",
   "message": "you need to stop being afraid of rejection. once you conquer that, you’ll find peace with yourself. you being yourself, upfront, and honest is way better than beating around the bush.",
   "created_utc": 1698536140,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vzaso",
   "message": "Probably depends on male or female and the individual, but there’s always the good ‘ol “you wanna come in for a cup of coffee?” Tbh as an adult, any time a bachelor invites me to their place, especially with no real context (not like we’re meeting up to do something else) and at nighttime, it’s pretty much an open invitation.",
   "created_utc": 1698536279,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6vzg8r",
   "message": "Oh wait I think you’re asking the opposite thing, so basically take my comment and reverse it. Don’t do the stuff I said in my last comment lol but then again, that’s pretty much anything. \n\nReal question is why would you invite someone if you’re afraid they’ll think sex is on the table? Just don’t invite them into your home at all!",
   "created_utc": 1698536346,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w0uif",
   "message": "Be honest and hope for the best.",
   "created_utc": 1698536962,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w179y",
   "message": "Just find a way to express a lack of sexual interest on your part, somewhere in the conversation. If you have a partner - mention them. If you dont, talk about someone you want. Whatever you can to burst the bubble before it forms. \nThe same way you would prevent someone from making a move onto you without being blunt.",
   "created_utc": 1698537119,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w1w2z",
   "message": "Lead with something for you both to do, hobby/interest wise. Stuf that keeps you busy, and does not lead to sexy time thoughts. You really cannot stop them on their end though,  it depends on the boundaries you have in place too.",
   "created_utc": 1698537429,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w20um",
   "message": "Be upfront.\n\n\"Hey wanna come over and \u0026lt;insert activity\u0026gt; for a few and then leave?  I'm not looking or interested in sex with you\". This will save everyone a bunch of time",
   "created_utc": 1698537489,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w3uw6",
   "message": "Just tell them what you plan to do. Come over and hang out means sex. Come over to eat pizza and watch the game is different.",
   "created_utc": 1698538325,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w5epl",
   "message": "Well, you build up to it not straight away. If you want to hang out with someone 1 on 1, do it in a public setting. A museum, park, museum, wtv. And if you do want them to xome over, for a specific activity. Don't just say come over, come over and do what exactly?",
   "created_utc": 1698539028,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6w63m2",
   "message": "Sounds like you may have a crush on this person but don’t want sex at this time or to be intimate yet?",
   "created_utc": 1698539341,
   "score": 1,
   "submission_id": "17ipo7i"
  },
  {
   "comment_id": "k6wb09d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ipo7i"
  }
 ]
}