{
 "submission_id": "17j7qe3",
 "title": "What are your thoughts on chiropractors?",
 "selftext": "",
 "created_utc": 1698600071,
 "permalink": "/r/AskReddit/comments/17j7qe3/what_are_your_thoughts_on_chiropractors/",
 "score": 169,
 "url": "https://www.reddit.com/r/AskReddit/comments/17j7qe3/what_are_your_thoughts_on_chiropractors/",
 "comments": [
  {
   "comment_id": "k6z8smt",
   "message": "I was working at a trade show once, and in the next booth was a chiropractor.  He had a device that he would run up and down over people's spines and it would beep when it detected a misalignment.  Everyone he tested that day had a misalignment.  Every single one.",
   "created_utc": 1698601764,
   "score": 205,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z75xi",
   "message": "I'm a nurse and would never go to one. I do like getting massaged though. But not at the chiropractor",
   "created_utc": 1698601185,
   "score": 56,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zb9vb",
   "message": "The guy who invented it claims he was told how to do it by a ghost.\r  \n\r  \nI'm not letting anyone who thinks that's a good idea crunch my bones.",
   "created_utc": 1698602647,
   "score": 234,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z8akb",
   "message": "That they are not medical professionals.",
   "created_utc": 1698601585,
   "score": 252,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z9x3z",
   "message": "I went when I was pregnant once, hoping to get some back pain relief. It did help, for about 3 days. And they charged me for a whole work up, which would have included an x-ray had I not been pregnant. They wouldn’t reduce the charge. Okay, fair enough, I disagree but whatever.\n\nThen I kept getting emails about how cancer is caused by spinal misalignment, how they could PREVENT CANCER with routine adjustments. Which would presumably include regular x-rays.\n\nGuys, these jabronis are FUCKING CHARLATANS. \n\nThen during COVID some of the snake oil salesmen in my town started telling people not to get vaccinated, just get regular adjustments.\n\nI hate them.",
   "created_utc": 1698602170,
   "score": 136,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z765x",
   "message": "There’s no real science that supports them, if you have problems go to a psychical therapist",
   "created_utc": 1698601187,
   "score": 236,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k70464z",
   "message": "My SIL has been deaf in her left ear for over ten years. She met a chiropractor in Texas who said he could bring her hearing back with regular appointments over the course of two years. That was 4 years ago. She’s still deaf in her left ear.",
   "created_utc": 1698613024,
   "score": 54,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zbc3b",
   "message": "They can't do anything that a physiotherapist can't do. All the stuff that people praise about chiropractors is just Wish.com physiotherapy. The actual chiropractor stuff with the neck cracking is wildly dangerous and should be banned.\n\nThey should just get licensed as physiotherapists and do some massages on the side.",
   "created_utc": 1698602669,
   "score": 207,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zajzc",
   "message": "Would never go to one or recommend anyone else see one. Their neck manipulations are extremely dangerous and can result in vertebral artery dissection. Basically that means slicing one of the major arteries supplying your brain.",
   "created_utc": 1698602394,
   "score": 239,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z616y",
   "message": "Crack is whack! \n\nThere's limited benefits to their services and greater risks than most people believe.",
   "created_utc": 1698600783,
   "score": 38,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k7056xb",
   "message": "I'm a doctor. During my training I worked in the stroke team. Saw two young people who were otherwise well with vertebral artery dissections after neck manipulation by a chiropractor. One spent months in rehab and did well. The other one never regained their coordination to a high enough degree to walk.",
   "created_utc": 1698613395,
   "score": 53,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zud38",
   "message": "It's Homer Simpson throwing you over a garbage can and calling it medicine.",
   "created_utc": 1698609520,
   "score": 248,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z49o7",
   "message": "Honestly, if they'd cut the BS and stop calling themselves \"Doctor\" and just offered some massage and back cracking for mobility and back pain relief, I'd probably consider going – so long as they chilled with that neck move that kills people.",
   "created_utc": 1698600157,
   "score": 138,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z4zwf",
   "message": "Pseudoscience",
   "created_utc": 1698600410,
   "score": 74,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zz9ws",
   "message": "Quack medicine. They can give temporary relief for some injuries, but if you really want to overcome an injury, you need to go to a physical therapist. \n\n\u0026amp;#x200B;\n\nI feel like they really came to a rise in the 90's when car insurance companies could send you to one after a car accident, pay for it on the cheap, then reject any further claims since you got \"treated\".",
   "created_utc": 1698611238,
   "score": 111,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zhff5",
   "message": "Physical therapist here. I think there is a time and a place for chiropractors if they have reasoning behind what they're doing. I think there are good, bad, and sometimes outright dangerous ones. There's little scientific evidence for some of the more fanatical claims they make. Given this, it's annoying to me how they emphasize themselves as \"doctors\" without the qualifying phrase \"of chiropractic\". I myself am a Doctor of Physical Therapy but almost never refer to myself as \"doctor\" so I'm not misleading patients by making them think I'm an MD. \n\nHaving said that, I utilize joint manipulation and manual therapy interventions as needed. But NOT with every patient I see. I also have specific reasons for why I use manual interventions that don't include curing cancer. \n\nFinal note, I sometimes hear people say things like \"my chiropractor cured me of my back/neck/shoulder/etc pain, I've been going for x amount of years 2x/week!\" I have unfortunate news for you, they have not cured you. You may feel better after, but so does their bottom line. If they don't give you any home exercises or have an end goal in sight for your care, find someone different.",
   "created_utc": 1698604856,
   "score": 26,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zchv1",
   "message": "Dangerous scam artists.",
   "created_utc": 1698603083,
   "score": 18,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z4lzx",
   "message": "They’re quacks. It’s insane to me that people in America think chiropractors are actual doctors.\n\n**Edit:** I’m begging y’all to stop telling me that you don’t know anyone who thinks chiros are doctors. 1) I doubt you’ve asked everyone you know and 2) even if you have, that’s completely anecdotal. \n\nChiropractors are seen as physicians all over the USA and more than half of Americans trust them and prefer them to actual doctors for treating neck and back pain. This is, like, a known thing. Just google it if you don’t believe me.\n\nIf you’re one of those people who go to the chiropractor regularly (or even rarely) please stop, they’re literally quacks and you are being scammed. [Please watch this video](https://youtu.be/1NYG40oa7Eg?si=5X-8ynuMBr3TiPV0) or do some reading.",
   "created_utc": 1698600277,
   "score": 179,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k709wfm",
   "message": "Most of them I think are phony \n\nHowever\n\nAs a child I had migraines. Bad migraines. Out of commission for days, looked into doing brain surgery bad migraines. As a last ditch effort before finding a neurosurgeon for my 8 year old self, my parents found this chiropractor who claimed he could help. Had a long list of pro athlete clients, all that. So we went. I would've told you this shit was pseudoscience, still probably would, expect for the fact that it fucking worked. I don't get migraines anymore. I never needed surgery. I have no idea what he did but I fucking owe that man that so much. He also just casually cured my car sickness while he was at it. So because of him, I at least somewhat respect the profession",
   "created_utc": 1698615182,
   "score": 38,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k703wen",
   "message": "My old professor (quoting somebody else) always used to say \"In God we trust, everyone else needs to show the evidence\". If you go to Pubmed - the repository of virtually medical articles published in the last sixty or so years, and look for data supporting chiropractic therapy you simply won't find it. There are no good randomized controlled studies showing that it works. I will gladly apologize and retract this statement if anybody can point out such a study showing level one evidence. \n\nVery similar to homeopathy. If I want to be treated on faith alone, i'll go to church - it's cheaper.",
   "created_utc": 1698612927,
   "score": 101,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z6j5m",
   "message": "I went to one and she did an initial evaluation but wouldn’t treat me that day because she didn’t think my insurance company reimbursed her enough for the evaluation and treatment on the same day, she said their allowance for the treatment was included in the payment allowance for the evaluation. So she told me I would have to come back tomorrow for treatment. I left and never went back. I was bent over in pain and could barely move but her issues with how my insurance reimbursed her were more important than my pain. Disgusting human being!",
   "created_utc": 1698600959,
   "score": 111,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zc93a",
   "message": "Couldn’t get out of bed on my own one day due to a pinched nerve. Went to my local chiropractor out of desperation. He explained what nerve was the problem. Used ultra sound and tens machine to relax and relieve my pain. He gave me an exercise plan to strengthen the muscles I needed help with and hoped he never had to see me again. Copay was $20. I was pleasantly surprised. The same office offers legit physical therapy so I think that made the difference.",
   "created_utc": 1698602996,
   "score": 50,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k705rti",
   "message": "Charlatans",
   "created_utc": 1698613610,
   "score": 27,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zczqv",
   "message": "Pseudo science not based on facts, studies etc. Left people paralysed or seriously hurt.\r  \n\r  \nGo to physio therapy instead",
   "created_utc": 1698603265,
   "score": 153,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k70a8u4",
   "message": "Say what you will, but if not for a chriopractor, id have lost the use of my right arm a long time ago.\n\nI had a repetitve motion injury from work that caused a nerve cluster in the back of my neck/shoulder to be pinched. I couldnt raise my arm above level, I had pretty zero grip strength, and every movement felt like my nerves were being set on fire. I tried physio for a while, but they did nothing other than put some heating gel and a little vibrating thing on it, which did absolutly nothing to help, and honestly just made it more painful and useless.\n\nSo I went to a chrio I had seen once before for a back issue, and who did a good job then, and over a few sessions, he fixed my arm completely, corrected the horrible posture I had, which made me gain an inch in height, and since then, that arm has been fine. Without him, id be a cripple.\n\nI will say however, he was a very experinced chrio with 3 decades of practice. Ive been to others who would give me one little back crack that I could do myself, and then scam me for 100 bucks. Id say that the majority of chiros are like that, which is why they have a bad rep. But the guy I saw wasnt like that at all. He took his time, and he fixed me. It was a little scary, some of the adjustments were pretty loud, but with each one, I could feel the pressure on that nerve cluster releasing.",
   "created_utc": 1698615317,
   "score": 43,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zo6ua",
   "message": "They are no better than homeopaths. Liars and charlatans. Snake oil salesmen. They do more harm than good because best case they do nothing, worst case you die.",
   "created_utc": 1698607308,
   "score": 137,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k7043xs",
   "message": "At a previous job I had to deal with soooo many chiropractors while trying to get medical records for legal cases. 90% of them were super shady. Most of them were not familiar with or simply didn't comply with HIPAA protections. One chiropractor suddenly left the country with no way on contacting him and no way for us to access our client's records. One operated his business out of some crappy, low-end hotel room and didn't seem to keep records.",
   "created_utc": 1698613002,
   "score": 27,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z8sqk",
   "message": "I had a good friend who went through Chiropractic school.  He said it was BS and I took his word for it.",
   "created_utc": 1698601765,
   "score": 131,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k701q6h",
   "message": "I saw chiropractors for years years ago. Recently had an arterial tear in my carotid artery which caused a stroke. Every Dr I saw from the ER to my neurology team asked me if I’d seen a chiro bc apparently dissections are somewhat common from Chiro adjustments. \n\nNever again will I let someone near my neck to crack it. Your arteries are precious and apparently some are delicate like mine.",
   "created_utc": 1698612122,
   "score": 52,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zvzjh",
   "message": "I’m a nurse who has worked on a spinal unit in a hospital. \n\nI think chiropractors can genuinely help with chronic pain but I also believe they can be dangerous or make things worse, however, I *also* believe those three things are just as true for spinal surgery.",
   "created_utc": 1698610074,
   "score": 107,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k70vntr",
   "message": "They can’t cure cancer or anything bs like that, but a good one can 100% help back pain. Call it quackery all you want, you never used one for back pain, I guess.",
   "created_utc": 1698623894,
   "score": 10,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z9avl",
   "message": "Scam artists tbh, massage therapists, physio therapists are 1000000x better",
   "created_utc": 1698601949,
   "score": 101,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k71i5l4",
   "message": "i think people get way too worked up about it. “they’re not medical professionals” yeah because chiropractry isn’t medicine. it’s popping joints you can’t crack. one of the best feeling was a chiropractor putting literally his whole body weight into the like t10-area of my spine. knocked the wind out of me. felt GREAT afterwards. upper back pain was way better.\n\nbut no matter how great it felt, that simply ain’t medicine. it’s fundamentally the same as me cracking my neck or cracking my back on a plastic school desk chair. except for stuff a cant possibly do on my own.",
   "created_utc": 1698633872,
   "score": 9,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6z9trg",
   "message": "Scam",
   "created_utc": 1698602137,
   "score": 107,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k70vzlu",
   "message": "I’m a bit hesitant about any doctor, I’ve had almost all great doctors but I know too many and their stories about their peers are scary. I stayed away from chiropractors but my knee swelled up so I went to see the one my sister and her son (high school football) see, and my mom had seen him while she was in town and it really helped her. He treated me with cryo (cold) and red light / laser (warm), taped up my knee with handle tape. It really helped. I think I saw him about 5 times. He is at a sports medicine office with surgeons, and I saw several surgeons ask him to work on their hands. He works with many pro and Olympic athletes. Right after my knee was better, I got a trigger thumb in my sleep, thumb between fingers.  I had similar therapy plus I think it was a sonic percussion device. Not the most pleasant but it fixed it. Because of him I bought a redlight + nir panel when I remembered it had helped. I walk 10 miles a day and go to the gym every day and it really helps. I’d be hesitant to go to any chiropractor I didn’t have very trusted recommendations from.",
   "created_utc": 1698624034,
   "score": 7,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zycla",
   "message": "I went to one for a while and he really helped my back and shoulders. I would still go but he passed away. And it's hard to find one who isn't a quack.\n\nFind a chiropractor who:\n\n(1) does not think they can cure all ailments.\n\n(2) does not sell supplements (especially MLMs).\n\n(3) doesn't expect you to go weekly forever. If you're going for a specific problem there should be a course of treatment and then no need for further adjustments.\n\n(4) doesn't also push religious or anti-science BS (there are SO MANY of these).\n\n(5) also does some massage or active release therapy to complement their work.\n\nThey're not ALL bad but my estimate is that 98% of them are. If you can find a good one, they can be super helpful! But that's going to be very very difficult with all the quacks out there.",
   "created_utc": 1698610901,
   "score": 85,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k700zxe",
   "message": "I have scoliosis and have been seeing different ones on and off for years. \n\nThere have been some like many have responded as “quacks” whereas others have made a huge difference in my quality of life. \n\nWhenever I have a pinched nerve or misalignment the one I currently see fixes me right up. I recommend them for basic alignment and muscle relief.",
   "created_utc": 1698611860,
   "score": 15,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6ztgqy",
   "message": "My parents took me to one as a young teen when I was having some unexplained pain. The joint-cracking did not do anything. She told me the problem was that I’m lactose intolerance, and avoiding dairy would fix everything. I am not, and never have been, lactose intolerant.",
   "created_utc": 1698609205,
   "score": 23,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k6zbij4",
   "message": "Unnecessary and in rare cases harmful, I can't believe insurance providers pay for it.",
   "created_utc": 1698602733,
   "score": 50,
   "submission_id": "17j7qe3"
  },
  {
   "comment_id": "k71zv45",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17j7qe3"
  }
 ]
}