{
 "submission_id": "17j76l2",
 "title": "What was your fastest \"that's enough Internet for today\" moment?",
 "selftext": "",
 "created_utc": 1698598550,
 "permalink": "/r/AskReddit/comments/17j76l2/what_was_your_fastest_thats_enough_internet_for/",
 "score": 214,
 "url": "https://www.reddit.com/r/AskReddit/comments/17j76l2/what_was_your_fastest_thats_enough_internet_for/",
 "comments": [
  {
   "comment_id": "k6zvb62",
   "message": "Saw a video of a skinny kid doing leg presses, locked his knees and they snapped backwards like toothpicks",
   "created_utc": 1698609847,
   "score": 183,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zcufg",
   "message": "Any time I see an industrial accident video on a CCTV upload. Lathe ones especially….",
   "created_utc": 1698603212,
   "score": 109,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zievl",
   "message": "I stumbled upon a certain sub and saw a video of a woman hang herself in front of her baby who was crying for her. That one definitely made me put the internet down for the day.",
   "created_utc": 1698605222,
   "score": 12,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zha9x",
   "message": "Downloaded Twitter, first image was a guy bent over with a creme egg in his arse cheeks, deleted Twitter immediately never to return",
   "created_utc": 1698604804,
   "score": 26,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zpgt4",
   "message": "That Nottingham ice hockey video today. I didn't need to see that.",
   "created_utc": 1698607775,
   "score": 231,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6ze9by",
   "message": "Seeing an old man carrying the remains of a Teenager ripped to shreds by pirhanas, it was like a wet skeleton",
   "created_utc": 1698603711,
   "score": 11,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zhigj",
   "message": "BME Pain Onlympics or the cinderblock off the overpass dash cam.  Both were horrible\n\nEDIT: Someone remembered better BME not BDSM.",
   "created_utc": 1698604887,
   "score": 97,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6ze6wa",
   "message": "Today's was up there. That video of the ice hockey player that had his neck cut open mid game that was going around. It happened so quick and I could just feel the horror of it all.",
   "created_utc": 1698603688,
   "score": 136,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zrnc5",
   "message": "Briefly glancing at the transcript of a video made by the toolbox serial killers. It’s horrific and please do not make the same mistake as I did.",
   "created_utc": 1698608561,
   "score": 145,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6z5gah",
   "message": "I saw these pics of this woman who would cut herself super deep. Like through muscle and down to the bone. This was like 15-20 years ago. No idea where I saw the photos or what her name was but it made me cringe with second hand pain so badly.",
   "created_utc": 1698600575,
   "score": 43,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zkdig",
   "message": "Coming across this video today with gum on the wall and the girl eating it .. \nhttps://www.reddit.com/r/facepalm/s/Pv3cTkmas8",
   "created_utc": 1698605931,
   "score": 198,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k70b5i5",
   "message": "Opened reddit, so a video of a woman shoving a live fish up her vagina, closed reddit",
   "created_utc": 1698615658,
   "score": 98,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6z0uia",
   "message": "Going to r/askreddit",
   "created_utc": 1698598902,
   "score": 179,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zs0vs",
   "message": "The first time someone showed me rotten.com I spent 2 hours looking at everything I possibly could and then never looked at it again. That was 20 years ago. And it’s still a core memory",
   "created_utc": 1698608697,
   "score": 164,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6z6hqy",
   "message": "Swamps of Dahobah after I read it for the first time. The Junko Furuta torture/murder was a tie for this",
   "created_utc": 1698600944,
   "score": 224,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6z5fte",
   "message": "On my old account, I asked Reddit what the best NSFW subreddit was and everyone started making fun of me, so I deleted my account.",
   "created_utc": 1698600570,
   "score": 187,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zggmp",
   "message": "That one subreddit of women eating their own shit.",
   "created_utc": 1698604499,
   "score": 117,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k705kkz",
   "message": "The hoarder episode where that lady hoards her shit",
   "created_utc": 1698613535,
   "score": 58,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6z57ns",
   "message": "Googling Tubgirl.",
   "created_utc": 1698600487,
   "score": 193,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6z1yrb",
   "message": "r/selffuck\n\nDon’t make the same mistake I did. Don’t click the link.",
   "created_utc": 1698599320,
   "score": 232,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zonjb",
   "message": "Seeing yet another “What makes a woman/man instantly attractive/unattractive?” post in this sub.",
   "created_utc": 1698607473,
   "score": 181,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zjmb8",
   "message": "I once opened instagram, saw a video of a tiger killing a dog, and then just closed the app. I don’t get why a meme page would post that.",
   "created_utc": 1698605657,
   "score": 179,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6ztvfh",
   "message": "In the old days of usenet news there was a video of a man killed by trying to be intimate with a horse.  No one needs to see that.",
   "created_utc": 1698609345,
   "score": 79,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zim1y",
   "message": "I tried to get into tiktok once. My mates kept sending me videos so I figured I'd join in to fill the boring Canadian winter evenings. \n\nDownloaded it. \n\nThe very first 3 videos were children dancing far to adult for my taste. The 4th and 5th were white power videos. The 6th was a flat earther video. The 7th was some girl in full monster energy drink clothes with monster energy drink face paint repeating 2 phrases over and over and over while people emojod at her. \n\nI uninstalled the app before there was an 8th video and just stayed away from the internet for a few days. \n\nI was told that the algorithm needs some time to adjust to the things I'd like to see, but that the app would open up to any of those 3 topics as default was a terrible fucking decision. Ain't no way I'm going to continue on the app long enough to adjust that if I have to weed through that garbage for 3 days.",
   "created_utc": 1698605294,
   "score": 207,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zi8t0",
   "message": "I completely deleted Facebook and have not been on it for over 8 years because of a video of someone hanging a dog that was squirming and yelping, the title of the post read “one like=one punch for these people!” Like Jesus fucking Christ, we really have to post horrific videos just to up our likes?! That wasn’t the first time I had seen a picture or video like it on there, but it’s the one that made me say, “you know what fuck this!”",
   "created_utc": 1698605160,
   "score": 66,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zhgij",
   "message": "When I was a kid I saw a video of some really bad violence against a dog and it instantly brought me to tears and I stayed off the internet for a couple days. Idk why human gore doesn’t bother me that much, but any act of violence towards an animal makes me want to hunt that person down.",
   "created_utc": 1698604867,
   "score": 252,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k700olm",
   "message": "Funky Town was the first post in my reddit feed once",
   "created_utc": 1698611748,
   "score": 31,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zl357",
   "message": "The post I read at 7am about that youtube influencers vagina yeast beer the other day…",
   "created_utc": 1698606192,
   "score": 24,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zsjvh",
   "message": "Directly under this post was a video of a chap chundering into his hands and using it to wash.",
   "created_utc": 1698608887,
   "score": 26,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zjw1n",
   "message": "Two girls and a cup.",
   "created_utc": 1698605756,
   "score": 118,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zdmde",
   "message": "Every time some pissy kid who thinks he’s sherlock holmes responds to a long detailed post with something along the lines of “nice bait.”\n\nLook kid, i know the internet is a sometimes-pretend guessing game for 15 year olds, but adults just use it to fucking communicate. Get ready for this… sometimes people on the internet AREN’T lying to make strangers angry.",
   "created_utc": 1698603486,
   "score": 158,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zdjwq",
   "message": "Seeing the 'Morality is relative' meme with the dude with the uncomfortingly long toes in his mouth",
   "created_utc": 1698603461,
   "score": 20,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k705um8",
   "message": "Just woke up, opened twitter saw a picture of a man laying on the floor with his head shot open during a terrorist attack the day before. I was done with the internet and lost my appetite for that day.",
   "created_utc": 1698613639,
   "score": 21,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zmj5s",
   "message": "There’s a trend on Reddit and X lately of posts showing people getting seriously injured or dying from accidents, gun violence, war, etc. I’m not on Facebook or Instagram so not sure if it’s happening there too. This makes me close the app immediately. I realize some of it is news, but more often than not it’s glorified violence posted to subs or accounts devoted to this shit, with people commenting lol or that they deserved it, etc.\n\nIf you’re reading this and get off on the suffering of others, including victims families, please seek help.",
   "created_utc": 1698606703,
   "score": 103,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zwpgl",
   "message": "The Bud Dwyer tape. I thought it was a video about s__cide prevention... that's not what that was. Not even close.",
   "created_utc": 1698610321,
   "score": 18,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k705k57",
   "message": "I saw a video of a person falling from his bike aside a bus, his head got ran over by a tire and explode like a watermelon, the brain gone at like 30 km per hour",
   "created_utc": 1698613530,
   "score": 42,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6ztmkz",
   "message": "Many years ago, I was probably 13-14, the Russian soldier getting decapitated with a knife. I think it was Chechens",
   "created_utc": 1698609261,
   "score": 17,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zmy46",
   "message": "I was watching a mr nightmare video about the scariest videos on the dark web and he talked about Daisy’s Destruction",
   "created_utc": 1698606857,
   "score": 36,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zdhle",
   "message": "Finding a video of a kitten buried in cement up to its neck when I was like 15",
   "created_utc": 1698603439,
   "score": 69,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k70jd2k",
   "message": "I'm pretty damn desensitized to most stuff. Anything gory or porn, really. But the only time I was horrified was this picture of a woman's pelvic area and it had a toddler tattooed around her vagina (so that the child's vagina was where the woman's vagina was) and the child was screaming and crying. That was fucked up.",
   "created_utc": 1698618885,
   "score": 14,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6z1qam",
   "message": "Anything to do with politics, so many people need to\nDo research",
   "created_utc": 1698599234,
   "score": 121,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zv97d",
   "message": "r/cospenis\n\nClick at your own peril.\n\nEdit: added warning",
   "created_utc": 1698609828,
   "score": 76,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zhbzz",
   "message": "Watching former nhl player adam johnson dying on ice, that did it for me a few mins ago",
   "created_utc": 1698604821,
   "score": 27,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k702gjt",
   "message": "Dont know how I found it, but it was ofc here on reddit. A guy jumped from a building in an attempt to commit suicide, on the way almost down he gets impaled by a pillar(one of those that stand on sidewalks so ju cant drive past them), from bottom and stickin out from his neck/shoulder, and the poor guy survives long enough to get to the hospital and you can even see people laughing at him. Absolutely horrible.",
   "created_utc": 1698612396,
   "score": 34,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zoazk",
   "message": "You guys remember that animation where the girl gets cut open by a lazer? Yep. It was enough for me to close the video and turn off my internet for the day. I saw it like a week ago after years. I forgot how disgusting it was.",
   "created_utc": 1698607348,
   "score": 27,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k70c79e",
   "message": "Youtube telling me to disable adblock",
   "created_utc": 1698616056,
   "score": 25,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6znxe4",
   "message": "First time being tricked into clicking goatse on b3ta.com\n\nEdit: the only time",
   "created_utc": 1698607215,
   "score": 10,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zzasi",
   "message": "I used to watch a lot of actual death videos, basically all related to American military action and related conflicts.   Eventually I saw ISIS set someone on fire.   He died so sowly, only a few minutes I'm sure, but it was so much worse than bullets, bombs, and industrial accidents.",
   "created_utc": 1698611248,
   "score": 8,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k70rzhe",
   "message": "Honestly, when I logged on after Hamas attacked Israel. I just KNEW all of the blowhards that don’t know shit about shit we’re gonna be clamoring for their precious attention by exercising their new role as geopolitical science wizards.",
   "created_utc": 1698622341,
   "score": 9,
   "submission_id": "17j76l2"
  },
  {
   "comment_id": "k6zxfzf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17j76l2"
  }
 ]
}