{
 "submission_id": "17j9bn7",
 "title": "What’s an event in history that is so ridiculous it sounds fake?",
 "selftext": "",
 "created_utc": 1698604458,
 "permalink": "/r/AskReddit/comments/17j9bn7/whats_an_event_in_history_that_is_so_ridiculous/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/17j9bn7/whats_an_event_in_history_that_is_so_ridiculous/",
 "comments": [
  {
   "comment_id": "k6zi3eg",
   "message": "The Erfurt Latrine Disaster.\n\nThe Erfurt latrine disaster occurred on 26 July 1184, when Henry VI, King of Germany (later Holy Roman Emperor), held a Hoftag (informal assembly) in the Petersberg Citadel in Erfurt. On the morning of 26 July, the combined weight of the assembled nobles caused the wooden second story floor of the building to collapse and most of them fell through into the latrine cesspit below the ground floor, where about 60 of them drowned in liquid excrement.",
   "created_utc": 1698605104,
   "score": 77,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zrlio",
   "message": "The Germans and Russians once called a temporary (unofficial) ceasefire in World War 1 because of wolves invading the battlefield. They were displaced from their normal hunting grounds and looking for something to eat, which turned out to be local livestock, corpses, children, and unwary or incapacitated soldiers. It got so bad that everyone stopped shooting at each other for a while so they could hunt them down, proving once more that the threat of being eaten is stronger than any political ideal.",
   "created_utc": 1698608543,
   "score": 99,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zu5bv",
   "message": "The 1904 Olympic Marathon in St. Louis.\r  \n\r  \n32 athletes took part, but only 14 were able to finish - there was only one water station in the entire 26-mile course. The “winner” was later disqualified because they found out he drove half the race in his car. The new winner (the guy who came in second) had to be carried over the finish line by his trainers because they’d been dosing him the whole time with a strange mixture of strychnine, brandy, and egg whites.\r  \n\r  \nSeveral people almost died of internal injuries. Multiple runners stole things from passerby. Most people in the race weren’t even Olympic-level athletes, just amateur runners, many of whom didn’t even have to run a full marathon to qualify.",
   "created_utc": 1698609442,
   "score": 12,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zs5p3",
   "message": "Thomas Crapper actually did invent the first reliable modern toilet. (The kind with a raised cistern.) But the word crap/crapper was already a very old slang term by that point. It was just a coincidence. Or maybe he felt like he had no choice. But crap and crapper have nothing to do with Thomas Crapp",
   "created_utc": 1698608747,
   "score": 44,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zo8k0",
   "message": "The guy who founded Scientology once engaged in a multi-day naval battle with a log. He would then go on to commit an act of war against Mexico.",
   "created_utc": 1698607325,
   "score": 162,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k703hr4",
   "message": "Hannibal saved his army by tying torches to the horns of 5,000 cows and driving them one direction. The Romans thought they were the enemy army and converged on them, while Hannibal quietly snuck his 10,000 man force out of the valley by another route.",
   "created_utc": 1698612779,
   "score": 130,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zgz7c",
   "message": "The Gombe Chimpanzee War.\n\nIt sounds like something right out of a Planet of The Apes movie.\n\nhttps://en.m.wikipedia.org/wiki/Gombe_Chimpanzee_War",
   "created_utc": 1698604689,
   "score": 12,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k7073lc",
   "message": "Operation Mincemeat. \n\nBasically, the British dressed a random dead guy in a military uniform, put fake invasion plans in his pocket, and dropped him on the shore of Spain. The Spanish found the body (and invasion plans) and informed Germany. Germany, believing the invasion plans were real, sent an army to Greece- which is exactly what the Brits wanted, because they were actually going to invade Sicily.",
   "created_utc": 1698614105,
   "score": 202,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zqv7c",
   "message": "The Field of the Cloth of Gold, where an English King and a French one tried to out-bling each other. The fact that two monkeys covered in gold leaf were far from the most ostentatious display is a good indication of how tasteful it was.",
   "created_utc": 1698608284,
   "score": 25,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zxp1m",
   "message": "When two perfectly working pistols failed to fire on US President Andrew Jackson who then beat his would-be-assassin so badly that the presidential security detail had to pull him off to save the man's life.",
   "created_utc": 1698610667,
   "score": 90,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zsssn",
   "message": "The Great Windham Frog War. \nIn 1754 Windham, Connecticut was still a frontier settlement.  One hot night the residents awoke to gruesome sounds that convinced them that the local Indians were attacking. Throughout the night they strove to drive off the attackers with steady gunfire. In the morning they crept out, to find thousands of dead frogs who had spent the night competing for the dwindling water.\nRather than being ashamed, this has become a central part of the town’s character. The town’s symbol is a frog and the bridge is decorated with large frogs at each corner.",
   "created_utc": 1698608974,
   "score": 92,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zv77y",
   "message": "The Four Seasons Total Landscaping press conference. It would have been rejected for an episode of Veep because it was so ridiculous.",
   "created_utc": 1698609809,
   "score": 138,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zmi4p",
   "message": "Russia sending their baltic fleet to fight the Japanese Navy.  \n\n\nYes, the Baltic is on the other side of the planet. No, the baltic sailors had never seen ocean, or naval war, ever. Yes, it was a shitshow. It lasted for months, they attacked everything from Danish fishing vessels to each other, again and again. Thinking the ship next to them was a Japanese torpedo-boat, outside of F\\*\\*\\*\\* Nigeria, it wasnt, it was also Russian. Luckily they were so inept that 99% of all shots fired went into the ocean.",
   "created_utc": 1698606692,
   "score": 139,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k704thf",
   "message": "A heartwarming one: the Christmas Truce in 1914. The whole premise sounds like a sappy Hallmark Christmas film but I'm so happy that it's actually real.",
   "created_utc": 1698613257,
   "score": 226,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zoeqn",
   "message": "The Great Canadian Maple Syrup Heist, the largest ($ value, inflation adjusted) heist in Canadian history",
   "created_utc": 1698607385,
   "score": 146,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zwsir",
   "message": "Ancient Egyptians went on strike building a royal necropolis in the year 1152 BC and were the first to ever strike.  And in a pleasant turn of events, the workers received higher wages and returned to the project.\n\nTo be clear, they were not slaves or anything, just the craftsmen of their time, but I still found it odd that even thousands of years ago there is documented evidence of striking being successful rather than companies attempting to squash down modern strikes.",
   "created_utc": 1698610351,
   "score": 114,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zyfw4",
   "message": "Cadaver synod. New pope digs up the old pope, puts him on trial, finds him guilty, and punished the corpse. For whatever reason they don’t teach you about that in catholic school.",
   "created_utc": 1698610934,
   "score": 112,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zpsz8",
   "message": "Battle of Castle Itter\n\nNazis and American Allied troops going to a castle rescuing some people there",
   "created_utc": 1698607897,
   "score": 144,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k7057uf",
   "message": "Wilmer McLean’s house was involved in both the first \u0026amp; last battles of the US Civil War \n\nFirst Battle of Bull Run took place at his home in Manassas, VA so he moved his family to Appomattox, VA thinking they would be safe but crazily Robert E Lee ended up surrendering to Grant in the McLean’s new home \n\nWilmer McLean was quoted as saying \"The war began in my front yard and ended in my front parlor.\"",
   "created_utc": 1698613404,
   "score": 179,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zkbuy",
   "message": "That thing at Kitty Hawk where 2 guys in a bike shop cobbled together a glider and attached an internal combustion engine and started flying?",
   "created_utc": 1698605914,
   "score": 9,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k703typ",
   "message": "That US Air Force tried to develop a bio weapon that makes people homosexual.  A literal gay bomb .",
   "created_utc": 1698612902,
   "score": 154,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zwenf",
   "message": "King Henry VIII divorcing Anne of Cleves because she didn’t look like her portrait…old timey version of a catfish I guess.",
   "created_utc": 1698610216,
   "score": 76,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zgkeg",
   "message": "The Boston Molasses disaster",
   "created_utc": 1698604537,
   "score": 255,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zyih5",
   "message": "When America went to eat with Spain, the Spanish forgot to tell their territory, Guam. The US sent a single warship to the island where they took 13 shots at the fort. The leaders on the island rowed out to apologize they couldn't return their \"salute\", they had no gunpowder.\n\nThat is why Guam is a US territory.",
   "created_utc": 1698610960,
   "score": 20,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zqmux",
   "message": "Colonel Sanders’ entire life. Look it up on Wikipedia; it’s utterly ridiculous.",
   "created_utc": 1698608200,
   "score": 188,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k706kz6",
   "message": "That time Denmark and Canada (I think) had a \"war\" over an island. Everytime a Navy vessel drove by they picked up the flag of the over nation, planted their own and left a bottle of alcohol.\n\nI heard it stopped not that long ago.",
   "created_utc": 1698613914,
   "score": 55,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zhv4n",
   "message": "When they blowed up that whale and it just made things worse.",
   "created_utc": 1698605018,
   "score": 15,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zw8pe",
   "message": "In the 1600s, Japanese Samurai fought with Mexican soldiers in Acapulco. We know this because it was recorded by the grandson of an Aztec king.",
   "created_utc": 1698610159,
   "score": 144,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zw3qm",
   "message": "People dancing to death in Medieval France",
   "created_utc": 1698610112,
   "score": 186,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zjeoc",
   "message": "Video of President Bush Vomiting on the Prime Minister of Japan Kiichi Miyazawa, January 8, 1992.\r  \n\r  \nActually, there is one event which occurred back in January of 1992, which I as a senior in High School knew would sound like a far fetched tale after enough time had passed. President George Bush, who was 67 years old at the time and on an official visit to Japan engaged in trade talks, would on the morning of January 8, 1992 play a game of tennis doubles with the Emperor of Japan and the prince. Yet just hours later on the same day during dinner with the Prime Minister of Japan Kiichi Miyazawa, suddenly vomit onto the Prime Minister’s lap and then faint. The Prime Minister of Japan was dumbfounded but remained calm. President Bush regained consciousness but took several minutes to do so, he was able to leave banquet on his own, though the secret service personnel were trying desperately to assist. The next morning President Bush would try to down play the event and resume his schedule. Yet the image of the President Bush vomiting in Japan never left the media in 1992. In fact since it was a campaign year, it became an image which was exploited. For the rest of 1992 the image and video would become a source of jokes and though this occurrence of gastric distress really was not humorous in any mature way.\r  \n\r  \nAs time progressed the election ended in a defeat for President Bush, the image and memory of the event began fading. By the mid 1990s it was something you could bring up and most people would remember it. Today, the event is hardly known to many people who grew up long after this time. When I was discussing this event not too long ago, a person thought it was just something being stated as a joke rather than a true historic fact. I realized than, I had indeed been correct when I told my father all those years ago that people would never believe this happened years from now.",
   "created_utc": 1698605580,
   "score": 184,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zru1h",
   "message": "Marvin Heemeyer and the Killdozer. It sounds like something straight out of a movie",
   "created_utc": 1698608628,
   "score": 55,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6ztyds",
   "message": "Pepsi becoming a world superpower has to be up there right?\n\nEdit: I want to add John Macafee's life aswell.",
   "created_utc": 1698609374,
   "score": 230,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6ztur9",
   "message": "The Jackfruit Murder in Travancore\n\nIn 1862, a Koil Thampuran (a husband to a princess of royal blood) was arrested, tried and convicted for murder. The man had attacked and murdered another man, either for stealing or adultery with his wife, using a jackfruit as the weapon on the torso and the private parts. \n\n\nYou can read more about it in the book \"False Allies\", an incredible book by historian Manu S. Pillai.",
   "created_utc": 1698609339,
   "score": 84,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zh365",
   "message": "The battle of changping. It was a battle in pre dynastic China in which the Qin kingdom (before qin shihuang was born) and the Zhao kingdom.\n\nIn this battle 250,000 Qin soldiers were killed and 450,000 Zhao soldiers were killed most of whom were POWs who were buried alive.",
   "created_utc": 1698604730,
   "score": 115,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zvo1z",
   "message": "The last guillotine execution in France took place after the first Star Wars movie was released.",
   "created_utc": 1698609965,
   "score": 29,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zmo9i",
   "message": "Forget which guy did this but he had his army march to the shore of the sea and attack it, like...attack the water...in order to hit Poseidon",
   "created_utc": 1698606756,
   "score": 191,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k7063oh",
   "message": "John “Mad Jack” Churchill was a British officer in World War Two. He’s famous because he brought along a Scottish claymore, bagpipes, and a bow and got the “only confirmed longbow kill of the Second World War.” One time he was with part of his commando unit and a shell exploded and injured everyone but him, so he played a Scottish Jacobite song on his bagpipes until the Germans captured him and sent him to a prison camp. He promptly escaped via a tunnel he dug and almost got to the ocean before he got recaptured. By then, it was April 1945, and the German military was falling apart, so they let him go soon pretty quickly. He’s famous for the quote “any officer who goes into action without his sword is improperly dressed”.\n\nTLDR he led a commando battalion, used a sword and a longbow in the 1940s, was captured while playing bagpipes as his buddies fell around him, and then escaped by digging a tunnel out of a prison camp.\n\nEdit: he also said after the atomic bombing that “If it wasn't for those damn Yanks, we could have kept the war going another 10 years!”",
   "created_utc": 1698613734,
   "score": 75,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zx0r1",
   "message": "The time the British empire and the USA nearly had a war over a pig. \n\nThe British empire and Spain once had a war over an ear. \n\nThe dutch once sailed up the Medway and gave the Royal Navy a bloody nose in its own royal dockyard at Chatham.",
   "created_utc": 1698610432,
   "score": 36,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zgsyz",
   "message": "Tulip Craze",
   "created_utc": 1698604624,
   "score": 127,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zgdze",
   "message": "I’ll go first: the Great Emu War",
   "created_utc": 1698604473,
   "score": 92,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zvc7h",
   "message": "Mormons exist. Really weird considering what an obvious con man Joseph Smith was.",
   "created_utc": 1698609857,
   "score": 177,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zrqiy",
   "message": "Christopher Lee's life",
   "created_utc": 1698608593,
   "score": 56,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zxmcc",
   "message": "[That time a German WW2 submarine had to surface near British ships because someone used the newly installed toilet incorrectly.](https://en.wikipedia.org/wiki/German_submarine_U-1206)",
   "created_utc": 1698610641,
   "score": 29,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k701fdj",
   "message": "The 1985 MOVE Bombing",
   "created_utc": 1698612014,
   "score": 26,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k703yp0",
   "message": "The Ghost Army, during WW2 a unit of American troops and allies made up some fake looking tanks and jeeps using inflatables also making fake radio broadcasts to fool the enemy into thinking we had more infantry than they had and it worked.",
   "created_utc": 1698612950,
   "score": 27,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k705myt",
   "message": "The exploits of the US WW2 Destroyer USS William D. Porter. \n\nIn 1943 while leaving dock she accidentally tore the lifeboats off another destroyer with her anchor. A crewman was later washed overboard by a freak wave and was lost. \n\nShe then formed part of an escort but accidentally dropped a depth charge overboard which exploded and panicked the other ships thinking it was a u-boat attack. \n\nThen during a drill she accidentally launched a live torpedo at the USS Iowa which had President Franklin D. Roosevelt aboard. \n\nThey tried to warn the ship but messed up the signal. Twice. Eventually they were forced to break radio silence. The President on hearing about the torpedo asked to be wheeled outside to watch it explode harmlessly in their wake. \n\nWhen she arrived in Bermuda the entire ship’s company was put under arrest. There was a trial but Roosevelt stepped in and the charges were dropped. Every port the ship docked in after that offered the greeting, “Don’t shoot, we’re Republicans!” \n\nShe did pretty well in the war after that and was eventually destroyed by a kamikaze.",
   "created_utc": 1698613560,
   "score": 27,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k70gzko",
   "message": "Stanislov Petrov literally saved the world from nuclear destruction by not calling in a missile launch when he was in command. He figured it MUST be a malfunction even though all his computers told him it was not.\n\nIt was a malfunction. Had he called it in, there would have been several billion dead.",
   "created_utc": 1698617933,
   "score": 29,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zzyiq",
   "message": "Honestly..... 9/11   \n\n\nI mean who on earth would have thought people would hijack passenger planes and fly them into buildings. Watching it live was like something you'd read out of comic book supervillain arch... yet here we are 22 years later.",
   "created_utc": 1698611487,
   "score": 90,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zhj86",
   "message": "The Battle of Pelusium. In short, Persians held cats hostage, forcing an Egyptian pharaoh to declare war to save them.",
   "created_utc": 1698604895,
   "score": 151,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6ztre2",
   "message": "There's a rock in Lake Champlain called \"Carlton's Prize\".  The British were attacking in Lake Champlain, and in a heavy fog Carlton had his ships attack what they thought was part of the American fleet.  They kept pounding it for an hour before the fog cleared and they saw that they were shooting at a rock.  Meanwhile Benedict Arnold (hadn't gone bad yet) escaped with the American fleet while the Brits were distracted.  I didn't get a close enough look, but it's said that you can still see rust stains on the rock from the cannonballs.",
   "created_utc": 1698609307,
   "score": 44,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zywxf",
   "message": "For the past 30 years, Canada and Denmark were in a territorial dispute over an island that lies halfway between Canada and Greenland. \n\nIt is known as the Whisky War.\n\nIn order to assert dominance, the Canadians would visit the island and leave a bottle of whiskey. When the Danes would visit, they would take that bottle and replace it with their best schnapps.",
   "created_utc": 1698611104,
   "score": 60,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k6zuhqg",
   "message": "brazil and france went to war over lobsters once",
   "created_utc": 1698609566,
   "score": 22,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k706wie",
   "message": "The Norwegian butter crisis of 2011, when Norway ran out of butter.  \n[https://en.wikipedia.org/wiki/Norwegian\\_butter\\_crisis](https://en.wikipedia.org/wiki/Norwegian_butter_crisis)  \n\n\n*The crisis prompted a variety of responses from individuals and organizations in Norway and neighbouring countries. A Norwegian newspaper sought to attract new subscribers by offering them a half kilogram of butter, while students auctioned butter on the Internet in a bid to raise funds for graduation parties.\\[14\\]* \n\n*A number of individuals were apprehended by the authorities for attempting to smuggle butter across the border,\\[15\\] while Swedes posted online adverts offering to drive butter to Norwegians at prices of up to NOK 460 (€59; £50; $77) per packet.\\[16\\] Danish dairy businessman Karl Christian Lund sought to drum up demand for his own butter by handing out thousands of packs in Kristiansand and Oslo,\\[1\\] while Swedish supermarkets offered free butter to Norwegian customers to entice them to do their shopping across the border.\\[17\\]* \n\n*On the Swedish side of the southeastern border at the Svinesund, stores reported selling twenty times as much butter as normal, with nine out of ten buyers being Norwegians.\\[18\\]* \n\n*A Danish television show broadcast an \"emergency appeal\" for viewers to send butter, and gathered 4,000 packs to be distributed to Norwegians.\\[7\\] Danish airports and ferries crossing the straits between the two countries kept a stock of butter in their duty-free stores.\\[19\\]*",
   "created_utc": 1698614033,
   "score": 23,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k70bhc0",
   "message": "In 1982, Larry Walters strapped a bunch of weather balloons to a lawn chair and flew 16,000 feet in the air over LA. That's about half the height of commercial airline cruising altitude. Just a guy up there in a lawn chair taking in the sights. And he landed safely.",
   "created_utc": 1698615781,
   "score": 23,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k70btww",
   "message": "I think Thomas Jefferson and John Adams dying on the same day, on July 4th, 1826, exactly 50 years after the signing of the Declaration of Independence.\n\nMind.  Blown.",
   "created_utc": 1698615914,
   "score": 21,
   "submission_id": "17j9bn7"
  },
  {
   "comment_id": "k70hh6y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17j9bn7"
  }
 ]
}