{
 "submission_id": "17jaarj",
 "title": "What's the most bizarre 'house rule' you've encountered at someone else's home?",
 "selftext": "",
 "created_utc": 1698607134,
 "permalink": "/r/AskReddit/comments/17jaarj/whats_the_most_bizarre_house_rule_youve/",
 "score": 124,
 "url": "https://www.reddit.com/r/AskReddit/comments/17jaarj/whats_the_most_bizarre_house_rule_youve/",
 "comments": [
  {
   "comment_id": "k70jnjd",
   "message": "I cannot sit on the couch at my dad’s house if his wife is home because she will feel “invaded.” She has to have the whole couch to herself. So I get to sit in a dining room table chair.",
   "created_utc": 1698619001,
   "score": 49,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k6zowon",
   "message": "In 1972 we were amazed when a colleague announced that no one would be allowed to smoke in his house.",
   "created_utc": 1698607566,
   "score": 170,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70jnk7",
   "message": "The most bizarre house rule that I’ve encountered was at my friend's place, where they had a strict policy of 'no talking' during dinner, not because of any traditional reason, but because their elderly grandmother believed that a mischievous spirit living in the dining room would learn secrets and cause chaos.",
   "created_utc": 1698619001,
   "score": 233,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70g37c",
   "message": "When I was a child, my mom had a friend who would watch me for an entire weekend, or a week during the summer. She had a daughter that was a year younger than me. \n\nShe was an absolute clean freak. I liked her because she would take me places, but she had a lot of rules. Couldn't wear shoes in her house. Ok, not all that weird... but she would take your shoes to the basement utility sink and scrub the bottom of your shoes. Can't have your pants too long, because they might drag on her floor and get dirt on her floor, so I had to roll up my pants. Can't touch the walls, because the dirt from your fingers might get on her white walls. If it was nice outside, you're eating outside, because your crumbs may get on the floor. She was also an English teacher. Even at 6 years old, I couldn't say \"yeah\", you say \"yes\". Only ignorant people say \"yeah\". Can't say I'm going to take off my shoes. \"Only rockets take off. You REMOVE your shoes.\" Couldn't say \"I'm done!\" According to her, \"only turkeys are done. You are FINISHED.\"\"",
   "created_utc": 1698617581,
   "score": 116,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k6zug5z",
   "message": "Once stayed at a relative’s place where they had a strict \"No Radio Waves After Dark\" rule. Post sunset, WiFi was shut down, phones were powered off, and even the microwave was a no-go zone. They believed that radio waves interfered with sweet dreams. The first night I was there, I felt like I time-traveled to a pre-internet era.",
   "created_utc": 1698609550,
   "score": 193,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k706aj4",
   "message": "If you need to pass gas you have to go outside and all the way to the mailbox.",
   "created_utc": 1698613806,
   "score": 185,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70bt81",
   "message": "No talking about or watching anything that contained “magic.” Harry Potter was banned along with many shows and cartoons.",
   "created_utc": 1698615907,
   "score": 178,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70d2jc",
   "message": "Must be up by 9am and fully clothed. No pajamas or sweats etc.....even if it was the weekend and even if you had no plans to go anywhere or do anything. We would wake up and just sit there.",
   "created_utc": 1698616391,
   "score": 129,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70k3qd",
   "message": "I had a friend when I was a kid and sometimes I would go to he's house. The kids couldn't eat at the table at the same time as the adults, we had to wait for them to finish and leave the table, and we couldn't talk at all at the table. \n\nAlways found it to be weird, always felt a creepy vibe in that family, even thou I was a kid.\n\nEdit: oh, and they pour sugar in coke! Yes, they drank coke with even more sugar.",
   "created_utc": 1698619185,
   "score": 97,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70nfjo",
   "message": "I had a high school best friend who had to change out of her school clothes the minute she got in the door. Her mom was also oddly obsessed with her patting her face dry instead of rubbing it. I guess that’s not a rule, but I can remember 2 separate occasions where she got in trouble for this. Apparently because it ages you (?) but her mother would also buy us smokes, so….",
   "created_utc": 1698620518,
   "score": 151,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70jp77",
   "message": "I met a girl at a new school and she invited me to spend the night and asked me “do you smell bad though? We had a girl over once and she smelled so bad, so my parents wanna know if you smell bad.”\n\nI never went to her house, went home one day and mom said we were moving back to our old neighborhood so i never went back to that school again",
   "created_utc": 1698619019,
   "score": 147,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70upkp",
   "message": "Kitchen hours.\n\nI stayed at a friend’s house when I was younger. Nobody told me the entire family has breakfast at 7am, so I slept in (nobody woke me up either btw).\n\nI wake up around 9am and see my friend is gone. I wander into the kitchen and see them all sitting around the table laughing and eating a huge breakfast - pancakes, eggs, bacon, toast, orange juice, fruit, etc.\n\nMy friend’s mom looks at me and goes, “Hey, look who’s finally awake! The kitchen is closed, but there’s cereal in the pantry if you want to serve yourself!”\n\nSo I poured myself a bowl of cereal and went to sit down at the table, and the second I sat down they all stood up and left the kitchen - even my friend.\n\nTo this day I don’t understand why they did that to me.",
   "created_utc": 1698623488,
   "score": 126,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k706lfk",
   "message": "Grandparents of my childhood friend. We weren't allowed to step on the doorsteps/thresholds. We always had to step over it, never directly on. Still don't know why.",
   "created_utc": 1698613919,
   "score": 227,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k6zq47o",
   "message": "It wasn't a rule as such, but my friend in our early twenties was living in the family home alone as his mum moved in with her boyfriend and she put post it notes all over the house with the rules. Like flush the toilet. Replace the loo roll. Turn the lights off. They were everywhere.",
   "created_utc": 1698608011,
   "score": 169,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70fn1x",
   "message": "Wi-Fi turned off at 10pm. 2 grown adults. No valid reason.",
   "created_utc": 1698617404,
   "score": 112,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70m648",
   "message": "I have friends that don't allow their older teenagers to eat if the parents aren't home , in case they choke. I'm serious. Oh and usually someone is home so they're not starving.  Of course the kids sneak snacks but to have it as a house rule is weird. And they're the nicest people but madly cautious.",
   "created_utc": 1698620010,
   "score": 115,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70ioox",
   "message": "They had a room in their basement that they let the dog shit in if they didn’t feel like taking it for a walk",
   "created_utc": 1698618612,
   "score": 23,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70jhes",
   "message": "My former step father only wanted the toilet flushed if you went number two and only once a day per person. Cheapness is a sickness.",
   "created_utc": 1698618934,
   "score": 167,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k703o1p",
   "message": "Rented a basement room in a house after college for a couple months while my internship finished up. The family said no flushing the toilet after midnight-were VERY clear this was IMPORTANT. Being in college I was a frequent enjoyer of social establishments, so coming home late at night after the bar left me with few options…(sorry downstairs sink!)",
   "created_utc": 1698612842,
   "score": 202,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70054s",
   "message": "Kids arent allowed to sit on the sofa",
   "created_utc": 1698611553,
   "score": 8,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70gyiu",
   "message": "I heard about a woman who, when she went to nursing school, would wash her feet in the toilet every night before bedtime.  When asked why she did that, she said she was from a large family, and they would all line up at bedtime and do this.\n\nThis would have happened in the late 1950s or early 1960s.",
   "created_utc": 1698617921,
   "score": 128,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70lood",
   "message": "Parents that allowed their kids to use the most profane language as long as they used it in a proper sentence.",
   "created_utc": 1698619818,
   "score": 110,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k707l61",
   "message": "I stayed on a friend's house for a few days as a student, and he was adamant I put dirty toilet paper in the corner for the compost, rather than flushing it. I thought he was joking until I used the bathroom and saw it there.",
   "created_utc": 1698614290,
   "score": 118,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70viby",
   "message": "Attended a birthday slumber in middle school for a girl that I wasn’t really close with.  My mom wanted me to go because she knew the girl didn’t have a ton of friends.\nSo, it’s a weekend night, probably a Friday.  We’re all in our sleeping bags on the floor, giggling and talking like most middle school girls do.  Her mom comes in at like 9pm and tells us it’s time for bed and if she hears any of us talking, she’ll call our mothers and make them come pick us up.  Ffs.  Who does that?",
   "created_utc": 1698623828,
   "score": 34,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70qu6n",
   "message": "You couldn't ask for/get a drink half way through a meal, you either had to ask for/get one before you were served or wait until you were done, I could never understand it.",
   "created_utc": 1698621876,
   "score": 63,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70km9y",
   "message": "Once I broke down in front of this old guy's farm. It was late at night so he offered for me to stay but I had to sleep in the bed with his beautiful single daughter. \nIt was freaky weird.",
   "created_utc": 1698619387,
   "score": 81,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70ru0x",
   "message": "A schoolfriend's parents had a rule where you couldn't wee directly in to the toilet water and had to aim for the inside edge of the bowl.\n\nI forgot one time and was never allowed back again because they'd heard me wee.",
   "created_utc": 1698622278,
   "score": 57,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70qlt8",
   "message": "Everyone needed to be patted down and searched  just in case someone was the feds wearing a wire 😂",
   "created_utc": 1698621782,
   "score": 26,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70prfr",
   "message": "My wife stayed home with our two kids, and their various friends were frequent guests.  She was happy to have them over, but she established that she was NOT there to entertain them.  They had quite a bit of freedom to do things, or to do nothing, but if they tried to involve her she would have them clean something around the house.\n\nSo one day our daughter had two friends over, one who knew the ropes at our house, and one who didn't.  The latter started to say, \"I'm bored!\" and the former quickly said, \"Quiet, or she'll put us to work.\"",
   "created_utc": 1698621443,
   "score": 88,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70o6q9",
   "message": "No pda of any kind for anyone. Not like \"no makeout sessions\", but no holding hands between couples, no kiss on the cheek, etc.",
   "created_utc": 1698620820,
   "score": 22,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70q12f",
   "message": "if the lights were on you got yelled at for them being on and wasting energy, if the lights were off you got yelled at for being in the dark",
   "created_utc": 1698621551,
   "score": 19,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70sehv",
   "message": "I have a job that involves going into peoples homes.  I had an inspection once at house where the homeowners insisted that I put on this light blue bath robe  (over my clothes) and white slippers to enter their home.  The husband, wife, and adult daughter who lived with them were all wearing the same blue bath robes.  This was in the US Midwest… just a “typical” American midwestern family so it wasn’t even like a cultural thing that I was unaware of.   I still wonder to this day if they were messing with me.",
   "created_utc": 1698622515,
   "score": 21,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70zq90",
   "message": "Went to a friends house for a sleepover when I was about 7. The rule was: no talking at the dinner table. The dad was in the other room watching TV while myself, friend, his sister and mother were supposed to just eat in silence and the whole vibe was like “don’t anger daddy.”\n\nSuuuuper fucked up and sad to think people live like that.",
   "created_utc": 1698625636,
   "score": 22,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70pgo5",
   "message": "Knew someone who was an engineer for BT back in the 90s. He used his skills to build a household PBX exchange with a billing system.\n\nOnce a month he would present his children with a printed bill for the calls they made.\n\nHe also had a payphone for visitors to use.",
   "created_utc": 1698621322,
   "score": 40,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70vz9a",
   "message": "When I was like 14, my friend was having a Halloween party. I had my period, so I went to the bathroom to change my pad. I wrapped up my old pad in some toilet paper and threw it away. The next day at school my friend said her mom was going through the trash (I guess this was something her mom did 😵‍💫) and she found the wrapped up bloody pad and was angry about it. My friend who was also another girl got in trouble for it because her mom thought it was hers. This was 15 years ago and I’m still so freaking confused by it.",
   "created_utc": 1698624030,
   "score": 17,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70e1ov",
   "message": "This one time my SIL told us to take our shoes off before entering the house and leave our shoes outside so for a brief split second we were walking on her little patio area barefoot. \n\nWhat was weird about this was that this was the first, last, and only time this was asked of us",
   "created_utc": 1698616773,
   "score": 49,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70w3y0",
   "message": "In high school I had a friend whose dad was in the military. Not only did he make us do house chores (dusting, vacuuming, dishes) when visiting/sleeping over but he also woke us up at 6am by banging pots and pans to make us run around the neighborhood. he called it “morning boot camp” needless to say I only slept over there a few times.. I felt so bad for her.",
   "created_utc": 1698624085,
   "score": 17,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70ijdr",
   "message": "A friend of mine growing up would have to be up by a very set time every morning, even on the weekends, and he would have to recite a Bible verse that he intended to apply to his actions that day.\n\nWhat made this doubly weird is that his family wasn't hyper religious at all. Just.....different.",
   "created_utc": 1698618553,
   "score": 54,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70c0w2",
   "message": "If it's yellow, let it mellow. If it's brown, flush it down.",
   "created_utc": 1698615988,
   "score": 78,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70bd6m",
   "message": "A friend of mine has a rule that nobody is allowed to use his frying pan (his wife and kids included).    \nI was staying there for a few days after a surgery and used his frying pan without knowing and when his wife spotted it she quickly warned me nobody is allowed to use that, it's his special frying pan and he doesn't let anyone use it.    \nI laughed and said \"I don't play that childish shit\" when he came in and got all upset about it.    \nBy that time it was too late as I'd finished cooking and was cleaning it.    \nHe then hid his frying pan from everyone.    \nBecause I had the time and have a bit of a malicious streak, and it was only a $40 pan I decided to prank him and I went and bought the same pan from a local store the next day while he was at work. I took photos of myself using it to cook, pretending to clean it with a steel wool pot scrubber, and drilling holes in it with his cordless drill, printed the photos at a local stationary shop and put them in about 20 photo frames around his house, and stuck one to the fridge.    \nHis wife and kids thought it was hilarious, and still have one on their fridge a year later, and anytime we go away together I take one and put in on the fridge of the Airbnb/hotel just to remind him that he's a manchild and it's just a frying pan.",
   "created_utc": 1698615738,
   "score": 244,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70nj6t",
   "message": "once I went to a house and the entire house is just covered in cloths...the parents were raising a big ass rabbit in the kitchen which is also covered in clothes and they have an entire wall of dvds for some reason and we were not allowed to watch any of them...also we were not allowed to move the clothes around",
   "created_utc": 1698620559,
   "score": 41,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70otmv",
   "message": "Staying at a friends house multiple times (she had 5 bro/sisters) and when ice cream was given out after supper, everyone got ONE scoop. \n\nNo,  I didn't ask for more, but inside I was really glad that my mom was always quite generous with 'bowl of ice-cream' proportions!  I learned that some families have limits and I also realized that they did not have a lot of money.",
   "created_utc": 1698621073,
   "score": 46,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70gg0v",
   "message": "You shold go behind the door in the halleay to fart.",
   "created_utc": 1698617720,
   "score": 23,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70usnz",
   "message": "My aunt had a rule that nobody was allowed to use the bed comforters to actually sleep under.  Comforters were just for looks, and had to be removed and folded up before going to bed.",
   "created_utc": 1698623526,
   "score": 9,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70guo3",
   "message": "My crazy, entitled ex aunt made another member of the family walk to the sidewalk to smoke. While this bitch would casually smoke inside. She was also mean to my grandma. Fuck her",
   "created_utc": 1698617879,
   "score": 34,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70f0g4",
   "message": "When I went to my friends house as a teenager, his mom would order pizza but make us sit down at the kitchen table and she would place one slice on a plate for us and then we had to eat the pizza with a knife and fork!😂😂",
   "created_utc": 1698617157,
   "score": 38,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70xhgr",
   "message": "Pretty low on the bizarre scale just something unusual I guess.\nI had a friend whose family dressed up for dinner Sunday nights. Dad and the brothers were ties and a jacket, mom and the sister, fancy dresses. It wasn’t a religious thing either.",
   "created_utc": 1698624675,
   "score": 10,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70in3w",
   "message": "When I was a teenager I went to my friends house and his mom was like “house rules: we’re gonna go around the table and introduce ourselves before we say grace (like hi my name is *x* and I’m *y* years old and I like *z*).”\n\nI got up and walked outside and called my mom to come pick me up.\n\nMf psychopaths.",
   "created_utc": 1698618594,
   "score": 64,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k7032uz",
   "message": "Not allowed to use the poop knife to cut non-poop items. Like wtf? It’s already used to cut poop it’s not like it’s gonna get dirty.",
   "created_utc": 1698612627,
   "score": 94,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70llv1",
   "message": "My mom’s house. Leave the mirrors in the bushes, all pennies stay where they are, no playing music, no cellphones and always apologize to/thank your food.",
   "created_utc": 1698619786,
   "score": 27,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70tbe2",
   "message": "they weren’t allowed to say the “f” word, “fart” 💀",
   "created_utc": 1698622895,
   "score": 8,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70tk5v",
   "message": "My friend’s mom wouldn’t let her put any trash in the bathroom trashcan. There was a trashcan there but it was just there for show (???) They were directed to put all trash generated in the bathroom down the toilet.",
   "created_utc": 1698622997,
   "score": 10,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70xezv",
   "message": "My aunt doesn’t let anyone kill flies in her house \n\nShe also lets rats and raccoons live in her attic because “they have nowhere else to live”",
   "created_utc": 1698624646,
   "score": 10,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70z705",
   "message": "When I was a kid my friend’s dad made his kids line up on the couch and just sit there silently while he watched TV and drank a beer. If you were visiting you had to do it too. When my mom heard about it, I wasn’t allowed to go over there when he was home. My mom knew an abusive weirdo’s behavior when she saw it.",
   "created_utc": 1698625406,
   "score": 9,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k70a99b",
   "message": "My great aunt, who was a lovely, sweet old lady, had an absolute no shoes in the house rule. After your shoes came off exactly at the front door, she'd also want you to wear hospital covers over your socks. She did have a very cool house though, so I do get not wanting to track anything inside.",
   "created_utc": 1698615321,
   "score": 59,
   "submission_id": "17jaarj"
  },
  {
   "comment_id": "k714ihy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17jaarj"
  }
 ]
}