{
 "submission_id": "17ja6t9",
 "title": "What have you always done, but later found out was gross?",
 "selftext": "",
 "created_utc": 1698606828,
 "permalink": "/r/AskReddit/comments/17ja6t9/what_have_you_always_done_but_later_found_out_was/",
 "score": 111,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ja6t9/what_have_you_always_done_but_later_found_out_was/",
 "comments": [
  {
   "comment_id": "k6zwiyn",
   "message": "Looks like the better question would have been:\n\nHow often do you change your bed sheets?",
   "created_utc": 1698610257,
   "score": 27,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70gkb4",
   "message": "All my life I wiped my toothbrush on the hand towel to dry it up until my sister asked what the fuck I was doing",
   "created_utc": 1698617766,
   "score": 98,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k706bns",
   "message": "Not washing behind ears",
   "created_utc": 1698613817,
   "score": 69,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k703xay",
   "message": "As a child I would dig up bits of clay from the local sandbox. It wasn’t as good as play-doh, so I would cast it aside and continue digging.\n\nMaybe I didn’t have a very good sense of smell at that age, because I was well into adulthood before I realized it was probably cat shit.",
   "created_utc": 1698612935,
   "score": 190,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70hve3",
   "message": "I pick my nose (privately then wash my hands). I just can’t deal with a clogged nose \u0026amp; my fingers work better than a tissue ever could",
   "created_utc": 1698618282,
   "score": 212,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k6zwlsy",
   "message": "Chewing on fingernails. Haven’t done it in decades but once upon a time…",
   "created_utc": 1698610286,
   "score": 250,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70ayqy",
   "message": "I flushed my tampons my whole life until I was about 30. No one had taught me they weren’t flushable. I stupidly thought they were like toilet paper.\n\nOne expensive and embarrassing plumbing problem later, I never did it again.",
   "created_utc": 1698615588,
   "score": 6,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k707u3v",
   "message": "Not washing newly purchased clothing items",
   "created_utc": 1698614385,
   "score": 154,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k705yto",
   "message": "Not brushing my teeth when I wake up. I would only brush my teeth after breakfast, and I would rarely eat breakfast. So most days I would only brush my teeth at night. I figured “Well I brushed last night and haven’t eaten anything since, so why should I brush again?” Then I learned about all the bacteria that feed on the tiny bits of food left in your teeth and they literally expel gas and feces in your mouth as they consume it. And this is what causes awful morning breath. So I have this mental image of bacteria poop and farts coating my mouth and have brushed every morning since regardless of eating breakfast or not.",
   "created_utc": 1698613684,
   "score": 34,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k6zwpdy",
   "message": "I didn’t use to close the lid on the toilet before flushing. Oh the sharticles.",
   "created_utc": 1698610321,
   "score": 52,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70i5w1",
   "message": "Never take out my contact lenses.",
   "created_utc": 1698618403,
   "score": 166,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k7076qu",
   "message": "I love to eat the crispy, crunchy white yucca flowers from my yard. \n\nI ate them for years before discovering there are tiny little white waxy worms that live in the flowers and blend in. \n\nI eat other bugs and worms and stuff, but not raw, so I started to wash them out of the flowers before I ate them.\n\nI learned the flowers are nowhere near as nutty and crunchy and delicious without the worms, so now I leave them in.",
   "created_utc": 1698614136,
   "score": 89,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70g5ub",
   "message": "I use my earring to scrape out the muck from under my nails then put the earring back in my ear",
   "created_utc": 1698617610,
   "score": 165,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k7079xm",
   "message": "Put eggshells back in the carton. Didn’t know it was gross because I saw my mother always do it. I can’t believe it took my until last year to realize the error of my ways.",
   "created_utc": 1698614170,
   "score": 255,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70cov1",
   "message": "I was taught to wash my sheets once a month. Realized you’re supposed to do it way more.",
   "created_utc": 1698616246,
   "score": 136,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70bacz",
   "message": "I am 66yo and only learned a week ago that you are supposed to FLOSS FIRST \u0026amp; THEN BRUSH your teeth! I saw something on Reddit about this \u0026amp; I asked my family (3 adult kids \u0026amp; husband). They ALL knew to floss first, brush second  - WHY DIDN’T ANYONE TELL ME??? They just thought what I did was weird but never mentioned it.",
   "created_utc": 1698615708,
   "score": 114,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k6zvr85",
   "message": "Damn redditors are gross.",
   "created_utc": 1698609995,
   "score": 7,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70iqfr",
   "message": "Eating snow, just take the same handful of snow you might see a kid stuff in their mouth and let it melt in a glass. Bet you wouldn’t willingly drink it!",
   "created_utc": 1698618631,
   "score": 62,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70byhs",
   "message": "Used to pluck my eyebrows on public transport.\nSo sorry to anyone who got those sticky little living hair follicles stuck to their clothes and skin.",
   "created_utc": 1698615963,
   "score": 4,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k7083mp",
   "message": "I used to take shits, would wipe for a bit, but if it was taking to long I would just stuff a wad of TP in my butt crack and deal with it later.",
   "created_utc": 1698614486,
   "score": 141,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k708a99",
   "message": "I was in my late teens before I learned you're supposed to wipe front to back not back to front. I was like damn and started doing it the right way. I could never get a good clean front to back. I figured I just needed practice but I did it for 6 months and it never improved. I went back to the way I've always done it. I've never had a yeast infection or UTI. Idk how far you guys are wiping but I don't have an issue keeping the shit out of vagina",
   "created_utc": 1698614557,
   "score": 68,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70n4js",
   "message": "I used to really like those self service lollies/candy buckets with the scoops. They were in most big box stores in Australia, like Kmart, Target, Big W. So much fun mixing and matching.\n\nBut then one day I started working at Target. Every single day I caught old people and kids with their hands directly inside grabbing them out and munching down all slobbery like. Turned me off forever.\n\nThough not too long after they started disappearing from businesses so obviously someone got the unsanitary message.",
   "created_utc": 1698620395,
   "score": 50,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k707var",
   "message": "I'm suffering from hair loss at the moment (51f) and I'm often absent-mindedly raking a hand through my long hair, glancing at what comes out and then dropping the strands on the floor.\n\nJust read on another sub that that's pretty disgusting to other people. I my own defence, I work exclusively from home in my own small office and would never do it in public, but even so - maybe my husband thinks I'm gross.",
   "created_utc": 1698614397,
   "score": 205,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70lu7p",
   "message": "Not me, but my ex would always flush mid pee. I never understood it and found it repulsive. If his pee lasted longer than the flush, he would just flush again. Whenever I would ask why he does that, he just said he’s always done it…. All I could think of is how much stuff would fly up on his hands and genitals. Even after showing him countless studies about what flies up when a toilet flushes, he would never stop that weird habit.",
   "created_utc": 1698619879,
   "score": 165,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k6zou0i",
   "message": "Using a loofah because you don’t wash it like washcloths",
   "created_utc": 1698607538,
   "score": 202,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70pkds",
   "message": "Checking a book out from the library and then settling into bed for a good read. I later worked in a library for approximately a decade and holy shit. Never again.",
   "created_utc": 1698621364,
   "score": 40,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70j1vr",
   "message": "Showered in a dirty tub.  Once I discovered how gross it really was, my hoarder mother didn’t like it when I cleaned the bathroom, so I just lived with it til I was able to get a place.",
   "created_utc": 1698618758,
   "score": 80,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k6zy5s1",
   "message": "I chewed with my mouth open for decades",
   "created_utc": 1698610833,
   "score": 213,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k702vcj",
   "message": "Spitting in public(on the sidewalk, streets, etc.) \n\nGrowing up in a smaller Texas Town, spitting whenever and wherever was a p common thing. It was totally acceptable to be walking down the street, and just kinda spit if you felt the need to. Never really thought anything of it. I didn't realize people found spitting on sidewalks offensive until was about 30 or so. I still to this day don't understand why. I try not to do it as much anymore. But.. if there ain't anybody around bet'chur ass I'ma spit tho.\n\nEDIT: It has been brought to my attention that spitting can be a factor in spreading specific diseases/viruses. After doing some quick research on it, I have found this to be factual. Moving forward, I will be even *more* mindful of my spitting habits.",
   "created_utc": 1698612550,
   "score": 216,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k706xvi",
   "message": "Pee in the shower, shave over the toilet, let my dogs sleep in the bed with me.\n\nI still do it, but I’ve been told those are all gross.",
   "created_utc": 1698614046,
   "score": 50,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k703kn6",
   "message": "Teen years… Getting in bed with *outside clothes* on. Sitting on my bed with outside clothes on. Keeping my shoes on while sitting on my bed, might put my legs on the bed with the covers on but that’s fucking disgusting and it bothers me when anyone does it in movies or my house (because anyone else in the world can do whatever they want — just not in my house).\n\nI’ve made it a rule to change out of your outside clothes before getting into a bed.",
   "created_utc": 1698612808,
   "score": 191,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70e98h",
   "message": "not brushing my teeth every day. \n\ni struggle with life-long dysthymia (basically chronic mild depression), and during the covid lockdown it got pretty bad and i'd straight up brush my teeth every other week, at best. i didn't see the point because i didn't leave my room. \n\ni forced myself to get a thorough professional clean after about a year of this and it felt amazing. i've miraculously never had a cavity, though.",
   "created_utc": 1698616857,
   "score": 236,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k707aa8",
   "message": "Used to keep festival wristbands on for months after they had happened and they got so manky. Always had multiple bands on too. Now I take them off the Monday/Tuesday after as they are just really a nuisance, especially after a shower!",
   "created_utc": 1698614173,
   "score": 3,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70kbg5",
   "message": "Double dipping snacks. Pretty logical but only found out recently that’s very bad etiquette",
   "created_utc": 1698619270,
   "score": 96,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k6zxrhi",
   "message": "Sneeze in my hands........",
   "created_utc": 1698610691,
   "score": 158,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70anwg",
   "message": "Stand up peeing, according to my wife",
   "created_utc": 1698615472,
   "score": 78,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k709uhw",
   "message": "My ex",
   "created_utc": 1698615161,
   "score": 144,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70orp3",
   "message": "Left dishes out in my room. Until I got freaked out at seeing ants everywhere, then I always put away dishes after finishing.",
   "created_utc": 1698621052,
   "score": 20,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k709i3l",
   "message": "Bite my nails. I’d even bite my toenails when I was younger. I’d suck on the biggest nail that I bit off all day. Luckily for me I got Invisalign and stopped the obsession.",
   "created_utc": 1698615028,
   "score": 109,
   "submission_id": "17ja6t9"
  },
  {
   "comment_id": "k70ezk5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ja6t9"
  }
 ]
}