{
 "submission_id": "17jf4ta",
 "title": "What is your “can’t eat at everybody’s house” horror story?",
 "selftext": "",
 "created_utc": 1698620418,
 "permalink": "/r/AskReddit/comments/17jf4ta/what_is_your_cant_eat_at_everybodys_house_horror/",
 "score": 253,
 "url": "https://www.reddit.com/r/AskReddit/comments/17jf4ta/what_is_your_cant_eat_at_everybodys_house_horror/",
 "comments": [
  {
   "comment_id": "k71f9cy",
   "message": "My MIL fished around in the green bin (compost bin) with her bare hands, didn't wash them, WIPED her GARBAGE JUICE HANDS on the tea towel, and then WENT BACK TO PREPPING THE SALAD. \n\nShe also got horrifically offended if I didn't want to eat at her house.",
   "created_utc": 1698632518,
   "score": 62,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71gjc4",
   "message": "Told my dad my sandwich tasted like fly spray at my grandmas house. He didn’t believe me.\n\nTwo days later I catch my grandma spraying the benches “clean” with the $2 fly spray you find at the cheap store.\n\nDad figured it was safe to make sandwiches straight on the countertop because they looked clean. I dragged him over to see and he apologies and took my sister and I for fish and chips for lunch.",
   "created_utc": 1698633106,
   "score": 35,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71cc91",
   "message": "I was babysitting a kid in a pretty dirty house.  I was told to wake him up, supervise bathing and changing clothes, and feed him. I was welcome to whatever was in the fridge.  Ok. The house and his clothes were filthy. Then, when I opened the cabinets, floods of roaches poured out. There were roaches in every opened box and container. I took him back to my house and returned him later that day. I hope the boy ended up in a better situation. I found out CPS got involved shortly after.",
   "created_utc": 1698631180,
   "score": 210,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71l324",
   "message": "my mom tells one about going over to her aunt Virginia's house. she, her parents, and siblings are sat around the kitchen while aunt cooks, and my mom cannot figure out why no one else is having ANY of this incredibly delicious bread that's on the table. she's on her third slice when aunt steps out to do something else, and my mom is told by her brother to go look in the flour bin.\n\nabsolutely filled with miller moth larvae. aunt Virginia had been losing her eyesight for years.",
   "created_utc": 1698635320,
   "score": 81,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70nz7e",
   "message": "When I was a kid, Christmas Eve was always celebrated at Grandma's.  I always got sick afterwards.  Like Merry Christmas, you're going to puke now.  It wasn't until I was all grown up and helping her out in the last weeks of her life that I learned why.  She did not believe in expiration dates on anything!",
   "created_utc": 1698620739,
   "score": 21,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71gzyv",
   "message": "My crackpot aunt served us a lovely tray of deviled eggs, complete with very old paprika sprinkled on top. So old, in fact, the many weevils mixed in it were dead.",
   "created_utc": 1698633326,
   "score": 220,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70oqjk",
   "message": "There was one time I was eating at my bf's house at the time and his grand mother was cooking food. She wasn't feeling well and everyone offered to cook that night but she insisted. Usually, when she's cooking, she doesn't like anyone in the kitchen. Thing is, the kitchen is the first thing you see when you walk into the apartment. So I came from the store to help pick up a few things for dinner. I walked in, saw her blowing her nose with her hand and then used the same hand to massage seasonings into the chicken. She cooked the chicken in the rice. I didn't eat that day and just said I ate before I came over. Some of his family members thought I was rude but I didn't have the heart to tell them since they also didn't like me very much cause I was shy.",
   "created_utc": 1698621039,
   "score": 166,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70oucs",
   "message": "Had a Christmas party at work... Someone brought pasta salad. The bowl was full of cat hair... Some hairs in the salad looked like pubic hair. I wanted to throw up immediately... Unfortunately I'm bad at keeping a pokerface",
   "created_utc": 1698621081,
   "score": 241,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k714sg4",
   "message": "My first boyfriend’s parents invited me for thanksgiving. I came over a few days before Christmas and all the same dirty dishes from thanksgiving were still in the kitchen. I passed on coming over for Christmas dinner.",
   "created_utc": 1698627830,
   "score": 173,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70xf5b",
   "message": "I went to a friend's house after school, he was going to teach a group of us to play d\u0026amp;d. We got there and his house was disgusting. I'm not the neatest person but the carpet hadn't been vacuumed in forever, clothes were all over the place, and dirty dishes were stacked everywhere. I tried to be polite even though the place reeked, but at some point he was like \"who wants snacks!\" He picked up a bowl that was crusted with stuff, splashed in some water, wiped it with a towel that clearly hadn't been washed that decade, and poured chips into it. Then he asked if we wanted to stay for dinner. We did not.",
   "created_utc": 1698624648,
   "score": 163,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71hesl",
   "message": "My grandma made me a food phobic from a young age. Whether it was ramen with moths floating on top, or chunky milk in my cereal it just scarred me for life.  Dinner at her house was always a fight. Not eating her food was not an option. I'm not sire why that was the hill she would always choose to die on, because she was an amazing grandma other than this. Expiration dates aren't a thing. If the cheese was moldy, you cut it off.... I think living through the great depression and raising kids in poverty changed her mindset on food. I mean obviously she's doing something right because she's 91. She must have the immunity of a super hero",
   "created_utc": 1698633519,
   "score": 70,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71gg0t",
   "message": "Sleepover in the 5th grade at a friends house. Her mom made chicken and veggies. I took a bite of chicken and something was off. Flipped it over and the backside was COATED in black dog hair.",
   "created_utc": 1698633062,
   "score": 106,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71ghpd",
   "message": "We have a 73 year old coworker who's a legit hoarder. I'll get to the point without going too far down this rabbit hole. \nYears ago we had a potluck for our crew. As lunch is coming up we are all getting cleaned up and putting all the food out. I go to the bathroom to clean up and I see Ron walk out the stall as he's buttoning up his pants and walk right out. I go to our lunch area and I see him in line and first thing he does is grab a hand full of chips and put it on his plate. I grab that bag and hand it to him. I tell him \"these are yours now\" long story short I tell my boss why I did it and he agreed. After that I never participated in potlucks on the same crew as Ron",
   "created_utc": 1698633085,
   "score": 124,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70pyql",
   "message": "My mom thought that the turkey would “dry out” if you cooked it for the recommended time. We even used the turkeys with the popping thermometers in them and never once did I see it popped, as a kid I just thought it was a turkey button😂 then she would eat the outside of the turkey (that was cooked) because she “liked the white meat and skin” like ma’am there would be a lot more “white meat” and less “pink meat” if you cooked it longer! Sibs and I always got sick after thanksgiving and she’d tell us it was because we were fat and ate too much. Wasn’t until I moved away for college that I found out turkey wasn’t supposed to be pink, I honestly thought I was just allergic to turkey",
   "created_utc": 1698621526,
   "score": 164,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70so1m",
   "message": "Worked as a cleaning-lady.\n\nThere was one woman who had schizophrenia, she was kind, but damn. That house was the stuff you see on tv shows. They should sent a team of professionals.\n\nShe had a rat cage, and I've had pet rats myself, so I asked her about it. She said he had died. \nI took a closer look and the water in the bottle had black spots all over it. The water had gone bad or something. I've never seen water go that bad in my entire life. \n\nThe rat was gone, luckily. But the whole cage was still in there, like the rat had never left.\n\nDecided to do some dishes, they were piling up quite a bit. But she had no clean sponge or clean towels. She also didn't knew where they were.\n\nThere was a spot on the floor where 2 flies were feeding themselves of, as I vacuumed they flew away. \n\nShe asked me if I liked some coffee and just automatically I said yes before I realized what I had done. \n\nRight before she handed it to me she said \"I wonder when I last cleaned that thing... must have been about 2 years ago.\"\n\nI said I forgot I had a cup of coffee at the previous house and shouldn't drink too much caffeine, and excused myself.",
   "created_utc": 1698622626,
   "score": 250,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70poir",
   "message": "A girl I was interested in at the time had cats, I came to her house one day to pick her up for a date and he had a large sack of rice open in her pantry with the pantry door open. One of the cats hopped out of the sack of rice and she just casually laughed at it like “oh they are always getting into things.”\n\nCame over the following weekend that SAME sack of rice was in the pantry and I could hear one of them tussling around in it again, we stopped dating sometime after that but anytime she offered to cook for me I immediately pivoted to taking her out to eat instead.",
   "created_utc": 1698621412,
   "score": 192,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71h2fm",
   "message": "I had to stay at a friends cousins house for a few days(I wasn’t allowed to stay in my own house due to abuse allegations and she was nice enough to take me in) the thing is the house was..hoarder level. I slept on the floor which was covered in clothes and a three inch layer of cat hair(I hope it was cat hair) she fed me macaroni and cheese but I distinctly remember there being green crusts on the noodles and the fork being dirty. Not wanting to be rude I picked out what noodles I could and claimed I wasn’t hungry since I had to leave my home. The milk she offered me the next day was cottage cheese and I politely phoned another friend to ask if I could sleep on their couch because I was finding bugs on my body.",
   "created_utc": 1698633357,
   "score": 83,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k712ylk",
   "message": "I went with my then-fiance to visit some relatives of his. We arrived at their place to find that they were serving up the leftovers of this noodle dish (pancit) that had been their fare the night before.\n\nNow if you know anything about handling pancit safely, you'd know that it goes rancid real quick in hot weather. I could smell that it had gone off, even from the doorway of the house. One of the older relatives knew this too, and bundled some of us to get McDonalds nearby. Those who insisted on eating the pancit got a bit sick later that day. What a mess.",
   "created_utc": 1698627032,
   "score": 249,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71mj1f",
   "message": "I was gonna complain about raisins in the potato salad but the other comments on here are scary.  OMG",
   "created_utc": 1698636056,
   "score": 145,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71fyuh",
   "message": "My parents owned and rented a few mobile homes back when I was a kid. For many years, this older couple and their two boys lived in them. We would hang out after school, on the weekends, we were good buddies, but I could never have a sleep over at their house. For months I begged, and eventually my parents said yes. That night we made microwave pancakes. We went to their bedroom with our food and eventually I sat my plate down to go to the bathroom. When I returned, my plate was COVERED in cockroaches. Apparently they had lived in multiple of my parents trailers, and they had to spray and fumigate every time they left. My dad said that I just couldn’t get the message and apparently had to learn the hard way… These people were very nice people and my parents apparently helped them out whenever they could, hence the infestations in multiple units. Still today I think about how many roaches probably crawled all over me that night…\n\n\nBonus story: My grandpa was life long friends with this guy, like grew up in the slums together. He always told me horror stories and would never go in his house. Well, my grandma used to babysit for this couple and one day she for whatever reason, had to drop the baby off at my grandpa’s friends house so his wife could help her out. When she came to pick the baby up, she said this” they had a dog chained to a piano leg inside the house. It had ran a circle in the carpet, and damn near pulled the leg off. There were ketchup stains on the ceiling where someone had smacked the bottle and it shot ketchup out.” Apparently when she got there, the lady couldn’t find the baby, and it had somehow gotten under a pile of clothes.",
   "created_utc": 1698632840,
   "score": 168,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k7151xz",
   "message": "My own parents, or sisters, or any of my brothers houses.   There all the same, dirty dishes in the sink with water backup, has dead flies in it, mold growing around everywhere. Fly poop and mouse poop on everything.  The food they cook isn't fit for human consumption, nor would I let the dogs or hogs eat it.    \n\n\nThe parents and sister \"took\" care of my grandparents for a while at my grandparents house.  That ended when I showed up unannounced and found mouse poop in all the cupboards, dirty dishes and food spoilage in the fridge.  I notified the right people and got the parents and bio-sister ousted.  They brought in a new woman to cook and clean.   My daughters and I did a military grade field day on the Grandparents house.  We scrubbed human poop (baby) from the ceilings and walls. Vacuumed and steamed floors. Annihilated the kitchen, and bathroom with chemical warfare levels of bleach.  Tossed out a bunch of old and spoiled food and hand washed EVERY dish in the house. To this day is something I want to kick my dad and mothers ass over.  They were incompetent care givers.   \n\n\nThe grandparents loved the new girl and the cleanliness she brought with her.   Grandmother was a neat freak and always kept a clean (lived in) house.  Grandfather tried his best.   My own parents and siblings are slobs of their own making.  Grandmother tried and the cleanliness only stuck with me.  (Alright, so maybe the US Navy drove sanitation into my head as well)",
   "created_utc": 1698627946,
   "score": 139,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71fpu6",
   "message": "I visited a friends house who was living with his mother, she asked if I wanted a coffee and I said I would, upon getting to the bottom of the cup and taking the last few gulps I found there was a used bandaid stuck to the bottom…never ate or drank there again.",
   "created_utc": 1698632724,
   "score": 168,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71eacv",
   "message": "My narcissistic mother would fake illnesses and not leave bed for months. There was also a portable toilet next to the bed. She hadn’t showered in months and has highly questionable hygiene habits. Last Christmas my now husband and I were visiting and she said she made the meatballs. I brushed it off because she’s highly delusional and typically my dad cooked anyways. \n\nTurns out my dad brought her the raw hamburger and supplies to make the meatballs in bed to make her feel better. She made the meatballs with her dirty hands next to the portable toilet. I found this out months later. We are now no contact for other reasons. But I am thankful my husband and I will never risk eating her sketchy meatballs again.",
   "created_utc": 1698632065,
   "score": 127,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71h4a2",
   "message": "My colleague always brings me food to work. I work in a hair salon, inside of a hair salon, if that makes since. She owns the main salon and I have my own small salon. We share an entrance and backroom. I always knew she was a bit of a slob, but when  I saw she used the same sponges to clean the dishes she served me from to wash counters, hair color bowls, bleach bowls and sink basins  I couldn't do it anymore.  The thought of eating from something with bleach, Ammonia,  hair color, counter dirt  and the shampoo bowl grime was too much for me",
   "created_utc": 1698633381,
   "score": 163,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71b79h",
   "message": "Saw Linda from billing on that show hoarders. Her kids had her do the show not realizing she had a very legit career outside of her home. \nShe stopped coming to work, I stopped participating in Potlucks",
   "created_utc": 1698630665,
   "score": 75,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k70zjhb",
   "message": "\"Have you ever went over a friend's house to eat and the food just ain't no good\"...",
   "created_utc": 1698625555,
   "score": 27,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71b909",
   "message": "When I was a kid, my sister and I were great friends with the kids that lived next door. We mostly played outside and would spend time at whatever house we felt like at the time.  I went to their house early on a Saturday once when they had just finished breakfast and were cleaning up. They were pouring the milk out of the glasses the family had been drinking out of right back into the milk jug. They had 6 kids so I guess they had to be frugal.  I never ate there, not with the thought of backwash milk in my head.",
   "created_utc": 1698630687,
   "score": 63,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71kmnj",
   "message": "Not my story but my husbands. Before we got together in high school, he had to live at a girlfriend’s house because his dad was in jail. He was making breakfast one morning, eggs and toast, and one of their dozen cats jumped up onto the counter, and proceeded to pee into the toaster.",
   "created_utc": 1698635093,
   "score": 57,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71kdya",
   "message": "Listen up, because I’ve got a story that’ll make you swear off potlucks for life. Meet Carol. She’s that office angel who brings cookies on Fridays and rescues the printer. We all love Carol. Carol decides to host a dinner party and, let’s be honest, we’re all expecting this to be the food equivalent of a TED Talk—inspirational and enlightening.\n\nWe get there, and Carol unveils the main dish: her “World-Famous Tofu Casserole.” Now, I’m no food snob, but this thing looked like it had already been eaten and returned to the plate for round two. Being the brave (or stupid) soul I am, I took a scoop. First bite, and it’s like my mouth got ambushed by the ghost of expired vegetables and tofu that had given up on life. It’s so bad, even the dog won’t touch it, and this is a creature that eats its own vomit.\n\nBut wait, it gets worse. I’m trying to power through when I hit something crunchy. I dig it out and find—no shit—a whole-ass acrylic fingernail, complete with chipped glittery nail polish, looking up at me like the Eye of Sauron.",
   "created_utc": 1698634972,
   "score": 144,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k717eu2",
   "message": "A lady I knew told me a story about how they were at a potluck and halfway through one of the other ladies started talking about how she uses a crockpot to autoclave her sex toys and menstrual cups. \n\nNo one was able to get her to clarify it wasn't the same crockpot she brought food in.",
   "created_utc": 1698628979,
   "score": 94,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71kmr0",
   "message": "My BIL sweats alot.. He sweats ALOT. We're Italian and there's always lots of cooking, sauce, etc on holidays. My mom and I went to my sister's and watched him standing over the sauce, wiping the sweat from his head, and saw sweat dripping in the sauce.. It was disgusting. We always eat before we go there and we also will order catered items to bring with us for everyone. We don't eat anything that's cooked at my sisters anymore. I'm getting nauseous thinking about it.",
   "created_utc": 1698635095,
   "score": 215,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71svst",
   "message": "I had a small circle of co-workers that I was friends with, and we would occasionally hang out together outside of work.  One of those co-workers was Lisa, a mid/late 40's woman who was single, but had a couple of little yappy dogs and several cats.\n\nLisa invited several of us over to play board games, and said she would cook us dinner.  We got there while she was still cooking, and were standing around the kitchen talking to her while she finished up cooking.\n\nWe all about shit our pants when she took the spoon out of the pot of spaghetti sauce she was cooking, tasted it, and then casually held it down for her 2 little yappy dogs to lick the spoon, and then stuck it right back in the pot of spaghetti and continued stirring it like it was the most normal thing in the world.\n\nI am not sure how the rest of them got out of eating it, but just before we were supposed to sit down and eat, I faked an emergency call from work and said I had to run in to the office and deal with a problem, and got the hell out of there.  I was always \"busy\" every time she invited us over after that (and NEVER ate anything she ever brought to an office pot luck)",
   "created_utc": 1698639651,
   "score": 27,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71fune",
   "message": "Oh man, I’ll probably get shit for this but when I was in the military our plt sgt invited a few of us to dinner. She was having chemo and her hair was falling out, somehow there was so much hair in the lasagna it was like having hair spaghetti 😭 I felt so bad but definitely didn’t couldn’t eat it",
   "created_utc": 1698632786,
   "score": 108,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71d8ng",
   "message": "This is a family story. It happen when I was a baby so no memory. It was a family thanksgiving pot luck style. Everyone brought one dish plush a drink to share. One of my aunts by marriage brought mash potatoes. \n\nShe let it slip that while cooking she ran out of milk. So instead of having her husband run out to try and get more: she used her own breast milk. No one touched it but her, my uncle, and the older kid. \n\nAfter that it was a rule of thumb; if she Made it don’t eat it. Mind you after my grandma died in ‘07 we haven’t had any family holiday get togethers like that since, so no worry there.",
   "created_utc": 1698631585,
   "score": 254,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71gbjl",
   "message": "Went to a barbecue on my uncle’s farm decades back. We used to have Christmas and Easter dinners there, so I didn’t think anything of it.\n\nUnfortunately, the guys were doing the grilling - *not* my aunts. Lots of farm guys don’t have the greatest hygiene and I think whoever made the burgers had been in contact with some “bio hazardous matter”, if you catch my drift.\n\nBy the time I got home, it was coming out both ends. Couldn’t eat for almost a week, I heard a lot of people ended up ill. I don’t touch anything that isn’t prepackaged if I’m there now.",
   "created_utc": 1698633004,
   "score": 73,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71dipr",
   "message": "It's more of a comedy than horror. \nWhen I was a toddler, we lived near a friend of my mom's whose husband was Mexican; he worked at a local farm and they would often have his coworkers over for dinner. My mom and I were invited over often and the men used to call me over to each of them and hold out a forkful of food for me to eat which my mom, once she spoke with her friend to understand, told me I could do. \n\nWell, one of the men was used to feeding his kids jalapeño pieces and, not considering that I was raised on a lot of German dishes, thought I could handle it. I could not and he still got hugs from me but I never trusted him with feeding me again. 🤣🤣🤣",
   "created_utc": 1698631712,
   "score": 242,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71e83z",
   "message": "I was working as an interior painter during my college years. This middle aged man put a container of strawberries in the sink, then proceeded to trim his nose hairs over that same sink with an electric trimmer. He rinsed the strawberries and then offered me some.",
   "created_utc": 1698632036,
   "score": 186,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71ppwo",
   "message": "In college we had a few friends that would take turns making dinner. One of my friends made a strawberry spaghetti cinnamon sugar thing as the main course, ate Taco Bell on the way home and never participated again.\n\nMy aunt makes \"Mac n cheese\" w American sliced cheese over ziti ( no sauce) \n\nMy grandma could fuck up hotdogs and she did. When I was a kid I stayed there for a week and lost like 10lbs just ate salad. Her \"chicken soup\" tasted like the chicken took a bath in the pot and left. Fucked up tuna salad even, poured like idk how many tbsp of salt in it, twitched while I had a few bites",
   "created_utc": 1698637781,
   "score": 184,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71uxj5",
   "message": "I used to help an old neighbor out w grocery shopping, I’d drop the bags at her door and she’d give me a check for the amount of groceries.  She’d give me homemade cookies once in a while, chocolate chips.  I didn’t ever eat them because one time I caught sight of her apartment-it was a large studio, a small kitchen and tv and bed/couch.  And about 20 cans of cat food, half eaten and 1 million flies and small maggots in diff stages of growth, dishes w crusty food stuck to them, and a wall of empty beer cans.  After I saw that, and got a whiff of her apt, I started helping her w taking garbage out and putting groceries away, cleaning out her fridge and making sure her cat was healthy.  A couple months later she got Covid, ended up at rehab facility and passed within 2 weeks.  \n\nSome people need help and a little company…",
   "created_utc": 1698640971,
   "score": 154,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71k9v0",
   "message": "When I was a teenager I went to a new friends house and his dad made “burgers” for us. Essentially just rolled up a big hunk of Hamburg and threw it on the grill for 10 seconds. It was cold raw in the middle. \n\nThat wasn’t even the worst part. I was staying over that night and at one point I asked to use his computer. He forgot to close his current search window and it was full of CP… I waited outside for 3 hours until my ride showed up and called his brother the next day about it",
   "created_utc": 1698634916,
   "score": 70,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71kvgu",
   "message": "I’m a germaphobe \u0026amp; I cannot eat at my friends house.  but every single dish, cup \u0026amp; fork has dried food on it bc the dishwasher didn’t clean it all the way. But it’s “clean” bc the dishwasher “sanitized it.” Don’t get me started on her reusable straws. \u0026amp; if u don’t find a plate with dried food on it, you’ll find dog hair. \nOh \u0026amp; they used the same sponge to clean the dog bowls, the sink \u0026amp; coffee mugs. Just no.",
   "created_utc": 1698635215,
   "score": 168,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71mtu7",
   "message": "My inlaws leave food out on the table, and then expect you to eat it until the dish is gone. \n\nLike, on monday lunch might be a pork fried rice. The leftovers stay on the table and you eat more for dinner, then overnight it stays on the table and you eat it for lunch again. They do the same thing with seafood, chicken, any dish, any weather, its staying on the table. And if for some reason food is leftover after 2 days, instead of throwing it out, my inlaws will add it to the new dish theyre cooking (eg. 3 day old chicken thats been on the table during summer will get added to a stirfry)",
   "created_utc": 1698636209,
   "score": 100,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71hx9n",
   "message": "Stayed at a college football teammates house the night before we left for a spring break cruise. everything seemed perfect at first. We got a free ride from campus to their house (8hr drive) and free tickets to a playoff hockey game (their team won). They had 3 free beds for us in their bonus room but lo and behold they were covered in cat hair yet we saw no cats (bc it was late at night). After waking up red eyed and itchy, we went downstairs for breakfast before heading out and noticed cats jumpin on the kitchen counter. After surveying the house and screened in pool outside (Florida) cats were everywhere. After the mother made us a breakfast quiche and shewed 4 cats off the kitchen counter, we asked so \"how many cats do you have?\". Oh we have 27, but this one (points to the one of aforementioned cats that was on the kitchen counter) has HPV so we try to keep it separate from the others. Needless to say, I only drank bottled water that morning and vowed to book a hotel if for some reason we got stuck in our departure city again post cruise docking.",
   "created_utc": 1698633760,
   "score": 149,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71i6dc",
   "message": "I went to a friend’s house after school. She was going go make us toast. \nwent to put the bread in and realized there was already bread in the toaster. Pops it up and it’s covered in mold. A lot of mold.",
   "created_utc": 1698633882,
   "score": 162,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71g7ix",
   "message": "My dad's house. I stayed with him once and on the first day, he took some ground sausage out of the freezer to thaw for dinner. He put it on the stove in between the burners to thaw. He said the heat from cooking breakfast and lunch would make it thaw faster. He moved it to cold water in a bowl, but according to him, that was to appease me because I'm a \"germaphobe.\" \n\nHe also has a habit of scratching his belly and back almost constantly, even dipping into the waistline of his shorts in the back to scratch and never washes his hands. I asked him about it because I saw him doing it while he was making breakfast, and he said very defensively IT'S NOT LIKE I'M SCRATCHING MY ASS CRACK, JUST MY LOWER BACK. \n\nSo yeah, that was day one, and I made myself scarce at mealtimes the whole time I was there.",
   "created_utc": 1698632953,
   "score": 182,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k712nt4",
   "message": "Our neighbors are Pakistani/Indian and we are friends and have dinner at each other's house a couple times a year, taking turns. My wife is half Italian and she's an excellent cook. She makes amazing Italian food. But when they eat at our house they hardly touch anything. Even a nice simple homemade spaghetti and marinara.  And when we eat at their house we hardly can handle their food either. Sometimes they take us out to their favorite local Indian restaurant and we LOVE the food there. And when they have a party and they have the food catered, we also really enjoy it a lot. But when we eat at their house, the homemade Pakistani/ Indian food is almost impossible for my white boy stomach to handle.",
   "created_utc": 1698626900,
   "score": 116,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71hjw9",
   "message": "So, I visited my neighbor’s place, and their wall was adorned with a massive portrait of their pet iguana – not the family, just the iguana. Then came dinner, and they served “Ketchup Carbonara” (yep, ketchup instead of marinara) and, for dessert, “Chocolate-Covered Pickles” – yes, pickles dipped in chocolate! Let’s just say, that night, my taste buds had an identity crisis, and I learned the hard way that you can’t eat at everyone’s house, especially if they’re pet portrait enthusiasts with a culinary flair for the bizarre!",
   "created_utc": 1698633586,
   "score": 164,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71qzqm",
   "message": "Recently at my mother in laws. She asked for a jar of Alfredo sauce from her cabinet. Grabbed one, a year expired. Grabbed another, two years expired. The oldest I found expired in 2018. There was also a day recently where she wanted me to make taco meat out of ground beef. I opened the meet and it smelled rancid, like totally rotten. She smelled it “oh it’s fine that’s just how ground beef smells”. She tried to make me cook it and I refused. No wonder her autistic daughter accidentally shit in the pool this summer if she’s cooking expired foods just because she’s cheap and doesn’t want to replace something if it’s bad. Had to tell my 9 year old that I don’t want him eating at nanas house anymore.",
   "created_utc": 1698638502,
   "score": 168,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71lkw6",
   "message": "My friend told me that she put whipped cream on top of a cheesecake solely to hide the footprints her cat left when he stepped on the cake. I never ate anything that she baked from that moment forward",
   "created_utc": 1698635570,
   "score": 197,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71d7ge",
   "message": "Got food poisoning after eating at a relatives house one Easter (wasn’t the only one either). Was in and out of the hospital multiple times in a 2 week period. Couldn’t keep anything down, lost a little over 20lbs, was very very bad.\n\nI no longer will eat anything at anyone’s house unless it’s takeout. I don’t trust anyone’s cooking skills unless they do it as a job.",
   "created_utc": 1698631571,
   "score": 166,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71kpkr",
   "message": "I stayed the night at a friends house and in the morning when I went I pour myself a bowl of cheerios there were tiny roaches in there. When my friend told me to just pick them out and eat it anyway I called my mom to pick me up and never went back.",
   "created_utc": 1698635134,
   "score": 136,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71dufe",
   "message": "When I was a kid my neighbor friend invited me over for a spaghetti dinner and sleepover. Her mom wanted help cooking (big family). She had us open 6 cans of Campbell’s Tomato Soup and scoop them into a pot. She added about a cup of sugar, a little bit of browned gr beef, water, and the noodles then cranked up the heat on the stove. No way. She said it’d be ready in an hour. Within that hour I developed a bad stomach ache and went home to eat with my parents. 🤮",
   "created_utc": 1698631860,
   "score": 205,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k717prg",
   "message": "3 words Ground Beef Pate",
   "created_utc": 1698629111,
   "score": 88,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k7181z5",
   "message": "My distant uncle's wife couldn't cook or use seasoning to save her life, so I would pretend to eat it then give it to the dogs. My aunt got a text from said uncle saying he caught me on camera feeding the dogs and that he didn't feel comfortable with me staying over at the house anymore. MF why do you have cameras in your HOUSE??!!",
   "created_utc": 1698629260,
   "score": 249,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71hu2m",
   "message": "Went to a party last week where the hosts put out food to snack on throughout the day. And not just like fruit/veggie trays and chips. Like...whole rotisserie chickens and trays of pulled pork. They just kept telling people to microwave it when it got cold, and by the end of the party (2 am ish), at least two people were sick from eating meat that had been sitting out since about noon.",
   "created_utc": 1698633718,
   "score": 99,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71m461",
   "message": "Friend grilled for his family and literally everything was undercooked. The chicken was room temp and slimy and the asparagus still had debris on it. My other friend and I just sat back stonefaced as they ate everything and thought nothing wrong",
   "created_utc": 1698635845,
   "score": 93,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71rsaw",
   "message": "I dated a girl once that thought it’d be a nice idea to bake some muffins. She forgot to wash the muffin pan. Do you wanna know how I know she forgot to wash the muffin pan? Because we had a mouse problem and there was mouse shit in the muffins, not funfetti.",
   "created_utc": 1698638976,
   "score": 146,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71ue1j",
   "message": "Thanks to the stories here, i lost my appetite for the remainder of this year.",
   "created_utc": 1698640612,
   "score": 106,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k722v5m",
   "message": "Neighbor invited me and couple friends over for pan fried steaks with mushrooms. He answered the door wearing the same swimming trunks and torn, filthy t shirt as the day before and barefoot. Those trunks with their netting inside really hold on to swampa*s and ballsweat stink and it was obvious he hadn't showered or washed the clothes. No dish soap on counter. No hand/bar soap or toilet paper in bathroom. Someone notified him about lack of tp or soap and he said he just jumps in the shower after he poops. There's no soap in the shower either. \n\nI didn't eat. Everyone else spent the next 24 hours vomiting into trash buckets while they ejected from the other end on the toilet. Later he confessed they were mushrooms he'd foraged himself. They all got lucky the idiot hadn't served them something deadly. No idea what they were. Was it food poisoning or a toxic mushroom? Idk but don't you eat at people's houses unless you're certain of their food safety precautions. Some people are too stupid to be trusted around food.",
   "created_utc": 1698646798,
   "score": 163,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k717xur",
   "message": "When we were just starting out, my first wife and I were invited to a couples house for dinner. Being polite (Also not knowing any better) we accepted and sat down to a nice home cooked spaghetti dinner. Now, every young couple we knew made a version of \"basic ass white people pasta and sauce\". Dry pasta, boil and drain, sauce from a bottle and meat, toss it all together. Maybe make a version of garlic bread if yer fancy. This did not occur. Wet ass poorly drained noodles, sauce and meat together until the meat basically boiled through and sugar...heaps of it in the sauce. To top it off, yeast rolls (A family recipe!!) that I would have sooner taken to a riot and used to smash windows with. Shockingly enough, rich only kid and his head cheerleader wife did NOT, in fact know how to cook. How polite were we? Two duty stations later we wound up at their Christmas dinner and no, their culinary skills did not improve.",
   "created_utc": 1698629209,
   "score": 255,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71aoz3",
   "message": "Knew someone who’s mom had a freezer of really badly freezer burned meats and veggies. And would make large …. Casseroles of “shepherds pie” or … “Mac n beef” … she would be SOO offended if I didn’t eat dinner. The anxiety and pressure. Ugh",
   "created_utc": 1698630436,
   "score": 142,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71nbog",
   "message": "A friend’s mom poured salt on my mac and cheese. She later called my mom and said I must not like mac and cheese very much, because I didn’t really eat it. (It has always been my favorite food of all time). My mom asked me about it and I felt awkward that it merited a call home.",
   "created_utc": 1698636472,
   "score": 97,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71og0c",
   "message": "Recently, our friend had to move his family in with his in-laws due to financial reasons (single income, rent was going up, want to save up for a house) and he found out his mother in law will cut raw chicken with kitchen scissors, and then put them back without washing them. Apparently she has been doing this for decades",
   "created_utc": 1698637076,
   "score": 103,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71un8y",
   "message": "One time I had dinner at a friends house. They never have drinks with their meals. They wait until everyone is done eating, then they clear the table and THEN they each have a glass of water.\nI was sitting there, eating a very potato heavy dish so I was dying for a sip of water eventually 😂\nI have no idea why though",
   "created_utc": 1698640780,
   "score": 27,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71ws1x",
   "message": "I slept over at a friend's house when I was in middle school, it was really dirty and trashed and also had this bizarre, powerful funk I couldn't identify, but I didn't think much of it.  At the time I had a bad habit of getting up in the middle of the night for a midnight snack, so I went into the kitchen cause they had left the leftovers from dinner out and a kid don't know any better.. I hit the lights and man every plate, dish, item of silverware, etc on the table was absolutely covered in cockroaches.  They didn't even run when the lights came on cause they knew they owned that house.  I somehow managed to turn the light back off and retreat to the living room before emptying the contents of my stomach and curling up in a ball imagining every stray itch or other sensation to be bugs crawling on me for the rest of the night.  This is why I have a serious phobia of bugs.",
   "created_utc": 1698642229,
   "score": 150,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k723orx",
   "message": "I was at a friends house pretty late, and his mom asked if I wanted to stay for dinner. I ended up staying.\n\nI was told we were gonna have \"Spaghetti and meat\". I know, I can hear what you're thinking. \"Surely you mean meatballs?\". My names not Shirley and that's what I thought.\n\nShe told us to go play and 15 minutes later she was calling us. I was naturally confused because I know Spaghetti takes longer than that. We rush inside and what I was served sure as hell was not spaghetti. Sitting in front of me was a plate of stone cold, wet spaghetti noodles, covered in ketchup with chunks of cold spam.\n\nI ate like 2 bites and was full. But they happily gorged themselves on this insult to Italian cooking. But it did finally explain why my friend hated coming over to my house when my Mom made real spaghetti. He thought that was 'fake' spaghetti. First and last time I ever ate over there. My Mom did not believe me until he visited again and confirmed it.\n\nAs an adult I asked him what in the hell that was and he said it was real spaghetti... And that he eats as an adult regularly and despises \"fake spaghetti\" as he calls it.\n\nYou might be thinking they were poor, they were not.",
   "created_utc": 1698647479,
   "score": 207,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71gj9f",
   "message": "Went to a birthday party once and they had some very bland looking side dishes. Chicken came out of the oven looking pale and with some blood stains. Chicken had like a rubbery slimy look. I looked at my wife, she looked at me and I covered it up with a napkin as soon as I was not being looked at and put that shit in the trash. Went to Wendy's as soon as I could.",
   "created_utc": 1698633105,
   "score": 97,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71jres",
   "message": "Went over to my brothers friends house. They asked if I want a glass of coke, said sure. As soon as I brought it near my face I noticed a horrible smell. I don’t think they washed their cups at all. I wanted to sit down on something but everything was absolutely covered in dog hair and faeces. Also went over to a colleague’s place the other day and used the toilet and when I finished.. there was no soap to wash my hands with? I discovered this fact five minutes before they served dinner. Surprisingly I didn’t get food poisoning",
   "created_utc": 1698634658,
   "score": 92,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71p0ov",
   "message": "So last year my whole family was at our camp at the reservation for the weekend. We’re out there cooking lots of food and chillin. One of the pots was chicken and dumplings. My uncle had grilled a bunch of chicken and brought my aunt a bowl and said “any chef would be awful sad to see this go to waste”. All I saw was some kind of yellow liquid in it and she walked right over and dumped the bowl in the pot of already cooked noodles. \n\nDinner time comes and we’re plating everything. As I’m scooping food into bowls I’m like “what the hell smells like dog shit?” I’m looking all over. They tell me it’s the feta in the salad. No way. It was 10x worse than that. So we’re in the screen house eating and I go to take a bite of the noodles and immediately throw my head back. It smelled like literal poop. I’m looking at all the bowls of what would be chicken and dumps and they’re eaten and empty. I felt like I was the crazy one. I turned to my girlfriend and quietly whispered “did you not smell or taste the shit stench on these noodles!?” She side eyes me and says “I didn’t notice it until I was done..” oh man I was freaked. \n\nSo to cut it short, my absolute moron of an uncle gave my aunt a bowl of chicken MARINADE to throw in the pot of cooked noodles. Marinade. Not broth. I was stunned. So to make this a “we don’t eat at others peoples houses” story, I then learned that they regularly put the bowl of MARINADE on the table and DIP THEIR CHICKEN IN IT WHILE THEY EAT. Fucking disgusting! So there’s my story.",
   "created_utc": 1698637394,
   "score": 51,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71g5nl",
   "message": "Having food allergies. The list of houses I can eat at is very short.",
   "created_utc": 1698632928,
   "score": 68,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71sa79",
   "message": "Had a friend several years ago who lived with her parents. She always told me not to go in their kitchen because it was “unfinished”. This was weird to me as the rest of their house was completely fine. One day, my curiosity got the best of me, an opportunity presented itself and I stepped inside. Low and behold it wasn’t unfinished… just filthy. Dead rat in a sink of old dirty dishes, dog pee and poop on the floor, old moldy food sitting in pots and pans on the counters. Never even thought about eating anything from there again.",
   "created_utc": 1698639283,
   "score": 101,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71vrhf",
   "message": "My cousin’s SIL was a stripper and had a bakery business on the side - she always offered to make cakes for some family members’ birthdays too. She made a cake for her niece’s birthday party - beautifully decorated and smelled delicious. The SIL told us she made it after getting home from the club earlier that morning and hadn’t slept yet. Every time she cut a piece of cake, she slapped it on her hand to put on the plate and licked her fingers EVERY. TIME. Some people didn’t see or care about how she served it and ate a piece - including one relative who found a thick curly hair in her piece of cake. Barely anyone would eat it after that.",
   "created_utc": 1698641533,
   "score": 21,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k722zia",
   "message": "I used to be a really sick kid and constantly in and out of the hospital but no one could ever tell me exactly why I was always feeling so bad but once I moved out of my moms house I never had tummy issues again and I wouldn’t get sick as often or feel horrible so frequently. Then once I went to visit my mom and she had chicken in a ziplock bag sitting outside on the steps right where any number of animals could get to it. I was about to throw it away but she stopped me and said that was for dinner, she was just thawing it in the sun. I’ve never eaten at my moms house since. But it did make me realize that a lot of the things she’d do in the kitchen were just not ok at all like leaving food out to thaw in the sink all day, maggot covered chocolate, mouse eaten Kraft Mac and cheese boxes, roaches in cereal, apple juice so old it started growing a large mass inside the bottle, oh god and the times she would cook pork and it would smell like burning piss. I thought that’s what pork was supposed to smell like and assumed I just didn’t like pork but nope, it was very clearly expired.",
   "created_utc": 1698646898,
   "score": 105,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k724bsu",
   "message": "When I was a kid I used to visit my grandmother a lot. One day she gave me crackers and cheese to snack on. I was about to take a bite of a cracker when I looked down and saw something moving on it. “Hey,” I said, “There’s bugs on this cracker!” My grandmother took a look: “There’s nothing there, eat your crackers.” But I insisted, so my aunt took a look: “There’s nothing there, eat your crackers.” But I continued to insist until my other aunt took a look. Sure enough, she saw little brown bugs crawling all over the crackers. \n\nMy aunt opened the box the crackers had come from: bugs. She pulled boxes from the cupboards and looked inside: more bugs. The whole kitchen was infested with little brown bugs. They were in the cookie tins, in the bread box, in the flour… My aunt asked my grandmother, an avid baker, how she hadn’t noticed the colony of bugs that had taken over the white flour. Her response: “Oh, I thought it was whole wheat!”\n\nThey ended up tossing out at least three garbage bags of food that night. The cupboards were bare when they were done. It seemed to take care of the problem but I was always a little weary about eating at my grandmother’s house after that.",
   "created_utc": 1698648011,
   "score": 104,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k715f67",
   "message": "My Sister in law was responsible for her very elderly grandmother's means during her mother's absence. She would take the food out of the freezer the day prior and just.. *let it unfreeze on the table.*\n\nWe visited on the 3rd day, and immediately told her not to ever do that (especially when meat is involved)... she genuinely didnt know... luckily Grandma was fine, she must have a strong stomach. \n\nBut anyway, I wouldn't ever trust my SIL cooking anything after seeing that.",
   "created_utc": 1698628110,
   "score": 119,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71nkuc",
   "message": " My grandma never washed her hands after handling the meat. She would just dry them on the dish towel",
   "created_utc": 1698636610,
   "score": 51,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71ku5h",
   "message": "When I was a kid I went over to a friend's house for dinner. His mother was washing up some dishes and in the dishwater we're probably 20 dead flies. She didn't seem to care and simply remove the dishes and put them on a drying rack, then tried to serve food in those dishes. I was so grossed out that I told them I had to leave and never went back there for dinner again.",
   "created_utc": 1698635197,
   "score": 49,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71zesv",
   "message": "My great aunt used to wash her dirty clothes and dirty dishes in the bathtub…while she took a bath.",
   "created_utc": 1698644114,
   "score": 18,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k720jum",
   "message": "Went to a bbq held by a co-worker of mine. When we got there, she lived in this really run down, disgusting hygiene house and I was glad we were sitting outside. She mentioned that she had marinated the chicken in the bathtub, which put me off eating anything not pre-packaged. Then later I asked to use the bathroom and actually saw the bathtub. It was fucking disgusting, streaked with black for some reason. I went back outside and subtly passed the word around not to eat the chicken. I think I might have saved a life or two that day.",
   "created_utc": 1698644981,
   "score": 77,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71b7zl",
   "message": "Someone brought Mac and cheese to a dinner we were having at the church I used to go to…she later told everyone she made it with her breast milk. I didn’t grab any thankfully. 🤢",
   "created_utc": 1698630674,
   "score": 67,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71nd7m",
   "message": "I was invited over regularly for dinner at our friends house. The food was good, however the company was basically his dad and him having a screaming match because they couldn’t agree on anything up to a point it almost ends up a fist fight.\n\nThen they look at me angrily and ask me for my opinion to settle their argument. \n\nMe: …. Ummm… hey how about this food huh, \nso good :). \n\nThem: o yeah.. glad u like it\n\n(Dead Silence for the rest of the meal)\n\nIt would be worse if the argument was about\nthe food. They would have me in a bind there \n\n…",
   "created_utc": 1698636495,
   "score": 19,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k72iziw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k729r28",
   "message": "I graduated high school at 6' 10\" tall, but weighing only 120 lbs.\n\nThat's not skinny, that's emaciated.  The food prepared by my bio-mom was so bad that it wasn't providing me with the nutrients or calories I needed to survive.  I went off to college where I had to cook for myself (I wasn't allowed to cook at home because my father insisted that \"cooking was women's work\")  Not only did I discover that food didn't have to be burnt to a crisp, flavorless, or boiled until everything was grey.  I also discovered that food can be made to taste good, and using things like salt, or pepper, spices, or various condiments can make it taste amazing.\n\nThe \"freshman 15\" likely saved my life.\n\nThe thing is, I don't think that my biomom was even *aware* that her food was that disgusting.  Whenever we went out for dinner (which was more often than what my father wanted, but *he* was the one that insisted on going) she did nothing but complain about how the food was undercooked, \"practically raw,\" or \"too spicy,\" to eat.  When she went to other people's houses (including her own extended family) she would criticize them for \"doing it wrong\" when she watched them cook anything.  She would often end up refusing to eat their food because she \"watched them ruin it,\" when they cooked it.  We never had guests over to eat her cooking.  Ever.",
   "created_utc": 1698652699,
   "score": 141,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71tc3a",
   "message": "I was in Africa and invited to eat at an old woman's house. She served us chicken and so, so many feathers were still unplucked. Turns out, she was very near (or possibly completely) blind. Didn't have the heart to say anything though, so we did our best to discreetly remove feathers from our portions.",
   "created_utc": 1698639933,
   "score": 59,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71pwbc",
   "message": "My college boyfriend never washed his dishes until he was ready to use them, so he had a permanent Jenga-like stack of filthy dishes in his sink. As you might guess, it garnered a lot of interest from insects and pests. Rather than wash the dishes, he simply indiscriminately sprayed whatever aerosolized poison he had on hand all around the sick and on the dishes. I offered to buy him a countertop dishwasher, but he declined. He felt his system worked fine.",
   "created_utc": 1698637877,
   "score": 56,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71y6ub",
   "message": "Was at a friends house and their mom made burgers. Didn’t see her cook them but when they were ready we got called in to eat. As we sat down I could see my friends were embarrassed like this kinda shit happens a lot, but basically what was on the plate in front of me was a single large meatball sized ball of half cooked ground beef in between two buns and nothing else. Ate the cooked outer rim and hid the rest between the dry buns and only ate prepackaged junk food the rest of the night. First time realizing how schizophrenic my friends mom is. Still nice (mostly) but definitely not all there.",
   "created_utc": 1698643225,
   "score": 50,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71rxzs",
   "message": "My 3 year old nieces birthday party. The kids, all around the same age, gather round the cake, which was a really nice one that was custom made by a bakery. \n\nOne kid has a snotty nose and he’s really fascinated by the candles and trying to get up close so he can blow them out.  He’s blowing and blowing and his mom keeps trying to pull him back so my niece can blow them out. I’m thinking this is gross, he’s blowing flu germs all over the cake. I ain’t eating that. \n\nHe breaks lose and gets right up next to the cake to blow, but this time he sneezes instead. A big blob of snot lands on top of the cake.  \n\nI was laughing my ass off. Funniest thing I’ve ever seen. Then the adults were racing to pull him away from the cake and they scraped off the icing and served the cake. I don’t think anyone really ate it at that point. They just kind of scattered it around their plates so it might look that way.",
   "created_utc": 1698639073,
   "score": 86,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k72h9sp",
   "message": "Mine is tame compared to the other stories here. When I was a kid, my friend's mom thought most food would \"cause autism.\" She also genuinely thought *all* sugar was bad for you, and FRUIT was forbidden in her house. (For the record, she was also extremely fatphobic.) She was also a terrible cook, and took it as a personal offense when I asked for some ketchup once. Condiments were a big nope. They made food enjoyable so therefore they were forbidden. This woman hated joy.\n\nAnyway, I had to spend the night at my friend's house once when my parents went on some trip. I was nervous about dinner, because I'd heard the stories. We had... roast... god knows what tbh. It was so dry I nearly choked. It was overcooked to the point of being like jerky. It had sharp edged and actually cut the inside of my mouth. We were only allowed to have water or milk with dinner, as juice would give us the autism and anything caffeinated was of the devil, according to friend's mom. After that dinner, I never ate there again. \n\nLong story short, my mom used to sneak real food to my friend through a wooden fence, and none of us \"caught autism\" from the canned fruit. Still up in the air if we're going to hell for drinking Pepsi.",
   "created_utc": 1698659121,
   "score": 41,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k71y3q1",
   "message": "this wasn’t a house, but a coworker got takeout from a local Chinese restaurant. shortly after taking the first few bites he found a tooth in the food! we laughed, we dry heaved, we laughed again. i avoided all chinese takeout for some years after and made sure to tell all my friends(and show them a picture) of the tooth.",
   "created_utc": 1698643163,
   "score": 41,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k72a8ns",
   "message": "Years ago I was friends with a guy from work...chill dude, really smart tech guy, super down-to-earth. He invited me to dinner over at his one night, says his wife makes really amazing Italian food. I stopped off on the way to buy a bottle of wine and a nice cake for dessert because my parents always told me never to show up empty handed.\n\nWell. The second he opened the door, I was hit with a wave of odor that I can best describe as a collection of urines...human and animal. The house had the look of a shithole that was only recently 'cleaned' for company - like everything had a slight film of filth over it, piles of dust/dried cat shit in corners, etc. His wife was about 10 years older than him and kinda weirdly manic as she ran around cooking, yelling at the kids (a chunky teen who smelled like death and a demon 5-year old) and then throwing me random one-liners of small talk.\n\nMy coworker invited me down to the basement, which was surprisingly clean compared to the upstairs but was also obviously his office/studio space which had been taken over by a warehouse's worth of large plastic containers full of his wife's abandoned craft stuff. We went back upstairs and the teen was carrying the screaming child upstairs as she'd pissed all over herself and the floor. I 'got a text' then went out on the porch to 'return a call' and was driving home 5 minutes later because of the 'emergency'.\n\nMy coworker was transferred to another team a few months later, and several years ago I heard through the grapevine that his wife left him for some Scottish guy she met through some kind of old-soul conspiracy theory dating site.",
   "created_utc": 1698653126,
   "score": 35,
   "submission_id": "17jf4ta"
  },
  {
   "comment_id": "k744okk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17jf4ta"
  }
 ]
}