{
 "submission_id": "17jo9sz",
 "title": "What’s the most fucked up thing you’ve seen on the internet ?",
 "selftext": "",
 "created_utc": 1698652716,
 "permalink": "/r/AskReddit/comments/17jo9sz/whats_the_most_fucked_up_thing_youve_seen_on_the/",
 "score": 187,
 "url": "https://www.reddit.com/r/AskReddit/comments/17jo9sz/whats_the_most_fucked_up_thing_youve_seen_on_the/",
 "comments": [
  {
   "comment_id": "k72mzhe",
   "message": "Funkytown. Ghostrider. Cartel feeding a child predator to their dog. \n\nThe Junko Furuta story and everything associated with it.\n\nI think those are legitimately the most fucked up and gruesome things I have seen in many places. The story of Junko Furuta is a very distressing series of events that took place, I’d rather watch the other videos to be completely honest.",
   "created_utc": 1698663399,
   "score": 86,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72k50z",
   "message": "That's probably a video of 2 kids in a bathroom playing with a gun and one of them shoots the other by mistake, then shoots themselves. After the shots you see the family peeking through the door that is blocked by their bodies, and the realisation of what happened on the family's face is insane... \n\nThat or this dashcam video where a brick coming from a truck on the opposite lane crashed though the windshield and into the passenger's face, I think she dies on the spot and then you hears the screams of the husband in the driver's seat and the kids in the rear seats...\n\nBoth videos you don't really see much gore per say, but the absolute horror of the situation gives me chills just thinking about it",
   "created_utc": 1698661363,
   "score": 168,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72aeql",
   "message": "Seeing two teen boys in the woods beating some poor man's head in with a hammer and smiling about it. \n\n\nAnd a fake one, when I was like 8-11 my mom's friend showed me pictures on her computer of these kittens \"stuck\" in jars, it was fake but very convincing and they never told me it was fake and it horrified me.",
   "created_utc": 1698653270,
   "score": 113,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72a5ix",
   "message": "Lots of shit, but the one that unfortunately pops into my head, a few people sitting in a sort of plaza, then a rocket hits. Going from enjoying their day to falling parts and blood in seconds",
   "created_utc": 1698653050,
   "score": 178,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72dxeo",
   "message": "Don’t remember the website. But was early 2000’s with a lot of gore. A python ate a human or maybe it was an Anaconda! And they were cutting it open to get the body.",
   "created_utc": 1698656300,
   "score": 144,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72cxw7",
   "message": "Russian lathe incident, and the aftermath.",
   "created_utc": 1698655461,
   "score": 95,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72k8m0",
   "message": "I used to work cyber forensics for a federal law enforcement.\n\nThere's a lot of sick shit out there.",
   "created_utc": 1698661435,
   "score": 181,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72fxd4",
   "message": "Watched some guy blow his face off with a shotgun, had no idea what he was rambling on about and no idea what was going to happen but he says \"well I guess that's it then\" before blowing his face off. I think he was on the phone to an ex partner that wouldn't get back with him or something?\n\nAlso, I watched an ISIS video they tied some guys' arms and legs up and chased him with a tank. He was hopping to get away but obviously couldn't, and they ran him over. The body was turned to mush underneath the tank whilst the terrorists stood there laughing.",
   "created_utc": 1698658000,
   "score": 15,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72chw5",
   "message": "I grew up with the internet… I’ve seen everything from 2 girls 1 cup to Al-Qaeda beheadings with a rusty knife… but the weirdest one was a woman getting fucked by a horse and it cums inside her.",
   "created_utc": 1698655083,
   "score": 34,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72fndd",
   "message": "Top 3 for me are as follows, the absolute worst being last:\n\nDemogorgon Diving Incident: dude jumps from a bridge and hits a concrete fishing platform below, splitting open his entire face. When they retrieved him, his head was opened up to look like the Demogorgon from Stranger Things, they had to hold his face together while recovering him. He was still alive and conscious, too.\n\nRotating Machinery: 2 videos, one was very fast moving and one much slower. The fast one pulled the worker into it, within seconds blood and gore was spraying from the machine covering the entire warehouse, guy probably died within 10-15 seconds. 2nd one the guy got pulled in and slowly rotated, like once every 3 seconds. He was stuck in the machine for a looong time before it was stopped. When it was stopped, his legs looked like jello. He likely died slowly and agonizingly.\n\nThe worst was a video my wife seen on Facebook. The traumatizing part was that my wife thought it was a cute video, a kitten in a bucket getting a bath. She watched it with a smile, thought it was adorable… until it was revealed that it wasn’t water in the bucket, it was gasoline. When the sick fuckers set the bucket on fire, my wife went straight into a panic attack, she was hysterical. It still makes me tear up just knowing that she witnessed that, because she had never seen any type of shock content up to that point, and she wholly believed it was a simple cute cat video. Fuck.",
   "created_utc": 1698657760,
   "score": 31,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72djgr",
   "message": "Last year my Facebook business profile was hacked, then immediately afterwards my personal profile was hacked by the same people and both my Facebook and IG were permabanned for violating the TOS. I appealed and was denied, I was also denied a copy of my data. I mostly just cared about the lost photos. I ended up having to write my state rep to be allowed back into my account. I got an email from FB saying I could log in to review the posts that had violated the TOS and reinstate my account. The hackers had posted 10 CSAM photos in order to get my account shut down by the algorithm, and Facebook made me look at them to get back in.\n\nOnce they had full control of my business account, they used it to run $4000 worth of phishing ads on my credit card over the course of a month.\n\nIt was a mess and now those 10 images are seared into my brain, I can't unsee them. Absolutely traumatic, I've had to go to therapy to deal with it. Fuck you Facebook, and fuck you guy in southeast Asia. I hate you.",
   "created_utc": 1698655973,
   "score": 89,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72cmcw",
   "message": "I have once seen a video of someone getting cut apart with a machete, that dude did not die quickly...\nHumans are fucked up. And I don't want to go to mexico after seeing this video",
   "created_utc": 1698655189,
   "score": 202,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72m5nx",
   "message": "A man pulling a screwdriver from his urethra",
   "created_utc": 1698662827,
   "score": 159,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72r0bc",
   "message": "There was a plane crash in my hometown. Someone recorded the man lying outside of the plane dying and did a Facebook live. You could see him kind of moving and the person recording was just yelling about how messed up it was but wasn’t trying to comfort the person at all. Just posted it for everyone to see his final moments. It was disturbing and I can only think about this - what if his family members scrolled by and saw it? Disgusting behavior honestly.",
   "created_utc": 1698665985,
   "score": 77,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72b9d5",
   "message": "I am from the internet has no filter time.\r  \n\r  \nPorn on YouTube. Beheadings, a guy jumping from a shipping container trying to hit the water but split his skull open on the edge of the dock. Things like that.\r  \n\r  \nOne man one jar aswell",
   "created_utc": 1698654014,
   "score": 60,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72ata0",
   "message": "Either Funky Town or a vid where a man cut the flesh off the entire front of another living man.\n\nOn a personal note, shortly after my first child was born I saw some pics from Malaysian Airflight 17 incident. One was a seat with a childseat and child clearly visible. That shit absolutely broke me.",
   "created_utc": 1698653624,
   "score": 63,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72bzas",
   "message": "I've been fairly sheltered. Worst I ever saw was Goatse.",
   "created_utc": 1698654642,
   "score": 140,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72a2p2",
   "message": "A guy killing his sister using firearm, multiple shots, coz she has been raped by a soldier, and her pictures were all over the internet.\nTo him, she lost her honor.\nLocation, somewhere in the middle east.",
   "created_utc": 1698652981,
   "score": 237,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72chkl",
   "message": "Holy shit and that stupid cat in blender video. I never saw it. I just saw the thumbnail and cried. I just clicked off. That's so vile and disgusting.",
   "created_utc": 1698655075,
   "score": 217,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72bvhp",
   "message": "Corpse abuse. Right here on reddit.\n\nI didn't seek it out, it was an asshole pulling the old bait and switch.\n\nI wish I could forget those images.",
   "created_utc": 1698654551,
   "score": 115,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72nth8",
   "message": "The beheading of the two scandinavian girls in Morocco. \n\nAbsolutely horrifying sound and visual.",
   "created_utc": 1698663968,
   "score": 56,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k732m69",
   "message": "Nothing as gory as the rest on here. Disturbing, nonetheless. A couple of CCTV footages that expose human depravity. \n\nA footage where a nanny beats the crap out of a 1.5 - 2 year old kid cos it was constantly crying. The footage starts with her wildly rocking the child in her arms while it’s wailing its lungs out. Upon seeing the child not subsiding, she flings the baby to the cot (probably 2-3 feet away). It had a good soft mattress and the child was unhurt. But it bounced a couple of times and continued to cry. She then picked the child, slapped it right across the cheek once and then held it by both legs and trounced it on the bed about 5 times. There was death silence and few seconds of still. The footage cut just when the child moved its hand a bit. Upon reading up, turns out the child survived unharmed and the nanny was arrested. The family had installed the cctv after suspecting some lapse on the nanny’s part as the child had some minor bruises everyday. They were so shocked by what they saw. \n\nThe second, a case of elder abuse. A man, his wife and juvenile son were being suspected by the man’s sister of abusing their mother. She installed a cctv in the mother’s room. The footage begins with 3 of them in the mother’s room picking her bed sheet from the bed, sniffs it and starts gesturing around wildly. The elderly mother comes into the room. She’s very frail and her hands are trembling. The son roughs her up and pushes her onto the bed. Holds her against the board and slaps her across the cheeks yelling at her. His wife and their son looking on. They were arrested too. \n\nThese 2 footages shook me up so bad. A person whose only job is to be patient with an infant losing her cool. In what appears to be a routine misbehaviour. And a son who cannot understand an elderly mother who’s probably not in control of her bladder. What a world!!",
   "created_utc": 1698672084,
   "score": 59,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72cb96",
   "message": "Lots of weird shit but all reddit users have at some point, with their friends, played the whole 50/50 subreddit game and that has some NASTY stuff.",
   "created_utc": 1698654927,
   "score": 55,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72a1hs",
   "message": "My browsing history",
   "created_utc": 1698652953,
   "score": 20,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72n2ai",
   "message": "When I grew up, we had rotten.com.\nI've seen a lot. Ppl hanging from the ceiling on their genitals. Ppl shot but shotguns from very close. \n\nAlso bestiality and terror tv including executions.\n\nLater three guys one hammer and everything else in this naming pattern.",
   "created_utc": 1698663452,
   "score": 43,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72q4i9",
   "message": "Rotten.com\nPhucked.com\nShockgore.com\n\nJust pic one and have your innocence destroyed.",
   "created_utc": 1698665443,
   "score": 83,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k732tle",
   "message": "Jesus, wtf are y‘all watching on the internet?!",
   "created_utc": 1698672179,
   "score": 42,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72iaql",
   "message": "Rabies deaths. Anything to do with RABIES will fuck you up for weeks. I don’t go near animals now.\n\nFrom Reddit comments to documentaries ripped onto YouTube, rabies is no fucking joke.",
   "created_utc": 1698659949,
   "score": 111,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72qpqf",
   "message": "that one police bodycam where the guy does everything the cop orders him to and still gets shot like 6 times. he was unarmed, lying down and begging for his life. poor dude",
   "created_utc": 1698665809,
   "score": 100,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72e9jb",
   "message": "YouTube didn't use to have a censor at all. \n\nBut damn faces of death was a whole other deal. \n\nA mental patient got loose and took a nurse hostage with a news crew taping. He got hold of a scalpel and cut her artery on her neck on camera. \n\nAnd the puppies being alive then not and cooked.....",
   "created_utc": 1698656585,
   "score": 126,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72kqag",
   "message": "Last night I was on Reddit and someone said something about a Lathe machine. I didn’t know what it was and I searched it up. There was a video with the title ‘man working on lathe machine’ so I clicked it thinking it would be informative. \n\nInstead, it was a man getting stuck in one and twisted around super fast which caused his body to get just destroyed. The video then cut to photos of the aftermath where you can see all his innards and even his hand just decapitated from his body. The worst part was that you can see his upper back and head just folded over each other. It was so horrible I cried and threw up and I couldn’t sleep for the rest of the night. I still don’t know what a Lathe machine actually does.",
   "created_utc": 1698661799,
   "score": 31,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72c2i5",
   "message": "Early invasion on the Ukrainewarvideoreport sub\n\nA family in a pile on a mattress, two grandchildren who'd been raped and shot on top of their dead parents, on top of the grandparents, all of them shot dead\n\nF*** you Putin",
   "created_utc": 1698654719,
   "score": 57,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72gco2",
   "message": "Cartel members slitting a fathers throat a day then fileting the chest off his son. The son's lung proceeded to balloon out of his chest with each breath he took. I think I saw it called the Gurerro Murder Video once. That or cartel members hacking of a man feet while he said \"oh no, oh no\" in a resigned tone.",
   "created_utc": 1698658365,
   "score": 106,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72h46m",
   "message": "I’ve seen more dead kids, hurt kids, and traumatised kids over the last fortnight than I ever expected to see in my lifetime.",
   "created_utc": 1698658993,
   "score": 101,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72gl9n",
   "message": "I've seen a lot of gore and stuff to the point I'm not that bothered by it anymore\n\nWhat I would consider is the most fucked up thing I've seen is a mother jumping into a frozen river from a hole (because of a Christian holiday tradition), gets swept under the ice and drowns in front of her kids who are screaming and crying while not being able to do anything about it.\n\nI could search for it to link it but I don't recommend watching this",
   "created_utc": 1698658565,
   "score": 48,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72bvgn",
   "message": "the family car trip video",
   "created_utc": 1698654551,
   "score": 71,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k729wzp",
   "message": "Probably the 'Run the Gauntlet' videos",
   "created_utc": 1698652844,
   "score": 51,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72jv6q",
   "message": "I'm an 80's kid, so the the internet was made wide-spread in my youth. \n\nThe initial horrible website was shit.com\n\nI only ever saw that website 3 times, and each time put a horrific hot-iron branding on my memory. A couple of my friends actually visited that site on a regular basis, and them showing me is how I saw these things. \n\n(THE FOLLOWING WORDS ARE NSFL. TURN BACK NOW, ADVENTURER)\n\n1. A blindfolded man getting executed by bowie-knife to the neck by terrorists. (video)\n\n2. A woman with many long tape worms coming out of, I assume, her anus. (picture)\n\n3. Shit from butt to mouth. (video)\n\nBonus #4:\n\nMy tech-savvy buddy secretly changed our computer startup screen to a man shoving a beer bottle into his urethra (picture). Since houses just had 1 shared computer, I learned he did this when my mom discovered it. Bad times!",
   "created_utc": 1698661162,
   "score": 36,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72df4u",
   "message": "Live Leak",
   "created_utc": 1698655873,
   "score": 16,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72h7mj",
   "message": "Saw a Mexican cartel video that has stuck with me. Worse than your usual run of the mill execution. Police chief and his son who was 7-10 years old. \nBeheaded the father in front of the son and then continued to fillet the kid’s chest and open his rib cage, taking out his heart. It took WAY TOO long for the kid to finally pass out or die. He screamed almost through the whole thing up until opening up the rib cage. Hardest video I’ve ever watched.",
   "created_utc": 1698659071,
   "score": 15,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72y336",
   "message": "Human animal porn where the horse, dog, pigs cums inside the girl",
   "created_utc": 1698669913,
   "score": 16,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72dnti",
   "message": "Saw a naked dude tied to a fire hydrant being eaten alive by a dog",
   "created_utc": 1698656075,
   "score": 17,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72k4xw",
   "message": "This reddit post is slowly becoming one of the most fucked up things, by all your comments describing absolutely awful stuff. I'l show myself out.",
   "created_utc": 1698661361,
   "score": 65,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k730p2n",
   "message": "When the Parkland School Shooting happened, all those kids had their phones and were essentially broadcasting it live on Snapchat. I saw everything happen from the active fire, to people who were shot crying for their mom and all of the other victims. Really really changed my brain at the age of 14",
   "created_utc": 1698671190,
   "score": 14,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72d3d9",
   "message": "Probably that video of the Indian kid who got split in half hamburger wise by a train. He was in shock and tried to stand up without realizing his legs were gone and then fell over. \n\nOddly videos like that don’t disturb me nearly as much as videos of people who have no control over their dogs and wont pull them away from harassing someone or their dog.\n\nEdit: Pakistani kid",
   "created_utc": 1698655594,
   "score": 28,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72a1m2",
   "message": "I've seen a lot of gore videos before. Can't really remember which one was the worst.",
   "created_utc": 1698652956,
   "score": 73,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72kzy5",
   "message": "Videos of people literally dying on r/fiftyfifty.",
   "created_utc": 1698661998,
   "score": 11,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72n481",
   "message": "After reading this his post I’ve had enough of the internet for today. Possibly tomorrow too.",
   "created_utc": 1698663490,
   "score": 13,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k72th3w",
   "message": "Some people here saying 2 girls 1 cup is the worst theyve seen.... I wish i were that lucky",
   "created_utc": 1698667425,
   "score": 13,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k7357ds",
   "message": "Every time I see a thread like this I'm re-traumatized by the memories and it ruins my day. Thanks.",
   "created_utc": 1698673258,
   "score": 13,
   "submission_id": "17jo9sz"
  },
  {
   "comment_id": "k7396xl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17jo9sz"
  }
 ]
}