{
 "submission_id": "17k50lc",
 "title": "What’s the dumbest thing you did in your life?",
 "selftext": "",
 "created_utc": 1698703343,
 "permalink": "/r/AskReddit/comments/17k50lc/whats_the_dumbest_thing_you_did_in_your_life/",
 "score": 212,
 "url": "https://www.reddit.com/r/AskReddit/comments/17k50lc/whats_the_dumbest_thing_you_did_in_your_life/",
 "comments": [
  {
   "comment_id": "k75lvml",
   "message": "Drove home so drunk that I had to close one eye to see. Nothing happened, no accident, no cops, but it was so goddamn stupid I quit drinking after that. I woke up the next day, thought about what I did and how much it went against who I want to be. Never again.",
   "created_utc": 1698706953,
   "score": 2,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75vd76",
   "message": "Never found a passion and thus never committed to anything. No idea how people seem to just know what they wanna do for the rest of their lives.",
   "created_utc": 1698710840,
   "score": 1,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75sqgh",
   "message": "When I was 15 I was walking home along a country road in daylight and a man I'd never seen in my life pulled over and offered me a lift to the end of the road nearer my home as he was staying at a BnB nearby. I had a heavy bag on my back so I was grateful for the offer and hopped in. Luckily he dropped me off at the end of the road.",
   "created_utc": 1698709759,
   "score": 47,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75sirw",
   "message": "Nothing.\n\nThe dumbest thing I did in my life was nothing.\n\nThat is to say, not doing SOMETHING.\n\nAll the years I just sort of... floated. No direction. No goals.\n\nThings became so much better when I got my shit together and picked a lane.",
   "created_utc": 1698709671,
   "score": 158,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75yjah",
   "message": "Went 180mph on a bike. Got the death wobble at 150. Didn’t stop until I slowed down to about 85. Scariest and dumbest moment of my life. I no longer ride. Scared the passion right out of me. I pulled into a parking lot and sat there thankful for about 45 minutes just soaking in the sun.",
   "created_utc": 1698712110,
   "score": 66,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75gwnf",
   "message": "I was wasted and drove around with a friend. we crashed the car and almost died. we were lucky the police didnt get involved, my parents would have killed me if they found out.\n\nwhatever you do' DONT DRINK AND DRIVE FFS!",
   "created_utc": 1698704939,
   "score": 250,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75gp31",
   "message": "Learning about bitcoin in like 2010 and trying to figure out how to buy some and giving up pretty quickly.",
   "created_utc": 1698704854,
   "score": 184,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75lxl8",
   "message": "Thought that somebody loved me because I loved them.",
   "created_utc": 1698706976,
   "score": 63,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k769drh",
   "message": "Held a strainer by the bottom as I poured boiling water with pasta into it",
   "created_utc": 1698716463,
   "score": 58,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75fdpk",
   "message": "Sniffing cocaine that I found in a baggie in the street gutter. \n\nI mean it was GREAT, it just wasn't very *smart*.",
   "created_utc": 1698704329,
   "score": 85,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75g63z",
   "message": "Long time ago, in this galaxy… I went to take a shower and left my towel in the sink, when I was done instead of stepping out of the tub to reach for my towel I decided to reach for it, the toilet was between me and the sink so it was a pretty good stretch. I was slowly reaching for it and right as my hand was over the sink, my feet slipped and my hand got caught on the sink, my feet were hovering on the edge of the tub and my weight dislocated my shoulder out of place, the curtain from the tub got ripped off and landed on me. I put my other hand on the toilet lid and pushed myself up (other hand still on the sink), as I came up my hand on the sink dropped limp and the weight of my arm coming down popped my shoulder back in place. I checked to see if I could move my arm before the pain hit. As I sat there naked, wet, and in pain, I thought about shower safety… so yeah, dumbest thing I did was leave my towel in the sink.",
   "created_utc": 1698704643,
   "score": 30,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75ds81",
   "message": "Marrying my abusive ex.",
   "created_utc": 1698703698,
   "score": 17,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75j3ph",
   "message": "Not the dumbest. But, following Matthew Perry's death I learned that going to the gym and see how long I can spend in the steam room and then immediately jump in the pool afterwards probably isn't the smartest thing to be doing.",
   "created_utc": 1698705824,
   "score": 109,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76a60y",
   "message": "I think I was 8 or 9 years old, swimming alone in our pool. Gust of wind blew our big tarp into the pool, and instead of getting away from it, I swam under it. I got stuck under it, surface tension held me under the tarp and I started panicking, trying so hard to break out. I started to black out, then, miraculously I made it out. Nobody knows this happened, lol. Family was home, I was unattended/trusted to be alone. Pool was 5ft deep.",
   "created_utc": 1698716783,
   "score": 0,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75upwx",
   "message": "At age 22 bought my first starter house making $13 an hour back in 2008. 750 square feet. Financially strapped. Needed washer and dryer. Couldn’t afford new so my wife and I found some on Craigslist in rural northern Idaho. We were young and excited and decided to go pick them up with my uncles truck we borrowed. An old piece of crap truck. It was 8pm but we left from Spokane WA for the washer and dryer anyway. \n\nWe mapped it before hand since we didn’t have gps cell phones back then. It was dark and stormy. Made it to highway in northern Idaho. The trucks lights began flickering on and off. Our first sign to go home but I really wanted that $50 washer and dryer. Driving down the highway some more as the lights flickered, all of a sudden a giant bear/wolf was in the road, we hit it with the right side of the bumper as we slammed the breaks. Our second sign to go home. But we kept going.\n\nThen we finally found our turn heading up this gravel road up a hill with trees. Pitch black. No street lights. I see what we thought was the house we were supposed to pick up the washer/dryer. I pull in the driveway. Lights on the truck flickering. Out comes this naked kid with a rifle screaming “what the fuck are you doing?!”. I rolled down the window and said “I’m just here for the washer and dryer?” Then the kids mom ran out and pulled his gun down and I yelled sorry and backed out of their driveway. We drove home. I haven’t felt more dumb in my life. Risking my wife’s life and my own for a cheap washer dryer in northern Idaho in the middle of a stormy night.",
   "created_utc": 1698710576,
   "score": 59,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75luta",
   "message": "Backcountry solo freeclimbing.",
   "created_utc": 1698706943,
   "score": 111,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75ji7x",
   "message": "This is one that hopefully some can learn from - I made an untrustworthy (now-ex) girlfriend an authorized user on some of my credit cards. I was trying to help her build her credit by doing this and had a verbal agreement that she'd pay on them as well. Naturally she ran up charges on them and proved that her bad credit score was well earned. She and I split up a few years later and I was 100% on the hook for the debt when she decided not to stop paying. Do not mingle finances unless you're married. Even then, maybe don't do it if the other person isn't responsible or trustworthy in money matters. It was dumb, but learn from my mistakes.",
   "created_utc": 1698705988,
   "score": 150,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75dbb8",
   "message": "I probably just should have gotten into software or healthcare. Nothing else pays.",
   "created_utc": 1698703515,
   "score": 165,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75fp1l",
   "message": "In high school a buddy and I thought it was funny to unplug the hand dryer and throw water on the powerpoint... VERY fortunately no one was ever hurt and in hindsight probably wouldn't be with a rubber cord...but what in the fuck did we think was going to happen? I remember thinking it was just a joke...but like...what a dumb ass hole I was",
   "created_utc": 1698704456,
   "score": 202,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75sleq",
   "message": "Paid for everything for an ex for a few years. I could have saved so much money. In the end got dumped for a guy she worked with.",
   "created_utc": 1698709701,
   "score": 196,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k7679oi",
   "message": "Lived with an ex for 3 years who was absolutely fucking crazy. \n\nExample, she woke me up at 3am one night hitting me, because I cheated on her in her dream, with a woman she works with, I never met. She said \"I know you would do it because she's very pretty\".",
   "created_utc": 1698715605,
   "score": 127,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75dbnf",
   "message": "Sharping my finger with a pencil sharpener",
   "created_utc": 1698703519,
   "score": 140,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75p7vn",
   "message": "I jumped out of a car that was going 35 mph when I was 16, and I'm reminded of it every single day.",
   "created_utc": 1698708321,
   "score": 58,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75hulw",
   "message": "Took advantage and leverage love against the only person that ever loved me.",
   "created_utc": 1698705320,
   "score": 156,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75ln4o",
   "message": "staying with this shit manager because of sunk cost fallacy.",
   "created_utc": 1698706856,
   "score": 52,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75v29m",
   "message": "Jumped off a 3 story house with a home made parachute. I was a dumb teenager.",
   "created_utc": 1698710716,
   "score": 92,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76hff5",
   "message": "When I was five years old my parents took the lightbulb out of my bedroom light to use elsewhere as we had no replacement. I flicked my lightswitch on and off and found it funny that nothing happened because I was five and that was funny. But then I got worried that when my parents replaced the bulb the switch might be on and it could harm them.\n\nSo to check it was definitely off I climbed up on my bed and stuck my finger in the socket. I even remember saying to myself \"I might be small, but I'm not stupid.\"\n\nI got electrocuted. It felt like my finger was being bitten and gripped but I pulled it out and was ok. I was shaken up but didn't want to say anything in case I got in trouble so I just sat at the top of the stairs for a bit. Then I realised I had wet myself so not wanting to get in trouble for that, I told my mom that the cat had done a wee at the top of the stairs and they punished the cat by holding her face in it (it was a new kitten and apparently this was a way of training them not to urinate in the house).\n\nThat poor cat looked so confused and I felt so guilty. I still do.",
   "created_utc": 1698719805,
   "score": 122,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75iu90",
   "message": "[deleted]",
   "created_utc": 1698705718,
   "score": 41,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k769xh9",
   "message": "Put diesel in a gas engine. Knew they were different, but didn't realize it would fuck it up. Not my proudest moment.",
   "created_utc": 1698716687,
   "score": 42,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75eu48",
   "message": "Tried to treat my depression with opiates.",
   "created_utc": 1698704114,
   "score": 172,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75vf04",
   "message": "I got into a fucking car with a drunk driver. I was intoxicated myself so I couldn’t really gauge how intoxicated she was. She said she was fine, and I fully trusted it. We sat in the trunk cause the car was full. Then she did the craziest turn, I literally was thrown around in the trunk of the van and knew she was way too drunk to drive. Me and my friends were under the impression that she was just going around the corner but this bitch ended up ON THE HIGHWAY. HOW? DONT ASK ME, cause to this day I don’t even know how we ended up there. All I saw was the bridge and the water on my right and I knew. I was hiding my fear but my best friend could tell I was nervous. I was definitely not drunk enough for that and remember feeling like my life was in danger. She was speeding as well, being fucking reckless. I will never do that again, next time I have to ask someone if they’re okay to drive I’m literally just gonna walk to the destination myself cause FUCK no.",
   "created_utc": 1698710861,
   "score": 110,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k760try",
   "message": "When i was in Europe I was pretty wasted and we are at the central train station. I bought the wrong train ticket, left my friends (because i am an idiot and just disappear when i'm drunk- typical) without saying a word and next thing I know I woke up in Berlin and all my friends were in Amsterdam. It's fair to say I certainly learned from my mistakes.",
   "created_utc": 1698713009,
   "score": 249,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k760srk",
   "message": "Senior year high school (30+ years ago) I was a lab aide for a biology teacher. Not the one I had but he his class lab area shared the same space as the teacher I did have. Anyway last day of senior class he decided to leave me and the other biology teacher leaving myself and the other teachers lab aide alone. He was a junior. So after about 5 minutes of just sitting there I had a bright idea and said ‘let’s mix some stuff’. So I grabbed 2 beakers giving him one. We had our backs facing each other as we went thru the cabinets taking whatever we found and pouring it into the beaker. About half way filled the beakers started to resemble an oily like surface. Had a purpleish bronze color to it and the beaker was getting very warm. Then the other kid yelled and jumped back into me. The contents of his beaker had lifted out almost hitting him. It landed on the linoleum floor. I immediately poured my beaker down the sink. We cleaned up the spill with paper towels. It definitely left a stain. Once we were done I high tailed it out of there. \n\nLater I realized had any poisonous gas gotten into the ventilation system it could have been really really bad. Considering what could have happened it probably the most dumbest thing I’ve ever done to date.",
   "created_utc": 1698712999,
   "score": 33,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k764mfn",
   "message": "I got into a car with a man who had been talking to me and told me he knew my mom and uncle (which was possibly true, he lived in the neighborhood they grew up in) to get a ride home\n\nI rode one block before I realized this may be exactly the thing I’m not supposed to do, and I just jumped out of the car and ran my next block home\n\nThen it turned out he was a registered sex offender\n\nIn my defense, I was either 15 or 16 at the time\n\nDidn’t tell my mom until I was way into my 20s",
   "created_utc": 1698714526,
   "score": 39,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75dabx",
   "message": "Eating out an unwiped ass",
   "created_utc": 1698703504,
   "score": 247,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76ahlp",
   "message": "Trusted my parents when they told me how the world works. They pretty much told me it worked like how everything was in the 50s - 80s. Dumb confidence and a firm handshake will get you anywhere.\n\nBULL   SHIT",
   "created_utc": 1698716915,
   "score": 59,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76b1w7",
   "message": "I got a degree in nursing in 2016. Now... some people are going to say \"Nursing is a good job!\" And you would be 100% wrong. Nursing is a fucking shit show of corporate assholes making hospitals into maximum profit facilities, decreasing aids, increasing patient loads, less and less compensation including stripping of benefits, more and more violence towards nurses. There are some exceptions to this but overall the nursing field is a mess right now and it isn't like other fields where bouncing around will net you some sort of huge pay increase. For the most part wages are set in stone at facilities with little wiggle room.",
   "created_utc": 1698717145,
   "score": 62,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75ghzi",
   "message": "I can't wait to come back later and do a count of all the shit here that I've done, all the shit I thought about but decided against, and all the shit I never thought of and now can't wait to try",
   "created_utc": 1698704775,
   "score": 55,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76bmly",
   "message": "Too many to name. I am just amazed and dumbfounded at the fact that it looks like I'm going to make it to 60. Swore I'd be dead by 30. Should have been dead by 25, just got lucky , some would say. Personally, I would have preferred if I didn't live this long. Lot's of suffering, pain and heartache crammed into the last few decades. I look around today and I am the only one left out of my group. It gets lonely talking to dead people, they don't usually answer you.",
   "created_utc": 1698717383,
   "score": 28,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75f9pj",
   "message": "Got married young",
   "created_utc": 1698704285,
   "score": 88,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k767mom",
   "message": "Believe that my life was over before it even began.",
   "created_utc": 1698715751,
   "score": 45,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75v5ew",
   "message": "Married a narcissist.",
   "created_utc": 1698710752,
   "score": 73,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76bx4d",
   "message": "I smuggled weed into a prison when I was dating a guy that was locked up. I constantly think about how fucking stupid that decision was. I'm so lucky I didn't get caught. I have never and will never ever even consider doing something that dumb ever again.",
   "created_utc": 1698717506,
   "score": 21,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75wycq",
   "message": "Married a man I'd only known 4 months",
   "created_utc": 1698711478,
   "score": 41,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k763npb",
   "message": "2-3 year old me thought it was a good idea to walk through the woods to a grocery store to go shopping for my family. I only remember 2 things, getting hamburger meat thinking \"my family like this(didn't know it looked different cooked)\" and the look on the cashiers face when I asked what money was.\n\nOh and the look on my moms face when she found me holding hands with a man in the woods(they made the bag boy walk me home)",
   "created_utc": 1698714141,
   "score": 39,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76n5wn",
   "message": "\u0026gt;So I have posted this before but here is one of the dumbest things my friends and I did as teenagers and I still stand by what I said at the end that we **should have got an adult involved** Any teens reading this, if you ever find yourself in the below situation, get an adult, don't worry about how much trouble you could potentially get into.\n\n  \n  \n  .\n \n \n  \n  \n\nI was 16 at the time, I spent the night at a friend's house. There was supposed to be four of us there that night but there was only three. See we were covering for our fourth friend who decided to spend the weekend with her \"boyfriend\" (some skeevy ass 25 year old pedo punk). So we're hanging out, listening to music it is almost midnight, the phone rings. It is our fourth friend, she and her boyfriend got into a fight and he put her out of his house, she is calling from a payphone because he kept her cell. We're like fuck, that sucks, tell us where you are and we'll come grab you... \n\n\nBITCH IS IN FUCKING BALTIMORE MARYLAND! So my first reaction is we should get my dad, this is some serious shit and we need an adult. The other two freak the hell out and point out just how much trouble we would all be in if a parent got involved. I point out how much trouble she is currently in, alone, no phone, on the streets, of a big city, at midnight, over 200 miles from home, and argue that we really should get help with this. They use my argument against me, yeah she could be in some serious trouble and we are wasting time arguing. **FUCK** So we print off directions, load into my piece of shit car and off we go. Now before this the biggest city I had ever drove in was Charlottesville...  \n\n\nSo we make this two or so hour trip, arrive in this big ass city, in another fucking state, at 2:30 in the morning with absolutely no one knowing where the hell we are. We pull up to the store our friend called from, and surprise the bitch isn't fucking there! So we ask the guy in the store, yeah she was there but she argued with some guy for a bit and when the clerk threatened to call the cops she left with the dude she was arguing with. We end up driving around a bit hoping that she is somewhere near by, the store clearly was in walking distance so she has to be somewhere near there. \n\n\nWell one friend has the idea that if she left with the dude it had to be the boyfriend so she probably has her phone back, we call and yeah, she's with him, everything is good, she meant to call us but they were talking and he was apologizing and trying to make up with her. We tell her that we are in the fucking city, we were worried and scared that something bad would happen to her so we came up. She tells us we blew things out of proportion which parent did we drag up there for nothing, we tell her we are there alone, her whole tone changes, *you guys are so sweet, you're the best friends a girl could ever have, I love you all, you should swing by and hang for a bit, meet the boyfriend* So we get directions from her, we roll up and dude is acting all nice, sorry to worry you guys, you know how emotional friend is, she just stormed out I was so worried, glad she has such great friends that would come all this way.  \n\nAll the while we're over here like yeah dude is creepy but we're remaining polite, friendly, trying not to let it show that dude is creeping us out. Dude invites us in, we decline, he insists, we tell him we will in a bit but for now we are thinking about running back to the store for a drink, we invite friend along, dude tries to come too, I'm like dude I don't have room, he's like well girlfriend can sit on my lap, one of our other friends is like bad idea, there was a cop at the shop and we don't want to get pulled over since our parents don't know we're here. Dude is all yeah the cops here are major assholes, our friend insists on staying with her boyfriend, we end up convincing her to ride with us so we don't get lost. Dude is all like hurry back, he then invites us to spend the night, it's little after 3 am, you guys don't want to drive all that way back home at this hour, come in, meet my friends, spend the night and head home in the morning. We're like our parents don't know where we are, it's a bad idea, we're just gonna go grab drinks for the road, bring your girlfriend back, and try to get home before parents wake up. Dude tries again to convince us to at least meet his friends, we're like yeah, sure, we'll say hello after we get back from the store. He kisses our friend and tells her to change our minds about making that long drive home. So we drive off... \n\n\nOnce we're near the store her whole attitude changes again. Apparently there was a huge argument, something to do with his creepy ass friends being there, and how she didn't feel comfortable being alone with any of his friends, he put her out of the house and after she called us she was pretty scared being alone on the street at 1am sp when he came looking for her she left with him because she felt safer with him than on the street, she was so relieved when we called and said we were there and was looking for a way to talk to us alone. She wanted to go home, she was really worried when he offered us the chance to stay over, she was scared we were going to accept the offer.  \n\n\n  So we end up passing the store and heading home, dude starts calling about 10 minutes later, what's taking so long, ect. She lies and says that I am in the bathroom and it is my car so they have to wait, ok cool see you soon babe, another 10 minutes pass and her calls again, she answers and yeah, friend might be sick, we will be back soon, so glad you are so thoughtful to offer them a place to stay the night. Dude calls again, this time he walked to the store and found out we were not there... At this point we are telling her to turn off her phone.  \n\n\nIn the end we make it home, we stopped at our local 7-11 for slushies in case our friend's mom is up when we get in. During the ride home we took that time to attempt to convince our 15 year old friend to dump her 25 year old \"boyfriend\" she argued that she loved him and we we not mature enough to understand, we pointed out that he put her out on the streets of Baltimore at midnight, we just didn't understand him, we point out that she called us scared, and admitted to us that the only reason she went back was he was better than the street...  \n\n\nShe ended up \"dating\" the dude for a few months more despite our protests that he was a bad dude, he ended up dumping her when he came down to visit and tried to pressure her into sex and when she said no he tried to force himself on her, she hit him, he told her that she wasn't worth the effort and he had plenty of bitches back home who would put out when he wanted, she meant nothing to him and she should either be useful and let him fuck her or just go kill herself because no one could ever love someone like her. So that really messed her up for quite some time and honestly none of our parents ever found out that they had 4 teen girls go out of state in the middle of the night...  \n\nTo this day I still thing we should have gotten a parent to go, we should have involved *some* adult, we should have told her mom about the \"boyfriend\" as soon as we got home but teenagers are fucking stupid and we are lucky things didn't go as bad as they could have.",
   "created_utc": 1698722411,
   "score": 70,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75narj",
   "message": "No regrets, but I’ve been told by a lot of people that it was a dumb move. I turned down a job last year that is 4x my current income. I would have had to move to another country and would rarely be in the states. The money wasn’t worth not being able to see my loved ones often.",
   "created_utc": 1698707534,
   "score": 19,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75wmo2",
   "message": "Separating from my husband. He was the best man I have ever met and loved me more than I deserved.",
   "created_utc": 1698711348,
   "score": 16,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k762exm",
   "message": "Taking out more in student loans than my 18-year-old mind was capable of comprehending.",
   "created_utc": 1698713639,
   "score": 53,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75q39e",
   "message": "Letting myself fall for her",
   "created_utc": 1698708680,
   "score": 19,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75qjpe",
   "message": "Letting a good man go because I was insecure about his past",
   "created_utc": 1698708867,
   "score": 36,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75vumt",
   "message": "Signed up for an MLM",
   "created_utc": 1698711036,
   "score": 36,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k7650im",
   "message": "Allowed myself to buy into other people's negative story about me.",
   "created_utc": 1698714683,
   "score": 35,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75dmbi",
   "message": "Agreed to take a free drink.  Woke up in jail and wrecked my life.",
   "created_utc": 1698703633,
   "score": 51,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76au3w",
   "message": "Hit a rut when drifting my go kart and it tipped over.  The stupid part was me blatantly forgetting hey hold the wheel and instead stuck my arm out to catch it and stop it.  \n\nI won a comminuted fracture to my humerus.",
   "created_utc": 1698717056,
   "score": 18,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75mpjs",
   "message": "Cheated on my significant other.",
   "created_utc": 1698707294,
   "score": 89,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75mw2i",
   "message": "Taking a couple friends on a 146 mph joy ride in my new car at 18 years old",
   "created_utc": 1698707367,
   "score": 48,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k766mwm",
   "message": "I fabricated a story and convinced everyone in 7th grade I had a rare heart condition and I was going to die. I had gone to a specialist and they told me I had an irregular heart beat but it wasn’t anything to worry about at the time. It was easily the worst thing I’ve ever done and I regret it anytime I think about it. \n\nI was just a sad lonely kid who had a stressful home life with my dads alcoholism. I burned so many bridges and some folks I see from back in the day will bring it up and tell me they hate me still it’s pretty wild. Happened 25 years ago. \n\nIt did lead to a totally 180 at a young age where I learned being authentic is a million times more attractive. Still super dumb.",
   "created_utc": 1698715348,
   "score": 29,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75wqav",
   "message": "Getting a Master's in Education right after obtaining a BA in English. If I could do it over again, I would do something in the natural sciences, which greatly interests me, but I had it in my head that I couldn't handle Math in HS, which tanked my grades and my drive to pursue it. I enjoyed reading and writing (kinda), so I went English Lit with a teaching option, without ever doing anything in that area. So I went through with the MEd/credential program and hated my life for a year, only to fail student teaching (still got the degree). I'd be happier now, and not working a job that I tolerate (Supply Chain Management),but don't especially enjoy .",
   "created_utc": 1698711388,
   "score": 12,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75kuhq",
   "message": "Not breaking up with my second husband before he became my second husband.",
   "created_utc": 1698706530,
   "score": 38,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75y2ci",
   "message": "Buying NFT.",
   "created_utc": 1698711921,
   "score": 44,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76gupv",
   "message": "I let her walk right out of my life without fighting to get her back.",
   "created_utc": 1698719556,
   "score": 44,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75xc1g",
   "message": "When I was a child I had a very pretty ceramic tea set. I asked myself what would happen if I stepped on one of the tea cups. So, out of curiosity, I put all my weight on the tea cup. It shattered, of course, and gave me a nice deep cut on the bottom of my foot.",
   "created_utc": 1698711631,
   "score": 12,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76453y",
   "message": "Stole 10k from my dad's credit card to but microtransactions on video games when I was 14. (Don't worry I paid it all back in full)",
   "created_utc": 1698714335,
   "score": 9,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75jlhp",
   "message": "Helped a friend with his bills.",
   "created_utc": 1698706024,
   "score": 30,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75mpe3",
   "message": "Listen to other people when I already know what is right.",
   "created_utc": 1698707292,
   "score": 31,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75sdqq",
   "message": "Throwing big rocks on bullets ,I got shot !",
   "created_utc": 1698709614,
   "score": 11,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k75w0l3",
   "message": "Walked into a courthouse (for a friends case) with a 4 gram ball of hash in my pocket and proceeded to toss it in the little tray thing along with the rest of my pocket's contents (keys, coins, wallet) that the officer outside was holding in her hand before actually going into the courtroom. Everyone empties their pockets and goes through a metal detector.",
   "created_utc": 1698711102,
   "score": 9,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k765pkj",
   "message": "I was in my room with the door closed. Got up from the bed to walk out and knocked on the door before opening it.",
   "created_utc": 1698714965,
   "score": 10,
   "submission_id": "17k50lc"
  },
  {
   "comment_id": "k76cmz3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17k50lc"
  }
 ]
}