{
 "submission_id": "17k7k9h",
 "title": "What's the strangest fact you know that most people don't?",
 "selftext": "",
 "created_utc": 1698710157,
 "permalink": "/r/AskReddit/comments/17k7k9h/whats_the_strangest_fact_you_know_that_most/",
 "score": 62,
 "url": "https://www.reddit.com/r/AskReddit/comments/17k7k9h/whats_the_strangest_fact_you_know_that_most/",
 "comments": [
  {
   "comment_id": "k76ppk3",
   "message": "If you are exposed to roaches for a long enough time you will become allergic to them. This also means you become allergic to pre-ground coffee.",
   "created_utc": 1698723706,
   "score": 43,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76v3mj",
   "message": "Some medications can cause hair to turn strange colors when bleached. My wife recently got her hair dyed and the first step was bleaching. Because of her medication it went from medium brown to a light pink, like an anime character sort of pink. You could even see a line corresponding to a time when her meds were lowered then raised again.",
   "created_utc": 1698726783,
   "score": 101,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k765ia7",
   "message": "That there are billions of pounds of cheese owned by the American government stored in a cave in Missouri.",
   "created_utc": 1698714884,
   "score": 55,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76ie3s",
   "message": "Bears don't actually hibernate. They torpor.  While they do lower their heart rate and respiration, they are not in the same sort of chemical sleep, true hubernators undergo.  Animals who torpor are able to wake if threatened,  while an animal in hibernation is truly helpless until it wakes up.",
   "created_utc": 1698720232,
   "score": 83,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76p4bo",
   "message": "A test pilot for Americas first jet wore a gorilla mask when flying so if other pilots saw it they would be written off as seeing things",
   "created_utc": 1698723399,
   "score": 185,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76ub4z",
   "message": "When scorpions mate. They do a dance. The male then ejaculates on the ground, grabs the female with his pincers and drags her through it making sure it contacts her sex organ.",
   "created_utc": 1698726295,
   "score": 139,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k773qx8",
   "message": "If you say “manager” when calling any apple store, you’ll get to the store directly and not a random call center.",
   "created_utc": 1698732830,
   "score": 191,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76zh2e",
   "message": "Virginia opossums do not eat ticks and they do not hang by their tails. If you ever see one hanging by their tail, help them down. Humans set them up like that and they’ll hang until they’re exhausted and fall on their heads. They can’t pull themselves back up to the branch from that position and it’s cruel.",
   "created_utc": 1698729644,
   "score": 188,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k7643lj",
   "message": "Charles Osborne (USA, 1894-1991) was the victim of the longest attack of hiccups, which lasted 68 years.",
   "created_utc": 1698714319,
   "score": 74,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76hq6g",
   "message": "Fluoroquinolone antibiotics such as Cipro can cause a rare reaction that causes people to rupture their Achilles tendon just from walking around.",
   "created_utc": 1698719935,
   "score": 183,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k767fno",
   "message": "George Washington didn’t know what dinosaurs were.",
   "created_utc": 1698715672,
   "score": 148,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k75zwq3",
   "message": "That having a spouse die shortly after their partner goes, is very, very common. (Eldercare).",
   "created_utc": 1698712658,
   "score": 227,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76erh6",
   "message": "Leap Year occurs whenever the year is divisible by 4.  But this is just a little too frequent, so a correction is need.  So whenever the year is divisible by 100 there is no Leap Year.  However, this is too much of a correction, so when the year is also divisible by 400, there is Leap Year.",
   "created_utc": 1698718687,
   "score": 205,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k75xmvs",
   "message": "Bed bugs reproduce using a sexual method called \"Traumatic penetration.\" \n\nThe male bed bug stabs the female bed bug with his penis randomly about her exoskeleton.\n\nSometimes multiple males will penetrate the same female at the same time which leads to the very common scenario of female bed bugs literally being fucked to death.",
   "created_utc": 1698711749,
   "score": 92,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76vtrz",
   "message": "Oxford University started 332 years before the Aztec empire began",
   "created_utc": 1698727236,
   "score": 9,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k775sik",
   "message": "For the original Sleeping Beauty, they used recordings of a flamethrower to get the sounds for Maleficent’s dragon-form fire breath.\n\nThe skeletons in Poltergeist were real, but they were not just taken from a graveyard. They were medical cadavers borrowed from a university; renting them for the film was cheaper than using fake skeletons.",
   "created_utc": 1698734484,
   "score": 70,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k778l8d",
   "message": "Next time you're watching a car-ad video, look at the license plate. If it consists only of symmetrical characters and numbers like 'HMI A8' or 'TX W8Y', this is likely a deliberate choice so that the video can be flipped/ mirrored and aired in both right-side and left-side driving markets.",
   "created_utc": 1698736825,
   "score": 174,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k7633fu",
   "message": "If you took every virus particle on Earth and laid them end to end then they would stretch over 200 million light years into space.  \n[https://youtu.be/p7jsRVa1WUo?si=D4QthzjikQ4n1Xai](https://youtu.be/p7jsRVa1WUo?si=D4QthzjikQ4n1Xai)",
   "created_utc": 1698713915,
   "score": 255,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76owth",
   "message": "Bill Murray played Peter Venkman in Ghostbusters. Lorenzo Music voiced Peter Venkman on The Real Ghostbusters.\n\nLorenzo Music voiced Garfield on Garfield and Friends. Bill Murray voiced Garfield in the Garfield movies.",
   "created_utc": 1698723294,
   "score": 204,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76wt1v",
   "message": "The largest tire manufacturer in the world is Lego",
   "created_utc": 1698727862,
   "score": 46,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k75u4if",
   "message": "Giraffes sleep for 20 minutes a day.",
   "created_utc": 1698710334,
   "score": 246,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76zsy7",
   "message": "A funeral home is not required to dispose of a loved one. Anybody can do it, so long as they fill out and file the paperwork, obtain the permits, and follow the same laws as a funeral home.",
   "created_utc": 1698729877,
   "score": 133,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76tvlp",
   "message": "There is a form of autoimmune encephalitis caused by tumors called ovarian teratomas. Teratomas can grown hair, teeth, and even little nervous systems that then trigger the autoimmune brain inflammation. This type of brain inflammation can lead to crazy (literally) symptoms; mood swings, hallucinations, speaking in tongues…\n\nTeratomas are  most common in young women and are thought to be the root cause of many stories involving demonic possession, witches, etc.\n\nIt’s 100% likely that some young woman was burned at the stake or drowned because she had a tumor and the people around her thought she was a witch.",
   "created_utc": 1698726039,
   "score": 76,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76v9pq",
   "message": "Armadillos can carry leprosy.",
   "created_utc": 1698726889,
   "score": 64,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k767qe3",
   "message": "Chlamydia was only known to be found in llamas before the Spanish invaded the Americas. Conclusion? Some Conquistador got freaky with a llama!",
   "created_utc": 1698715794,
   "score": 235,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76tntn",
   "message": "Vaginal lubrication is blood plasma.",
   "created_utc": 1698725911,
   "score": 250,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k77h3fe",
   "message": "The solar system is much larger than most believe. Rather than the sun’s gravitational influence on celestial bodies reaching only as far as Pluto, it reaches hundreds of times farther creating what’s called the Oort cloud. To put it into perspective, it takes sunlight a little over 8 minutes to reach earth while it takes over 1.5 years to reach the edge of the Oort cloud. The nearest Star to ours (Alpha Centauri) is a little over 4 light years away, meaning our solar system actually covers over a third of the distance toward the nearest star system. I like space",
   "created_utc": 1698744225,
   "score": 104,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76pq7k",
   "message": "Blood can freeze and then break and slice open your veins and thaw and you can internally bleed to death.",
   "created_utc": 1698723716,
   "score": 10,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k77d39a",
   "message": "The only English words that contain the word \"meow\" are: meow, meows, meowed, meowing, and homeowner.",
   "created_utc": 1698740735,
   "score": 187,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76ue04",
   "message": "Canada has land borders with 2 different countries:  \n1) With the USA (mostly along the 49th parallel) (also the longest land border in the world)\n\n2) A \\~1.3km border with Denmark on a tiny island called Hans Island. \n\n(Number 2 is the strange fun fact)\n\nTo make it more fun, this second land border was brought about through the \"Whisky War,\" which was a conflict with no violence and no direct contact.",
   "created_utc": 1698726342,
   "score": 225,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k772tw8",
   "message": "Ohio is the only state in the USA that doesn't share a letter with the word mackerel.",
   "created_utc": 1698732131,
   "score": 143,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76yss9",
   "message": "The blast of air you feel when you enter a store is to keep the insects away from entering the store. It is called an “air curtain”, which acts as a barrier and doesn’t let the cold air inside the store flow outside.",
   "created_utc": 1698729172,
   "score": 166,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76ram4",
   "message": "The \"Dancing Plague\" of 1518: In what is now modern-day France, there was a mysterious outbreak where hundreds of people danced uncontrollably and seemingly involuntarily for days on end. This event started with a woman named Frau Troffea and rapidly spread to others. By its peak, as many as 400 people were dancing. Some of them reportedly danced themselves to death from heart attacks, strokes, or sheer exhaustion. To this day, the exact cause of this phenomenon remains unknown, though modern theories suggest it might have been due to ergot fungi poisoning (similar to LSD) or mass psychogenic illness (a collective form of hysteria).",
   "created_utc": 1698724559,
   "score": 193,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76vo92",
   "message": "That in the wildest butterfly effect, the French government dissing the inventor of tinned food led to the creation of napalm",
   "created_utc": 1698727139,
   "score": 190,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76v9nn",
   "message": "The first person and the last person to die during the construction of the Hoover Dam were father and son, and they died 5 years to the day apart.",
   "created_utc": 1698726887,
   "score": 82,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76npke",
   "message": "I’ll wager “most” people don’t know that cold air is better than hot air in internal combustion engines. The explosions in your engine are stronger in the winter.   \n  \nAll this gets very very fuzzy when you start talking about direct injection over carbureted engines and computer controlled timing and trim rates. But at the base of the fact, the air is more dense when it’s cold so you get more oxygen in the cylinder in the same time volume of air. Ultimately less fuel or more fuel can be used depending on your fuel trim to compensate for the desired power output. \n  \nThis is far more evident in older cars. Winter gasoline is also a thing that happens around this time every year. It’s got some extra additives to maintain the same flow rate in extreme cold. It tends to not burn as efficiently.",
   "created_utc": 1698722680,
   "score": 116,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k773ywh",
   "message": "Snakes can predict earthquakes. They can sense an upcoming earthquake from a staggering 75 miles away, up to five whole days before it happens.",
   "created_utc": 1698733007,
   "score": 39,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76zo6i",
   "message": "trees get their structure from stripping carbon dioxide from the air apart.  the carbon is what makes them hard.  from the air.  thanks Richard Feynman",
   "created_utc": 1698729784,
   "score": 37,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76g35h",
   "message": "Large CO2 emissions from cows are from their burps, not farts.",
   "created_utc": 1698719233,
   "score": 84,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k77bp5p",
   "message": "Some species of fish, like the cuttlefish, have males that aren’t exactly “Alpha males”, so they pretend to be females to win over the real females as friends, and then surprise fertilize them.",
   "created_utc": 1698739520,
   "score": 63,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k775wan",
   "message": "Buildup of an antiviral medication in your body can cause you to think that you are dead to the point where you stop eating. (Cotard’s delusion)",
   "created_utc": 1698734570,
   "score": 25,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k77f0hr",
   "message": "Despite it not being so, Microsoft Excel counts the year 1900 as a leap year. It isn’t. \n\nThe reason why goes back to one of the pre-Excel killer apps of the day, Lotus 1-2-3 which did the same thing. So Excel did this too in order to be compatible. And still does so to this day.  \n\nWhy did Lotus 1-2-3 do this? Some say it’s just a error due to the rather obscure rule that says a year is a leap year if it is evenly divisible by four, except if it’s also evenly divisible by 100 *except* if it’s also evenly divisible by 400. So 1600 and 2000 were leap years, but not 1700, 1800, or 1900. \n\nHowever, a more plausible story is that the additional calculations necessary for this were just too much for the memory (640kb) and processors of early PCs and the decision was consciously made to just ignore the edge case because how much would it really effect?",
   "created_utc": 1698742464,
   "score": 26,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76o9ho",
   "message": "Nature evolved dogs to become your pets.\n\n\"Thus, oxytocin and vasopressin facilitate bonding between parent and child, and between couples. \n\nNow for something truly charming that evolution has cooked up recently. \n\nSometime in the last fifty thousand years (i.e., less than 0.1 percent of the time that oxytocin has existed), the brains of humans and domesticated wolves evolved a new response to oxytocin: when a dog and its owner (but not a stranger) interact, they secrete oxytocin.\"\n\nRobert M. Sapolsky, Behave: The Biology of Humans at Our Best and Worst",
   "created_utc": 1698722961,
   "score": 133,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k75uk7e",
   "message": "Human skin has no receptors for water",
   "created_utc": 1698710511,
   "score": 153,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k7682s7",
   "message": "In before \"Lobster used to be prison food.\"",
   "created_utc": 1698715936,
   "score": 156,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76nzov",
   "message": "Bees don’t have hearts.",
   "created_utc": 1698722821,
   "score": 98,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76zsgt",
   "message": "Wombats have square poops",
   "created_utc": 1698729868,
   "score": 26,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k77baz7",
   "message": " The male Argonaut octopus impregnates  the female by  detaching and throwing his penis at her.  It then swims after her while he slumps off to regrow his penis.",
   "created_utc": 1698739176,
   "score": 22,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76krys",
   "message": "A 737 jet engines are held on by only 3 bolts",
   "created_utc": 1698721289,
   "score": 38,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76r19y",
   "message": "Richard Nixon had his attorney general schedule drugs instead of the countries leading medical professional for some reason.",
   "created_utc": 1698724417,
   "score": 63,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76myck",
   "message": "The word 'Almost' is the longest word in the English language in which all of its letters are in alphabetical order.",
   "created_utc": 1698722307,
   "score": 208,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k75xpkc",
   "message": "That high beams aren't supposed to be used in the rain, apparently.",
   "created_utc": 1698711778,
   "score": 57,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76wb9z",
   "message": "Elvis’s colon weighed over 40# when he died.",
   "created_utc": 1698727544,
   "score": 30,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76k5bi",
   "message": "idk how many people may know this on here, but we humans are the only mammal that can eat avocado. it is poisonous to all other mammals/animals.",
   "created_utc": 1698721011,
   "score": 145,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k76slz0",
   "message": "If you were to take all of you blood vessels and put them all in a straight line end to end, you’d die.",
   "created_utc": 1698725304,
   "score": 253,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k7627ch",
   "message": "It is impossible for most people to lick their own elbow. ...\nA crocodile cannot stick its tongue out.\nA shrimp's heart is in its head.\nIt is physically impossible for pigs to look up into the sky.\nThe \"sixth sick sheik's sixth sheep's sick\" is believed to be the toughest tongue twister in the English language.\nIf you sneeze too hard, you could fracture a rib.\nWearing headphones for just an hour could increase the bacteria in your ear by 700 times.\nIn the course of an average lifetime, while sleeping you might eat around 70 assorted insects and 10 spiders, or more.\nSome lipsticks contain fish scales.\nCat urine glows under a black-light.\nLike fingerprints, everyone's tongue print is different.\nRubber bands last longer when refrigerated.\nThere are 293 ways to make change for a dollar.\nThe average person's left hand does 56% of the typing (when using the proper position of the hands on the keyboard; Hunting and pecking doesn't count!).\nA shark is the only known fish that can blink with both eyes.\nThe longest one-syllable words in the English language are \"scraunched\" and \"strengthed.\" Some suggest that \"squirreled\" could be included, but squirrel is intended to be pronounced as two syllables (squir-rel) according to most dictionaries. \"Screeched\" and \"strengths\" are two other long one-syllable words, but they only have 9 letters.\n\"Dreamt\" is the only English word that ends in the letters \"mt\".\nAlmonds are a member of the peach family.\nMaine is the only state that has a one-syllable name.\nThere are only four words in the English language which end in \"dous\": tremendous, horrendous, stupendous, and hazardous.\nLos Angeles' full name is \"El Pueblo de Nuestra Senora la Reina de los Angeles de Porciuncula\"\nA cat has 32 muscles in each ear.\nAn ostrich's eye is bigger than its brain.\nTigers have striped skin, not just striped fur.\nIn many advertisements, the time displayed on a watch is 10:10.\nThe characters Bert and Ernie on Sesame Street were named after Bert the cop and Ernie the taxi driver in Frank Capra's \"It's a Wonderful Life.\"\nA dime has 118 ridges around the edge.\nThe giant squid has the largest eyes in the world.\nMost people fall asleep in seven minutes.\n\"Stewardesses\" is the longest word that is typed with only the left hand.",
   "created_utc": 1698713554,
   "score": 3,
   "submission_id": "17k7k9h"
  },
  {
   "comment_id": "k776wc1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17k7k9h"
  }
 ]
}