{
 "submission_id": "17k7dp3",
 "title": "What's a local urban legend or ghost story unique to your town?",
 "selftext": "",
 "created_utc": 1698709653,
 "permalink": "/r/AskReddit/comments/17k7dp3/whats_a_local_urban_legend_or_ghost_story_unique/",
 "score": 48,
 "url": "https://www.reddit.com/r/AskReddit/comments/17k7dp3/whats_a_local_urban_legend_or_ghost_story_unique/",
 "comments": [
  {
   "comment_id": "k75tu8m",
   "message": "Local park is called fanny on the hill (not officially). The pub was named the same but it is closed now, not named that at the time, obviously. Back when dick turpin was robbing carriages up shooters hill, he was in a relationship with fanny, who worked at the pub (possibly a prostitute). Travellers would stop at the pub on their journey and she would use a mirror to signal to him if they had things worth stealing. When dick was caught and hanged, she went to the park behind the pub and hung herself from the biggest tree at the top of the hill. Her ghost still scares people today. \n\nNow this is the story I was told as a kid. I googled it as an adult and found nothing. So I posted in the local Facebook group. Several other people were told that same story. So why isn't it on the Internet?",
   "created_utc": 1698710215,
   "score": 11,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75ui4t",
   "message": "Okay, I'm from Colombia and in the small city I live in there is this urban legend called \"Los niños dulce\" or The Candy/Sweet kids. The legend says that there was an orphanage in a mountain many, many years ago that burned down. And all the kids died there. If you go at midnight in your car to that mountain with flour and candy and you spread flour in the hood of your car, then put the candy in the hood as well, get into the car and lock all the doors, you first will hear children lullabies and you will feel as if someone is on top of the hood of your car. When all that passes, if you get out, you can see the imprint of hands and feet children size in the flour and some of the candy missing,",
   "created_utc": 1698710488,
   "score": 8,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k760htr",
   "message": "Ogopogo! Like Nessie but Canadian 😎",
   "created_utc": 1698712880,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75t7az",
   "message": "The giant wild dog. I grew up in a small regional Australian town surrounded by bush, and there was always a story that there was a huge wild dog, or sometimes a pack of them, that would stalk people who walked up bush tracks. The accounts vary, sometimes it was the size of a great dane, other times the size of a horse, or even a car if people were being extra. \n\nNever saw it myself, but I remember going up into the bush with my cousins as a kid trying to spot it.",
   "created_utc": 1698709952,
   "score": 6,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75x18x",
   "message": "Not my town, but my state.\n\nThe Michigan Dogman.",
   "created_utc": 1698711510,
   "score": 5,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75y7p9",
   "message": "There are quite a few but we also have our own cryptid. The Giwoggle!",
   "created_utc": 1698711982,
   "score": 5,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75wvws",
   "message": "Nain Rouge.  The hobgoblin of the early French settlement of Detroit.",
   "created_utc": 1698711450,
   "score": 4,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75td87",
   "message": "We have a lake named Witchduck because they used to drown women there in the 1700's who were suspected of being 'witches'.",
   "created_utc": 1698710020,
   "score": 5,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75yoed",
   "message": "The conjuring house in Burrillville , Rhode Island\n\nNot from RI but grew up in the next state over",
   "created_utc": 1698712166,
   "score": 3,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k7604qd",
   "message": "There is a local business man that has been accused of raping several women, and it’s said he also has kiddy porn. The local police covered up his crimes and when a fed found out about it, the police helped him to escape, he got caught and magically he escaped out of handcuffs and shackles and escaped out the back of a locked transport.  Even after escaping the second time the local media does not cover the story it’s like being shoved on page 13 on the papers. \nThis is the Sean Williams case the man is still on the loose.",
   "created_utc": 1698712742,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k760fhw",
   "message": "Bunny man bridge. Such a lame story.",
   "created_utc": 1698712855,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k765t8y",
   "message": "I grew up in Ohio, and in the next county over, there used to be a home for children with the spectacular name of Gore Orphanage. (If you're ever on the Ohio Turnpike west of Cleveland, you'll see the sign for Gore Orphanage Road). \n\nSupposedly in the 19th or early 20th century, the orphanage caught fire one night. People rushed to get out, but many of the children who attempted to jump out of windows were trapped by the bars on the windows that had been installed for safety. It was tragic and deadly, with children's screams carrying through the night while people tried to battle the blaze. \n\nTheir spirits continue to rest uneasy, however. If you go to the site where the orphanage once stood, which is located in a rural, isolated area near Lake Erie, you can often hear the cries and moans of the children, still sounding after all these years. This typically happens at night. Generations of northern Ohio high school kids have driven out there, typically to scare the crap out of their girlfriends or just to smoke weed. \n\nThe story is untrue, of course. The Gore family did run an orphanage for several years, but after a while, donations from local churches weren't enough to keep the home open, and eventually they moved away, and the large home sat empty. No fire, no death, no haunting at all. It's mainly the high school kids who kept the story alive because it sure sounds cool.",
   "created_utc": 1698715008,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k75tt39",
   "message": "Nice try, Fred Jones",
   "created_utc": 1698710201,
   "score": 2,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k763sa1",
   "message": "[Bunnyman Bridge](https://en.m.wikipedia.org/wiki/Bunny_Man)",
   "created_utc": 1698714193,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k763m7s",
   "message": "The Mongollon monster is the Bigfoot of Arizona",
   "created_utc": 1698714125,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k76412e",
   "message": "A park a five minute walk from my childhood home, and surrounding houses were used as a hiding place for a dismembered corpse about 20 years ago. I think the head was found in the park bushes by a dog walker. Killer was quickly caught after trying to flee the country but it led to a few local ghost stories.",
   "created_utc": 1698714291,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k765h8y",
   "message": "When the British did a bunch of nuclear bombing test out in  Maralinga. They thought they clear he areas of humans, but a bunch of first Australians were caught up in he testing. To hide what they done. They gathered up everyone, and hid them away in the catacombs of Adelaide, and have rise of the Mole People.",
   "created_utc": 1698714872,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k766v02",
   "message": "we have the classic Cry Baby Bridge legend as usual.\n\nThe baby got hit by a car in that bridge pretty much Halloween. So once its Halloween at night and you go across Cry Baby Bridge you'd hear the kids cry during that night.",
   "created_utc": 1698715439,
   "score": 1,
   "submission_id": "17k7dp3"
  },
  {
   "comment_id": "k76832e",
   "message": "I live in Beltsville, MD, home of the Beltsville Agricultural Research Center and the legend of the Goatman.",
   "created_utc": 1698715939,
   "score": 1,
   "submission_id": "17k7dp3"
  }
 ]
}