{
 "submission_id": "17kj2xv",
 "title": "They say \"Nothing is ever lost on the internet\" but what is something you have been searching for years and haven't found it yet?",
 "selftext": "",
 "created_utc": 1698752704,
 "permalink": "/r/AskReddit/comments/17kj2xv/they_say_nothing_is_ever_lost_on_the_internet_but/",
 "score": 148,
 "url": "https://www.reddit.com/r/AskReddit/comments/17kj2xv/they_say_nothing_is_ever_lost_on_the_internet_but/",
 "comments": [
  {
   "comment_id": "k77tjd4",
   "message": "Milfs in my area",
   "created_utc": 1698752926,
   "score": 60,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77tz58",
   "message": "My geocities was not one of the ones saved.",
   "created_utc": 1698753171,
   "score": 22,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77tt27",
   "message": "I shot an interview with Rodriguez and Malik Bendjelloul for All Music Guide. It was shortly after the film came out. It's gone forever.",
   "created_utc": 1698753077,
   "score": 16,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77xilr",
   "message": "Took a while but this morning I finally found it! Turns out she went by \"Busty Anna\".",
   "created_utc": 1698755097,
   "score": 11,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77zeav",
   "message": "There’s this book I read as a kid - a girl moves with her family and new stepdad to somewhere remote.  She finds a puppy she names PJ and hides it from the family.\n\nI must be mixing up the details because I can find NOTHING of this book.  I’ve been searching for years.",
   "created_utc": 1698756056,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77yf97",
   "message": "I sadly have not been able to access my old Photobucket (which I had for many years before it became a paid service) and it seems the email it was linked to was also purged by the host site. :(",
   "created_utc": 1698755564,
   "score": 8,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k780d6k",
   "message": "There was a comedian from the early 90’s on one of those late night stand up brick wall clip shows. He did this weird bit where he says “oh loma” with a snakey hand gesture. It was supposed to be an alternate way to express sympathy. I don’t remember if it was actually funny or not, but “oh loma” is a regular part of my vocabulary now and I’d love to find the clip.",
   "created_utc": 1698756535,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77xl2d",
   "message": "My copy of \"Marble ultra blast\" on Microsoft Xbox live. A few other games I have downloaded digitally that have just disappeared.",
   "created_utc": 1698755132,
   "score": 6,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k781f9l",
   "message": "There's a well known segment that Stephen Colbert did as a daily show correspondent where he was discussing Prince Charles and eating a banana... And he and Jon Stewart absolutely lose it, crying with laughter. The only video I can find is obviously edited for time, but I distinctly remember a considerably longer, unclipped version. Would love to see it again.",
   "created_utc": 1698757029,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77thxh",
   "message": "My happiness",
   "created_utc": 1698752902,
   "score": 10,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7819ii",
   "message": "This video called Self Defense for Dorks that used to absolutely crack my shit up. I think it was pre-Youtube. Likely from CollegeHumor. \n\nOne memorable moment is the instructor telling his assistant to \"come at him\", the assistant says \"full bore?\", the instructor waves him on and then does some kind of throat move that causes the assistant to make a god awful choking noise. My friends and I used to quote the *full bore*? constantly.",
   "created_utc": 1698756956,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77v8lg",
   "message": "friendster 🤣",
   "created_utc": 1698753875,
   "score": 3,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77va1a",
   "message": "There's a really similar song to \"Where I'm standing now by Television skies\" whit as far as I remember the expect same beat as the start of the song, I listent to it when I was way younger and can't find it sadly.\nMaybe if someone would know song I couldn't find for 3 years by now I would be greatful to know the name of the song",
   "created_utc": 1698753897,
   "score": 3,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77ygey",
   "message": "That one porn video",
   "created_utc": 1698755581,
   "score": 3,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77v7tm",
   "message": "All the news on the art exhibitions I had or was part of. Like where the hell are these hiding I need them for references.",
   "created_utc": 1698753863,
   "score": 2,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77vohu",
   "message": "A video a friend had posted a long time ago and i cant find the file on my drives anywhere",
   "created_utc": 1698754117,
   "score": 2,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77xojo",
   "message": "The name of these toys I used to have when I was younger that I have unfortunately lost.",
   "created_utc": 1698755182,
   "score": 2,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77xwqa",
   "message": "I remember playing this 2d wine making game either flash or mobile where you unlocked more grape types as you played. I've searched a couple times but only like 3-4 games popup and non of them seem to be what I'm remembering.",
   "created_utc": 1698755299,
   "score": 2,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77xwwv",
   "message": "That one funny post I saw on Pinterest 3 years ago",
   "created_utc": 1698755302,
   "score": 2,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77yzae",
   "message": "I have been searching for a long time for a flash game i played 15 years ago on those flash gaming websites. It was a game where you had to grab a hamburger and run away for hungry people. These games were so fun.",
   "created_utc": 1698755849,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77zeb5",
   "message": "Tubgirl.",
   "created_utc": 1698756056,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77ziv3",
   "message": "my MySpace pictures",
   "created_utc": 1698756118,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k780cru",
   "message": "That one video on a certain hub",
   "created_utc": 1698756529,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k781i60",
   "message": "Software for the Actel Activator series of cpld and fpga programmers.",
   "created_utc": 1698757067,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k781uv7",
   "message": "A lot of YouTube dramas, have videos that haven't been never dowloaded  or archived by anyone.\n\nThese videos are: Apologies, Responses to commentary channel's criticism, videos that have controversial parts etc.\n\nThere a lot of YouTube videos that are lost and I want to find them all but never can do it.",
   "created_utc": 1698757230,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7820ki",
   "message": "There was a German documentary or show with an overweight host who talked in a heavy American accent. He went to a meetup with a bunch of esoteric people who then reenacted the relationship between the planets in our solar system. They found out that something is threatening the sun and somehow will destroy the moon. The host was acting as the moon in this case and said \"Der Mond darf nicht zerstört werden...\" (the moon must not be destroyed). It was incredibly bizarre but just as funny.",
   "created_utc": 1698757304,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7828eh",
   "message": "Interview with Mitchell McConnell and John Boehner by Dan Rather(I think)",
   "created_utc": 1698757406,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782a2w",
   "message": "Terri Gross interview with Gene Simmons. He  acted like a total douchebag right from the start so I expect he threatened them with legal action to get it shut down.",
   "created_utc": 1698757427,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782a5m",
   "message": "Save Toby the rabbit website is gone and all the recipes and pictures he had have vanished. Only news and wiki articles about it remain. Also, a lot of flash games. There is this silly one called Romp.com which has been wiped from the net as well.",
   "created_utc": 1698757428,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782afr",
   "message": "There is a music I heard twice when I was on a trip in Africa, it was arguably the best one I ever heard or at least top 3 of all time, I vaguely remember the videoclip and that's how I am chasing it, it's been around 7 years and I still haven't found it, it seems like it vanished forever",
   "created_utc": 1698757432,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782czw",
   "message": "I remember a movie scene, I believe it´s from the late 80´s or 90´s, about a man entering a room to find his wife having s´x with a vampire dude with short white hair. I remember the man and wife having eye contact and she has this weird unsettling look on her face as if she doesn´t want to be there either. It´s not a p´rn but perhaps an erotic thriller?",
   "created_utc": 1698757466,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782f4d",
   "message": "An interview with Trent Reznor from Jian Ghomeshi.Ghomeshi was cancelled but he did a great interview.The show is called q from Canada",
   "created_utc": 1698757493,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782fwp",
   "message": "My friends and I in college made a video called “4/20 Training Montage” which had clips of us smoking weed / exercising in preparation for April 20th (set to Push It To The Limit from Scarface). My roommate edited it with Windows Movie Maker, and we uploaded it to CollegeHumor and Google Video (before it shut down when Google bought YouTube).\n\nCollegeHumor and Google Video are both long gone, and I have no backup copy of it.",
   "created_utc": 1698757503,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782ikq",
   "message": "15 years ago, my high-school mates and I made a short movie for a school project. It was the story of a girl whose very conservative father finds out she's having sex with her boyfriend, so he kicks her out of the house; her boyfriend breaks up with her, because he only cared about her family's money; and so she ends up becoming a prostitute. In the end, of course, this one client falls in love with her and helps her finding a new perspective in life. \n\nI played the pimp.\n\nThe whole thing was on YouTube, posted to one of the guys' channel, but I can't seem to find it anymore. If the video's been deleted, I'm afraid our beautiful short has become lost media 😔",
   "created_utc": 1698757538,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k785zkf",
   "message": "Love and affection.",
   "created_utc": 1698759078,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77x1ps",
   "message": "My faith in humanity",
   "created_utc": 1698754852,
   "score": 3,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77xvo2",
   "message": "The full, entire episode of trump on the Oprah show.\n\nYou can find very short clips but the full episode is nowhere to be found",
   "created_utc": 1698755284,
   "score": 2,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k781s6t",
   "message": "A job for me.",
   "created_utc": 1698757196,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7814k0",
   "message": "Some anime amv on youtube, I particularly remember one bleach amv Monster I cannot find anywhere",
   "created_utc": 1698756891,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77vtze",
   "message": "There was a Flash animation on rathergood.com where Cliff Richard was shagging the corpse of Princess Diana singing \"Get your fucking tits out, you dirty fucking slag-bag, my cock right up your cuntflaps, la la la la la gonads\" to the tune of The Vengabus. It cheered me up no end in the early 2000s but - perhaps unsurprisingly - appears to have been entirely scrubbed from the internet.",
   "created_utc": 1698754199,
   "score": 0,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77tkio",
   "message": "My dad",
   "created_utc": 1698752944,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77wb9k",
   "message": "Two things. \n\nA video of a street fight that I used to watch on MySpace (I think? Or maybe YouTube) where this black kid asks the white kid if he called him a bitch then goes to town on him. Basically walking while punching this white kid. The white kid gets up in a defeated manner and kinda adjusts his t-shirt. Then for whatever reason, at the end of the video, I remember it cutting to an exploding green (?) apple. \n\nAnother is this song that was on MySpace that I think was called “Pimpin Hoes in the Parking Lot”. Like the title (?) says, the chorus is kinda chopped and screwed sounding and says something about pimpin hoes in the parkin lot.z",
   "created_utc": 1698754458,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77voey",
   "message": "Do they say that? \n\nThey are idiots.",
   "created_utc": 1698754116,
   "score": 255,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77vym7",
   "message": "The first video I masturbated to. A true loss.",
   "created_utc": 1698754269,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77z9vj",
   "message": "The name of an 80's country song with the lyic - \n\n\"if you're looking for trouble in Waco\n\nYou must never heard\n\nOf the red headed sheriff with the 6 gun canon\n\nAnd the boy with man sized words...\"",
   "created_utc": 1698755995,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77zm3j",
   "message": "There's this one porno of a petite blonde girl just going to town on herself using a blue suction cupped dildo on her wall/door frame. Shes on all fours really just bringing the house down on that thing. Sweet vid.",
   "created_utc": 1698756163,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77zshe",
   "message": "there was a photo from the very early 2000s, of young Putin visiting Israel, and walking in a corridor with Ariel Sharon.\n\nBut he was not walking with him, he was more like following him like an obedient dog, while looking at him so deferentially, while Ariel Sharon walked with dignity like a man.\n\nIt was so embarrassing for Putin\n\nThe image is stuck in my head forever, but I was unable to find it again.\n\nI assume Kremlin bought the rights and deleted all traces from the internet",
   "created_utc": 1698756251,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k77zsnb",
   "message": "That one song stuck in my head that I don't know anything about except how it sounds.",
   "created_utc": 1698756253,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7807qd",
   "message": "Blindfolded 6 man boxing",
   "created_utc": 1698756461,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k780y74",
   "message": "A video of a man in a puppet costume with big head while hearing music like \"uchi guchi guchi guchi...\"\n\nHave it in my head since 10 years or so... can't find it again",
   "created_utc": 1698756809,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k781dkn",
   "message": "- this one Taylor swift song \n\n- A fanfic I read as a kid",
   "created_utc": 1698757008,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k782zfp",
   "message": "There’s a series where all the parents disappear and the kids are left to rule the apocalyptic wasteland. Kinda neat",
   "created_utc": 1698757751,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k78332z",
   "message": "There was a successful 60's music performer who was touring solo around 1980. He was touring with an obscure 70's session guitarist trying to break out into his own career. \n\nThe local radio station hyped up the show to the gills, playing a lot of tracks from the guy's old 60's band. Every hour, it seemed, we got a new promo. I wasn't particularly interested in the show, being young, but I followed the promos and the songs with fascination.\n\nThe show finally came and went, and there was a writeup in the paper the next day. The featured former star missed the show because \"his wife was having a baby\", so the concertgoers got treated with an hour and half's worth of an unknown sessionman. \n\nI have never been able to determine if the story was real. To this day, I have no idea if this performer has any offspring who would be in their early forties today.",
   "created_utc": 1698757797,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k78364i",
   "message": "Owen Heart falling to his death.",
   "created_utc": 1698757835,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7836th",
   "message": "Back in the late 70's, early 80's my father used to play a record for my brother and I. I have been looking for it ever since he passed away. I only remember a very small portion of it. But it was a man talking and he says either: \" Welcome Doctor Memory or Open Doctor Memory\"\n\nNot much to go on I know..but I've searched and searched to no avail...",
   "created_utc": 1698757844,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k783mpy",
   "message": "A local news outlet used to run a video series highlighting shelter dogs. My family ended up adopting one of those dogs. After he passed, I tried finding the video on their site and it was gone. Reached out to them and they said they don't have it in their archives or anything. \n\nBummed me out.",
   "created_utc": 1698758046,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k783rb6",
   "message": "I definitely remember a comedy sketch about roller food. You know, gas station hot dogs and similar. It had stoned teens acting like zombies for roller food. Maybe The Whitest Kids I Know or the Kids in the Hall?\n\nI've searched for it occasionally over the years and I'm beginning to think I hallucinated the whole thing.",
   "created_utc": 1698758103,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k783we3",
   "message": "Some song i dont remember the name or thr lyrics and just the melody kinda and its driving me nuts when i try to think sbout it",
   "created_utc": 1698758165,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k783wqh",
   "message": "That porn video that I watched JUST YESTERDAY",
   "created_utc": 1698758170,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k784361",
   "message": "oy leyli lado lado ley\n\nIt’s a russian folk song. one night i was walking and i heard an old woman singing in a park. the melody was so enchanting i sat there and listened for hours. a whole crowd of people eventually gathered. all of us were silent and stunned. we didn’t want her to stop singing but we couldn’t leave it was so beautiful \n\nwhen it was over i asked her what it was and she said it was just an old song from her country about leyli and lado. roughly equivalent to a romeo and juliet type story except it was russian and i can’t find any mention of it much less sheet music or a recording",
   "created_utc": 1698758250,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k78466q",
   "message": "There was this small game - not really a game even, maybe a piece of interactive art. \n\nIt was in black and white and you were a man standing at a bus stop. You could walk around with arrow keys, but if you pressed up you took to the sky and could slowly glide around a starry sky. \n\nIt was a melancholic and very charming piece that I saw once and searched for since.",
   "created_utc": 1698758288,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k784ox1",
   "message": "Back when MTV was new and played music, they used to have short clips in between videos/shows. One was of parents taking their little girl to a sheep farm to pick out a lamb. She picks out a lamb and you think, \"aw, isn't that sweet?\"\n\nIn the next frame, she has a knife and fork in her hands, her face is smeared with grease and she's saying, \"more mint jelly, please!\"\n\nCan't find it to save my life.",
   "created_utc": 1698758518,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k784pbr",
   "message": "A working copy of flash game Taco Joe",
   "created_utc": 1698758523,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k784pu7",
   "message": "Music. One was a dancehall reggae mix I downloaded off Napster and I’ve never been able to find it again. Iirc it was labelled as a ‘mill street’ mix. The other was one hit wonder song about a guy from a small town arriving on a bus in New York and having some weird experiences. I seem to remember there being something to do with losing his coat.",
   "created_utc": 1698758529,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k784vk3",
   "message": "In around 2001 or 2002, there was a flash Mario bros game. If you typed \"play Mario\" into Google, it was there. Then suddenly it wasn't. It was the best unofficial Mario game I've ever played. Probably riddled with viruses but still",
   "created_utc": 1698758598,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k784w2t",
   "message": "Complete Digital Recordings of Douglas Adams reading his Hitchhikers Guide to the Galaxy. - The Martin Freeman read versions lack the author’s intended delivery and are edited for the profanity the author intended.",
   "created_utc": 1698758604,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k784z11",
   "message": "That one porno I accidentalky deleted from my hard drive in 2017.",
   "created_utc": 1698758640,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k78550k",
   "message": "Nude glamour model Kyla Cole's movie The Villa. I downloaded it some time around 2003 - 2005, maybe? And haven't been able to find it again after that...",
   "created_utc": 1698758712,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k78556u",
   "message": "about 25 years ago I found a clip of a black and white documentary film about a tribe of people that looked physically different from the rest of the human race - extended rib cages and long arms, among other differences. One quote I remember from the footage is  one of these people saying he was afraid that when he dies someone would steal his bones, then the narrator stated that it happened. \n\nBeen searching for that documentary ever since.",
   "created_utc": 1698758714,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k785dhm",
   "message": "What I'm looking for.  Still.",
   "created_utc": 1698758812,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k785ehz",
   "message": "There was a skit on SNL of a preview of a fake movie called \"Rain.\" It was around the time When Twister and a few other disaster movies were really popular. I remember it had Cheri O'Terry and I think Will Ferrell in it, it was hilarious! I'm convinced SNL scrubbed it for reason because I've been searching for it forever and appears to not have existed.",
   "created_utc": 1698758826,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k785mzr",
   "message": "I’ve found it in recent years, but in like 2011-2014, I couldn’t find anything about the N64 Double Pro Fighter. I’m glad things have changed.",
   "created_utc": 1698758927,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k785uvl",
   "message": "Validation",
   "created_utc": 1698759021,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k785yq2",
   "message": "The OG cookbook",
   "created_utc": 1698759067,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7864px",
   "message": "I was just looking for my mom's obituary :(",
   "created_utc": 1698759140,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7868km",
   "message": "Dignity and decency in republicans",
   "created_utc": 1698759186,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k7868v3",
   "message": "An old old website, and if anyone knows anything about it, please help me. I just trying to find an old website that had a bat as the person to just go places and you were in a halloween like town. I don't remember much but it's in my mind ever day. I think if I found today it would amazing.",
   "created_utc": 1698759190,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k786a4p",
   "message": "The old McDonalds pizza commercials.  \n\n*\"It's a pizza Happy Meal, pepperoni and cheese, you also get a drink and a toy that's sure to please!\"*",
   "created_utc": 1698759205,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k786cb9",
   "message": "**NEIL YOUNG CONCERT FOOTAGE**: I've been trying to find footage of a N.Y. concert. The stage had a HUGE set of wings over it. I believe it was footage of a European show.\n\n\u0026gt;*\"Internet...you're my only hope.\"*",
   "created_utc": 1698759230,
   "score": 1,
   "submission_id": "17kj2xv"
  },
  {
   "comment_id": "k786eq0",
   "message": "There was a history show on the Battle of Tarawa in WW2. It had a clip of future actor Eddie Albert (Green Acres) steering his LST to shore and maneuvering it around the beach. You could easily see that it was him. BAMF who earned his bronze star that day. Tarawa was hell for the navy and marines.  Anyway, cannot find the clip anywhere",
   "created_utc": 1698759259,
   "score": 1,
   "submission_id": "17kj2xv"
  }
 ]
}