{
 "submission_id": "17km47u",
 "title": "How do men enhance their physical appearance?",
 "selftext": "",
 "created_utc": 1698761908,
 "permalink": "/r/AskReddit/comments/17km47u/how_do_men_enhance_their_physical_appearance/",
 "score": 176,
 "url": "https://www.reddit.com/r/AskReddit/comments/17km47u/how_do_men_enhance_their_physical_appearance/",
 "comments": [
  {
   "comment_id": "k78cwbx",
   "message": "work out, skincare, haircut",
   "created_utc": 1698761935,
   "score": 56,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78kk3k",
   "message": "Weight management, IMO, is a big one. Fat faces and round middles really age you. This is something that I really struggle with. Especially after I hit 50. I am carrying an extra 10-15 lbs and it really makes me look old. Update the haircut. Dress like you put some thought into it and wear clothes that fit. Quality over quantity for sure.",
   "created_utc": 1698764919,
   "score": 52,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78dk8h",
   "message": "Regular exercise and a balanced diet really help",
   "created_utc": 1698762196,
   "score": 178,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78q7dk",
   "message": "The gym. You are still ugly, buy at least you are in shape.",
   "created_utc": 1698767092,
   "score": 16,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78hsqa",
   "message": "So many great answers but an underrated one is correcting your posture! When my husband’s happier, he’s standing taller, he says he feels a more positive energy from people he’ll interact with so it makes him feel better too. Hold your head up :)",
   "created_utc": 1698763870,
   "score": 60,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78jy0u",
   "message": "I’ve read that rolling up our sleeves helps",
   "created_utc": 1698764686,
   "score": 197,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78cyns",
   "message": "Skincare and good outfits",
   "created_utc": 1698761960,
   "score": 159,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78hxgr",
   "message": "Ever hear the phrase \"death by 1000 cuts\"? Like that but the opposite. Yank the nose hair, get rid of the extra long eyebrow hairs. Get your pants hemmed. Moisterize.\n\nIt all has compound interest.",
   "created_utc": 1698763922,
   "score": 254,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78d0pt",
   "message": "I grew a beard to hide some of my chins.",
   "created_utc": 1698761982,
   "score": 169,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78orcl",
   "message": "The easiest ways are clothes that actually fit you and standing up straight (posture). \n\nAlso accessories. They make you look intentional and well put together and a lot of men don't accessorize so they make you stand out. I've been complimented on watches, bracelets, and necklaces by women more than anything else by far (except maybe shoes). They seem to really catch their eyes.",
   "created_utc": 1698766552,
   "score": 246,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78ez98",
   "message": "Acquire däs muscles",
   "created_utc": 1698762758,
   "score": 193,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78cy4t",
   "message": "Turning 30",
   "created_utc": 1698761954,
   "score": 88,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78k4vv",
   "message": "Obviously workout, good diet, etc. Something I cannot stress enough though, wear clothes that fit you. So many people wear clothes that are ill fitting and look sloppy because of it.",
   "created_utc": 1698764760,
   "score": 171,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78f7zh",
   "message": "Lift weights,  do cardio.    Lose fat weight.\n\nthe thing about lifting weights?  (JMO), is that it seems to enhance your mental outlook and confidence.   Cardio doesn't do that (for me).      \nSo you get a double improvement there.   a better feeling, stronger bod and a better disposition/confidence.\n\nWin Win.",
   "created_utc": 1698762854,
   "score": 181,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k793ynr",
   "message": "Put on a very fancy hat",
   "created_utc": 1698772179,
   "score": 95,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79ibtt",
   "message": "blast a gram of tren each week",
   "created_utc": 1698777478,
   "score": 224,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k7973pw",
   "message": "1. Skincare- moisturizer, retinol, vitamin c and sunscreen \n\n2. Exercise regularly and keep a normal BMI\n\n3. Sleep 7-8 hours regularly \n\n4. Eat a balanced diet, aka your vegetables too. \n\n5. Find a haircut that works for you, and get it 4-5 weeks if it’s a short haircut.\n\n6. Find a brand of clothes that fit your body type well, or tailor your clothes. This subtle difference really changes how put together you look.",
   "created_utc": 1698773341,
   "score": 132,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78vhqk",
   "message": "Exercise. Don't need to be a bodybuilder, but you should be able to see muscle tone where muscle tone is supposed to be. \n\nHaircut. I'm bald so it is what it is, but if you have a good head of hair, talk to a good barber about styling options.\n\nBeard. If you grow a beard, maintain it. Trim stray hairs that stick out, shave the stubble on your neck and cheekbones.\n\nPosture. Walk/stand with your chin up and shoulders slightly back. You look taller and more confident. Don't need to walk everywhere with your chest puffed out. It should be comfortable.\n\nClothes. Dress well, in age appropriate clothes. If you are in your 30s+, don't wear skinny ripped jeans and \"streetwear\" tops. Middle of the road brands like J. Crew, Banana Republic, and Perry Ellis should be about where you're living. Add chinos to your wardrobe. Look into more \"adult\" sneaker options like Cole Haan. \n\nHygiene. Keep your nails clean and trimmed, brush your teeth and floss, look into teeth whitening options if it's applicable, don't smell bad, consider cologne/fragrances.\n\nFinally, just be confident in general. Avoid searching for pity from people. Don't overshare problems with people who you don't have that level of relationship with. Don't complain about life/relationship issues on social media etc.",
   "created_utc": 1698769043,
   "score": 203,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78lf4q",
   "message": "Shitty Breakups. Self-hatred.\n\nThen we go gym, buy good clothes, practice skincare and groom hair and eat healthy.",
   "created_utc": 1698765252,
   "score": 132,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79bioj",
   "message": "Easy stuff:  grooming and styling.  \nHard stuff: maintain a healthy weight and put on some muscle.",
   "created_utc": 1698774962,
   "score": 31,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79i4go",
   "message": "Oof. Where to start, get healthy. Lose some weight/get fit. Watch what you eat. \n\nTrim your hair. All of your hair. Chin, lip, head, nose, ears and eyebrows for some (also private parts most def). Super hairy chest or back? Get that shit in check. \n\nShower regularly and WEAR DEODORANT. I’ve never gave much of a shit about cologne but body wash and deodorant go a long way. There’s a place and time for cologne and going to the gas station ain’t it. \n\nGet properly fitted clothes. Nothing too tight or too loose. Don’t have to break the bank here. \n\nWalk with your head up. Smile a lot. Be genuine and nice. Help others. \n\nClean your shoes.\n\nIron your clothes if needed. \n\nClean and trim your fingernails. Literally just dig them into a bar of soap and scrub a bit and don’t let your nails get long. No manicure necessary.",
   "created_utc": 1698777402,
   "score": 26,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78hr2k",
   "message": "Get megayolked (or, you know, stay fit).\n\nEat well\n\nbasic grooming. Do it, but don't overdo it.",
   "created_utc": 1698763852,
   "score": 150,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78lyuq",
   "message": "Facial hair, clothing, and accessories go along way for initial impressions.  Dress bougie, get treated bougie.   Alot of dudes don't seem to care how they dress and it shows lol",
   "created_utc": 1698765473,
   "score": 131,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79m0yw",
   "message": "Delete Facebook\n\nHit the gym\n\nLawyer up",
   "created_utc": 1698778826,
   "score": 24,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78mq22",
   "message": "Exercise, proper hygiene habits, hairstyle that matches face, and finally wardrobe. Put some effort and money into your outfits. It makes all the difference and is a real confidence booster. Nothing dries up a girl like a smelly guy who’s dressed like he doesn’t give a frick.",
   "created_utc": 1698765768,
   "score": 95,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78mc4u",
   "message": "A haircut is everything",
   "created_utc": 1698765618,
   "score": 18,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78f0c0",
   "message": "Boosting your confidence can do wonders to your general presence. Working out can help with that, along with eating better, meditating, and doing more of what you love to feed your happiness. What’s going on inside can greatly affect the outer you.",
   "created_utc": 1698762769,
   "score": 37,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78et4z",
   "message": "Earn more money",
   "created_utc": 1698762690,
   "score": 20,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k7987hz",
   "message": "Physical is more than visual. I can’t stress enough how much it matters that you smell good. It’s not just wearing deodorant and taking a shower. Brush your teeth after the scarfing down the burrito and use an appropriate amount of cologne/aftershave. Floss. \n\nDudes get an irreversible man funk after they hit a certain age. No matter how well they keep themselves up if they don’t shower daily they smell old.",
   "created_utc": 1698773751,
   "score": 51,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79fpb8",
   "message": "Make your lips very kissable. Raspberry lip balm... I'm telling you, like moths to a flame...",
   "created_utc": 1698776506,
   "score": 15,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78t144",
   "message": "I like to stand next to really ugly people; people with leprosy, Walmart customers and The British.",
   "created_utc": 1698768126,
   "score": 162,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78fwhi",
   "message": "Get a haircut",
   "created_utc": 1698763121,
   "score": 45,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79ijqn",
   "message": "A lot of dudes focus on trying to get buff, but slimming down and getting lean will make you look MUCH better and be more noticeable, and is more attainable short term. Still good to put on/maintain muscle, but dieting down to a healthy weight will do wonders.",
   "created_utc": 1698777557,
   "score": 38,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k7990sd",
   "message": "Workout, sleep, skincare, check your posture and your gait",
   "created_utc": 1698774050,
   "score": 12,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78cyiv",
   "message": "Drop your wad of hundreds and monster condom for your magnum dong",
   "created_utc": 1698761959,
   "score": 58,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79cvn4",
   "message": "Exercise and diet. And nothing crazy in both of them. It’s enough to just walk half an hour to an hour a day. If you can carry some weight (I do carry a rather heavy bag to work), it could well be all the workout you need. As for diet - eat what you like, but try to balance it with something that helps digestion. I happen to love apples, so it’s easy for me. Find something for you and make sure you eat something healthy every day.\n\nOh, and personal hygiene!!! Guys, shower and shave (or take care of your beard) before you do anything else.",
   "created_utc": 1698775461,
   "score": 11,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78mbnb",
   "message": "Two socks, have to admit the look of disappointment on women's faces is a bit of a mood killer.",
   "created_utc": 1698765612,
   "score": 18,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78kwkw",
   "message": "depends on how small your penis is - if its smaller than average, usually a nice car, but if we're in micro penis territory, its the big truck that has the mirrors sticking out really far.",
   "created_utc": 1698765049,
   "score": 166,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78q5au",
   "message": "long/fluffy hair, good shave, trimmed eyebrows, actually have basic skincare (even just lotion/sunscreen is better than 90% of men).\n\n\ndon't be afraid of being \"cute\", thats literally the best guys.",
   "created_utc": 1698767071,
   "score": 16,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78elqq",
   "message": "Diet, exercise, good haircut, clothes that fit you, right glasses (if you wear them).",
   "created_utc": 1698762609,
   "score": 16,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78f48f",
   "message": "work out, better skin care, good haircut and beard that fits the face, and solid clothing that suits them.",
   "created_utc": 1698762812,
   "score": 8,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k79nyrs",
   "message": "The two biggest ones that gave me hope that my life with women wasn't over after 30:\n\n1. High body fat = fat face = age.  Keep your body fat under control, and your face will stay slim and look young.\n2. if you have a beard, when you're trimming the hair on your neck (and under your jaw), make sure that hair follows your jaw line.  The thickness of that hair will add weight (thus age) to your face. You want that hair trimmed as close to your jawline as possible while still making sure the jaw is still covered.  Every time you do it you will see years melt away from your face.",
   "created_utc": 1698779539,
   "score": 8,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78dqhw",
   "message": "Ferrari",
   "created_utc": 1698762265,
   "score": 67,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k78nrei",
   "message": "Honestly, I have a feeling a lot of men don’t understand how much good sense of fashion can do. I am a (i’d like to think) quite an attractive girl and the amount of crushes I’ve had on average or even below average- looking guys who dressed in a super cool way, is huge. Interesting haircuts, bold outfits, choice of accessories (rings, earrings, bags etc) and general confidence, can do SO MUCH. Of course it’s even better if the guy is also cute but not a deal breaker, at least for me and the majority of my girl friends / gay male friends. My last boyfriend was quite short and had an atypical face (not conventionally attractive) but was a super confident musician with lots of friends and the coolest thrifted outfits and I never felt more attracted to anyone than him.",
   "created_utc": 1698766171,
   "score": 53,
   "submission_id": "17km47u"
  },
  {
   "comment_id": "k792fc6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17km47u"
  }
 ]
}