{
 "submission_id": "17kqorz",
 "title": "What famous person had the most undeserved fall from grace?",
 "selftext": "",
 "created_utc": 1698774040,
 "permalink": "/r/AskReddit/comments/17kqorz/what_famous_person_had_the_most_undeserved_fall/",
 "score": 175,
 "url": "https://www.reddit.com/r/AskReddit/comments/17kqorz/what_famous_person_had_the_most_undeserved_fall/",
 "comments": [
  {
   "comment_id": "k7bthbx",
   "message": "Anne Boleyn. \n\nShe literally left a great position in the royal court to avoid the King's affections. Their love letters show she tried to resist his advances multiple times. Far from an ambitious seductress, much of her autonomy was taken from her the moment Henry VIII laid eyes on her. She tried to escape. \n\nHistorians today widely debate the adultery charges leveled against Anne. Many believe they were entirely fabricated. One writes: \n\n\u0026gt;even nearly 500 years, three-quarters of these specific allegations can be disproved. In twelve cases Ann was elsewhere or the man was\n\n[Eric Ives](https://www.theanneboleynfiles.com/the-middlesex-and-kent-indictments-do-the-dates-of-the-alleged-crimes-make-sense/)\n\nWhat isn't disputable is that Henry was already greatly taken with Jane Seymour. The outcome for Anne was already a foregone conclusion because the headsman was already summoned to execute the Queen before her trial even began. Henry was betrothed to Jane the day after Anne died. \n\nAnne Boleyn was an extremely devout woman. She spent much of her time engaged in humanitarian efforts. It's sad that she isn't remembered for any of the good deeds she did because her \"love\" story with a psycho. \n\nAns what's most sad about it is that we still continue to besmirch her today, with endless Tudor Era remakes that depict her as a seductress and a harlot rather than the devout evangelical who tried to flee from the King. She's in my opinion, one of the most extreme examples of slut shaming in existence. \n\nHer revenge is that she is the mother of one of the greatest Queens of England.",
   "created_utc": 1698813897,
   "score": 12,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7axgyg",
   "message": "Eartha Kitt. \n\nShe spoke against the Vietnam war when asked about it by Lady Bird Johnson at a presidential luncheon. She was labeled a “sadistic nymphomaniac” by the CIA and blacklisted in Hollywood.",
   "created_utc": 1698797970,
   "score": 246,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79yrnz",
   "message": "Richard Jewel.\n\nNot exactly a celebrity but became famous when he was a security guard during a concert for the Atlanta summer Olympics. Found a backpack full of explosives and alerted the police. They were able to clear almost everyone from the area before it went off. He saved many lives and then the FBI decided he was the main suspect and ruined his life until eventually clearing him of any wrong doing.",
   "created_utc": 1698783537,
   "score": 17,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7asc8y",
   "message": "Macaulay Culkin and most other child stars who end up not being able to handle the pressures of stardom. I'm glad he's doing well now.",
   "created_utc": 1698795681,
   "score": 213,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a804t",
   "message": "Amanda Bynes? Really just needed help early I think.",
   "created_utc": 1698787047,
   "score": 111,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79h5l9",
   "message": "Pee wee Herman.",
   "created_utc": 1698777041,
   "score": 82,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79rapr",
   "message": "Fatty Arbuckle always comes to mind. \n\nShort version, he was accused of raping an actress to death when she died at a party he attended. Odds are she actually died of an unrelated medical condition, there were witnesses at the time who confirmed he was innocent. \n\nIt destroyed his career. He had friends who tried to give him some work in the industry who helped give him work here and there, but he lived maybe... 10-12 more years and died in disgrace.",
   "created_utc": 1698780769,
   "score": 161,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7buj2p",
   "message": "Sean Young, Thora Birch, and every other young actress who went from The Next Megastar to blacklisted because they became “difficult to work with” meaning “wouldn’t fuck a producer.”",
   "created_utc": 1698814591,
   "score": 96,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79tzpv",
   "message": "Winona Ryder. She had a comeback with Stranger Things but her career has never fully recovered to what it was in the 90s after her shoplifting scandal . The scandal is small potatoes compared to what a lot of other celebrities have done and gotten away with.",
   "created_utc": 1698781766,
   "score": 31,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a7u3y",
   "message": "George Michael really bore the brunt of 90's homophobia and didn't deserve it at all. I was a teenager at the time it came out he was gay and there was so much cruel mockery of him. I mean the guy had his demons, but it also came out after he died how unusually generous and charitable he was. I didn't really get into his music until recently, but his story feels ripe for a biographical movie.",
   "created_utc": 1698786981,
   "score": 141,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a1rzv",
   "message": "Alan Turing, Oscar Wilde and all the other great minds that were arrested and vilified for being gay.",
   "created_utc": 1698784664,
   "score": 219,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79a10f",
   "message": "I hear Janet Jackson had a very undeserved \"fall from grace\" if you can even call it that, I didn't really think is was a big deal (as far as I'm aware of the reason for it)",
   "created_utc": 1698774417,
   "score": 110,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7b6h6p",
   "message": "Hey wasn’t famous at the time, but Richard Jewell was wrongly accused of the 1996 Olympic bombing in Atlanta. He was later exonerated when Eric Rudolph plead guilty to the bombing. I’m from Atlanta and I remember Richard jewell face all over the news. Totally convicted guilty in the public eyes.\n\n*fixed some fat thumb spelling",
   "created_utc": 1698801956,
   "score": 241,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a3i19",
   "message": "Howard Dean getting a little too excited on the mic",
   "created_utc": 1698785315,
   "score": 117,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7abl3b",
   "message": "Billy Squier. He was massively popular in the 80s until he released a music video where he acted and danced very feminine and flamboyantly. The video for Rock Me Tonight destroyed his career.",
   "created_utc": 1698788458,
   "score": 30,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7b1tre",
   "message": "Billie Holiday. Her “fall from grace” was engineered and executed by the FBI because they felt that her song “Strange Fruit” could stir an uprising among Black people. When she refused to stop singing it, they conspired to destroy her, eventually leading to her death.",
   "created_utc": 1698799865,
   "score": 64,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79qnlg",
   "message": "Sinéad O'Conner, pointed out the Catholic church is full of paedophiles and had her career destroyed.",
   "created_utc": 1698780530,
   "score": 196,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a0ghl",
   "message": "Alan Turing",
   "created_utc": 1698784163,
   "score": 29,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a226n",
   "message": "Brendan Frazer.\n\nHe got blacklisted for exposing that he was sexually assaulted by some Hollywood bigwig",
   "created_utc": 1698784769,
   "score": 155,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79n8rm",
   "message": "Brendan Fraser",
   "created_utc": 1698779275,
   "score": 170,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7akguk",
   "message": "Phil Donahue. He was fired from MSNBC for being against the Iraq War. He was Oprah before there was Oprah and his show was a lot more intelligent than hers ever was. Not sure how much the firing or his views affected the public's view of him but it was undeserved.",
   "created_utc": 1698792208,
   "score": 115,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a5j12",
   "message": "T-Pain - people turned on him, before the autotune sound was revived and made almost a genre of itself",
   "created_utc": 1698786087,
   "score": 242,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7aiycx",
   "message": "Britney. My god. My wife just finished the book and told me all the details. That woman had everything and her only fault was being born into a horrible and greedy family.",
   "created_utc": 1698791544,
   "score": 143,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7at7zc",
   "message": "Gary Webb. Dude wrote a story about CIA involvement in Contra cocaine smuggling. Got his life destroyed in every possible way, culminating in his suicide. Later investigation confirmed the bulk of the story and found that he had, if anything, understated the case.",
   "created_utc": 1698796077,
   "score": 147,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a3cr5",
   "message": "Richard Gere and the fake gerbal story",
   "created_utc": 1698785259,
   "score": 236,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7ajnkd",
   "message": "Monica Lewinsky",
   "created_utc": 1698791851,
   "score": 136,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7bhzhy",
   "message": "Eartha Kitt. Reminiscent of The Dixie Chicks. She spoke out against the Vietnam War and was summarily blacklisted for decades until she came back much later in her career with such roles as Yzma, from the Emperor's New Groove.",
   "created_utc": 1698807397,
   "score": 163,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79rxkk",
   "message": "It sucks for Macklemore that winning a Grammy hindered his career rather than helped it. Not like he voted for himself",
   "created_utc": 1698781006,
   "score": 91,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79x3s5",
   "message": "Julian Clary. An openly gay comedian here in the UK whose TV career was affected by jokes no one would even blink at these days (e.g. joking about gay sex).\n\n[This joke](https://youtu.be/iAU7pATH5_M?si=1IzFQzqnMPnmuo6M) apparently impacted his TV presence significantly.",
   "created_utc": 1698782914,
   "score": 17,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7bg28m",
   "message": "Heddy Lamar who never was allowed to get credit for her frequency hopping invention in world war ll. She was female, beautiful and cast as a sex symbol. No one wanted to give her credit for being brilliant to boot.",
   "created_utc": 1698806453,
   "score": 55,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7bls4e",
   "message": "Janet Jackson. One boob and you’d think she killed someone.",
   "created_utc": 1698809348,
   "score": 183,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79wvt8",
   "message": "The Dixie Chicks. One of the best acts in country music but had the audacity to share the opinion that *checks notes* the war in Iraq was wrong. Which of course being in the country scene meant a death sentence for their careers.\n\nEdit: it's been pointed out to me that they were able to bounce back eventually. Which is very cool.",
   "created_utc": 1698782831,
   "score": 191,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7bik41",
   "message": "Brendan Fraser, man did nothing wrong and he fell out of the public eye, then people started criticizing him for his weight, glad he’s starting to get the recognition he deserves",
   "created_utc": 1698807687,
   "score": 81,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7b282s",
   "message": "Nikola Tesla.",
   "created_utc": 1698800038,
   "score": 49,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7bp2ip",
   "message": "IDK if it’s a fall from grace but Courtney Love got all kinds of hate for shouting from the red carpet to stay away from Harvey Weinstein years before his moment arrived.",
   "created_utc": 1698811195,
   "score": 202,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k79nwdi",
   "message": "Marie Antoinette",
   "created_utc": 1698779516,
   "score": 13,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a9shs",
   "message": "Anne Boleyn",
   "created_utc": 1698787744,
   "score": 176,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7b4i6y",
   "message": "Al Franken. He stepped down when shit started getting intense. Meanwhile George Santos is still a sitting member of congress. ETA- so is Matt Gaetz.",
   "created_utc": 1698801055,
   "score": 155,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7a04ah",
   "message": "Jesus Christ. \n\nDude was crucified.",
   "created_utc": 1698784037,
   "score": 113,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7ahf6a",
   "message": "Oscar Wilde.\n\nGuy got thrown in jail and it ruined him.\n\nAlso Christopher Eccleston, he complained about bad behaviour on set while filming Dr Who and got effectively blacklisted by the BBC. Hugely talented guy, brought back a classic show for a whole new generation of kids, I think his mental health wasn't great for a long time afterwards.",
   "created_utc": 1698790879,
   "score": 50,
   "submission_id": "17kqorz"
  },
  {
   "comment_id": "k7ay15t",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17kqorz"
  }
 ]
}