{
 "submission_id": "17kxh6d",
 "title": "Non-Americans: what is an American food you really want to try?",
 "selftext": "",
 "created_utc": 1698791941,
 "permalink": "/r/AskReddit/comments/17kxh6d/nonamericans_what_is_an_american_food_you_really/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/17kxh6d/nonamericans_what_is_an_american_food_you_really/",
 "comments": [
  {
   "comment_id": "k7akjlh",
   "message": "Probably the food that they eat on thanksgiving I never tried turkey before or pumpkin pie",
   "created_utc": 1698792242,
   "score": 56,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7aldex",
   "message": "Corn bread. Out of all the foods, I'm curious to try that out.",
   "created_utc": 1698792606,
   "score": 122,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bfm3e",
   "message": "smoked bbq brisket.",
   "created_utc": 1698806234,
   "score": 121,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7biszp",
   "message": "S’mores, crawfish boil and funnel cake. Oh, and turkey! I also recently found out that candy corn isn’t corn-flavoured so maybe that?",
   "created_utc": 1698807812,
   "score": 233,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7aueic",
   "message": "I've always wanted to get my hands on some of the Carolina Gold rice species. \n\nI'm a rice lover from the Caribbean who's lived in Asia, so I've tasted a lot of varieties. \n\nSo yah... Some indigenous rice please.",
   "created_utc": 1698796605,
   "score": 201,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7brf1h",
   "message": "Soul food. Fried chicken, collard greens, corn bread, grits, sweet potato pie. All of it. I want to be rolled away 10 pounds heavier. \n\nTo be more regionally specific, I'd love to try some food from Louisiana. Gumbo, po' boys, jambalaya, beignets. Again, roll me away 10 pounds heavier when I'm done.",
   "created_utc": 1698812602,
   "score": 195,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bb1yu",
   "message": "I'm from Australia and always wanted to try American fast foods like Popeyes, chick-fil-A, Wendy's, Papa Johns, little Caesars, Arby's all of it lol pretty much everything we don't have here. Also I want to try Chicago deep dish pizza, American BBQ and sweet potato pie.",
   "created_utc": 1698804075,
   "score": 68,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bqqb0",
   "message": "As an American I'm really enjoying this comment section. You're right, these foods are awesome! I didn't realize some of them were specific to the US, but I'm feeling pretty lucky right now - and rethinking my shopping list for next week! 😆",
   "created_utc": 1698812181,
   "score": 43,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7b5gpp",
   "message": "If you want to try traditional and weird American foods you should hit up one of the big state fairs like the Minnesota State Fair. It’s on for a few days during end of US summer around Labor Day. Just go in hungry then walk around and try whatever suits your fancy.",
   "created_utc": 1698801495,
   "score": 194,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bptuq",
   "message": "Sounds like someone should open a restaurant called Thanksgiving !\n\n10% please.",
   "created_utc": 1698811641,
   "score": 130,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7atr9q",
   "message": "Chilli. I could probably make some but never got around to it.",
   "created_utc": 1698796316,
   "score": 87,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7b2sea",
   "message": "Concord grapes. Pretty much everything else is easy to get or make in the UK.",
   "created_utc": 1698800292,
   "score": 112,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7blnhq",
   "message": "Real brisket, the kind that smoke for 24+ hours",
   "created_utc": 1698809279,
   "score": 57,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bltj0",
   "message": "Love me some green bean casserole.",
   "created_utc": 1698809370,
   "score": 57,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7as710",
   "message": "Waffles and chicken",
   "created_utc": 1698795617,
   "score": 157,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bcgfs",
   "message": "I have tried it ofc, but I would really like to go to Kansas or one of the other states where BBQ is the state religion. I will have to keep it to a week, or I will be buried in said state after a massive heart attack. Might be worth it",
   "created_utc": 1698804730,
   "score": 181,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bmcdq",
   "message": "I'm Peruvian, and I want to try fair foods like funnel cake, jalapeño poppers, corn dogs, and soft pretzels. Also, because of how NY is portrayed in movies: hot dog from a street vendor and the big slices of thin pizza",
   "created_utc": 1698809654,
   "score": 46,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bqq8o",
   "message": "I want to try the Mississippi mud pie, and the key lime pie. :,)",
   "created_utc": 1698812180,
   "score": 48,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bckzs",
   "message": "Crawfish.  Every time my parents go thru Louisiana they go to some little local place and get their fill of crawfish, gumbo (I think it's called gumbo), and beer.  They stay there for a few days just to do this and hang out with the locals while they're doing it.  But crawfish.  Right up my alley.  I want to inhale till bursting so badly....",
   "created_utc": 1698804791,
   "score": 197,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7belol",
   "message": "Warm apple pie",
   "created_utc": 1698805750,
   "score": 219,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bhbaa",
   "message": "I hear our biscuits with sausage gravy go over well abroad.",
   "created_utc": 1698807070,
   "score": 179,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7beprd",
   "message": "Kraft mac n cheese\n\nAlso it’s not really food but I’ve always wanted to try cheese in a spray can. I can imagine it’s disgusting but I’d be living 6 year old me’s dream",
   "created_utc": 1698805806,
   "score": 86,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bnwfj",
   "message": "Funnel cake. It looks amazing. Is it amazing?!",
   "created_utc": 1698810529,
   "score": 74,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bq24o",
   "message": "Pumpkin Pie !!",
   "created_utc": 1698811774,
   "score": 35,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7c12ec",
   "message": "I hate to sound like an ignorant foreigner but a made from scratch Mac \u0026amp; Cheese with at least 3 different cheeses plus a crispy breadcrumb crust on top is one of my favorite American dishes",
   "created_utc": 1698819508,
   "score": 35,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bcecj",
   "message": "Canadian here.... We have alot of similar food options, but I've always wanted to try a genuine New York slice.",
   "created_utc": 1698804703,
   "score": 98,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7b9s72",
   "message": "If you ever find yourself in the American South, get BBQ.  Real BBQ.  Choose a sampler plate if they have that option so you can learn why obesity is a problem in this country.  Once you have good BBQ, you will agree that arteries are for the weak.",
   "created_utc": 1698803490,
   "score": 155,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bx0qg",
   "message": "Maryland Crab Cakes and Maine Lobster Rolls",
   "created_utc": 1698816324,
   "score": 35,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7akrq7",
   "message": "Traditional American delicacy. Pop-tarts.",
   "created_utc": 1698792340,
   "score": 12,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7boof0",
   "message": "Desperate to know what a corn dog tastes like",
   "created_utc": 1698810969,
   "score": 87,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bhdaw",
   "message": "Jambalaya or crawfish boil.",
   "created_utc": 1698807098,
   "score": 62,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7c3mnj",
   "message": "I met some Irish girls on a work visa in 2000 and trained a couple of them, we became friends and I brought them home with me on weekends as their apartment sucked and none of them could drive.\nThat first morning I made pancakes 🥞 and I noticed the girls were using really tiny drops of syrup and I asked \"don't you like maple syrup?\" They replied \"oh no we love it but it's just too dear\" in Irish speak they meant the syrup was too expensive lol 😅 \nI explained that it wasn't dear here and have as much as you like!\nOne of the girls is still my friend 20 ÷ years later ❤️",
   "created_utc": 1698821700,
   "score": 29,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bo1an",
   "message": "Apple Pie made by white haired grandma.",
   "created_utc": 1698810608,
   "score": 51,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7b75ch",
   "message": "If your answer isn't smoked brisket, your answer is wrong. Americans know BBQ better than anyone.\n\nAnd I'll even admit that as a Canadian.",
   "created_utc": 1698802266,
   "score": 118,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7b2gj8",
   "message": "I'd recommend New Orleans style dishes like gumbo, jambalaya, or some Maryland crabcakes",
   "created_utc": 1698800142,
   "score": 169,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7b65tm",
   "message": "Chicago-style hotdog",
   "created_utc": 1698801812,
   "score": 89,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bq9t1",
   "message": "Collard greens",
   "created_utc": 1698811902,
   "score": 21,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bw1p4",
   "message": "I immigrated to the US 20 years ago, but still haven't tried real Texas barbeque. I'd love to, one day.",
   "created_utc": 1698815625,
   "score": 24,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bw474",
   "message": "Authentic Cajun food.",
   "created_utc": 1698815674,
   "score": 23,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bwvkv",
   "message": "I'd love to try a classic Salisbury Steak with mushroom/onion gravy (brown sauce) and mashed potatoes.",
   "created_utc": 1698816220,
   "score": 22,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7brfb9",
   "message": "Biscuits and gravy",
   "created_utc": 1698812606,
   "score": 40,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7br1wg",
   "message": "Sonic. I really wanna go to Sonic and try all their stuff. I think it's cool it's like a drive in place and at some gas stations you can order Sonic while pumping gas.",
   "created_utc": 1698812377,
   "score": 15,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7btpgf",
   "message": "GOOD Phily Cheesesteak.",
   "created_utc": 1698814045,
   "score": 15,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7buik3",
   "message": "We hosted some German exchange students a couple times. First time we threw a full traditional Thanksgiving dinner. It was funny seeing what they liked. Most seemed like they’d never eaten pie before. \n\nThe second we got all the hosting families involved and made it a massive spread.",
   "created_utc": 1698814581,
   "score": 14,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bv2kt",
   "message": "I mean, food is a part of it, but I want to be a part of a big communal shrimp boil. Doesn't have to be shrimp, could be whatever kinda critters you got.",
   "created_utc": 1698814961,
   "score": 14,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bt724",
   "message": "Country fried steak, fried chicken, biscuits and gravy, hamburgers, meatloaf, Mac and cheese, collared greens, Tex Mex, the many forms of BBQ, Clam Chowder, Gumbo, Jambalaya, Buffalo wings\n\nThings that aren’t technically American but Americans have their own spin on it and have become staples: Spaghetti, the many forms of regional pizzas, Mexican, teriyaki/hibachi.  Especially Mexican.  I’ve lived in Germany.  If Europeans had actual Authentic Mexican or Americanized Mexican, it would blow their socks off on how much better it is.  Biggest thing I missed while I was there.",
   "created_utc": 1698813712,
   "score": 25,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bsch4",
   "message": "Honestly as far as food itself goes most American stuff is present where I live since I'm in Canada, but there are certain brands or fast food joints that we don't have that I've wanted to try, or even just flavors of stuff. My friend and I almost made an entire plan for them to mail me pumpkin pie quest bars cause I like pumpkin pie but we don't have the bars here.\n\nWe don't have chobani yogurt here either and some of the chobani flip flavors interest me. I'm also very interested in trying wingstop one day cause my friends told me it's good but we don't have it where I live. Apparently they have one in Toronto but I think it still counts since I don't leave near there\n\n\u0026amp;#x200B;\n\nedit: Honorable mention for my Australian friend that keeps insisting she wants to try candy corn. We've tried to warn her",
   "created_utc": 1698813189,
   "score": 10,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7avbms",
   "message": "chicago deep dish pizza",
   "created_utc": 1698797021,
   "score": 97,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7boj08",
   "message": "I've always wanted to try some Southern foods; Jambalaya, Gumbo, biscuits and gravy. During the two years I spent in the US I ticked the first two off my list, but when it came time to the last, well, maybe it was just this particular cook's recipe but I just could not get past the grey baby puke appearance of the gravy. Jambalya is the bomb though and I still make it for myself.",
   "created_utc": 1698810884,
   "score": 11,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bo9b2",
   "message": "Canadian here.  I’ve always wanted to try the Chicago deep dish pizza. Also some of the fast food places you have, in and out burger, Cheesecake Factory, sonics, culvers…. I’m sure there’s others.",
   "created_utc": 1698810732,
   "score": 20,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bufaz",
   "message": "As an American some of yall are missing a shit ton of key suggestions for our international friends\n\n* A full on hearty american breakfast. Medium Rare T Bone Steak, \\*proper\\* Bacon, toast, Eggs (Sunny side up/fried with runny yolk, maybe scrambled) with cheese, maybe a bit of ketchup) hash browns, corned beef hash, sausage links,\n* Potato Salad (one of those things where no two people make it the same) and/or Macaroni Salad\n* BISCUITS AND GRAVY IS A MUST\n* Chicken Wings\n* The cheesiest baked mac n cheese you can find\n* Chicken Pot Pie\n* Meatloaf\n* Pot roast\n* Sloppy joe\n* Tater Tot or Green Bean casserole\n* Pulled Pork (or any good BBQ for that matter)\n* Chicken Fried Steak\n* \\*proper\\* fried chicken\n* Salisbury Steak\n* Goulash and/or Gumbo\n* Seafood Boil\n\nI could go on forever tbh, oh and though its not a food, SWEET TEA. Not the bottled shit, get the homemade, diabetes inducing sweet tea",
   "created_utc": 1698814519,
   "score": 18,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bqzfg",
   "message": "Collard greens. Always heard of it, never seen it offered anywhere,",
   "created_utc": 1698812335,
   "score": 8,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7aob8l",
   "message": "Five guys",
   "created_utc": 1698793910,
   "score": 50,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7c3cbb",
   "message": "Southern food. Cornbread, gumbo, fried chicken, grits, Mac n cheese, collard greens, pumpkin pie, southern bbq, crawfish boil, brisket. Just - all of it. Southern soul food looks fire",
   "created_utc": 1698821452,
   "score": 8,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bwkhr",
   "message": "Sweet potato pie with marshmallows!\n\nAlso, Chicago-style deep-dish pizza. There was a restaurant where I live that served this kind of pizza, but it shut down.",
   "created_utc": 1698815999,
   "score": 14,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7c5uwr",
   "message": "Your BBQ, In n Out, iHop, New York pizza, Philly Cheese Steak, Chipotle 🤤",
   "created_utc": 1698823639,
   "score": 7,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bgqbu",
   "message": "Japexican fusion",
   "created_utc": 1698806781,
   "score": 12,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7c4tjf",
   "message": "Reuben sandwich, New York pizza, Smoked Brisket or Ribs and a wood fired Tomahawk steak.",
   "created_utc": 1698822724,
   "score": 7,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7ceh66",
   "message": "Im about to visit the USA for the first time for a friends wedding this week. Austin Texas. I'm hoping for bbq and tacos - like the stuff they showed on man vs food",
   "created_utc": 1698831279,
   "score": 5,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bahw0",
   "message": "The correct answer should be the regional BBQ specialties if you really want to dig into the American experience.",
   "created_utc": 1698803817,
   "score": 16,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bu2j5",
   "message": "I want to invite everyone here to my family Thanksgiving dinner. All the basics, plus the most addictive homemade mac and cheese, and something called killer corn which is a corn dish made with cream cheese and a can of rotel, and I enjoy baking cream cheese pumpkin pie. \n\nThe holidays are usually pretty lonely, but this was a fun read that put a smile on my face.",
   "created_utc": 1698814285,
   "score": 11,
   "submission_id": "17kxh6d"
  },
  {
   "comment_id": "k7bx7mh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17kxh6d"
  }
 ]
}