{
 "submission_id": "17l4nvz",
 "title": "What’s the weirdest thing you’ve done that you could only tell people anonymously?",
 "selftext": "",
 "created_utc": 1698814614,
 "permalink": "/r/AskReddit/comments/17l4nvz/whats_the_weirdest_thing_youve_done_that_you/",
 "score": 201,
 "url": "https://www.reddit.com/r/AskReddit/comments/17l4nvz/whats_the_weirdest_thing_youve_done_that_you/",
 "comments": [
  {
   "comment_id": "k7dkuig",
   "message": "All throughout middle school, there was someone who tucked unwrapped Hostess Devil Dogs into the toilet paper dispensers in the bathrooms, so that when you pulled some toilet paper out, the devil dog would fall out into your hand. We had to have an assembly about it. That person... Was me.",
   "created_utc": 1698852965,
   "score": 247,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7ct056",
   "message": "Was drunk at an escape room with coworkers. It was an extreme one where you are handcuffed the entire time. I decided in my drunken state that it would be badass to dislocated my thumb and slip off the cuffs like the movies. \n\nIt wasn't. \n\nWe got kicked out, my coworkers were weirded out and I had to go to the hospital. \n\nI quit a few weeks later. White collar wasn't for me.",
   "created_utc": 1698841014,
   "score": 99,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7d1p0j",
   "message": "Stole over 1,000 wafers from church because I really liked the communion wafers \u0026amp; didn’t know where else to get them. I felt really blessed \u0026amp; cursed for a long time.",
   "created_utc": 1698845193,
   "score": 186,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cv3yl",
   "message": "Once I got off the subway in NYC and I was super early for an appointment. So I picked a random guy and just followed him on foot for like 30 minutes, pretending I was like a private detective or something. Always kept about a half block behind. He turned this way and that, and eventually went into a building I had lived in 9 years earlier. It was weird, and so was I.",
   "created_utc": 1698842100,
   "score": 236,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cxmj2",
   "message": "We got super drunk and ate a ton of spicy food in New Orleans. Back at the B\u0026amp;B, the food started to come out the back side. I was sitting on the toilet shitting bricks of fire. At that moment, the booze decided to hang a u-turn. The trash can was out of reach and I couldn't risk standing up from the toilet for even 5 seconds. The closest receptacle was the bathtub. I managed to turn in such a way that I could keep shitting in the toilet while projectile vomiting into the tub. Both ended up clogged, and there was no plunger. I had to call the owner to explain that I had destroyed both their toilet and their tub simultaneously.",
   "created_utc": 1698843334,
   "score": 254,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cum67",
   "message": "i found a dead rat in a field when i was younger and kissed it bc i wanted to say goodbye",
   "created_utc": 1698841846,
   "score": 88,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cvzwn",
   "message": "I would do role play chats in these online browser games when I was like 9-14. They'd ALWAYS turn sexual but because I was so innocent at the time I didn't know how to continue, so I'd just... \"bite\" them, run away, and block them lol.",
   "created_utc": 1698842541,
   "score": 208,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7d4m6b",
   "message": "When I was younger I joined a international dating site that I figured was a scam. Put a black square as my picture and gave myself a fake name, and then looked through there users. And after about 10 minutes I had like a 100 messages. Most of them were messages telling me how handsome I was or how these women fell in love with me at first site. Now I knew it was a scam but when ever I felt down or got rejected for a while I would pop back on the site and read a few messages. Yeah it’s kinda cringy and probably pathetic but it made me feel better. I would just turn off that logical part of my brain that knew it was a scam for awhile and just pretend I was this popular and desirable guy. And it honestly got me through the day sometimes.",
   "created_utc": 1698846467,
   "score": 202,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7bv2dp",
   "message": "I helped my partner get unimpacted after a surgery. I am not sure I would ever be successful in the medical field",
   "created_utc": 1698814957,
   "score": 89,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7ctan0",
   "message": "I jerked off to some ‘sexy sounds’ which I thought was my neighbor banging some hot chick (which he did a lot) but it was actually another neighbor’s severely disabled adult daughter (very low functioning autistic I think) who was making the noises.  She used to hang out in their backyard and would verbalize with grunts and moans that i misinterpreted as sexy moans.",
   "created_utc": 1698841167,
   "score": 67,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7dkvbs",
   "message": "My cat has trained me to give her rides around the house by jumping on my shoulder. \n\nI walk her over to the peephole of the door, she looks out it (at it really).\n\nThere is an dangling elephant thing with a bell that my wife has a decoration, she looks at and or sniffs it. \n\nI walk her to the back door to take a look for a minute (its glass). \n\nThen I drop her off at her cat scratching post and she jumps off. She purrs like a freak the entire time. It's adorable. \n\nWe do this several times a day.",
   "created_utc": 1698852973,
   "score": 18,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7ccg6f",
   "message": "I was extremely socially isolated as a child and tried to make friends with the coyotes who lived in the woods by our home. I caught one in a snare and fed and kept her. I wanted a friend.",
   "created_utc": 1698829541,
   "score": 187,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7by8uc",
   "message": "My wife and her best friend pick me up from a frat party black out drunk. Then they helped me take a shit on the toilet, wiped my ass and then gave me a shower and put me to bed naked. Don’t remember any of it.",
   "created_utc": 1698817249,
   "score": 2,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7casp7",
   "message": "[removed]",
   "created_utc": 1698828074,
   "score": 217,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cduln",
   "message": "One time I went outside at like 2AM and put the garden hose nozzle into my butthole and sprayed some water into it, then a farted it out onto the lawn. Basically gave myself an enema with a garden hose. I did this because I was bored.\n\nMy neighbour saw me and told my dad (lived at home at the time).",
   "created_utc": 1698830742,
   "score": 213,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7d4ouk",
   "message": "when i was around 7 i was pretty intrigued in what a penis looked like so i collected a group of guys at my age behind a tree in a school playground and asked each one of them to show it to me 😭",
   "created_utc": 1698846499,
   "score": 203,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cb1v0",
   "message": "I had a baby by c-section and didn’t take the stool softeners—-found out the hard way that I should have.",
   "created_utc": 1698828304,
   "score": 46,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cgoxu",
   "message": "I downloaded Grindr bc I thought maybe I was gay but after a few dudes started messaging me I was like “this is gay as fuck” and deleted it",
   "created_utc": 1698833080,
   "score": 241,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7c4hfi",
   "message": "I was drunk once, oh long time ago when I was so young, peed standing over the toilet and showed it to my crush saying “hey I can do it too”. We dated for 2 years after that.",
   "created_utc": 1698822435,
   "score": 63,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7de9fb",
   "message": "My partner is weirdly prone to cysts. I had to drain a 3 inch cyst on her back (thankfully she had a dr's appt the next week), then multiple other little cysts on her legs and chest. I never told her to her face but that first giant cyst literally haunted me, the amount of pus and blood I saw....good heavens",
   "created_utc": 1698850416,
   "score": 217,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7dae2z",
   "message": "Started compulsively keeping track of things in notes: books I’d read, outfits I’d worn, legs of flights I’d taken. I was trying to space out my hair washing so I even started tracking that on a calendar and ended up tracking it for 7 years straight.",
   "created_utc": 1698848869,
   "score": 138,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cwv47",
   "message": "I got my bottom two wisdom teeth removed and made the huge mistake of eating only yogurt and cheese for a few days. I did not know the effect it would have on my... fecal matter. I didn't have to poop for a few days so I knew something was up.\n\nWhen it finally came time for the urge to come, I sat down and started pushing and instantly knew there was a BIG problem. I thought that since yogurt was soft that it would make soft poo but no, it did not.\n\nI pushed really hard and it wasn't started to come out but it wasn't going to get out. I didn't want to keep pushing really hard because that's how you get hemorrhoids. So I was stuck. I actually thought I would maybe have to go to the hospital because this giant thing was stuck in my colon, and I really didn't want to do that. \n\nSo, panicking, I sat up and felt around and felt the tip of it starting to come out. I turned the faucet on with my clean hand and then I tried to start picking it out with my fingers. I really had no other choice. \n\nI managed to pick some pieces off and the consistency was like dense clay. I not having fun here but I was making some progress. \n\nEventually, after picking pieces off, I sat down and tried to push again and it started to come out all on its own. \n\nWhat resulted was probably the closest thing to child birth that a man could experience. There was a lot of relief getting it out but I now had another problem: there's no way this giant thing could flush. It was about 3 times as large as a normally big-ish poo. It was massive. I even took a picture (and later deleted it).\n\nI was using the faucet to wash my fingers off and now I had to actually use them to break up this thing, and that's what I did. \n\nIt was a total mess. You when, if you've ever woken up in the middle of the night with a nose bleed and you take care of it in the bathroom, the next day you go to the bathroom and there's blood everywhere? It was kinda like that but with poo. It sucked. I eventually got all the pieces to flush and spent about 20 mins cleaning up the bathroom of what was left behind.\n\nSo I learned a lesson about what lots of dairy can do to you and some other lessons I didn't know or want to learn.\n\nEdit: I was not on pain killers",
   "created_utc": 1698842970,
   "score": 94,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cckys",
   "message": "I put the handle of a 10inch telescopic police Batton up my arse and haven't been the same since..!",
   "created_utc": 1698829655,
   "score": 172,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cdrwr",
   "message": "I had kidney stones a few years back and was in a lot of pain.   I didn't know it was kidney stones at the time, and some of the pain felt like blue balls..   I was at work and in a lot of pain down there.  Told my co worker who was my good friend and I had a thought that if I could jerk off it would help relieve the pain.\n\nI went to the bathroom and rubbed one out, stopping when people came in to do their business.    Finished up and then was still in a lot of pain..   I remember going over to her and said.    \"It didn't work\" with a pained look on my face.    I went home early later on.    Have never told anyone but her haha.",
   "created_utc": 1698830679,
   "score": 96,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cw3mv",
   "message": "I took ketamine and drank a few beers while camping with some buddies. I ended up shitting myself and woke up in a pile of my own shit.",
   "created_utc": 1698842593,
   "score": 8,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cvwko",
   "message": "Drove my car into a tree no seat belt trying to un-alive myself, failed and ended up with a badly broken right arm and left hip like total hip replacement. Everyone in my family thinks it was some accident and I've been too embarrassed to admit it wasn't.",
   "created_utc": 1698842493,
   "score": 170,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cr3yp",
   "message": "I was in the woods in the middle of the night tripping.  I decided to shove snow inside me.  Wanted to know what it felt like.  It felt cold.",
   "created_utc": 1698839985,
   "score": 213,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7euydc",
   "message": "When I was walking to school one morning, I saw a kid (7-8 yo?) kicking a dog. I ran over \u0026amp; kicked the kid and asked him how it felt. He ran off and no one saw. Still not sorry.",
   "created_utc": 1698869796,
   "score": 33,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7bvbds",
   "message": "I once had sex with a salad.\n\nNo this is not a joke. I was a very horny and confused preteen.",
   "created_utc": 1698815128,
   "score": 11,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7d6bx9",
   "message": "I once attended a \"silent disco\" event at a park, but I didn't have any headphones. So, I just danced along with everyone to the silent beats, pretending to hear the music. It was bizarre to dance in silence, and I couldn't tell anyone because they'd think I was crazy.",
   "created_utc": 1698847190,
   "score": 53,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cuw4z",
   "message": "I write Guardians of the Galaxy fanfic. My favorite author in the fandom likes my stuff… It’s so much fun, and I wish I could talk about it with people irl…",
   "created_utc": 1698841988,
   "score": 13,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7c78ys",
   "message": "I naired my nuts. Worst pain ever.\n\nUpdate: \n\nFor those wondering why it hurt so bad. I left it on too long and got chemical burns. Walked bull legged for a few days. I did this many years ago in my late 20s. It was my girlfriends idea at the time.",
   "created_utc": 1698824895,
   "score": 83,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7bzxyf",
   "message": "gathered apple seeds cuz I heard they had cyanide in them back when I was trying to find ways to self yeet",
   "created_utc": 1698818591,
   "score": 184,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7c82jz",
   "message": "sucked my own dick",
   "created_utc": 1698825632,
   "score": 214,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cqk17",
   "message": "I’ve always been a slim guy so a couple years ago once I started to gain a bit of weight I looked in the mirror and saw my ass looks pretty nice, like a girls ass. I was so damn lonely that I bought myself some female underwear, tights to cover the hair and a skirt and did a photo shoot. Then proceeded to masturbate to them. The immense amount of shame I felt for enjoying it put me into a pit of despair. Have not done it since yet sometimes still miss it.",
   "created_utc": 1698839671,
   "score": 190,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7c1sar",
   "message": "Had sex with a potential girlfriend's mom while the prospect was passed out after a house party.I was drunk, she was drunk, mom was drunk, her dad was not in the picture.  \n\n\nEDIT: To answer questions, yes we dated afterwards, even got engaged for a while until I decided it was time to slow down the drinking and partying.  \nBroke my heart to break it off with her, but I needed to grow up and get off the booze. She passed away maybe a year afterwards?  Her and her new boyfriend died in a single car crash on a back road.  Drinking was involved.  I  will never let what happened between her mom and I that one night, out of respect to her memory.  \n\n\nI still miss you, Val.",
   "created_utc": 1698820110,
   "score": 106,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7c8lw4",
   "message": "I smoked hash that my dad smuggled up his butt in Paris with a coke can\n\nit did indeed taste like shit",
   "created_utc": 1698826112,
   "score": 142,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cozhe",
   "message": "Hold on I gotta switch to my even more anonymous account for this",
   "created_utc": 1698838752,
   "score": 134,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cqdh8",
   "message": "I downloaded grindr so guys would dm me compliments as a boost to my self confidence",
   "created_utc": 1698839568,
   "score": 185,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cbk3r",
   "message": "Pooped into a trash can. My dogs poop was clogging up the toilet and I didn’t have time or a plunger to get it out. I could feel my poop leaving my body so I grabbed my large trash can from the kitchen nearby waddled to the restroom took off the lid and said a little prayer before squatting over the can",
   "created_utc": 1698828754,
   "score": 19,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7d21qd",
   "message": "When I was in A-School for my job, on July 4th I got extremely drunk, and next to gazebo I was drinking at was the car of the dude me and a majority of my friends greatly disliked bc he was just a huge asshole and acted like he was better than everyone else. So, my friends told me to piss on his car. I whipped my dick out to piss on it, and then I said “I’ll do you one better” and grabbed the handle, and found it was unlocked. So naturally, I emptied the tank in his car. All over his seats, floorboard, in his glove compartment, center console, and everything. I was drinking beer so it was A LOT. I woke up the next day panicking because I thought someone was going to tell on me and genuinely felt awful for what I did. Yeah, we didn’t like the dude, but I know I went too far. He never found out while I was still there thankfully.",
   "created_utc": 1698845350,
   "score": 234,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7evcqr",
   "message": "I had just graduated high school and was working for my uncle doing some home improvement projects around town during the summer. I was living with him during the work week as my home was about an hour drive away. Anyways, I got very drunk playing battle shots at the state fair one night that summer. Got a responsible ride home. I was in the basement where my room was but had to piss like a pregnant race horse. There was no bathroom in the basement and the only one in the house was right next to my sleeping uncles room. It was late and I didn’t want to wake him up. Well.. I found his cat’s litter box in the laundry room. I took without a doubt the longest pee of my life into that litter box.. I probably should have buried it but I didn’t. I went to bed and woke up in the morning to my uncle yelling “JESUS CHRIST SPARKY!” I think I should tell him about that this Christmas. He would laugh his ass off.",
   "created_utc": 1698869940,
   "score": 232,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cpk3f",
   "message": "I didn’t join the military out of patriotism - rather out of desperation and depression. It’s the closest to suicide decision I’ve made (I wanted to die)\n\nPeople thank me for my service, for being selfless to the call of duty - I havent the heart to tell them it was my most selfish decision\n\nAnd during that service I’ve taken more lives than saved - I was a navy corpsman \n\nIn process of trying to save a life, they died; my fellow soldiers always reassured me I wasn’t to blame; compound with my desire at the time to die; frankly I was just dumbfounded my wish wasn’t granted when I wanted it; I always thought as I close their eyes “it should’ve been me”. \n\n-\nEdit:\n\nBe reassured - I do not think like this anymore.",
   "created_utc": 1698839095,
   "score": 183,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7d81eg",
   "message": "My previous apt complex was notorious for having various water issues that resulted in them having to shut off the water for days at a time. \n\nOne day I got fed up and shit in a doggie bag, then threw it at the leasing office. It was there for a couple days.",
   "created_utc": 1698847913,
   "score": 66,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7crcuo",
   "message": "Was in like middle school and my older sister and I somehow had a great idea. We took a bunch of our younger siblings toys and made a horror scene with them in the basement. Like red paint blood, dismembered, hanging from the ceiling. Real nasty shit lol. We looked at our creation and immediately realized we went too far. Not only did we waste my moms money, but would have traumatized the crap out of two elementary schoolers. Took it all down and disposed of the evidence quickly. No clue whose idea it was but we decided never to tell them lol",
   "created_utc": 1698840123,
   "score": 73,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7c9lu5",
   "message": "Was in a thruple for 3 years on the DL in the deep religious south. I was a nurse at the local hospital, hubby was a principal at the jr high and our gf was head of the English dept of the school district the next town over. Our close friends knew, but not really something I can talk about in the break room ya know.  Relationship ended for various reasons, but was sure fun while it lasted….",
   "created_utc": 1698827002,
   "score": 166,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7exact",
   "message": "I live behind a fairly busy path. I used to quietly (but purposely loud enough to faintly be heard) repeat what people were saying on the other side of the hedge.",
   "created_utc": 1698870634,
   "score": 98,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7bxmmk",
   "message": "Rawdogged in a church (we were volunteers for mass) and locked eyes with the Jesus statue mid nut",
   "created_utc": 1698816778,
   "score": 59,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cb5uc",
   "message": "When i was 11 years old i took some big dolls that were in the house and made holes and would fuck it every evening after school. jesus!🤣",
   "created_utc": 1698828404,
   "score": 92,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7dcm7m",
   "message": "I was caught taking a nuclear level shit on my ex's lawn.",
   "created_utc": 1698849772,
   "score": 92,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7dl32d",
   "message": "When I was 13, my family got like 12 bottles of buffalo ranch stuff from a food pantry. For some reason my dumbass decided to grab a bottle and start chugging it like a beer. Acting drunk and all, even though I didn’t understand what I was doing. \n\nI would later learn that my mom was/is an alcoholic, and I was most likely mimicking her behavior due to trauma. Luckily I only drank one ranch bottle(that I remember anyway).",
   "created_utc": 1698853054,
   "score": 80,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cxivp",
   "message": "I have completed destroyed my life by using heroin, and eventually fentanyl/tranq. I am right now recovering from surgery, I had to have my right arm and part of my shoulder amputated due to the tranq in the drugs I was using intravenously literally rotting away my arm. I have been in the hospital for almost three months. I have lost everything, I have no family or friends left, no savings or income, and no place to live. I am going to be released in six days and I am scared to death. I don't know what to do or where to go. I live in Philadelphia, and I am really not happy to be leaving.",
   "created_utc": 1698843286,
   "score": 155,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7crf8j",
   "message": "When I was a kid, I was in a big indoor waterpark, which had a large whirlpool like thing. I had to take a dump, but it was too much fun in there to get out. My childish reasoning said, the bubbly surface would cover everything underneath, so I just pulled my swimming pants and set it loose, believing the bubbly surface would hide it.\nIt did not.",
   "created_utc": 1698840160,
   "score": 170,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7czytf",
   "message": "I stood in a woman’s kitchen while she ate my ass and I ate Asian food. Occasionally, I would throw food on her as well. Just to clarify, this was something that she signed off on.",
   "created_utc": 1698844429,
   "score": 44,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7cetap",
   "message": "A horny teen about 14 years old on holiday in Greece, I would make a mental note of a woman in bikini round the pool, go back to the hotel room and vigorously masturbated to that mental image. \n\nEveryday for 2 weeks. Multiple times a day.",
   "created_utc": 1698831558,
   "score": 135,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7e93nt",
   "message": "Met a woman online when I was 23. She was 57. We hooked up a few times. \n\nIn my defense, she looked younger than her age and was very attractive. I stopped hooking up with her when I found a woman my own age I started a real relationship with. \n\nThe old lady was very clear She was \"just having fun\", which I was ok with.",
   "created_utc": 1698861842,
   "score": 78,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7c3q9h",
   "message": "Chugged altar wine, ate communion hosts and then wheelied my BMX bike off the altar and down the aisle of my church. There were 3 of us.",
   "created_utc": 1698821787,
   "score": 180,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7bx7ci",
   "message": "I was found some tablets in a hotel room , decided to try one, I think it was acid, started hallucinating crazy shit!!",
   "created_utc": 1698816460,
   "score": 116,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7ddlko",
   "message": "I was caught touching a mannequins boob in the window of a store (when I was like 12!) by a woman walking down a sidewalk",
   "created_utc": 1698850163,
   "score": 74,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7fah2r",
   "message": "I started taking this new medication for anxiety, but it was really messing with my bowel movements. Not one shit I took was solid. Anyway, I was working a commercial roofing job for about 2 months, and that day we were working 23 stories up. This was a big project site, so lots of companies and people working in this building. \n\nI started feeling my guts bubble, and I ignored it, because of how long it would take me to go from the roof to the ground floor where the port-a-potties were. Suddenly, that bubble got worse. I went down the roof stairs, to go down 2 floors and radio the elevator operator. There was no answer, and the panic set in.\n\nNow, I'm looking everywhere for a toilet-shaped object in a construction-ridden hallway. I tucked back into a room that was being re-drywalled and before I shit myself, I dropped my pants and just blew ASSSSSSSS all over the wall and floor. I saved my pants though! I scrambled out of there quickly, and I walked down all 21 flights of stairs to make sure I cleaned up myself nice and good. I head back up to the roof and don't say a FUCKING word to anyone. Not even my brother who got me the job.  \n\nSuddenly, the dude running the whole project site comes up and asks if all of my boss's guys were up on the roof and says there's a site-wide meeting right now. We go down, there's gotta be like 60 people, and he is FURIOUSSSSS, and goes, \"ALRIGHT WHO DID IT???\". I fucking went full Lady Gaga poker face. \"SOMEONE SHIT ALL OVER MY WALL...THIS PERSON IS CLEARLY SICK. YOU DON'T HAVE TO SAY ANYTHING, JUST GO UP THERE NOW AND CLEAN IT UP\". My co-worker was like, \"Yo, that's gross\", and I was like \"tOTTALLY\".\n\nI never told this story to anyone, not even my wife. I quit that job shortly after.",
   "created_utc": 1698875425,
   "score": 69,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7e0cqw",
   "message": "TW:\n\nMy dad was involved in dog fighting when I was a child. It’s not something I talk to anybody about.\n\nI’ll never forget our pitbull whiskey. She was a mean fighting machine. Of course, I never saw her that way because she was so loving at home. \n\nMy dad brought her (and I) to a house one day to fight her son. She completely shut down. She didn’t wanna fight him. She had never lost a fight until that day. She managed to survive but not without significant injury. I was devastated. It was my first and only dog fight I had witnessed and I was scarred. When leaving, I remember asking my dad questions. “Why did whiskey have to fight?” “Do all dogs do that?” My dad was equally as devastated but probably not for the same reason. \n\nFast forward a few months Whiskey was doing better. We were sitting in the living room when a next-door neighbor girl came over with potato chips. Whiskey end up biting her in the face bad. \n\nMy dad knew what was going to happen next so he took her out back, told her to sit, and he shot her in the head. \n\nI 100% blame it on the dog fighting (and my father) \n\nMy dad cries anytime we’ve ever talked about it. The guilt will forever be there. \n\nThis isn’t something I ever talk about with anybody  because my father is a changed man and he is still my father.\n\nEDIT: not weird… just traumatic.",
   "created_utc": 1698858688,
   "score": 142,
   "submission_id": "17l4nvz"
  },
  {
   "comment_id": "k7etv9w",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17l4nvz"
  }
 ]
}