{
 "submission_id": "17l5kxb",
 "title": "What's a company secret that you can share now cuz you don't work there anymore?",
 "selftext": "",
 "created_utc": 1698818467,
 "permalink": "/r/AskReddit/comments/17l5kxb/whats_a_company_secret_that_you_can_share_now_cuz/",
 "score": 134,
 "url": "https://www.reddit.com/r/AskReddit/comments/17l5kxb/whats_a_company_secret_that_you_can_share_now_cuz/",
 "comments": [
  {
   "comment_id": "k7cmrqv",
   "message": "I don't think it was necessarily a \"secret,\" but at weekly Home Depot department manager meetings, we'd watch a weekly video from the CEO? or someone high up.  There was always a segment at the end celebrating a HD that had driven a small, local hardware or lumber store out of business.  It would show pics of these little mom-and-pop places with \"Out of Business\" or \"Closed Permanently\" signs out front.  It was pretty sickening. If I recall, the managers of the stores celebrated each week won some sort of prize or bonus too.   \n\nBefore that, I knew that was obviously part of the overall strategy, but to see it laid out and celebrated so blatantly was shocking.  Especially since these meetings weren't exactly high up the totem pole.  I was just a \"Hardware Department Manager\" for $15/hr (2007).  I only worked there about 3 months.",
   "created_utc": 1698837388,
   "score": 200,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7c2ioh",
   "message": "I'm still in it, but here's an industry secret: If your AC is low on \"freon\", then you have a leak. Don't let a company make money by \"topping you off\" at each visit like it's a consumable. Your system has a leak, and it won't work right until the leak is repaired.\n\nAlso, filters are cheap. Don't pay a premium for a service company to bring them for you, you may be up charged a ridiculous amount for it.",
   "created_utc": 1698820738,
   "score": 115,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ckgcq",
   "message": "The furniture on display in stores at the big UK brand sofa companies is a far superior built product than what the general public gets delivered.",
   "created_utc": 1698835832,
   "score": 217,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cjybc",
   "message": "I worked for a large cable company years ago. We were taught that if you called in about services being down and were trying to get them fixed, not to give you credit for the time they were down unless you asked, no matter how long it may be. Even if you did ask for credit, we often only gave it to you for days you called in. So if you had a storm roll through and didn't have service for more than one day, you had to call each day. If you took the liberty to credit them anyway, you would be coached to do it the proper way. We often used this downtime to upsell you on additional channels, faster internet speeds etc, for when it did return. We also were taught to sell higher speeds to unsuspecting customers who didn't know any better, thinking faster internet would make their 9 year old laptop/PC perform better. We got a kickback on how many ancillaries we sold. A basic rep who performed halfway decent could often make more than those that were responsible for them.",
   "created_utc": 1698835480,
   "score": 198,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ck5yz",
   "message": "There's a popular internet rumor that being called \"a treasured guest\" by a cast member at a Disney park means that you are an asshole and they are warning other cast that you are going to be a headache. \n\nI've worked at both Disney World and Disneyland and that's not a thing at either park. There is no code word to refer to guests negatively. We have a bunch of code words but since 90% of them aren't used regularly, most regular cast members would probably blank if asked about them. The ones you need to know are...\n\nCode U - some kid wet themselves\n\nCode V- someone vomited\n\nCode alpha - emergency services called\n\n101 and 102 - attraction is down for whatever reason and attraction is back up\n\nI worked a total of 18 months in food, attraction, and custodial and those are the only codes I ever heard used.\n\nEdit: Disney doesn't have official codes that would make a guest feel bad if they heard them. Most codes are just so there isn't a panic. If Disney had a code for an asshole guest, then it would be problematic if that official memo ever leaked. However, certain cast may have their own codes amongst themselves like an in joke between familiar coworkers.",
   "created_utc": 1698835629,
   "score": 252,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ciq1r",
   "message": "Not me, but my wife - used to work for a light-bulb manufacturer in France, their marketing at that time stated \"all our products are made in the EU\".\n\nTheir \"factory\" in Italy received containers from China, unpacked all the light-bulbs and put them in new \"made in EU\" cardboard packaging, and sent them on to the hardware stores.",
   "created_utc": 1698834598,
   "score": 1,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ckifh",
   "message": "There is a sludgy substance leaking into the sewage systems of Linden/Elizabeth NJ from the Bayway Refinery. I’m not a chemical engineer, but it sure looks and feels like oil to me.",
   "created_utc": 1698835871,
   "score": 124,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7c791e",
   "message": "The 55 year old man that was noisily masturbating in the toilets every day had a note from the doctor that said he needed to do it. HR had told him to do it elsewhere though.",
   "created_utc": 1698824897,
   "score": 234,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7c6h06",
   "message": "[deleted]",
   "created_utc": 1698824191,
   "score": 96,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cmpli",
   "message": "Here’s one: I worked at Ticketmaster back in the day and they’ll never admit this, but Ticketmsster charges high fees to customers and then gives a kickback to the record labels and artists. Just like Standard Oil did back in the day with Railroads. Now, you’re probably wondering why do they do this?\n\nWell, decades ago Ticketmaster and the record industry made a Faustian pact. Ticketmaster will get access to popular tickets of artists as long as their the “bad guy” in the news. Essentially, that means when your favorite artist like Taylor Swift wants to charge a little bit extra for her tickets, but doesn’t want to appear greedy to her fans, she’ll let Ticketmaster do it via fees and then receive a sweet financial kickback. \n\nTicketmaster gets the tickets and the artists save face look good to their fans. It’s a win-win. 🤝",
   "created_utc": 1698837349,
   "score": 181,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ch9yn",
   "message": "Worked at a service station (petrol/gas). Every morning at 7 I had to ring a number not connected to the company and report the cost of fuel. Friends who had the same job at a different company had the same task with the same phone number. It was definitely collusion between companies.",
   "created_utc": 1698833528,
   "score": 121,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cfzkf",
   "message": "I would change price tags for a retail store. Let’s say an item was $2.99 and has been for months. I would take down the price tag and replace it with a tag that said “Originally $3.99. SALE $1.00 off! New price- $2.99.” This would be done for a LOT of items. Sneaky.",
   "created_utc": 1698832518,
   "score": 9,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7chweb",
   "message": "There is a massive gaping hole in the telephone security at HSBC UK call centres which I raised and was dismissed as being irrelevant. If I’d taken the time to learn the sound that each phone key makes when entering a button input (a feature that is there to support blind people) then I could have easily gotten untraceable access to the accounts of anyone who needed to reset their security pin.",
   "created_utc": 1698834003,
   "score": 157,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cjmao",
   "message": "Petco. Lots of dead animals. They die in transit to the store. They die in the store. Also many dogs have died of heart attacks in the grooming salon drying cages. We were given advance warning of corporate animal welfare \"surprise inspections\".",
   "created_utc": 1698835240,
   "score": 2,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cftbf",
   "message": "My answer is directed towards UK \u0026amp; EU citizens and is more of an industry \"secret\" rather than company specific and deals with financial services/banking.\n\nCustomer service agents at banks and fintech will NEVER suggest that you get in touch with the Ombudsman if you have an issue that you feel is not being properly addressed. The Ombudsman will charge a company approx 500 EUR/GBP (sorry can't recall the specific cost) for each case they open. This can be very expensive for these companies.\n\nIf you feel you are being given the runaround, ask the question: \"Do I need to get in touch with the Ombudsman about this issue?\" That usually catches their attention.\n\nHowever, be aware that you can't just take any old issue to the Ombudsman and you must show evidence that you tried to resolve the issue through the company first.\n\n/EDIT/\n\nNow that my inbox is blowing up somewhat, some clarification and context maybe required.\n\n* I based my comments on what I was trained to do by the company. Other companies may/probably have different policies.\n* The company was not a \"traditional bank\" rather a fintech.\n* Maybe some things have changed since I worked for the company which I left in 2020.",
   "created_utc": 1698832380,
   "score": 70,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cirb3",
   "message": "The meat in Wendy's chili is from burgers that couldn't be sold i.e. over cooked patties. Absolutely nothing wrong with it though.",
   "created_utc": 1698834623,
   "score": 124,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cidv6",
   "message": "The dutch grocery store Albert Heijn has a flowchart for offering contracts to youngsters that are about to turn 18. When they turn 18 they get to expensive so they fire them, and the flowchart shows that if it gets too close to their birthday, wether to fire them or keep them just a little bit longer.",
   "created_utc": 1698834355,
   "score": 246,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cluol",
   "message": "At a  conference the CEO of the world biggest drink company and a major polluter, was happy to announce that rising global temperatures were good for business as for every one degree up they sold an extra $20 million in a country of 26 million people.",
   "created_utc": 1698836789,
   "score": 195,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cg64j",
   "message": "Not really a secret but just confirming what is already known. I worked at a division 3 college for 7 years. They weren't supposed to give out scholarships for sports but would pick a random reason for the student to get one. It seemed like half the sports teams had scholarships for being low income or good/bad grades. Also, they would wait for the cutoff date to kick students out of college. If you would receive any of your tuition back, they'd wait till the day after that cutoff to kick you out and keep all of the money. I was specifically told we weren't allowed to remove students at the beginning of semester because of it...",
   "created_utc": 1698832667,
   "score": 202,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ckcgt",
   "message": "That in most hotels the housekeeping staff are overworked and timed per room  and if a slept in bed is not too creased after checkout  they will remake it without changing it,  same goes for towels.\nI've seen it all and when I stay in a hotel I insist on bedding and towels to be left out for me to put on myself.",
   "created_utc": 1698835756,
   "score": 88,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cjkvr",
   "message": "After people at our main supplier went to jail for a similar incident. Senior management thought it would be a good idea to redecorate the entire office building (about 200 people work there) and to hand the contract for the redecoration concept to the struggling interior design company the CEO and the COO's wives had founded together just weeks before. So the managers authorised a six-figure design project which went directly into their family income (minus VAT).",
   "created_utc": 1698835212,
   "score": 157,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cgfsl",
   "message": "Just Jeans in Australia (and subsidiary companies) won’t prosecute customers if you steal from them, but will prosecute staff.",
   "created_utc": 1698832880,
   "score": 29,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ci7qz",
   "message": "The Post Office \u0026amp; Fujitsu knew exactly what was going on with the Horizon system, and the fact that the office reconciliation process didn't work. I know this because I reported it several times when I was testing the front end of the system and was told not to worry about it because it wasn't my area, and that another team would look into it. They obviously never did. \n\nAnd their claims that they could not access or amend the data at individual post offices was complete nonsense - they had a team that spent their entire time doing exactly that, trying to fix errors on the fly.",
   "created_utc": 1698834230,
   "score": 73,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cjc43",
   "message": "If you live in New Hampshire and go to Tucker’s Restaurant, order the hash browns instead of the home fries. The hash browns are made fresh, while the home fries are made beforehand and left in a heater.",
   "created_utc": 1698835041,
   "score": 221,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7c0tds",
   "message": "Their secret famous family donut recipe was just Pillsbury dough lol bye",
   "created_utc": 1698819300,
   "score": 191,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ckkiq",
   "message": "Still not naming the company.... But in early 2000's i got some work as a dev in a bank.\n\nOne morning there was a huge \"something\" going on in the department. You could feel something was seriously wrong. A bank customer called. He was missing several million from one of his \"Incomming money\" accounts.\n\nThey traced it to the department I was working in. What has happened?\n\nSomeone (Not me) connected the \"training environment\" to the \"live money server\". And during a training on the syastem the students had a bunch of tasks to complete. One task was \"Execute a large transaction the supervisor needs to approve\"\n\nSo more than one student wired themselves millions to their own accounts.\n\nYou could say it was one of the few trainings that really paid off...\n\n(The app had logging everywhere, so everything got reversed - but a customer calling and missing money is BAD for a bank)",
   "created_utc": 1698835911,
   "score": 68,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7civgh",
   "message": "I worked for Amazon until I was sacked for speaking up about the way they made people be half an hour early for a shift and sometimes stay an hour late but get no extra money for it!! No overtime not even a thanks very much, if you didn’t do it you were gone and in rolled someone me else. Plus they start you in a day shift and they money seems fine to start with but suddenly you need to rotate shifts Nightshift, backshift and day shift all in the space of 10 days.",
   "created_utc": 1698834706,
   "score": 152,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cekad",
   "message": "Worked for a tow boat company on the Mississippi River. Federal law says nothing goes into the river that isn't bio degradable. I can't tell you how many gas-powered water pumps have been \"Deep sixed\" by the crew I was working with.",
   "created_utc": 1698831352,
   "score": 35,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ckaqv",
   "message": "It's been like 18 years so this hardly applies but when I was in high school I worked at a very popular Australian department store for a bit of extra money. There was only one working camera in the store and it was a pretty busy store. \n\nThe fear of getting caught is a way bigger deterrent than The actual risk of getting caught, I'll say that much.",
   "created_utc": 1698835722,
   "score": 82,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cl3v3",
   "message": "Not really industry specific, but it can still apply. Yelp and the BBB are paid services. BBB is not a government agency. A company must pay to be on them, and if they stop, those companies only remove the good reviews, while leaving the bad.",
   "created_utc": 1698836282,
   "score": 84,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cjegk",
   "message": "I was a welder at a rail car manufacturer. And this should be common knowledge, but I've seen a lot of dumbass videos on here. \n\nDo not play around train cars while moving. I can guarantee there are some out of tolerance for overall diameter. And under it, the legs and stuff we welded could be out of tolerance. \n\nNot to mention the welds themselves. Sometimes it was just sling something up there to get the line moving.",
   "created_utc": 1698835087,
   "score": 36,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cne2u",
   "message": "Companies pay $50,000+ to be listed as, and for a \"best place to work advertisement package\"\n\nMy job that was \"the best place to work in tech\" was actually just one of the only ones willing to pay",
   "created_utc": 1698837775,
   "score": 74,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7c78di",
   "message": "Security Guards don't do anything",
   "created_utc": 1698824880,
   "score": 17,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7coqeb",
   "message": "Worked at McDonalds. \n\nWhenever someone in the kitchen yelled \"there's onion on the floor!!\" it meant that there's a hot/attractive customer at the cashier",
   "created_utc": 1698838603,
   "score": 150,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cpojm",
   "message": "Violoence Against old people in an old peoples home. \nThat‘s the reason why I‘m not still working there",
   "created_utc": 1698839167,
   "score": 30,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ch07o",
   "message": "20 years in the watch industry. Basically, anything with a quartz movement is more accurate than any automatic.  Also, all quartz movements are equally accurate. You're paying for handmade craftsmanship, quality of materials and marketing..",
   "created_utc": 1698833321,
   "score": 112,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cpbyc",
   "message": "When the media says “the USA is sending $billion to a foreign country,” it’s rarely a direct payment to that government or its people.  \n\nIt’s usually in the forms of contracts, grants, and cooperative agreements to NGO’s (mostly US-based) to implement programs - whether that’s engineering, education, or public health.   \n\nWhile these are technically “competed,” the awards usually go to the same 5-6 organizations because they’re the only ones who can handle that much money responsibly. \n\nThese massive orgs then engage local nonprofits to distribute goods and services.  They’re not handing out cash.\n\nAll of these orgs have “indirect costs” which is a percentage of every dollar that covers administrative expenses.   These are confidential rates only known to the government and are usually around 40% (I’ve seen larger). \n\nWhich means for every billion dollars in foreign aid, there’s a “nonprofit” keeping around 400 million.  While these do cover certain expenses, it’s mostly salary for execs, lawyers, accountants - and any unused funds (of which there are many) are then put in the coffers for “sustainability.”\n\nForeign aid is a gold mine - but not for the recipient country.",
   "created_utc": 1698838959,
   "score": 25,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7chvlv",
   "message": "One of the secret ingredients in KFC is pepper",
   "created_utc": 1698833985,
   "score": 168,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7ch9jz",
   "message": "I thinks it’s more commonly known now, but Black Friday sales or sales in general aren’t good deals. If you see anything on sale it means there is excess stock that they are struggling to sell because a buyer messed up and ordered too many units.\n\nRRP prices are mostly made up to make the fake saving look good as well as reviews, most are fake. \n\nAlso when you ring up for advice for what you need the person you’re talking too isn’t an expert they’re just reading the same information you have access to.",
   "created_utc": 1698833520,
   "score": 26,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cijd4",
   "message": "The reason everything tastes good at sit down restaurants...an uncomfortable amount of butter, cream and or/salt.  Makes food delicious....but you know it's not great for you so don't use a lot at home...",
   "created_utc": 1698834465,
   "score": 226,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cj3lw",
   "message": "If you have a hardware problem with your PC/Mac/Smartphone it is never ever necessary to give away your password. Your photos will be searched and copied! I was working at an Apple reseller which also offered support. It’s true that a password can make support easier in some cases, but your photos will be looked at too! And there are always ways to do so without password!",
   "created_utc": 1698834872,
   "score": 174,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7c9duz",
   "message": "The reason the McDonalds ice cream machine is always down is because its complicated asf to clean most stores don't bother, but here's the kicker, they leave the old ice cream mix in and it  goes absolutely rotten, covered in ants and mold. One of my old coworkers threw up in the machine while cleaning it.",
   "created_utc": 1698826809,
   "score": 167,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7clych",
   "message": "A guy who I worked with who went on to be GM of a VERY large computer retailer in Australia was demoing some product we were getting made in China and as he brought up the webpage on the projector in front of a room of maybe 20 people the auto fill suggested “boys hidden webcam shower” a few of us noticed and he tried to blame a virus. It was nauseating.",
   "created_utc": 1698836859,
   "score": 75,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cosxt",
   "message": "Petco plans to do away with their free accounts entirely and only offer discounts to people who pay a subscription fee.",
   "created_utc": 1698838645,
   "score": 23,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cq4d6",
   "message": "US college bookstores.\n\nYou can almost always find the book you need for cheaper by hundreds, if not free altogether online. If you get financial aid that you can only use at the bookstore, then pay out of pocket and you'll get a refund check for what you should have spent at the bookstore. If you can't afford it out of pocket, look at the bookstore for gift cards, a lot have gift cards for Amazon an eBay that you can pay with financial aid.",
   "created_utc": 1698839425,
   "score": 28,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cov97",
   "message": "Still work in it , your premium market chicken from a certain company is grown in the exact same sheds , fed the exact same food , drinks the exact same water as the budget chicken , the premium buyers basically subsidise the budget markets chicken so they can remain competitive",
   "created_utc": 1698838683,
   "score": 19,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cp97w",
   "message": "Wells Fargo didn’t care that what they did was wrong, they were only sorry they got caught. Their newfound commitment to ethics with “EthicsLine” is for PR purposes only.",
   "created_utc": 1698838914,
   "score": 22,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cjn12",
   "message": "I can give you one and I still work there\n\nHotels will give preferential treatment to guests who made a reservation through booking.com, we care about booking scores more than Expedia or even our own website, some hotels even give bonuses to workers if guests give a 10 rating and mention the specific worker by name in the review",
   "created_utc": 1698835255,
   "score": 91,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7cfrud",
   "message": "The £12.99 poppers cost the company 0.37p to make. :\\^)",
   "created_utc": 1698832349,
   "score": 185,
   "submission_id": "17l5kxb"
  },
  {
   "comment_id": "k7d085i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17l5kxb"
  }
 ]
}