{
 "submission_id": "17l8wc9",
 "title": "What is something that people perceive as safe, but in actuality is pretty dangerous?",
 "selftext": "",
 "created_utc": 1698833861,
 "permalink": "/r/AskReddit/comments/17l8wc9/what_is_something_that_people_perceive_as_safe/",
 "score": 143,
 "url": "https://www.reddit.com/r/AskReddit/comments/17l8wc9/what_is_something_that_people_perceive_as_safe/",
 "comments": [
  {
   "comment_id": "k7dqhoc",
   "message": "Stairs. Stumbling and falling down is one of the most common fatal accidents at home.",
   "created_utc": 1698855065,
   "score": 115,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dri25",
   "message": "Driving while tired.\n\nWhen we get exhausted, our minds stop working as efficiently as they should. Our reaction time slows down, we tend to daydream, we hyperfixate, we make poor judgement calls. That scene in Better Call Saul where [Kim runs off the road](https://youtu.be/fnNCDogOCkc?t=161) is probably the most accurate depiction of driving while tired ever to be shown on TV. That scene is supposed to take place over the span of at least an hour; watch the background for clues. Note how the city just quickly vanishes. One second everything is fine, the next second you're in a ditch.\n\nDon't try to be a hero and \"power through it\". On a long drive, stop every two hours and walk around, even if it's just for a few minutes. Don't be afraid to stop longer. And try not to push yourself more than 6-8 hours a day.",
   "created_utc": 1698855442,
   "score": 210,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7chs7p",
   "message": "Driving.",
   "created_utc": 1698833915,
   "score": 159,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7e9aq6",
   "message": "Not knowing what medications you take.\n\nCan’t tell you how many times someone gets brought in to the ER without a thought in their mind about what they take for meds. “Oh my spouse/kids/etc take care of that for me.” What meds you are given in the ER/hospital can be dependent on what you are already on.\nIt is your health, you should have some knowledge about it.",
   "created_utc": 1698861915,
   "score": 152,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7df6fk",
   "message": "Plastic surgery.",
   "created_utc": 1698850765,
   "score": 150,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ddt9a",
   "message": "Climbing in and out of the bath tub.",
   "created_utc": 1698850245,
   "score": 228,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7cm5ac",
   "message": "Childbirth. Still the number one killer of young women globally.",
   "created_utc": 1698836984,
   "score": 17,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7e3gtr",
   "message": "Any mechanism involving a cable or rope can redirect drastic amounts of force, and gain or lose tension unpredictably.\n\nNever take a wrap on a line that you aren't certain the potential load on if you like your fingers. Could be a tow rope on a car. A ratchet strap securing a heavy load that shifts. \n\nAnd stay clear of any line under tension. You got a high speed machete if it snaps.",
   "created_utc": 1698859813,
   "score": 149,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ckm79",
   "message": "Modern day coke..\"but I KNOW the guy he'd never sell me bad stuff\" said a lot of people who aren't with us anymore.",
   "created_utc": 1698835942,
   "score": 98,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7egjod",
   "message": "Eating raw flour. Everyone's worried about the eggs but flour's up there with raw chicken.",
   "created_utc": 1698864555,
   "score": 220,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7efr29",
   "message": "Surgery in general. I feel like people look at a lot of surgeries as something foolproof, because doctors need to have a lot of practice and skills to be able to perform what they do, but with high skill requirement jobs comes high consequences for failure, and it sometimes seems like people don't give surgery enough respect, as it is literally opening up your body in a controlled environment, something that can usually end up being fatal when not done by experts. Like yeah, the surgeons are well trained and this is their job, but at the same time i'm still holding my breath when a professional daredevil does something risky, and to not have any level of respect for the risks associated with surgery is in my opinion very naive.   \n\n\nFor an example of what i mean, there's a noticeably large number of mothers who hold the bad opinion that if you had a c-section, you're not a mother because \"You took the easy way out\", which always angers me so much because of a variety of reasons, one of them being that having to need surgery for any reason is not the easy way, and it shows their lack of respect for what surgeons do.",
   "created_utc": 1698864267,
   "score": 166,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7eb1c1",
   "message": "Heavy drinking. A lot of people, including myself thought that it took a long long time for heavy drinking to catch up to you, like when you're in your '50s or older. And mostly for people whose drinking was clearly catastrophic. And even then that a lot of the damage can be reversed through quitting, in the same way quitting smoking can. I was shocked when people I was acquainted with, or friends of friends, started dying of alcoholism in their 30s-40s. All of these people were high functioning- had successful careers, family, friends. And it was liver failure that came on without much warning. I was kind of shocked- I assumed there were many decades of warnings before your system finally failed, and I thought that most people who drank themselves to the point of it killing them were people whose behavior was clearly out of control, not people who are pretty well functioning in every other way.",
   "created_utc": 1698862548,
   "score": 182,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7d3nl0",
   "message": "Thought of another one, tanning. You're literally cooking your skin and increasing your risk of skin cancer.",
   "created_utc": 1698846052,
   "score": 123,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7elbfm",
   "message": "Putting your feet on the dash of your car while traveling.",
   "created_utc": 1698866299,
   "score": 124,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dq0dg",
   "message": "Eye drops\n\n\u0026gt; Over-the-counter eyedrops and decongestant sprays are frequently used to treat upper respiratory congestion and irritated, red eyes. When consumed by mouth, they may result in serious toxicity and even death.",
   "created_utc": 1698854886,
   "score": 87,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7duc6v",
   "message": "Folding chairs. You can lose your fingers.",
   "created_utc": 1698856488,
   "score": 38,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ecb6j",
   "message": "Driving while using your phone.\n\nEurope did a study, and your reaction is like having 2 drinks.\n\neven hands free, your mind is elsewhere.  -unlike having another person in the car.\n\n\u0026amp;#x200B;\n\n[https://pubmed.ncbi.nlm.nih.gov/16884056/](https://pubmed.ncbi.nlm.nih.gov/16884056/)\n\nBackground: Epidemiological evidence suggests that the relative risk of being in a traffic accident while using a cell phone is similar to the hazard associated with driving with a blood alcohol level at the legal limit. The purpose of this research was to provide a direct comparison of the driving performance of a cell phone driver and a drunk driver in a controlled laboratory setting.\r  \n\r  \nMethod: We used a high-fidelity driving simulator to compare the performance of cell phone drivers with drivers who were intoxicated from ethanol (i.e., blood alcohol concentration at 0.08% weight/volume).\r  \n\r  \nResults: When drivers were conversing on either a handheld or hands-free cell phone, their braking reactions were delayed and they were involved in more traffic accidents than when they were not conversing on a cell phone. By contrast, when drivers were intoxicated from ethanol they exhibited a more aggressive driving style, following closer to the vehicle immediately in front of them and applying more force while braking.\r  \n\r  \n***Conclusion: When driving conditions and time on task were controlled for, the impairments associated with using a cell phone while driving can be as profound as those associated with driving while drunk.***",
   "created_utc": 1698863016,
   "score": 44,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7cstcs",
   "message": "Social Media (Reddit included)",
   "created_utc": 1698840914,
   "score": 32,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7f8mgu",
   "message": "Am I the first to mention garage door springs?",
   "created_utc": 1698874738,
   "score": 37,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7e0jj4",
   "message": "Showering.\n\nEverything in your bathroom is made out of material that can kill you. A slip and fall out of a shower/tub onto the hard porcelain of the toilet (or tub edge), or the corner of the bathroom counter? The tile floors? Immediate brain bleed.\n\nWalking down stairs comes in a close second, especially if you have pets or small children.",
   "created_utc": 1698858758,
   "score": 141,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dj3fd",
   "message": "A human bite.",
   "created_utc": 1698852278,
   "score": 97,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ci9d8",
   "message": "Energy drink. I did a presentation on caffeine in school and was shocked to discover that small children can overdose on only a few cans of energy drink... particularly scary when my 10 year old sister (at the time) drunk so much of the stuff.",
   "created_utc": 1698834264,
   "score": 2,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dz7nm",
   "message": "Blocking fire escapes.\n\nUsed to see this all the time, \"Oh I was just putting it there for now\", \"there's another door right there!\", \"people can just walk around/over it\", \"how am I supposed to do my job with all these mad rules.?!\"\n\nIn an emergency, most people turn into idiots.\nGive them the scenario of an obstical course, or die:\n\nSome people just die.",
   "created_utc": 1698858271,
   "score": 84,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ehgmf",
   "message": "Following another vehicle too closely, especially in a group on the highway. Unbelievable to me that people will be 1-2 car lengths or less in a pack of cars going 60-70 mph+, especially with 18-wheelers in the mix.",
   "created_utc": 1698864884,
   "score": 55,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7e3pau",
   "message": "Home fireworks displays. Every time I’ve been involved in one it’s very nearly gone titsup in a very bad way due to something falling over or not launching or the fuse being way shorter than expected/advertised (usually not to do with me!).",
   "created_utc": 1698859898,
   "score": 50,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dwsxq",
   "message": "Water.",
   "created_utc": 1698857393,
   "score": 22,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7efelp",
   "message": "Alcohol",
   "created_utc": 1698864142,
   "score": 24,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7elbfb",
   "message": "This crazy neck cracking trend. A little research and you will see a crazy amount of people that went in to a chiropractor for this and ended up paralyzed or dead, do your research before having any spinal adjustments done",
   "created_utc": 1698866299,
   "score": 69,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7cs4tv",
   "message": "Sex w/o protection…",
   "created_utc": 1698840549,
   "score": 149,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dxvr9",
   "message": "The sun",
   "created_utc": 1698857784,
   "score": 18,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dvkko",
   "message": "Not wearing a helmet while cycling or skateboarding or roller skating. I have called an ambulance for a teenager who hit his head on a curb doing a skateboard trick and had such a terrible head injury that he slipped into a coma at the hospital and died. It haunts me.\n\nHumans are resilient and can survive crazy things but it can also take as little as an unfortunate fall to kill you.",
   "created_utc": 1698856942,
   "score": 72,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7cm4qm",
   "message": "Alcohol. You're literally drinking poison",
   "created_utc": 1698836974,
   "score": 197,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7drx74",
   "message": "Sugar.\n\nLook at how much sugar is in that grande caramel frappuccino or soda you're drinking. Now go into your kitchen and pour out that much sugar on a scale. Would you down that much sugar in one setting?",
   "created_utc": 1698855600,
   "score": 98,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7efaa3",
   "message": "Having unprotected sex. \n\nLike ALL STD’s life is also sexually transmitted. \n\nAddendum: having sex may also randomly may change the outcome of the baby.",
   "created_utc": 1698864099,
   "score": 14,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7eoabj",
   "message": "Sitting, at home or during long work hours, sedentarism is already bad but sitting turbochargers all bad effects it has on your health, they are not kidding when they say its as bad as smoking, higher risks for heart disease, diabetes, stroke, high blood pressure, and high cholesterol you name it.\n\nI have had a deskjob most of my adult life and hobbies centered around a computer but I still jog everyday and try to move as much as possible during iddle hours at work, my coworkers have even asked me why I walk around so much.",
   "created_utc": 1698867386,
   "score": 44,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7eeit1",
   "message": "Motorcycles: I've known more than one guy who wanted to be a biker and gets himself a Harley and then finds out how hard they are to drive and get killed.\n\nAlso guys even though they have been riding all their lives dont realize they are getting older and dont have the same sense of balance or riding skills. And they get killed.",
   "created_utc": 1698863822,
   "score": 49,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ew626",
   "message": "Hiking. If it‘s a big area without proper trail marking people tend to overestimate themselves and get lost easily. Without a cell phone with connection and enough water it can get tough really soon. Cold nights outside, nothing to eat/drink, dense forests that prevent being spotted by helicopters or wide unvegetated areas where the sun burns down on the hikers and dehydrates them even more",
   "created_utc": 1698870232,
   "score": 15,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7eyk4j",
   "message": "Paracetamol or acetaminophen. \n\nIt’s available to buy over the counter but it’s deadly as fuck and it is a horrible death. Only use as directed on the packaging or by a trusted health care professional.  Do not exceed the recommended dose. \n\nIf you are feeling helpless reach out. There are many anonymous support services. Talk to somebody.",
   "created_utc": 1698871091,
   "score": 14,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ezmgu",
   "message": "Being comfortable working around machinery.\n\n I have heard too many horror stories of people getting too comfortable and acting in ways they shouldn’t around moving equipment and machines and horribly maiming themselves or dying. \n\nNow you shouldn’t be terrified but you should always be afraid enough to always remain cautious",
   "created_utc": 1698871471,
   "score": 10,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7du6tf",
   "message": "Hot weather. In the UK because we normally associate this country with being very cold, windy and rainy, the dangers of extreme heat is often overlooked. It's quite easy to die from heatstroke in 30 celcius weather, if you stay in the sun too long!",
   "created_utc": 1698856433,
   "score": 57,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7e4ygv",
   "message": "Doing “stunts”or “pranks” involving fire. I’m not saying people think fire is 100% safe, but the level to which they underestimate it is astounding. \n\nEdit for posting too early",
   "created_utc": 1698860353,
   "score": 27,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7eho3b",
   "message": "Mosquitoes! bad mfs",
   "created_utc": 1698864959,
   "score": 27,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7f6af2",
   "message": "Household cleaning products.",
   "created_utc": 1698873876,
   "score": 11,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ey9hc",
   "message": "Chiropractic adjustment. Specifically, neck adjustment. It can easily cause stokes from damage to arteries in the vertebrae. A lot of people die or are paralyzed every year from getting their neck \"adjusted.\"",
   "created_utc": 1698870986,
   "score": 36,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ela8d",
   "message": "Passenger putting feet on dashboard.",
   "created_utc": 1698866287,
   "score": 10,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7emwcz",
   "message": "Hippos",
   "created_utc": 1698866877,
   "score": 9,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7eeqja",
   "message": "Alcohol. \n\nDestroys lives. Destroys relationships. Destroys civilization.",
   "created_utc": 1698863899,
   "score": 51,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ed82z",
   "message": "Acetaminophen/Tylenol. I'd really appreciate it if we made a drug that is better at treating headaches and fevers than ibuprofen (ibuprofen being better for muscle pain than headaches or fever, even if it helps a little) and is also easier to dose than acetaminophen. 1 is too little, 2 may be too little or just enough, 3 may be just enough or too much, and 4 may kill you. \n\nI have to either have a very *very* bad headache that impedes with my ability to function rather than just being painful or a super bad fever (over 101° F) before I even touch acetaminophen.\n\nEdit: typo",
   "created_utc": 1698863345,
   "score": 23,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7emtri",
   "message": "Driving is insane when you think about it.",
   "created_utc": 1698866851,
   "score": 20,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dy5yl",
   "message": "Online Games",
   "created_utc": 1698857887,
   "score": 9,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7d14mg",
   "message": "People thinking they need to put their hands on every animal they see",
   "created_utc": 1698844946,
   "score": 39,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7e8ni4",
   "message": "messing with Leroy Brown",
   "created_utc": 1698861675,
   "score": 38,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7cjzp6",
   "message": "Cats.  They're always plotting your demise and how quickly they can turn your carcass into a casserole.  Trust not the fuzzy ones...\n\n\\*wuffles tiny pet ninja\\*",
   "created_utc": 1698835507,
   "score": 92,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ciw66",
   "message": "Vape",
   "created_utc": 1698834720,
   "score": 77,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7descg",
   "message": "Living. Everyone who have tried end up dead at some point.",
   "created_utc": 1698850616,
   "score": 48,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7ei1j1",
   "message": "Sucking helium",
   "created_utc": 1698865094,
   "score": 16,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dlzmx",
   "message": "Being horny, people will do anything it’s scary",
   "created_utc": 1698853394,
   "score": 27,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7eh7t8",
   "message": "Being overweight",
   "created_utc": 1698864796,
   "score": 29,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7dpy47",
   "message": "Dreaming of living in the USSR. You DON'T want this",
   "created_utc": 1698854862,
   "score": 41,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7fi3gd",
   "message": "Walking next to forklifts at Costco",
   "created_utc": 1698878465,
   "score": 8,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7epkwm",
   "message": "Raw milk",
   "created_utc": 1698867859,
   "score": 16,
   "submission_id": "17l8wc9"
  },
  {
   "comment_id": "k7f9zui",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17l8wc9"
  }
 ]
}