{
 "submission_id": "17la91a",
 "title": "What’s the worst act of human cruelty you’ve known or experienced?",
 "selftext": "",
 "created_utc": 1698839238,
 "permalink": "/r/AskReddit/comments/17la91a/whats_the_worst_act_of_human_cruelty_youve_known/",
 "score": 251,
 "url": "https://www.reddit.com/r/AskReddit/comments/17la91a/whats_the_worst_act_of_human_cruelty_youve_known/",
 "comments": [
  {
   "comment_id": "k7ewxse",
   "message": "I don’t know if I could choose the worst I’ve ever known between all of the horrific atrocities around the world throughout history. But as far as the worst one I’ve experienced- I’m a nurse, and in my first ever pediatric clinical my first patient was a toddler who had a potty accident and was beaten so badly by a parent they had to have multiple surgeries to repair the damage done. I had to excuse myself to throw up and cry. It’s the reason I can’t work with kids, I couldn’t handle it.",
   "created_utc": 1698870507,
   "score": 165,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f8942",
   "message": "My brother and I were locked in a room together quite a few times when we were little. It started when he was 1 and I was 5 years old. We were sometimes stuck in there for one or two days, and it was miserable. It was always dirty, and nearly everything was broken. I remember that I used to scream and cry at the door for hours, but no one would let us leave. The woman that gave birth to me would occasionally drug me to make me fall asleep faster.",
   "created_utc": 1698874606,
   "score": 66,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f54im",
   "message": "I had a 19y/o assault victim brought in by EMS. Her bf had sat on her back and bitten her repeatedly on the upper back and shoulders. The bites had become progressively worse as he systematically wet side to side and top to bottom. They started as superficial gradually becoming harder and deeper until entire chunks were missing. Police stated they didn’t find the missing pieces on scene and assumed they were swallowed. Victim stated the process till over an hour. She also stated she didn’t want to press charges and thought he had just gotten mad and made a mistake. 15 years later I still wonder if she got out of that relationship alive.",
   "created_utc": 1698873447,
   "score": 122,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7dlrse",
   "message": "My mom lied about my brain tumour in 2008 and it turned to cancer by 2020 because I didn't know it was there all so she could be 'right'.",
   "created_utc": 1698853312,
   "score": 252,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7dzvxp",
   "message": "I taught English and translated immigration documentation for African refugees in the U.S. and this one guy's story tops them all for me.\n\nNSFW warning:\nThere was a war in his country between two tribes. One day, while at work, someone found out he was from a particular tribe, so they kidnapped him and started torturing him for fun. They denied him food and after a couple weeks without food, they gave him a whole bunch of raw meat to eat for a few days. Eventually, they showed him that the food he ate was actually the dismembered parts of his wife and kids. They then threw the severed heads of his wife and kids into his cell to \"keep him company\". They would attach car batteries to his genitalia to electrocute him on a weekly basis until he was crippled from the waist down and couldn't control his bladder and bowel functions.\n\nAfter several months of this, they eventually broke his legs and threw him into a muddy pit with a bunch of other guys from his tribe. He said that their captors never fed them, so whenever someone would die, they would eat them to survive a little longer. He did this for about 3 years until he was finally rescued and sent to the U.S. as a refugee.\n\nEdit:\nFor everyone asking, yes, he was getting a lot of psychological help and he still is. His biggest struggle to overcome is actually survivors guilt. He blamed himself for not having enough self control to just let himself starve to death. He said that when you are truly starving to death, you will eat dirt, grass, rotting food, toe nails, anything to fill your stomach. Even after 20 years, he was still saying he should have just eaten the mud and his own hair to fill up his stomach and let himself die.",
   "created_utc": 1698858516,
   "score": 20,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7egy9l",
   "message": "Well, IRL... \n\n\n I was a cable guy for a few years, and I went to install the most expensive  package in a house.. it was around tax season, so they just got a hunk of money for the moment.. ( went out 3 months later and turned it off)\n\nWell, I was there for a few hours... floor covered in dog shit, cat shit, smelled like piss... I was walking on old shit avoiding the fresh shit... I was wrapping up my education on the tivo when a baby came crawling out from under a table.. I quit talking and walked right outside.  Called my supervisor and then the cops. Pretty traumatic,  went home and took 2 days off.\n\nThen there is crazy shit you catch online",
   "created_utc": 1698864700,
   "score": 164,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7cseyk",
   "message": "In my town years ago a woman had 3 children and she drove her car into a pond and drown them because she was seeing a wealthy man and he told her he didn’t like kids.",
   "created_utc": 1698840697,
   "score": 119,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7e4rer",
   "message": "Listening to my parents comfort my pedophile rapist as I cried begging them to believe me \n\nAnd then listening as my father called me a liar on the way home\n\nAnd then finding out two years later my mother who sat there and comforted the pedophile knew I was telling the truth the whole time",
   "created_utc": 1698860282,
   "score": 174,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f0vru",
   "message": "Maybe not the worst I've seen, but as a kid, we found this small black cat outside. My parents waited to see if anyone came looking for her or put up signs (before social media) a couple of days later I heard a kid on the bus talking about how he lost his cat and had nothing to shoot his paintball gun at, so we kept the cat.",
   "created_utc": 1698871917,
   "score": 166,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ezqcu",
   "message": "One act in particular that sticks with me from my childhood - When I was around 7, one of my family’s barn cats had a litter of kittens. They suddenly disappeared about a month after they were born. I asked my dad if he knew where they were and he said no, maybe they ran away. A couple days later, one of the kittens wandered up with half its face missing. My dad admitted he and his friend had gotten drunk, taken the kittens into the woods and shot them. My mom had to have the kitten who survived put to sleep at the vet’s office that day. \n\nI just cannot fathom how you could do something so cruel to an animal or to a little girl. It makes me sick that I share DNA with that person.",
   "created_utc": 1698871509,
   "score": 99,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7cu7m5",
   "message": "I was told on my 11th birthday by my father \"I hate you and I never wanna see you again.\" He was my idol. He knew that. If that isn't cruelty, idk what is.",
   "created_utc": 1698841638,
   "score": 230,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f5gl9",
   "message": "My great-grandfather was a lay preacher, and a paedophile.\n\nHe’d take kids to a storage shed behind his house, and sexually abuse them. Usually between the ages of 5-12. Boys, girls, he didn’t have a preference.\n\nHe also liked to take photos with a Polaroid camera. There were boxes and boxes of photographs in there, film reels, books. It’s suspected that he had an accomplice, because all of that material just vanished into the wind when he died.\n\nI know there’s worse things that have happened in the world, but the shit that went on in that building is utterly chilling. So many kids were hurt, and so many lives were irrevocably altered, or destroyed.",
   "created_utc": 1698873573,
   "score": 161,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ds3yb",
   "message": "Heartbroken, I confided in a friend that I’d had a miscarriage and she told me that maybe it was God’s way of teaching me humility. \n\nDefinitely not the cruelest thing to ever happen in the word, but one of the cruelest things someone has ever said to me personally.",
   "created_utc": 1698855667,
   "score": 92,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7d93y8",
   "message": "Where I'm from, there's a disgusting practice of abandoning female newborns because people still do not see the value in raising a daughter. For so many, it is still seen as a financial and social burden. I'm sure there is a plethora of reasons and rationales for it, but when it results in newborn girls left out in garbage piles, or abandoned construction sites, or fields, etc. the reasons do not matter.",
   "created_utc": 1698848354,
   "score": 212,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fbmc8",
   "message": "I live in a little town. 10,000 people. One night I was walking home from the pub and heard screaming. Turned a corner and saw a guy I knew called Joe stumbling towards me. He had blood streaming from his neck and throat and collapsed in front of me. I ring an ambulance. Down the street there is still screaming. I take off my shirt to cover the wound. I think he's going to die. Then a girl stumbles up the street with half her hand missing.\n\nA guy just started chopping the shit out of people with a machete because his girl left him. Mutilated about 6 people before he was taken down. Joe survived with a gnarly scar. The girl, I'm not sure what happened to her. I still dream about the incident to this day.",
   "created_utc": 1698875856,
   "score": 30,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7d2iis",
   "message": "I was at a troubled teen camp when I was 14. One of the times I was dragged down the stairs, kicking and screaming by staff and thrown into a reinforced concrete cell with a camera on the ceiling and a swastika drawn on the back wall, eventually I gave up slamming the giant metal door with my shoulder, sat with my face in my knees, and cried. Eventually I chose the \"take pants off for smaller pillow, but can pull shirt tail down for slightly more warmth\" instead of the \"use your shirt as a larger pillow, but are cold\" option when I walked and tried to fold myself into a ball or warmth in the corner of the cell. You never know how long they leave you in there, you look at a clock when they let you out, most likely not having seen one as you were being dragged there. When they let you out, everyone just acts like it was another, typical day.",
   "created_utc": 1698845555,
   "score": 157,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ewz12",
   "message": "As of late , I worked at a emergency animal hospital one of the biggest in my state. We had our hospital manager come up to us, she said we have a special case, as special she means police are involved. Well it turned out, there was a young kid, prob 12-13 years old. He was sending videos to his friends of him doing the unthinkable to his dog. And filming it, torturing it. He was found out cus he sent it to friends or classmates, from Xbox video. And I felt so bad for the animal. If police were getting involved it wasn’t good. The parents had no idea, it was prob a whole shock and traumatizing. Sorry if some one reads this",
   "created_utc": 1698870519,
   "score": 205,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f8qy2",
   "message": "Child abuse. I am a pediatric nurse so I have seen some heartbreaking things. Parents who starve their babies until they finally take them in to hospital some don't make it. One little boy was 18 months old and weighed 12 pounds or so and was so neglected that we had to take turns on the ward holding him because he would cry so much when put down in his crib. A boy whose dad was so messed up on meth he beat him to death in a hotel room. Hotel called cops and he was successfully resuscitated. Now has brain damage and can't walk or eat orally has to be fed by g-tube. These are just a few examples.",
   "created_utc": 1698874783,
   "score": 132,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fbulz",
   "message": "When we were adopting through the foster system, you look through a book of kids who've had the parental rights taken away as possible fost-adopt. Some of those cases were horrific. Two that came to mind:\n\n1. A mother had her two children taken from her at the age of 1 and 2 because of neglect and physical abuse. After classes and counseling, she was reunited with the children. Within a few months (the children were 2 and 3 now), they were taken again because the police were called to the house, her ex BF (father of the children) had just shot her current BF dead in front of the children. When the police got they found that the mother had dipped the kids' legs into boiling water as 'punishment' for not eating. The younger child's burns were so bad, she was still in the hospital months later. When we were considering fostering, they said the kids had to be placed at least 200 miles from the home because the bio-dad's gang was looking for them and said they'd kill anyone with the kids.  We said no to those two because we had a 6 yo daughter. It was one thing to endanger our lives, another to endanger a child. But I still think about them sometimes and hope their lives got better.\n2. the other was three siblings who were taken from a cult that believed that sex at 4-8yo (i.e. child rape) was required for salvation as some sort of horrific 'baptism'. These were the youngest of 7 kids removed from the home. The only three who hadn't gone through the 'ritual' yet. We couldn't take three siblings (they wanted to keep them together)\n\nWe ended up adopting a 4 yo whose meth-addict mother had her taken away 3 times for neglect and violence in the home, the last time because she was on strung out on a binge and hadn't fed her child in over 2-3 weeks. She (the child) was found raiding a neighbor's garden, she was emaciated. She had a horrible foster-home for a while too. It was a rough first couple years for us and her, but that 4yo is now an amazing, resilient, kind and powerful young woman.\n\nMy heart aches remembering that book. Humans can be vile.\n\n\u0026amp;#x200B;\n\n(edited to fix formatting and add a sentence)",
   "created_utc": 1698875944,
   "score": 9,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f7s1l",
   "message": "I don’t want to talk about the worst incident I had growing up but my mother repeatedly slammed my fingertips in a door, one by one, repeatedly, until they turned black and the nails disconnected and fell off. It took forever for them to grow back and some of them grew back with the white lines all wavy because of damage to the nail beds.",
   "created_utc": 1698874430,
   "score": 69,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7cv6rs",
   "message": "Somewhere between ISIS liveleaks and cartel violence.",
   "created_utc": 1698842138,
   "score": 89,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fck3f",
   "message": "A little girl that lived in the neighborhood, parents were addicts and total trash. My daughter was a year or two older and the kid would hang around and we would give her lunch or juice boxes/snacks. We bought my daughter a new bike for her birthday and she wanted to give her old one to this girl. She cleaned it up and gave it to her. Middle of the night the father is banging on my door screaming that I gave her a bike. Destroyed the bike in the middle of the street, all while the girl screamed and cried and BEGGED him not to. Broke my heart",
   "created_utc": 1698876217,
   "score": 113,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7eu81p",
   "message": "The Junko Furuta case, it's so inhumane I hate to even think about it.",
   "created_utc": 1698869529,
   "score": 152,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7eoax9",
   "message": "All the worst acts I’ve witnessed occurred within my own family. Normalized incest, extreme animal torture, rape and murder.\n\nMy aunt kept the family dog chained to a tree in the yard its entire life. When I’d visit, I would sneak him food and look into his terribly sad eyes and pet him, telling him one day I’d find a way to free him. The chain was held to his neck with a lock. I would get beaten for treating him well. He was left out all winter. Ridiculously, my aunt was a Buddhist and always lecturing us on developing good karma.\n\nMy family is the reason I’m so fiercely protective of animals and all innocent beings. I’ve heard people describe killing others in excruciating detail, through laughter. In my world, there was such a casual tone to the evils committed. Nothing scares me in this world like my family. In real life, I call them my relatives. Not many natural deaths. My grandma was beaten to death with a 2x4 and her funeral is my first memory at 2 years old.",
   "created_utc": 1698867392,
   "score": 41,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fdnbq",
   "message": "When I was 14, I lived with my mother and step-father. My dad deployed to Iraq. After a couple of months, my father was not contacting me or my brother anymore. My step-father sat us down and told us that our father had been killed in war. The abuse increased. Including molestation. I did not have a period for a few months until passing a massive painful clot in the shower alone.\n\n To this day, I am still unsure what actually happened. \n6 months after my father \"was killed,\" he showed up at the door alive.\nHe was never dead.  My mother and stepfather lied to us. We lived with our dad after that \n\nI've been diagnosed with PTSD multiple times, but finding a good therapist is difficult. When I tell them, three have cried. One of them let me go as a patient because my trauma was too intense for her to handle. One had accused me of making things up because no legal action has been taken.",
   "created_utc": 1698876638,
   "score": 126,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f5011",
   "message": "My aunt had an affair with a married man. She got pregnant and had my cousin (he ended the affair when he found out about it, didn't get divorced, didn't want to have anything to do with my aunt and/or their child). She sued him for child support a few years afterwards. There were a few instances where both my aunt and his ex had to attend hearings. Whenever these would take place, my aunt would hype up my cousin - a 3-4 year old kid - telling him that he was going to see his dad. She told him that his dad was super excited to see him, and that he needed to run up to him and give him a big hug, and say 'daddy!!'. The poor innocent kid was so disappointed when the man wouldn't even turn to look at him. My aunt is horrible. Who does this kind of stuff to their own kid? Their own blood?",
   "created_utc": 1698873401,
   "score": 115,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f05ha",
   "message": "I spent five years as a child abuse detective. The things I saw there and heard about first hand are things I can literally never repeat out of a courtroom. Even my therapist asked me to stop telling my experiences as it was traumatizing her.",
   "created_utc": 1698871659,
   "score": 197,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7elhh0",
   "message": "As a guy was actively, undeniably raping me, he saw me sobbing and said ‘don’t cry, I’m not going to rape you’ the started punching me while still raping me",
   "created_utc": 1698866362,
   "score": 78,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f0l6s",
   "message": "I grew up dirt poor, for awhile we only had food because we got it from the government (mid/late 80s) and my parents kept making more kids. My mother was absent because she was working all the time and my father was absent emotionally and mentally. He only really interacted with me and my 3 younger siblings when we disturbed him in some way, and trust me that was not fun. So as a child I got to raise 3 other kids in utter poverty. Trying to pick one \"worst thing\" is really hard. I've saw gang violence, the horror of drug addiction, and some other pretty nasty stuff before I had even become a teenager. I've been told that I shouldn't be depressed as an adult because other people have it worse, but the neighborhoods I lived in as a child would fit right into any 3rd world country.",
   "created_utc": 1698871814,
   "score": 14,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f8s9o",
   "message": "One of my paramedic classmates got hired on after me. I had been in the field for some time before she had her first day. On her very first emergency call of her very first day, she had a cardiac arrest of an infant. 8 months old, I believe. They weren't able to save it. Turns out stepdad raped the infant and then strangled it to death. They didn't find out about that part until the day was almost done. Step dad had been at the scene shaking people's hands and thanking them for trying to save his \"baby girl\". \n\nFirst responders see a lot.",
   "created_utc": 1698874797,
   "score": 194,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7eym49",
   "message": "At age 10 I was beaten and sexually assaulted, forced to do despicable things by two other kids the same age, for hours on end. \n\nMy alcoholic mother finally came home after a crowd had gathered outside our home. She put us in the car, and took us back to the pub. \n\nHis mum bought my mum a pint  and that was the end of it. \n\nAnd just to top it off, whilst two women were bonding over their love of a pint more than their kids, I sat there, bloodied, broken and bruised, and was asked by my mother to go and play with the person who had don't this to me, because 'he looks sad'. \n\nThe price of trauma, circa 1999      £1.30",
   "created_utc": 1698871111,
   "score": 93,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fggwg",
   "message": "I worked at a pet store when I was younger and thought I wanted to become an SPCA officer. One day an SPCA truck came to drop off some rescue puppies (can only sell rescues in pet shops where I live), and my manager asked me to come out to the van. She warned me there was a cruelty case inside heading to the vet to be put down and asked me if I wanted to see it so I knew what I would be getting into - I said yes. \nSomeone had poured gasoline or oil onto a dog and set it on fire. The dog was manic, in so much pain, and it’s skin had been pulled tight over it’s skull from the fire. \nStill haunts me to this day, and I’m so thankful to my manager for giving me the chance to recognise I could not handle that kind of cruelty on a day to day basis. I did however set up an annual donation to the SPCA - absolutely insane that that was a normal Tuesday to the officer.",
   "created_utc": 1698877775,
   "score": 90,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f3eab",
   "message": "I told my dad I wanted to kill myself and he said “do it already”.",
   "created_utc": 1698872818,
   "score": 3,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7eplyi",
   "message": "My brother passed away recently, I invited my parents to come stay with me for a change of scenery and help them grieve, once in my home, my dad told me I'm a  worthless man and there's nothing I can do about it.    \n  \nThis is small on the scale of cruel acts committed worldwide, but to me, it felt crushing.",
   "created_utc": 1698867869,
   "score": 214,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ezmq3",
   "message": "It's far from the worst posted here but \n\nMy maternal grandmother was very well off financially. Due to having been left a fortune by my grandfather who died before I was born.\n\nShe had two children: my uncle, her eldest and my mom.\n\n She bought my uncle his own practice when he graduated medical school (which she also paid for). Put over $3 million into it.\n\nMy Mother worked as a bartender to pay her own way through college.\n\nAs a wedding present she bought my uncle a 2 million dollar cottage.\n\nWhen my parents were married she gave them a cheque for one thousand dollars.\n\nMy three cousins on their 16th birthday each received brand new cars (Cadillacs) as a gift from her.\n\nOn my brother and my respective 16th birthdays we received a single old navy sweater each.\n\nThe reason for the difference being, we as a family did not attend their church. My mother stopped attending their church when she got pregnant outside of wedlock with my older brother and was shunned by them.\n\nWhen my mother died of Cancer, my grandmother and her side of the family did not attend her funeral.\n\nWe weren't people to them. Much less equals or family.\n\nThere's no hate like Christian love.",
   "created_utc": 1698871474,
   "score": 101,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7dvaob",
   "message": "When i was 12 i remember crying real bad and my father took a bat and swing it to me since i won't shut up. I used to be a papa's girl. Now all i can remember the things he did to me. The bruise and the tears that he made.",
   "created_utc": 1698856843,
   "score": 81,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7epjbo",
   "message": "My grade 6 teacher hated me and would falsely paint me as being special needs to the class. I was regularly discriminated against and he was given free reign by the school to interpret my tourettes diagnose however he wanted.\n\nOne time, I made a funny face during class photos. My teacher pulled me from class for the rest of the day and outed me to the entire class as being on the spectrum. He told them a lot of lies about how I was mentally unstable and incapable of controlling myself. This formed the basis of the nasty rumours that plagued me through all of high school. I don't feel like I was ever supposed/allowed to succeed.",
   "created_utc": 1698867843,
   "score": 20,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ezcdp",
   "message": "Babies being conceived and born specifically for newborn-infant sex trafficking in Asian countries. My mother is from the Philippines, and was a victim of this at the hands of her own mother who pimped her out, and my grandmother was also a child prostitute.     \nCruel, vicious cycle encouraged and funded by Western tourists.",
   "created_utc": 1698871371,
   "score": 178,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ezzwd",
   "message": "I was in the army and my friend was deployed he told me about a girl no one liked on the deployment team and there was one part of Afghanistan in particular that was getting blown up more frequently then others, so guess where they sent her? She lived but now she has PTSD for the rest of her life because a few people in power didn’t like her.",
   "created_utc": 1698871604,
   "score": 48,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ez5t6",
   "message": "Had a fresh store manager who just got hired tell me to schedule someone’s hours to about 5 hours even though they are full time (40 hours) with a family to feed because they called out twice the previous week. The employee called out because his father died. \n(Background info, the fresh store manager didn’t know anything so I had to train the guy. So I was making the schedule for him which is why he told me to short his hours) (and yes I was a step under the guy with like 5 years experience)",
   "created_utc": 1698871305,
   "score": 64,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fdkjk",
   "message": "Once my dad told me if I were a woman I’d be an aids riddled prostitute on my 15th abortion sleeping with dirty black men because I’m too stupid for anything else. I was at most 15 years old and this was his response to finding out I had an eating disorder. Funny enough this isn’t the worst I’ve been through, just what I feel most comfortable sharing",
   "created_utc": 1698876608,
   "score": 61,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f0wl9",
   "message": "Experienced? Child sexual abuse for 7 years.",
   "created_utc": 1698871925,
   "score": 58,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7cq4sf",
   "message": "I mean, I saw a video where a Russian cuts off a guys testicles with a box cutter while he is tied up and screaming in agony. That seems pretty cruel",
   "created_utc": 1698839431,
   "score": 149,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7croe7",
   "message": "On a lonely night , my curiosity drove me to surf on creepy gore websites, so i found this video of a couple stabbing their little child multiple times and cutting all of his members ... IN PUBLIC while being filmed by their neighbors",
   "created_utc": 1698840300,
   "score": 139,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7evmw9",
   "message": "I confided in a former boss that I had an anxiety disorder and that I was having issues with my meds. (big mistake)  \n\n\nHe ended up weaponizing that fact and used it against me over every little mistake I had made that week.  Glad I don't work there anymore.",
   "created_utc": 1698870040,
   "score": 191,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f7k6w",
   "message": "Personal or general?\n\nGeneral: when I started to get into true crime and read about child abuse/murder cases. Some of the worst things I've ever read and wish I hadn't. But at the same time, those kids deserved to be remembered.\n\nPersonal: my mom telling me after my grandmother (whom I had been close to) passed away, \"Ya know, she thought you were backwards...\" Had no way of verifying it and talking to my grandmother about it. So now I'll go on to wonder if she really said that about me and why. In addition, her husband, my grandfather, was sexually abusing me for years and I wondered if she knew or even suspected so it was like an extra slap in the face if she said *I* was backwards.\n\nMy dad ties with my mom when he up and left one morning for work, not coming back. He fled to another state and got a new job there while we were left filing a missing person case and left broke since he was the main breadwinner at that time. Literally our lights were turned off and hot water shut off frequently. He also left me with my unstable mother who then took everything out on me.",
   "created_utc": 1698874349,
   "score": 50,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7d2urr",
   "message": "Worked in the dog rescue business for over 20 years... specialized in the rescue/rehab/rehoming of bully breeds - Rottweilers,  Pits, Mastiffs, Bulldogs, etc.  The shit I've actually seen people do to dogs, as well as the horrific aftermath of what some people have done to dogs, is nightmare fuel. Things I can't even think about, let alone type, without breaking down.  Humans are some of the most intentionally cruel creatures on this planet.",
   "created_utc": 1698845705,
   "score": 212,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fmsvk",
   "message": "I worked for Child Protective Services for about a year. \n\nI saw a lot of cruelty. \n\nA little girl of 2 or 3 was brought in wearing a full body cast. Her mother, in a fit of rage, had picked up the girl by her feet \u0026amp; slammed her into a wall. \n\n2 sisters, one around 7 \u0026amp; the other 12, came in, both with knife wounds, bruises, \u0026amp; broken bones. Their meth-head parents had left them home alone. Their dealer showed up to collect, \u0026amp; found the 2 girls. So he proceeded to pull out a knife \u0026amp; rape the 12-year old. The 7 year old attacked the guy \u0026amp; both her \u0026amp; her sister fought him. A neighbor heard the commotion \u0026amp; called the cops. The 12-year old was ok, but was in a wheelchair because the guy had slashed one of her hamstrings.\n\nThose are just two examples. So many neglected \u0026amp; abused kids came through there. The parents/caretakers were always so angry at CPS, but they did this shit to their own children.",
   "created_utc": 1698880390,
   "score": 48,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f33me",
   "message": "The horrible torture murder of Sylvia Likens. She and her sister were entrusted into the care of a vile woman (Gertrude Baniszewski) who proceeded to starve, beat, burn, scald, starve, and humiliate Sylvia in almost any way you can think of. It was legit torture. Before she died, Sylvia was forced to carve \"I'm a prostitute and I like it\" into the skin of her own stomach. She was 16 when she died. Baniszewski recruited her children and Sylvia's own sister to contribute to her abuse. Baniszewski only served 20 years.",
   "created_utc": 1698872710,
   "score": 92,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7eyfs7",
   "message": "Junko Furota's story",
   "created_utc": 1698871049,
   "score": 154,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7d2x9s",
   "message": "Using children as suicide bombers",
   "created_utc": 1698845735,
   "score": 86,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fcnr6",
   "message": "Everything about the monkeys and “The Pit of Despair” that one fuck who called himself a scientist did in the name of “science” that was later found to have literally zero benefit to science outside of finding out that tortured monkeys become sad when you torture them.",
   "created_utc": 1698876257,
   "score": 83,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7e130z",
   "message": "Two-way tie:\n\n1) A psychiatrist telling me he wasn't going to stop my father from abusing me because it made my father happy, and he wasn't going to take away someone's happiness. So, instead, he wanted to teach me how to like and accept the abuse so that I could be happy even though it was happening to me.\n\n1)  A police officer telling me, \"If this guy says he's going to kill you, then move, 'cause we aren't going to do anything, 'cause we don't care.\" when I tried to get them to save me from a stalker who was trying to murder me.",
   "created_utc": 1698858954,
   "score": 161,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7gkq1c",
   "message": "TW: starvation, sex trafficking, child abuse, \n\nI remember being told strictly to not distribute our rations, that it would get people trampled. I felt shame drinking from a bottle of clear water, I suppose another woman did too. She kicked a bottle over towards the waiting line of people on \"accident\" with a confident smile. I remember maybe ten refuges piling on top of eachother as they scrambled and clawed for the plastic vessel. My fellow voluntee was moved inside to work with stocking.\n\nTrying to explain how to take antibiotics to a seven year old for an STD in a language I could barely understand, the translator's voice turning my shaky English instructions into kind and warm syllables I'll never know. A pretty child so small they looked like they were half the age with the biggest eyes who still gasped in excitement at the offer of sparkle stickers from a stranger with medicine. The child was born in the refuge camp and had only ever left it for \"work\", the translator tried to explain in simple words. Me, a naive American woman who thought working with the kids would be strep throat and bacterial infections, malnutrition and parasites. Not STD treatments to treat the disease an American person could have given. After all, we had been warned weeks before that we would likely be propositioned as \"your country sends a great deal of clientele \".\n\nI remember the camp's Priest rubbing my back while I sobbed at the dinner table unable to eat that night, the pagan star dangling from my neck. He tried to explain, in broken English, that the child was in regular attendance at the church and that their mother had tried to keep them from the sex trade, but money buys food and without food the child starves. He tried to assure me he would see to their safety, I couldn't bring myself to ask him how. I asked him if my food could be given to someone else and remember him stating that I needed to eat every ration I was given for energy, as there would be \"more pain to help\" at the make-shift clinic in the morning. I begged my Gods to help me ease their suffering that night, hands clasped with Protestants, Catholics, Jewish, Islamic, and me, the lone Pagan. We wrapped each other in comfort and our prayers mixed over each other's as we all spoke softly around the plastic table.\n\nWe volunteers slept in the church, the only place nearby that had wooden floors and foundation. They locked the church door at night with a simple padlock on the outside, stating it kept everyone safe from desperate people. I never dared to question how we would get out if something like a fire happened, though that seemed impossible at the time. It had poured throughout the day and night, mud and human waste mixed as the sky tried to wash away the camp. It quickly overflowed into people's shacks and lean-tos. I laid there on my dry cot and watched a small leak in the roof drip into an already half filled black trash can and thought about the children that were covered in mud trying to sleep. I thought of the child trying to carefully count out the antibiotics into muddied hands, the small slip of instructions in multiple languages surely destroyed by the sheer amount of water weeping from the dark clouds.\n\nI laid there and wondered if the sparkly stickers could stick. The translator had told me the child stated they would stick them all over the walls of their home so their siblings could see them too. Of all things, I sat there and hoped the stickers would stick and stay. No matter how much water and through every storm to come. It guess it was easier than thinking about if a child without formal education would be able to safely take medicine when they had struggled to read the makeshift clinic's signs.\n\nThe horrors I saw from my short time there are endless. Despite that, there was hope and laughter, children trying to teach me words by showing me objects on my brief breaks. A few adults that did speak English thanked me and ask if I was enjoying my time in the country. I replied that I loved seeing the different animals as I worked, the ones they saw everyday like I would see a squirrel or pigeon on the street. They laughed and shared stories of their countries, some I could barely pronounce. I think about the people that lived at the refuge camp a lot, most often as I rest in my cushy apartment and when I complain about having to wash my clothes or cook dinner. The people there would be desperate for a chance for either. \n\nI ask anyone reads this long spiel, try to find comfort in the small things I hope you have in your life; floors, doors that lock, consistent food/healthcare, electricity, and clean water. This took quite awhile to write in a way that protected everyone's privacy, despite the low chance it could be read, which is why I have left the region and gender of involved people removed.",
   "created_utc": 1698894465,
   "score": 41,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7ct5mw",
   "message": "Tbh I don't fancy knowing the level of insanity people are willing to publish on the internet, so I haven't searched for it. But probably the worst act of human cruelty I've personally experienced was how a family 'friend' managed to completely tear apart the self worth of me and my siblings over more than a decade since we were less than like 5 years old. All three of us still suffer from depression, various forms of self harm, and multiple other disorders including anxiety, ptsd etc or have attempted suicide. Breaks my heart reading old journals and what we had to suffer through. Nothing heals fast and the world is not a kind place. My heart goes out to anyone who experienced this and worse. Sometimes I wonder if I can ever forgive him for what he did to my mother.",
   "created_utc": 1698841094,
   "score": 205,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7eymza",
   "message": "A so called friend sexually abusing me, and threatening me to tell my parents I started it, I was 7-8 at the time, he was 10-12. Went on like nothing ever happened. I lived with that shame for more than 40 yrs.",
   "created_utc": 1698871120,
   "score": 166,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f02nm",
   "message": "A friend of mine in high school's mom went missing. They found her body stuffed into the trunk of her own car in a BART parking lot a few weeks later. She had been raped multiple times. He was a really quiet kid already, and she was a single mom. I have no idea what happened to him after that. He left school, obviously.",
   "created_utc": 1698871631,
   "score": 39,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7fb66w",
   "message": "I work in a animal shelter near a military base. Lots of \"animal recycling\" but after all these years this one was the worst to me. \n\nDomestic violence situation turned into order of protection. I'm not sure the specific details of that but he was forced to live on base and pay for the apartment she lived in off of base. Well she decided one day to I guess leave the state and left her keys on the counter. She also left their dog locked in a kennel. The dog wasn't found for MONTHS and was only found due to a pipe that bursted. It was essentially bones and fur, mummified. I don't care how shitty your abusive relationship is, atleast give the dog a fighting chance and let it go. She \"assumed\" that everyone would know she left when she left the keys. Even though the person paying for the apartment isn't allowed to go near it? Intentionally starving something to death is the most cruel evil shit in the world.",
   "created_utc": 1698875686,
   "score": 120,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7exr7d",
   "message": "As an adopted child, my punishment would be not having dinner with the family. I’d eat by myself in the corner. I was treated so unfairly.",
   "created_utc": 1698870803,
   "score": 217,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7eelae",
   "message": "The gulf between what I've personally experienced and the worst I've known about can't be overstated. \n\nI feel like some of the basement prisoner stories are the worst in my mind.  The seemingly endless nature of the torture just feels so much worse than death.",
   "created_utc": 1698863847,
   "score": 67,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f1aev",
   "message": "Poverty and the indifference that tends to surround it.  It’s gut wrenching- especially to witness in person.",
   "created_utc": 1698872060,
   "score": 28,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f3f09",
   "message": "When I read the court transcript on the case against Ian Watkins from the Lostprophets. I felt physically sick after reading it. Horrific.\n\nPersonally, going through narcissistic abuse really is up there for me.",
   "created_utc": 1698872825,
   "score": 35,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7dly51",
   "message": "My mother would repeatedly call\nMe a chinless wonder when I was a teenager. She was not a loving person. I’m 50 and I am doing just great. I rose above it. Taught me great lessons on what not to do when raising kids and made me a great father.",
   "created_utc": 1698853378,
   "score": 85,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7f2m4y",
   "message": "Anything that had to do with my mom during my childhood.\n\nWhen I was about 18 months old, my mom abandoned my baby sister and I at home so she could go on a date. She was a teen mother, and was about 18 at the time. My baby sister was 6 months old. I got locked in a food pantry and in the total darkness I freaked out because I could hear my sister screaming and I couldn't get to her to try and help her or anything. I eventually completely dissociated. I still have PTSD from the event, although I did get over the claustrophobia. Eventually my grandma figured out that my mom wasn't home and somebody was hearing kids crying, so she came over and rescued us, and my mom had custody taken by the state. My grandma raised us.\n\nWhen I was 12, my mother was living in another state and called home talking about how she had gotten her act together and was living right and had gotten married and wanted to be reunited with her kids, so my grandma let my sister and I go on the bus to visit my mom and stay for the summer while my grandma went to visit some relatives elsewhere. My mom's husband looked me in the face and told me he would kill me, my mother, and my grandmother, if I did not comply and help my mom convince my grandma to get my mom's other two kids, a younger brother and sister, into that household. He had some kind of story in his mind where my sister and I had just been cruel and unloving to my mom our entire life and he was tired of seeing her suffer because of her ungrateful kids.\n\nI complied, scared that my grandmother would be murdered, and what followed was a year of physical and sexual abuse suffered by all of my brothers and sisters. I completely dissociated and it took me years afterwards to regain a full grasp on reality. My sister eventually managed to get a desperate phone call out, and my mom's husband, when he found out that the police were on the way, fled 2500 miles and was never apprehended.\n\nI'm in my early 30s now, and there are a lot of people who tell me I would be completely justified to never forgive my mother. But, she was groomed and molested and got hooked on drugs when she was 12 years old, and was a tragic victim of circumstances. I definitely hold her accountable for parts of my experience, but we've had our talks and our arguments and we have a reasonable relationship today based on an understanding of each other's perspective during those periods of time. She'll never be the person that I consider my mother, my grandma has that honor, and always will. But, yeah...\n\nSometimes life is just fucked up.",
   "created_utc": 1698872535,
   "score": 152,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7e3aws",
   "message": "For profit healthcare. The health of a human being shouldn’t be considered in the bottom line of a spreadsheet",
   "created_utc": 1698859754,
   "score": 240,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7e9cx2",
   "message": "Someone honked at me today",
   "created_utc": 1698861937,
   "score": 147,
   "submission_id": "17la91a"
  },
  {
   "comment_id": "k7d3pzu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17la91a"
  }
 ]
}