{
 "submission_id": "17lkm4o",
 "title": "What is nastier than people realize?",
 "selftext": "",
 "created_utc": 1698868294,
 "permalink": "/r/AskReddit/comments/17lkm4o/what_is_nastier_than_people_realize/",
 "score": 154,
 "url": "https://www.reddit.com/r/AskReddit/comments/17lkm4o/what_is_nastier_than_people_realize/",
 "comments": [
  {
   "comment_id": "k7gocce",
   "message": "RN here: Hospital floors! Seems obvious, but apparently it isn’t. I can’t believe how many folks will allow their CHILDREN to sit or play on the floors, or just generally treat them like they are sterile. I don’t even wear my work shoes into my own house. The other day I spilled a few drops of tea on the floor where I work… gave it a very light wipe with a cloth and the cloth was BLACK. I think people assume that since it’s a hospital the floors are in mint condition… absolutely no way, lol.",
   "created_utc": 1698896248,
   "score": 161,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7etdpz",
   "message": "Ice machines in restaurants.",
   "created_utc": 1698869228,
   "score": 146,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fg2dk",
   "message": "I read an article of a study of bowling alleys. Researchers found, “HIGHER THAN EXPECTED” amounts of fecal matter in the finger holes of the common balls.\n\n\nSo there was an expectation- and that got blown out of the water.",
   "created_utc": 1698877600,
   "score": 255,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fwavs",
   "message": "Dementia, especially advanced dementia. It's not just quirky memory problems, your brain controls every bodily function.",
   "created_utc": 1698884251,
   "score": 68,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7f2yt5",
   "message": "Crohn's disease and ulcerative colitis.\n\nThanks to drug company ads, most people think it's just about going to the bathroom a few times a day. There's never any mention of fissures, fistulas, fevers, extreme pain, extreme fatigue, depression, anemia, drug side effects, joint pain, painful and horrific surgeries, mouth sores, skin disorders, etc.",
   "created_utc": 1698872661,
   "score": 125,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fql5z",
   "message": "Being a caregiver. Again, people know it might be nasty, but I think they still overlook the awful experience it is for people who are caring for an eldery. \n\nMy mom took care of my bedridden grandmother for 3 years. The amount of shit everywhere (she had chronic diarroeah, and i don't know if it's just me but old people's shit smells like something of other realm), awful BO (even when we were cleaning her constantly), the difficulty of changing diapers/sheets/covers as constantly as she needed (at least 2 times during the night).  \n\nSo what I meant is that sometimes people think is \"nice\" from certain daughter/son to take care of their old parents (at least in my country where putting your parents in facilities is not common). But it's just such an intense, nerv-wrecking, hard and disgusting job, with no breaks, with little rewards (because at least my grandma was not in her right mind) and almost no social recognition that it blows my mind how underapreciatted it is.",
   "created_utc": 1698881934,
   "score": 238,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fvqb8",
   "message": "Filthy hobbitses.",
   "created_utc": 1698884019,
   "score": 35,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7feh5x",
   "message": "Cancer.  People know it’s nasty.  People know it’s nasty as all hell.  But here’s the thing.  Going through it myself, I could have never imagined how nasty it truly is.  \n\nI watched my mom fight stage 4 ovarian cancer 18 years ago (I’m 40 right now for reference).  She was so far along, and so riddled with the cancer that she was given weeks to live, and sent away from three oncologists who told her to check into hospice and prepare for the end.  Thankfully she found an oncologist (who is mine now) who took her in, and went to war with her.  They cut her open from the chest down, and spent hours plucking tumors out of her while rearranging her internal organs.  Taking out the bad stuff and building what he could with what was left.  Then two long rounds of chemo.  Hospital visits.  Illness left and right.  Side effects.  Recovery.  It was hell for her, but she beat the odds and lived.\n\nWatching this, I understood what I could. I saw the pain, but now, going through it myself, couldn’t possibly comprehend how bad it truly was.  I saw the illness, the nausea, the neuropathy, all the stupid side effects that hit you for no reason at all.\n\n\nSo yea, cancer.  Every knows it’s nasty, but man is it even worse than that!",
   "created_utc": 1698876959,
   "score": 27,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fiuim",
   "message": "When the badass riff comes back but slower.",
   "created_utc": 1698878774,
   "score": 46,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7etoob",
   "message": "The kitchen sink and the area immediately surrounding it.",
   "created_utc": 1698869337,
   "score": 58,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fqlox",
   "message": "The lines that connect fountain drinks and kegs to the taps. Had a buddy whose job was to clean them and he said he will never order a fountain drink from any restaurant, even the few that keep up on the routine maintenance.",
   "created_utc": 1698881940,
   "score": 176,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fi2eh",
   "message": "Hotel TV remote controls",
   "created_utc": 1698878453,
   "score": 134,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fcxsf",
   "message": "Luggage.  It gets rolled throughout the world, often in gross airport bathrooms where floors are literally wet with pee, and then when people get to their destination, their first thing they do is toss it on the bed to unpack.  Come to think of it, this also makes hotel comforters that never get washed even more disgusting.",
   "created_utc": 1698876365,
   "score": 35,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fkigu",
   "message": "soda fountains at *any* restaurant - fast food or otherwise\n\nsource: travelled around the US repairing and replacing them. will only *ever* get bottled water",
   "created_utc": 1698879455,
   "score": 67,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7etcy3",
   "message": "Keyboards and phones.",
   "created_utc": 1698869220,
   "score": 230,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7f8uhb",
   "message": "Your keyboard.\n\nseriously man, wash that thing. I can see the dirt from your window!",
   "created_utc": 1698874820,
   "score": 242,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fnmgb",
   "message": "OCD. It's not some goofy personality quirk. It's hell on earth.",
   "created_utc": 1698880724,
   "score": 73,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7f14or",
   "message": "[deleted]",
   "created_utc": 1698872004,
   "score": 169,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fb30a",
   "message": "Your belt. Think about it, it´s basically the only piece of clothing you never wash. And you always have to touch it after you pooped and before you wash your hands.",
   "created_utc": 1698875653,
   "score": 75,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7etp1u",
   "message": "People",
   "created_utc": 1698869341,
   "score": 137,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fldc6",
   "message": "Touching money",
   "created_utc": 1698879810,
   "score": 187,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7ex3a4",
   "message": "Shoes. They are filled with sweaty feet and go everywhere. Think about the gas station and airport bathrooms. The bathrooms you can feel the ick in.",
   "created_utc": 1698870563,
   "score": 209,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7gem5d",
   "message": "Old people.\nHear me out, I work in fire/EMS. I’ve seen my fair share of grossness and gore and I love it, wouldn’t trade it for the world. sometimes though, older people can get lonely, start to hoard, eat nothing but McDonald’s and leftovers, and when they get a pet (dog, cat, bird, or what have you) they struggle to take care of it. They also often have bladder issues and skin flakes start to make it look like it snowed in the house. It did not. That is just their skin. Not saying this is their fault, but please check up on your older family members, go clean gam gam’s house for her, visit pap pap and realize he’s been stuck in bed for 5 days sitting in his own piss and shit and bed sores. Gets gross, take care of your people ✌️ -f19",
   "created_utc": 1698891754,
   "score": 225,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fa593",
   "message": "Fingernails",
   "created_utc": 1698875300,
   "score": 200,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fw68e",
   "message": "Goodwill. I don't just mean the merchandise but also their interests. I work in one currently. I have been there for a year. I am disabled and I have a hard time finding and keeping jobs. Goodwill has a \"reputation\" of hiring the disabled so with my job coach, I eventually got hired, and I was excited to get started. The whole thing didn't start well. My quick 2 minute training was barely enough to explain what I needed to do. I don't remember things well, and I had a hard time understanding the system. I would have to ask my coworkers constantly. Most of them don't know anything about my position. A few months later, we had two other disabled workers who received less training than I did. At least one of them is nonverbal. The other was instructed to watch me for 10 minutes to understand the job but didn't tell ME. So I worked while someone just quietly whispered to themselves and stared at me. The scheduling was bad. I would be scheduled at the same time as the other two who shared my position. Sometimes, I would lose hours.\n\nGoodwill is not just bad at training, but they lack safety. Sometimes, people donate chemicals in all sorts of conditions, open or not, but you could still find them on the floor for sale. Most of the clothes had been on the floor, stepped on, and tossed would still be hung up and sold. The floors in the production area are covered with at least an inch of debris/dust/dirt. I found a dead rat once in my donation bin and placed some items from that bin into my sales cart. I asked if I should just toss those items, and I have been told no. They go out anyway. I have found bed bugs, and I got the same answer, but they did toss the rest of the items that weren't priced. I find a lot of small insects in donations, both living and dead. Goodwill tells me not to worry about it because they have exterminators that come in every so often. We had an accident with a man who was in between donation bins and the forklift. The forklift squeezed the worker enough to make him scream. I'm not sure why the driver didn't pay attention before choosing to pick up any of the bins. If you read around the internet, you'll find Goodwill has had MANY accidents with their forklifts.\n\nGoodwill managers don't care about their customers.   They ignore customers by walking away from the sales floor to hide in the back or front offices. I have brought up problems to them in the past only to get a shrug or to leave it alone. I have been trying to leave, but even with my job coach, it's hard to find other employment.",
   "created_utc": 1698884199,
   "score": 229,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fl7a7",
   "message": "Your dish sponge",
   "created_utc": 1698879740,
   "score": 56,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7esna5",
   "message": "A doctor's necktie.  If your doctor wears a necktie, it's been in the presence of every sick patient he's been in, and it never gets washed.",
   "created_utc": 1698868963,
   "score": 222,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7f1y27",
   "message": "Drinking 1L of soda everyday. It will give you a hard time when you are older.",
   "created_utc": 1698872293,
   "score": 230,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7f8f24",
   "message": "Your watch strap: mine is white and the notches for the buckle go all the way around and every week I have to clean out all the lint and build up to stop it going funky. Makes me shudder at the idea of other watch straps where it may not be as obvious.",
   "created_utc": 1698874664,
   "score": 193,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fazuh",
   "message": "Restaurant menus. Most people don’t think about how many people touch them and how often they are cleaned.",
   "created_utc": 1698875620,
   "score": 222,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7f429j",
   "message": "Light switch covers",
   "created_utc": 1698873056,
   "score": 117,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fbww0",
   "message": "People’s own fingers that they lick and chew on all day",
   "created_utc": 1698875969,
   "score": 43,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7f1bpc",
   "message": "Things you buy from a lot of these grocery stores and drug stores.  As someone who's seen the dust bunnies, spent time in the stock rooms, and smelled the ammonia, trust me.",
   "created_utc": 1698872072,
   "score": 33,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fcjln",
   "message": "Your cell phone, wallet, and keys you handle everyday but never clean.",
   "created_utc": 1698876211,
   "score": 74,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fxtzd",
   "message": "Kids \n\nYes, I’m a mom\n\nMy cat doesn’t make nearly as much of a mess",
   "created_utc": 1698884862,
   "score": 152,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7eqx4j",
   "message": "You bathroom. Everything is covered in poop",
   "created_utc": 1698868343,
   "score": 56,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fxdgi",
   "message": "Speaking as a teacher of 4-5 year olds: \n\nKids with colds who do not know how to blow their noses or cover their coughs and sneezes. Sometimes they just leave the snot on their faces, or wipe it on their clothes. They can produce a mind-boggling amount of snot!\n\nThe awful gross things kids will willingly put in their mouths, and then share with others!\n\nI love them regardless!",
   "created_utc": 1698884682,
   "score": 90,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fp5e4",
   "message": "Walking with your outside shoes in the house. Don't know why people think this is some weird Asian tradition, or why it should even matter: a good idea, is a good idea. I'm not Asian, have no Asian relatives, but I leave my outdoor shoes by the door and walk either barefoot or in slippers in my home, this way I'm not tracking all the bird/dog/human/whatever shit and sundry parasites onto my carpet.",
   "created_utc": 1698881348,
   "score": 139,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7gcr8x",
   "message": "The top of a soda can. People buy them from a store and put it right onto their mouth without hesitation.",
   "created_utc": 1698890958,
   "score": 34,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fli3p",
   "message": "Long covid. \n\nI was 24 and in peak shape with my whole life ahead of me. Then I got covid and for whatever reason my body didn't take well to it. \n\nTwo years later I'm still struggling daily with memory loss, confusion, derealisation, depersonalisation, elevated heart rate, heart palpitations, gastrointestinal issues and fatigue. \n\nI'm part of my countries national long covid recovery program but all they can tell me is to rest and wait and hopefully I will get better some day.",
   "created_utc": 1698879864,
   "score": 173,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fln0b",
   "message": "Long ass finger nails.",
   "created_utc": 1698879920,
   "score": 140,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7eri0r",
   "message": "House flies. Flies vomit on food sources to break it down, then suck it up. So basically when a fly lands on your food and you ate it, you're also eating fly vomit. Vomit that likely has poo and rotting garbage in its contents.",
   "created_utc": 1698868551,
   "score": 95,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fvjoq",
   "message": "Blowing out birthday candles… Who started that disaster?",
   "created_utc": 1698883943,
   "score": 47,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fu2vx",
   "message": "C. Difficile, which is basically the bacteria in your guts turning against you and producing extreme diarea. Whenever you eat or drink anything you're rushing straight to the toilet. It goes on for days and eventually you stop eating or drinking or sleeping because you know what's coming. I eventually went to the doctor. She said she'd normally advise to wait a few days, but I should give them a sample. I went home, had a glass of water and returned a messy sample 20 minutes later. A few days later I got a phone call from someone at the dept of health, wanting to know where I'd been and where I'd eaten. Never did get to the bottom of it, but on a side note the wife was telling me I just had man flu. I remember thinking that this \"flu\" could be killing older people, and later found out it does.",
   "created_utc": 1698883349,
   "score": 63,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fq76s",
   "message": "Not washing their hands correctly.\n\nFurthermore not washing before and after sex.",
   "created_utc": 1698881777,
   "score": 19,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7getdj",
   "message": "Getting it infected. Any wound. Anywhere. \nA staph infection almost killed me.",
   "created_utc": 1698891841,
   "score": 19,
   "submission_id": "17lkm4o"
  },
  {
   "comment_id": "k7fxyrk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17lkm4o"
  }
 ]
}