{
 "submission_id": "17ls2uf",
 "title": "Men that opened up to the girlfriend/wife when they asked you to open up and be more vulnerable, how did it work out for you?",
 "selftext": "",
 "created_utc": 1698888405,
 "permalink": "/r/AskReddit/comments/17ls2uf/men_that_opened_up_to_the_girlfriendwife_when/",
 "score": 247,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ls2uf/men_that_opened_up_to_the_girlfriendwife_when/",
 "comments": [
  {
   "comment_id": "k7gw5o8",
   "message": "Pretty sure I've bragged to half of Reddit about my wife, but when I realized I could tell that woman anything, I started to tell her *everything*. She's never once used something I said to try and hurt me, but she does point out when I'm being inconsistent or not doing what's best for myself.\n\nShe doesn't really think in terms of stoic or vulnerable though. I don't think she has an ideal version of how I should be other than *with her*, and I think you should be a bit wary of anyone who does. I've been with women in the past who would use my insecurities against me, but that never meant I would stop opening up.",
   "created_utc": 1698900687,
   "score": 215,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gi1j0",
   "message": "I've never been asked actually, I tend to just tell my partner what's going on with me.\n\nWith some women it goes fine, some women can handle a man having emotions. Some women actually appreciate it and yearn for deep emotional connection. Some can't and get very uncomfortable, or worse lash out. I've heard and read the stories of some real machiavellian chicks that catalog that shit away to use as ammo in future arguments, but have never experienced it. I think probably because that behavior clusters with other behavior that would lead to things ending sooner than later, if they even started at all.\n\nWhen you're an emotional guy, having a woman who is herself emotionally available becomes very important, which has a nice side effect of filtering certain women out of my life.",
   "created_utc": 1698893270,
   "score": 81,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h7h8y",
   "message": "I’m envious of the guys whose wives don’t make them feel like shit for this. I try not to say any of this because mine just makes me feel bad for feeling the way I do.",
   "created_utc": 1698909189,
   "score": 131,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gln8l",
   "message": "I've had it go horribly in the past. Manipulation and weak personal attacks when in arguments. \n\nThough now my current girlfriend it went very well. Yes we've had arguments but she's never gone there. We respect each other.",
   "created_utc": 1698894900,
   "score": 74,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gx8gf",
   "message": "Got into a very heated fight with my dad. Told me I was what was wrong in the world, the embodiment of everything he rejected, and was the one responsible for destroying this family. I told him that this would be the last time we'd speak to one another. I called my girlfriend afterward. When I calmed down and my anger subsided, I broke out into an ugly cry. She was very understanding and consoled me. She reminded me that I still have people who love me, and wants what's best for me. I love this woman.",
   "created_utc": 1698901375,
   "score": 230,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gnqdn",
   "message": "The few times it has happened always ended with me getting lectured or having to apologize because venting my feelings hurt their feelings.",
   "created_utc": 1698895931,
   "score": 93,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h2fs2",
   "message": "God, this comment section is really depressing.",
   "created_utc": 1698905082,
   "score": 136,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gjev4",
   "message": "Forgive the copy-paste from my own comment history. (This question gets asked a lot and I always answer it.)\n\n———————-\n\nFebruary 15, 2021, the day after Valentine's Day. I laid out how I was feeling. I had just lost my mom 3 months prior, my teaching career was leaving every last drop of fuckitude I had in my soul, my wife was gone almost every day from early morning until after I had put the kids down and had gone to bed myself (work and then play with her karate buddies), and my dad had moved 6 hours away to live with my sister. It was the lowest point in my life and I cried.\n\nTwelve days later, she said she wanted a divorce after 14 years of marriage and 16 years together. She said my being emotional and crying had shaken her to her core and that she couldn't get it out of her head. She couldn't see me as the strong person she had known me to be and that she couldn't think of me as her rock anymore, keeping her grounded and safe. (She always said, her head was in the clouds and I was the rock that kept her from floating away.) She didn't have any animosity toward me, but she didn't have any faith left in me either. She moved out shortly after. We're still amicable and share custody of the kids.\n\nI did nothing wrong and still lost the three pillars of my life in the span of three months. The house is gone now, I had to sell it because I couldn't buy her out (community property laws y'all, even if she never put a cent into it). She lost her job in November of 2021 and because we were still married on paper. I spent my savings and went into debt supporting her. The judge says once she working full time and financially stable, he'll consider our finances divided sufficiently to finalize the divorce.",
   "created_utc": 1698893871,
   "score": 205,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gixm9",
   "message": "Used it against me as soon as she could during an argument.  Divorced now. Living without her has been the happiest time of my life.",
   "created_utc": 1698893657,
   "score": 187,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7ghqu6",
   "message": "It worked out well. It's actually nice to be able to talk about things instead of bottling it up all the time",
   "created_utc": 1698893140,
   "score": 157,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gp084",
   "message": "It immediately back fired, like within 3 seconds,  and I have never done it since",
   "created_utc": 1698896593,
   "score": 247,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gl3te",
   "message": "All these comments are so depressing, I don’t even know what to think. Are women really that repulsed by vulnerable men?",
   "created_utc": 1698894642,
   "score": 241,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h7qgj",
   "message": "in my head i'm paranoid and insecure because of all those things i read on the internet.  my wife keeps reassuring me she actually likes my emotionally weak and vulnerable side (after having seen it) but in my head i keep overthinking it and fear she will lose love for me\n\n\n(its been 3 months since i fully opened up about literally everything, since then our relationship got actually deeper)",
   "created_utc": 1698909413,
   "score": 19,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h8cni",
   "message": "When I opened up, it felt more like an emotional gratification thing for her. Like, \"oh you're so cute when you open up!!\" rather than an \"I actually care and want to listen\".\n\nThe girl I'm with now just kind of gives me space and ignores it.",
   "created_utc": 1698909949,
   "score": 21,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7glutu",
   "message": "Her response: Get over it.  Man up.  Figure it out.\n\n\u0026amp;#x200B;\n\nNever again.",
   "created_utc": 1698895000,
   "score": 56,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gktj0",
   "message": "On 1 year and 3 months since the last time we had sex... so about that well",
   "created_utc": 1698894510,
   "score": 41,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gdyj2",
   "message": "It was like throwing a boomerang that you forget about until it suddenly hits you in the head sooner or later. Everytime.",
   "created_utc": 1698891474,
   "score": 116,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gqc3b",
   "message": "My wife became more understanding of what all I shoulder and worry about every day even if my face doesn't always show it.  She was able to be the reassuring voice I needed when things would get rather rough for me.  She always looked at me like the rock of our family (I being the youngest in my family before we met, I held that position too with my siblings and parents).  I mean, I always find a way through no matter what, but it was nice for her to understand the pressure I have on me at times that she was completely unaware of.  She's the yin to my yang, and I couldn't have asked for a better person to go through this thing called life with.  Sometimes we take for granted what the people we love go through in order to keep things smooth for everyone else.",
   "created_utc": 1698897304,
   "score": 58,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gfeij",
   "message": "Terribly, she used my insecurities against me during arguments and emotionally manipulated me to get what she wanted. I’m never opening up to a woman ever again lmao",
   "created_utc": 1698892103,
   "score": 246,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gfxff",
   "message": "Used against me in family court.  Don't.",
   "created_utc": 1698892335,
   "score": 116,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h0giq",
   "message": "To all the women coming on here to say \"Not all women are evil! Some of us really do want men to be vulnerable!\", or something similar, try to understand something.\n\nI could give a whole rant about how much hate men get for doing the same thing every time a woman chimes in to say \"all men are X, Y, Z\", I won't give you hate for it. What I will say is that it might not be *all* women... but it's more than enough to feel that way. I have my own stories, and it isn't just significant others either, friends that are girls and female family members are just as guilty of this behavior in my life. \n\nJust about every guy has at least one story of a girl hitting him below the belt because she got mad or upset at something. Most guys end up saying \"Never Again\" and close themselves off because it's the better option than just hoping it doesn't happen again. \n\nYou want to do something about it? You want to prove you can be trusted? Hold the women around you accountable for their shitty behavior. Fuck the sisterhood and do the right thing even though it isn't the easy thing to do. Maybe look at your own behavior and try to do better. It won't solve the problem but it's a good step to help make that happen.",
   "created_utc": 1698903589,
   "score": 128,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gp2a5",
   "message": "Terrible. Every time. That’s like when your brother says he won’t raise the basketball higher if you jump for it one more time. \nGod bless.",
   "created_utc": 1698896623,
   "score": 65,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hcrif",
   "message": "Left me later down the line stating that she feels like she has to protect me like a mother and not me protecting her - as if revealing my vulnerabilities subconsciously made her see me as too weak to rely on.",
   "created_utc": 1698913797,
   "score": 15,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7guipc",
   "message": "Got dumped",
   "created_utc": 1698899669,
   "score": 31,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7he4gu",
   "message": "I told her things she tried to use years later to justify an affair. Literally things I had not thought about in years. She even made a few things up just for good measure.\n\nI know it’s not all women. My current partner is great, but this is a minefield for men.",
   "created_utc": 1698914993,
   "score": 32,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hcnyl",
   "message": "Most recent one went poorly.   \nHad been quiet, depressed, etc. dealing with a death in the family, but trying to maintain contact with long-distance partner. They raised the issue, so I shared the issue, they responded more in a critical and defensive manner. Communication's at an all-time low, and I have no expectations of an actual relationship continuing.  \n\n\nIn a previous relationship, opening up about childhood abuse got used against me and turned into insults, so that was fun.  \n\n\nAt least \\*a\\* partner of mine has continued to be loving and supportive and communicative when I opened up and was more vulnerable, so it can and does happen, but hoo boy that track record does tend to raise the anxiety about communicating fully.",
   "created_utc": 1698913709,
   "score": 12,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hgqce",
   "message": "Showing vulnerability, not only to women, but generaly, to people - always have consequences. \n\nYou need to ask yourself a question - why would you show it to anyone and what good do you expect from it? \n\nBecause the absolute best result you can get from showing vulnerability is someone being decent and not using it against you or not judging you. \n\nIf so, why even do it? It is a \"high risk - no reward\" game.",
   "created_utc": 1698917200,
   "score": 13,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7giayq",
   "message": "2 times I have done this first with my wife and it was used against me for 20 years then second with my girlfriend uses this to passive aggressively punish me without having to be in an argument",
   "created_utc": 1698893382,
   "score": 58,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hb13q",
   "message": "I'm very lucky with my wife, I can get as emotional or vulnerable as I need to and she's there for me.\n\nOn the other hand, one of my friend was in a long term relationships (7 years if I remember) with a self-identifying feminist who adored to repeat \"men should show more emotions, allow themselves to be vulnerable, etc...\"\n\nShe left her boyfriend the day he showed vulnerability for the first time, saying she wasn't seeing him as a man anymore.\n\nGranted, he was a little bitch. I mean, he lost his uncle, got in a motorcycle accident which broke both his legs, and discovered the enterprise he worked for got bought out, and everyone (including him) lost his job, all in the span of one week. Nothing to complain about really.",
   "created_utc": 1698912277,
   "score": 23,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hgd0t",
   "message": "I’ve tried to be honest about how I was feeling with my wife a couple of times \n\nIt somehow turned into me apologizing and trying to make her feel better \n\nBe aware fellow men, a large percentage of women, simply cannot handle any sort of criticism, they’re perfect and it’s you that needs to change",
   "created_utc": 1698916898,
   "score": 24,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7g7vhy",
   "message": "Neither one was very happy about it..",
   "created_utc": 1698888915,
   "score": 63,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hfnbp",
   "message": "From my personal experience, 80-90% of the girls will lose interest in you the moment you show any kind of weakness. The other 10-20% will be wonderful and supportive.\n\nAlso keep in mind, that a chunk of the 80-90% will pretend to be supportive, because they don't want to feel like bad people, but will lose all interest in you and the relationship will crash either way.\n\nThe real ratio might be different of course, maybe I just got unlucky, since this is just my personal experience.",
   "created_utc": 1698916290,
   "score": 11,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gth2s",
   "message": "It's worked before.\n\nIt's also failed spectacularly, and been used to try destroy me.\n\nThat is the dilemma, I suppose.",
   "created_utc": 1698899049,
   "score": 22,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h52sw",
   "message": "I’m not a man but I have had a friend tell me his answer to this exact question a few months ago when it came up in our own conversation. His first long-term girlfriend was somebody he didn’t feel safe openly sharing his feelings with, and he’s never made that mistake again. He now starts talking about his own feelings with people he likes before they actually get together, and if they have negative reactions he just rules them out as potential dates.",
   "created_utc": 1698907181,
   "score": 21,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hld26",
   "message": "Used it against me every time she felt vulnerable/insignificant or was angry.   Which led to me not communicating.  Which is currently leading to a divorce.",
   "created_utc": 1698920761,
   "score": 9,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gs0qg",
   "message": "My GF and I are completely open and honest with each other. I let her know when I’m going through something, and she does the same. Our relationship kicks ass.",
   "created_utc": 1698898224,
   "score": 30,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hc4c5",
   "message": "This thread is so depressing. :( makes me never wanna try dating",
   "created_utc": 1698913230,
   "score": 16,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hj04a",
   "message": "She used everything i told her against me whenever we had a fight, never gonna repeat that mistake",
   "created_utc": 1698919019,
   "score": 9,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gmswz",
   "message": "ok, whatever, all the negativity in here needs some counterpoint. i was not asked, but:\n\nshit happened, did become more vulnerable than ever thought possible. she became the rock and went through everything to help me. still happy, years after leaving that dark period behind.\n\nwent back to me being the rock by default, but her being way stronger emotionally than before.",
   "created_utc": 1698895464,
   "score": 68,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7goot3",
   "message": "Had a GF who mistakenly took it for a sign of weakness. I wreck her life when she try to use it against me.",
   "created_utc": 1698896428,
   "score": 47,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hjzhm",
   "message": "Women ask for it then use it against you every dam time never do this.",
   "created_utc": 1698919754,
   "score": 21,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gvjs1",
   "message": "She throws it all back in my face any chance she gets. I hate her for manipulating my insecurities and more.",
   "created_utc": 1698900308,
   "score": 31,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h8nrq",
   "message": "It never has once worked out. I'm not batshit insane or anything either but the second you start voicing your fears and concerns and insecurities, you will not ever be seen the same way again.\n\nYour partners will tell you otherwise, it is never true. They had a version of you they met that they thought was bullet proof, and when they find out you are not things tend to go south fast. Be honest, but keep things to yourself often.\n\nThere will be people that respond to this that disagree. They want to believe what they are saying is true. It's not.",
   "created_utc": 1698910219,
   "score": 12,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gwde4",
   "message": "Told my Ex-fiancé early on in our relationship how I was emotionally and physically abused by my dad when I was a kid and I still had emotional breakdowns around a certain time of year. One year, it got really bad around Christmas because that’s when the worst abusing happened to me, and when I had a breakdown, my ex-fiancé said “maybe if you weren’t such a pussy, your dad wouldn’t of beaten you”. Needless to say, she’s an ex for a reason. Oh, and apparently we were in a Poly relationship but I didn’t realize it at the time",
   "created_utc": 1698900822,
   "score": 38,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hic1a",
   "message": "She dumped me.  She had this belief that men who admitted to being bullied were weak.",
   "created_utc": 1698918509,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hmh4h",
   "message": "It eventually ended the respect she had for me. I won’t be doing that again.",
   "created_utc": 1698921533,
   "score": 6,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hmyb4",
   "message": "I think I saw a comment here on reddit (forgot what the context was though) criticizing how some men use their girlfriends as an emotional outlet and it’s exhausting for them. I have mixed feelings about that personally. Cos on one hand, I think you’re supposed to be an emotional support for your partner. But on the other, if you’re the *only* support, yeah I can see why it can get exhausting",
   "created_utc": 1698921852,
   "score": 6,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hmzhv",
   "message": "Most of the time they lose their attraction to you. It's only a very small percentage of very special women who don't",
   "created_utc": 1698921875,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hq9ga",
   "message": "Her attraction to me plumetted...",
   "created_utc": 1698923977,
   "score": 6,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gygbo",
   "message": "I can only speak in my own experience - on the few occasions I opened up with my Girlfriends and showed vulnerability the relationships usually took a turn for the worse and the sex certainly dried up. If I have to really open up about something that's when I call my Mother - that's my personal safe space to open up and show any vulnerability.",
   "created_utc": 1698902171,
   "score": 17,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h1udf",
   "message": "Opened up to my now ex and she told me to just suck it up and man up. From then on I decided to never really open up my feelings to her even though she asked. It wasn’t until a lot of communication on how I felt and me telling her how she reacted is why I shut down whenever we had deep conversations about our feelings. Eventually she learned to listen and was supportive but like most women I meet, they still have a toxic way of thinking that masculinity means showing no emotion. \n\nI’ve learned that it’s usually women that show empathy rather than just talk about it are the ones that are supportive.",
   "created_utc": 1698904627,
   "score": 18,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h758o",
   "message": "It varies from woman to woman. My first ex was pretty OK with it. We seem to open up we were there for each other and got to know each other on a deeper level. The second one that didn’t really help. The third one she used it as ammunition of times later on. She got mad at me for not opening up but when I did open up, it was used against me as to why wasn’t a perfect partner for her (not a loss). \n\nVulnerability is a strength you should be honest and own some of the deeper shit that you facing your life and how it’s made you as a person today. If you find your girlfriend is using the shit that you’re saying against you, she’s not the right person for you, and she’ll likely never be for anyone else. It takes an apathetic piece of shit to use anybody’s past against them.",
   "created_utc": 1698908904,
   "score": 17,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gkp36",
   "message": "I'm a woman and I enjoy when my husband opens up about struggles and work. I enjoy helping him unload, have someone to rely on. I've never thought of using it against him. I am very happy and we have a great marriage 13 years strong.",
   "created_utc": 1698894454,
   "score": 55,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hkywx",
   "message": "I asked this question not long ago and people told me that I would be dumped, and cheated on and bla bla bla.\n\nWell, we are closer than ever, we love each other to death and I feel like I can trust her and that she has my back.\n\nSo overall, amazing.\nWe are closer , happier and more supportive.",
   "created_utc": 1698920486,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hbg36",
   "message": "She left me 4 weeks later, lol. Although she didn't ask  me to open up, i was just sad my father died from a heart attack.",
   "created_utc": 1698912631,
   "score": 10,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hckhx",
   "message": "Open up about what? No one cares, I’m a guy",
   "created_utc": 1698913623,
   "score": 9,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h4lvv",
   "message": "Everyting you say, can and will be used against you",
   "created_utc": 1698906802,
   "score": 17,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hcne0",
   "message": "You can't. You just can't. It would be a disaster. Despite all the feminist stuff, almost all women still want a strong man. You can show emotion but don't show vulnerability.",
   "created_utc": 1698913695,
   "score": 11,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hfwux",
   "message": "I'm a woman. I have never done it to anyone who has opened up, been vulnerable. Doesn't matter if it was a partner, friend or a family member. Because they saw me as their safe place at that time and thought I was worthy for them to open up. So I'm taking those things to my grave even if I hate you now.\n\nBut I will agree with most of those comments, unfortunately. I've witnessed enough of that women use those against men when things don't go as they want. Like a lot of times with different women. For example; My bf's (now ex) ex sent me a message where she dumped some stuff on me about my bf, told me to break up with him. I didn't reply. She did this because my bf wasn't answering her calls and replying her messages after he told her to stop harassing him, he has a gf now 🤦‍♀️ He looked at my face, and I'll never forget that looks, and said that he is sorry he didn't tell me those things because he wasn't ready talk about them yet. I said that I didn't show him the message to confront him, I showed it because I was worried about his safety, I want him to be careful and he can talk to me about those whenever he feels ready and he doesn't even need to talk if he never wants to. And I was right about worrying for his safety, she did so many terrible things later.\n\nI'm sorry that most of y'all experienced something like that. I'm sorry now most of you feel like \"never again\". I'm sorry it's hard to find a woman who you can trust with your secrets, with opening up, with being vulnerable.",
   "created_utc": 1698916518,
   "score": 9,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hjwce",
   "message": "Just my experience, not worth it... Women have a natural instinct to ask for something an then when they get it they find a way to twist it an turn it around on you.. My wife insists  she wants to be \"open\" about everything an anything. But when I try that, it always finds a way of causing more problems an gets used against me...She wants to be open, but doesn't actually want to accept any of my feeling or feedback an becomes angry an defensive, plays victim.. I am always the bad guy, and always the one who needs to \"fix\" something... Even when she asks me.. I can be open and have an opinion as long as it's what she wants... Example: For years she complained I wasn't assertive enough, she wanted me to have more confidence etc.. I've been to therapy for a year now an have worked through some of those things.to help improve my self confidence an have a voice.. last night she told me she doesn't like how I've changed an I've become a jerk, an not the soft nice guy she married...",
   "created_utc": 1698919690,
   "score": 8,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hevml",
   "message": "This kinda reminds me of a quote I read somewhere: A good relationship is 60/40 with each person trying to be the one giving 60%.",
   "created_utc": 1698915636,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hf96x",
   "message": "I dared to try and have a conversation about needs in therapy and I got ridiculed for it. Needless to say I froze, I didn't know what to do with someone who told me how much they wanted to be there for me and then ridiculed me.for reaching out.\n\nWhat's worse is she complained to me about her not getting enough space for her to be her in sessions.whats worse worse is that when things were clearly not going well in therapy she started trying tell me how much I didn't have to do it all alone. And offered if there was anything more she could do in therapy to let her know.\n\nAgain what do I do? Does she mean it this time? Does she not? Is this another set up for ridicule.\n\nThe kicker was how she accepted no responsibility for these no win situations, or anything in sessions because she \"felt\" like she wasn't responsible. She claimed the feedback I gave her left her feeling like an emotional punching bag and even though she had sent me emails telling me how she never felt in danger with me in session, there was \"something in my eyes going back to the start of therapy\".\n\nSo to sum up, manipulated  into being used for their needs, ridiculed for daring to try and advocate for myself. Attempted to be pulled back in with reassurances or promises. Then fucking DARVOd.\n\nI wouldn't recommend it.",
   "created_utc": 1698915960,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hkglu",
   "message": "We have become closer, it seems to me that we have even more mutual understanding.",
   "created_utc": 1698920111,
   "score": 4,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7ho4wr",
   "message": "Believe it or not, also jail.",
   "created_utc": 1698922623,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hov0s",
   "message": "I stepped out of my comfort zone like she requested and explained to her in every detail, my emotional self. 1 week later she slept with a coworker.",
   "created_utc": 1698923098,
   "score": 4,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hpc5u",
   "message": "September was a hard month for my wife and I emotionally. Her seeing me break down in tears seemed to make her realise how deeply our relationship issues had been affecting me this whole time, and our relationship has been stronger over the last 7 weeks than it has ever been.",
   "created_utc": 1698923397,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hr1az",
   "message": "She was horrified.  She thought my brain was filled with fight scenes and boobs.",
   "created_utc": 1698924443,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hrjta",
   "message": "Not wife but my last partner: anytime something happened to me and I got mad they somehow turned it into my problem with them and I had to end up apologizing.",
   "created_utc": 1698924754,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h29z8",
   "message": "It’s so much fun! /s \n\nYou should totally do it. In return, you will get your feelings invalidated, or diminished, you’ll get a college-level lecture about how wrong you are, and how upset she is by what you feel. That’s just the immediate response. Then, there’s the stash of info, in her head, where little estrogen elves are hard at work, weaponizing all the newly acquired data to be used against you in the next argument. So cool!",
   "created_utc": 1698904959,
   "score": 24,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gxndi",
   "message": "It becomes a painful lesson because your vulnerabilities will be used against you going forward at every turn, be it in an argument or generally.",
   "created_utc": 1698901645,
   "score": 15,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h24o8",
   "message": "It was thrown back in my face during the next argument.",
   "created_utc": 1698904846,
   "score": 16,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h6n1n",
   "message": "Tread carefully if they have moderate to severe unresolved emotional conflict from their past. It starts off as an opportunity for open dialogue but can very easily be turned into a one-upper game of “well, my issues are bigger than your issues” thing that leaves you wondering “why the heck did you even ask if you’re just looking to invalidate my answer” type situation. \n\nFor me that’s a very clear message to keep my thoughts and feeling to myself since I’ve been fooled into believing I’m in a safe place to share deep feeling without fear of reprisals. If people are asked to be vulnerable the other person has to be gentle with them in that moment. Don’t expect shields to be lowered if you attack often.",
   "created_utc": 1698908483,
   "score": 9,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gi45u",
   "message": "Like a lead balloon. Made that mistake one time. Never again.",
   "created_utc": 1698893302,
   "score": 19,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h7nlj",
   "message": "Not so good",
   "created_utc": 1698909342,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hqhzg",
   "message": "You need to be as emotional as Clint Eastwood in a spaghetti western.",
   "created_utc": 1698924120,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hrdct",
   "message": "It was used against me later on",
   "created_utc": 1698924645,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hrswn",
   "message": "I had an ex see my medical history once when she picked me up from a checkup. They saw that I had MDD (major depressive disorder) and broke down saying that they should be enough to make me happy. I never really was interested in explaining my feelings after that.",
   "created_utc": 1698924905,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hs70w",
   "message": "Yes. My Ex was a horrible person and weaponized it against me. Dumped her and left.",
   "created_utc": 1698925130,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h6lp5",
   "message": "As much as I’ve come to dislike someone, I never used what I know against them. This comes down to an individual level — whether male or female. Anyone who does is just a shitty person period.",
   "created_utc": 1698908451,
   "score": 7,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gtyap",
   "message": "I cried when I saw Man on Fire, my \"then-girlfriend\" unaware that I was growing emotionally told me her literal reaction was WTF?!. Men, if you're emotionally secure enough to cry, tell the woman because they m a y be laboring under gender roles and you may be painting yourself into a corner.",
   "created_utc": 1698899328,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gyfdh",
   "message": "Umm... Never been asked. Usually just answer questions when asked how I'm feeling.",
   "created_utc": 1698902154,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h3qiu",
   "message": "It's tricky. When I started dating my now wife, I opened up to her about some really tough legal and mental problems I had That made her open up to me too, and also got her more invested in me. So it worked okay. \n\n\u0026amp;#x200B;\n\nBut also, you need to know how to balance it, because you can also become too vulnerable that they will see weakness, and most women get turned off by that. You'll end up like Brendan Frazer in Bedazzled, crying into the sunset while so runs off with some Chad.",
   "created_utc": 1698906102,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h6vx0",
   "message": "Worked terribly.Everything i ever told her was public knowledge,because she got angry and emotional after our breakup.Not doing that ever again.And then some women complain why their man never opens up,well... that's why.I never sank to her level though and her secrets are safe with me.",
   "created_utc": 1698908691,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hb7b6",
   "message": "She wasn't very supportive, but she still expected me to be there for her when she had her own catastrophes, no matter how small they were.",
   "created_utc": 1698912426,
   "score": 4,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hlhtg",
   "message": "This will be hugely down voted. I suspect it will often be a turn off to women when their man is \"emotionally vulnerable\". Perhaps not once in a while, but if it's a persistence thing then I think it would often be a turn off.",
   "created_utc": 1698920855,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gbjid",
   "message": "Don’t do it!!!!! They may seem genuine at the time but once they get mad at you they’ll always think your a pussy cuz you were “soft” one time trying to talk about your feelings",
   "created_utc": 1698890443,
   "score": 28,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h0cmw",
   "message": "Nope, I've watched so many of my friends wives and girlfriends use it against them later, or lose respect for them for being sensitive,  or not \"strong enough\". I've also listened to a huge percentage of the women I've known talk negatively about guys they've met. \"Oh I'd date him but he's \"kind of a pussy\", \"to emotional\", \"I'm emotional so I couldn't be with someone is to\", etc\"\n\nIt's sad and unfortunate as fuck, but the vast majority of men have the same stories..",
   "created_utc": 1698903511,
   "score": 17,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gxplt",
   "message": "Well I signed divorce papers this week so ya that way.  I’m successful, stable, and ten times happier not being married.  I guess it worked out for the best but not how you’d expect!\n\nJust remember your partner isn’t your therapist don’t try to make them one.",
   "created_utc": 1698901686,
   "score": 11,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gn67h",
   "message": "Don’t do it.  They will use whatever you say against you in a future disagreement.",
   "created_utc": 1698895649,
   "score": 16,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h8c38",
   "message": "Things that I shared in confidence with her, she used them against me in arguments and would really get me in a bad place. Wasted 3 years thanks to her. I was completely broken when I ended things with her. Its difficult to trust people now, but I try.",
   "created_utc": 1698909934,
   "score": 4,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hapxy",
   "message": "My wife drew much closer to me.  It worked out wonderfully.",
   "created_utc": 1698912006,
   "score": 4,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7heq6d",
   "message": "Women say they want men to open up, but they really don't want a whiny crybaby man.",
   "created_utc": 1698915510,
   "score": 5,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h028f",
   "message": "I had a great relationship. Nice woman. Opened up…huge mistake I never saw coming. Just not worth it. Will never, ever do it again.",
   "created_utc": 1698903305,
   "score": 9,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h102e",
   "message": "Thats a trap, they use it against you",
   "created_utc": 1698903992,
   "score": 10,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7gvwrw",
   "message": "Do. Not.\n\nIt will be used against you in the future.",
   "created_utc": 1698900533,
   "score": 14,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h60v8",
   "message": "I reckon I probably could but I don’t think I ever will",
   "created_utc": 1698907962,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7h83nn",
   "message": "We broke up",
   "created_utc": 1698909734,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hfwt7",
   "message": "Poorly\n\nNow I keep my real opinions private",
   "created_utc": 1698916517,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hkden",
   "message": "We did mushrooms and cried together. It was beautiful",
   "created_utc": 1698920043,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hmzkz",
   "message": "My wife listens to me all the time when things are going bad for me",
   "created_utc": 1698921876,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hnc9g",
   "message": "I opened up to my wife and ended up eventually crying. Her exact words were \"I didn't know you were that weak\". Safe later tried to backpedal but the damage is done 🫠.  I talk to an AI app now.",
   "created_utc": 1698922112,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hr13e",
   "message": "excellent. my GF is just an excellent person throughout. I can be anything or anyone around her and she will accept and accommodate me.",
   "created_utc": 1698924440,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hr9cu",
   "message": "In my experience, every time I ever opened up about something after much pleading, she would lose just a little bit of respect for me each time.\n\nWorse than that, she got what she asked for but then had no fucking clue how to handle it and just made things a hundred times worse.\n\nNever ever open up to a woman about your problems as it will not change anything and she will hold it in a little corner of her brain so she can weaponize it a few months down the track when you have an argument over a cup being left out or some other issue.",
   "created_utc": 1698924576,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hrc2h",
   "message": "I’m not sure I understand. I’m a straightforward and honest person who has literally no secrets. All someone has to do is ask and I’ll tell them. As far as being vulnerable, what do you mean? Am I supposed to be feeling bad about something I did?",
   "created_utc": 1698924623,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hvrbv",
   "message": "LOL I wouldnt even think of doing that.\n\nYou take those feelings and press them deep inside yourself until they compress into cancer and kill you.\n\nStill better than opening up to a woman.",
   "created_utc": 1698927094,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hwtfn",
   "message": "With past girlfriends I'd usually get something along the lines of \"man up, don't think about that, that's not important\" \n\nWith the current girlfriend I get more of a \"I hope you're okay, talk to me about anything you want/need to, is there anything I can do to help?\"\n\nThe current one is definitely the keeper (and no, it didn't take this to make me realise, she's just a keeper in general)",
   "created_utc": 1698927640,
   "score": 2,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7i2q7l",
   "message": "Everytime I opened up one of two things happened. When it was a situation where I opened up about something my wife was doing that I wanted to address, it immediately resulted in her becoming upset and the whole conversation becoming about her feelings about my feelings, not about my feelings. When it was a situation where I opened up about something outside of our marraige that was impacting me, she would usually get defensive (even when it had nothing to do with her behavior) and often argue that she was actually dealing with the same problem, but worse than me. Then the conversation became about her feelings again.\n\nIn the end, everything becomes about her feelings and issues while I'm often left with my feelings unaddressed and usually in a worse position than when we started the conversation. As a result, I just don't talk about it anymore. There is no possible positive outcome of opening up. I try to be supportive when my wife opens up to me, but it's a one way street and I don't know if I will ever feel comfortable going the other way again.",
   "created_utc": 1698930481,
   "score": 1,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7i3les",
   "message": "Jeez reading these responses it’s no wonder why 3/4 of suicides are men.",
   "created_utc": 1698930867,
   "score": 1,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hiy3l",
   "message": "Think about the old men you know, people like your grandfather. Are they open and vulnerable, always revealing how they feel or sharing how they were hurt by an unkind comment? No. They are quiet and emotionally unavailable. We write this off as a generational thing, but there’s another reason that old, experienced men behave this way: it works. Many women say they want emotionally communicative boyfriends or husbands, but often it’s not true. Their model of the male role from their fathers and other men is solid, reliable, and emotionally stable. So that’s what they expect whether they realize it or not.",
   "created_utc": 1698918976,
   "score": 4,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hcxo2",
   "message": "90% of the time they're going to use it against you. Sorry if that's sexist, but that's how I view you. It's safer that way.",
   "created_utc": 1698913952,
   "score": 1,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hb8i1",
   "message": "75% of the time as a dude(idk how it is a woman), when you tell your significant other something you’re upset about, they see it as an invite to air out what they’re upset about too and your stresses get ignored.\n25% of the time it is listened to and discussed and helped. \nThis is with my fiancé and this is by far the best I have ever had it. She is the first of many women who legitimately listened instead of just waiting for me to shut up or use it against me in a moment of weakness later.",
   "created_utc": 1698912453,
   "score": 3,
   "submission_id": "17ls2uf"
  },
  {
   "comment_id": "k7hdmyq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ls2uf"
  }
 ]
}