{
 "submission_id": "17lxij1",
 "title": "People who just said \"Fuck it\" and did the thing, how did it turn out?",
 "selftext": "",
 "created_utc": 1698907349,
 "permalink": "/r/AskReddit/comments/17lxij1/people_who_just_said_fuck_it_and_did_the_thing/",
 "score": 147,
 "url": "https://www.reddit.com/r/AskReddit/comments/17lxij1/people_who_just_said_fuck_it_and_did_the_thing/",
 "comments": [
  {
   "comment_id": "k7h5q6m",
   "message": "I changed careers on nothing more than a suggestion from a friend.   \n\n\nIt worked out amazingly.",
   "created_utc": 1698907715,
   "score": 160,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hbi25",
   "message": "In my young age I walked out of my job as a programming analyst at a large multi billion company because I felt undervalued everyday of my job by my direct supervisor/manager. But I landed in another large multi billion dollar company as senior developer after 3 rounds of interview - with 40% raise within 2 weeks. I was called back by previous employer after around 3 months giving me a 100% raise because they realized that I was providing them everyday solutions in their technical operations that ended up not solvable by even external consultants who were paid 300-400$ per hour. I rejected the offer but showed the offer to current employer who happily matched the salary after seeing my work for 3 months and promoted me to lead developer. Stayed there for 8 years before switching. - this was in early 2000.\n\nTLDR - ended up earning double my pay in 3 months.",
   "created_utc": 1698912682,
   "score": 163,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7ha3pd",
   "message": "Mine will run a bit different from the rest of these happy love fests, but it absolutely ruined my life.\n\nI had worked at a company for almost 10 years. I never got promoted and had hit the salary cap for my position so i could not get a raise. I tried for promotions, but they made you take a personality test for higher level positions, and i \"wasn't the right fit\". They then had some budget cuts and couldn't justify my salary so i was let go.\n\nA friend of mine had been planning for years to open a business, but didn't have the capital or time to get it off the ground. He was very convincing and confident, so i invested everything into it. \n\nI thought that since we were both \"smart\" and knowledgeable about the product we could make it work without experience, but i was wrong. My friend was the product guy and i was \"the face\" as the business had a huge social aspect. Within 3 months i realized that my friend's product knowledge was just based on what he liked, and not any real research. It fell apart pretty quick.\n\nI tried to salvage it but the initial  product mistakes were too much. I tried to take control and right the ship but i got blamed for all the failure. I should've tried to collaborate but i was angry, and then i went to the only person that was on my side, my business partner's ex. It was wrong but i was losing everything and needed something. So i lost my condo, my life savings, and all of my friends. The business partner's ex then left me after the business collapsed because i was broke. It got worse from there, but this post is already too long. Let's just say that saying fuck it can ruin everything.",
   "created_utc": 1698911471,
   "score": 18,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hg3os",
   "message": "Seventeen years ago the wife and I lived in Japan, and had been there for almost 9 years. Our daughter started getting death threats in school when she moved to middle school; different kids than elementary, where the parents were really nice to us. Anyway, when we talked to her teacher about it, she pretty much said \"It's her fault for being loud and wearing earrings\" (my daughter is half Hungarian, and babies get earrings here; it's a cultural thing). We told her this and she said it attracts too much attention. Also, she told us to dye her hair black (it's brown) so she'd fit in better. We noped out, and moved to Hungary (at a time when Hungary was not even slightly in good financial shape, and about to be IMF-loaned). My parents thought we were crazy; my dad even told me I'd made a mistake.\n\nThings turned out very well. Daughter got stable again after some terrible thoughts because of what kids did to her in Japan. I found a decent job and after a LOT of weirdness ended up at a good workplace; wife runs our little company now, which is okay-ish (though current inflation, man...). We actually own our own home, which felt impossible in Japan.",
   "created_utc": 1698916678,
   "score": 17,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h6mpr",
   "message": "Two years ago, I walked out my job, broke my lease, shoved as much of my belongings into a badly malfunctioning car and drove across the Rocky Mountains to find the sea.\n\nI didn’t have a plan, I didn’t know if the car would survive (it broke down within weeks after the trip was done and I sold it for scrap). I honestly didn’t care if I had a place to live, or if I lived at all. I needed to see the ocean, to smell it, to dip my toes in the brine and feel *small* again. And if I had nowhere to go and no way to survive once I got there, I had every intention of weighing down my pockets with stones and just walking into the water to end it all.\n\nI was not in a good place, mentally or emotionally. You don’t walk out on your life like that if you have anything to live for.\n\nBut I connected with estranged family here, and they gave me shelter until I found work and a new home. I’m happy now, really truly steadily happy, fulfilled, proud of myself and what I’m doing, more so than I’ve ever felt in my entire life. The air is cleaner here, I wake up every morning and, rain or shine, I take a bike ride through rolling hills of emerald farm fields and deep whispering pine trees. I’m greeted in the mornings by wild robins, and I fall asleep at night to the music of rain dancing through the boughs of the trees and a chorus of singing frogs. I find myself standing outside, staring at the vast river of stars in the unpolluted and sacred darkness of the night sky, and I watch the beautiful pink and orange waves of the rising sun cresting over the mountains. I have found a Heaven on Earth, and I am thankful, every minute of every day, for this wild place I call home and the wonderful people who picked me up when I had fallen down.\n\nI don’t recommend anyone else do something as stupid and impulsive, or self-destructive as I did, but it wound up being the best decision I have ever made.",
   "created_utc": 1698908475,
   "score": 157,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hcd6o",
   "message": "Got a job offer on the other side of the world, figured I'd regret it forever if I didn't take it. Uprooted my family for a one in a million chance and it's worked out even better than we could have hoped. It's not perfect or easy by any means but it has been 100% worth it.",
   "created_utc": 1698913441,
   "score": 59,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h6vr2",
   "message": "Last year I ended a 6 1/2 year long relationship. I was the one who loved too much, who weren't loved for the person I am and who only searched the mistakes in myself.\n\nIn the last month of our relationship he said that he don't want to do this anymore and that he didn't had any romantic feelings anymore. I didn't want to belive this and I said that I will change that. After a few days of ignoring each other, some scenarios that my brain completely forgot just came back in my mind, and I realized that I was so unhappy because the way he treated me. We were really good friends, but in the past few years there happened some things that destroyed my trust in him , but I repressed all those feelings because I loved him.\n\nThe last weekend before I knew that I'll move out, I went to a club and he was also there and we just greeted eacht other like some friends and talked for a minute. When I came home I opened the door of the sleeping room and his matress was not there. He took the matress and put it in another room, because he was mad at me that I were at the same club as him. He said he will MAYBE go to this club and he thought that I wanted to stalk him. In this moment I thought \"fuck it - I don't want to fight for this relationship anymore\" and I said that I will move out by the end of the week. It was really hard, because we still cared for each other and we just wanted to be happy again, but alone. I was so ashamed when I told my parents that it didn't worked out, but I'm glad that they were on my side and that I could stay at their flat for almost a year.\n\nMaybe it don't sound that spectacular for you, but for me it was a REALLY big step and it was the best thing I ever did, because I wouldn't met my new boyfriend (angel on earth) :)\n\nNow I'm living alone and bought two cats and I really enjoy my first own flat :D",
   "created_utc": 1698908687,
   "score": 81,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hd72v",
   "message": "9 years ago I was in a dull job and a dead end relationship. Over the space of a weekend I ended the relationship, quit my job and bought a flight to a random country in Europe. ended up travelling and working in Europe for 7 years, only came back during covid.\n\n\u0026amp;#x200B;\n\nSimilar scenario now, in a boring job, no real progression. In Feb I said fuck it, applied for the Army (Something I've always wanted to do), passed all the entry stuff, now I start in a month!",
   "created_utc": 1698914180,
   "score": 36,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hiuzs",
   "message": "While I don't have anything spectacular or disasterous to tell (I'm kind of a fuck it and find out guy, so I'm always jumping into the deep end), I'd like to add a quote here from Theodore Roosevelt that's applicable:\n\n\"Far better it is to dare mighty things, to win glorious triumphs, even though checkered by failure, than to take rank with those poor spirits who neither enjoy much nor suffer much, because they live in the gray twilight that knows neither victory nor defeat.\"\n\n -Theodore Roosevelt",
   "created_utc": 1698918911,
   "score": 34,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h5jt1",
   "message": "People usually overthink too many decisions that don’t carry much weight. Really, you should say “fuck it” to most things.\n\nWithout risk there’s 0 chance you’ll get anything anyways.\n\nA lot of times it can end up pretty good, but it’s very rarely that doing something destroys your life",
   "created_utc": 1698907563,
   "score": 89,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h6c83",
   "message": "Changed careers from IT to Aviation (Pilot). Took the $130,000 loan out, and said \"Fuck It\". I am about to get my PPL, from there its IFR certification, then Commerical, and then my CFI so I can get my hours and get paid (little but its still making money and obtaining hours).",
   "created_utc": 1698908229,
   "score": 58,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hem26",
   "message": "After a major falling out with my bosses I stormed out of my job with zero notice. Left the company car keys at reception and went. Zero plans, zero transport home.\n\nOn my long walk home I hatched a plan to become a freelance developer and I have now been doing it for 20 years.",
   "created_utc": 1698915412,
   "score": 55,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hb466",
   "message": "In my 20’s I cycled and always talked about racing. One day my mentor wanted to know why I didn’t. I began to complain about money. He checked me and said pick the next race and do it. I said fuck it. I picked the next available race which was half way up the state, bought a one way bus ticket (it’s all I had money for). Put my bike under the bus and took off. I got to my destination signed in and did the race. I had no idea where or what I would do next and struck up a convo in a bar and the guy let me crash at his apartment with an offer to drive me to the second day of the race. I ended up partying all night and missed the race. At the event I ran into some familiar faces from my local weekend group ride and they had enough room in the van for me and a extra spot for my bike. They gave me a ride to a parking lot near my home and I rode back to my apartment. \n\nThis experience was a turning point that taught me planning is well and good but sometimes you n life you just have to jump in with both feet and go for it.",
   "created_utc": 1698912352,
   "score": 27,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hfqk6",
   "message": "I quit my factory job of 2.5 years during the 2020 events to go work at a slaughterhouse. I had nothing to fall back on besides this job. I did training there for a week before they decided I was ready to go work on a line. I was at the line for an hour, just watching the other guys work and I knew immediately that this wasn’t something I could do; it was far too fast paced, far too much to remember and with the job involving razor sharp knives, I feared for my safety. \n\nI walked out of the job during my first break and didn’t return. Went to Staples, printed out some resumes and dropped off about 20 of them before walking into a rebar manufacturing place that hired me on the spot without an interview.\n\nThe rebar job was fun as hell, my coworkers were fantastic, and it paid $3 an hour more than the slaughterhouse. 11/10 decision, there.",
   "created_utc": 1698916368,
   "score": 26,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hi9nd",
   "message": "He’s 8 now.",
   "created_utc": 1698918458,
   "score": 28,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hhm5r",
   "message": "Fucking great!\nThe work is very niche, so niche we were less than 20 to do it at a professional/commercial level in a city like Chicago.\nAfter the facility I ran a crew at closed, I spent a bit over a year looking for a similar job anywhere in the US and Canada without success. I did get a decent amount of interviews just to get ghosted every single time, no one would hire me due to my disability (Crohn's and Ostomy bag, which prevents me from doing a small part of the job and can be worked around without issues).\nAfter all that time all I could find was a 2-days a week part time job, working under the first person I mentored. Did that for a few months and struggled financially until I saw a job posting for something in Singapore.\n\nI said why the hell not, sent my application through email and got an interview set up for the next day and within 90min of that interview they were ready to send me a contract.\n7 weeks later I was on the plane with 3 suitcases, moving across the world to a place (and continent) I've never been in.\n\nI'm 2 months into the job and already feel like I have a purpose again, the job is pretty damn chill, the pay is real good. The company is also really happy with my work so far and his decision of bringing me in. That's just the job part, the city/country is amazing (besides for the constant heat but that's just a small detail)\n\nZero fucking regrets.",
   "created_utc": 1698917934,
   "score": 18,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h64c0",
   "message": "Pretty well. \n\nIf 'Fuck it' is just ignoring fears, then it can be great. If 'Fuck it' means ignoring laws or doing something crappy... then that won't work out so well.",
   "created_utc": 1698908042,
   "score": 39,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h9fp5",
   "message": "I was dating this guy for just a few months and my parents were moving. The wanted to downsize from their house to a one bedroom apartment.  My ex-sister was in collage and they didn't care that I had no place to go. So the guy I was seeing said we could move 1000 miles away and live with his grandmother and cousin while we get settled. It sounded like a good idea.\n\nThen, he tells me that we have to tell people like his grandmother's friends that we were married cause they we more conservative.  OK fine. A month before we move, after my parents have signed a lease for a 1 bedroom, he hits me with this ultimatum.  We have to actually get married.  There were so many red flags but it was either that or be homeless.  So I said fuck it and did it anyway.  Rest of a long story short, I met my half-sister and when my new husband got abusive real quick, I moved in with my sis and her family. Despite everything that happened with that guy, I'm so glad I am where I am now. Away from the people I grew up with.",
   "created_utc": 1698910885,
   "score": 35,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h97ao",
   "message": "I quit my job and moved states in pursuit of music. \n\nEverybody told me it was an awful idea, and they were both right and wrong. I made some really great friends, and I made some music which a lot of people tell me is really great, but I’d be lying if I said I’m thriving.\n\nBills are expensive, and when it comes to making money the earnings aren’t great. My following isn’t big, but I have a dedicated small fanbase. \n\nI just wish it were easier to get my name out there, because from what I hear people really like my stuff. It just doesn’t get shared much, unfortunately.\n\nIf anybody is interested, you can find me wherever you listen to music by searching “Carbrey - South”.",
   "created_utc": 1698910686,
   "score": 60,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hehtl",
   "message": "Seems inconsequential compared to other stories but here it is.  I like older boats.  I had a 1972 Pacemaker and after 20 years with her I was getting too old to handle the maintainance.   \n Not a big boat but too much for me at my age (65 then).  I bought a 1972  Chris Craft, a smaller boat, sight unseen from an online advertisement.  Then I sold my old boat and paid too much to have the new one repowered.  Glad I did it.    \n[Here they are.](https://i.imgur.com/c7thR3j.jpg)",
   "created_utc": 1698915310,
   "score": 16,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hhtmj",
   "message": "Was working a job that payed little and was hazardous due to chemicals and bad health and safety. Wanted to stick it out cause it was a skill I wanted to get good at and also being able to buy food is nice. But the general work environment was shit\n\nOne day at work I got a text from a random number asking if I wanted a job on a film, where I'd be basically painting costume items. They didn't give me any information about it at all.\nBut I said fuck it, and quit my job with my sights set on the big screen\n\nNow I work in the film industry pretty much full time where my job involves painting and making weird shit all day with cool people. More stress and way longer hours, but way more enjoyable and fulfilling. And now I have money to buy my self cool shit whenever I want it",
   "created_utc": 1698918101,
   "score": 14,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hh57u",
   "message": "Like 200k in debt. So, not great.",
   "created_utc": 1698917549,
   "score": 10,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h7r3r",
   "message": "I was on a Segway riding around a lake and was quite nervous about riding up a little grassy knoll. I thought fuck it, and went anyway. Moments later I was spinning out and then the machine was on top of me and my leg felt like cement.   \n22 staples, a bone graft, a platinum insert, the worst most brutal hospital stay ever, lots of physiotherapy .. all while socially isolated. Horrible. But, in answering this question, I realised I probably wouldn’t have gone to New York City and Chicago for a holiday a few months later. Which was unforgettable.",
   "created_utc": 1698909428,
   "score": 22,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hci3j",
   "message": "One night I said fuck it and dropped my snap to these cute girls on Omegle, the one that texted me, ended up being my girlfriend for the next 11 months. She left me to \"focus on herself,\" (which means she found another guy) on Thanksgiving night while I was on vacation. That was still the best year of my life, and this Thanksgiving will be 2 years since she left, and I still think about her almost every damn day. Haven't been happy talking to or being with anyone since. Miss ya, Sophie.",
   "created_utc": 1698913561,
   "score": 21,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hh69p",
   "message": "12 years ago I was in Thailand, and at that point in my life I had nothing that really held me back from doing it. So I said \"fuck it, Im not going home\"  \nI have been home a few times, a year is the longest, but other than that, still living here, now in Cambodia.   \n\n\nIm sure life would have worked out fine if I didnt, but its been great.",
   "created_utc": 1698917574,
   "score": 10,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hj7z9",
   "message": "Done the thing several times. Each time it’s gone pretty well. \n\n1) Walked out on my job and never went back into marketing again. Life is immensely better. \n\n2) I was terrified to adopt a dog. I could barely care for myself. But she was amazing and one of the best things I’ve ever done. I miss her daily. \n\n3) Recently laid off from work and I just said fuck it and took off to travel. I have been to Seattle, Missouri, Oklahoma, Arkansas and now I’m in Italy.  I haven’t even bothered to update my resume and so far, so good.",
   "created_utc": 1698919187,
   "score": 8,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hn8n0",
   "message": "Hubby and I had sex without a condom for the first time in 5 years. We were like, lets see what happens? We got time. Got pregnant immediately. 12 weeks preggers, so turned out pretty good.",
   "created_utc": 1698922045,
   "score": 8,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hhbos",
   "message": "My life fell apart for the most part socially and emotionally so I left my job where I was making $2500 a paycheck in a low CoL state and joined the army. Cut my long ass hair, said goodbye to my friendships i spent ten years forming. Whole shabang.\n\nFuck it, ya know? My best friend had been pressing me for 7 years to join since he LOVED his time in, and I wanted to see if I could do it, especially before I got too old.\n\nIm actually turbo high-speed at this apparently, if i do say so myself. But boy howdy, I'm never trusting myself to make big snap decisions like that again.",
   "created_utc": 1698917699,
   "score": 6,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h85ug",
   "message": "Took a trip overseas to go to a con and meet someone I was a big fan of and say \"I like your stuff.\"\n\nIt was wonderful and amazing and everything I wanted it to be.",
   "created_utc": 1698909786,
   "score": 12,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hcxxl",
   "message": "I ended up with a social life, friends, multiple partners, a fun hobby/job as an online sex worker, and am about to become a published author, so it went pretty well",
   "created_utc": 1698913959,
   "score": 6,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hhj58",
   "message": "Woke up one morning and thought I’m not living the best life I could be having.\n\nWalked out of a 25 year marriage where I was just going through the motions with a woman I didn’t love. Packed in my job of 20 years and moved out the city I was born and raised in.\n\nThen just kinda relaxed, started a small gardening/ lawncare business making just enough money to keep in booze and smokes.\n\nNo regrets whatsoever, loving every moment, just meandering through life without stress.",
   "created_utc": 1698917868,
   "score": 20,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hqw2r",
   "message": "For years prior to the pandemic I'd heard about Work From Home scams. It had always been a dream of mine as someone that had suffered insane commutes to work from home.   \n\n\nDuring the pandemic I figured fuck it I'll see what's out there. Found an old employer of mine was hiring for WFH. I applied got the job and have been with them now for a little over 2 years. A year or so of that time as the night shift lead.   \n\n\nIt's amazing. I have no commute. My workload is relatively light. I spend most of my work hours waiting for work so I listen to music, read books, watch TV etc. Unless I finally go back to school and get my degree this is the closest I'll get to retired.   \n\n\nWith my current schedule I only work 3 nights a week.",
   "created_utc": 1698924356,
   "score": 5,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hshgk",
   "message": "I'll let you know next summer.  I quit my high-paying job (six-figure, leading digit of 2) in The States due to severe and unhealthy burnout and moved to Europe to build a new life.\n\nI know no one here, don't speak another language, and have nothing lined up.\n\nMy burnout was so bad that I'm taking a year off to travel Europe and will then pick a place within the EU27 to settle, look for work, and rebuild myself.\n\nI obtained citizenship in the EU recently and that was my springboard to say \"fuck it, I'm out.\"\n\nYesterday marked the beginning of month 6 for me in my gap year.\n\nI am 48/bachelor/no kids so I just have my mouth to feed, back to clothe, and head to shelter.\n\nFuck it.",
   "created_utc": 1698925296,
   "score": 5,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hw66r",
   "message": "Quit my job as a kitchen manager at a very well established fine dining restaurant, got rid of all my shit, moved the rest of my stuff out of my studio into my car, parked my car at my moms and went to Antarctica to scrub dishes and clean toilets. Best decision of my life. That was in 2014 and I haven’t turned back since.",
   "created_utc": 1698927308,
   "score": 5,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hwtt0",
   "message": "I was at one of the lowest points of my life. Met a guy through OKCupid who only showed up because it measured distance as the crow flies- he lived across the border on the opposite side of Lake Huron. Got talking, really liked him (I had never dated before) and when I wanted to go back to university I said fuck it, I'm gonna apply to the university in the Canadian side of the border town where he lived. I had NO ties there. I didn't drive. But I was genuinely not sure if I even wanted to live anymore. \n\nWe're expecting our first child in two weeks :)",
   "created_utc": 1698927645,
   "score": 5,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h6cot",
   "message": "I quit my shitty job and tried to go to one of those coding programs. It didn't work out, but I got into a new field afterward, and make way more money now. My current job definitely leaves a lot to be desired, but my foot is in the door in a much better field and I am making nearly six figures compared to my old job at a nonprofit where I made far less. This never would have happened if I hadn't decided to say \"eff my job\"  and try something new.",
   "created_utc": 1698908239,
   "score": 8,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hmfz8",
   "message": "I was an EMT for a couple of years. I loved it at first, but when the PTSD from the things I was seeing started to become too much. I left that job and joined the Army. I spent a couple of years in that before getting hurt and had to get a medical discharge. Then Corona hit, and I was on unemployment, making $800/week.  With the free time and extra income I had, I started a small cannabis company with some friends. Best decision of my life. We've been steadily growing month to month, and we are on track to doing over $500k in revenue for this year. I now love what i do and make more money than I ever thought I could. I wake up happy every day with my dog and soon to be wife. I never thought life could be this good.. that was by far the best decision iv ever made. I can't wait to see what the future holds.",
   "created_utc": 1698921512,
   "score": 4,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hvfwg",
   "message": "Applied for a unicorn job this year that required a degree. I don't have a degree. Got the position despite over 100 applicants and made a $45k jump overnight.",
   "created_utc": 1698926931,
   "score": 4,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hmq9o",
   "message": "I finally accepted my birth parents would never love me. Left them in the rear view and called my aunt and uncle who were the only people in my family that made me feel happy. \n\nI got a loving home and many life lessons taught by them. Loosing them was the most difficult part of my life. \n\nHowever they left me with one final blessing, my cousin whom I adopted. She gave me strength I never knew I had, and now with my wife, stepdaughter, adopted daughter, and a varied assortment of pets. \n\nSo yeah, turned out great. I never thought I'd be this happy, but here we are. \n\nHave faith my friends, no matter if your faith is in God, your family, your friends, or just yourself. Just belive it can be done, and you'll make it happen.",
   "created_utc": 1698921701,
   "score": 8,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h6w2e",
   "message": "Ask my kids",
   "created_utc": 1698908695,
   "score": 8,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hir6o",
   "message": "She said yes. We went on a date. And in 2 weeks it’s our 20th wedding anniversary ❤️",
   "created_utc": 1698918832,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hj60z",
   "message": "Arrived at the end of year 2 in a company, and my boss offered me a big promotion, even promising that in a few years he'd want to make me an associate if I continued like that. I was quite good. He was a good boss, I liked working with him, very skilled and professional. Thing is, I found my job so boring. And somehow life also was boring. I wanted something exciting as I was still in my 20s. I felt like I already had a deadly routine at only 26yo... I couldn't bare to live like that. That's when I said fuck it.\n\nRefused the promotion, handed my resignation, said bye to family and friends, and I went to live in a country on the other side of the world (Korea) for one year without no job lined up, just living on my savings. I even chose this country a bit randomly as I knew nothing of its culture.\n\nFast forward 6 years later I'm still living in Korea, with a cool job, and I'm the happiest I've ever been while having lived intense and exciting experiences the last few years. I can't imagine if I was still doing that job back in my home country... thank god I said fuck it.",
   "created_utc": 1698919146,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hm3fk",
   "message": "Man do I love my 2yo son 🥰",
   "created_utc": 1698921281,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hm76s",
   "message": "We’ll find out tonight when I ask her out.",
   "created_utc": 1698921352,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hmjbf",
   "message": "Changed from lawyer to having my own tourism company with my husband, being a tourguide and a snowboarding instructor. 2 years and a half later, it is not a peachy life all of the time, I mean you are hustling 100%, but at least I have the freedom to do it on my own terms.\n\nThe stress of freelancing beats the streess of working a corporate job, but so does the freedom and satisfaction.",
   "created_utc": 1698921573,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hp8gm",
   "message": "I was the king of \"fuck it\" for few years in my early adulthood. \n\nI dropped out of college when I had a full scholarship at a good university. Partially because I realized college was a dead end for me personally, and partially because I had a psychotic break due to undiagnosed bipolar disorder. \n\nAfter I dropped out I ended up starting as an electrician's apprentice. Hated it. My friend said she had a job at a call center that had a $500 sign on bonus. Said fuck it again and quit the apprenticeship and went to the call center. \n\nCall center job was hell. I was exteemely good at it though. I got promoted 3 times and I was on track to be in upper management in a year or two. Problem was I absolutely hated it. Decided there was nothing for me there. I did meet a girl while working there. She and I started dating.\n\nAfter the call center I rhought about trying college again. I took out a small ($3500) student loan, and went to a local university's branch campus for a semester. Realized college still wasnt the answer for me. Dropped out after a semester. \n\nAfter I quit college the second time, I decided to try the apprenticeship again. Started with a different company. Turns out I like electrical work, I just hated the first company. Ended up finishing the program and getting pretty good at my job. Stayed with that company for 6 years until I changed companies recently and my career trajectory is looking really good now.\n\nOh. And the girl from the call center? I dated her for five years and then married her two years ago.\n\nSo after saying \"fuck it\" several times and walking away from a full ride, a paid apprenicesjip, a possible career in call center upper management, and college again, it all ended up working out. I have a career I enjoy and my prospects look awesome, and I married a wonderful woman. All without royally fucking my life up.",
   "created_utc": 1698923333,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hu4r8",
   "message": "Small win, even if I did get rejected after asking my friend's sister out, I'm glad I grew some balls to say something.",
   "created_utc": 1698926222,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7huc0j",
   "message": "I now have to visit the VA for the rest of my life due to the plethora of problems the original “fuck it” caused (signing papers).",
   "created_utc": 1698926334,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7huy9q",
   "message": "In 2014 I quit my shitty job and life and chose to hike across the country. 2,668 miles on the PCT. Went solo. Took 5 months. Never long distance hiked before that, let alone hiked really much at all. Changed my life, and has been nothing but positive change for 10 years since the hike ended. Happily married to the love of my life and in a new house both with great jobs. The event/hike changed my perspective on what it means to be alive.",
   "created_utc": 1698926671,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hvbbe",
   "message": "Moved 900 miles from home after college to a place with no job and no friends. \n\nBest and most important thing I've ever done.",
   "created_utc": 1698926863,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hwqzn",
   "message": "Thought 'I'll give this heroin a try, what's the worst that could happen?'\n\nA decade of my life gone in a rustle of tinfoil.",
   "created_utc": 1698927605,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hxkx3",
   "message": "Quite well, actually. I am from Australia and had enough of living there. On a Wednesday afternoon at university, I decided I was moving to England to pursue my goals. I bought a one way ticket that day and announced that I was leaving a few months later.\n\n7.5 years later, I am happy in England, own a home, have a dog, have a loving partner and work in a field that my degree is relevant for. All in all, best decision I have ever made.",
   "created_utc": 1698928022,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h7n97",
   "message": "I asked my current girlfriend for her number and told her that I wanted to court her.. she said okay and now we are together for 4 years. Loved every single minute of it! Best “Fuck it and do it” of my life",
   "created_utc": 1698909334,
   "score": 6,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hc1fu",
   "message": "Always better than not",
   "created_utc": 1698913159,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7he3a1",
   "message": "I said \"fuck it\" and joined the military training for a war. Left in a week due to back injury. I am healing now and will go back.",
   "created_utc": 1698914963,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hnsi6",
   "message": "Job I was in, many years ago.  I had to put up with physical and verbal abuse on a daily basis.  Then I somehow managed to grow a spine and say \"Fuck it\" and walk out.\n\nWent to the Jobcentre and told them about what I'd gone through and the name of the company.  Without having to look it up, they knew how bad the company was and were very sympathetic.  Friends also sided with me and told me I was right to leave.",
   "created_utc": 1698922402,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hojyv",
   "message": "I came",
   "created_utc": 1698922901,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hp5ln",
   "message": "Pretty good, not bad, can't complain.  Actually, everything's just about the same.",
   "created_utc": 1698923283,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hp6zq",
   "message": "Had wanted to go to Iceland for over 10 years and finally just went a couple of months ago.\n\n10/10, would recommend, will go again!",
   "created_utc": 1698923307,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hsfr2",
   "message": "Seventeen months ago we closed our business, sold our house and set out in our car with a plan to go wherever. So far that's taken us across the US and Canada and back, to western Europe and currently in Asia (sold the car before we left). \n\nSome days are more challenging than others but we've seen and done stuff we will never forget and are learning a lot about ourselves and the world along the way. Not sure how, when or if this ends and in no hurry to find out",
   "created_utc": 1698925269,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hsh8l",
   "message": "hospital",
   "created_utc": 1698925292,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7ht1at",
   "message": "Walking to a thrift store and noticed a Muay Thai/bjj gym next door. Went in, asked questions, gave them my email. After a few emails back and fourth (COVID had JUST ended) and ended up joining about a year and a half ago. Currently taking my post-spar poop and shower.\n\nMet some cool ass people, lost fat, gained weight, learned to fight a bit. Great idea. One of my few social activities that aren’t alcohol related.",
   "created_utc": 1698925611,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7ht2rf",
   "message": "Someone I knew was working in a different country building strawbail houses. I was working a shitty bar job and drinking too much/ doing too many drugs.\n\nI thought fuck it let's go, ended up being the 3 greatest years of my life.",
   "created_utc": 1698925635,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7ht7d3",
   "message": "Walked away from and 18 year relationship and everything I owned after it reached a point I was contemplating my final breath.. figured nothing could be worse so why not... jumped on a plane, left my life and started travelling with next to nothing.. 7 years later I live with a girl I met travelling, we got married In Georgia, travelled round eastern Europe, moved to south east asia, now living in India, establishing a business and living very happily..",
   "created_utc": 1698925708,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7htbix",
   "message": "Stopped listening to my con artist lunatic of a mom. Overall positive, now married with 3 kiddos, but had years of legal landmines she'd left in case I did that. If you have a parent that insists the family business is the only thing you'll ever be good for, or that the world will eat you up if you leave, what they mean is \"I need your free loyalty, you're just a tool to me.\" There's no future in that.",
   "created_utc": 1698925774,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7htdsx",
   "message": "Mostly good. Even if it was bad there was a lesson I needed to learn.",
   "created_utc": 1698925810,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7htebz",
   "message": "Went on a date that…I wanted to go on, but didn’t want to at the same time, because I was so over first dates.\n\nThat was five years ago. Will be proposing sometime soon.",
   "created_utc": 1698925818,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7htfg8",
   "message": "Freaking amazing. Spent two years at it and, while I probably won't do it again due to cost and risk, I am really glad I let myself justify it for a while...  no regrets. \n\n(The thing was earning my pilots license and spending a couple years hopping around the skies in a little single engine)",
   "created_utc": 1698925836,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hth01",
   "message": "I ended up with a three and half year relationship that is still going strong. We were great friends and I had a massive crush on them, so I didn’t want to mess that up. I decided to shoot my shot right before Valentine’s Day and I’m so glad I did because I get to wake up every day knowing I’m loved by the greatest and loveliest person I’ve ever met.",
   "created_utc": 1698925860,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7htodz",
   "message": "5 to 10",
   "created_utc": 1698925972,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7htwuq",
   "message": "Pretty dang good actually. Still together 23 years later! I asked this boy I had a crush on in high school out and we are now married with two kiddos. It was actually a missed opportunity the week before for him to ask me out (he wanted to ask me at a dance that we were both at, but I had left with my group of friends before he worked up the courage).",
   "created_utc": 1698926100,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7htyl7",
   "message": "Amazing, actually. \nAbout 3 years ago I quit my job with no backup, switched cities to live on a mattress at my friends floor for 6 months, then we switched cities again together where I now have started a whole new life and I’m so happy and content. Been a wild, tough ride but damn if you really feel it you just gotta do it.",
   "created_utc": 1698926127,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hu749",
   "message": "It’s better to regret something you have done than to regret something you haven’t done",
   "created_utc": 1698926258,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hu8u3",
   "message": "After a year of working at my current job I called out sick for the first time today. I’m not sick but I’m heavily stressed/anxious and didn’t feel like coming in today. I don’t feel guilty.",
   "created_utc": 1698926285,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7huhg4",
   "message": "This thread has a selection bias. As a person who had a relative choose to fuck it and do it, he died. So the worst stories cannot be cannot be shared from dead people.",
   "created_utc": 1698926416,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7husir",
   "message": "i moved to a different state because i felt i had no options and just picked\none based on knowing one person there and their opinion and it was the best decision i ever made.",
   "created_utc": 1698926584,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7huvga",
   "message": "I became a trainee ambulance dispatcher. I ended up losing the job because of my disability which would sometimes impact my ability to carry out the job.\n\nIt was the best job I've ever had, and even though this was a couple of years ago, it really fucking hurts, and I hate my chronic illness. That being said, I was proud that for once I put myself out there, and that at one point I saved a life by going against my trainers suggestion of how to handle one of my caseloads.\n\nThey told me it was fine to wait for it to be coded, that it wouldn't be a high priority code, but I was knowledgeable about the health condition that this patient had, and knew it would code under the highest priority code we have, and I immediately directed an ambulance to them. It did end up coding the way I thought. I'm not one who usually goes against an authority figure, or to stand up like that, and it made me realise what I'm really capable of.\n\nI also respect that it wouldn't be fair for patients for me to continue in this role because of my disability.",
   "created_utc": 1698926628,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hv7ly",
   "message": "Excellent. I moved to the other side of the world, started a new career, and met the love of my life",
   "created_utc": 1698926809,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hvnop",
   "message": "She turned 13 in May...",
   "created_utc": 1698927042,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hvu1g",
   "message": "Not too great, I left sixth form to join the RAF, got COVID a week into basic, couple other injuries and a medical issue later I was medically discharged 2 years in.\n\nBut it did change me because I fucking hated myself and I'm glad I did it, just not glad with how things turned out",
   "created_utc": 1698927133,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hvyeh",
   "message": "We will be married 40 years in March.",
   "created_utc": 1698927196,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hw4n7",
   "message": "Met some cool people, did some cool and boring things and made my hobby a real job.",
   "created_utc": 1698927285,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hchqe",
   "message": "Currently suffering from food poisoning, it's coming out from both sides. Won't go to work tomorrow.",
   "created_utc": 1698913552,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hk2i6",
   "message": "I recently watched the hangover, not sure which one, the one in Thailand? As a straight man of 30 years I found myself very confused by the trans Asian woman who shags stu, particularly when you see her penis. \n\nAnyway, let curiosity and arousal get the better of, spent some time on the web, found a nearby Thai prostitute who let’s just say ‘had a little extra’ and booked her in, sat in my car outside hers for a while asking myself if I’d have the courage to go through with it or not… said fuck it I’m hear now, went in and had the best sex of my life with arguably the most attractive ‘woman’ I’ve ever been with. \n\nHavnt been back but no regrets.",
   "created_utc": 1698919815,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hvhwu",
   "message": "My friend helped me work up the courage to ask someone I had a massive crush on if he was straight. He in fact was, which was quite earth shattering for me last night, but I guess at least I won’t be wasting my time anymore. It’ll just take a bit to get over him. He’s a genuinely great person, so I hope when I stop being a stupid gay we can still be friends.",
   "created_utc": 1698926960,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h8nj1",
   "message": "It's been a lifestyle since birth.   I'm happily married with two kiddos own a small farm and make 6 figures in a management role at a mega corp.  I only barely graduated high-school didn't finish but two years of CC.  Fuck it.",
   "created_utc": 1698910214,
   "score": 3,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hdft1",
   "message": "Decided to tell my boyfriend I had a crush on our best friend. He did too. So did she. (On us, I mean.) Now a happy throuple going strong",
   "created_utc": 1698914387,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7h5wu7",
   "message": "Didn't go well",
   "created_utc": 1698907869,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7he45e",
   "message": "Quit my toxic office job in 2011, went freelance between jobs to make ends meet, and it went so well that I made the mental shift of thinking of myself as \"self-employed\" instead of \"unemployed.\"\n\nI'm now a partner in a small business that I co-founded in 2020, and so far we've been very successful. Fingers crossed, I plan for it to be the last job I ever have.",
   "created_utc": 1698914985,
   "score": 2,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7i4wac",
   "message": "I had sex with a lady whose tits were bigger than my head. It was a good time. Then I did it again the next time i was in town, and it was still a good time",
   "created_utc": 1698931435,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hp0fs",
   "message": "All the famous people that took a risk and became famous, \" yeah pretty good\", the other 99% of people that took a similar risk but failed \" yeah not so good hey\".",
   "created_utc": 1698923193,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hv4hy",
   "message": "I said “fuck it” and wanted to make a move with this chick whose in this big friend group of ours  whom we met once (only hangs out once in a blue moon), slid into each others dms for a few weeks, the day of when we saw each other again my friends in that group warned me about her since they were noticing what I was doing, turns out she’s a lazy hooah who will lay on her back and act like a corpse in bed (puts 0 effort) and speed runs hookups with guys, I noticed the credibility on what they warned about when I notice she’s like flirting with 3 different dudes, myself included the same night within a couple of hours. Immediate pass. Like lower your frequency, man lol. I’d like to thank the homies on that one, we haven’t talked since, keeping it completely mutual now. and now I’m reflecting on myself. I don’t feel bad at all since I didn’t really know what I was getting myself into, I’m just…impressed I guess by her persistence lol",
   "created_utc": 1698926763,
   "score": 0,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hvpum",
   "message": "I can dropkick a infant 15 feet",
   "created_utc": 1698927072,
   "score": 255,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hemrx",
   "message": "It turned out live.",
   "created_utc": 1698915429,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hher0",
   "message": "That is not a short answer , fuck it got me my business but it also seen blue lights behind me .. so a range from the best to the wordt",
   "created_utc": 1698917769,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hihyx",
   "message": "Burnt my entire life to become a gardener, in a new town, new house and new relationship. No regrets, even though I am making a third of what I used to make.",
   "created_utc": 1698918637,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hiqpr",
   "message": "I ignored many red flags in a relationship (I was not in a good place and thought they too just needed love and a sweet SO to \"bloom\" out of it) and two kids later they turned out having undiagnosed full-blown BPD and discarded me for someone else. Now I can recognize red flags from a distance and it's the most useless superpower on earth. I am now allergic to relationships.",
   "created_utc": 1698918822,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hjfw2",
   "message": "Awesome. I work a dream job, for me anyway and moved from a toxic city. *Inwork at abgroup home and absolutely love it.",
   "created_utc": 1698919351,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hjqzp",
   "message": "I used to love watching beekeeping videos on YouTube and one day I said \"Fuck It\" and got some equipment and read a couple books and bought some bees and did the damn thing. Now I got honey year around",
   "created_utc": 1698919581,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hk5gq",
   "message": "U came to me for ass not dick u can not make me mad",
   "created_utc": 1698919877,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hk8qb",
   "message": "I now have a Yoshi plush.",
   "created_utc": 1698919945,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hk9qi",
   "message": "But what  Medication he on u know every fucking thing",
   "created_utc": 1698919966,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hkb63",
   "message": "I'm married now. Do the thing. Embrace life.",
   "created_utc": 1698919995,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hkr4v",
   "message": "Honestly, one thing I'm learning the older I get (mind you, I'm only 31)\n\nIs that more often than not, saying fck it and doing  the thing is usually worth it, and if it's not, the consequences aren't as bad as you imagined. \n\nObviously, this varies and depends on what your definition of \"the thing\" is. \n\nThe only applies to general yolo type stuff. \n\nNot like murder or heroin or crazy shit like that. \n\nBTW I'm kinda drunk so take this with a gain of Salt",
   "created_utc": 1698920326,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hks9u",
   "message": "I got concussed and was lucky I didn’t get dead.",
   "created_utc": 1698920350,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hktfv",
   "message": "Exceedingly well\nSaid fuck it. Drove to California and learned how to fly a paramotor.\n\nNow all I need to do next is save up some money.. Drive south and fly some more.",
   "created_utc": 1698920374,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hkzyy",
   "message": "It’s my mantra. It had worked very well for me so far.",
   "created_utc": 1698920506,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hl5aw",
   "message": "I feel like whether I do or do not, nothing ever seems to happen man.",
   "created_utc": 1698920610,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hl76s",
   "message": "It was a wild ride. Messed up my life a bit in terms of progression. But I made memories that never would have happened otherwise so I don't regret it at all. \n\n\nLeft my brand new apartment with only what I could carry, left a job that was paying the bills but dead end, and moved an hour away to live with a recently convicted sex offender with his parents out in the middle of nowhere. I grew up in a suburban/city area. It was an entire experience.",
   "created_utc": 1698920647,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hleu4",
   "message": "I’m broke and have crippling debt",
   "created_utc": 1698920796,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hlvnq",
   "message": "I picked a random city on a map in Thailand to move to and I'd never even been on an airplane before. It's been excellent and I've lived here almost 5 years now.",
   "created_utc": 1698921132,
   "score": 1,
   "submission_id": "17lxij1"
  },
  {
   "comment_id": "k7hx1va",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17lxij1"
  }
 ]
}