{
 "submission_id": "17m1e5c",
 "title": "What happened to those who had attended a botched wedding?",
 "selftext": "",
 "created_utc": 1698924622,
 "permalink": "/r/AskReddit/comments/17m1e5c/what_happened_to_those_who_had_attended_a_botched/",
 "score": 52,
 "url": "https://www.reddit.com/r/AskReddit/comments/17m1e5c/what_happened_to_those_who_had_attended_a_botched/",
 "comments": [
  {
   "comment_id": "k7hrm99",
   "message": "We went to a wedding for a family member who didn't have much money. It was held at a low-cost yet pleasant location. My heart was broken when just one-third of those invited showed up. The couples' faces were filled with pain. They approached our table and asked if we had any acquaintances in (city, we lived an hour away)? They had enough food for 100 people, but only 30 people showed up. They were prepared to have total strangers come down simply to avoid wasting their money and food. We hadn't yet handed them our cash-filled card, so my husband went to the ATM and added another $100.",
   "created_utc": 1698924795,
   "score": 135,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrzgc",
   "message": "Attended a wedding reception and was seated near the cameraman. An aunt of mine was sitting closer to the camera and spent the evening commenting and gossiping about everyone, and much of it came out on the video. The cameraman was great, he did two copies, one edited and the other no holds barred...The unedited version is the stuff of legend.",
   "created_utc": 1698925011,
   "score": 112,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hscr9",
   "message": "There were no tables and chairs. Like none. They had an open bar but no fucking chairs. Everyone had to put their drink on the ground and hold their plate to eat. It was fucking crazy.\n\nEveryone just assumed that some sort of terrible thing happened where the tables and chair people didn't bring them but afterwards I asked her (the bride) what happened and she just said \"Oh we would have had to pay extra for that.\"",
   "created_utc": 1698925221,
   "score": 103,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrj5l",
   "message": "My nephew is highly allergic to peanuts and was the ring bearer in a wedding when he was very young. The bride and groom made sure that the venue, the caterers, whoever made the cake, all knew that there should be no peanut-containing or contaminated food on the premises for their wedding. No one thought to tell the DJ though, and the DJ brought peanuts as a snack. He held my nephew's hand walking him into the reception and my nephew had a serious reaction. He was ok in the end, fortunately the EpiPen did work in his case, but it certainly put a damper on the reception after he had to leave for the hospital.\n\nIt was pretty scary, and I share that story hoping that if any other brides/grooms have a loved one with a peanut allergy, make sure you tell eeeeevverybody that might set foot in your wedding venue.",
   "created_utc": 1698924743,
   "score": 76,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrsum",
   "message": "This was one I worked at. After the ceremony, right at the start of the reception - photographer was taking ‘jumping’ photos of the bride and bridesmaids, so they were all jumping in the air while wearing heels. Bride landed and dislocated her knee, then passed out and kept going in and out of consciousness. We called an ambulance who turned up and fixed her knee etc, but she wanted to continue with the wedding. She then had the first course of the meal and threw up down her dress, and had to sit with her mum in another room while everyone else danced etc. Felt so bad for her as she spent the rest of the evening crying.",
   "created_utc": 1698924904,
   "score": 57,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrqkx",
   "message": "I'm a wedding photographer.\n\nI was at one really fancy one a couple of years ago, typical outdoor deal at a swanky location in the middle of nowhere.\n\nThe place was really nice, had a large concrete stairway flanked by water fountains that led down to the altar area, so the bride could be seen by all like she was ascending from heaven.\n\nThe ceremony begins and the bridal party come down and take their places. Then the bride appears with her father. She takes 3 or 4 steps down the concrete steps and her shoe twists on her, she tumbled down a good 12 feet or more and busted out the majority of her front teeth in the fall. So much blood all over her.\n\nWith the place being so isolated, it took a good 40 minutes for ambulance to arrive and she was in intense pain. Ultimately she was ok and I got an email from them weeks later with the reschedule date. This time there was no stairs anywhere in sight.",
   "created_utc": 1698924866,
   "score": 50,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hregn",
   "message": "A coworker was to one of my closest friend's wedding, and there were strict food regulations - no nuts. present were a few of individuals present who were really allergic, including the maid of honour. The venue served something with nuts, and the maid of honour became anaphylactic. The Epipen did not work, and she died on the way to the hospital. Needless to say, there are several lawsuits.",
   "created_utc": 1698924664,
   "score": 86,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hthy4",
   "message": "My brother’s wedding. They didn’t think to have a dinner, or tell anyone that there was no dinner. They had a snack table with some good stuff, but no actual dinner and it ran out because people took more then a snack. So me being the drink til you drop kind of person drank until I… don’t remember how I dropped…I did smash my face into a pole on the way out and that seems to be what everyone remembers the most. 🤷‍♂️",
   "created_utc": 1698925875,
   "score": 37,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hwn9j",
   "message": "A few years ago, my cousin was getting married. The man she was marrying was perfect for her. I was jealous. I wanted something like they had...\n\nAnyway, the day of the wedding comes and her maid of honor (sister) and her soon to be husband are nowhere to be found.\n\nWell, she's waiting in the church and one of the groomsmen comes in with a hand written letter (edit: from the fiance). Turns out the maid of honor (her sister) and her fiance have been sleeping together for a while, she's pregnant, and they've ran off to Vegas to get married. \n\nSo, no wedding.",
   "created_utc": 1698927551,
   "score": 31,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hwvgf",
   "message": "The wedding was at a state park that's famous for its giant gorge/waterfall. I don't know whose idea this was, but someone suggested a photo overlooking this gorge and everybody was game. The wedding party went around a stone security barrier and the maid of honor literally fell off the cliff to her death. It was like 500+ feet.",
   "created_utc": 1698927669,
   "score": 32,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrogy",
   "message": "Somewhere there exists a picture of me in \"stage blacks\" in the middle of a drunken wedding reception conga line.\n\nMy BF at the time was doing sound for the band, as they'd intended to have all live music. Something like 60/100 people showed up (there was a snow storm involved) and the bride, without missing a beat, invited all of the venue staff (including people who weren't even working the wedding) to come eat and dance.\n\nBride's mother ended up playing DJ for ~an hour (with the exact same no-nonsense attitude as her daughter) so the band could propertly sit down for dinner and the groom and his groomsmen, still in tux shirts/pants, insisted on helping load out even though it was basically just a drum kit and couple speakers.\n\nI have no idea who these people were but would bet money I can't afford to lose that they're still happily married. :)",
   "created_utc": 1698924832,
   "score": 61,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hx26f",
   "message": "The brides father was 45 min late to walk his daughter down the aisle.\n\nWhile we were waiting the air conditioning broke in the venue. It was over 100degrees outside and humid AF. The place was overcrowded. You could barely move without bumping into someone else and in the heat that was extra miserable.\n\nI guess the air conditioning problem had also affected the refrigeration or something because most of the food was spoiled. The only food on the buffet was salad, spaghetti and rolls. Not enough to feed even half the guests.\n\nMost people left after the first dance. Two of the brides aunts fainted.\n\nThe bride and the wedding planner were crying.",
   "created_utc": 1698927762,
   "score": 25,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hxbxi",
   "message": "A fight broke out between father of the bride, brother of the bride and some guy that just happened to be staying at the hotel. In reality I don’t know how much of a ‘fight’ it was, more just the Dad and Brother assaulting some man. So anyway they were both arrested. Cut to the bride sobbing at breakfast because her Dad and Brother spent the evening of her wedding in jail and now face assault charges for what they did to this poor man.",
   "created_utc": 1698927897,
   "score": 18,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i343n",
   "message": "I worked at a wedding where the couple had sent out 100 invitations without RSVP. They had no clue how many people would show up, but they did tell the venue to prepare dinner for 150 guests. \n\n35 people showed up. 25 kilos of prepared salmon filet got thrown out. \n\nThe 'party' ended fairly early because the few guests that were there started leaving around 9.30. We were home early :-)",
   "created_utc": 1698930652,
   "score": 1,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hvepr",
   "message": "I once attended a botched wedding where the groom's ex-girlfriend stormed in during the vows, declaring her love for him. It turned into a dramatic shouting match, and the bride burst into tears. Surprisingly, the groom called off the wedding and left with his ex. A year later, I received an invitation to their engagement party, and they seemed happier than ever. Love can be messy, but sometimes, it finds its own way back.",
   "created_utc": 1698926913,
   "score": 15,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hwfm5",
   "message": "/r/weddingshaming\n\nTons of stories in here",
   "created_utc": 1698927442,
   "score": 6,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i3pfu",
   "message": "My aunt had a wedding during a tropical storm. Power went out in the church during the ceremony so it had to be completed in the dark with phone lights. Then at the reception which was held in a semi outdoor space had generators to try to get some power up but it was extremely loud so you couldn’t hear the music or people. Then it rained so hard that water was seeping from the walls/ceilings which flooded a good portion of the reception floor. Final piece, one of the maid of honors got so drunk she threw up right at the entrance of the venue so everyone had to pass by it to enter/leave.",
   "created_utc": 1698930916,
   "score": 1,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i5246",
   "message": "A brother married a sister and then Johnny Knoxville showed up. It wasn’t even a real wedding",
   "created_utc": 1698931503,
   "score": 1,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i4zgd",
   "message": "Food poisoning , home made sushi. Another reason I stopped eating that stuff.",
   "created_utc": 1698931471,
   "score": 1,
   "submission_id": "17m1e5c"
  }
 ]
}