{
 "submission_id": "17m1e5c",
 "title": "What happened to those who had attended a botched wedding?",
 "selftext": "",
 "created_utc": 1698924622,
 "permalink": "/r/AskReddit/comments/17m1e5c/what_happened_to_those_who_had_attended_a_botched/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/17m1e5c/what_happened_to_those_who_had_attended_a_botched/",
 "comments": [
  {
   "comment_id": "k7hrm99",
   "message": "[removed]",
   "created_utc": 1698924795,
   "score": 153,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrzgc",
   "message": "[removed]",
   "created_utc": 1698925011,
   "score": 219,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hscr9",
   "message": "[removed]",
   "created_utc": 1698925221,
   "score": 55,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrj5l",
   "message": "[removed]",
   "created_utc": 1698924743,
   "score": 226,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrsum",
   "message": "[removed]",
   "created_utc": 1698924904,
   "score": 135,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrqkx",
   "message": "[removed]",
   "created_utc": 1698924866,
   "score": 31,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hregn",
   "message": "A coworker was to one of my closest friend's wedding, and there were strict food regulations - no nuts. present were a few of individuals present who were really allergic, including the maid of honour. The venue served something with nuts, and the maid of honour became anaphylactic. The Epipen did not work, and she died on the way to the hospital. Needless to say, there are several lawsuits.",
   "created_utc": 1698924664,
   "score": 202,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hthy4",
   "message": "My brother’s wedding. They didn’t think to have a dinner, or tell anyone that there was no dinner. They had a snack table with some good stuff, but no actual dinner and it ran out because people took more then a snack. So me being the drink til you drop kind of person drank until I… don’t remember how I dropped…I did smash my face into a pole on the way out and that seems to be what everyone remembers the most. 🤷‍♂️",
   "created_utc": 1698925875,
   "score": 76,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hwn9j",
   "message": "A few years ago, my cousin was getting married. The man she was marrying was perfect for her. I was jealous. I wanted something like they had...\n\nAnyway, the day of the wedding comes and her maid of honor (sister) and her soon to be husband are nowhere to be found.\n\nWell, she's waiting in the church and one of the groomsmen comes in with a hand written letter (edit: from the fiance). Turns out the maid of honor (her sister) and her fiance have been sleeping together for a while, she's pregnant, and they've ran off to Vegas to get married. \n\nSo, no wedding.",
   "created_utc": 1698927551,
   "score": 95,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hwvgf",
   "message": "[removed]",
   "created_utc": 1698927669,
   "score": 128,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hrogy",
   "message": "[removed]",
   "created_utc": 1698924832,
   "score": 233,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hx26f",
   "message": "The brides father was 45 min late to walk his daughter down the aisle.\n\nWhile we were waiting the air conditioning broke in the venue. It was over 100degrees outside and humid AF. The place was overcrowded. You could barely move without bumping into someone else and in the heat that was extra miserable.\n\nI guess the air conditioning problem had also affected the refrigeration or something because most of the food was spoiled. The only food on the buffet was salad, spaghetti and rolls. Not enough to feed even half the guests.\n\nMost people left after the first dance. Two of the brides aunts fainted.\n\nThe bride and the wedding planner were crying.",
   "created_utc": 1698927762,
   "score": 25,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hxbxi",
   "message": "A fight broke out between father of the bride, brother of the bride and some guy that just happened to be staying at the hotel. In reality I don’t know how much of a ‘fight’ it was, more just the Dad and Brother assaulting some man. So anyway they were both arrested. Cut to the bride sobbing at breakfast because her Dad and Brother spent the evening of her wedding in jail and now face assault charges for what they did to this poor man.",
   "created_utc": 1698927897,
   "score": 154,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i343n",
   "message": "I worked at a wedding where the couple had sent out 100 invitations without RSVP. They had no clue how many people would show up, but they did tell the venue to prepare dinner for 150 guests. \n\n35 people showed up. 25 kilos of prepared salmon filet got thrown out. \n\nThe 'party' ended fairly early because the few guests that were there started leaving around 9.30. We were home early :-)",
   "created_utc": 1698930652,
   "score": 60,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hvepr",
   "message": "I once attended a botched wedding where the groom's ex-girlfriend stormed in during the vows, declaring her love for him. It turned into a dramatic shouting match, and the bride burst into tears. Surprisingly, the groom called off the wedding and left with his ex. A year later, I received an invitation to their engagement party, and they seemed happier than ever. Love can be messy, but sometimes, it finds its own way back.",
   "created_utc": 1698926913,
   "score": 15,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7hwfm5",
   "message": "/r/weddingshaming\n\nTons of stories in here",
   "created_utc": 1698927442,
   "score": 6,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i3pfu",
   "message": "My aunt had a wedding during a tropical storm. Power went out in the church during the ceremony so it had to be completed in the dark with phone lights. Then at the reception which was held in a semi outdoor space had generators to try to get some power up but it was extremely loud so you couldn’t hear the music or people. Then it rained so hard that water was seeping from the walls/ceilings which flooded a good portion of the reception floor. Final piece, the maid of honor got so drunk she threw up right at the entrance of the venue so everyone had to pass by it to enter/leave (edit: until they could find someone to clean it up).",
   "created_utc": 1698930916,
   "score": 110,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i5246",
   "message": "A brother married a sister and then Johnny Knoxville showed up. It wasn’t even a real wedding",
   "created_utc": 1698931503,
   "score": 1,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i4zgd",
   "message": "Food poisoning , home made sushi. Another reason I stopped eating that stuff.",
   "created_utc": 1698931471,
   "score": 1,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iewr5",
   "message": "Friend's wedding. A bunch of people got food poisoning at the rehearsal dinner.  Including the groom. He spent the night at the ER getting fluids and medication to stop puking.   This was an awesome high-end wedding and he almost cancelled. He was a pale green color and basically sipped Gatorade all day and got through it. He married his HS sweetheart and they have been married 30+ years.",
   "created_utc": 1698935431,
   "score": 134,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ig5un",
   "message": "My family was invited to what we thought was an engagement party. My aunt had reserved a room at a local restaurant for about 50 people. Turns out it was my cousin's wedding. So no one brought a gift or dressed up at all. Bride is in a wedding dress and groom is wearing jeans. \n\nWe ordered food and drinks. The officiant does his thing while waiters are bringing in drinks and appetizers. Finally over and we get to eat. But when the officiant asked for the marriage license so they can all sign it, my cousin and his new wife just stared at him confused. They didn't know they had to get one! Thought just having a wedding was enough. They were in their late 20s.\n\nSo wedding, but no marriage. They never did \"officially\" get married and he ran off a few years later to another state to be with some girl he met online.",
   "created_utc": 1698935913,
   "score": 36,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7imo1m",
   "message": "It was my very first friend to get married: a girl I’d known in high school. We were 24, 25. Classic rom-com nightmare scenario where the groom had second thoughts the day of and just bolted. We all just milled around for a while, not sure what to do. Awful vibes, the bride’s mom was weeping hysterically. Me and some friends were finally making our way to the exits, and the bride stopped us, like “where the fuck do you think you’re going? You guys are taking me out to a bar right this minute, and you’re gonna have to carry me out of there.” So we did—mostly the young people, though a few stray aunts and uncles came along, including a few of the groom’s relatives who were like “he’s a little punk anyway, you’re better off without him.” We all got unfathomably drunk, sang karaoke, glasses were shattered, the bride hit on literally every man there including me (though no one took her up on it, that would have been weird).  There were a rough few months in store for her afterward, but that ended up being a hell of a party. I can still feel the hangover a decade later.",
   "created_utc": 1698938345,
   "score": 19,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7idbmu",
   "message": "I was a bridesmaid in my brother's wedding. Day of the wedding we are all getting ready as you normally would. I'm in the bridal suite area; everything is going fantastically. The church is filled to capacity with guests. We all walk down the aisle and take our places, bridesmaids and groomsmen alike. My soon-to-be SIL is walking down the aisle on her father's arm. My brother is nowhere in sight. There is a long, awkward pause as my SIL is standing in front of a packed church, and we are all just looking at each other. Everyone is assuming the worst that my brother has skipped out at the altar and left her. I'm shout whispering to the Best Man \"where is he\" he says \"IDK\". My mom is nearly having a heart attack. My dad finally gets up goes to the room where my bro was supposed to be waiting and comes out with my brother. My brother says \"Where's the minister, I was waiting on him\". My bro hadn't left at all, the minister was a no-show! He was supposed to be waiting with my bro and walk out with him, or tell him when it was time to walk out while groomsmen were lining up to escort bridesmaids down the aisle. Because no one had checked in on my bro after getting ready no one knew the minister wasn't there. \n\nAt this point, we are all standing in a group at the front of the church; the majority of the church guests still don't know what is going on, just that my bro had to be summoned, and there are angry looks all around. My dad realizes he needs to let them in on what's going on, so he announces to the guests, \"We can't find the pastor, is anyone here licensed?\" of course no one is. The bride's father calls the minister on his cell phone, on speaker so the whole church can hear the conversation. \"Hi Pastor Denny, where are you? Did you forget what today was? Yes Denny, the wedding. The wedding is right now. We are all waiting on you at the church. Ok we'll just wait here then\". Turns out the pastor was playing golf and had put the wedding date down as the following weekend in his planner. I then ask my soon-to-be SIL if she wants us to walk back down the aisle and come back in or what. She says at this point forget it we are all here so we just stand around and wait for Pastor Denny and try to make jokes with the wedding guests but it's pretty awkward as no one really knows what to do. After about 15 minutes Pastor Denny comes running into the church in his golf clothes - polo shirt/funny shorts etc - apologizes and goes immediately into the vows. My poor SIL was furious that day, first thinking my bro had ditched her at the altar then at the fact that the minister had ditched them. LOL. She laughs about it now but it was a tense ceremony.",
   "created_utc": 1698934829,
   "score": 226,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ibwbe",
   "message": "Went to the wedding of one of my husbands close friends and everything was going wonderful until about 3 hours in when the brides grandma becomes unresponsive. We were sitting right next to that table when she falls to the floor not breathing. Our other friend (an EMT) ended up performing CPR on her until the paramedics came. He said he felt her ribs cracking under his hands. The wedding promptly ended as the bride and groom go to the hospital with grandma. She passed away in the hospital that night after an emergency surgery.",
   "created_utc": 1698934277,
   "score": 216,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i87zd",
   "message": "I wasn’t technically in attendance, and this is definitely not as “botched” as some of these other stories in the comments, but I used to have a friend who owned a small hotel which operated primarily as a wedding venue. They lived in one of the hotel rooms, so all of the events taking place in the courtyard directly outside their door could be heard very clearly. \nWe were hanging out one night during a wedding and listening to the speeches, the most notable of which was the best man speech during which he told the story of having a threesome with both the bride and groom at burning man, and heavily alluded to still being in love with the groom. Lots of older relatives in attendance. The place went silent and the wedding ended about two hours early.",
   "created_utc": 1698932821,
   "score": 30,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7id9sy",
   "message": "I attended an outdoor wedding. In December. All the guests assumed there would be shelter/heating but nope - nothing was provided.\n\nAll us guests were freezing cold. Some got drunk as fast as they could and others kept asking the staff for cups of tea, not to drink but to hold the warm cups.\n\nIt was awful.",
   "created_utc": 1698934809,
   "score": 96,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7imh1n",
   "message": "I was the photographer.\n\nThe bride was very close to her stepfather, and her father had not been in the picture for a lot of her life, but he was invited to the wedding and they did two father-daughter dances so he wasn't left out or anything. \n\nHe was also supposed to pay for part of the photos, and he just showed up with no money. He eventually got mad, like she was doing something wrong by including the stepdad, who raised her and paid for most of the wedding (and for that matter, her upbringin). She spent like an hour crying in the back and eventually an uncle offered to pay for some of what the dad owed.\n\nI knocked off $100 and stayed an extra hour for free so we could get all the photos we would have done during that hour, but it was obviously not the same for her. \n\nThen the dad spent weeks harassing me to send him the photos I took because she wouldn't send them to him. (I didn't, obviously).",
   "created_utc": 1698938272,
   "score": 18,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ifwpo",
   "message": "My wife and I watched in horror as the wedding planner proceeded to get very sloppily drunk and exceedingly outlandish behavior. It came crashing to an end when she started dancing/grinding on the father of the bride with his wife and the bride a few feet away staring in shock. Lots of shouting and then the groomsmen not so kindly escorted her out.",
   "created_utc": 1698935817,
   "score": 140,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7j30yb",
   "message": "It wasn’t a botched wedding, but definitely eventful. The best man choked on a piece of steak. I didn’t see it happen but I guess someone performed the Heimlich. It came out, anyway. They called an ambulance (you always should go to hospital! Even if obstruction is removed) and he left. Another groomsman did an impromptu speech, which was brave of him. He started off with “I guess (best man) bit off more than he could chew with that role..”",
   "created_utc": 1698944285,
   "score": 200,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iu8e2",
   "message": "My wedding had one thing happen that was more odd, than botched. \n\nWe booked the wedding night at suite at a super-swanky hotel in a former gold coast mansion. This hotel also did weddings. Part of the deal was that my new wife could not show up in her wedding dress while another wedding was going on. Which was fine, by that point we had been to the after party and were back in street clothes anyway. \n\nSo we show up and check in. Then it turns out that not only would they not allow the wedding dress thing, but they would not allow us to cross through the lobby or any of the public areas of the hotel. They showed us to our room through the steam tunnels under the building. \n\nMy parents and their friends dropped us off, so picture me, my dad, and my dad's buddy walking around utterly fascinated by the behind-the-scenes architecture, while my mom and her friend were mortified. \n\nDad: \"Alan, are you seeing this? Look at how they rerouted the heating system!\" \n\nMom: *face like a slapped ass*.\n\nThe next day we were supposed to have breakfast in the swanky dining room, but they called up and let us know that it had been reserved for the people with the event the night before and could they bring service to our room? That seemed more appealing to us anyway, so we just asked for some fruit and toast. My wife wasn't going to be getting out of the giant soaking bath anytime soon.\n\nI think they flagged us as potentially unhappy campers because several employees showed up with multiple carts of food including an entire loaf of toast, an enormous fruit basket, giant press of coffee, basket*s* of muffins, basket*s* of pastry . . . We ran out of places to park it all.",
   "created_utc": 1698941107,
   "score": 163,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iowdx",
   "message": "The Bride said NO at the altar. Literally walked back down the aisle and out the door. The groom stood for a moment and then went to a side room. The minister followed the groom, then came back and said that while the wedding was off, the reception would go forward since the food was already there. Awkward reception and nobody stayed long after eating",
   "created_utc": 1698939170,
   "score": 158,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ida3w",
   "message": "The bride was dead set on wearing not one but two designer gowns. To finance all of that there was no heating at the lovely February wedding. They also provided only food and cake for a third of the guests. the food itself was two small patties, white sauce, about 100gr ( 3oz) of cooked chicken. But she did love both her dresses.",
   "created_utc": 1698934813,
   "score": 12,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7id9cy",
   "message": "Well, I see a few others have told some awful tales, so I'll add mine. My first job at 15 was a banquet server. We had weddings most every weekend, so I've seen quite a few. \n\nThe most memorable was a wedding between two fire fighters that met on the job. Seemed like a normal wedding until just after the father-daughter dance. The bride's father collapsed. The staff went running in to the ballroom because of the noise. Immediately, on call EMTs that were in attendance were giving CPR and other life saving measures. I distinctly remember a massive needle being put into the man. He was dead on the spot, but they waited until he was out of the venue to call the death, for obvious reasons 😭. It was truly awful and the grand kids were hysterical. The bride was a total wreck. Everyone left shortly after. Even the staff were upset and had a hard time finishing work that day. It was truly terrible. I felt awful for the family and especially the bride.",
   "created_utc": 1698934805,
   "score": 176,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ig5gu",
   "message": "Idk if I'd call it \"botched\" per se because it was elegant and fun for the majority of it, but I attended a wedding where they held the ceremony and reception at this renovated historic house. During the reception though, police were called because apparently the \"venue\" wasn't actually permitted to be a business. It was just some people's house that they kept renting out to weddings to the immense annoyance of their neighbors (and subsequently the police). One of the house owners actually ended up being arrested because they had already been given a \"last warning\" at the previous wedding the weekend before, and the dude was getting belligerent. Most of the reception was done by that point anyway, but it sure was chaotic as we were all shooed out, trying to call like 50 Ubers while the cops made sure we left.",
   "created_utc": 1698935909,
   "score": 24,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ivy6u",
   "message": "The bride was getting dressed in the suite. All the girls in the wedding party were in there. I was a bridesmaid.\n\nNow it’s like a thing us watching as the bride gets dressed. Normally she comes out in her lingerie and we help her out on the dress. That happened. The brides future mother in law was helping her get the dress on. The mother in law pinched the brides butt. Bride told her to stop. Then the mother in law apparently (I didn’t see) tried to stick her finger in the brides butt. The bride slapped her in the face and a fight started.\n\nThe wedding was ruined before it even started.",
   "created_utc": 1698941733,
   "score": 87,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7im3w3",
   "message": "The photographer at my wedding got absolutely shit faced and puked all over. Ended up passing out by the bathrooms. You can see in the pictures how the drunkenness progressed.",
   "created_utc": 1698938136,
   "score": 70,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i9oo9",
   "message": "Not really the wedding itself per se, but the bride and groom hired a driver and a bus to transport the entire wedding party and a few guests from the wedding venue back to the hotel after the reception. Turns out the driver sat outside in the bus drinking beers the entire time the wedding was going on and then was too drunk to drive everyone to the hotel. We all had to take turns hiring the same Uber driver to take us back and forth because the wedding was in the middle of nowhere and there was only one Uber driver available. Wedding reception ended at midnight and some guests didn't make it back to the hotel until 6am.",
   "created_utc": 1698933412,
   "score": 53,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iiudj",
   "message": "[deleted]",
   "created_utc": 1698936914,
   "score": 15,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iaia0",
   "message": "I find it astonishing that so many of these stories mention no RSVPS. Would it not be clearly requested in the invitations? Especially for a catered event like a wedding!",
   "created_utc": 1698933739,
   "score": 24,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i9391",
   "message": "We went to a wedding that they just chose a spot they liked to have the wedding. It was someone's front porch that had a river. Set up the chairs and the the water level rose and the chairs had to be moved. Halfway through the ceremony the person who owned the house opened the front door (they were literally doing the ceremony on the front door, the door basically hit them) and asked what was going on. They explained it to him and luckily he was cool with it but told them to be respectful, because his wife was breastfeeding inside.\n\nTo add, when the guy came out we hustled through the event and sent the groom and bride away while we packed up FAST. As we were the police came but didn't give us a hard time because we were already leaving. There were snakes chilling by the edge of the river too, which was cool.",
   "created_utc": 1698933174,
   "score": 32,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iwv7p",
   "message": "Went to a Pig Roast wedding in a rural setting, 120 people, huge field, right by the river.\n\nI looked at the one pig roasting and thought to myself \"They must have the other pigs roasting elsewhere to keep the smoke down\" - NOPE only one pig for 120 people. \n\nWe were the first table to line up after the head table - and the pig was already 1/3 gone - they ran out at about table 5 of 20 tables.\n\nI ate then sat back an watched the fallout. One of the grooms men was my good friend and I casually said \"Should throw the groom in the river for this kind of fuck up\". \n\nGroom was promptly thrown in the river - that kinda thing happens when people drink on empty stomachs.",
   "created_utc": 1698942064,
   "score": 242,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iogao",
   "message": "I didn’t get to see it but my parents went to a wedding where the bride walked up the aisle, stood up front and calmly thanked her parents, his parents, and everyone for coming. Then thanked her maid of honor for sleeping with her fiancé last night. She then walked out of the church. My parents said some went to the reception because the parents of the bride and groom felt bad and wanted the people to at least eat. My parents just came home.",
   "created_utc": 1698939004,
   "score": 224,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iue4t",
   "message": "1. The ring bearer threw up at the alter during the vows. 2. The best man’s wife went into labor between the ceremony and the reception. 3. The bride’s brother shot off fireworks horizontally instead of vertically and set the bride’s dress on fire. \nAll in the same wedding.",
   "created_utc": 1698941165,
   "score": 222,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7igjkj",
   "message": "His father had received a terminal cancer diagnosis and had been fighting the disease up to my friend's wedding. And while he hoped to be well enough to attend, it was touch and go whether he would be well enough. In the end, he was too sick.\n\nMy acquaintance was told that his father had recently passed away as soon as we arrived at the wedding reception. It was disastrous.",
   "created_utc": 1698936053,
   "score": 146,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ikjc9",
   "message": "A former co-worker’s wedding. Right when everyone has eaten and started to dance, the bride and groom turn off the music, turn up the lights, and tell all the guests they are leaving and the venue needs to be cleaned up by the time their rental period ends… which is in ~20 mins. Guests had no idea. Bride and groom take off, and we’re all left to fold chairs, collect dishes and take them to the kitchen, gather linens, etc. Then we all just mosey off into the night.",
   "created_utc": 1698937551,
   "score": 40,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ia3pv",
   "message": "I have a low-stakes one where no one died, unlike some of the horrors in this thread.\n\nThe bride was almost an hour late coming out to her own wedding. It was 40+ degrees Celsius and the wedding was outside. After the bridesmaids walked down the aisle, it started raining lightly. The bride wouldn't come out so we all relocated to the rain venue, which wasn't prepared so we all stood and some people were in the aisle and had to squish out of the way when the bride came down. None of that would have happened if she'd been on time because the weather was sunny and clear up to that point.\n\nThen, during the ceremony, after the groom read his vows, he ripped up his bride's vows. She has some learning disabilities and sort of sputtered through what she had wanted to say. It was hard to understand and I felt so bad for her.",
   "created_utc": 1698933579,
   "score": 75,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ir7ac",
   "message": "Posted this before...  \nWent to a wedding that my wife and I said will not last more than two years. The wedding was in the backyard of the bride’s house. They had all the chairs and wedding \"arch\" setup outside. They setup a plastic tarp running down the aisle to walk on. Just before the wedding starts, there are darkening clouds appearing. Should have been a sign to move the wedding inside, but they invited too many people to the damn thing.  \nJust as they start the wedding, it begins to rain lightly. The father of the bride is walking the bride down the lane and slips on the wet tarp and falls on his ass. Bride is now at the front, raining harder. People start to cover up with whatever they have. Some people start to get up too. Bride turns around and says to all, THIS IS MY WEDDING, NO ONE IS GOING TO RUIN IT, YOU BETTER ALL FUCKING SIT YOUR ASSES DOWN!  \nWe all sit back down and the wedding resumes. It is now raining pretty good. The grass is now turning into mud. A few ladies in the crowd and the bridesmaid’s makeup is now running down the faces. My wife has taken my jacket as a cover from the rain. They finish the vows and kiss, and then everyone runs to the house and garage to get out of the rain. Oh, remember how I said the grass was now mud? Yea, lots of people slipped and fell in the mud on the way to the house.  \nWe got to the house, many people look terrible from the running makeup, muddy clothing, and soaking wet. A few of the women had to cover their chests and waists due to wet clothing becoming see-thru. Most of the men were loaning their coats to the ladies to cover up. Dirty looks all around.  \nThe wedding cake was outside, and now brought in. The rain made the decorations on the cake turn all runny and it looks horrible. The bride and groom began to cut the cake and feed each other. The smashed the cake pieces into each other’s faces....then began a food fight with each other. My friend’s wife got hit in the face with purple icing cake on her face and dress. The priest got hit with and yellow icing on his white robe. There was nothing left of the cake to serve.  \nFood being served was still frozen in the middle of the food and the stuff that was not frozen, was burned. The desert was supped to be the cake, but as said above, there was nothing left. There was a goody bag that people got on the way out. Had a lollipop, a coupon for ice cream cone at McDonald's, a pencil with the bride and groom name on it, and Halloween size M\u0026amp;Ms.  \nMy wife, whose dress was filthy, her makeup was out of whack, and her hair was a mess, said to me that she does not want to see those people again for 6 months she was so mad. The couple divorced 11 months later when the groom came home from work and found his wife getting double teamed by two guys.",
   "created_utc": 1698940015,
   "score": 136,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i9vdx",
   "message": "It was my own wedding. We got married at 19 and planned the whole thing in like... less than a month. Because for some reason despite already having been together for 5 years at that point, we were like \"we have to get married NOW\" and I truly do not know why. It wasn't even like a religious thing, neither of us are religious, just a dumb teenage brain moment I guess.\n\nAnyway, top awful moments:\n\n\\- Everyone got food poisoning from our cheap cake. Literally everyone. We spent our honeymoon in bed throwing up. I got calls all day from people telling me they were also throwing up. We were too sick to drive home so my brand new brother in law, who had skipped the cake, had to drive several hours to come rescue us from a hotel and take us back home. Truly a nightmare.\n\n\\- Our pictures were all taken by a circa 2012 cell phone and look as terrible as you can imagine, the props were homemade and one was misspelled it was supposed to say \"happily ever after\" but our friend left out the i so it said happly ever after. The shitty cell phone picture of us holding that prop got shared to a wedding shaming group by a guest.\n\n\\- Did not take the time to reserve an actual venue for the reception so we had to do it outside at a campground shelter house because that was all I could manage to book in time. My dress got SOAKED in mud up to the knees.\n\n\\- Did not want to pay a DJ so I had my brother play songs off my phone through a blue tooth speaker, he did not pay attention to the timing during the half assed rehearsal and messed up the bridal entry song and just played some random song from my phone and then abruptly shut it off so there was no bridal entry song.\n\n\\- My mom, who is a raging narcissist, showed up in a neck and back brace and arm sling. She was not injured in any way whatsoever she just wanted more attention than me.\n\n\\- His suit and my dress were both just cheapo off the rack from a big name bridal store that we got at some big sale for like $200 total for both and had zero alterations done so they did not fit right.\n\n\\- Did not want to pay for catering so my father-in-law just made a big pot of chili to serve everyone\n\n\\- Got to my own wedding late because my maid of honor forgot to bring shoes (?) so we had to frantically run to a store and buy shoes for her after our hair appointment and the person in front of us in line was buying a ton of stuff, I was too shy to ask if we could get in front of her and buy our one pair of shoes and go. I also then had to drive back to my apartment, rush to put my dress on, cram myself into my car and drive to the venue.\n\n\\- Left our own wedding early in our suit and dress and got milkshakes at Denny's because we were over the whole wedding thing.\n\nIt was an absolute disaster of a wedding, but we're still married, very happily, 10 years later. We have two kids and a third on the way, we're very literally best friends and we look back on our wedding and we can laugh at it now but we're planning on redoing it at some point because holy hell it was a nightmare, and we aren't broke teenagers anymore.",
   "created_utc": 1698933486,
   "score": 38,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ioy5c",
   "message": "The venue was lovely \u0026amp; the people were too, but the caterer ran out of food after serving about 1/3 of the guests in line for this tiny buffet table. I was watching guests \"filling\" their dinner plates with like 4 bites of food to keep it from running completely empty for the next person.\n\nI stood near the kitchen entrance \u0026amp; watched the shit show happening in the other room as they couldn't get it together at all.\n\n...also the bride chose messy spaghetti \u0026amp; meatballs as the only entree for a very formal dress wedding \u0026amp; no gluten free food option at all despite knowing there were several in attendance with gluten intolerances...including her close friend/my wife.\n\nThen everyone got shitfaced \u0026amp; we bailed early to race towards any place that might have food to eat.\n\nEDIT: They also rented chairs that were so cheap \u0026amp; thin they must've had a weight tolerance of 125lb. Tons of people half-squatted throughout the ceremony to prevent them breaking. I'm a large man, so I stood instead of risking it since my wife was worried about herself the moment she tried sitting normally. Never seen someone turn a wedding into leg day.",
   "created_utc": 1698939188,
   "score": 195,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i85um",
   "message": "The lights came up after dinner and the groom said “we’re not dancing people so just mingle” and everyone left.",
   "created_utc": 1698932798,
   "score": 65,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7irv4d",
   "message": "The bride's sister got plastered at the reception and fell off a second floor deck right into a row of box hedges, which is exactly where she stayed for the entire reception.  No one helped her out of the shrubbery.  I don't recall anyone even checking to make sure she was okay.",
   "created_utc": 1698940256,
   "score": 174,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ij5ts",
   "message": "All the wedding guests are gathered outside this little wedding chapel in the mountains. There's another wedding in progress so we had a few minutes to mingle. Then we saw the smoke. The little chapel was on fire! Everyone got out in time but apparently some candles got out of control and the chapel burned to the ground. As we watched all of this happen the father of the bride-to-be announced loudly, \"Well if that isnt a sign, I dont know what is\"! We all just turned and looked at him incredulously. They got married a couple hours later at another small chapel and they're still married today.",
   "created_utc": 1698937034,
   "score": 232,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ilmls",
   "message": "We had an older gentleman pass out at our wedding, it was on a boat and a few beers mixed with the boat rocking made us have to dock.  After he left in the ambulance and we sailed back out, the DJ (not sure if he’s aware he did this) played “I will Survive.”",
   "created_utc": 1698937957,
   "score": 74,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ilhou",
   "message": "At my in-laws wedding. It was not until the actual ceremony, the groom standing at the alter, the bride in arm with her father… \nthey then realized that the officiant had not shown up.\nTurns out he forgot about the wedding and had gone fishing with his son.",
   "created_utc": 1698937906,
   "score": 158,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7i6orp",
   "message": "a former friend of mine (35ish yo at the time) decided he was having a wedding one day.  \n\nhe is a pretty hard drunk but he still found a woman who loves him. they decided to rent a hall and get the thing together, blocked out a wing of a hotel...\n\nno one in my family was invited because we all knew what was going to happen.\n\nthe night before-into-morning of the wedding the guy gets shit faced.  everyone has left the bachelor's suite and all of the guests and family are kind of milling about in their rooms and the common areas.  \n\nthere is still a few hours so maybe the dude will pull it together.  the whole place is decked out for the reception, the church is ready...\n\nas the time ticks down one of the dude's last remaining 'friends' goes up to the room to see if there is any hope and walks in to see the guy holding his (the last friend's) son up in the air by the collar of his shirt with his fist cocked back about to punch the kid in the face.  \n\nshit popped off!!!  i do not believe that anyone went to jail but there was definitely some cash paid out in rebuilding and cleaning.\n\ni guess the kid (15ish) had gone to check on the dude and when he got there dude was out of whiskey and smokes and demanded the kid find him some.  the kid did a solid and looked around the room and said there was nothing left and dude told him to go find some and the kid refused.  that was when he got snatched up and then, luckily, his dad walked in the room.\n\nthe dude lived in my bedroom for a summer 15 years ago and when we moved back home we tried to be friends still but he had already gone too far.  \n\nhe called me wasted one day and demanded i take him to go get into a physical altercation with someone over something i had no clue about.  when i laughed at him and said no he threatened to come and harm me.  \n\njust after lockdown started he showed up at my house with the sniffles.  we took lockdown very seriously and neither of us should have touched him but as he was leaving he came and asked for a hug and when i got close to him he purposely coughed on me.  i was pissed and went to wash up. while i was washing up and before i could tell my wife what he did, he found her and did the same thing.  \n\nwe were both sick the next day.  \n\ni had him trespassed from my property and we have not spoken since.",
   "created_utc": 1698932189,
   "score": 231,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7il5qb",
   "message": "[deleted]",
   "created_utc": 1698937782,
   "score": 146,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iotoy",
   "message": "My cousin’s wedding — the groomsmen decided it would be fun to share a flask with the minister before the ceremony. They were drinking and laughing in the stairwell near the altar. I’m not sure if it was nerves or the alcohol, but the minister messed up part of the vows and said some things that made no sense. Cousin and bride got through the ceremony and on to the reception at 5pm, which had live music, an open bar, and NO food other than some fancy candied almonds in the party favors and wedding cake. Apparently the bride didn’t want them to pay for food because she wanted to spend their money on the string quartet. \n\nMany of us left the party around 6:30 because we were hungry and the older generation was sloshed. Fortunately, my aunt had made a huge feast for everyone the night before for the rehearsal dinner, so we all went back to their place and ate leftovers.",
   "created_utc": 1698939143,
   "score": 147,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7j8b9r",
   "message": "Grad school friend got engaged early in grad school.  Her fiance spent the next two years creepily hitting on half the women in our class. Parties, happy hours, dinners.... no attractive female was safe from her sketchy fiance in any situation. He even tried to hit on my girlfriend's mother one time.  Red flag #1.\n\nThey planned to get married in a different state about four months after graduation. Friend moved there to start work soon after graduation,  but fiance said he wanted to stay behind in their grad school apartment for a few more months due to \"work.\" He was a trainer at a gym.  Red flag #2.\n\nShe moved, started her new job,  and continued planning the wedding. Invites went out to classmates far and wide. Everyone booked flights and hotel rooms for a fall wedding. Meanwhile, sketchy fiance stayed behind in the apartment that she was still paying for.  Over the course of the next few months,  he got a huge crucifix tatooed across his back, shoulder to shoulder, neck to waist. I believe she paid for the tat. Remember, she was now working in a graduate professional field and he was a personal trainer at a gym.  He also demanded that she purchase (not rent) a $3,000 tuxedo for him to wear at the wedding.  Red flags #3 and #4.\n\nI'm probably forgetting a few other red flags, but the long and short of it is that, a week before everyone was supposed to fly in from near and far, throughout the country, we all received an email from the maid of honor announcing that the wedding was canceled.\n\nA group of about 10 of us with nonrefundable airfare and hotel rooms decided to make the trip anyway.  The MoH said our friend would love to see us.  So we went, partly so that our preplanned trips didn't go to waste,  partly to comfort our presumably distraught friend.\n\nWe all arrived on different flights on Friday afternoon and met at our friend's house around dinner time.  It was incredibly sad and awkward. The house was packed floor to rafters with decorations, placesettings, tables, folding chairs, and food for a 200-person wedding reception.  Our friend greeted us at the door with a huge smile and whisked us inside, hurriedly past her parents and a dozen other morose relatives who seemed to be drinking themselves into oblivion in the living room. She ushered us into a back room,  closed the door, and quickly explained:\n\n1. Her fiance had been banging a 20 year old girl from his gym.\n\n2. Our friend had been willing to try to \"work things out,\" but he was not apologetic.\n\n3. The night before--less than 24 hours before we had arrived, and just a few days after creepy fiance had revealed everything, passively aggressively aborting the wedding--our friend went to a work happy hour, met a guy at a bar, brought him back to her office,  and had sex with him on her desk. This happened 48 hours before she was supposed to have gotten married.\n\n4. Said guy was on his way to her house at that very moment to join all of us for a fun night out on the town. \n\n5. He did not know that she had been engaged and we were not to mention it.",
   "created_utc": 1698946199,
   "score": 148,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7irx38",
   "message": "Was bartending a wedding when a drunken guest snuck behind the bar and rubbed his junk on me.  The hotel manager threw him out the door Jazz-style, but the bride felt so bad and guilty all night.  There was NO AMOUNT of reassurance I could give her to take it off her mind, and I felt just as terrible.  Like girl, this has  nothing to do with you, go enjoy your wedding, we’ve taken care of it.  She still kept coming to apologise to me.  Her party was ruined in her head by some jerk cousin.",
   "created_utc": 1698940275,
   "score": 144,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ic0kx",
   "message": "My bestie attended my ex's wedding (they're in the same friend group). In my country we treat family well, but the guy's now wife decided the wedding would be \"like a gala\" with no chairs, only a few high tables, \"so that the old people can leave early and then we can serve finger food at midnight to our friends\". I'm pretty sure that's not what a gala is, but anyway. \n\nMy bestie said it was horrendous to see elderly family members in clear discomfort, and that the reheated finger food catering wasn't nearly enough for the ravenous guests who stayed late. Her stomach and feet were killing her the next day.",
   "created_utc": 1698934322,
   "score": 136,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iptu2",
   "message": "My cousin’s wedding: the groom was trying to get his catering business off the ground so he “catered” his own wedding which meant he was in the kitchen cooking during the reception. It was so weird. The food kept coming out in waves and they ran out before our table was ever served. We left early and went to McDonalds! LOL",
   "created_utc": 1698939515,
   "score": 125,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iiqk0",
   "message": "The wedding went OK, but the reception was a mess\n\nFirstly it was a hot summer, everyone turned up to find that they couldn't go inside. \nIt went on for some time, some of the more elderly guests had to leave, as there was no shade or anywhere to sit.\n\nThey ran out of welcoming drinks very quickly, less than half of the guests had anything. The kods had nothing at all. Again, really hot day.\n\nThe venue was lovely, but clearly not cleaned.it was grubby and had ants everywhere. They were still sweeping as we sat down.\n\nThe food was terrible, the starter was a few leaves and no dressing. The main was wrong completely, and no dietary options turned up. The dessert was burnt.\n\nThe cake got infested with ants, only those who didn't notice ended up eating it. \n\nThe entertainment was a disco, but only half stayed.",
   "created_utc": 1698936875,
   "score": 243,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iiu85",
   "message": "Bride and groom had a typical wedding rehearsal the night before at a golf course/resort (same place everyone was staying that night, and the following night after the wedding). It went great, and after it was all done the wedding party celebrated with dinner and drinks, after that they all decided to cruise around the grounds via golf cart. They took a turn to sharp, bride fell off the golf cart, hit her head and died. It was very traumatizing.",
   "created_utc": 1698936913,
   "score": 24,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ipzme",
   "message": "My own wedding!\n\nI wanted a small beach wedding. My husband's father offered to pay for it (well, the reception and the cake), and he lives in a beach town, so we did it there. The first night there, my maid of honor and her husband went for a walk on the beach. Her husband got a small cut from a seashell on his foot. The next day he was extremely sick, so she took him to the hospital. He got MRSA from the cut and had to be in the hospital for 2 weeks. \n\n2nd night, got evacuated from our hotel in the middle of the night. Someone a few floors up decided to hang their wet bathing suits on the fire sprinklers in their room. It set off the sprinklers and flooded the entire floor and the 2 floors beneath. \n\nThen it's the day of the wedding. The actual ceremony went well. The reception though. Ugh. It was time for the mother/son, father/daughter dance. My husband was dancing with his mom, I was dancing with my brother since my father wasn't talking to me at the time. They called my brother to come up, and he begrudgingly came up. As soon as we start dancing he tells me, \"you disrespected my family. I'd rather be anywhere else right now.\" As to why he did that... we had a head table. I gave my husband's father the list of people who would be there (it was only about 40 people) and him and his girlfriend at the time did the seating and decorated as a surprise. The head table had me, my husband, his 2 groomsmen, and my 2 bridesmaids. Well, my brother's daughter (my niece) also walked down the aisle with my son. Neither my son or my niece had a space at the head table. My brother found it disrespectful that my niece wasn't seated at the head table and it pissed him off.\n\nI immediately go into the bathroom and start crying. My bridesmaids and my husband's mom follow me in there. Then my brother barges in, \"fuck you people! You all don't know shit! She disrespected my family and it's fucking bullshit!\" And storms out. \n\nWhen he storms out, my husband goes to confront him and my brother is like, \"hit me! You think you're a big guy?! Hit me! Do it!!\" But they were pulled apart before anything could happen. My brother then gets in his car and drives off for 10 minutes. I'm crying, my niece is crying, even my husband's brother is crying because he felt bad for me. \n\nEventually my brother comes back, and sends his wife to get me saying he wants to talk. He apologizes and starts crying too. We talk it out for a bit and go back inside. Now the whole vibe is awkward as shit. I tried to have fun, but it put a damper on the whole evening. Didn't eat any food, didn't get to eat any of my wedding cake. We even got cupcakes to freeze for our 1 year anniversary... but someone ended up eating those. \n\nWhen it came time to leave, my husband's brother was supposed to drive us back to the hotel. We couldn't find him at the end of the night, and he wasn't answering his phone, so we ended up getting a ride from my husband's dad's friend who we barely knew. \n\nMy husband's dad and his gf said they would clean up and bring us our decorations and guest book and all that the next day. Well, that night, his dad and his gf ended up getting into a fight and broke up. And she had all of our wedding stuff at her place. So then we had to have an awkward encounter with her to get our stuff back. \n\nThe whole wedding was a clusterfuck, but we are still married 6 years later!\n\nEdit: if anyone wants to get married, either go to the courthouse or go to Vegas and elope. So much less of a headache.",
   "created_utc": 1698939574,
   "score": 23,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ipsis",
   "message": "I don't know. I had a grandmal seizure during the vows. My first one. When i woke up people tried it to play it down but im pretty sure that I stopped the ceremony. \n\nWent straight to the hospital. No party for me.\n\nEdit: Spelling",
   "created_utc": 1698939502,
   "score": 110,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7j4auw",
   "message": "Story from a few years back (+10 years or so), not sure if this counts as 'botched' or not, but here's the story:\n\nMy cousin was getting married, and my gf (now wife) and I went to the wedding ceremony and reception.  It was an Italian wedding (in Toronto, Canada), which typically is an elaborate/expensive affair, with a 5 course meal, fancy chairs and linens, up-lighting, etc., and this wedding had a guest list of 250-300 people.\n\nSomething was off about the day:\n\n1. Bride and the Groom were not happy/smiling\n2. Speeches were short\n3. Families didn't mingle\n4. No father/daughter nor mother/son dance\n5. Other factors, but just a general awkward experience overall\n\nMy gf and I left thinking WTF was that, but whatever, it is what it is. We had given them a generous gift (the \"busta\" with cash),  honoured the family commitments by showing up, and we had thought that was that.\n\n1 month later we learn from the extended family that the marriage was annulled the very next day, as the Bride cheated on the Groom (he found out ahead of the wedding), and they went through with the ceremony/reception because everything already paid already. All gifts were kept by the Bride and Groom.\n\nIt felt like a great big F.U. to all family and friends!",
   "created_utc": 1698944753,
   "score": 110,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ilwqr",
   "message": "Groom was caught in parking lot with maid of honor during the reception, lots of screaming and throwing things.",
   "created_utc": 1698938062,
   "score": 97,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7itubk",
   "message": "I went to a wedding where the caterers ran out of food and two tables (including mine) didn’t get fed. This was after a 3-hour long cocktail “hour” where there was nothing but boozy cocktails. I can’t even describe how hangry I was and the caterers just kind of shrugged and said “sorry.”\n\nWe kept it a secret from the bride and groom so we wouldn’t ruin their day.  They didn’t find out until 3 years later when my husband accidentally let it slip when he was drunk. They were horrified but I’m definitely glad we didn’t tell them night-of. \n\nPro tip: if doing a wedding pasta bar with nothing else… make sure the caterers bring extra pasta.",
   "created_utc": 1698940964,
   "score": 95,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7j5fnf",
   "message": "I worked a wedding on patio at a beautiful outdoor historic venue. The bride had antique furniture and decor brought in. The venue suggested to her and her family to get a canopy in case of rain. She said no as they didn’t have canopies in the late 1800s. Well, her father surprised her the morning of the wedding, by having a large canopy set up anyway. She threw a fit. Canopy was quickly taken down. Dinner was buffet style with an elaborate cheese display, carving stations etc. Wedding was over 200 people. As the bride and groom entered the venue, a downpour! Heavy rains and thunderstorms. Staff had golf size umbrellas and the brides father hung out with me under mine telling me how she ruined her own wedding reception. I felt bad for the elderly as they had no where to go, just sat and was drenched.",
   "created_utc": 1698945165,
   "score": 94,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ihwvb",
   "message": "TL;DR: Self-cutting and violent assault on elderly father of the bride trying to help.\n\nA couple I knew went to the wedding of one of their good friends. Both of the women in this couple had alcohol and substance use issues. One had depression and one had anger issues. This is all relevant.\n\nDepressed one became a sad drunk that night, locked herself in a stall and stared cutting herself with a broken wine glass. Her angry girlfriend is frantically trying to get her to stop and come out. \n\nQuite a few people were gathered around trying to help and eventually the father of the bride came up and put his hand on my angry friend's shoulder to try to take over with reasoning with the depressed one.\n\nShe absolutely lost it and punched the elderly father of the bride, knocking out at least one tooth, sending him to the floor. People pulled her off of him and she said later that she just kind of lost it and didn't really remember anything after feeling a hand on her shoulder.\n\nShe ended up in lockup overnight, her girlfriend ended up in the ER and then under psychiatric observation (for less than a day), and the bride and the rest of that friend group never spoke to either again.\n\nI stuck a bit longer for some stupid reason, but dropped them both once I realized the woman I was dating was the one I was going to marry. I realized I dreaded the thought of them being there and didn't trust them. We were too close to excuse a non-invite, so I ended the friendships and blocked their phone numbers.",
   "created_utc": 1698936568,
   "score": 23,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ijt91",
   "message": "My 17 year old daughter works at a local wedding venue.   We look forward to her day after stores from wedding.  \n\nMost are just fine.   Some are bad.   A few go absolutely sideways.\n\nA few weeks ago she was at one in which the bride demanded the management tell the staff the refer to my daughter as a different name - because she had the same name.  \n\nThe manager, “sorry, no, I won’t use any other name than her real name.”",
   "created_utc": 1698937278,
   "score": 87,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iz533",
   "message": "Went to my a wedding this spring with my two good friends getting married. It was in a community hall that had a stage in it. During the speeches, the couple gets up on the stage to play a wedding game. \n\nGame finishes, and the couple goes backstage to use the stairs back down. Suddenly, there is a loud thud and sound of a broken glass. The groom, wearing formal shoes with a slick sole, slipped while walking down the stairs. While falling, he clutched the glass in his had, causing it to shatter. \n\nI went back stage to have a look. Blood everywhere. Turns out the groom cut his palm open and almost degloved a finger. \n\nAfter getting treated by a guest who was a nurse, the couple had to make their  way to the hospital. During this time was a fun 2 hour period of guests just hanging out and not really doing much. \n\nThe couple eventually comes back, they got to go ahead of the line at the hospital, I think the wedding outfits helped. The groom was only able to stay a bit longer, and had to go home. \n\nWe ended up having a good time regardless it but was such a shame. They got married 2 years prior and were waiting to have their reception once it was more safe from Covid.",
   "created_utc": 1698942884,
   "score": 94,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ikfv7",
   "message": "went to a wedding in florida. for context: grooms side was a bunch of loud drunks and the bride's father was a cop - multiple uniformed cops at the event and some as guests.\n\nI was dancing with my girlfriend and a few others and when we got back to the table her phone and another were gone. both cases were extremely unique (unlikely taken by accident). it started light enough: checked the table, under the table, around the food. then we chatted with the wedding planner, who was remarkably condescending, and she downplayed the issue and asked the event staff to keep an eye out. still no luck. then we had the singer of the band make an announcement to everyone to please keep an eye out. still nothing.\n\nwe were away from the table for maybe 10 minutes - it was certainly suspect. i went around to every table and asked if anyone had seen the phones and still no luck.\n\nfinal straw was to involve the uniformed officers after about an hour of searching on our own. they were extremely polite and professional, suggested we register the device ID as stolen so that it couldn't be pawned. after that, my girlfriend was very frustrated so we went back to the hotel to see if we could locate the phone on Find My iPhone from her ipad. lo and behold - the phone at the venue, moving around.\n\nwe got in the car and drove back and along the way got a call from her phone and it was some guy absolutely piss drunk, slurring his words. we tried to keep him on the phone but he eventually just hung up. when we got there, the father of the groom had the phone and claimed the drunk guy (an uncle) had \"found it on the floor.\" he absolutely did not, we searched the venue for the hour and were calling the phone incessantly.\n\nonce we got the phone, we left. good riddance. but we found out after we left that the police had approached the drunk uncle who \"found the phone\" and asked him to turn out his pockets and explain why he had the phones even after the announcements and other efforts were made. the grooms father (along with a few others drunks) intervened and got in the cop's face and started yelling at him along the lines of \"how dare you question my family!\" now keep in mind, the bride's father is a lifelong cop. so now it's grooms father against brides father and they start arguing - this argument grows and spills out onto the lawn of the venue. reception was ended as the families were screaming at each other and ultimately went their separate ways for the evening. they had a post-wedding brunch the next day that apparently went over fine so i guess all good for the cops and phone thieves.",
   "created_utc": 1698937516,
   "score": 62,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ir1uy",
   "message": "Our best man at our rehearsal dinner said he almost had to call the cops on someone erratically driving….it was my mother. She came with a black eye, those photos are fun to look back on. Wedding Day my sisters (bless their hearts hid this from me) did damage control after she fell down the stairs. Mom insisted on a plated dinner and she would pay. Venue food bill came and she ghosted all my calls. Husband and I had to use or cash gifts to pay so no honeymoon. I didn't talk with my mother for a LONG time after that. Funny thing, I do weddings now.",
   "created_utc": 1698939961,
   "score": 88,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7ihxt1",
   "message": "At a College friend’s wedding there was bad timing with wedding party pictures, and reception services, so we were all sitting in banquet hall for 2+ hours with no food or drinks (alcohol and not). Some people left, we found a nearby bar eventually. Then after we finally had food, the wedding party dances and speeches took an hour, so general guest dancing didn’t start until late in evening. My date and I did one dance and went home.",
   "created_utc": 1698936578,
   "score": 79,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7j2gu8",
   "message": "Mild story, but I still feel bad for the bride and groom who pretty much had their day mucked up because of it. \n\nWedding was supposed to start at 2:00, and while everyone else was ready the officiant was MIA and radio silent. No one has any clue where they are, if they got into a car accident, etc. etc. They weren’t answering texts or phone calls and no one else there could perform a marriage ceremony, so the atmosphere was really tense as the bride and groom are together trying to figure out what the fuck to do as everything had been paid for and rescheduling a wedding is hard to do. I *think* some people even had to leave early for work so they weren’t able to see the ceremony which did eventually happen- at 5:00. \n\nSo the officiant finally shows up three hours late with really no excuse/explanation, bringing their three young kids- who they hadn’t even ask if they could bring, I think the wedding was childfree- who all have a bag of McDonald’s food which instead of maybe waiting ten minutes or eating it at the reception hall, ate it noisily in the front row. I’m talking end of the cup slurping, wrapper crinkles throughout the ceremony/bride walking down the aisle, fighting over toys, interrupting the ceremony to get the officiant to open the toys, loud ass opened mouth chewing. Just *loud*. \n\nThey were also dipping their fingers into the cake frosting, so no one really had any cake. They were just incredibly unruly and the officiant didn’t try to wrangle them in nor did they apologize for being late, not responding, or bringing them. I think they ate the reception food/cake then left. \n\nIt genuinely felt like they got married by someone who didn’t think their marriage was going to last so while they technically did the job, it was so… careless? Like they couldn’t be bothered to respect that the wedding was important to the bride, groom, and their families/friends. It was shitty and by the end of it the bride and groom were just so incredibly stressed out and trying to figure out how to edit out the sounds of the kids eating during their vows.",
   "created_utc": 1698944085,
   "score": 79,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7jizem",
   "message": "The bride's ex came drunk/crying with a shotgun to stop the wedding. Very lucky that the groom's very, very sweet old auntie talked him to put it down and then he was tackled by a bunch of other family members. Wedding was postponed after the police arrived but the food was fucking amazing. They had a BBQ style buffet with unlimited brisket, bacon wrapped scallops and a open bar. 10/10 would risk my life again just to eat",
   "created_utc": 1698950039,
   "score": 79,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7iv9ac",
   "message": "I went to one that was canceled at the last minute. Like an hour before. I was all dressed and was doing my makeup when the front desk guy called all the rooms in the wedding block to tell them. I guess a lot of people just found out when they showed up for the ceremony. The couple did not break up and went on to elope a while later, but the bride couldn't handle the stress and was fighting with her parents about how everything was done their way, and just refused to go. Since everything was already paid for their parents said to go ahead and eat and party, but it had a weird atmosphere and everyone left early. I was annoyed because we flew out and spent like $2k to come, and if given the choice would have taken a vacation elsewhere.",
   "created_utc": 1698941478,
   "score": 72,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7j6gld",
   "message": "I attended a very odd wedding that I could only guess that nobody knew how to plan a wedding, and were given very little time to do it despite the fact the space was rented a year in advance (at least, according to the invites to those who got them).\n\nI was informed of the wedding a few days before: apparently my gf at the time knew about it, but said that she had \"completely forgotten\" until the week of, and only because she saw the bride (a former college friend) had posted on FB about how a lot of guests were \"unresponsive.\"  That was the first hint something was off: a lot of people didn't get the invitation.  And it turned out the invitation was slightly wrong: right venue, wrong room.  When we found the room, it was a function room in the lowest level of the hotel, about two levels below ground, next to the entrance to the parking garage elevators. Just a square function room of the hotel with nothing extra about it.  We got there about 30 minutes before the wedding was supposed to start, and everyone was still putting up decorations with tape and thumbtacks. It was very much like how one decorates a child's birthday party at a VFW, except with adult colors of beige, rose, and gold. Then we had to set up the chairs. There were 100 chairs, and maybe 50 participants. Everything felt last minute and unrehearsed. The bride and groom were helping set up, too. All of this looked like it could have also been done in someone's back yard or rec room, and not sure why a hotel function room was used at all.  maybe for parking?\n\nMany of the guests had mentioned that they only knew about the wedding this week, and some said that they got the first invitation, but heard nothing since then, and wondered if it the wedding was off.  There was scuttlebutt that the bride's younger sister had planned everything, and she was a known flake. \n\nThe ceremony was an hour late because various family were delayed for some random reason, including the preacher. The preacher apparently found out last minute that he was not ordained in the state (Virginia was weird about ordination rules), but the couple managed to get married that week at a local courthouse, so he was largely ceremonial by this point. Then the wedding got started, but the preacher had a soft voice, and people kept shouting, \"we can't hear you!\"  He was one of those people who didn't understand \"we can't hear you\" means to \"talk louder,\" so he'd just repeat himself in the same soft voice.  Thankfully, he was short, and the bride and groom had written their own vows.\n\nIt was at this time I learned they were both poly. I guess, nothing wrong with that, but it was a little surprising, and I got the impression the bride's parents did know or were in denial.  The father of the groom was slightly inebriated, and kept going \"WOO!\" at random points.  The various... other partners also had their vows.  I am sure this was ceremonial, because polygamy is technically illegal in Virginia, but I'm not a cop. \n\nThen the ceremony was over in about 15 minutes, and we were told food had been set up by the caterers on tables by the edge of the room. The cold food (sandwich wraps, mostly) had been delivered, but it was still wrapped up in cling wrap, and we had to help ourselves from foil trays.  There were no tables to sit at, just the chairs, and so we ate off paper plates on our laps. The wedding cake was a sheet cake, still in the Costco box.\n\nThen we were told we had to \"strike down\" because they only had the room for 2 hours. So we all pulled the decorations down, put it all in large trash bags, and that was the end.\n\nIt all felt so... last minute. My gf was in shock about it all, especially the poly part.",
   "created_utc": 1698945539,
   "score": 74,
   "submission_id": "17m1e5c"
  },
  {
   "comment_id": "k7klr93",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17m1e5c"
  }
 ]
}