{
 "submission_id": "17m2bn7",
 "title": "Doctors of Reddit - what is your craziest story where a patient present with mild symptoms thinking it was nothing and it turned out to be a serious life or death situation?",
 "selftext": "",
 "created_utc": 1698927954,
 "permalink": "/r/AskReddit/comments/17m2bn7/doctors_of_reddit_what_is_your_craziest_story/",
 "score": 86,
 "url": "https://www.reddit.com/r/AskReddit/comments/17m2bn7/doctors_of_reddit_what_is_your_craziest_story/",
 "comments": [
  {
   "comment_id": "k7j6cdo",
   "message": "My dad woke up with severe back pain one morning after not doing anything strenuous the weeks/days leading up to it. My mom flipped her shit and finally put her foot down that he had to go to the doctor after him putting off going to a doctor for years even for a routine check-up. \n\nThat appointment showed a broken rib from a huge tumor on his spine, along with tumors around his buttocks/pelvis and upper back. Diagnosed with stage 4 lung cancer. 5 years and 100 treatments later he’s still kicking it.",
   "created_utc": 1698945498,
   "score": 245,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7i7jl1",
   "message": "Saw a patient with minor cardiovascular symptoms and a slight pain in his upper back. The senior debated back and forth whether it would make sense to run a CT to rule out anything more serious. She finally decided to do it and it turned out he had a massive aortic dissection and was basically wheeled right into the OR",
   "created_utc": 1698932544,
   "score": 109,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iw2wd",
   "message": "A man came to the hospital because his wife always complained about his bad breath. Long story short, I met him because they consulted my department when the tissue biopsy came back as esophageal cancer.",
   "created_utc": 1698941781,
   "score": 19,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j4cml",
   "message": "Many years ago, when I was in my residence, a man entered ER with a hand in his forehead, walking by himself, asking for a doctor. \n\nYou can imagine my surprise when I said \"yes?\", to him removing his hand and showing his injury - a perforating hole from a bullet.\n\nHe was quickly moved to surgery after that. Later I found the bullet didn't reach the brain, it was well buried into the skull bone.",
   "created_utc": 1698944771,
   "score": 161,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7ix063",
   "message": "Im a dentist. New pt came in with what he thought was a mild ache in his teeth. Thought it was a toothache. Hadnt seen a dentist in years. \nTook a radiograph and the jaw bone around the teeth looked strange. Had him see an oral surgeon that day. Turned out was a very aggressive metastatic bone cancer and died a few weeks later",
   "created_utc": 1698942113,
   "score": 23,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j39b1",
   "message": "I’m a nurse, not a doctor, but we had a guy come in years ago asking for a medication to “help him stop sweating.” He said he had had a sore throat for about a week, went to a walk in clinic, was diagnosed with strep throat and put on antibiotics, but he was so sweaty and just wanted a break from it. He looked pale and was indeed sweaty, so we took him back and ran some blood tests. His white blood count was the highest I’ve ever seen and he was diagnosed with leukaemia. We sent him to another hospital for immediate treatment, but we were informed he died literally hours after arriving. Incredibly sad, I couldn’t believe it.",
   "created_utc": 1698944370,
   "score": 186,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iiez6",
   "message": "Patient’s wife called. Patient had a temperature of 98.6. No other symptoms. \n\nI explained that was a normal temperature but the wife said “that’s a fever for him.”  She said she felt like something was wrong, despite no other symptoms. \n\nI told her that I respect that and that if she feels something is wrong she should get him checked out in the ER. \n\nThe ER doctor called four hours later and said they did all they could do for him but he died of sepsis. He appeared to be normal when he got there but rapidly declined. \n\nThat gave me a new appreciation that we truly can’t evaluate someone thoroughly over a telephone.",
   "created_utc": 1698936756,
   "score": 204,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7ig197",
   "message": "Still in school and I was not present for this patient’s initial admission but rather her clinic follow up; however..\n\nPatient was healthy 50-something year old who had an extended nosebleed after a long hike. It wouldn’t stop so they went to ER to get it cauterized/impacted (happens all the time). Anyway, they did a CT scan as protocol and discovered she had a 20+ cm tumor on her uterus that was wrapping around her right kidney; she was immediately referred to a serious academic hospital and had a specialized oncology surgeon remove it.\n\nAmazingly? They got it completely removed without even having to damage the kidney. She had an amazing outcome and about a half a foot scar running around her abdomen from the surgery.\n\nEdit for clarification: I do not believe the CT scan was due to the nosebleed itself but rather I imagine as they looked further into her blood work and coagulation studies they found something that warranted further work up.",
   "created_utc": 1698935865,
   "score": 66,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iojav",
   "message": "PSA: Everyone who’s a hypochondriac stop reading this thread",
   "created_utc": 1698939035,
   "score": 191,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7it59h",
   "message": "Not a doctor but worked as a security supervisor at a hospital. \n\nMan and his wife came in. Man is feeling unwell thinks he has like a flu or a cold or something. I can't remember exactly what. Nothing serious but they don't have a family doctor, so they came to ER. \n\nMan gets in line for triage and his wife leaves to go park the car after dropping him off. \n\nLike I said I'm not a doctor but how it was explained to me was part of this mans digestive tract just... exploded? Because he sits down and within 30 seconds he's slouched over and dead.\n\nMy guards respond, realize he's not responding or breathing and pull him onto the floor and start doing compressions. EMS and nurses quickly join us from the back and rush him to a triage room but whatever happened wasn't recoverable. \n\nWife got back into the ER just expecting him to be hanging out in line. Instead are met with my guards telling her that her husband is dead in the back with staff trying to bring him back.\n\nLike I can't even imagine how that is from the wifes perspective. She leaves with her husband basically fine and wasn't gone for more than five minutes and comes back and he's just gone. \n\nI was on break at the time and missed the situation but had to come back and deal with some shell shocked guards.",
   "created_utc": 1698940713,
   "score": 215,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iz2sf",
   "message": "Not a doctor’s perspective but my dad went to his doctor because he suddenly didn’t like the taste of broccoli. Dad was otherwise healthy, late 60’s, fairly active guy.  He was diagnosed with leukaemia.",
   "created_utc": 1698942861,
   "score": 31,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7icjds",
   "message": "Mom was constantly in and out of doctors' offices and ERs for many things such as extremely tired, extreme weight gain, periods lasting months, and a bad case of dehydration. Finally, an ER doctor took notice and sent her for a CT and found a grapefruit sized tumor in her vena cava. Later diagnosed with stage 4 Leiomyosarcoma. Gave her a few weeks to live but she battled for about 5 more years.\n\nEdit: spelling",
   "created_utc": 1698934525,
   "score": 99,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jd0go",
   "message": "When I worked in a\u0026amp;e I had an elderly man come in to minors with his son in law. Symptoms were constipation, mild stomach pain and a bit of abdominal distension. They were just asking for laxatives to relieve his constipation.\n\nI examined his abdomen and found a firm central mass which was a bit unusual. We are taught in medical school to assess for an abdominal aortic aneurysm by putting fingers in a triangle around the belly button so I did this, and as soon as I did I saw my hands pulsating strongly back at me (immediately I start crapping my pants!)\n\nOrdered the man a CT which showed an abdominal aortic aneurysm with an outpouching with an **extremely** thin wall. This guy was immediately moved from minors to resus and then straight to surgery - surgeons say if he'd sneezed it would have ruptured (**very** bad news, you would lose your entire blood volume in mere minutes)\n\nI looked him up afterwards and amazingly he survived to discharge hospital following surgery (although don't know how he did long term). Was pretty terrifying for me as you could potentially have mistaken that for a hernia or faecal loading if you didn't examine him properly, but thats probably my main 'time I saved a life' story!",
   "created_utc": 1698947876,
   "score": 145,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7izzif",
   "message": "Patient presented at the ER complaining of back pain. They gave him prescription strength ibuprofen and sent him home. His back pain became excruciating  and he ended up being life flighted to our hospital with a dissecting abdominal aneurysm. Poor guy was on ECMO for days before he passed away.",
   "created_utc": 1698943193,
   "score": 110,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j3hfn",
   "message": "I was the patient. My mom kept bringing me to the doctor because I was continuously complaining of tummy pain. I had just started school. The doctor said I was likely just trying to get out of school and stay home with my mom. I complained the whole school year. She even brought me to the ER a few times and they essentially said the same thing. They never did any imaging, sometimes blood work. \n\nFinally one day I started peeing blood and she took me right to the children's hospital and I was diagnosed with stage 4 kidney cancer, by then it had spread to both lungs, liver, lymph nodes and around the heart.",
   "created_utc": 1698944451,
   "score": 105,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7ikkr5",
   "message": "I was the patient. Spent six months being told I had a bad cold and anemia so I should take iron pills. Turns out I had an autoimmune disease and my kidneys were failing. I eventually ended up on dialysis and with a transplant.",
   "created_utc": 1698937566,
   "score": 232,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j6gb2",
   "message": "NAD, but this story is about an \"elderly but not ancient\" relative. \n\nBackground: I had a hysterectomy due to general uterus shenanigans in 2019. My surgeon is awesome, I had a great surgery \u0026amp; easy peasy recovery. \n\nSo one day this relative calls me out of the blue and says \"what was the name of the OBGYN who did your hysterectomy?\" and I tell her, and ask why, knowing that this person has been through menopause for a long ass time. \n\n\"Wouldn't you know it, I got my damn period this morning! I thought I was done with this shit!\" \n\nWell my friends, that reaction of \"oh hell no, I'm done with this shit\" turned out to be a life saver, because what she thought was just menopause being weird turned out to be endometrial cancer caught SUPER early. She had a hysterectomy, one round of radiation, and is cancer free 3 years on.   \n\n\nBleeding after you've been through menopause is SUSPICIOUS AS HELL, yinz.",
   "created_utc": 1698945537,
   "score": 46,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7kb3bf",
   "message": "I am a nurse, so naturally my mother called me one day when she had strange symptoms. \"Earlier today, I had this feeling like there was a squirrel running around in my belly.\" I reassured her that it was probably gas.\n\nIt happened again a few days later when she was in the car with me. Something made me take her right to the emergency room. The doctor evaluated her and basically accused her of making things up. I asked for a different doctor, because she is not a complainer or a drug seeker.\n\nTurns out it was a malignant brain tumor (glioblastoma) that was manifesting itself as abdominal seizures. They said she had 1-2 years to live. It is now 7 years since surgery, chemo, and radiation and she is still alive.",
   "created_utc": 1698960205,
   "score": 25,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iz4xx",
   "message": "[removed]",
   "created_utc": 1698942883,
   "score": 21,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j7d8g",
   "message": "I did, among my other jobs, administrative physical exams for my employer for decades. This happened over 2 decades ago. Patients had a chest xray and some basic labs before they were seen. I got an xray report that said the patient's mediastinum appeared a bit wide and I should consider a CT scan to evaluate for an aneurysm of the aorta. Woops. I called the patient, whom I had never seen. He was not having any chest pain and felt like his usual self but agreed to have the chest CT done. For whatever reason radiology did not do a 'full' chest CT as I had ordered, but did one limited to the aortic arch and below. The aorta and mediastinum were normal, but the CT report mentioned some minor 'stranding' extending from the left hilum of the lung extending towards the left upper lobe - which was not shown on the CT because they did a limited exam. OK. I called the patient back, whom I still had never seen, and told him what the CT scan showed. Upon questioning he said he had some minor pain in his left scapular area (behind the shoulder) a year before, and he had seen a clinic at a different hospital which had done a series of xrays and \"nothing was wrong\". The upper back/shoulder pain had not really changed over the intervening year and he had grown used to it - the vicissitudes of ageing. So I re-ordered a chest CT and asked radiology to do it as ordered - which a few days later they did. Double oops. \n\nThe full CT scan showed a pancoast tumor, at the apex/top of the left lung, that had extended into the chest wall and destroyed segments of several posterior ribs - which explained the pain the patient was having. This is a \"very bad\" thing. I called the patient back again, his appointment to see me was not for several weeks and he needed to know. He took the very bad news surprisingly well, got copies of the CT scan, and went to a local cancer hospital for further evaluation and treatment. I never actually saw him.",
   "created_utc": 1698945863,
   "score": 215,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jjbwj",
   "message": "I was the patient. We had gone to India for a wedding (absolutely incredible!) And naturally, our north American digestive tracts, everyone suffered from \"Delhi Belly\". I was hit harder than most (almost didn't get on our flight home because I was worried about having to use the bathroom if the seatbelt sign was on or if there was a line up). Ultimately got home. Everyone in the group (about 12 people) were feeling better, but I was still having some minor gastro issues. Nothing crazy, still working and living normal life. Went to a walk in because my family doc couldn't see me for at least 2 weeks. Walk in doc ordered some tests and prescribed an antibiotic. I got a call the test came back negative, but if I was still feeling unwell, to come back (this was like 2 weeks after my first visit). I debated, but decided to go back, turns out they never ran the e coli test, so they run that again. Doc said she'll call me when the results were in. \n\nI didn't hear back, but my now MIL (a doc) caught wind I was still dealing with gastro issues and asked if she could call the lab to get my results. I said \"sure, that would be great\". \n\nIn the meantime, a friend is visiting from out of town and I wanted to show her a good time, so we went out dancing. At some point in the evening my now MIL had called me something like 17 times, leaving voice mails and texts to get to the hospital asap. Don't go home to change, don't get public transit (IE cab because it'll be faster), just go STRAIGHT to the hospital. \n\nThe nurses were absolutely FLOORED the e coli hadn't gotten into my blood stream (this was about a month after our trip). Apparently my urine test came back absolutely overrun with an antibiotic resistant e coli. \n\nBest part, the walk in doc fiiiiiiinally called me about a week after my hospital visit telling me she has the results and I should come see her. My MIL happened to be standing beside me when I received the call and asked to talk to the doc. As a teacher at the university here, the walk in doc knew who she was and had to walk my MIL through my case to identify ALL the ways she let me down as a patient (including asking me to come into the clinic instead of rushing to the hospital). \n\nI'm totally fine now and remain forever grateful to my now MIL!",
   "created_utc": 1698950165,
   "score": 219,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j2ail",
   "message": "I'm not a doctor, but I have 2:\n\nI had a doctor appointment, just a 6 month checkup for my diabetes. My heart rate was up, so my doctor sent me to the ER for blood work. Turns out I was having a weird version of diabetic ketoacidosis where my blood sugar wasn't elevated (anion gap). They kept me in ICU for a week.\n\nMy mom went to her doctor for shortness of breath. He told her she was old and overweight. We took her to the ER, where they drained a couple of liters of fluid off her lungs. Her breast cancer from 5 years earlier had returned, metastasized, and invaded every bone in her body, her lungs, and her brain. She died 5 weeks later.",
   "created_utc": 1698944022,
   "score": 219,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j0qlp",
   "message": "Not a doctor, just answering for myself. Also, I don’t really know if it can be considered a serious life or death situation…\n\nHad post-concussion syndrome, and already had a MRI done. It was nothing out of the ordinary. Then one day about a month later, I got up and suddenly fainted. Consulted my doctors, and they all agreed it was likely a one-off and I was fine to go travel… but they still thought, to be on the safe side, I should do another MRI scan when I returned. \n\nI had a great few weeks travelling, and that included lots of outdoors and sports stuff. Then I came back, and went for my scan, this time with contrast. By that point, I honestly felt like I was wasting time and money. \n\nSo imagine my shock when the results came out and I was told I had a brain tumour. I later found out that people with the type of brain tumour I am suspected to have tend to have it manifest through seizures. I just happened to have mine in a “dead area”, so I just never had any symptoms at all. \n\n(I’ve since had it taken out, and we’re waiting on the histopathology to get back.)",
   "created_utc": 1698943464,
   "score": 11,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j0lfm",
   "message": "I don't know if it counts but I got bit by a bat and thought I should go get the rabies vaccine right away and my wife said \"it's expensive, see if you even get sick\" and I almost listened to her advice until I looked up what the first symptoms would be to know what to watch for and everything was pretty unanimous once symptoms start it has a 100% kill rate and if you get bit it's non negotiable you should go for the vaccine ASAP.",
   "created_utc": 1698943411,
   "score": 225,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j2y0b",
   "message": "Neurologist here. \n\nA healthy patient came in with a few month history of left hand numbness. My first thought was Carpal Tunnel Syndrome. But physical exam was not very convincing. I got CT head and found malignant metastatic lesions!  \n\nPatient and family were talking about expensive designer bags, were very happy. I had to break the news. They went from healthy to potentially a few months to live. \n\nSometimes I hate my job.\n\nEdit: I am reading replies of people getting worried about their/loved one’s symptoms. Remember, cancer is incredibly rare. Everything else is much more likely to be the case.",
   "created_utc": 1698944256,
   "score": 42,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jg3eq",
   "message": "26 year old seemingly healthy male came to my office (eye doctor) with complaints of mild blurry vision. Usually a very routine complaint and very easy fix with glasses/contacts.  \n\nAfter a few minutes of trying to get him see better with the refracting lenses,  I wasn't able to improve his vision when it shouldn't take that long for someone that young. \n\nI decided to quit trying and quickly look in the back of his eyes. Hemorrhages everywhere,  swollen optic nerves. He ended up having malignant hypertension causing his retinae to swell. His blood pressure was 270/170 in office which  could have made him have a stroke at any minute. We physically drove him to the ER where he was admitted.",
   "created_utc": 1698948996,
   "score": 157,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jg1b1",
   "message": "Hospitalist internal medicine physician here. I admitted a middle aged lady a few years ago who presented with her “arms feeling weird.” She denied pain or numbness, just noted an unusual sensation she couldn’t really describe. Her initial testing in the ER was normal and she was admitted to rule out cardiac cause of symptoms despite having no real cardiovascular risk factors. When I first looked at her chart my first thought was “good grief why did this lady need to be admitted?” She had a stress test which was interpreted as “equivocal. The cardiologist decided to do a left heart catheterization (angiogram) which to me seemed unnecessarily aggressive. To my surprise, it showed critical 99% blockage in her left main coronary artery (the widow-maker) as well as severe stenosis in several of her other coronary arteries. She ended up being transferred for emergency coronary artery bypass surgery. I definitely am more cognizant now of more atypical presentations of coronary artery disease, particularly in women.",
   "created_utc": 1698948975,
   "score": 200,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7hyjfl",
   "message": "Not a doctor but my MIL tripped, broke her ankle, and they discovered she had bowel cancer really early because her blood work came up wonky.",
   "created_utc": 1698928502,
   "score": 171,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7ipakl",
   "message": "As a resident, I had someone come to clinic to resume routine care for routine screenings after an older sibling had passed (reason for visit/CC: \"i want to take better care of my health\"). I noticed they had a little bit of blood on their napkin and asked to examine their mouth... a few missing teeth and a massive mass on their gums. Immediately sent them to ENT, where they learned that it was oral cancer\n They'd eventually get the whole enchilada of mandibulectomy (jaw resection), glossectomy (tongue removal), and I think even neck dissection and laryngectomy.\n\nI followed them peripherally on a consulting service until they ultimately passed away in the hospital about a year later. The cruel irony of the whole thing is even worse when I wonder if he would have had better quality end of life if I'd never bothered looking and it had just taken its natural course.\n\nJust more reasons to avoid tobacco and alcohol (80% of oral cancers attributable to their consumption) and eat plants.",
   "created_utc": 1698939318,
   "score": 217,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jebx3",
   "message": "This is a story from my mother who was a sex therapist.  She was treating a teenager who basically was masturbating so hard and often that he was rubbing his junk bloody and bleeding through his pants.  The kid insisted it wasn't sexual, he was just really uncomfortable and his skin hurt.  He got boners rubbing the skin.  The doctors didn't believe him and sent him to my mother.  \n\n\nMy mom, devil she was, had a saintly moment and listened to the kid.  She suggested he see a dermatologist.  Kid literally had dick cancer.  Something with an s- cell carcinoma.  My mother never saw the patient after their parents called to cancel appointments because they found the cause and he was no longer in need of her services.",
   "created_utc": 1698948353,
   "score": 223,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7it4ny",
   "message": "My local hospital sent me home twice after I went there for chest pains. I had a massive heart attack, and my son had to resuscitate me soon after arriving home the second time.",
   "created_utc": 1698940707,
   "score": 50,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jgem2",
   "message": "My husband was a Pathologist’s Assistant for 30 yrs and did autopsies. Guy goes to ER feeling unwell - a couple tests are performed and he’s diagnosed with ‘stress’ (which means I Don’t Know) and sent home.\n\nER shift change. Quiet time in the ER and a bored doctor reviews cases from earlier in the day. She sees something she doesn’t like in this guy’s test results and sends an ambulance to the guy’s house to bring him back. Dead on the floor inside the door.\n\nPoor guy ends up on my husband’s table and the hospital gets sued.",
   "created_utc": 1698949109,
   "score": 191,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j1fip",
   "message": "Hubby went to a\u0026amp;e with shoulder ache ( he had wrenched it a few days before) they sent him home with codiene \u0026amp; said to go back if it didn't improve.  It didn't so 3 days later we returned this time they x-rayed showed nothing so they did an ECG, within seconds they were racing round inserting cannulas etc. Blue lighted him to another hospital straight into the cath lab where they removed 5 clots from one side of his heart \u0026amp; a massive clot ( widow maker ) from the other, inserted 2 stents.  Cardiologist admitted he doesn't know how hubby survived said he probably had a minute or two to live. 12 years later he's still here ( after surviving another heart attack 4 years after the 1st- at Donington Monsters Of Rock Festival). One lucky man \u0026amp; one grateful wife",
   "created_utc": 1698943713,
   "score": 85,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7hzpua",
   "message": "Probably not particularly crazy, it might happen all the time for all I know…. Not a doctor, but I went in to urgent care thinking I had a nasty uti but it turned out to be severe sepsis, got whisked away in an ambulance on oxygen.\n\nThat’s what I get for my mom teaching me it’s all in my head.",
   "created_utc": 1698929075,
   "score": 169,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7i7w9m",
   "message": "NAD\n\nBut had a patient in my ER who came in for a “lingering flu”\n\nDiagnosed with an extremely aggressive form of Leukemia",
   "created_utc": 1698932688,
   "score": 150,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j5uko",
   "message": "Not a doctor but I had a massive head ache, fainting  and extreme light sensitivity. Dr came and said it was sinusitis. I struggled on, saw another dr at same practice who confirmed sinusitis. Started slowly recovering but had extreme vertigo. Got a second opinion, confirmed sinusitis. Went private (was in the uk) and was seen by very dismissive dr. I insisted on further tests and he reluctantly ordered an mri. Turns out I had meningitis.",
   "created_utc": 1698945317,
   "score": 115,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7icgqs",
   "message": "Had a friend who had back pain in her lower back.  Put it off because it was the beginning of covid.  By the time she finally went they found out she had tumors all over her spine.",
   "created_utc": 1698934497,
   "score": 180,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iyh25",
   "message": "Not a doctor and not my story. Something I read on a similar post a ways back.\n\nAn ER doc was running some baby docs through training when a disheveled man in an old rumpled suit, obviously homeless, came in complaining of nonspecific malaise. Kept mumbling about quantum whatever under his breath. Wasn't all there, mentally.\n\nShe thought he was drug seeking, but opted to run him through basic diagnostics to show the baby docs how it was done. Turns out the dude was in full blown kidney failure. They put him on dialysis and he just *snaps* into focus. Complete turnaround, 100% coherent.\n\nTurns out dude was an actual professor and expert on quantum mechanics and was riding a train to a conference when he entered kidney failure. It addled his brain and he wandered off the train at a random stop in a state of confusion. He'd been roaming the streets for months like that. Somehow didn't die.\n\nCrazy.",
   "created_utc": 1698942641,
   "score": 185,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jcljg",
   "message": "My moms story: patient arrived at the emergency room (walking from her home) with a hatchet in the back of her head. Her husband tried to kill her and she knew he'd hit her on the head. She didn't know it was the hatchet embedded in the back of her skull. Obviously in shock. She lived and her husband went to jail so that's good!\nEdit: she went to the hospital with what she thought was a bad headache because he'd hit her. She just said her head hurt.",
   "created_utc": 1698947729,
   "score": 172,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jlcnq",
   "message": "8 year old girl gets brought in complaining about back pain she'd had for 3 months, several different doctors had given her painkillers to no avail. After about 5 minutes I asked her if she had any problems going to the toilet, she says it's \"foamy\" when she pees. \n\nBone cancer. \n\nShe made a full recovery, and from what I know is in her 20s now, but to this day I hate how she'd been suffering for 3 months and no other doctor had bothered to even ask any more questions as to why an 8 year old girl was getting severe back pain.",
   "created_utc": 1698950894,
   "score": 173,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jqp18",
   "message": "My son. 6 weeks old. He was also 6 weeks premature. Only symptoms at the time of me bringing him to the ER was inconsolable crying and wouldn’t drink his breast milk. Was told by others that I was just being a paranoid first time mom…he probably has gas or was colic. My instincts just told me otherwise. Brought him to the ER…triage asks me what my concerns are….I told them he won’t stop crying and I can get him to eat. A couple hours later my 6 week old baby coded blue and went into respiratory failure. “Code blue pediatrics” will forever be the most haunting thing I ever heard. Since he was so tiny they were having incredibly difficulty intubating him. Was being kept alive in between attempts with that bag thingy (unsure what it’s called) and compressions. His diagnosis was late on set group b strep, sepsis, and bacterial meningitis. Had I not brought him in when I did and waited, my son would not be alive today. So yea…listen to your instincts, you have them for a reason.",
   "created_utc": 1698952836,
   "score": 174,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7idoag",
   "message": "Not a doctor but my husband suddenly lost 15lbs over a few days. No changes to diet or exercise. I told him it sound like diabetes and please go. He finally went after a week and by that time he was skin and bones. It was diabetes and his blood sugar level was dangerously high. The doc said if he had waited 1 more day, he might have gone into a coma",
   "created_utc": 1698934962,
   "score": 199,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jcsw0",
   "message": "I thought I pulled a calf muscle. I did the whole RICE protocol, but nothing helped. I was limping because of the pain. I ended up going to urgent care which was a waste of time because it could be a blood clot—so they sent me to the ER. The ER did an ultrasound of my leg and found nothing. So, they gave me muscle relaxers and sent me home. They noted I should follow up with my PCP, though, because my blood pressure was really high. I chalked it up to the anxiety of being evaluated for a blood clot. \n\nA few days later, I develop this little cough and an intermittent sharp pain between my shoulder blades on deep inhales. Being that this was September 2020, I thought that this was for sure Covid. But I also then remembered that I needed to follow up with my PCP about the blood pressure thing, so I called to talk about both items at once. \n\nThe nurse was alarmed and told me in no uncertain terms to go straight to the ER to be evaluated for a pulmonary embolism. \n\nAnd that’s how I found out that I had multiple bilateral pulmonary embolisms.",
   "created_utc": 1698947800,
   "score": 62,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j76ep",
   "message": "During COVID I went to the ER with chest pains.  They said no heart issues and no blood clots so go home and discuss with my GP.  Turns out I’m supremely allergic to shrimp and was having esophageal spasms.  I figured it out after realizing that the yellow curry powder in my meal kits was giving me similar issues.  Yellow Thai curry powder often has ground up shrimp as an ingredient.",
   "created_utc": 1698945795,
   "score": 155,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j0zpn",
   "message": "wasnt life threatening but i fell and got a few stitches in my knee as a teen.\n\nThe hospital wasnt the best, and I wasnt even fully numb when they stitched me. I was screaming in pain from the needle and sutures and two nurses were holding me down as they finished. \n\nHowever the first week or two i noticed i couldnt walk right. My knee obv couldnt bend due to the stitches, so didnt think much of it. When they finally came out, i still couldnt bend my knee but figured it was just weak and stiff from being straight for 2 weeks. \n\nIt still hurt alot over the following week, and found I was literally dragging my leg behind me as i still could not bend it. \n\nMy dad was the type \"put some dirt in it son, dont be a baby\" and he is the one who took me to the doctor on why im dragging my leg like a sack of potatoes. \n\nDoctor took one look at it and exclaimed i need to go to the hospital right away! Even threatened that if i didnt go they would have to cut off my leg (tbh i think she was embellishing, but the scary part not by much) \n\nThis hospital was really good compared to the one i initially got the stitches at. Turned out I had an infection in the knee that needed several days iv antibiotics. They did proper scans of my knee and found i not only blew my patellar tendon (primarily why i couldnt bend my knee) I also mildly fractured the bone itself (which was impressive to do)",
   "created_utc": 1698943556,
   "score": 172,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7k2qf2",
   "message": "Paramedic, not a doctor. A woman called 911 requesting an ambulance. When I and my brand new rookie EMT got there, she complained of just not feeling well and having a mild headache. I did my assessment and everything looked perfectly normal except it seemed she might have a cold with a headache. I didn't think she needed to be seen in an ER and told her so. She wavered back and forth and then finally agreed to sign a refusal. I sent my rookie partner out to get the clipboard but he pulled me aside and told me he thought she needed to go. I asked him why and the best he could do was \"I just have a feeling.\" So I finally relented and told him, \"Fine, your patient; I'm driving.\" \n\nA few blocks down the road he leaned up front and asked me to make it hot (lights \u0026amp; sirens). I rolled my eyes but did what he asked.\n\nAt the ED the grumpy triage nurse came up to me a few minutes later and wanted to know why the hell we transported a perfectly healthy woman with a cold and headache. I just nodded toward my partner and said, \"You'll have to ask him.\"\n\nAnyway, we  left, but a few hours later we were at the same ED and that same nurse came up to me and told me the news. Because of the headache the doc had ordered a CT scan, and lo and behold there was a dissecting aneurism right next to her brainstem. She had been shipped out to the trauma center by helicopter and was undergoing emergency surgery. I learned later that she survived without deficits.\n\nHoly crap. If I'd had a more experienced partner that day, she would have ended up dead and it would have been my fault.",
   "created_utc": 1698957161,
   "score": 33,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iwr1p",
   "message": "Not a doctor, I work in the cat scan department. Had a patient who came to the ER because she thought she was pregnant and wanted a test (happens so often, idk why they just don’t get a test at CVS). Pregnancy test was negative and they sent her to me for a scan. Patient tells me she was having symptoms from her last pregnancy. Turns out she was having right sided heart failure.",
   "created_utc": 1698942023,
   "score": 1,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jhce2",
   "message": "One month ago, my husband had his blood checked for low testosterone, (prostate cancer survivor). That night we were in ER and he was diagnosed with Stage 4 Pancreatic Cancer, spots on the liver. No cure. He had his blood checked late June and nothing. No symptoms except for being more tired than usual. Please go to the doctor regularly and get checked out. This couldn’t be helped, but many things can.",
   "created_utc": 1698949445,
   "score": 135,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jgd5y",
   "message": "My husband went in for a routine checkup. His bloodwork was fine. Everything was fine. The only thing was him saying he just a little more tired than usual. \n\nHis Dr noticed that he was due for a colonoscopy, and set one up for him. The DR who did the colonoscopy said everything looked good, but, he just felt there was something up.\n\nSo, my husband went back to his regular Dr, and she did a complete look at him. Bloodwork showed a very slight increase of white blood cells. So, she decided what the hell, let's do an abdominal scan just to do a look-see since the colonoscopy Dr didn't feel quite right about things even tho there was nothing showing. \n\nApparently his appendix was inflamed, and surgery was scheduled to take it out. Upon removal, not only was it inflamed, but infected, and cancerous as well. \n\nTurns out that: \n\na) it was confined at that time to the appendix \n\nb) it was a particularly nasty little cancer that likes to spread\n\nc) the cancer was at the far part of the appendix, so when they removed the appendix the margins were clear.\n\nd) it led to the discovery of him actually having a genetic issue called Lynch Syndrome which they were able to figure out was thru the maternal line. Turns out that his mom's uterine cancers, his uncle's death of colon cancer, and his grandmother's various cancer issues were all related to this genetic abnormality. \n\nIf he hadn't gone in for his checkup and procrastinated, his appendix would have gotten worse, and the cancer would have spread. There's a good chance the cancer would have gotten into his intestines and ended up with intestinal cancer of some sort if they hadn't gotten it.  He is still very suspectable to getting cancers because of this genetic condition. \n\nHe found out early enough to be able to be proactive enough for care and prevention. It's been almost 10 years since diagnosis and he has been healthy as a horse since then. He gets a colonoscopy every year because of it, but thats a small price to pay.",
   "created_utc": 1698949094,
   "score": 22,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j9l31",
   "message": "I don’t know about haunting me for life but here’s one I’ve never forgotten. I worked as a CNA in a dementia unit.We had a wheelchair bound gentleman who started pulling the fire alarm set into the wall of the hallway by his room. Because this was a nursing home, every time that alarm was set off the fire department responded… quickly. Our gentleman started pulling it several times a day and often a few times in the evening as well, all day, every day. It didn’t take long for the fire department to lose any sense of humor they might have had about the situation and start leveling fines on the facility. Progressively bigger ones as time passed and our friend continued his trick in spite of numerous attempts to stop him. The staff was written up and upper management was going apeshit.We just didn’t have enough staff to have someone constantly monitor a single patient. Finally, someone thought to ask this gentleman WHY he was pulling the fire alarm. His reply was astonishing… he pointed to the dammed thing and very reasonably explained “ it says PULL “. It did, in big red letters three inches high. A simple piece of masking tape over the instructive word solved a huge problem. People with dementia aren’t exactly themselves anymore but they’re certainly far from stupid.",
   "created_utc": 1698946657,
   "score": 93,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7if7td",
   "message": "Not a doctor (annoying, I know) But my mom kept having foot pain. Told her it was plantar fasciitis. Wouldn’t heal. Then told her it was a fracture. Wouldn’t heal. Then told her there was a growth. Did a biopsy and it was LUNG CANCER! Stage 4. So from foot pain to lung cancer. Totally wild. She has also never smoked a day in her life.",
   "created_utc": 1698935550,
   "score": 2,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7je92t",
   "message": "I was the patient.  At 36 I hit my tonsils out.  I developed an infection and my stitches split and I started bleeding in the back of my throat. The blood was shooting straight down my throat.  It felt like pop rocks.  My wife has the neighbor come over to watch the kids and we go to the nearest ER\n\nI go in and my wife parks the car.  I go to the front desk and say my throat is bleeding.   They have me sit down and fill out paperwork.  My wife comes in and goes full Karen.   I get sent to the back and immediately vomit semi coagulated blood all over.  I then look at the nurse, tell her I'm cold and pass out.   \n\nI wake up in a hospital room.  I had emergency surgery and they estimated I was down over 2 - 2.5 pints of blood.  Aparrently a nurse in the er saw me throw up the blood and she threw up as well.",
   "created_utc": 1698948324,
   "score": 131,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j8h52",
   "message": "NAD. My older sister had strep throat when she was like 7…  she was standing in the hallway and passed out due to her body attacking itself instead of the infection.  My mom took her to the local children’s hospital.\nTurns out she had rheumatic fever and became temporarily paralyzed from it. \nThere were tons of drs in her room observing her (I guess this was rare?)\nShe lost most of her motor skills and had to relearn how to walk. It took her months to recover.\nShe now has a leaking heart valve because of it.",
   "created_utc": 1698946257,
   "score": 117,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j62vq",
   "message": "During studying in my practical year. Emergency room, 70something year old woman, lovely person, one of these candy giving grandmas with perfectly laid curls and all, complaining of a rash.\nObviously they sent in the student cause rashes are boring and not really a case for an emergency consult (mostly…..).\nSo picture me, young and full of excitement about the ability to play doctor in a way. No idea what I‘m doing generally, lots of my knowledge gained from Grey‘s Anatomy which is definitely not real life doctor accurate (mostly…..)\n\nI go in there and remember a Grey‘s case from some long ago episode. I take out my pen and mark the area that is affected by the rash. It‘s rather small. Right leg, up just slightly above the ankle. Anyways, I just mark it, chatting with the lovely lady. \nThen proceed to go talk to the real doctor who has finished his studies and gets to do big people medicine, he does not like to concern himself with rashes and such boring stuff and he also lets me know it. So it takes a few attempts to tell him about that patient, we keep getting interrupted, obviously everything is more important than some old lady‘s rash, which is true in an emergency room (mostly…..)\n\nSo after I present the case he dismisses me to go give the woman some cream and get here out of here. I still tell him about the Grey‘s episode where one time one patient had a case of what is called necrotizing fasciitis. Just to let him know that I have marked the area. Necrotizing fasciitis…Cool word, fucked up disease. It‘s bacteria that move incredibly quick under your skin and est anything in its path to put it simply, gaining them the name of flesh eating bacteria.\nIncredibly rare. \nHe tells me that laughs it off. I go back to my patient to see that the rash has by now moved up above her knee, all of that within the hour or so it took me to get a hold of my supervisor.\n\nTurns out rare things are rare but not unseen, so here I am, patient has necrotizing fasciitis of the leg. Because I marked it, I am sure. So I tell my supervisor who‘s with his supervisor at that time. They don‘t believe me, they go in, they see the marked line, the believe me now.\n\nI get to scrub in on her case, we take her leg of close to her hip. It was devastating",
   "created_utc": 1698945401,
   "score": 229,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j7esf",
   "message": "Not a doctor.  We had to gently tell a coworker her that she needed a morning shower and/or deodorant.  She went to the doctor to get it checked out and turns out she had a severely prolapsed uterus and it was infected.   We felt terrible telling her she had b.o. but thankful she got a very serious situation checked out.",
   "created_utc": 1698945879,
   "score": 233,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7k0rp8",
   "message": "I’ve had a couple patients come in and complain about usually mild vision issues, like floaters, or blurry spots. But after questioning them it starts sounding worse and worse. \n\nBut one lady came in and fit the stereotypical Karen template. She was rude and demanded to be seen on a Saturday that was already fully booked. I told the staff that she could wait and I would get to her as soon as possible. \n\nIt took me almost 2 hours to get to her. She complained of a spot in her vision, usually a floater, and usually harmless. But I looked in her eyes and saw bleeding in her eye, just off the optic nerve. I asked about headaches and she confirmed. I told her she had to go to the ER immediately, and if she felt off to drive then I’d call an ambulance. She looked at me like I was crazy. I eventually convinced her she had to go right now and get checked out, as she was at risk for a stroke or aneurysm. \n\nThe next day the ER called and asked if I’d be coming in to see her for the rounds. I was surprised and said I don’t have any hospital privileges, I’m just an optometrist.  Turns out her blood pressure was sky high and they gave her some medication to lower it. Then her pressure dropped so low that her heart stopped, and they had to shock her back into rhythm. \n\nShe came back the next year for her annual eye exam and told me I saved her life. The doctors told her she could have keeled over dead at any minute. \n\nAnd she still had the gall to be rude af to everyone at the office.",
   "created_utc": 1698956463,
   "score": 115,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j2qna",
   "message": "Not a doctor, but when I was in college I thought I had bronchitis and so did every doctor I saw. Turns out my heart function was 10% and I needed a heart transplant. No medical history. I picked up a virus that attacked my organ.",
   "created_utc": 1698944182,
   "score": 218,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jpf06",
   "message": "I'm not a doctor, but my husband was the patient.\n\nOn our way home from vacation, he had the worst diarrhea and vomiting.  Poor dude barely let me stop the car before he tumbled out and emptied both ends on the side of the highway.  (He hasn't stopped praising me for keeping a roll of TP in the car \"for emergencies\" since.)  I get him back in the car and find the nearest hospital in rural Mississippi. \n\nThey get him medicated and hydrated, and he's trying to walk on out of there because he feels fine.  But every time a nurse takes his blood pressure, another medical professional hurries into the room. He started with an NP and graduated to an Infectious Disease Specialist before the end. They keep testing it with different cuffs, on the other arm, all kinds of things.\n\nAnd then they get him a chest x-ray and order a CT scan, but he gets up and wanders away from the CT room to go take a bathroom break.  He was walking around under his own power with a blood pressure reading of \"why are you conscious?\"  They get him back from the scan and then admit him to the ICU.\n\nHe was feeling okay by that point, but he was also dying of sepsis.  He got the award for \"most alert patient in the ICU,\" and I got to call both our bosses to extend our vacation while we waited for the massive dose of antibiotics to fix the problem and verify if it was cdiff or not.  (It was not.)",
   "created_utc": 1698952368,
   "score": 103,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7hz0lk",
   "message": "Not a doctor but work in health. Had a patient that went to her GP thinking she had arthritis in the knee from an old surgery and came back with a diagnosis of motor neurone disease.",
   "created_utc": 1698928737,
   "score": 135,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jcf3s",
   "message": "Went to ER for a headache I’d had for two weeks. Doctor wanted to give me allergy meds and send me home. My GP had told me to demand a CT with contrast. Subdural hematoma. Had emergency surgery a few hours later and spent eight days in ICU with a drain tube in my skull.  Women often aren’t taken seriously regarding pain. You are your own best advocate.",
   "created_utc": 1698947666,
   "score": 212,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jdyfe",
   "message": "I had a gastric bypass 8 years ago - after about 2 years I started gaining weight and was constantly feeling unwell - surgeon who did the bypass told me it was in my head and nothing wrong - even told my gp etc so I was blown off until I was admitted to hospital with severe anaemia, gallbladder pain and elevated liver sats- turned out that he had messed the bypass surgery up in a spectacular way - I am currently waiting to have to have a hole in my diaphragm repaired, my pouch resectioned as there is a hole between my pouch and old tummy, he made the pipe from my tummy to intestine too short by 2/3’s and they think he has joined it to my bowel in error!!! The surgeon I have now is going to try and start fixing the mess but has warned me I am in for multiple operations and a whole world of pain and was horrified when I checked with him it wasn’t all in my head!! Sad thing is the original surgeon is still allowed to operate on others (I am the third person I know of who he has messed up).",
   "created_utc": 1698948218,
   "score": 100,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j9sio",
   "message": "Not a doctor. As a rookie cop I was dispatched to a possible sexual assault at the hospital, a man dropped off at the ER disoriented and wearing just boxers. Newlywed in his late twenties who is in town on business and can’t remember the last seven days. Turns out it was a brain tumor, not a crime.",
   "created_utc": 1698946731,
   "score": 195,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iuoa6",
   "message": "Obligatory not a doctor: had a 38 week pregnant woman with twins come in with a primary complaint of “shortness of breath with exertion”.  She was 4’10.  I’m thinking, “of course you’re SOB, as short as you are with term twins”.  I was pretty sure we’d do an NST and send her home.\n\nHer BP was 170/110, so we did bloodwork, and she was in HELLP syndrome.  Platelets were 42,000.  We were lucky she came in when she did.",
   "created_utc": 1698941268,
   "score": 4,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jb5rh",
   "message": "NAD.  Thought my Crohn’s disease wasn’t doing too good.  Asked my Gastro office to order blood tests- they requested I stop by radiology too.  Worked a full day.  Drove myself to the hospital for the quick tests.  Even dropped off a daughter at an appointment.  \n\n Came home.  \n\nPotassium at critical levels.  A call came from Gastros office just as I got in my Jammies.  Do not pass go, do not collect 100$, proceed directly to the ER.  \n\nI had already had a heartattack (3 days prior we think).   Had to be hooked to heart monitors while they tried to pour K into my arms, as I couldn’t digest much of anything.    \n\nSpent 9 days in the hospital trying to get K and magnesium back to safe levels.",
   "created_utc": 1698947215,
   "score": 97,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j0685",
   "message": "Not a doctor but my dad went to his Dr because of a stuffy nose that had been going on for weeks. Dr looks into his nose and noted a deviated septum. Said that's not right and sent him for tests. My dad had a brain tumor size of a grapefruit with no symptoms other than a plugged up nose. So he went in with a cold and came out with cancer.",
   "created_utc": 1698943259,
   "score": 17,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j1a8o",
   "message": "Nad work registration at an ER.\n\nWoman came in with abdominal pain. Ended up being a code stemi.\n\nIt's terrifying the differences in heart attack symptoms between women and men.",
   "created_utc": 1698943660,
   "score": 188,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j6xp4",
   "message": "Thank you Reddit, I am now convinced the stuffy nose I have is going to kill me,",
   "created_utc": 1698945708,
   "score": 7,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7izkpl",
   "message": "Wife accidentally shot husband at the gun range. Minor wound but we did the usual work up. Found pancreatic cancer.",
   "created_utc": 1698943043,
   "score": 255,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7k29sf",
   "message": "I'm a doctor up in Canada. Been in practice close to a decade. Seen all kinds of crazy things and have crazy things happen to my loved ones... Here goes:\n\nWhen I was still in training almost a decade ago, my mother had minor vague muscle and joint pain for months. We all thought it was muscle related from all the house work/work-work that she did. She went and saw her family doctor who ordered imaging, it basically came back all \"normal\" - ie., nothing acutely wrong. The radiologist did make a comment about a \"sclerotic lesion\" on her hip that needs to be monitored, the differential was wide but he did mention that it could be \"metastatic cancer\" but the possibility was very small, he did ask for ongoing monitoring. My mother showed me the report, I even underlined the part about the \"possible metastatic cancer\" and told her that she needs to follow up with her family doctor. She did see the family doctor within the week. The family doc said it was nothing and she's fine.... Fast forward a few months, the pain never went away, she went to a walk-in clinic next with the same pain complaint, she was discharged home with some anti-inflammatory pain meds. Again, this was a mild vague pain and her functional abilities were not affected at all at this point. This was a perfectly healthy woman in her 50s, never smoked a day in her life, did no drugs, ate well, exercised and did yoga. She was never sick. She felt well enough to go on a months long vacation over-seas... While overseas, the pain became worse and worse, it got so bad she had to go to a overseas hospital. They completed CT and all kinds of imaging.. it turned out to be stage IV metastatic lung cancer. She never smoked a day in her life.. After battling this cancer for 8 months, she passed. I went on the war path after this happened - it turned out the \"sclerotic lesion\" picked up on the xray was already an indication for metastatic cancer (source unknown at the time), the family doctor didn't bother looking any further. I unfortunately trusted her family doctor too much as this was the only doctor of our lives.\n\nAfter this happened to my mother, I was ever vigilant of picking up things like this. Luckily for my career, as a result of my vigilance and the pain I went through, I ended up picking up all kinds of cancers simply by reviewing the radiology reports and doing exactly what the radiologist suggests (the radiologist often makes recommendations on repeat imaging after a certain amount of time, I'm surprised how many doctors simply don't follow up on that as simply doing a repeat imaging in a set time can catch a lot of cancers).\n\nAnother 2 examples I can recall. Also early in my career, in my first year of practice. This man came in for vague symptoms like fatigue, and just feeling something is not right. He wasn't able to pin point exactly what the problem was, he also never verbalized that he had any kind of neurological symptoms or even a headache. I did all kinds of blood work, bodily imaging but did not scan his head.. Luckily for me, there was this much older doctor at the end of their career in the office and simply wanted to see a few patients a day to pass the time. She ordered a head CT and found that this man had brain cancer... I didn't follow the case after that, but I wouldn't be surprised if this man passed on fairly quickly.\n\nDuring COVID times, I was doing all kinds of telephone medicine gigs. This one case stands out and is very similar to the ones I experienced before. Patient calls me about diffuse bodily pain, literally everywhere. She had already gone to several walk-in clinics and was discharged home with pain meds as the docs thought it was musculoskeletal... Well.. knowing what I know and what I went through, I ordered a bunch of basic imaging (xrays, ultrasounds) to actually look inside her body. Apparently, none of the other walk-in docs bothered to do this... Unluckily for her, it turned out to be some kind of metastatic late stage cancer, source unknown. The cancer was everywhere, thereby causing the pain. She died a few weeks later. I've never even met her in person, all this was done over the phone. The family was greatful and actually called the clinic to thank me personally for ordering these imaging when no one else had bothered to... The family said that she died fairly quickly after the imaging was done, they didn't even have time to find out the source of the cancer...\n\nSpeaking of sclerotic lesions.. I have a patient right now with this that I just picked up on imaging. I'm in the process of calling them in and do a full cancer work up... The uncanny thing is that the description of this lesion was exactly the same as the time it was used to describe my mother's lesion.... \n\nI've developed a reputation as a \"cancer whisperer\" of sorts in my circle of doctors.. The point is... don't be afraid to ask for basic imaging if you are experiencing unexplained pain lasting for a fairly long period of time. Cancers are much more common that you might think.",
   "created_utc": 1698956995,
   "score": 88,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jfpzh",
   "message": "Not a Dr but a nurse. Was Triaging in a\u0026amp;e and a man presented to the front desk complaining of shoulder bruising after a fall. Receptionists are not there to triage, they just take the patients description and write it down. We call those patients in for triage and then look at priority for treatment. \n\nWe called him through, and he starts casually telling us how he’s a mountain biker, came off his bike and landed on his shoulders. Landed on his shoulders falling head first. Landed on his shoulders falling head first off a small edge…\n\n\nHe pulls his t-shirt off over his head to reveal very extensive bruising around his arms, shoulders, back and neck.\n\nHe fell off his bike, over a ledge, down and 8 foot drop and landed on his head. \n\nIt was at this point that we both myself and the nurse with me sprung into action, gently lowering him down onto the trolly. Placing blocks either side of his head and, while explaining to him our concerns, taping him down. He then complained that he had had some neck pain. \n\nWe wheeled him to the X-ray down the corridor. He’d fractured two vertebrae in his neck and broken his shoulder. As far as I know he recovered. He certainly could have been far more unlucky and ended up with life limiting damage.",
   "created_utc": 1698948860,
   "score": 154,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j2ki9",
   "message": "EMT on an ambulance. Had a patient present with right sided rib pain of 3 days duration. Pain upon palpation and movement, no other chest pain or shortness of breath, and he wanted to get it checked out. Take him to local ER and think nothing of it. Walk through 20 min later for paperwork and he had gone into full cardiac arrest and CPR was in progress. Ended up living thankfully",
   "created_utc": 1698944122,
   "score": 205,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iz0tg",
   "message": "NAD, best friend’s dad went to the doc for some mild back pain. Friend’s dad pointed to a little black spot on the x-ray and went “what’s that?” He had stage 3 kidney cancer and had to have his kidney removed.",
   "created_utc": 1698942842,
   "score": 142,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7ji5vy",
   "message": "Was helping to move a bed down a flight of stairs.  It was one of those heavy adjustable beds.  Needless to say, I was pretty winded when we were done.  Didn't think much of it.  I had a doctor's appointment the next morning.  She asked about shortness of breath as a routine question, and on a lark, I told her about moving the bed.  She mentioned that it's possible I should get my heart checked out.  Go to the ER at my earliest convenience.  \n\nLater that day, I noticed that my back hurt.  Felt like I slept wrong.  No big deal.  Went to a optometry appointment.  Got new prescription.  Normal day, right?  Suddenly got very nauseous while picking out frames.  Threw up in the bathroom.  Felt a LITTLE better, so I finished what I was doing.  When we were all done, I remembered my doctor telling me to go to the ER to get checked and I was feeling a little off from the vomiting.\n\nWent to the hospital and the guy asks, \"What are you here for?\"  I responded lightheartedly that my doctor said I should probably get my heart checked.  He hooked me up to a portable heart monitor thingy and then shit got real rushed real fast.  Next thing I know, he's got a needle in my arm pumping in morphine.  It was then that I learned that I'm allergic to morphine.  Good times.  I remember asking him if my veins were supposed to turn bright red and itch like that.  The next thing I remember was waking up in a hospital room, completely alone. \n\nTurns out I had had a massive heart attack, with one of my valves 100% blocked.  They added 3 stents into various places but the fluid was so backed up that when they opened up the valve, it flushed into my lungs, filling them with liquid (this is how they explained it to me).  I spent the next week in bed (bored out of my mind), just waiting for the various diuretics to drain the fluid from my lungs.  \n\nTurns out, if I hadn't gone to the ER, I'd have likely been dead within the hour.  All from minor back pain and some nausea.",
   "created_utc": 1698949740,
   "score": 73,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7io864",
   "message": "NAD but I had a migrating headache (kept moving from base of skull to top) for over a week. Nonstop just kept on there. I ignored it and chalked it off to being in front of a computer all day. Started getting a pain behind my right eye. Still thought it was the computer. Everyone kept telling me I should probably go to the hospital and I kept saying no because I didn't wanna deal with waiting in the er for them to say I need to sleep more. Well I went and they took me back thinking I had bacterial meningitis. Got a horrible spinal tap and came back negative. The only conclusion was my immune system was attacking itself and that if I had waited any longer (than the week I already did) my immune system wouldn't have responded to any medication and just killed me thinking I was sick. Fun times. Fun fun times.",
   "created_utc": 1698938921,
   "score": 161,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j07sy",
   "message": "Nad.  \n\nWent to my pcp and indicated my lungs hurt.  Doc said it was anxiety, and i should download the calm app.  Smh?  I know something is wrong and not anxiety.  Went to a big big big hospital and discovered I had two rare lung infections.",
   "created_utc": 1698943275,
   "score": 137,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7jfhvk",
   "message": "NAD - 2 weeks before Christmas last year my brother went to the ER with a fever, his blood sugar was high and he said he just felt drained for the last month. He said no matter how much he was sleeping he was always tired. After doing bloodwork they discovered he had almost no platelets or white blood cells. My sister who is a nurse said his blood has the consistency of kool-aid. He was diagnosed with AML Leukemia. I went to see him in the hospital and I didnt think he was going to make it. He was transferred to a hospital that specilalizes in the disease and he was in the hospital for 2 months. Thankfully he is in remission and going back to work soon.",
   "created_utc": 1698948778,
   "score": 70,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j605o",
   "message": "My mum.\n\nShe had somewhat mild cough. And was way too tired. So she went to the local doctor. He told her that its just cough and adviced her to take that for 3 days. She went again, this time he adviced antibiotics for 5 days. It dodnt helped. Every time my mom ask him to refer her to some other doctor, or run some tests. Both cant be done without the doctor's reference.\n\nHe refused. So after around 2 weeks , she again went to see the same doctor and he was on leave and she almost collapsed. My dad took her to another doctor (doctor on emergency finally refered to her to some better hospital) and there they found that she has litres of fluid in her lungs. They again referred her to some specialist. After moving again again, we found out she had cancer, she died after 6 months of first collapse.",
   "created_utc": 1698945373,
   "score": 126,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j8jqg",
   "message": "Not a Doctor, but my Doctor would say, \n'Patient came in with a swollen red area under the armpit after having been seen at the emergency room two nights prior. I didn't like the look of it and I asked the other doctor in my office to take a look at it. She didn't like the look of it. I told him to go to the emergency room immediately. Turned out that he had necrotizing fasciitis and was in the hospital for 2 weeks.' \nI didn't know what it was but I got a fever of 104 that night I went to the ER. My white blood cell count was low though because the bacteria suppresses the body's normal reaction of releasing white blood cells. \nI got better.",
   "created_utc": 1698946284,
   "score": 62,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iqdd0",
   "message": "NAD\n\nI had chest pain for 2 days and figured it was muscular (it always is, I'm 34) but my partner kinda made me go to the hospital.\n\nTurned out I had a pulmonary embolism, systemic blood infection, and large unknown mass in my right aorta.",
   "created_utc": 1698939713,
   "score": 216,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j2bo8",
   "message": "Patient came in after seeing their PCP for a cough, just wanted some cough medicine so he could go to work.  PCP thought the cough sounded a bit too wet and sent him to the ED for CXR to make sure it wasn't pneumonia.  On arrival low grade fever, just barely tachycardic. Laughing, joking, looks great.\n\nOver the next couple hours just gets worse and worse, goes septic, then DIC, then unstable, then coded on 3 pressors.  Could watch his heart go from sinus tachy, to junctional, to 3rd degree heart block and code, was the most surreal thing.  Klebsiella pneumonia bacteremia with terrible pneumonia.",
   "created_utc": 1698944034,
   "score": 215,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7kb4wa",
   "message": "Patient - I went in describing that I'd woken up in the middle of the night shivering uncontrollably, then later woken up on the floor with a 500/10 headache and my entire body hurt. Told them this happened every so often, but this was the absolute worst one. I LOOKED fine, but FELT horrible.\n\nThey told me I was a drug seeking faker and kicked me out.\n\nA few weeks later, the same thing happened at my friend's house, except when I woke up the second time I was in the ER again already and when I talked with the doctor there, her jaw kept dropping lower and lower and lower, until she asked me \"how the fuck are you not dead yet?!\"\n\nApparently I had been describing the first person perspective of a seizure. Turns out I'd been living with undiagnosed epilepsy for several years.",
   "created_utc": 1698960221,
   "score": 54,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7iym5d",
   "message": "I was the patient in this one! My kid was 2 and had a bad cold. Nothing crazy, just a bit wheezy, a croup sounding cough, and sleeping a ton. My MIL was babysitting him and called me at work to get my opinion on how to treat him. I figured he was fine but she was worried so she called the nurse line. The nurse said he was likely fine but we should bring him in just to be safe, so I went home and brought him to the hospital. \n\nWe were talking the entire drive to the hospital, he was acting like a typical preschooler with a cold. It was just his breathing that sounded a little weird. I actually apologized to the nurse when we got into triage because I thought we were wasting her time. She took one look at his breathing, told me to follow her, and speed walked us back to a room. \n\nYea, he was having a major asthma attack and his oxygen was in the low 70s. My MIL likely prevented a way worse outcome by being a worrywart. He had asthma attacks every time he had a cold until he was like 5 and grew out of them. It was terrifying.",
   "created_utc": 1698942692,
   "score": 245,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7j1x7t",
   "message": "Veterinarian, not MD.\n\nDuring my internship, a woman came in with her 6-year-old labrador around 1am.\n\nLab lady: \"My dog needs an ultrasound.\"\n\nMe: \"Oh? What are you seeing that you're concerned about?\"\n\nLab lady: \"She left the house to go out on the porch this evening, and then she just laid down.\"\n\nMe: \"Is she eating and drinking ok? Any other issues?\"\n\nLab lady: \"Everything else is fine. But something is wrong with her.\"\n\nMe \"Well, how about we start with some x-rays?\"\n\nX-rays are taken - there's a very obvious splenic mass.\n\nMe: \"Ma'am, your dog needs an ultrasound.\"\n\n\u0026amp;#x200B;\n\nLong story short, it was lymphoma in the spleen. They did everything they could and bought her another 10 months or so. Very good dog and devoted owner.",
   "created_utc": 1698943890,
   "score": 33,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7ial9l",
   "message": "Obligatory not the doctor. I had a cough that wouldn’t go away. Chest x-ray found a spot on my thyroid. Ended up having it removed as it was cancerous. Cough ended up being asthma.",
   "created_utc": 1698933772,
   "score": 53,
   "submission_id": "17m2bn7"
  },
  {
   "comment_id": "k7l0294",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17m2bn7"
  }
 ]
}