{
 "submission_id": "17m5jpt",
 "title": "According to your ex, what exactly is wrong with you?",
 "selftext": "",
 "created_utc": 1698937536,
 "permalink": "/r/AskReddit/comments/17m5jpt/according_to_your_ex_what_exactly_is_wrong_with/",
 "score": 106,
 "url": "https://www.reddit.com/r/AskReddit/comments/17m5jpt/according_to_your_ex_what_exactly_is_wrong_with/",
 "comments": [
  {
   "comment_id": "k7irg0e",
   "message": "I'm too clingy (wanted to hang out once a week or so with my boyfriend of five years,) I'm manipulative (when we'd make plans to spend time together and he'd cancel 15 minutes before we were to meet, I'd be disappointed,) but most egregiously, I tend to overreact and take the nuclear option over things that shouldn't be that big a deal (I finally mustered the courage to break up with him after the third time he sent me to the hospital.)",
   "created_utc": 1698940104,
   "score": 72,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ip9xp",
   "message": "I don't trust, even though he had women staying the night \"in the spare bedroom\" and got an std when he went to Vegas without me. But yeah..totally on me for not trusting him",
   "created_utc": 1698939311,
   "score": 246,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ir5m1",
   "message": "That I caught him cheating so he couldn't trust me",
   "created_utc": 1698939999,
   "score": 73,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j0107",
   "message": "I'm apparently a narcissist because I wasn't considering how bad he felt after giving a stranger on the phone the username, password, and verification to our bank account and them emptying our account. Apparently, I should have been over it after 4 days.",
   "created_utc": 1698943208,
   "score": 75,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j0ooj",
   "message": "I will quote my ex wife. \"You believe too much in the 'sanctity of marriage' (she said that part in a mocking tone)\". She says when I found out she has 3 boyfriends.\n\nEdit: Shes messaged me and my current wife several times, she has called us 'a couple of prudes' for not being okay with having open relationships. I am much much happier now that I have ever been.",
   "created_utc": 1698943444,
   "score": 166,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iwwoh",
   "message": "I threw away three years because of ONE single mistake. (He punched me in the neck.)\n\nLol. \n\nBye.",
   "created_utc": 1698942079,
   "score": 137,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iydym",
   "message": "That I'm selfish for not supporting her.\n\nAfter her 5 DUIs. 6 trips to rehab. And a steadfast mindset she can \"drink socially\" without an issue.\n\nI tried to save you for 15 years, now I'm saving myself.",
   "created_utc": 1698942609,
   "score": 156,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iswhf",
   "message": "Penis is too big.  Or massive prick.  Something along those lines.",
   "created_utc": 1698940625,
   "score": 109,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iupds",
   "message": "According to him, I'm too emotional and controlling.\n\nThe reality: I threw a fit when I found out he cheated on me. I packed my shit and left him.",
   "created_utc": 1698941279,
   "score": 171,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ilapx",
   "message": "I don't open up enough.",
   "created_utc": 1698937833,
   "score": 140,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j904q",
   "message": "You need to seek therapy and process your traumas.\n\nI did. And I’m glad she helped me realize what was happening. Now we are both in a better place in life.",
   "created_utc": 1698946448,
   "score": 15,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ixoqz",
   "message": "I walk too confidently on the street. \"Should I walk slouching? Or in fear?\" She had no good answer.",
   "created_utc": 1698942355,
   "score": 160,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7inf7o",
   "message": "hold up lemme just ask her .... \n\n.... apparently I'm a stalker",
   "created_utc": 1698938625,
   "score": 219,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7imu1x",
   "message": "I think too much. (I think he doesn't think enough.)",
   "created_utc": 1698938407,
   "score": 87,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ixupj",
   "message": "I'm grumpy and quiet. Sorry I got cancer during a pandemic. That shit gets to you.",
   "created_utc": 1698942415,
   "score": 99,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iy8ek",
   "message": "Too introverted and not open enough with my feelings.\n\nI don't really think that's true anymore today, but it certainly was back then.",
   "created_utc": 1698942553,
   "score": 201,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jcyce",
   "message": "I’m just crazy…. along with all his other exes coincidentally",
   "created_utc": 1698947855,
   "score": 69,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ikm76",
   "message": "I type too loudly in bed apparently. It's distracting.",
   "created_utc": 1698937581,
   "score": 224,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jg7wr",
   "message": "The fact that I didn't decide I was poly along with her, five years into our monogamous relationship lol",
   "created_utc": 1698949041,
   "score": 169,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jcmnt",
   "message": "Too clingy. And my god was she right. I'm never like that, but with her I morphed into an anxiety ridden weirdo.",
   "created_utc": 1698947739,
   "score": 110,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7in8it",
   "message": "I never open up enough when I did open up “you vent/talk about your feelings to much” like damn",
   "created_utc": 1698938556,
   "score": 193,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iyjef",
   "message": "I wanted to have an orgasm once in a while too.",
   "created_utc": 1698942664,
   "score": 135,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7in3oz",
   "message": "My ex had Borderline Personality Disorder.  So, I was the devil incarnate after 8 months.",
   "created_utc": 1698938506,
   "score": 144,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jdzuy",
   "message": "\"You're too kind, that's why nobody loves you.\"",
   "created_utc": 1698948233,
   "score": 84,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iuo8g",
   "message": "If I had to guess, I was too selfish, and didn't appreciate her enough\n\nI also didn't take care of myself, put in enough effort for her\n\nAnd I'll regret all of this for a long time",
   "created_utc": 1698941267,
   "score": 74,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ivytz",
   "message": "I am a ghoster. Maybe i did ghost her but i find out your best friends are terrible animal hoarders/neglecters and your other best friend went to prison for assualting an infant, and you have no issues with that??? You dont deserve more than a \"this aint it\" text.",
   "created_utc": 1698941740,
   "score": 159,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iz2jx",
   "message": "Apparently I was a narcissist. Gaslighting was her middle name 🤦🏽‍♂️",
   "created_utc": 1698942859,
   "score": 108,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7il372",
   "message": "I'm too possessive, and that was 35 years ago, happily married for 3 decades.",
   "created_utc": 1698937756,
   "score": 69,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iuyqg",
   "message": "I pointed out too many flaws (held him accountable and pointed out he was missing his antidepressants, drinking too much/often for his mental health to be good and saying it was a bit shit coming home at 2am when you've said 8pm).",
   "created_utc": 1698941373,
   "score": 98,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jar0e",
   "message": "I broke up with her over peer pressure, I was weak.  \n\n\nThe same people tried that same tactic again on my now wife, clearly it didn't work.   \n\n\nIt's not happening again.",
   "created_utc": 1698947068,
   "score": 56,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iqcyl",
   "message": "I am so monumentally selfish that I refused to make everything about her and what she wanted 24/7.",
   "created_utc": 1698939709,
   "score": 44,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jomly",
   "message": "My abusive ex mesaged me on Instagram out of nowhere about two years after we broke up, sent me a wall of text about how basically everything that went wrong in her life is my fault and that I don't deserve happiness of any kind, and that I'm apparently going to kill someone one day. So apparently I'm Satan. \n\nShe abused *me*. Her mind must be beyond twisted for her to believe that.",
   "created_utc": 1698952082,
   "score": 20,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j01dj",
   "message": "I didn’t have sex with him for two years after he serially cheated on me for 24 years.",
   "created_utc": 1698943212,
   "score": 98,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ip6xt",
   "message": "I caused the holocaust in Germany.",
   "created_utc": 1698939280,
   "score": 63,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7izgvc",
   "message": "Well, she said that all men are dogs, so I, being a man, am a dog according to her.",
   "created_utc": 1698943004,
   "score": 16,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jc72g",
   "message": "“It’s not you, it’s me” always means the opposite.",
   "created_utc": 1698947586,
   "score": 18,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ipl5c",
   "message": "I have anger issues and am too emotional.",
   "created_utc": 1698939427,
   "score": 39,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jfr2p",
   "message": "It was that I was too paranoid after he cheated and needed too much reassurance afterwards. \n\nNow I know what my real problem was: I didn't leave right after he cheated. Its never a mistake to leave a cheater. It's always dangerous to give people who hurt you the benefit of the doubt. No matter who they are.",
   "created_utc": 1698948871,
   "score": 35,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ikpf8",
   "message": "I got fat.",
   "created_utc": 1698937615,
   "score": 60,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j15nb",
   "message": "According to my ex, I'm the most selfish human being. I never pay attention to anyone or anything outside of myself, I fail to understand what's actually going on in relationships, and need to be saved from myself because I'm unable to make choices for myself. I'm emotionally unavailable, behave like a child. I'm also entirely unable to focus outside of myself, to remember their perspective, to remember their personality, to remember how good and kind they've been. Sex with me is boring because I never want to experiment or try new things. Lastly, I'm willing to give up a 10+ year relationship over nothing, leaving very suddenly one night and not actually giving us a chance to figure it out and talk about it, so since I'm so immature and unable to make choices, it's just a matter of time before I kill myself.\n\nI left seven years ago.",
   "created_utc": 1698943615,
   "score": 50,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jfjsk",
   "message": "I don't make enough money.",
   "created_utc": 1698948797,
   "score": 14,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ioajz",
   "message": "I’m positive that more than one of them refer to me as a cold-hearted bitch.",
   "created_utc": 1698938945,
   "score": 38,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jar64",
   "message": "I'm just full of anxiety, and I'm too logical.",
   "created_utc": 1698947069,
   "score": 27,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j4c6a",
   "message": "That he saw my needs as a burden, which was why I had worked really hard to appear to be the “cool girl”who doesn’t have any needs. This was an effective strategy for a miserable relationship.",
   "created_utc": 1698944766,
   "score": 32,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jok2a",
   "message": "I was ‘too critical’ about how he deliberately triggered my phobia at my birthday party.",
   "created_utc": 1698952056,
   "score": 11,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7irmua",
   "message": "I didn’t talk enough and I took too many drugs and I drank too much.",
   "created_utc": 1698940173,
   "score": 23,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7jay1w",
   "message": "In elementary school I told a girl I liked her, which caused the other boys in my class to tease me about it. When I pushed someone who was heavily teasing me, the girl called me cold hearted and didn't want anything to do with me after. It has stuck with me since...",
   "created_utc": 1698947137,
   "score": 20,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7k0229",
   "message": "I never argued and was too easy going with my go with the flow attitude. Which apparently is wrong.",
   "created_utc": 1698956207,
   "score": 7,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j20ou",
   "message": "I got fat, wasn’t pretty enough anymore. \n\nJokes on him, he’s still single and living with his brother and I’m quite happily married to a guy who loves me no matter what I look like.",
   "created_utc": 1698943924,
   "score": 46,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7iniyk",
   "message": "My last ex doesn't really think anything is wrong with me. She just said weren't compatible as a couple to which i agree.\n\nMy ex before that though said I'm not adventurous enough and i lie too much. I'm probably not that adventurous but i never lied to her she just had some huge trust issues for some reason so always thought i was lying when i wasn't.",
   "created_utc": 1698938664,
   "score": 15,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7ipuo4",
   "message": "What's not?",
   "created_utc": 1698939523,
   "score": 6,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7j7p91",
   "message": "everything lol",
   "created_utc": 1698945981,
   "score": 11,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7il0t0",
   "message": "I'm addicted to sex.",
   "created_utc": 1698937732,
   "score": 18,
   "submission_id": "17m5jpt"
  },
  {
   "comment_id": "k7l3zoa",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17m5jpt"
  }
 ]
}