{
 "submission_id": "17mwu85",
 "title": "What fast food place would you never eat from and why?",
 "selftext": "",
 "created_utc": 1699023080,
 "permalink": "/r/AskReddit/comments/17mwu85/what_fast_food_place_would_you_never_eat_from_and/",
 "score": 95,
 "url": "https://www.reddit.com/r/AskReddit/comments/17mwu85/what_fast_food_place_would_you_never_eat_from_and/",
 "comments": [
  {
   "comment_id": "k7nzxjh",
   "message": "McDonalds on Whitman lane in Lacey Washington. \n\nI was picking up an order from there once and there was a single used (dirty) shoe on the counter where the orders were being picked up. The fact that I stood there for 20 minutes and not a single person did anything to move the shoe was disturbing.",
   "created_utc": 1699027323,
   "score": 197,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7olu2c",
   "message": "Panera Bread serves sandwiches I could make in three minutes at home for a buck.",
   "created_utc": 1699035344,
   "score": 102,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7pezth",
   "message": "As much as I enjoy their food, it's got to be 5 Guys. Recently, I had a burger, small fry, and a small drink. $26. I could've gone to the Longhorn next door and had meal with a beer for the same price.",
   "created_utc": 1699046177,
   "score": 89,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o3gdn",
   "message": "[removed]",
   "created_utc": 1699028594,
   "score": 156,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7ocipg",
   "message": "Fishy Joes. I heard the popplers are alive.",
   "created_utc": 1699031926,
   "score": 128,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o9iaa",
   "message": "I have to say that as someone that ate fast food for over 30yrs regularly that I have cut it mostly out of my life period. The reason, the cost. It used to be a quick easy way to eat. Now they cost as much as many sit down resturants and not a value. I eat at home more now",
   "created_utc": 1699030817,
   "score": 127,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nps46",
   "message": "Agree with all those saying Subway here.\n\nI have no idea how and why people are still going there in a world where we now have sooo many better options.  Jersey Mikes, Firehouse, Jimmy Johns, Which Wich?, and even WaWa and Publix blow their subs out of the water (pun intended).",
   "created_utc": 1699023581,
   "score": 191,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o0vzd",
   "message": "Little caesers - specifically the one I used to work at for 3 years. We had issues with our ovens not coming to cooking temperature (staying at 250ish) our owner - instead of repairing or replacing the ovens, had us just run pizzas through 3-4 times until they were fully cooked. One shift I was manager on our oven temp didn’t go above 175, yet he still wanted us to stay open and serve undercooked pizzas.",
   "created_utc": 1699027669,
   "score": 75,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nyt0t",
   "message": "Burger King it used to be ok for some things, but now it's a waste of money",
   "created_utc": 1699026920,
   "score": 50,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o42yz",
   "message": "Popeye's.\n\nNot because of the food, but because every.. single.. one is managed by and employed by the dumbest people on the planet. I have 3 in my city. Not a single one has EVER gotten an order right and it's not fucking rocket science. Order some chicken strips? Get chicken legs.. WHAT THE HELL IS WRONG WITH YOU. They're always dirty as fuck getting health code violations. I'm always waiting in the drive through for 10-30 minutes for my order, which again somehow is always wrong and cold. They always have a massive amount of negative reviews on Google maps. It's not just my city either. I've tried dozens across the country. They're all fucking shit holes. Absolutely boils my blood, because their chicken sandwich is amazing and I like their chicken strips with their sweet heat sauce.",
   "created_utc": 1699028822,
   "score": 186,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nwo9d",
   "message": "Tim Hortons is dogshit. Nothing there is remotely good. Subway also sucks ass and the smell from those places is revolting.",
   "created_utc": 1699026150,
   "score": 56,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nonv9",
   "message": "Subway because it fucking sucks.",
   "created_utc": 1699023165,
   "score": 219,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o3kqc",
   "message": "Arby’s since they discontinued the Potato Cakes. They are dead to me now.",
   "created_utc": 1699028638,
   "score": 225,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nzp6r",
   "message": "Every few years I would try white castle again. I would always go to a different white castle too. Each time it's bland and mushy. Even by fast food standards this is pretty terrible",
   "created_utc": 1699027237,
   "score": 16,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7ofj93",
   "message": "I used to frequent fast food places all the time, but at some point in the last 3 years or so, fast food became substantially more expensive than regular restaurants. Costs like $17 for a standard meal at most fast food places now.\n\nSo, the only fast food I eat now is when I'm in a huge rush and don't have time for anything except drive-thru, otherwise I avoid them. The cost-to-quality ratio has just gone completely bonkers. Would much rather just spend $12 and get a real meal at a normal restaurant.\n\nI think the fast food industry is going to be completely dead in 5 years, the way things are going. Which is kind of a shame, honestly, because it had its place - sometimes you don't want a fancy restaurant that takes an hour, sometimes you don't want to eat what's at home, and sometimes you just want to buy a $5 burger that's going to be exactly what you expect it to be because it's always exactly the same every time. A big mac isn't a particularly good burger, but I know exactly what it is and what it tastes like, so sometimes when I don't want to think about where to eat or roll the dice on how it might taste, I'd like to just pick what I already know, and is reasonably inexpensive. But if it's not inexpensive anymore, then it loses that appeal.",
   "created_utc": 1699033033,
   "score": 189,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o2aps",
   "message": "I moved to New England 7 years ago and why dunkin is so popular is beyond me. Donuts are mediocre at best and their coffee is god awful.",
   "created_utc": 1699028177,
   "score": 185,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nokq7",
   "message": "Subway.  Just don't like their breads (far too sugary).",
   "created_utc": 1699023132,
   "score": 73,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nsl59",
   "message": "Burger King. Burger King was good in the 90s, but now it's complete nasty garbage. The last time I tried Burger King, I went inside. The cashier had snot and drool going down his face. He was sweating heavily like he was working in a steel plant.. I felt sick when I looked at my food at home. I threw it in the trash and ate a snack.",
   "created_utc": 1699024640,
   "score": 61,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o0s4p",
   "message": "Long John silvers",
   "created_utc": 1699027630,
   "score": 2,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o10r8",
   "message": "All of them. The price, quality and serving sizes are fucking ridiculous.",
   "created_utc": 1699027717,
   "score": 76,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7ob1um",
   "message": "In and Out, Jack in the Box, Whataburger\n\nBecause we don’t have them here",
   "created_utc": 1699031387,
   "score": 131,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o714m",
   "message": "I genuinely have no idea how Long John Silver stays open. Nobody ever suggests going there, there isn't the thing on the menu that people are crazy about, you never event think about them until you happen to pass one while you're in a big city.",
   "created_utc": 1699029914,
   "score": 68,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nutcg",
   "message": "Subway is the worst and isn't close. What is that unholy smell that ruins your clothes for the day the second you walk in there?",
   "created_utc": 1699025468,
   "score": 117,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7opzj2",
   "message": "Popeyes.  They always seem filthy.  Only place I decided not to drink my drink the soda fountain was such a mess.",
   "created_utc": 1699036871,
   "score": 42,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7ofd20",
   "message": "Subway. If I’m gonna buy a sandwich, I’m gonna spend the little bit extra and get Jersey Mikes so I have something actually edible.",
   "created_utc": 1699032969,
   "score": 161,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o8e8u",
   "message": "Five Guys. A burger and fries shouldn't cost $18 at a fast food joint.",
   "created_utc": 1699030412,
   "score": 94,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7ny8qs",
   "message": "Klimpy's. I don't understand the plate or platter question so I refuse to answer.",
   "created_utc": 1699026720,
   "score": 80,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o05fw",
   "message": "Arby's\n\n\"the meats\" sounds like a chronic condition and I don't want it.",
   "created_utc": 1699027401,
   "score": 81,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7o8pu6",
   "message": "You’ll never convince me that 5 Guys is worth the money. Way over priced for a mediocre burger.",
   "created_utc": 1699030528,
   "score": 193,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7nzw6k",
   "message": "Firehouse subs. \n\nI order a regular (9 inches) sub sandwich combo the other day. The combo comes with a fountain drink + a small bag of chips. The price came to out to be $18.15. \n\nThat's too much fucking money. They're price gouging people. A couple years ago it was around ~$14 and now they jacked up the prices to something unsustainable. \n\nNever again will I be going to Firehouse subs. The food is good, but I'm not paying full service prices for a QSR .",
   "created_utc": 1699027309,
   "score": 174,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7oku0b",
   "message": "McDonald’s. I used to work there. The food should not be allowed to be called food.",
   "created_utc": 1699034975,
   "score": 77,
   "submission_id": "17mwu85"
  },
  {
   "comment_id": "k7ovlwr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17mwu85"
  }
 ]
}