{
 "submission_id": "17ndp4a",
 "title": "People that had sex with coworkers - how did that turn out ?",
 "selftext": "",
 "created_utc": 1699071417,
 "permalink": "/r/AskReddit/comments/17ndp4a/people_that_had_sex_with_coworkers_how_did_that/",
 "score": 18,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ndp4a/people_that_had_sex_with_coworkers_how_did_that/",
 "comments": [
  {
   "comment_id": "k7r3hku",
   "message": "One of my first jobs was Target, everyone was banging everyone. Thankfully no awkward moments.",
   "created_utc": 1699073928,
   "score": 185,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r57u5",
   "message": "fling with the sexy food service felon at one of my first jobs resulted in my first orgasm and my car getting totaled",
   "created_utc": 1699075068,
   "score": 98,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7qzrwa",
   "message": "I had resigned and was leaving the company anyways but it was one of those classic hookups at a company party. Had fun for a while but then she decided to stop seeing me. I'm glad I had left the company by then, otherwise things would have been messy.",
   "created_utc": 1699071668,
   "score": 160,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r463c",
   "message": "We worked together for a couple years and became close friends before we crossed the romance line one night after a lot of drinks. Honestly it was and still is amazing. Happily married now over 15 years with 2 kids.",
   "created_utc": 1699074372,
   "score": 28,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r41es",
   "message": "I got fired and she got fired and all 20 guys she fucked while we were dating were fired.",
   "created_utc": 1699074287,
   "score": 96,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4hh6",
   "message": "No good. She got with another co worker and is still with them. \n\nHad the chance to go on a date with a recent co worker but said no....then went home and had a wank.",
   "created_utc": 1699074577,
   "score": 144,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r3j0k",
   "message": "Married that bitch. Had 3 kids. Don't tell her I called her a bitch.",
   "created_utc": 1699073953,
   "score": 208,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r7r6u",
   "message": "Worked at a casino as the only male cocktail waiter / bartender (roughly 8 cocktail waitresses and 4 female bartenders). The floor was mostly women between the bar, servers, restaurant, and dealers.\n\nSlept with one of the cocktail waitresses for a couple months even though i knew i had a bigger crush on her than she did on me. Also knew i didnt really want a relationship with her for a couple reasons.\n\nEvidently she told some people and gave me good reviews. After she quit and moved away i had more interest than i really knew what to do with and kinda just went for it with anyone who showed interest that i was attracted to as i knew i had no more than a year left there no matter what happened. Ended up with 4 more of them over the course of a couple months\n\nOne time on a shift i looked around and all 4 were on the floor somewhere. All knew each other but im not sure any knew about the whole situation, and none were any false impressions of a relationship as far as i know so nothing bad came of it.",
   "created_utc": 1699076874,
   "score": 157,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r5al1",
   "message": "So my wife of over 10 years whom had cheated in the past and I forgave her, she got a huge promotion at work which caused us to relocate. I guess she got tired of me because she kicked me out and were getting a divorce. 4 months later, I found out that a co-worker had a thing for me so I took my shot. The sex was amazing. It could be that it’s been a long time for me since sex with the wife was basically non existent for the last few years of marriage.\n\nMe and the co-worker have now been dating for over a year and I haven’t been happier. So for me, it worked out for the best. And the sex is still great!",
   "created_utc": 1699075120,
   "score": 62,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4e2j",
   "message": "We ended up dating for 12 years and had a couple kids along the way.",
   "created_utc": 1699074515,
   "score": 128,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r5ne8",
   "message": "She's sleeping next to me, cuddling our cat.\n\nTurns out our chemistry working behind the bar together was also amazing outside of work.",
   "created_utc": 1699075362,
   "score": 31,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r46bs",
   "message": "Married 11 years, 3 kids, still going strong.",
   "created_utc": 1699074376,
   "score": 188,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r7hms",
   "message": "Met thru work. Dated for 1.5 years. She cheated with another coworker who is married. We broke up. She started to date a different coworker. Not the married one. She paraded that relationship in my face.\n\n\nEverything was great until it wasn't. Really fucked over my self esteem and self worth for years. Sucked that I had front row seat to her moving on.",
   "created_utc": 1699076680,
   "score": 192,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r1twj",
   "message": "Don't know, but my ex-wife did with one of her former coworkers and told me he was better.",
   "created_utc": 1699072898,
   "score": 232,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r39jb",
   "message": "Pretty fine. We worked at different locations in the company the first time we slept together, but. Knew each other as she had trained at my location. One night we ran into each other at the bar and one thing led to a other. A couple months later I ended up getting transfered to the location she was at and we just acted like it never happened.\n\nAfter a month or two of working together, we ran into each other again at the same bar, and history repeated itself. There was a slightly awkward moment a couple days later when I had to find a way to give he back the necklace she'd left at my place without anybody noticing, but other than that, our working relationship didn't change at all.",
   "created_utc": 1699073784,
   "score": 108,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4m4p",
   "message": "Pretty good. We have a kid together. Granted we'd been married for 7 years before we became coworkers.",
   "created_utc": 1699074661,
   "score": 219,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4vny",
   "message": "Had one good experience one bad. The first one we ended up dating for a year and a half. Had a ton of fun sneaking around at work, and even though in the end he totally broke my heart, it wasn't a bad experience. The second one very bad. Do not recommend 😬 I thought he would be safer because we were friends, so I figured communication and rules would be no problem. Instead we didn't communicate at all because we were both so worried about hurting each others feelings. Ended badly with major assumptions on both ends and now it's very akward uncomfortable. Makes me sad because honestly, I just miss my friend. While the experience can be fun, I don't recommend it.",
   "created_utc": 1699074839,
   "score": 171,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r5u35",
   "message": "Slept with a few. Those were fun and they weren’t strange afterwards. \n\nI also ended up dating a couple.  \n\nOnce a girl I lived with and I both got hired at a new club. We pretended we didn’t know each other.  We worked there months without our coworkers knowing. \n\nI think, if you are adults and talk stuff through, it’s fine.  But it’s also like playing with fire. I’ve seen coworkers that slept together, mad at each other and that’s always a shit show to watch.",
   "created_utc": 1699075490,
   "score": 88,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r48c3",
   "message": "Been together 11 years, and married for 7. Best decision of my life.",
   "created_utc": 1699074413,
   "score": 68,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7rgn9h",
   "message": "We had an instant connection the moment she joined the foundation I had been working at for a year. We worked at the front desk together and we got to know each other very quickly. Neither of us enjoyed small talk and we would get angry emails from our unbelievably incompetent manager about the amount of laughter coming from the front desk. We got all of our work done, and then some, our manager just felt like she was getting left out. Which our manager was, but it was because she sucked.\n\nI worked from home 4 days a week before my new coworker started and a few weeks later she asked me why I was coming in every day. I told her something about training her how to answer the phones, which she  instantly knew was bullshit (we got 4 calls a day, max). \n\nThe first time we hung out outside of work we told each other it would be a terrible idea to date. That lasted for about 10 days. The next time we hung out we slept together. \n\nThat was a year and a half ago. \n\nWe left the foundation after she told our manager that her \"management style\" was untenable in an email. The two of us then called a meeting with her and we laid out a very well planned strategy for departmental growth and change. Our manager nodded her head the whole meeting and told us how proud of us she was for taking ownership of our careers and how excited she was to implement our new plan. Three weeks later they fired my coworker. They pushed me out, telling me that they no longer had a place for me (at my review the previous year, the CEO told me herself that she believed I had CEO potential). \n\nWe both have new jobs, she is a highschool English teacher at one of the best highschools in the country and I became a private investigator. \n\nHer dad and I go to college football games together and our mom's get lunch and do spa dates. \n\nWe have been showing each other how to heal and grow as individuals and as partners. \n\nRight now she's sleeping in my bedroom while I type this in the living room. I don't know what the future holds for us but I do know that she's the love of my life. \n\nSleeping with my coworker is the best thing I've ever done.",
   "created_utc": 1699084067,
   "score": 105,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r3t94",
   "message": "We got married 38 years ago.",
   "created_utc": 1699074139,
   "score": 226,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r74eg",
   "message": "First one I got a talking by the boss but no consequence \n\nSecond one was actually my boss’ suggestion (different job). That one turned in to a wild and wonderful year of debauchery together\n\nThe third one was just a one drunken night and we ended up having sex on the same bed with our passed out coworker there. \n\nThe fourth one, we got married then divorced \n\nThe fifth one we bought a house and a dog together and are probably gonna be together for the rest of our lives. \n\nMoral of the story: shit where you eat. Especially in healthcare and love will find a way",
   "created_utc": 1699076412,
   "score": 41,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7rb8de",
   "message": "“When you come into work tomorrow DONT give me that look”\n\n“What look wdym?”\n\n“The haha I fucked you look”\n\nShe was fun.",
   "created_utc": 1699079555,
   "score": 97,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r3btq",
   "message": "Dated for over a year then one day randomly decided to break my heart. Thankfully stopped working together by that point. Still makes me tear up thinking about her though",
   "created_utc": 1699073826,
   "score": 53,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r67f1",
   "message": "Moving in together in rather quickly at age 19, She was diagnosed with multiple sclerosis at aged 20. Lived and loved and cared for her for 17 years and though she died at age 35",
   "created_utc": 1699075755,
   "score": 168,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r5jks",
   "message": "It was hot af, then married and 13 years later have 3 kids. We have an incredible relationship.",
   "created_utc": 1699075289,
   "score": 69,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r6eyi",
   "message": "She suffered a mental breakdown from family issues. I got fired due to perceived conflict.  Cascaded into... call it worse things.\n\n0/10. Would not recommend.\n\nFuck HR in the goatass.",
   "created_utc": 1699075906,
   "score": 93,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7rawt1",
   "message": "We started as friends with benefits (restaurant life lol ) and then she started making me mozzarella sticks every day RIGHT when I came in as a 22 year old hungover idiot who ran on those damn cheesy delicious things. Classic server meets kitchen person but reversed roles, 9 years later we have a 6 and 1.5 year old and are thriving, but god damn I have a whole ass story about how I fell in love with my wife. She’s tired of hearing it at this point but I still love telling it almost as much as I love her. \n\nEdit: Okay I typed like 3/4 of a novel story then babe took my phone to play a game and the post didn’t save. I’m not typing out the 6 paragraph story I have tonight. Here’s a promise to do it tomorrow for anyone that cares. TLDR, girl meet boy, boy meets girl. They hate each other. They get to know each other. FWB turns into feelings, turns into a whole ass family with the house, dog, kids, ect. Here’s something to look forward too I’ll type it all out tomorrow but I can’t do it a second time tonight, worked a double and I’m goin to bed. Love y’all, talk to ya soon 🤙🏻",
   "created_utc": 1699079294,
   "score": 155,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r67dc",
   "message": "It was all going fine until she found a red dot on a cashmere sweater I'd gotten for her.",
   "created_utc": 1699075754,
   "score": 173,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7qzkov",
   "message": "We've been living together for 11 years now.",
   "created_utc": 1699071554,
   "score": 210,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r7i9a",
   "message": "Terrible idea. Worked together for 2 years. Lots of obvious jokes about sexual tension. One Christmas Party with everyone making urging comments we finally kissed. Worst decision ever. \n\nBeen married for 26 years now",
   "created_utc": 1699076694,
   "score": 48,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4gla",
   "message": "We ended up dating and quit together 8 months later. Its now a year into it and I have plans to propose during the solar eclipse next year. She’s given me two wonderful step daughters and a home to build a family together in :) I think it worked out pretty well for me!",
   "created_utc": 1699074561,
   "score": 113,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r2gbt",
   "message": "Always make sure you discuss if you want other coworkers to know or not.",
   "created_utc": 1699073279,
   "score": 73,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r473w",
   "message": "Live together now",
   "created_utc": 1699074391,
   "score": 23,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r5r5d",
   "message": "Well after 2 years, we are together, but it may have caught up with us. I may be resigning in a few days.",
   "created_utc": 1699075433,
   "score": 23,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r44ku",
   "message": "she liked me a lot more than i liked her, which was not very much after I got to know her better, but i hate conflict so i just delt with it. It got weird, and it was an everyday uncomfortable weird. It was a recurring nightmare and the only way out of it was to give in to her. Thankfully she eventually got fired for an entirely unrelated issue, attendance i think, and then i never had to see her again.",
   "created_utc": 1699074345,
   "score": 89,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7qzsqv",
   "message": "Some worked out well, some worked out less than well. I married one!",
   "created_utc": 1699071681,
   "score": 59,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r603o",
   "message": "ended badly. missed the bathroom bjs",
   "created_utc": 1699075609,
   "score": 17,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7rajog",
   "message": "Worse thing ever. Ended up marrying her, buying a house getting two dogs and 3 chickens.\n\nAnd a Boat.  The horror I face on a daily basis is not for the weak .",
   "created_utc": 1699079006,
   "score": 20,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r6o4b",
   "message": "I showed up at his house in fuck me boots, lingerie and a trench coat. Had some mind blowing sex. Our 18 year anniversary is coming up in December. We have a daughter together.",
   "created_utc": 1699076091,
   "score": 43,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r11ws",
   "message": "Ive never dated a coworker, but ive hooked up with some (5+), ive never had any bad outcome. If the coworker talked about my small appendage or lack of ability in bed, they did it a manner that never got back to me.",
   "created_utc": 1699072430,
   "score": 46,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7qzshj",
   "message": "Do not recommend.",
   "created_utc": 1699071677,
   "score": 151,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7rm09r",
   "message": "Wow. The moral of the story here is definitely sleep with your coworkers if you can. turns out wonderful",
   "created_utc": 1699088635,
   "score": 15,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r60me",
   "message": "Outcomes still pending",
   "created_utc": 1699075620,
   "score": 13,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4338",
   "message": "Oh my goodness where do I start….\n\nOne is now the OBGYN to several other coworkers I’ve slept with, so that’s fun.",
   "created_utc": 1699074318,
   "score": 30,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r6523",
   "message": "We're still fucking on and off. Medical field, cliche. She got a job at a different facility so we see each other a lot less now. It's really just a boredom thing like, we don't really like each other as people lol.",
   "created_utc": 1699075709,
   "score": 29,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r7sy6",
   "message": "1st time: super fun but I got more attached than she did \n\n2nd time: kinda fun but she got more attached than I did.\n\nMoral of the story: don’t fuck coworkers unless you’re SUPER SURE",
   "created_utc": 1699076909,
   "score": 13,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4nda",
   "message": "Turned out great, best sex I’ve had and we’re still friends",
   "created_utc": 1699074684,
   "score": 23,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r7onn",
   "message": "Dated a 19yo coworker when I was 16. She was in college and the supervisors at our grocery store weren’t happy about it. We eventually broke up…then I dated our supervisor who was 23 and I was 18. We both quit the same day and dated for like 6 months until I moved away for school. If I could go back I wouldn’t have left, I still miss her. Shaws grocery was not happy with me though",
   "created_utc": 1699076822,
   "score": 24,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r5i1z",
   "message": "Married 34 years.  Only worked together about six months after hooking up.  Made work a lot more fun.",
   "created_utc": 1699075261,
   "score": 10,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7rbvyd",
   "message": "Been together 5 years. Bought a house together. About to propose to her",
   "created_utc": 1699080083,
   "score": 11,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7ro96v",
   "message": "All these replies are just 'we got married, had kids and lived happily ever after.' Bitch, you know full well those aren't the stories people come into these threads for.",
   "created_utc": 1699090508,
   "score": 35,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r6raa",
   "message": "I’ve slept with about 15 coworkers that I can think of and they were all fun, no drama hookups. I kinda had a huge crush on one so I was kinda dying inside when she got a boyfriend but them’s the breaks. No wait that’s happened like 3 times that I catch feelings.",
   "created_utc": 1699076154,
   "score": 24,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r1gds",
   "message": "We're still friends and hang out",
   "created_utc": 1699072670,
   "score": 22,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r22tx",
   "message": "We’re now married with 2 kids.  Still working together as well.",
   "created_utc": 1699073051,
   "score": 19,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7r4la2",
   "message": "It wasn’t good",
   "created_utc": 1699074646,
   "score": 9,
   "submission_id": "17ndp4a"
  },
  {
   "comment_id": "k7rhmee",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ndp4a"
  }
 ]
}