{
 "submission_id": "17ntv2z",
 "title": "People who entered a relationship thinking \"I can fix them\"; how did that go?",
 "selftext": "",
 "created_utc": 1699127663,
 "permalink": "/r/AskReddit/comments/17ntv2z/people_who_entered_a_relationship_thinking_i_can/",
 "score": 192,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ntv2z/people_who_entered_a_relationship_thinking_i_can/",
 "comments": [
  {
   "comment_id": "k7tz78d",
   "message": "Fixed them to the point they cheated on me 🥲",
   "created_utc": 1699127963,
   "score": 119,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ucloj",
   "message": "There is a weird thing that happens when you \"fix\" someone. They tend to think if you liked them broken, then they deserve better than you now that they are better than they were.",
   "created_utc": 1699133163,
   "score": 137,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u0ry0",
   "message": "Now we are both broken",
   "created_utc": 1699128547,
   "score": 129,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u717x",
   "message": "Well I didn't *go in* with a mission to fix anyone but in both relationships and friendships, I tend to \"fix\" people at which point they realise that they can do a lot better than me and move on (which makes it sound kind of bad, but it's not it's just a fact).",
   "created_utc": 1699130954,
   "score": 6,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ucx7e",
   "message": "I found out that he was a lot more broken than I initially thought. And when I came to terms with that, it got even worse. Seeing other people, secret OF account, crazy kinks, you name it. There came a time that I realized I had to choose between trying to save him, or save myself, and the latter seemed like a more reasonable option. Saving us was never going to be an option.",
   "created_utc": 1699133292,
   "score": 83,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ueno4",
   "message": "I fixed what I wanted to fix, but that still didn't make us right for each other. In the end, I think she's in a much happier place than she could have been, so I think it was worth the time invested. We were wrong for each other, but at least we both came out better positioned to receive the happiness that would come to us later.",
   "created_utc": 1699133986,
   "score": 66,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7tz3mb",
   "message": "It didn’t work. It never works.",
   "created_utc": 1699127925,
   "score": 153,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ucwju",
   "message": "alright, here's the thing about mechanicin' a human heart – it's no small task, it's a project car that's always a heartbeat away from stallin' out, and when you roll up your sleeves thinkin' you got all the wrenches and wisdom to turn a fixer-upper into a smooth sailin' cruiser, well, you're settin' up shop for a whole saga of sweat, tears, and the kinda grease that don’t wash off easy\n\nso there i was, toolkit in hand, ready to dive under the hood, naive enough to believe that love was the ultimate WD-40 and elbow grease could polish any rust, but hearts ain't engines, and souls ain't simple, turns out, human beings are more complex than a spaceship dashboard, and you can’t just replace parts or tighten a screw and expect everything to hum nice and tune-like\n\nand it’s like, you start off with this vision, right? a shiny classic car in mint condition, but the longer you're at it, you start to see, it ain't just the carburetor or the spark plugs, it's the wiring, the timing, the history of collisions, and all those miles, oh, those miles that add up to a journey you weren't part of, roads and paths that you can't just pave over with good intentions\n\ni learned, the hard way, that sometimes, that check engine light is a signal flare, it’s sayin', “back off, buddy, this is a solo trip,” and every attempt to patch things up, it’s like usin' duct tape on a dam, might hold for a tick, but that pressure builds, and soon enough, you’re standin' in a flood of problems, the kind that a toolbox can't fix\n\n'cause here's the clincher – you can't fix people, no more than you can fix the past, they're not broken cars or puzzles missin' a piece, they're complex constellations of experiences, emotions, scars, and survivals, and you, my friend, you might be a star, but you ain’t the whole sky\n\nbut hey, it ain't all rain on your parade – in all that mess, in all that tryin', failin', and pryin' open hoods that were welded shut, there's learnin', growin', and the kind of understandin' that maybe, just maybe, we're all a little dinged up, and that's okay, 'cause in the grand junkyard of life, we’re all just lookin' for that part, that piece, that spark that fits – not to fix us, but to light us up, make us run a little smoother, 'cause at the end of the day, we all just wanna cruise down that highway, wind in our hair, no destination, just the ride, the company, and the stories we gather like souvenirs\n\nand if along the way, you find someone who’s more open road than rush hour, who's got their own oil stains and busted headlights, but still rolls beside you, then you, my friend, you might just have found a co-pilot on this crazy trip – not to fix, not to save, but to ride alongside, sharing stories and sandwiches, tunes and flat tires, and maybe, just maybe, that’s the best kinda fixin' there is, the kind that ain’t fixin' at all, just two souls cruisin' towards the sunset, both a little battered, both a little brilliant\n\nso if you’re out there, wrench in hand, hope in heart, lookin' to rebuild a love like a carburetor – remember, the best rides are the ones where you don’t just tune-up, but tune in, listen to the rumbles, the purrs, the knocks, and the revs, and know that some things, some people, they don’t need a mechanic – they just need a road, an open sky, and someone who appreciates the beauty of a journey that's shared, not the destination reached.",
   "created_utc": 1699133285,
   "score": 174,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7usxo8",
   "message": "He was an Uber driver with only a high school diploma. \n\nI married him anyways and bankrolled his education because he was fun as fuck to be around, was the smartest person I’ve ever met, and loves me like I’m the only woman on Earth.\n\nNow, he’s a computer engineer and we are landlords together and have bought investment properties. We are very happy together. \n\nPartners work together to create success. I think selfish people “ask what’s in it for me?” Marriage is about selflessness. \n\nI’m glad I sacrificed for his education. His mind would be wasted otherwise and he’s a genius.",
   "created_utc": 1699139734,
   "score": 56,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u8dnt",
   "message": "Horribly. Took a serious toll on my own mental health.\n\nNever again!!!",
   "created_utc": 1699131475,
   "score": 27,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uf1q8",
   "message": "Usually I'm the one people try to fix.. I think the repeated attempts definitely helped me. Now my current partner gets to enjoy the previous hard work.\n\n...I think I just got tired of hurting the people who love me, and fixed myself though.",
   "created_utc": 1699134139,
   "score": 25,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ur6ny",
   "message": "Idk if I would say that I “fixed” her (and I wasn’t trying to) but I definitely taught my last ex the importance of being able to set boundaries and to stop going out of her way to please people who consistently hurt her. \n\nEventually this would lead to us breaking up, but I have no regrets. I have issues of my own that were wearing her down and she did what she had to. Same rules apply. We’re both better off because of it.",
   "created_utc": 1699139013,
   "score": 21,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uhed5",
   "message": "There's an old joke; Women go into a relationship thinking they can change him. Men go into a relationship hoping she never changes. Both end up disappointed.",
   "created_utc": 1699135075,
   "score": 33,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7um31y",
   "message": "A couple of months into the relationship, I fixed him. After some irritation, he stopped peeing on the carpet. Now, my cat still brings mice, but I guess, that's just his nature.",
   "created_utc": 1699136928,
   "score": 16,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u7ej9",
   "message": "You can't fix anyone. You can only fix yourself, but if you really want to try and fix someone you have to make it seem like it's their idea.",
   "created_utc": 1699131096,
   "score": 55,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uiqev",
   "message": "I didn’t fix them. But I tried my hardest to be patient and supportive while they fixed themself. Some times I was better at support than other times. Sometimes they were better at fixing than other times. Ended up worth the patience. Things have been great with us for years now. I know this isn’t the normal outcome though, and I feel incredibly lucky.",
   "created_utc": 1699135602,
   "score": 25,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ubpa9",
   "message": "I ended up in therapy.",
   "created_utc": 1699132801,
   "score": 11,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uh9j4",
   "message": "It was a traumatic experience that has caused me to enter therapy.",
   "created_utc": 1699135021,
   "score": 8,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uptmo",
   "message": "It worked great! She’s clean and we’ve been together for 18 years",
   "created_utc": 1699138453,
   "score": 9,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ut429",
   "message": "At first we were only fking. Idk if i ever thought i could fix her but I did fall in love with this beautiful lady with severe anxiety, depression and trust issues after being in a DV relationship. \n\nWe were fuck buddies for about 6months and I got glimpse of her issues but I still went ahead and asked her to be my gf. The heart wants what it wants. We dated for a year and half (2years since meeting) and I actually got to see her at her worst a few times, but i was finally able to get her therapy with a great psychiatrist and treatment, this is when I asked her to move in with me.\n\n We've been now living together for six years, four years ago she had the worst breakdown I've seen. She went full on paranoid, wall scratching nervous, she was even doubting me and my motives to be there. It was a very difficult week, she left the house and went to her moms house in the middle of the night and eventually her therapist was able to get a hold of her and get her back to her senses. Dr then suggested that I also should go to a counselor or at the very least we should do couples therapy so we had strong bases for our relationship and we did. \n\nI now look back and won't change her for anything in the world, she has grown so much, she glows right now. I now see her smile and it's glorious. She's achieve a great position too and it's amazing just to see how much happier she looks.",
   "created_utc": 1699139809,
   "score": 8,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ugr07",
   "message": "You don't make the other person better; you make yourself worse.",
   "created_utc": 1699134819,
   "score": 11,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uhymd",
   "message": "A buddy told me early on “A tiger doesn’t change its stripes.” He was right. 16 months that still reverberates today. Sheesh.",
   "created_utc": 1699135303,
   "score": 4,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ui457",
   "message": "When I was the fixer - It did not work. The abuse got worse and I divorced her. \n\nWhen I was the fixee - it did work. She got bored and dumped me 4 years in and 3 months after signing a lease.",
   "created_utc": 1699135364,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v1edh",
   "message": "Broke myself and had to leave to fix me instead.",
   "created_utc": 1699143203,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u1j9m",
   "message": "Bad\n Don't do this.",
   "created_utc": 1699128833,
   "score": 8,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uh68i",
   "message": "Couldn't handle her trauma. We agreed to break up on good terms after a few months of a relationship. A few weeks ago, she asked for help in legal case to help them get away from her abusive parents (we are both underage). I still haven't made a decision, but I probably won't get involved.",
   "created_utc": 1699134984,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uhr1u",
   "message": "I didn't think I could fix them...but I was given false assurances that they weren't doing drugs anymore when I started dating them...he was VERY MUCH still doing drugs. It was bad. But I broke up with him and he actually got clean afterwards. He straightened himself out and now we're happily married",
   "created_utc": 1699135216,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uhtip",
   "message": "I fixed her, but that broken me. It doesn't go away, it just passes on...",
   "created_utc": 1699135244,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7unxr2",
   "message": "Oh goodness no, but what a learning experience. This does not work, it doesn’t matter how much you love them or what you’re willing to sacrifice, people need to change on their own. The only possible way you’ll survive the experience is if you love them enough to let go of them forever.",
   "created_utc": 1699137689,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7usjf8",
   "message": "Fixed herself and I fixed myself with each others support and we are living happily ever after it seems. With ongoing work on ourselves and our relationship.",
   "created_utc": 1699139568,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u0anj",
   "message": "Poorly",
   "created_utc": 1699128370,
   "score": 7,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ucc7t",
   "message": "A foolish mentality I wouldn't wish on my worst enemy.  \nI am beyond FUBAR lmao",
   "created_utc": 1699133055,
   "score": 7,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7upb50",
   "message": "My dick got scarlet rot :(",
   "created_utc": 1699138245,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ur3lv",
   "message": "So much beauty but so much maintenance and demanding of my time and money.\n\nDamn thing is still on a hard stand at the mechanics… One day it’ll be fixed, I promise.",
   "created_utc": 1699138977,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7utacv",
   "message": "now i have twins and more ptsd and an order of protection against him and a court date over his aggravated rape and aggravated domestic assault committed against me. oh and his mom wants to take my kids because the order extends to them and i won’t let her see them because she doesn’t believe the severity of his actions, knowing he’s a convicted felon with multiple violent offenses against him",
   "created_utc": 1699139883,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uvkvs",
   "message": "Horrible.\nThe mindset implies they aren't good as they are. And we should really be with people who are in a good place and on to do better. Not a low place and just trying to get them in a \"normal\" place.\nIf they feel they aren't good enough, it can lead to a whole mess of other issues. \nThat is exactly what happened to me.\nHe cheated with people that would make him feel good enough because I didn't. \nI'm not excusing the cheating...but the fact that I said I \"liked a project\" in the beginning was a sign I shouldn't have engaged with him at all.\nThey can also grow resentment if you're in a better spot than them as well...which also happened to us.\nSo he took even more insecuries out of me.\n\nAll around..bad situation.",
   "created_utc": 1699140823,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u0lk5",
   "message": "Horrible idea.  Hopeless.",
   "created_utc": 1699128482,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u80dp",
   "message": "Badly.  Would not recommend.",
   "created_utc": 1699131330,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u87qy",
   "message": "I couldn't fix them.",
   "created_utc": 1699131411,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ujs2b",
   "message": "She left me almost bankrupt, a single father of two (including her child), and with PTSD. On a good note, being left bankrupt brought me closer to my parents, I had to move back in with them and they became my best friends. Being a single father taught me discipline, gave me strength, selflessness and brought a sense of fulfillment to my life, and being left with PTSD lead me to therapy and a small obsession with men's mental health. \n\nWould I do it again? Fuck no, women with personality disorders can not be fixed and there is no way to keep them happy no matter what you do.",
   "created_utc": 1699135999,
   "score": 4,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u7om6",
   "message": "Hard way to learn “you can’t change people or the world”.",
   "created_utc": 1699131203,
   "score": 4,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7u9v05",
   "message": "I ended up being the one that needed fixing after lol",
   "created_utc": 1699132064,
   "score": 5,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uj73g",
   "message": "I have a sister who does this. Relationship after relationship she picks these obvious losers and then is baffled when they turn out to be losers.\n\nThis is also a woman who has said that she always wants to be the one making the most money in the relationship so she have the upper hand. \n\nI think she does it to have her ego stroked. So that she can feel like a savior. I really don’t think it has anything to do with the guys. I’m not saying they are not asshole because they are but at some point you have to look at yourself and ask yourself why you keep dating assholes.",
   "created_utc": 1699135765,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ujgv9",
   "message": "I could never and would never. I like people for who they are and not for who or what they could be.",
   "created_utc": 1699135873,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ujsja",
   "message": "It didn’t lol",
   "created_utc": 1699136004,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ujx6g",
   "message": "Still fixing 🤦🏻‍♂️",
   "created_utc": 1699136057,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ukexc",
   "message": "I realized it would never work, ended things, and am now focused on fixing myself.",
   "created_utc": 1699136258,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ulp8r",
   "message": "emotional traumatized , only interested in pale skinned , tall , skinny , dark haired women and may or may not have mommy issues\n\nsex was absolutely worth it though 👍🏾",
   "created_utc": 1699136771,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ulxd2",
   "message": "Broke me 😞",
   "created_utc": 1699136863,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7um18c",
   "message": "She tried to stab me",
   "created_utc": 1699136907,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7um7ti",
   "message": "The girls didn’t lie ok I couldn’t",
   "created_utc": 1699136983,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7um948",
   "message": "Broken pattern",
   "created_utc": 1699136998,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7umzaa",
   "message": "Badly. I did the savior thing two or three times. All ended poorly",
   "created_utc": 1699137296,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7un3ua",
   "message": "I definitely couldn’t fix them.",
   "created_utc": 1699137349,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7un4it",
   "message": "You cannot fix them.",
   "created_utc": 1699137357,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uohzf",
   "message": "I did fix them! Shockingly lol. It didn't work out in the end but.\n\nIt helped that we were both equally awful people who both thought \"I can fix them\"",
   "created_utc": 1699137917,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uqfqs",
   "message": "They turned out to be abusive and manipulative and I dropped them like a hot turd",
   "created_utc": 1699138703,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uqx2e",
   "message": "Just looking for the one comment where someone is lying and says, \"well\".",
   "created_utc": 1699138902,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ur0ld",
   "message": "I got strangled",
   "created_utc": 1699138942,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7urhx9",
   "message": "I fixed them and onto the next.",
   "created_utc": 1699139140,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7urmj9",
   "message": "Not great.",
   "created_utc": 1699139193,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7usoep",
   "message": "Broke myself trying.",
   "created_utc": 1699139626,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ussaq",
   "message": "He almost killed me.",
   "created_utc": 1699139671,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7utixd",
   "message": "Fixable side here, she thought she could fix/ change me, divorced after 10 years. We were/are just so different and dumb",
   "created_utc": 1699139981,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uu7u5",
   "message": "Really well!\n\n/s",
   "created_utc": 1699140265,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uukue",
   "message": "Relationship is a shitty way to do this.",
   "created_utc": 1699140411,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uv075",
   "message": "Ask my wife.",
   "created_utc": 1699140585,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uv5is",
   "message": "I've never started out that way, but I fell into it a couple of times anyway. It never works. If someone needs fixing, it's time to detach from the relationship.  If they end up better later on, it may be okay to try again, but usually, it's still not.",
   "created_utc": 1699140647,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uv6j8",
   "message": "By the end she got her shit together, and I lost mine",
   "created_utc": 1699140658,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uzn42",
   "message": "My mum did with my dad, I found him dead after he gassed himself in the shed. Happened about a year ago.\n\nFamily therapy etc etc didn’t help, she said to him a few days before everyone had tried and it’s best idea if we move away for awhile.",
   "created_utc": 1699142487,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uzrr5",
   "message": "I broke her.\n\nSome things can't be fixed.",
   "created_utc": 1699142541,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uzwym",
   "message": "Badly, obvs.",
   "created_utc": 1699142601,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uzx41",
   "message": "We’re divorced.",
   "created_utc": 1699142603,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v0d8t",
   "message": "Do being dead count as fixed? Asking for a friend",
   "created_utc": 1699142786,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v0hbi",
   "message": "I did fix them, now they're too good for me.",
   "created_utc": 1699142832,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v0vnu",
   "message": "🤣🤣🤣😐🥺😮‍💨🤔😡🫣🫥😑👋",
   "created_utc": 1699142991,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v14xk",
   "message": "Got broke",
   "created_utc": 1699143097,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v1hp2",
   "message": "Didn't specifically think i can fix them. But i thought i might be able to help them a lot. Then a year in they decided they didnt love me anymore, but they didnt wanna break up with me. So i had to endure 2 months with almost no signs of love before breaking up myself.  \n\n\nSo i guess after wanting to help someone im was  the one that needed help in a way.",
   "created_utc": 1699143240,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v1unw",
   "message": "It totally worked. We lived happily ever after. \n\n\nJust kidding. It never works.",
   "created_utc": 1699143383,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uharc",
   "message": "It always ends in disaster! I tried to fix somebody for 6/7 years and it still didn’t work. Some people can’t be fixed.",
   "created_utc": 1699135035,
   "score": 3,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uynvs",
   "message": "Lost half my life savings, a bunch of hobbies I feel too triggered to pick up again, and generally less confident in myself. It does make for an interesting story in hindsight though. My ex was kind of unhinged.",
   "created_utc": 1699142085,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uqgi0",
   "message": "Fixed her suicidality, then she ghosted me.",
   "created_utc": 1699138712,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uw8bn",
   "message": "Not very well, at least for a while. She was eventually diagnosed with BPD after going totally off the deep end. I ended up divorced with full custody of her son (who I had adopted) and our daughter. It was a rough several years, but things are so much better now. I recently married a wonderful woman who doesn't need any fixing, and we're trying for a child of our own. Life is very good now.",
   "created_utc": 1699141092,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uw9s7",
   "message": "Fixed them. then 2 months after we broke up, she got married to another dude. Gotta say, I dodged a bullet.",
   "created_utc": 1699141109,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ux1mi",
   "message": "Found out she was married. She said it was a “green card” marriage, but her husband didn’t think so. That was an awkward humbling exit for me lol …",
   "created_utc": 1699141421,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uy96e",
   "message": "At first, I thought I could fix her. I killed the tieflings, killed the druids, and then she tried to kill me. Well, I didn't learn my lesson and went back for more. Next thing I know I was trying to take over an elder brain using the crown of karsus. So much guilt but I couldn't be happier.",
   "created_utc": 1699141917,
   "score": 2,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uwn3t",
   "message": "Turns out I could not fix them",
   "created_utc": 1699141257,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ux7ji",
   "message": "We broke up after he tried to lock me in his apartment, and then climbed on the hood of my car so I couldn't leave after I managed to get out.\n\nI did not fix him.",
   "created_utc": 1699141487,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uxqid",
   "message": "I did fixed her, but I broke myself in the process",
   "created_utc": 1699141702,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uxsc5",
   "message": "Didn't work. \n\nLearned a lot personally however, and ended up fixing myself after that 10 year relationship never took off.",
   "created_utc": 1699141723,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uxyig",
   "message": "Did not go well... he was abusive and cheated on me. But, I was HAPPY when he cheated on me. The only person ever that I didn't care. Good, go... they can deal with you. \n\nI definitely regret that thought though. Years later, he was on the news. He strangled his girl friend, dismembered her body, and stuffed her in a closet for a month before he was caught.",
   "created_utc": 1699141796,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uy0yp",
   "message": "Turns out she had the same thought so now we're both all f'd up In different ways.",
   "created_utc": 1699141824,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uyczu",
   "message": "I could not fix him. Instead, he broke me. Lol\n\nPretty sure that's the way it goes for everyone",
   "created_utc": 1699141961,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uydkc",
   "message": "He’s fixed unless he’s angry \n\nThe rest of the world gets the best version of him \n\nI",
   "created_utc": 1699141967,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uye08",
   "message": "I got broken",
   "created_utc": 1699141972,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uye6v",
   "message": "Turns out, they can’t be fixed.",
   "created_utc": 1699141974,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uyhk5",
   "message": "All my small friend group is like that, and we dumped those people with one of the siblings loosing their stuff in exs place.\n\nOne of the \"fixed\" got education and increased income by couple of 10K's. Good for them! The friend who orchestrated that got buckets of anxiety and had zero support during challenging thesis",
   "created_utc": 1699142012,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uz0j6",
   "message": "got to the point where i had to escape, and over the course of 3 years fix myself and the damage they caused. i’m finally back to my usual self",
   "created_utc": 1699142231,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uz6k9",
   "message": "They became overdependent on me",
   "created_utc": 1699142299,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uzayu",
   "message": "Horribly! I was verbally and mentally abused for a year and change. I thought my calm demeanor would rub off on her. All it did was develop “Level 5 anger” in me.",
   "created_utc": 1699142349,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7ukkjg",
   "message": "She died. But I honed my skills to fix the next one.",
   "created_utc": 1699136321,
   "score": 0,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uxxrb",
   "message": "I was thinking more like \"I can help them\"  and I believed them when they said their problems were caused by their family, and I could help them by getting them away from their family.  What happened is they wanted to use me, and were the cause of all their own problems. They didn't improve their behavior or life in the slightest.  Apart from lots of other abusive behavior, they began to do things like use my attempts to help them to hurt me, like ripping up job applications I had filled out for them, and gone to collect with them, when they were angry, or destroying gifts I had given them, in fits of rage.  I got sick of them and dropped them after a couple years.  These days they are homeless, in and out of jail, and have had children and lost custody of them due to domestic violence.",
   "created_utc": 1699141787,
   "score": 0,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uy4nt",
   "message": "LOL",
   "created_utc": 1699141867,
   "score": 255,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uv2cr",
   "message": "My partner is a low key hoarder. I’m a bit of a neat freak. I went into it thinking it was a minor issue we could work on together and believing her excuses about why her place was so messy. \n\nWe’ve been together for about 3 years now and lived together for 2 of those. Her hoarding has not been *just* a minor issue. What I didn’t realize is that there are some deep seated issues causing her hoarding. It hasn’t been as easy as just keeping things tidy. \n\nLuckily, the hoarding has been the only major issue for our relationship. I still would have stayed with her if I had know how things would turn out, but I probably never would have moved in with her.",
   "created_utc": 1699140610,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uv9ve",
   "message": "It ended in a dumpster fire every time lmao",
   "created_utc": 1699140696,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uvgg6",
   "message": "20 years ago, I dated a model and she seemed like she was just a procrastinator and/or lazy when we started dating. I figured, being a procrastinator isn’t a hard issue to fix. The more we dated, the more I learned just how filthy she was. None of my friends could believe a woman that hot had zero concept of personal hygiene. Early on, I just thought she didn’t want to clean her place, when in reality it was much deeper than that. I caught her snorting something in the bathroom and when I asked her what it was, she told me she was crushing her ADHD meds into a powder and snorting it. I knew nothing about ADHD at the time and remember talking to a girlfriend about it, like the tall pile of clean and dirty clothes in her living room and my friend said to me something like “ah yeah, the pyramid of clothes.” She said it like everyone with ADHD has a pyramid of clothes in their living room or something. The relationship didn’t last long.",
   "created_utc": 1699140771,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uvzra",
   "message": "I got stabbed",
   "created_utc": 1699140994,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uw7o9",
   "message": "I didn't. And I had to go to therapy.",
   "created_utc": 1699141084,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7uzla3",
   "message": "they broke me.",
   "created_utc": 1699142466,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v1hb4",
   "message": "My mother does this almost exclusively. It sucks for everyone in her family especially her kids. “If you have to call the cops on him it’s probably not meant to be.” Is not advice I ever thought I’d have to give someone. She still married him shortly after.",
   "created_utc": 1699143236,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v1noa",
   "message": "Still single. That should tell you 😂",
   "created_utc": 1699143305,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v1r2b",
   "message": "Let me tell you about my Ex",
   "created_utc": 1699143342,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v1wei",
   "message": "Couldn’t fix",
   "created_utc": 1699143402,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v2fox",
   "message": "The superiority complex you'd have to have to go into a relationship with the idea of \"fixing\" someone is crazy, lol.",
   "created_utc": 1699143624,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v2rv0",
   "message": "Whelp, getting a divorce after 5 years of marriage, 10+ total and 2 kids.\n\nSo. Not good.",
   "created_utc": 1699143763,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v2xmk",
   "message": "Haha we now both need to be fixed😕",
   "created_utc": 1699143828,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v2zye",
   "message": "I helped them navigate their emotions better, but would always hit bits of bi polar in her where she would treat me terribly, and she would admit it, then one day she changed and I couldn’t continue to put myself through it and she went to our mutual job and told everyone I was a stalker and she was afraid of me. :D",
   "created_utc": 1699143853,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v3a9r",
   "message": "Did not, in fact, fix them. Broke myself though.",
   "created_utc": 1699143970,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v3omp",
   "message": "Very, very poorly.",
   "created_utc": 1699144130,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v3psa",
   "message": "It was a pedestal.  He saw him as the light of my life.  It's dark now.  I don't feel like I know him at all. Strangers.",
   "created_utc": 1699144143,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v3ub0",
   "message": "It was a lot less \"I can fix her\" and a lot more \"She's recently gone through a lot. I'll let her work it out and be there with her through the process.\"\n\n\u0026amp;#x200B;\n\n\u0026amp;#x200B;\n\n... it ended absolutely terribly. I should have broken up with her a whole year and a half before I did, but I kept holding out, hoping she'd figure it out. She is BPD. She will likely have these issues for the entirety of her life. I feel really bad that I stayed as long as I did. It makes me the asshole 100%",
   "created_utc": 1699144193,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v3uzk",
   "message": "I never go into it *thinking* I can fix them. I never knew from the get go. I'm the one who teaches the lessons whilst my feelings and wants and needs get forgotten",
   "created_utc": 1699144201,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v465n",
   "message": "I got her to quit relying on weed all day every day, but couldnt stop the compulsive spending, hoarding, inability to listen to other people or need to spend EVERY weekend at clubs and bars.\nI love her so i spent so long sacrificing myself to make it work and only recently broke it off.\nShes now happy being passed around like a joint and partying hard all weekend every weekend.\nI am happy traveling solo and finding myself again.\nI don't regret her, i learnt alot and i think ive come out of ny time a better person. I dont blame her, i think were just different people.",
   "created_utc": 1699144327,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v4h4e",
   "message": "Well, my ex had huge insecurity problems, she had a severe problem of self image. She only saw negative aspects of her personality and physique. Which led to some problematic behavior, and I met her during the worst phase of it all. \n\nAnd I made a mission that I would make her see all the good things in her! \n\nAnd after years, when she finally understood her worth, she grew bored of me, and told me some horrible things when we broke up, and it left me in a bad state (really bad). And after a month, she was already living with another men. \n\nOf course, I'm simplifying years of relationship, it's goes deeper than that. \n\nI dunno... Sometimes it's just not worth it!",
   "created_utc": 1699144449,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v4r2k",
   "message": "not well, my friend",
   "created_utc": 1699144557,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v54lj",
   "message": "Honestly I wasn't sure if I had the knowledge or energy, but we got a professional involved and worked on a bunch of things. Exercise is crucial. We got her fixed at just over a year and she's one of the best dogs I've had.",
   "created_utc": 1699144706,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v567d",
   "message": "I was already pretty broken at the time too. It ended with my only attempt at suicide.",
   "created_utc": 1699144724,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5isl",
   "message": "My wife did pretty well ...",
   "created_utc": 1699144864,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5lxh",
   "message": "I loved and supported him enough that he fixed himself. 🙂",
   "created_utc": 1699144899,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5ol7",
   "message": "I didn’t go into it literally thinking that, it’s more subtle.\n\nFor me it was sit that happened to me as a kid, I developed a codependent personality. I didn’t see red flags I should have. During therapy years after the divorce I realized I actually sought out those red flags.\n\nI pursued relationships with emotionally unavailable women because if I could convince them to love me, it would heal the damaged little kid my mother never loved.\n\nI think for most people it’s like that. It’s usually not a conscious thought process. \n\nShe’s married again, and I’m finally happy so I guess it went well. Without that relationship and the crushing failure of initiating a divorce, I’d have never gone to therapy.",
   "created_utc": 1699144928,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5q3x",
   "message": "drained the f out of me.",
   "created_utc": 1699144945,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5qqu",
   "message": "You really can't \"fix\" someone, you can only help them and hope they drink from the waters.  \n\n\nOnce a leopard, always a leopard.",
   "created_utc": 1699144953,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5suu",
   "message": "My therapist told me no more fixer uppers so that’s how it went",
   "created_utc": 1699144976,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5yj3",
   "message": "I didn’t fix her but she broke me.",
   "created_utc": 1699145039,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v5zic",
   "message": "With a call from me to the police as she threatened me with a knife. Good times.",
   "created_utc": 1699145050,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v65xt",
   "message": "It didn’t ❤️",
   "created_utc": 1699145123,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v6dt7",
   "message": "Surprisingly well, it took 4 years of telling them their worth the world and always helping them up from a bad place. I had rough times, but now, 4 years later, we were moved in together and happy!",
   "created_utc": 1699145212,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v7b98",
   "message": "Um she cheated on me and stole a couple thousand dollars from me 🫡",
   "created_utc": 1699145593,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v7dhe",
   "message": "I couldn’t fix them and ended up needing to be fixed after.",
   "created_utc": 1699145618,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v7sgl",
   "message": "We eventually broke up. He married 6 months later and it was full of cheating on both sides.",
   "created_utc": 1699145790,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v7w4p",
   "message": "They ended up fixing me?",
   "created_utc": 1699145834,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v7xd8",
   "message": "Entered a relationship with a partner that was jealous and insecure because of the way she was treated in a previous relationship. I thought I could “fix that” cause I really loved her. Even after the first months of dating where I could see red flags I thought with time, things would be better, because I never liked anybody else.\n\nAfter 3.5 years I left the relationship, not only “not fixing her”, but broken and isolated from everyone. You can’t fix someone, especially if they don’t want to be fixed.",
   "created_utc": 1699145848,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7v7xr4",
   "message": "\u0026gt;how did that go?\n\nNot well.",
   "created_utc": 1699145853,
   "score": 1,
   "submission_id": "17ntv2z"
  },
  {
   "comment_id": "k7vbjxp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ntv2z"
  }
 ]
}