{
 "submission_id": "17oggjr",
 "title": "People who have had their nudes leaked, how has it affected your life and mental health?",
 "selftext": "",
 "created_utc": 1699204156,
 "permalink": "/r/AskReddit/comments/17oggjr/people_who_have_had_their_nudes_leaked_how_has_it/",
 "score": 13,
 "url": "https://www.reddit.com/r/AskReddit/comments/17oggjr/people_who_have_had_their_nudes_leaked_how_has_it/",
 "comments": [
  {
   "comment_id": "k7yykas",
   "message": "I work on a pretty big construction site. One morning, when all 200 of us were gathered for a toolbox (morning meeting), police came in and arrested one of the young apprentices.\n\nTurns out he'd been through a bad break up, and to get back at his ex after she cheated on him, he leaked all of her nudes and a few videos of the two of them online. \n\nThis is illegal in Australia, the guy is now in jail.",
   "created_utc": 1699213861,
   "score": 12,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z8x9n",
   "message": "A woman at my job killed herself because the dude she sent her nudes showed it around the company.\nAnd she could not handle it.\n\nHe got fired instantly but the deed was done.\n\nIt's a sad story and a cautionary tale.\n\nThe worse thig is the nudes were not even that bad just her in see thru lingerie.\n\nBut alas that entire thing ruined her.\n\nShe was such a sveen innocent person.\nToo trusting and naive \n\nI still feel like shit when I think about her.",
   "created_utc": 1699217564,
   "score": 110,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z110c",
   "message": "it absolutely devastated me. i was sextorted/blackmailed from the age 15-23. they were sent to my almost my entire family, sent to my college coaches, posted them on revenge porn sites, etc. Now as a 24 year old i don’t give a shit. My dad died this year nothing will be worse than that in the grand scheme of things. Especially in the day and age of sex positivity and only fans. I almost killed myself over that shit. It was terrifying, embarrassing, isolating, i wouldn’t wish it on my worst enemy.",
   "created_utc": 1699214751,
   "score": 246,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yrutq",
   "message": "In HS there was a girl one grade above me. Really nice person, pretty smart. Bit of a stoner, nothing serious. She went to uni for some humanities field.\n\nI left the states after HS, never went to any reunions. A few months ago was reminiscing and decided to Google some former classmates and see how they were doing.\n\nWell, I don't know what happened exactly, but the top 5 results for her name were titled \"(name) [DRUGGIE WHORE]\" and linked via some forums/message boards to some hidden camera style porno videos with descriptions like \"(name) from (city) sleeping with her heroin dealer to pay off debt\" etc. Was absolutely shocking. There were even yellowpages businesses set up, presumably by whoever posted that shit, with her name as the title and very unsavory descriptions.\n\nI was aghast and didn't know what, if anything, to do. I found out she did indeed have a bad drug phase but by then was in rehab and going back to school. I figured she probably knew about the videos but in case she didn't I didn't reach out to her directly. Instead I sent revenge porn / DMCA / etc reports to the porn sites that hosted those videos and sent an anonymous summary to the state's DA and her city's police department. As of checking two months later the videos were all gone but some forums with dead links still remained.\n\nCrazy times, no one should have to go through that because they made some bad decisions. I keep my fingers crossed her life will turn around completely.",
   "created_utc": 1699211445,
   "score": 141,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yp9ag",
   "message": "Ex posted photos of me, and created a profile of me, on Fetlife, despite me having zero interest in it and not giving consent.\n\nThat was just one of many shitty things she did, so it doesn't really stand out as something that hurt me emotionally or mentally.",
   "created_utc": 1699210543,
   "score": 33,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yz4sy",
   "message": "Shit ruined my life....and I barely trust anyone anymore. Staying alive even and basic self care has been tough ever since and it's been almost a year.",
   "created_utc": 1699214067,
   "score": 171,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ywjj5",
   "message": "Not me, but this girl I was dating had her nudes threatened leaked after we stopped seeing each other (swear on my life it wasn’t me). So she said “fuck it” and posted the nudes herself on a website and then linked it on her FB saying something like “there’s somebody threatening to leak these picture I sent them and I’m not gonna let somebody hold that kind of power over me, so here you go. Look at them if you want” \n\nMore power to her. I was a little mad that somebody would do that to her even though we weren’t involved anymore, so I’m glad she at least put them out in her own way.",
   "created_utc": 1699213125,
   "score": 49,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z033v",
   "message": "I dont know if leaked is the right word since they werent posted publicly or anything, but my ex shared mine with a groupchat of his online friends. They did this to multiple other girls too, some were their own girlfriends and some were just girls they flirted with on the internet. Theyd trade them and make fun of them together. It fucked me up real good and I never took or shared another one again. He never admitted to it, only to the fact that he did it to other women in the past but was adamant he never shared mine. Except those same friends of his knew intimate details about my body and described the pictures to me in detail while they bullied me about how gross they thought I was. When I took the pictures I was actually quite happy because I took them after significant weight loss and I thought that I looked really good and I made them really cute and artsy paying attention to the setting and lighting so I was actually kind of proud of them. But they verbally tore apart pretty much every aspect I thought I enjoyed about them and said disgusting horrible things about my body and I pretty much have never felt good about myself again.",
   "created_utc": 1699214411,
   "score": 97,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yx7gs",
   "message": "They're still circulating 10 years later. I've been doxxed, cyber stalked, called out in public even after I moved away. My ex who did it is dead now, so I at least know he won't be spreading them anymore (he did in retaliation for me dumping him) but I haven't put my full name on anything in many years in case they come around in any way that might cause real issues for me.  It also caused me to become a figure model for art groups as kind of reclaiming of my body, which is actually a pretty sweet gig. So that's good.",
   "created_utc": 1699213369,
   "score": 175,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ymyl9",
   "message": "Not me personally but I was friends with someone in high school whose sister ended up killing herself because someone leaked her private pictures. Probably one of the scummiest and most invasive and flat out wrong things you could do to someone and it should involve jail time imo",
   "created_utc": 1699209744,
   "score": 87,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ynkct",
   "message": "I just swallow my constant crippling anxiety and cross my fingers that I'm not being traded on the dark web or something like he threatened he would do. Sometimes the hurt and anger get kind of overwhelming, but I've faced worse. All I know is that I probably can't run for any political position or get too famous without being publicly humiliated.",
   "created_utc": 1699209957,
   "score": 95,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7zbh6m",
   "message": "My wife worked with a lady and her ex-husband released topless pictures of her through email to all of her colleagues.  She was escorted off campus and lost her job as a teacher because of stupid ethics laws in my state.  I would have sued the school district if it had happened to me, but as far as I know, no action was taken by the woman in question.",
   "created_utc": 1699218473,
   "score": 193,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yuohe",
   "message": "During covid, a period of relenting loneliness and horniness, I ended up FaceTiming with a girl who worked with us. To be clear, she sent me a nude video of her first. I should also mention I had trained her just 3-4 months ago when she joined. \n\nMonths later I find out that she had screen recorded me playing with myself and had even sent a video on a work chat. A disgruntled employee threatened to send that screen recording to our staff alias so all 300-400 people woulda end up seeing my dick video. \n\nI ended up confessing everything to my boss who owns the company and he told me to lawyer up and take this as a learning lesson and assured me that no external email can be sent to staff alias. Since then, any kinda video chatting haunts me.\n\nThis is actually the TLDR version of the story.",
   "created_utc": 1699212447,
   "score": 41,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7y92sk",
   "message": "It gave me really bad trust issues for a long time and made me scared the next person I dated was going to hurt me, as well.\n\nAlso I developed really bad body image issues from it and couldn't leave my apartment for over a year...not fun times.\n\nIt took a lot of therapy to get to a place where it doesn't give me a \"fight or flight\" trauma reaction.",
   "created_utc": 1699204830,
   "score": 253,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yqlma",
   "message": "[removed]",
   "created_utc": 1699211007,
   "score": 8,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ynk9i",
   "message": "Follow up question: if you stumble upon someone you know’s nudes online and you’re unsure of whether it’s really them posting it, how would be the best way to let them know?\n\nI might have found someone’s I know but I don’t want to embarrass them if it is them. But if it’s not them they would probably want to know.",
   "created_utc": 1699209956,
   "score": 139,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ytoea",
   "message": "I was in high school and pics of my tatas and a video of me giving head got leaked by a jealous ex. I was “popular” before that and made it clear I did not give him consent to record me going down on him. \n\nHe was rightfully clowned by everyone.",
   "created_utc": 1699212098,
   "score": 220,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yccky",
   "message": "So it was my birthday and I had work the next day but I still fancied some beers and cocaine, after consuming a decent amount of both I was trying to chat to girls on tinder.\n\nGoing to keep this short and basically whoever I ended up speaking to wasn't real and we exchanged pics I sent my coked up dick pic and then they threatened to send it to all my family unless I pay them money, I told them absolutely no way they're getting money off me. \n\nThey sent my dick pic to all my family and other random friends on Facebook, my grandmother etc. Seen it. It has made me avoid family functions etc. Ever since. I was an absolute idiot for falling for it but it was a really shit thing for someone to do.",
   "created_utc": 1699205981,
   "score": 142,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ywp4o",
   "message": "My much older ex did this to me, but I can’t prove he was the person who did it so there’s nothing I can do. I’m afraid to delete social media because I’m afraid something will get leaked again and I won’t know. I’m always afraid I’ll relax and they’ll resurface. It was 15 years ago and it still makes me feel physically sick to think about. Haven’t sent or take a nude since.",
   "created_utc": 1699213183,
   "score": 62,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7zxund",
   "message": "My Google cloud still had some pics of myself that I was unaware were still on there. At some point I got hacked and was threatened/blackmailed by whoever had them. They found my Facebook somehow, which at the time was fairly public and had a list of my entire friends and family that they would send it to. To begin with, I panicked. They were asking for money and I just kept stalling and asked for their bank details.\n\nIn the end I bit the bullet, sent a message to everyone I cared about and told them that someone had some explicit photos of me and to not view them if they are sent.\n\nThe scammer ended up sending it and said \"your life is ruined now\". I responded back \"you're a scammer in a 3rd world country, your life is already ruined\" (yeah I know it was a bit harsh but I was pretty pissed) and ceased contact with them.\n\nThey ended up sending it through Facebook, apparently it went to the spam filter for most people so barely anyone opened it since it looked like a dodgy scam message. It was a bit stressful but overall it didn't impact my life at all.\n\nSo a few words of advice for anyone dealing with this or want to be safe. Keep your Facebook photos and friends list private. Check your cloud and delete unwanted photos. And don't let them bully you around, it's not worth getting drawn into the blackmail.",
   "created_utc": 1699226883,
   "score": 55,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ytxy0",
   "message": "My ex and I made a naughty video 20 years ago that was stolen by the maintenance man at our apartment at the time. He posted it on 4chan.  I found out when a friend contacted me 6 years ago and told me she saw it. I had anxiety for about a week but that’s about it. We were in love\nAnd we both were young and looked great lol",
   "created_utc": 1699212192,
   "score": 205,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ytbcu",
   "message": "It was a long time ago on one of these old anon forums where they'd have categories for each cities, they included my personal information so I got messages from random guys telling me about the photos and videos. I reported it to the police because it was obviously my ex, but nothing ever happened, I'm not even sure if it was against the law at that point.\n\nI felt really vulnerable and exposed, the comments where vile and knowing that these where all people from the same city as me, made it worse. The website was shut down thankfully.",
   "created_utc": 1699211968,
   "score": 38,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yufoc",
   "message": "I often check my name online to be sure that nothing is out, and that's i'm basicaly a ghost.\n\nI have huge trust issue with people i'm dating, dating app are a huge issue for me.\nEvery day i'm afraid someone will tell me they saw it. It's hard, but well, life is on right.",
   "created_utc": 1699212363,
   "score": 172,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yx5l0",
   "message": "I feel so much empathy for people who have their nudes leaked. I hope all of them find a way to cope and get through it. \n\nAfter hearing of so many cases going wrong, every time I’m going to take a pic of myself I think “if this went public, how would I feel?” and that’s what I use as a criteria to decide whether I take it or not.",
   "created_utc": 1699213350,
   "score": 44,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z3z8v",
   "message": "damn I didn't think I'd ever say this story on Reddit but so much time has passed it's like seeing it from a plane now. \n\nI was in high school in the early 2010s when iPhones and phones with more than a potato quality video were still new. \n\nAs a dumbass 15 yo I went down on my dumbass 16 yo boyfriend whilst nude. Unknowingly, I was being videoed. He ended up sending it to the football team because apparently that's normal and expected. Since it was a Catholic school and getting adults involved might mean expulsion for me as well as the guy, I just weathered the fucking storm that having a sex video of yourself bounce around high school is. \n\nI lost a lot of friends so I went from kinda popular to being alone a lot more often. But sitting at the \"loser\" table in Catholic school meant I became friends with people from very different situations than me and confronted a lot of my own prejudices at a very young age. I lost my faith, learned I love smoking weed, did shady shit with older guys because I was \"undatable\" in school. But I learned that if you enjoy spending time by yourself, no one can hurt you in the end. I learned to use taking a walk through forests and nature to calm my anxiety over everything. \n\nI like who I am now, I don't think I'd be the person I am if I didn't go through what happened. I'm married to the gentlest man I adore so much, I have two dogs and a cat. Next year I'm adding chickens. \n\nIt affected me so much, but if I could undo it all at this point, I don't think I would.",
   "created_utc": 1699215808,
   "score": 54,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yva80",
   "message": "Not me personally but I knew a girl who's p tape was leaked and the whole town knew. She took it like a champ, she took in all the abusive comments hurled at her, eventually she dropped out of the school. She works as a nurse now I think. Even after the incident 7 years ago people still recognize her as 'that girl'. Its crazy how people are so cruel.",
   "created_utc": 1699212664,
   "score": 210,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z3hgt",
   "message": "Sadly in my freshman year my ex leaked photos of my nudes and I ended up calling my dad who was a marine drill instructor and my uncle who was a sheriff confiscated her phone and brought charges down the pipeline saying child nudity and she got charges on her name and anyone who looked at them which was half the football team I never questioned him about it again.",
   "created_utc": 1699215636,
   "score": 69,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z97tm",
   "message": "3 days before my wedding, an old co-worker of mine sent me one of those messages you get all the time on Facebook, a link and \"is this you???\" I texted her and told her that she had been hacked.\n\nShe was like nope, I literally think this is you on this site. She and I had worked together at a restaurant, but on the side, she sold custom nudes and reviewed the local 4chan pages to make sure that none of her customers were sharing her paid content. \n\nSo I finally clicked the link, and it was a 4chan page for my town. It was me. It was incredibly violating and my mind was spinning. I was a teacher at the time, and this was 8 or 9 years ago, so the understanding that everybody takes nudes just wasn't in the public consciousness. I knew I would be blamed or fired if the photos came out. \n\nWorst of all, it was nudes that did not include my face that were posted in a gallery that also included professional modeling shots I had done (clothed) that included my face. The post also included my name. The only conclusion was that somebody I knew had posted them. I did not suspect my partner, but I knew that he had no passcode on his phone and left his phone lying around all the time. There were two acquaintances in our circle at the time who I suspected, but as I started trying to figure out who it was, I knew that the process would make me crazy and I decided to let my vigilante investigation go. \n\nI screenshotted all the images and had to email them to my local print shop so I could bring them to the cops to make a police report. I had to beg the print shop to delete the document in front of me, but it was so humiliating watching my nudes print in this busy shop, the day before my wedding.\n\nThe officer I spoke to did exactly what I expected, blamed me and told me that I just shouldn't be taking intimate photos. I live in one of the few states that doesn't have revenge porn laws, and either way, I didn't know who had shared them.\n\nIn the days and weeks surrounding the photos being leaked, I was suicidal to a level I have never been before. I was on with suicide hotline chat every single day, often multiple times a day. I didn't want my new partner to see my naked body, and I became incredibly suspicious of all of our friends. Friends. When I finally was able to be intimate with my partner again, I found myself freezing up and we'd have to stop. I developed vaginismus which I needed physical therapy for. After being intimate, I would sometimes be overcome with this feeling of dirtiness and just sob and sob. It affected my relationship. \n\nEven now, I still sometimes run into the two people who I think might have leaked my photos, and it takes everything in me to keep from asking if they did it. If they know what they did to me, and how they destroyed the year that was supposed to be one of the happiest of my life. \n\nBut I don't think that there are answers to be had. I have made my peace with not knowing what happened. And I do everything I can to destigmatize the fact that everyone takes and sends nudes. It's part of this era in technology, and it's a way that we stay connected, and sharing our bodies with people that we trust isn't shameful. Isn't shameful. What's shameful is people who take those images and exploit them to hurt others.",
   "created_utc": 1699217667,
   "score": 86,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yyhys",
   "message": "I drunkenly mooned a camera and due to the drunkness spread my cheeks. Person posted it to Instagram which auto posted it to Facebook, so a lot of people saw my asshole. A couple people got very upset not that the photo was taken but that it was shared without my consent. I didn’t really care. A couple of people saved it and thought it was funny to share at parties. It still pops up once in awhile. I did find out a friend was interested in me when someone tried to show her the pic and her response was that if I wanted her to see I could show her my butt hole in person. So yeah, that was okay. This was like 10 years ago.",
   "created_utc": 1699213837,
   "score": 28,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z3g7n",
   "message": "They tried to blackmail me with them, I posted them myself with screenshots of their actions. People who blackmailed me expect one of them served some time. People forgot about my nudes after 2 weeks or something. Everything worked out great if you ask me.",
   "created_utc": 1699215623,
   "score": 72,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ywxdo",
   "message": "I try not to think about it. I got manipulated a few times into sending inappropriate pics of myself when I was a middle schooler. I know they are probably out there on the dark web but at this point there is no use thinking about it.",
   "created_utc": 1699213266,
   "score": 44,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z5g6y",
   "message": "When I was in high school, my FWB at the time posted my nudes on Instagram with all kinds of horrible captions because I didn't want to be in a relationship with him. I didn't see them until my friend sent me a screenshot hours later. Basically all of our friends and acquaintances already saw them. Some of them jumped in to defend me and others laughed at and ridiculed me. I ended up dropping out of high school and deleting all of my social media permanently. When people ask why I don't have social media, I just tell them it's an overrated time suck. In reality, that incident was deeply traumatizing. I still have a fear of being recorded or having my picture taken at all. I barely have any pictures of myself at all from the last decade of my life. It scarred me emotionally and damaged my self esteem especially sexually. I still feel afraid opening up sexually, to anyone, almost 10 years later.",
   "created_utc": 1699216331,
   "score": 45,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yqz2j",
   "message": "After bad break up my ex dropped my dick pictures over my FB/IG. And it didnt affect me at all beside friends joking about I don’t need to send nudes anymore coz who wanted already saw them.",
   "created_utc": 1699211136,
   "score": 138,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k80snvz",
   "message": "I had an ex post pictures of my panty clad and nude ass on FB. We had been together for almost 2 yrs when I ended things. He had my family and friends on his FB. My best friend called and said, “Hey, you know your ass is all over FB?” At first, I was freaking out, as anyone would. After a few minutes though I was like “fuck this!” So, I commented under one of those photos saying, “Post all the nudes you want. You’re just showing everyone what you weren’t man enough to keep!” About 10 mins later he took them down. Life went on.",
   "created_utc": 1699239627,
   "score": 23,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yet9u",
   "message": "I know 3 chicks who had it done to them.\n\nThe first one was infamous in my country and went through a very public and well known court case, the dude ended up running to the states and the woman had a life long struggle with insecurities, unbeknownst to her.\n\nThe other two just... Got over it? One was quite public and I think she just shut off that part of her life and move on, she's in the early 40s now, and stayed off social media. The other one got married shortly after and never really looked back, she's very active in social media, though her leaks were not famous.\n\nIt's worth nothing the first one I had an intimite relationship with, the other 2 I observed from the surface.",
   "created_utc": 1699206860,
   "score": 240,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yz4xn",
   "message": "I was 14 at the time, and a girl i had a crush on initiated, she wanted my face in everything, me being head over heels for her went with it, the next day I came to school and she had shown all her friends, and they passed it along. I was already bullied (choked, locked in lockers, beaten, books thrown, u name it) plus an abusive mother at home, etc, Ive never been so close to just ending it at that point, but here I am at 26, now I use it to tell myself if i got through that and make things work out, I can get through much more things, i turned it into a positive thing in the end, but it didnt help my trust issues. :)",
   "created_utc": 1699214069,
   "score": 53,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yxomw",
   "message": "I've heard of shit like this happening to people. I've also heard people say \"don't send nudes and there won't be a problem\". My response to that is if someone sends you nudes it should stay between the sender and the receiver.  You're a piece of shit if you go sharing peoples nudes with others without consent.",
   "created_utc": 1699213543,
   "score": 114,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yw0qb",
   "message": "This happened seven years ago.\n\nI had a chat request from one girl on Facebook that day when I was in high school. We talked for a good two weeks or so. Then she started to get a bit kinkier. Being a horny idiot, I was really enjoying my time and went along. \n\nShe asked me to see my dick. I was embarrassed and hesitant to send it. I didn't reply for a day. But she sent me her picture of her womanhood and that got me. I sent just the tip of it. It was the first time I shared something like this. Later she asked for a full-body nude and she sent her first. I was so excited that a girl sent me her nude so I didn't hesitate this time and sent her. She then started making excuses before ending our three-week conversation.\n\nNow here's a thing; it took me seven years (earlier this year) to find out that the \"girl\" was one of the class members catfishing me. And I learned this from my best friend because we were talking about something and he randomly brought up talking about my leak nudes.\n\nThis disturbed me because I had absolutely no idea that the whole class knew about it and I was not aware. For a good few weeks, my mind was having all sorts of bad scenarios where I started thinking about ending my life. But that friend of mine is more of a brother and was checking on me every time. Thanks to him, I calmed down and forgot about it.\n\nBut it still disturbs me. Sometimes I randomly think, 'What if that guy sends those nudes to my family?' It messes a lot in my mental health.\n\nA tip to young boys out there, if a girl asks for your nudes, NEVER send them. There's a high chance that it's a fake account and will be used against you. Please be safe.",
   "created_utc": 1699212934,
   "score": 98,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7y9mqy",
   "message": "Former classmate of mine stole my then gfs and my sextape and send it to his dumbass friends. They reported him to our teachers and he got into a lot of trouble. I did not give a damn but my ex gf did. She was bullied because of it until the end of our time at school (happened in our last year there, at 19 years of age).",
   "created_utc": 1699205026,
   "score": 221,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k80hlyg",
   "message": "Not me, but a girl in my city was raped and had videos of it put all over the place. She eventually killed herself. It was just awful. https://simple.m.wikipedia.org/wiki/Suicide_of_Rehtaeh_Parsons",
   "created_utc": 1699234849,
   "score": 15,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7zfsdc",
   "message": "Happened to me in 2001. I was making out with a guy and he took pictures of me wit his webcam. I knew he was taking the pictures, it wasn't like that. He showed everyone I knew those photos. I'm just glad they were grainy webcam photos and not the high definition that is available today. \n\nThe thing that sticks with me after all this time is how many people flat out called me stupid for it. I was the stupid one, because I let him take pictures of me. We were just having fun, if he had told me he was going to share those photos with everyone, of course I would not have consented. But I was not even \"allowed\" to feel upset by what happened, because I let him take those photos of me. I was 16, by the way. \n\nHow did I handle it? I went to therapy, I moved 3,000 miles away a year and a half after graduation, and I've built a new life for myself out here. Not just because of the photos, but lots of other stuff too.",
   "created_utc": 1699220029,
   "score": 15,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7ypmyq",
   "message": "Not nudes as such, but I had a video leaked of me getting given a blowjob that went around my work. \n\nWas awkward for a while but it passed.",
   "created_utc": 1699210677,
   "score": 114,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7z0fj1",
   "message": "When i was 16, playing a mmorpg, another 16 yr old girl who disliked me somehow got a hold of my risque photo, and posted it on the official forums with some dumb caption meant to shame my giant tits. Instead of slut shaming like she hoped, half the people thought she posted her own photo and started publicly asking for her number, and another half just posted compliments. I was laughing pretty hard because her purpose totally backfired.       \n\nEven back then i already understood how insecure in her own body she must be to try to shame someone else for theirs. Then when it started raining compliments, it probably ruined what little else she had of her own self-esteem",
   "created_utc": 1699214534,
   "score": 12,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yttvj",
   "message": "i was a freshman in highschool when i was leaked, the 4 years of highschool SUCKED. i held on and pulled through, but hey, it got my name out to everyone, and made me a popular kid! tried to file charges on the people sent it out, but would have to take the same charges for willingly sending some in the first place! i mean at the end of the day, every male has seen other male parts, same with females. it’s not that big of a deal! i never once heard that i was small! don’t let it get you down, once you’re out of school everyone forgets, and there’s no trace of it anywhere! here i am graduated for 2-3 years and it’s never bothered me or affected me, haven’t heard about it or seen it since the week it came out freshman year!",
   "created_utc": 1699212152,
   "score": 23,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k7yno43",
   "message": "It had zero effect on anything except for maybe the people who liked what they saw",
   "created_utc": 1699209992,
   "score": 51,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k80kqrj",
   "message": "For a positive-ish story about this issue, here's something that happened in my high school in junior year or so.\n\nA couple broke up, and the male student thought he'd get revenge on his girlfriend by leaking her nudes to the whole school. But as it turns out, pretty much everyone in the school really liked and respected the girl before, during, and after the breakup. So not only was the girl not shamed or bullied for the leaks, but the guy was pretty much completely socially ostracized for the whole rest of high school for what he did. \n\nAlso if I recall correctly, the day after he leaked the pics there was also a whole mob of male students who were searching through the school between classes with the full intention of beating the shit out of him when they found him. Not sure if they succeeded on that front though, but I appreciate the solidarity.",
   "created_utc": 1699236183,
   "score": 10,
   "submission_id": "17oggjr"
  },
  {
   "comment_id": "k82c5oc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17oggjr"
  }
 ]
}