{
 "submission_id": "17oj35h",
 "title": "What's the most out-of-touch thing you've heard someone say?",
 "selftext": "",
 "created_utc": 1699211191,
 "permalink": "/r/AskReddit/comments/17oj35h/whats_the_most_outoftouch_thing_youve_heard/",
 "score": 135,
 "url": "https://www.reddit.com/r/AskReddit/comments/17oj35h/whats_the_most_outoftouch_thing_youve_heard/",
 "comments": [
  {
   "comment_id": "k7zmeg1",
   "message": "\"You seem sad\"\n\nMy mother to my sister, at her husband's funeral.",
   "created_utc": 1699222480,
   "score": 74,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zc7zo",
   "message": "My dad (who is now the Director of Accounting for the school district I teach for) was talking about how my starting pay was way more than his starting pay. \n\nI said, \"well, yeah... The cost of living has increased a ton since then.\" This motherfucker straight up said \"no it hasn't.\"\n\nHe started working there in 1992. This conversation happened in like 2017 (about a year after I started working there). Again, he is the director of accounting.",
   "created_utc": 1699218743,
   "score": 22,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7yyg5i",
   "message": "Aren’t you a bit too old to have a grandma?” A neighbor when I told her my grandma just passed away.",
   "created_utc": 1699213818,
   "score": 203,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zanvz",
   "message": "when people were complaining about not being able to afford housing/food/living in general, one of the Dutch ministers (I think he was a minister or at least the leader of a party) said something along the line of 'well, find a rich boyfriend then'. ah, yes, that will solve the crisis!",
   "created_utc": 1699218184,
   "score": 50,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z6huw",
   "message": "With a hefty storm approaching England, a politician advised those in its path that they should maybe leave, and go to their second or third homes, to be safe",
   "created_utc": 1699216702,
   "score": 174,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7ztac0",
   "message": "I have an 18 year old nephew who only just got his first job working part time as a dishwasher. Immediately upon getting that job his grandparents (who inherited their wealth from his great grandmother) said they were kicking him out of the house. His grandparents are convinced they are helping him because they were kicked out when they were 18 and it built character. They would not listen to the fact that times have changed and rent prices in the area are $1400 a month. He has no savings, $1500 in medical debt, and other personal issues but his grandparents think none of that matters and that he can easily go get a job that will support him, he just needs to work hard because people nowadays don’t want to work. \n\nThey haven’t changed their minds at all about kicking him out and gave him 30 days to get out (he hadn’t even gotten his first paycheck before they had this conversation with him). So I’m letting him stay in my spare bedroom because otherwise he would be homeless. They have no remorse over this at all.",
   "created_utc": 1699225109,
   "score": 152,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z7bjj",
   "message": "The wife of the business owner complaining to the employees about how she’s underpaid for working there. \n\nShe literally owns the building and her family make 300-500k profit a year. \n\nAll while underpaying the rest of the staff.",
   "created_utc": 1699216992,
   "score": 163,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7yvhpa",
   "message": "I went to an Ivy League college with lots of children of extraordinarily wealthy families. When discussing inequality and its effects on housing, my professor briefly mentioned how mortgages are out of reach of a growing number of Americans. The girl next to me stopped the class, and with a confused face asked the professor why people don’t just buy their homes in cash outright because “surely the interest means it will cost them more over time.” The professor was dumbfounded. \n\nI found out later that she is the heiress to a major luxury brand that you have all heard of.",
   "created_utc": 1699212741,
   "score": 215,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zmn73",
   "message": "At my last job we weren't allowed to take PTO during the week of Christmas because that's when the company decided to do its inventory counts.  All year we were told that week was blacked out, no PTO, all hands on deck. \n\nThe day after Christmas, the branch manager sent out an email saying he had \"decided to extend his Christmas holiday\" and wouldn't be in that day. \n\nAnother one from the same guy:\n\nThe company had been acquired a year or so prior, and during an all hands meeting the manager told us various perks had been cut because we weren't \"demonstrating profitability.\" The company was profitable, just not to the extent the parent company wanted. So no bonuses, no quarterly employee appreciation lunches, no annual company party, stuff like that. We were also in a hiring freeze. \n\nDuring the same meeting, the manager told us about the vacation he was going to be taking for the next two weeks. Some of us employees colloquially referred to it as the \"F you\" meeting.",
   "created_utc": 1699222572,
   "score": 119,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zg3jo",
   "message": "“I don’t know why people get big mortgages. Just save up for a few months and pay cash for a starter home!”",
   "created_utc": 1699220146,
   "score": 164,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zfgkb",
   "message": "my boss once told me to have “the maid” drop my car at the shop.  wtf!",
   "created_utc": 1699219906,
   "score": 12,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z8olg",
   "message": "My former landlord and his wife dropped by to tell me and my financially struggling 20-something roommates that they were raising the rent, by nearly 25%. They said, “We noticed on Craigslist that neighbors had higher rent so we’re doing the same.” The wife then earnestly reminded us that we’ve been great tenants but maybe we just needed to find some higher paying jobs. 🙃\n\nEdited to add: You guessed it, the place was a dump with zero repairs (he’d ignored them) to warrant any kind of rent increase.",
   "created_utc": 1699217479,
   "score": 215,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zntp4",
   "message": "\"You won't be happier at work if we pay you more, but we need to figure out why workplace happiness is so low\" coming from a guy that made 10x what I did, and was born into old money.",
   "created_utc": 1699223023,
   "score": 40,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7yt1rn",
   "message": "Something like: Give a rich person $500 and they will invest into $1000.  Give it to a poor person and they will spend it in a week.\n\nYeah exactly give it to someone who’s needs are met and they can save…give it to someone who needs to eat/pay rent etc they will spend it to survive!",
   "created_utc": 1699211872,
   "score": 92,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z4zg7",
   "message": "You should just go door to door to see if they’re hiring. And don’t take no for an answer! You need to call every day so they’ll remember you! - again, courtesy of my mother, who last worked in the 80’s before being a full time SAHM since. \n\nOther gems also include, ‘you need to be happy to work OT, don’t worry about the compensation, your boss would be happy with your dedication and promote you.’ I couldn’t convince her that things changed since then and working isn’t like what it used to be.",
   "created_utc": 1699216165,
   "score": 145,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z4unr",
   "message": "I was waxing a woman’s eyebrows once and she was complaining that sometimes after she gets a massage the pillow leaves a circular indent on her face and she can’t go out to lunch after. She then asked me if that ever happened to me? I was like maam i wax people for eleven bucks an hour; I’m not going out to lunch lol, let alone getting massages.",
   "created_utc": 1699216117,
   "score": 46,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zzqbc",
   "message": "Co-worker: \"You'll be able to buy a home once you get your inheritance\"\n\nMe: \"I won't have an inheritance, my family isn't well off\"\n\nCo-worker: \"Of course you have an inheritance. Everyone's parents leave them an inheritance. I'm sure they're just keeping it a secret from you to surprise you.\"\n\nSaid to me by my co-worker who's parents are both doctors, while my mom had recently been laid off and my dad was too sick to work.",
   "created_utc": 1699227603,
   "score": 51,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z8iv5",
   "message": "A guy in college was trying to find common ground with us when we were discussing how difficult it’s been paying for college \n\n“I don’t have college debt, but my parents are forcing me to only choose 2 new apple product upgrades this year instead of 3.”",
   "created_utc": 1699217421,
   "score": 109,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zjwbm",
   "message": "\"People in the slums have the same chances and opportunities as everyone else\", with absolutely no freakin' clue how poverty crushes the soul.",
   "created_utc": 1699221543,
   "score": 169,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z6eei",
   "message": "My mom bought me a book called Baby Steps To Become A Millionaire.\n\nThe first few steps are just:\n\n- pay off your house with cash,\n\n- pay off your vehicles, pay off your debt,\n\n- pay off your childrens' educations.\n\nThen, \"after you've done all of that, start investing 50% of your monthly income every month into a high yield stock, with growth of at least 10% annually.\"\n\nIt's like, dude, if I could pay for a house, car, and multiple college educations upfront with cash, why would I need to be told how to save money?\n\nOh I forgot the most important advice. \"Let God show you the way.\"",
   "created_utc": 1699216667,
   "score": 135,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zbg11",
   "message": "\"You just need to think positively and your entire life will change\"\n\nShe proceeded to turn around and yell at her son, then only 7, to \"get the fuck back in the truck\" which he left because the baby was crying and he didn't know what to do.\n\nOh no wait. It was when she said she wouldn't let anyone \"disfigure\" her baby when the doctor was threatening to call CPS and report the baby as a failure to thrive because she didn't want the baby to have a feeding tube.",
   "created_utc": 1699218462,
   "score": 129,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z71le",
   "message": "\"What do you mean you've never vacationed in the South of France?\"",
   "created_utc": 1699216895,
   "score": 223,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zgxh6",
   "message": "Mosquitos do not live or reproduce in stagnant water.\n\nThe same person who said this also visited a swamp and a closed mini lake with clouds of mosquitos, and complained about the quantity and aggressiveness of said mosquitos.",
   "created_utc": 1699220446,
   "score": 169,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zlel7",
   "message": "\"A police officer cannot commit a crime. Since crime requires premediatation, and police are charged with law enforcement, they cannot, by definition, premeditate to commit a crime. What a police officer does in the course of their job can never be considered criminal activity.\"\n\nThis was the argument handed to me by our local police chief in response to my organization's police reform project.",
   "created_utc": 1699222105,
   "score": 192,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zx187",
   "message": "\"Rent is so expensive. You should buy a triplex and rent the other units out instead.\"\n\nMa'am triplexes cost about a million. How on earth am I supposed to get approval for that if rent is an issue for me?",
   "created_utc": 1699226567,
   "score": 136,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7yts8v",
   "message": "Idk if that counts but…\n\nA friend once told he for sure doesn’t want to have kids.\n\nNext sentence he talks about how clever he is because he can use a condom two times.\n\nHe just rolls it on the otherside and he is ready to go again.\n\nI literally died laughing on the floor because he was dead serious and couldn’t see the mistake💯",
   "created_utc": 1699212136,
   "score": 247,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z8mca",
   "message": "A couple years ago Chris Pronger made a Twitter account and went on an epistle about how NHL players don’t actually make that much money after spending on luxury cars multiple houses, fashion etc. it was about as tone deaf as you can get",
   "created_utc": 1699217456,
   "score": 74,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zragh",
   "message": "I was complaining about the lack of accessibility in a bar I went to a few times (I’m a wheelchair user) to a friend and he would just dismiss it with “oh it’s just three steps, what’s the harm”. I just don’t want to be bothering people with help for just three steps and do things on my own. Able bodied people don’t really realize how easy they have it.",
   "created_utc": 1699224339,
   "score": 123,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zesm2",
   "message": "\"Why don't you ask your parents to buy a house for you to live in while you're in school?\"\n\nSaid to my son",
   "created_utc": 1699219664,
   "score": 214,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zq4lx",
   "message": "I will never forget the whole \"imagine\" video from celebrities when covid hit. One of the most most out-of-touch things I have ever heard/seen. The fact that so many people had a hand in creating the video makes it that much more ridiculous.",
   "created_utc": 1699223900,
   "score": 114,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zlhxi",
   "message": "\"Is working really only about earning a paycheck?\"",
   "created_utc": 1699222139,
   "score": 180,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zmt3p",
   "message": "“It will be easy because we will have a newborn. “\nReality is about to hit them right in the face.",
   "created_utc": 1699222634,
   "score": 79,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zit1d",
   "message": "If gas prices are too high for you just by an electric car ~ a friend of a friend",
   "created_utc": 1699221140,
   "score": 3,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zkrob",
   "message": "My 74 year old dad trying to help me with a budget: “how much do you think you need for food? $100 a month? That’s probably plenty if you don’t eat out.”",
   "created_utc": 1699221867,
   "score": 81,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zx6pu",
   "message": "Here on reddit some woman said her partner got angry at her for getting her period on their vacation, because he was planning on having a lot of sex and she ruined it because she decided not to hold it.",
   "created_utc": 1699226627,
   "score": 227,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zo9ad",
   "message": "Celebrities singing “imagine” during Covid, as people are losing jobs and homes, telling us “we’re all in this together”. \n\nFuck you guys. We’re not all on the same boat. We’re in the same store with different boats.",
   "created_utc": 1699223185,
   "score": 216,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z3lza",
   "message": "I don't remember exactly what she said, but my coworker was having a conversation with an older board member about housing being so expensive. The board member complained that millennials don't know how to save money and talked about how she freezes leftovers instead of getting takeout as an example of being financially responsible. Years later, I still think about the boomer with a lakeside property who thinks we just need to save our leftovers to afford a home.",
   "created_utc": 1699215680,
   "score": 145,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zk8ll",
   "message": "I was chatting with my boss about how I was worried my rent would go up a ton this year because all my friends' rents had, and how I wished house prices would drop just a little bit so I could actually buy something. Motherfucker looked me in the eyes and said \"wanting house prices to go down is socialism, we can't have that.\"",
   "created_utc": 1699221670,
   "score": 96,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zmml1",
   "message": "Family craziness aside, probably the family friend who gave me unforgettable career advice.\n\n\"You have to make it so they can't ignore you,\" she said. She recommended printing out my resume on a kaleidoscope of different-colored papers and mailing a dozen copies to each place I was interested in working.\n\nThen she added the cherry on top - I should add glitter to every envelope, making sure they *really* couldn't ignore me.\n\nShe was advising me to glitter-bomb employers not long after the 2001 anthrax attacks, where lots of anthrax was mailed to a lot of workplaces.\n\nI'm sure she was very surprised I never listened to her career advice again.",
   "created_utc": 1699222565,
   "score": 98,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zozz8",
   "message": "why would anyone want to live in a trailer instead of a house",
   "created_utc": 1699223472,
   "score": 92,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z1g0v",
   "message": "C-level at my job commenting on the old truck I drive: “Why do you drive around in that old junk?” Never mind that it’s paid for, paid for itself 10x over and still going just fine…",
   "created_utc": 1699214900,
   "score": 159,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zpnzh",
   "message": "My sister said that she wishes she could round up all of the homeless people and shoot them.\n\nShe also told me that anyone who has mental health issues should just grow a pair of balls. Keep in mind, our aunt attempted suicide a few months back. Two days after she said all this a close friend of mine killed himself, which was what pushed me to cut her out for good. Good riddance to her.",
   "created_utc": 1699223726,
   "score": 152,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zkwc5",
   "message": "“If I were you…” and then repeat some story about how they made a good career, raised a family, bought a house, stayed out of debt, and saved a tidy retirement fund by working at the same company for 40 years with only a HS education.  \n“Learn to type, you’ll always have a job” (my mom to me in the 80s).\n“I should get a waitress job” my 62 year old ex boss  who has never waitressed in her life. She said this to me while opining the state of her real estate  career since she only made $500k this year.  I was making $18 per hour.",
   "created_utc": 1699221915,
   "score": 220,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k802e7s",
   "message": "I was pouring wine for 2 ESPN reporters or something (I don't watch sports so I have no clue who they are) and one of them says to the other \"$100,000 really isn't a life changing amount of money\" and I audibly gasped. I can't imagine not thinking that even $5,000 could change someone's life",
   "created_utc": 1699228638,
   "score": 76,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zq08a",
   "message": "'Do you have to work that part-time job? It doesn't even pay enough to cover the uber'\n\nFrom my former bestie who grows up super rich, when we were studying in uni. I was explaining to her that I need to go to my part-time job the second day so we need to find another day to meet up, she said that\n\nYou can see why she's a former bestie",
   "created_utc": 1699223854,
   "score": 71,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zupa9",
   "message": "‘If folks buy 10-15 properties before they turn 30, then retirement will be a breeze.’ Sir I can’t afford one property.",
   "created_utc": 1699225657,
   "score": 73,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zy6om",
   "message": "Older guy at my work said he knew a lady from Wakanda. He was dead serious.",
   "created_utc": 1699227012,
   "score": 74,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z5ab1",
   "message": "It’s one banana, Michael, how much could it cost?  $10?",
   "created_utc": 1699216273,
   "score": 176,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zf15a",
   "message": "A classmate telling me I should get a more reliable car because I couldn't make it to work one time due to snow. A car that had been paid off for 5 years at that point, and I have now driven for 17 years without any engine or transmission problems. I'll take that over missing a few days of work, thanks.",
   "created_utc": 1699219750,
   "score": 118,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z56s7",
   "message": "actual poor people saying poorer people want to be poor while they arent the same cause they grind it. sure buddy, keep hitting yourself i guess.",
   "created_utc": 1699216238,
   "score": 213,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zpidu",
   "message": "I was speaking with a former professor of a college who was a student in the 60s I believe. They told me to my face, \"any student should have no problem getting their credits to transfer and schools like John's Hopkins should be easily affordable\". When I told her how many credits school takes now and how expensive college is she didn't believe me",
   "created_utc": 1699223666,
   "score": 136,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zdcwq",
   "message": "American young person helping to clear the rubble after devastating, catastrophic earthquakes in a developing country. “You know what these people need? Cinnamon essential oil.” Seriously.",
   "created_utc": 1699219151,
   "score": 63,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zooqz",
   "message": "If slaves didn't like being slaves why didn't they leave and go back to Africa.",
   "created_utc": 1699223352,
   "score": 224,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7z1scn",
   "message": "Everything my grandfather ever said. For him, aside from cars looking different, color TV and the area around the family farm being more built up, the world was exactly as it was in the 1950s.",
   "created_utc": 1699215024,
   "score": 86,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zff4u",
   "message": "Anything Rishi Sunak says",
   "created_utc": 1699219891,
   "score": 204,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zb1bu",
   "message": "On the subject of how to fix american healthcare\n\n\\- Make everyone pay up front.",
   "created_utc": 1699218319,
   "score": 190,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zzii3",
   "message": "My college gf while watching the Obama v Romney debate said \" my family lives paycheck to paycheck too, it's hard paying for 2 houses \" her dad was a VP at Walmart.",
   "created_utc": 1699227521,
   "score": 149,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k807cwr",
   "message": "Kim Kardashian telling the general public to get off our asses and work, because no one wants to work these days… coming from someone who was born into a lavish lifestyle.. like come on",
   "created_utc": 1699230588,
   "score": 51,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zg21z",
   "message": "This week at work I began having chest pains and bradycardia with severe lightheadedness. My work told me I need to just “stick it out”\n\n I work in the medical field ironically enough",
   "created_utc": 1699220130,
   "score": 146,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7znype",
   "message": "They are raising property taxes 73% where I live. The dumb cunt running for city council said “maybe you have to get a second job to afford it”.",
   "created_utc": 1699223076,
   "score": 135,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zsm7i",
   "message": "Not something said but when Charli and Dixie Damelio took a shift at Walmart and documented it on Tiktok. Flipping their hair and giggling the whole time. They have never had to work a real job and they never will. It was so tasteless.",
   "created_utc": 1699224852,
   "score": 98,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k7zoptq",
   "message": "My mechanic was talking in the shop about how we shouldn't have given women the right to drive. It got women out of the kitchen and house and that has been the fall of this country.\n\nThis was this year, 2023.",
   "created_utc": 1699223363,
   "score": 239,
   "submission_id": "17oj35h"
  },
  {
   "comment_id": "k80drnm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17oj35h"
  }
 ]
}