{
 "submission_id": "17omtfl",
 "title": "Have you ever gotten up and quit your job in the middle of a work shift? If so, why?",
 "selftext": "",
 "created_utc": 1699221294,
 "permalink": "/r/AskReddit/comments/17omtfl/have_you_ever_gotten_up_and_quit_your_job_in_the/",
 "score": 64,
 "url": "https://www.reddit.com/r/AskReddit/comments/17omtfl/have_you_ever_gotten_up_and_quit_your_job_in_the/",
 "comments": [
  {
   "comment_id": "k7zoasb",
   "message": "I was looking for work and took anything I could find, unfortunately the job I found was telemarketing. I hate myself too.\n\nAnyway the work sucked and I hated it, I always took no for an answer and that got me in lots of trouble. They kept putting me in a room with this old VHS tape on pressure tactics and never taking no for an answer. The tape went for an hour so I just had a nap instead. \n\nThankfully I was also looking for work on the side and found/got a job at the local supermarket, so I knew I had a backup plan. \n\nThe next time they put me in that room with that tape, I had a nap again and then when I came out they said \"if you have to go in there again your position will be terminated\". I just said \"I'll save you the trouble, I quit\". That really pissed them off because they were already understaffed.",
   "created_utc": 1699223201,
   "score": 17,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zrux2",
   "message": "Day 2. Owner tells me that he pays taxes for us so he pays cash and it is after taxes. So 7.5 and not the 10/hr we agreed to.\n\nI walked out and called the IRS hotline to report fraud.",
   "created_utc": 1699224561,
   "score": 153,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zptff",
   "message": "Dishwasher, had worked there 2 weeks. The A/C for kitchen and office both broke the day before I started. Office A/C was fixed the following day, kitchen A/C 'wasn't priority '. It was a heatwave in August, hitting 115° outside. The whole kitchen staff walked out.",
   "created_utc": 1699223782,
   "score": 190,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zlmwi",
   "message": "Temp agency sent me for assignment to a small factory making furniture. 7am start time. At 7:03 or :04 , while still waiting for some sort of foreman/ supervisor to come over \u0026amp; say hello, here's what we do here ........   coupla dudes start shouting at each other \u0026amp; it breaks out into full blown fisticuffs. \n\n  Yeah, I'd seen enough. Funny how i have a completely crystal clear memory of looking at the clock in my car as i drove away. 7:12am",
   "created_utc": 1699222192,
   "score": 63,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zk4n2",
   "message": "I worked at a car wash during the winter in the wet tunnel. Manager got in my face for wearing a coat that didn’t have the company logo on it, but they didn’t make uniform coats. Told him to eat my entire ass and choke on it, and then left.\n\nIt gets below zero here regularly, I’m not risking my life or even my comfort for $12 an hour.",
   "created_utc": 1699221630,
   "score": 71,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zjraa",
   "message": "Yeah me and the entire waiting staff walked out. The new owner of the restaurant i worked for wanted to charge the staff for breakages.",
   "created_utc": 1699221491,
   "score": 63,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7znijc",
   "message": "I was a cook and new manager kept making me cover dish pit cuz dishwasher was not showing up, because they refused to hire another one and were making him work 7 days/week. I told him if he kept making me close dish pit I was gonna put my 2 weeks in. He said “good” and went back to cooking. So I went and grabbed my shoes and backpack, got his attention, he turned around and I gave him a peace sign and left. \n\nKeep in mind i had been there for three years, worked as a busser, dishwasher, server, host, cook…I did everything they asked. He had only been out manager for 2 months.",
   "created_utc": 1699222905,
   "score": 141,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zpku9",
   "message": "I was 17 and just finshed mopping the floor at closing time and was walking out the door. The owners son walked across the floor in boots covered in motor oil and told me to \"mop this shit up\" I dropped the mop on the foor and told him to do it himself. I wad being paid minimum wage and wasn't going to deal with that shit.",
   "created_utc": 1699223692,
   "score": 56,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zsuk3",
   "message": "Had a part time job for about 40 minutes in college. Started as a data entry job, paid 7.25. The owner found out I was going to school for an IT related field and starting throwing tasks like updating his website and basic tech support. I left almost immediately.",
   "created_utc": 1699224940,
   "score": 150,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zr482",
   "message": "Dell computer sales 1998.  They fired 90% of all the commission making sales people and replaced them with hourly workers from a temp agency.  They then asked me to train them.  I was like, “maybe you should have trained them before firing everyone— why would I train them so you can fire me in 2 weeks?”\n\nI then grabbed my shit and noped out of there!",
   "created_utc": 1699224275,
   "score": 236,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zrpgg",
   "message": "Yes. FedEx Ground. Was a package handler making $12 an hour. The requirements were insane for the conditions they had us working in. \n\nOne day, I told my sort manager that I was running to the restroom and he was like “Cmon, man. Can you hold it for another 45 at least?” I told him no, and went off to the bathroom. I was already fed up with the job, but that was the tipping point for me. I got out the bathroom, walked to the time clock, clocked out, and left. \n\nA month later, at my new job, I got a call from FedEx Ground. They were wondering where I’d been since I hadn’t been seen at work in over a month. They told me to give them a call back if I was still interested in working. lol.",
   "created_utc": 1699224500,
   "score": 244,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zs8kk",
   "message": "Closest I personally came was giving one days notice when I was a 3rd grade teacher. Basically the entire job was me fighting administration for more than *literally* *zero* time to actually do the job I was there to do. When I asked for time to plan lessons, help students who were falling behind, or work on helping special needs students in my class, I was denied every time. No exaggeration, I was in the beginning phases of a mental breakdown.\n\nI went in to front office one morning to ask about what the best way to quit was in a way that didn't negatively impact my students, but before I could ask they gave me the \"bad news,\" that the last 7 hire teachers (i.e. me and 6 others) were being moved to other schools the following Monday due to enrollment changes, and I immediately said \"great, I quit,\" and left the next day. It was really sad leaving my class, but from the bottom of my heart: fuck that job.",
   "created_utc": 1699224709,
   "score": 204,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7znw03",
   "message": "I got a job at a new grooming salon in a Petco. It was a commission based job, and they still had a sign out front saying \"grooming salon coming soon\". So after a week of making no money, I came into work and the manager said, \"You can't wear jeans here.\". \"Ok\", I replied, then turned around and walked out never to be seen again. He called a week later asking me to come back. I laughed and hung up.",
   "created_utc": 1699223047,
   "score": 182,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7znpmm",
   "message": "Sure. Aside from being a firefighter/medic (small volunteer department. NOT paid) we all had a regular day to day job. Mine was always working in bars, pizza places ETC. stuff like that. I was/am a cook. Had one particular manager at the time that would talk down to you like you were a piece of dog shit. I let it slide way longer than I should have. I eventually said something one day and it got twice as bad. He eventually got in my face and was legitimately yelling. I basically told him to suck a dick and that he needs to learn how to talk to people. I walked out that night and left him by himself to run that whole kitchen with at least 10+ tickets that I know had not even been started yet. This was back in 2016 ISH. I heard he called two other employees in on their day off and I later found out he did the very same thing to them as well and the end result was the same. They too walked out on him. Fast forward a bunch of years to current time and a couple other restaurant/bar jobs later, I’m back at that same exact place and he is no longer there, I now am that manager and run the show. I don’t care if you’re the president of the United States or a Homeless guy on the side of the road, I will treat and talk to you the same exact way you talk to me. Everybody is out here struggling. It costs absolutely nothing to be nice to someone. You have literally no idea what someone may be going thru. Be a decent human.",
   "created_utc": 1699222980,
   "score": 210,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zonq8",
   "message": "Yeah the job I have right now actually. Which sounds weird, but let me explain. \n\nI work in Solar fields as a laborer and have for about a year now after spending the last 4 years doing demo/concrete work. \n\nBecause of that my work ethic is pretty strong. And I expect to work when I’m at work, in fact I’d go so far as to say I enjoy it. \n\nWell this Solar site I was at, they didn’t have any work. They had 40 guys on site and maybe 10 of them doing anything. Yet they told us if we were caught standing around we’d be fired. So it encourages a game of cat and mouse with our foremen. (Who didn’t know what the hell they were doing in the first place.)\n\nSo for a few weeks I did absolutely nothing but spend 60 hours a week standing in a field with a bunch of grown ass men talking about everything we could. Felt like I was losing my mind after a while, I desperately needed to work on something.\n\nAt home I had plenty to do since I just bought my first apartment, so I decided to just leave during lunch. Which I had done many times before for the same reason and because at that point I really didn’t give a fuck about this “job” anymore. \n\nSo I went into the trailer and told my foreman I was leaving at lunch for the day. Then he told me he was going to have a meeting at the end of the day about people leaving early and how he might fire some people. So I said I’d save him the effort, and quit then and there. \n\nMy boss from my temp agency reached out to me asking about it, got in contact with the foreman and his boss. Did some digging and then somehow the foreman ended up getting fired, and I ended up getting promoted to crew lead with a nice raise. \n\nGood stuff I guess. Doesn’t really solve my issue of not having a lot of work.. but I guess having a lot of money is nice too.",
   "created_utc": 1699223342,
   "score": 191,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zlwqh",
   "message": "In 2004 I briefly worked for a BMW dealership when I got out of college. A few days into the job, my Mom came in and wanted me to help her buy a new 3-series. The sales manager was this super douche, and he had a policy that salesmen weren't allowed to talk price with customers - we had to immediately take the customer to him so they could discuss the numbers. Okay, fine, I can do that.\n\nBut Mom starts asking me where I thought we could be on it, and I told her. Because, you know, she's my fucking mom. Like not a crazy price - just what I thought would be doable.\n\nManager ends up screaming at me in a room full of people (including customers), calling me a dumbass, etc. Told him to fuck off and walked out. It was kinda fun - it's the only time I've ever done that. Been a self-employed business owner ever since then! And it turns out, I'm really good at selling very expensive things. So fuck that manager.\n\nOh, and he got fired like a month after I quit.",
   "created_utc": 1699222294,
   "score": 180,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zrpzq",
   "message": "I worked at a Bevmo! for almost two years. The manager and I never got along so well, but I tried my best to learn more than anyone about our products.\n\nI went to special trainings, studied off the clock, paid insane prices to sample the big new releases.\n\nI worked my ass off, and got a lot of upsales/add-ons. We had high turnover so I became the most senior cashier after a shift leader left.\n\nBut he decided to do an outside hire for the opening. Right after that, he took me aside and told me he didn't give me the job because he saw me not upselling to some of our regulars.\n\nHe mentioned specifically a man who was an obvious alcoholic. He would buy a 750ml of El Jimador two to three times a week. My boss told me I should've gotten him on the 1.75 L a long time ago.\n\nI realized I was basically an enabler and a drug dealer, and that my boss didn't respect me or our customers. I quit on the spot, and told him you can't pay me enough to basically kill a man. Not that he was offering to pay me more anyways...\n\nFuck retail, fuck profits over people, and honestly most of the priciest craft beers were overdone and nasty. Fancy vodka can be made with any charcoal filter, and liquor/wine sales are entirely driven by either the brand name alone or the art on the label. \n\nAsk me about the real good stuff tho, it does exist.",
   "created_utc": 1699224506,
   "score": 60,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zrzjq",
   "message": "I worked in a Meijer distribution warehouse when I first got out of the Army. I already had one foot out the door as I was awaiting a drug screen as a final step to federal employment as a civilian. I worked in the refrigerated foods section picking orders and loading trucks. The frozen foods were in a deep freezer that was something ridiculous like -10° below if I remember correctly. I was used as a fill-in for the deep freezer some nights when they were short handed but this particular night I started in the refrigerated section as normal when the boss came and asked if I could go in the freezer because somebody was sick and left early. I told him I’d rather not because I just did a couple shifts in there the last two nights and asked if he had anyone else that could cover it. He said no and now he was ordering me to do it. I sighed and said ok let me go to my locker and get my freezer gear. As I walked toward the locker room I clocked out and kept on walking out the door. Only time I’ve ever walked off a job in my life. That place was miserable and paid minimum wage plus a meager shift differential. I started my now 26-year federal career a couple weeks later and will hopefully be retiring in 7 years once I have the age.",
   "created_utc": 1699224611,
   "score": 202,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k80i5r9",
   "message": "As a 17-year-old, summer between Junior and Senior year of high school I worked at a Target. Job was fine, easy enough, pay was shit but all I needed was money for weed and gas so it was good enough and I had a fling with a coworker that was fun.\n\nOne day, a very confused, very elderly lady in either a flimsy dress or what I think was more likely a nightgown stopped me and asked me where the toilet paper was. I escorted her to the TP aisle and she froze in the middle of it and explosively shat herself. She was embarrassed and crying and I felt awful for her and radioed for some help never having dealt with anything like that before. \n\nA manager came over and yelled at her, threatened to call the cops, and had security escort her out of the building instead of having a shred of decency or sympathy for this weeping senile woman. I kinda meekly told him she was ashamed enough as it was and he didn’t need to pile on. He brushed that off then told me to get a mop. I went to the back and grabbed a mop and bucket, tried to hand him the mop and he said “No, you’re cleaning it up, I was just making sure no one came down the aisle.” I told him I absolutely was not cleaning up human shit sprayed all over the floor. He smugly said “Oh yes you are,” so I dropped the mop and my walkie (in the shit), and walked out. \n\nLeft and was able to smoke a bowl and catch an afternoon screening of The Incredibles at the theater down the street. Definitely the right call and fuck that guy.",
   "created_utc": 1699235078,
   "score": 190,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zrynr",
   "message": "Yes, actually! I had been at this place for a few weeks, it was an overnight delivery job, we'd load our trucks up around 5 pm, and punch out around 7 am. There were some major red flags I had seen, but it built up until one more thing caused me to snap. \n\nSome of the things I had seen leading up to this: \nPoor equipment, and not enough equipment. They had like 12 trucks for 12 routes, and they wouldn't fix anything, so there were broken trucks and you had to get there early to claim a truck that wasn't trash. There was also a shortage of tie downs, so you had to hide some straps so you could properly secure your load. \n\nThe worst pay system I've ever seen. It was so convoluted and it changed often, it was designed to reward those who cut corners and did as little as possible. \n\nThe people who picked the orders sometimes weren't done on time, so you'd have to wait around to leave. Sometimes this pushed you over the 14 hour DOT regulation, and they'd just tell you to lie and put your time for under 14 hours. \n\nOn top of those issues, it put me on the opposite schedule as the rest of my family, so it was really hard on my home life. Anyway, I had finished about a week of training and went off on my own. First day was ok. Second day I had to hunt down a truck and load straps. I ran all over the warehouse, and talked to 3 different supervisors. It was like pulling teeth just to get the basic equipment needed to do the job. I finally get the stuff, get all my paperwork, get the truck loaded, and hit the road. I'm halfway through my route when they call me. There's 5 more stops, they didn't give me any papers for it or say anything about it while I spoke to everyone in that warehouse. They wanted me to come get it. I delivered what I had loaded onto the truck originally,  brought it back, gave them my badge and said I was done. They tried all sorts of begging and threats, but I've never been so done with a place.",
   "created_utc": 1699224602,
   "score": 96,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zpp6l",
   "message": "I was 23 working a construction temp job as a carpenter doing demo at an office they were renovating. The foreman of the company that hired me asked me to do two things, clear out a room and assist the electricians that were working the site. About an hour into that task he came in the building while I was helping the electricians unload materials and yelled at me for pausing demo to lend a hand even though that’s pretty much what he told me to do.\n\nI dropped everything, packed up all my stuff, and told the guy to shove it. Id been treated better by superiors when I was working 2 minimum wage jobs and living out of my car then I had for the whole 2 days I knew this foreman.",
   "created_utc": 1699223739,
   "score": 22,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zugxg",
   "message": "$10 an hour.  My boss would solve problems exclusively by shouting.  One day I was super busy, and I skipped putting out a table.  I was wrong, but it was one of sixty I put out.  The chef asked nicely if I could.  I said yeah.  I'll grab it.  Before I could.  I hear just screaming.  It's nothing helpful.  Just screeching the same words I was told thirty seconds earlier.  At that point I was sick of it.  I told her \"This is why we can't keep staff.\". I walked out.  I got woken up the next morning to the morning manager asking for me to help.  I said I would come in, but today is my only day, and if I see the other manager at all I'm walking out.  I finished the morning prep, and left.  I was told later that she was fired after two more people quit on her the next day.",
   "created_utc": 1699225568,
   "score": 177,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zk51a",
   "message": "I worked a door, we barred all the local drug dealers, they came back multiple times over the next few weeks trying to attack us. Came to work one day and they was all allowed back in the pub, the landlord missed the money they put behind the bar. I left, wasn’t worth the risk. I just walked off the door and left them to it.",
   "created_utc": 1699221634,
   "score": 211,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zqsr3",
   "message": "Oh yeah. I worked at a call center/answering service on the 7am-3pm shift and was in school part time taking evening classes. They changed my schedule to be the evening shift 3-11pm with only two days notice and told me if I wanted to keep working there I’d have to find a way to make it work with my school schedule. So I went to my desk, packed up my things, put my phone on hold and went home.",
   "created_utc": 1699224155,
   "score": 155,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k80ab69",
   "message": "After I retired early (at 50) I thought that a job at the local Tim Hortons would be perfect. Part time, no stress, and I enjoy seniors and our sleepy town of 2000 had a high percentage of seniors. \n\nMost of \"training\" was me fixing the computers to get them to work so that I could actually watch the training videos.  That was week one. \n\nWeek two I realized how slow the location was, despite being on the highway. We had a lunch rush and it was pretty slow other than that. \n\nTwo days into week two and I was already recognizing the regulars. Seniors in their 70/80's who would come and get one coffee in a China cup and ask that I fill it as much as I can because we didn't give refills. No problems, it drove me nuts to dump coffee after 20 minutes and not offer it to them. \n\nProblem was, very few of them could carry these full cups to the tables. No worries from me, I'd bring their coffee to them. As I said, the location was slow and days were long and boring. It was no big deal to carry coffee cups for a few seniors and make them smile. \n\nTwice that second day working the floor I got in shit for doing that. I pointed out that there was no one else in the store and it just took me moments. \"we are not a full service restaurant, let them carry their own coffees\"\n\nI stood like a useless fool behind the counter when the next group of seniors came in, feeling like an idiot. \n\nBreak time came. I grabbed my coat and went out back for a smoke. Halfway through my break, with one of the managers, I said \"fuck this. I can't treat people like this. Sorry\" and walked home never to return as an employee. \n\nOn the rare occasion that I go there as a customer, I'll jump up from my table to assist any seniors that I see and now they can't do a damned thing about it. Ha!",
   "created_utc": 1699231756,
   "score": 77,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zjs4f",
   "message": "Was server. Working for tips only. Had one table in one week. Made 2 bucks. Probably nobody ever realized I was gone.",
   "created_utc": 1699221500,
   "score": 81,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zk9vx",
   "message": "Yes, I've done this three times.  \n\nThe first time, it was a contract position.  The boss asked me to \"put in more effort,\" which translated to \"I want you to work more hours for free.\"  No, thanks.  \n\nIn the second one, The owner and her husband (my boss) called me into a meeting to yell and curse at me (put the fear of God in me, I guess), then told me how I was going to report some false information to the customer.  Nope, I said, \"People don't talk to me like that,\" and left.  \n\nIn the third one, I agreed to work part-time (no more than 4 hours a day) while my wife was hospitalized.  The first day, they asked me to work 6 hours, then told me to be ready to work 8 hours the next day.  I just left.",
   "created_utc": 1699221683,
   "score": 168,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7znfya",
   "message": "I was at the height of my alcoholism, working in a pizza shop. I was making pizzas and trying to hold it together while in active withdrawal. Got my paycheck via direct deposit and decided I would move on to bigger and better things that day. Bigger and better things being a big bottle of gas station vodka and some $1 lemonade for a mixer. Don't recommend working in a hot environment as an alcoholic in active withdrawal.",
   "created_utc": 1699222878,
   "score": 11,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k802g2m",
   "message": "Yep. I started a job on a Monday. Friday came and I get a paycheck at lunchtime. Didn't expect that as most places hold back a week. They paid on Friday assuming you are finishing out your day and giving you \"credit\" for those hours.\n\nAnyways I get my check and I notice I'm being paid $2.00 less an hour than we agreed on. I bring it up and the foreman tells me, \"Yeah sorry about that I couldn't get the big guy (the owner) to agree to those rates.\" I'm like, oh and you didn't think that might be something I would like to know? His answer, \"Well, there isn't much we can do about that now, I'll try and work on him in a month or two\", and he turned and walked away. I got up, wheeled my tool box to the garage door and brought my truck around and loaded it up. He comes out just as I'm finished and his jaw drops to the floor and tries to get me to stay. No way dude, you screwed me, I'm out. C-Ya.\n\nCalled me five times in the next two weeks each time offering more money but I just kept saying no. He eventually gave up and I found a job paying me higher than his last offer anyways, so it worked out.",
   "created_utc": 1699228658,
   "score": 70,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zl0yp",
   "message": "Was working holiday season at a local post office as a ‘rural carrier’ which meant I ran the Saturday route for a full-time employee. Paid good and helped me save to purchase my first home, but it was a 6hr route that mostly took me 10hrs to complete. Like I said, holiday season so plenty of packages and regular mail plus rural meant backroads…in snow…driving while sitting in my passenger seat, leg kicked over the transmission hump. Lots of stress and long Saturdays. Finally was bit by a chihuahua while delivering and said F it. Brought back all undelivered mail and set it on the postmaster’s desk. Thanked them for the opportunity and called it a career. \n\nIt took a lot of preparation as far as training, background checks, etc. but I knew it wasn’t for me. I give those folks doing those jobs at the postal service credit. Not for me though.",
   "created_utc": 1699221964,
   "score": 37,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zyfal",
   "message": "McDonalds. Our manager Mark was a dick. He chucked the bag of Mcflurry toppings at me during another one of his tantrums and told me to fill it. I threw it back at his head, then threw my hat at him, then my McDs polo,, then walked out half naked. Would have thrown my pants and shoes too but I paid for them. Fuck you Mark.",
   "created_utc": 1699227103,
   "score": 240,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zm9am",
   "message": "I walked into work, unlocked my toolbox, took  deep breathe, locked my toolbox and drove home.",
   "created_utc": 1699222427,
   "score": 38,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zsmow",
   "message": "My first day they asked if I could stay late and do a 10hr day. I said sure. Next day was the same. Then they flat out told be that everyone was doing 12 he days 7 days a week. Before I got the job they mentioned they do some overtime but it’s optional. Well once I got hired I realized it wasn’t optional unless you want to get fired. So I worked for about two months straight. Saturday they usually didn’t care if you came in an hour later. One day I just need that extra sleep and went in 30mins later. Boss lost it on me and talked shit about me all day to my co workers. He even started to send some of the guys home an hour early that came in at the other time and told them he was going to keep me later. That’s when it hit me.  I owe them nothing and fuck then. I started to pack up my tools and my boss asked what I was doing. Told him I’m done with his games and to fuck off. As I loaded my car up a-lot of the guys came up and talked with me. The boss was still talking shit and was saying I’d be back with in the week. HR called me like a week later to ask if I was coming back. I never went back.",
   "created_utc": 1699224857,
   "score": 107,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zoiur",
   "message": "I was a convenience 🏪 store cashier. We got a new manager and just after I counted my drawer she introduced herself and told me \"you've heard the term, all shit runs downhill? Well, that's what it's like to work for me\"  I said ok, well I dont work for you, bye.",
   "created_utc": 1699223289,
   "score": 177,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zycjd",
   "message": "Yes. Worked at a factory, moved from the \"temp agency only\" product line to the \"new direct hire\" product line. A year later trained to be a machine lead for one of their fancy products, managing a couple other workers. Something like 6 months later, we all came into work to find they had disassembled the entire thing and gotten rid of it. They sent us all to do miscellaneous scrap and cleaning work for days while they were deciding, probably,  what to do with us.\n\n2nd day of that I realized I was completely sick of the place, nobody there really cared anything about me, and I didn't want to keep doing this shit. I was on break, just walked to the security check in, dropped my badge, went home. None of my \"friends\" ever called or messaged, so I was right about that one.",
   "created_utc": 1699227074,
   "score": 53,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k800xys",
   "message": "I was a bar back in my 20s, and I had an incredibly emotionally and physically abusive boss. It was a weekend night, and the bar had two floors, and I was the only bar back that night, and there was only one bartender on each floor. At about midnight, food orders would start coming in left and right, and that night was no exception. Between having to empty out ashtrays, pick up dirty glasses, clean tables, wash dishes, and make all of the food orders, I couldn’t keep up. My boss got very angry with me because I was behind on food orders and people were starting to get upset about having tables with empty glasses and very delayed food orders. She summoned me over to the bar, grabbed me by the shirt collar, shook me, and screamed in my face, “Just get me through the rest of the fucking night and then you can quit!” I was in disbelief, and went back upstairs. I looked at all of the tickets I had left to make, and just decided that job wasn’t worth it. I turned off the grill and the fryers, turned the light off in the kitchen, threw my towel in the dirty towel hamper, and walked out. That was the night I stopped taking other peoples’ shit.",
   "created_utc": 1699228072,
   "score": 50,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7ztotq",
   "message": "My husband. He was summoned for an emergency behavior meeting. Started with “even though your numbers are top in the company you get up from your desk for water too many times a day.”\n\nHe said “I’m going to stop your right there, we can make this quick, I’m out”….and immediately left.\n\nWorked in logistics.",
   "created_utc": 1699225266,
   "score": 126,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zs8rt",
   "message": "Over two decades ago, I walked out on Target. They kept scheduling me outside of my availability, no matter how often I brought it to their attention.\n\nThe last time they did so, I reminded them that my availability had zero wiggle room. They told me to figure it out. So I did.\n\nOther than that aspect of things being mismanaged, I liked working there well enough. I had nice peers and all.",
   "created_utc": 1699224711,
   "score": 159,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zpswd",
   "message": "Twice. Once as a server at IHoP, where none of the kitchen staff spoke English and kept screwing up customers' orders and causing major delays during a moderately busy morning. I counted out my tips and dropped my apron at the front desk and walked out.\n\nAnother time as a cashier at Walmart, where the system forces you to take a break after so much time working and locks the cash register. I had told a couple sups that I haven't had a break and I'm gonna get locked out soon. They didn't bother to find a temporary replacement for me for 30 minutes so I could take my mandated lunch. Well, I got locked out. And then proceeded to get fussed at in front of customers that I hadn't told anyone. I took off my blue vest and handed it and my key to my cash drawer to a CSM, went and bought a couple groceries and left.",
   "created_utc": 1699223776,
   "score": 152,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zzaki",
   "message": "Yes, and this shows you how old I am LOL. I was a directory assistance operator. People used to call 411 to get someone's phone number (before the time of cell phones or the internet). They were VERY strict with clock-in, clock-out, lunches and bathroom breaks. I never had any troubles, until one day I was increasing my water intake for a diet.   \n\n\nI took two 3 minute breaks (the max) for the day and when I needed to go again, the supervisor would not approve me to leave to go pee. I explained I cannot hold it - they said too bad, your shift ends in 3 hours, you can wait until then or we will write you up for abandoning your station.   \n\n\nI said, you know what? never mind - I quit! No one is gonna tell me, a grown ass man when or if I can use the bathroom. I threw down my headset and headed for the door. The supervisor chased after me saying \" You can;t do this! You cannot leave in the middle of your shift!\" I said \"I don't have a shift anymore - I QUIT!\" Security met me and tried to walk me out. I headed straight to the bathroom. Security followed me in telling me I had to leave. I whipped it out and started to pee - and they sat there and watched me pee the longest pee I think I have ever had LOL. They were like - \"Jesus Dude! how much pee do you have in you?\" When I got done - did not even wash my hands and walked out.   \n\n\nThe most satisfying quit of my life - in more ways than one.",
   "created_utc": 1699227436,
   "score": 43,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k803t11",
   "message": "Worked at UPS store part time during Christmas about 15 years ago to make extra money for the holidays.\n\nBefore I started I let the owner know I had a 3 days trip a few weeks after I started. It was paid for and I had every intention of going, so I made sure she knew this before hiring me.\n\nThe day I was supposed to leave for my trip it was an incredibly busy day there, and I came in early so I could leave at a good time to hit the road…the owner came to me and said “I’m sorry to do this, but we can’t afford for you to leave today…”\n\nI thought she was kidding…so I laughed and said “oh ok! Sure thing!” And she responds “I’m serious, you’ll need to stay until close tonight. We are too busy to have you leave, and if you want this job when you come back, you’ll stay.”\n\nShe was looking me dead in the eye and was totally serious. I finished the group of people who were waiting because they had been so patient…I walked back to her desk and said “we agreed to this before I came on board, and I will be leaving in 15min.”\n\nShe said “then that will be your last 15min.” My response was so perfect it made me smile while being enraged…I said “you can pack that 15min in one of these boxes and shove it up your ass.”\n\nWalked out and never went back. She called another guy to come in and fill in and he quit too because she threatened him too. I found out she had to work open to close by herself several days because of us quitting. Made me happy.",
   "created_utc": 1699229193,
   "score": 43,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zt70w",
   "message": "Was working as a telemarketer 20+ years ago. Guy a few cubicles away from me got in trouble for going off-script, flipped out, threw his large computer monitor on the ground and said he was coming back tomorrow to kill all of us.\n\nI took my time eating my sandwich at lunch that day, came back, and decided that I had spread enough misery for one summer. Told my manager and left.",
   "created_utc": 1699225074,
   "score": 85,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zp0wy",
   "message": "I worked for DishTV as a installer. Nothing was said to me during the hiring/training process. After about four months of work, my manager complained I wasn’t upselling enough new installs (like a basic sub package to premium channels, for example).  I told him I had no desire to sell people something they didn’t want. He pressed, I walked. \n\nTo add to it, I was a remote tech (worked out of my house instead of a shop, Dish shipped me all my equipment). I told him he could pickup his crap the next day or it would be on the curb. Two trucks showed up the next day. What a crappy company.",
   "created_utc": 1699223482,
   "score": 110,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zsqys",
   "message": "Yep. I was working as a cook in a small restaurant. Since it was \"slow\" the owner left to go play tennis while he made me do everything - serving, washing dishes, and cooking. So I was literally the only employee there. And what do you know, that day it got busy and we got a bunch of customers and I ran the entire operation solo - serving, cooking, washing dishes. After the rush died down I quit and walked out.",
   "created_utc": 1699224903,
   "score": 110,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zpjxo",
   "message": "I was working in the meat department at a grocery store and had a manager that was a dick. He was always acting like he was some big top dog alpha douche. I came in one morning and he was in a pissy mood about something and was acting more dickish than usual, and after a couple hours of it I had enough. He came walking up to me bitching about how I was taking too long on something, I can't remember now what it was, and I looked at him and told him to go fuck himself. I took off my apron, set it on the table, and left. He was running his mouth the whole time I was walking away. It was all I could do to not pick up one of the knives and chuck it at him.",
   "created_utc": 1699223683,
   "score": 74,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zmm48",
   "message": "I worked in retail when I was young. At one job, another employee started violently berating me and calling me names after I asked a simple question. When I started crying over it and walked to the back room to calm down, he followed me and made fun of me. I think he was mentally challenged, but I wasn't going to put up with that kind of harassment at work. I walked out of that store and never went back.",
   "created_utc": 1699222561,
   "score": 131,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zrcwg",
   "message": "Long story short since I've posted it before elsewhere...For 3 years I watched the owner get in verbal shouting matches with his employees then have a closed door \"apology\" meeting, and repeat sometimes with the same employees.\n\nIt was my turn, we did the yelling back and forth, I knew how it would play out. \n\nGrabbed my jacket from the office told the 1 coworker I liked who saw our argument \"good luck man\" and left at 10 am on 3/13/20.. timing could literally not be worse but the job was causing me to gain weight and lose hair.",
   "created_utc": 1699224365,
   "score": 66,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k8006ya",
   "message": "Jiffy lube when I was 18. I lasted 3 days on the job. I play with cars as a hobby, rebuilt my first motor at 17, did all the maintenance and upgrades to my own car that I would take to the track when I had the money, so figured a lube tech would be easy, and it was, that was not the problem. \n\nDay 1 was “training” where a guy spent an hour trying to teach me how to read dipsticks. It took an hour because he kept arguing with me where the “full” line was. I said there is a high and low mark, you wanna go in the middle. He said you fill OVER the high mark, that way they can charge for more oil. That was when I decided my days there would not be long. \n\nDay 2, I got to start doing oil changes. That’s when I noticed they had 2 oils. Conventional and synthetic. Now, if you have ever been to an auto parts store, you might notice there is more than 2 oils. Motors need different weights. Obviously the car will run with the wrong weight (most of the time) or there wouldn’t be any jiffy lubes around anymore, but it is horrible for the longevity of the motor. On top of that, techs were putting the synthetic in motors that called for conventional, big no no. \n\nThen came day 3. Apparently I was the fastest tech and the most knowledgeable so they wanted me up front selling the services, fine. This is when shit turned sideways for me. I was basically hovering over the service advisor so I can figure out how their computer systems work and after EVERY car, I would question the dude why he would “upsell” synthetic when the car doesn’t take it or something similar. The answer was always $$. We get paid on commission so anything that cost more is fair game to this asshat. Last straw was a BRAND NEW f-150. 3k miles on the dash, first oil change for this car. A women was driving it, she said it was her husbands (to this day I don’t k ow why she didn’t go to the dealership since the first oil change is free for most brands). Now, if you don’t know, coolant comes in many colors nowadays. Generally it is green, but I’ve seen blue, I’ve seen pink, and this ford had orange coolant. I follow this prick out to the truck and he pops the hood, sees the coolant and proceeds to tell her it’s bad. “Orange means it’s burnt, it should be green like this” and shows her the cheap $10/gal coolant without any of the additive that ford put in their coolant for this motor. I stopped him, I told him it’s a ford, this is a normal color. But he spun the fact that I’m new, he’s worked there for years, orange is burnt and convinced her to flush it with their shit coolant (on top of the wrong oil weight). All I could imagine was an angry husband coming back, demanding what asshole fucked up his brand new truck.\n\nI went to the “bathroom” via the back door, got in my car, and never looked back. I was supposed to be giving that guy some days off, fuck that dude. I hope that husband beat the shit out of him (but I know that probably nothing ever happened)",
   "created_utc": 1699227780,
   "score": 68,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zuig5",
   "message": "I worked front end at a bakery. Owner/Chef was a total douchenozzle. Raised in privilege. Thought since it was his business he could spout off whatever asinine political views he had and nobody could disagree. Things like \"sometimes you have to consider what a woman was wearing to get assaulted\" and \"teachers get paid too much for not working 3 months out of the year\". He also withheld credit card tips on the idea that they would be used as a \"Christmas bonus\" nevermind that it was legally my money.\n\nI quit on the 4th of July. It was totally dead and I was folding takeout boxes as busy work. Boss was convinced it would get busy in the afternoon?? Even tho in my town people stake their claim on the beach early in the day and stay for fireworks. I mentioned in passing I was going to take my break soon and eat my lunch. He suggested I continue folding boxes as I ate my food. After all his general assholery, this sent me over the edge. I sent my partner a text asking if they'd  be upset if I quit. They gave the all clear, so I packed up my things, clocked out, and as I walked thru the kitchen to get to the back parking lot I looked this man in his eyes and said \"I dislike you as a person. I quit!\" And walked out. The other chefs jaws were on the floor. It was glorious.",
   "created_utc": 1699225584,
   "score": 32,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zpw8s",
   "message": "Had a creepy ass manager that would give pay raises to women only. When I found out I had been working there longer and getting paid less because I didn’t have boobs I brought it up to him. \n\nDude didn’t like getting called out so I told him I wasn’t coming back. Finished my shift and didn’t come back for my next shift. Dude calls me trying to get me back and I was like nope, if you call me again it better be to tell me my last check is ready for pick up.",
   "created_utc": 1699223811,
   "score": 154,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zqzhp",
   "message": "I worked for carpet cleaning company in North Carolina doing overnight shifts cleaning big name restaurants. Sometimes we had to travel and stay in hotels for 3-4 days and they’d have routs along the way back for us. they had me staying in a hotel in South Carolina close to Georgia, had me work 3 jobs in one night making it 1/2 way back to the yard, then the last job they scheduled was all the way back by the hotel, across the street. \n\nBasically they had me drive 3 hours and work a total of about 6 hours along the way back closer to the shop to turn around and drive three hours BACK to where I had started my night to drive 5 hours to go back to the shop. I was mad but I was like fuck it. I drove back to the last job for the night and it was about 4am when I got there. It was a Chuck E. Cheese and it was the biggest fucking building i would have ever had to work on. I walked in, saw how massive it was and said “yeah fuck that” and walked out. Drove back to NC, parked my van and the boss tried to fire me as I was quitting. \n\nIn retrospect I should have let him fire me because then I would have been able to get benefits and I also wouldn’t have had 70% of my pay basically stolen from me because it was “incentive based pay”\n\nI told him since I knew he was gonna take that money anyway to give it to 2-3 employees that actually knew what they were doing and not the other brain dead idiots. He screamed, “NO. FUCK THAT. THATS MY MONEY. YOU CAME ASKING ME FOR A JOB REMEMBER THAT. I DONT FUCKING NEED YOU.” And continued to scream and yell and bitch and moan and give me the finger as I got into my car and drove off. \n\n\nFuck that guy and fuck that company. Now I make triple the pay I was making there.",
   "created_utc": 1699224226,
   "score": 56,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zyelt",
   "message": "I worked in a service department and was on the phone with a customer when my manager came into my work space and started yelling at me for some reason (I’ll never know why). I held up my finger and showed him I was on the phone but he kept yelling at me. I told the customer that I would need to call him back, hung up the phone then proceeded to pull a couple pictures off my desk, get my purse, and to the back to clock out. I literally ignored him and just left. It felt amazing. The owner called me later and asked me to return but I declined.",
   "created_utc": 1699227096,
   "score": 55,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zwbfw",
   "message": "Yes.\n\nOld guy here.\n\nDuring the war in Vietnam I worked on a Navy facility where bombs were made, 250, 500, and 1000-pounders.  My job was to secure the bombs inside boxcars and semi-trailers for shipment to the West Coast. I worked midnights, 12-hours a day, 7-days a week.  I made LOTS of money.  Lots.\n\nI had become entirely skeptical of the war.  One night I was crawling across a pallet of warm bombs inside a boxcar when I had this sudden vision of an Asian guy doing something similar on the other side of the Pacific.  \"What the hell am I doing?!??!\"  \n\nI climbed down, left the boxcar, and told my boss that I quit.  Right now.  He tried to convince me to stay as I was a good worker.  I refused.  He was a nice man.  he drove me back to the main shop.  I punched out, went to my car, and left.",
   "created_utc": 1699226290,
   "score": 210,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k802zv1",
   "message": "As a kid I worked at Sears for a summer, as a cashier. Sears is a shitty company that's been actively dying for years, so they were really pushing these shitty credit cards with extremely predatory interest rates - we were required to try to sell them to every customer.\n\nI'm not a douche, so when I was told 'no,' I dropped the issue and carried on the transaction as normal. One day a manager was standing behind me watching me ring out a big line of people. When I didn't try to bully anyone into getting a credit card, she told me I was \"basically a dog that rolls over for anyone\"\n\nTold her to fuck herself with a pinecone and walked out",
   "created_utc": 1699228873,
   "score": 24,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k804h4m",
   "message": "My boss had the very good idea of firing me when I arrived in the morning, but she still wanted me to do my work day! I escaped through an emergency exit....",
   "created_utc": 1699229453,
   "score": 28,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k804m5h",
   "message": "I walked out during a shift as a pharm tech at Walgreens. I went to lunch and never went back. Only so much bullying I could put up with from coworkers. And only so much yelling and screaming I can deal with from customers. It felt like every other customer was yelling expletives at me because their copay was higher than last time, or the brand looks different because we used a different manufacture, or we couldn't refill your fentanyl script a week early. You wouldn't believe the number of people who've told me that I'm going to cause the death of them because I wouldnt violate the law. Please be nice when you go to pick up your meds. The job sucks.",
   "created_utc": 1699229508,
   "score": 25,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zopm9",
   "message": "Yeah working at CVS as a pharmacy tech.  I’ve worked hotel front desks, retail, and restaurants as a host, server, and bartender.  Pharmacy customers are just on another fucking level of AWFUL.  Zero patience, zero understanding, and zero compassion.  I understand people coming in to pick up meds are probably not in a great mood, but that doesn’t give you the right to be a total piece of shit.  I don’t need anyone to be extremely kind and warm and jolly.  But a fucking OUNCE of common decency or respect wouldn’t hurt.  \n\nIt didn’t help that CVS is a terrible company to work for.  My training was “online modules” that taught me nothing.  Absolutely zero on the job training whatsoever.  Anytime I had a question someone else would just do it for me or talk to the customer themselves.  I was never taught anything.  Nobody taught me about the medications or their uses.  Nobody taught me about insurance.  Nothing.  \n\nMy schedule was a mess.  One day I’m working 1pm-3pm, the next day 7am-9pm, the next day 3pm-9pm, the next day 7am-9am, five days off, then three open-close in a row.  Pharmacy was run on a skeleton crew, and everyone working back their was just always in a shitty mood.  I don’t blame them, but it didn’t make for a good place to work.  \n\nMy last straw was when the pharmacist had me go through the ENTIRE STOCK of medications and pull expired ones.  Literally thousands and thousands of tiny bottles.  I got about an hour into it and said fuck this.  I just got my water bottle and walked out without saying anything.  Blocked all coworkers and bosses numbers and that was it.  \n\nDo not go into pharmacy or pharmacy tech, and if you do DO NOT take a job at CVS.",
   "created_utc": 1699223361,
   "score": 150,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zuhwd",
   "message": "I was finishing my masters and working part time in a call center for a bank. My first 8 months were great as I was recognized a lot for good work and was pushed to be part of many different initiatives off the phone. Once I had some seniority, I opted for a better shift and my manager changed. This entitled sob was the son of another employee in the bank who held a very high position.  The next 6 months were hell for me. He never recognized any of my hard work. I was in the top 3% in sales nationally and won back to back platinum awards. For each quarter I won, he decided to nominate someone else. First he nominated a cute girl who recently joined because according to him it will motivate her. That made no sense as quarterly nominations and she was there only a month. She quit 3 weeks later. The second time he nominated another female employee who took countless smoke breaks with him during the shift. By this time I was very unhappy and lost all motivation. On top of all this, it wasn't my field. Once I finished my Masters I would be going to a different field. But i still had a few months before that and I really liked the people I worked with. Also the work was literally next door to where I lived. I took 2 weeks off to study for my exams. I came back and found out my ex manager has been promoted to a Manager position of en entire branch to the shock of everyone, even the other managers. I was ready to put in my last few months with a new manager as I knew mostly everyone on the floor. I was excited because I was due a bonus which I would have used to pay for my tuition and my mini vacation. Turns out my asshole ex manager gave me a satisfactory review. Even though I was the highest performer on his team by a mile. That cut my bonus by half. I was super irritated and frustrated that it was quite visible. My new manager who was a sweetheart went over my review. He asked me if I was ever spoken to about longer breaks or using too much pause time between calls and I said no. He checked the entries of conversations and they were during my 2 weeks off. So he never spoke to me and just put random dates in. My new manager sent this info to the Director and I was called in to her office the next day. Instead of correcting the bs she started making excuses. I was getting so upset that I ripped a poster in her office and wrote \"I quit\" on the back and slapped it on the table. I left my key card on her table too and walked right out. I texted my new manager saying I quit and my emotions were high. I said I will be suing the bank. I got my full bonus with my last pay as my review was changed to \"exceeded expectations\". The director had the manager reach out to me asking if I wanted to reconsider and come back. They really thought I was going to sue them or try to. I had no money for that and I was so glad I finally quit. I lost all motivation to work there. Anyways yea, I just ripped that \" let's make that someday happen\" poster and wrote \"I quit\" on it  as my notice.",
   "created_utc": 1699225578,
   "score": 54,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k8038ct",
   "message": "My third job working for Xerox. \n\nMy shift was from 5-2 and all day it was just taking call after call from angry Verizon customers begging for another month of free service with varying excuses. \"My grandma died and I need to make calls\" or \"The bus I was in broke down and I need a month of free service or I'll be stranded\". All day, every day, being forced to tell these people \"no\" regardless of how legitimate their excuses were, then getting completely cussed out and yelled at. We had regulars, too. One wad an old guy that would call every Wednesday and ask me what I was wearing while obviously jerking off. \n\nOne day, I'd woken up at 4 once again tired as hell, got ready, then drove through a blizzard to be at work only to be greeted by indifference from management and a bunch of people missing due to callouts.\n\nI stood up from my computer before I even clocked on, told my supervisor I quit. He said I needed a letter of resignation so I walked back to my desk and wrote \"I QUIT\" on a page of my spiral notebook. Handed it to him and walked out. IT WAS THE BEST FEELING EVER.",
   "created_utc": 1699228966,
   "score": 20,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k804n1x",
   "message": "Back in HS I was home sick, just getting over a pretty bad stomach bug I’d had for a couple days. Grocery store manager calls me and begs me to come in because they were “slammed.” I was still pretty weak, but figured I felt ok enough to go help for a couple hours and help run a register.  Arrive to the store which isn’t busy at all. Apparently I just missed the rush, but since I was there, I could clock in and clean the bathrooms and take all the department garbages out to the dumpster. Do the work the manager didn’t want to do. \n\nOr. \n\nI could just quit and leave. So 17 year old me declined, quit and went back home. Went shopping with my mom there the next day. Bogo deals were too good.",
   "created_utc": 1699229518,
   "score": 20,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k8068gw",
   "message": "I was a cable guy in HS over the summer. On a Friday, I crashed my motorcycle while leaving a job site.  On Monday, it was all hands on deck because we were behind on a high school renovation. Even the receptionist was helping. \n\nI showed up to work with a soft cast that went from my ankle to my hip with blood soaking through the knee cap area. I was slowly going down a ladder, trying not to fall since I couldn't bend my knee and I was in pain. The receptionist said, \"could you move any slower?!\"\n\nI said F this, I don't need this job, I'm going to college in a couple months, and I shouldn't even be out of bed. I left and never came back. I had knee surgery shortly after.",
   "created_utc": 1699230146,
   "score": 22,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zsdnh",
   "message": "Was during my probation period at a student job I hated.\n\nI had taken mushrooms the day before so my brain was primed for impulsivity, though I was sober.\n\nI worked 7-2 and I had some shit to study that afternoon. The day had been stressful because of coworkers not pulling their weight the previous close.\n\nThe manager came over at the end of my shift and said \"Oh yeah you're staying until 4:30 right?\" \n\nI said \"no, I have not been informed about that, I have things to do\" and he looked confused and said \"but I was told you were staying until 4:30 and I really need you to\"\n\nSo I said \"look man, I'm on probation, I don't need to give you notice to quit just as you don't need to give me notice to let me go, so I quit, I'm done\" and I left and threw myself into studies 100%, and landed a research assistant position that paid way more.",
   "created_utc": 1699224762,
   "score": 89,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zk5tl",
   "message": "ya, i was hired to work and had told them i was familiar with ‘quickbooks pro’, an accounting software, figuring i could figure it out and learn it on the fly; i liked the organization, so this was a way to get into it, but i could not learn quickbooks on the fly as it turned out and so i went home in a snowstorm and never returned.",
   "created_utc": 1699221642,
   "score": 145,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k7zsg46",
   "message": "I was hired as a service writer at Sears almost fifteen years ago. For training they stick you in this windowless room with computers lining the walls and force you to work on modules for 8 hours a day for a full week. By day three I couldn’t even muster up the mental fortitude to log in to my computer. \nSo it was just me in this horrible room under fluorescent lighting playing chess on my phone for a couple hours. \nI couldn’t take it. \nI wrote on a post it note that I didn’t think this was the right fit for me and stuck it on HR’s door and walked out. On my way downstairs this dude was on his way to get me for some on the floor training but I had already committed to leaving. I was like “I’m sorry man I just can’t do this,” he was floored, had no idea what to say as I walked past him. I got to my car and just broke down crying. I was in a bad place back then.",
   "created_utc": 1699224788,
   "score": 51,
   "submission_id": "17omtfl"
  },
  {
   "comment_id": "k825wtt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17omtfl"
  }
 ]
}