{
 "submission_id": "17oroom",
 "title": "People who are 40+, what do you regret not doing when you were younger?",
 "selftext": "",
 "created_utc": 1699234970,
 "permalink": "/r/AskReddit/comments/17oroom/people_who_are_40_what_do_you_regret_not_doing/",
 "score": 105,
 "url": "https://www.reddit.com/r/AskReddit/comments/17oroom/people_who_are_40_what_do_you_regret_not_doing/",
 "comments": [
  {
   "comment_id": "k80xnb3",
   "message": "Getting over exes/staying in stupid relationships. In retrospect so many people to meet;spending time unhappy or sad over break ups, what a waste of time that you don’t get back.",
   "created_utc": 1699241954,
   "score": 139,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80ii7n",
   "message": "Making more friends and staying in touch with old friends. It gets so much harder as you get older.",
   "created_utc": 1699235222,
   "score": 209,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80sw00",
   "message": "Making a plan for a life past 30. \n\nI lived life to the extreme with the motto of \"live fast, die young, and leave a good looking corpse.\".",
   "created_utc": 1699239731,
   "score": 133,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80mpyx",
   "message": "Save your money! Stuff those 401k’s, IRA’s, HSA’s and 529’s!",
   "created_utc": 1699237039,
   "score": 211,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80ibmt",
   "message": "Taking better care of teeth",
   "created_utc": 1699235144,
   "score": 44,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80n4pl",
   "message": "Not travelling more when they were younger. Discovering other cultures, making new friends, and gaining fresh insights can all be accomplished through travelling.",
   "created_utc": 1699237214,
   "score": 198,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80tjp7",
   "message": "Older people who smoked, didn’t exercise or became obese were regretful about it, but the issue wasn’t only about dying.\n\n\n“Many people will say to themselves, ‘I enjoy smoking’ or ‘I don’t like to exercise’ or ‘I just like to eat — who cares if I die a little sooner?’” Pillemer noted.\n\n\n“The problem is in this day and age is you’re not going to die sooner; you’re going to be stuck with 10 or 20 years of chronic disease as modern medicine keeps you alive.”",
   "created_utc": 1699240033,
   "score": 0,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k818cf0",
   "message": "Nothing. I regret nothing. I’m at or even better than I wanted to be at this age. I live and love life every day.",
   "created_utc": 1699247758,
   "score": 65,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80tgn1",
   "message": "When your traveling days are done, you’ll still wish you had taken just one more trip, Pillemer said. Even people who had done a lot of globetrotting would finish their interview with him by leaning forward and wistfully saying something like, “But I never got to Japan.”\n\nPeople often put big trips off until retirement only to find their health failing when they’re ready to go.",
   "created_utc": 1699239995,
   "score": 168,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80vzad",
   "message": "I regret not getting away from toxic family faster, getting their tentacles of negative/unhelpful thought out of my head. Just working more, saving more, so I'd have more security now.",
   "created_utc": 1699241159,
   "score": 148,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80igm7",
   "message": "Traveling more.",
   "created_utc": 1699235203,
   "score": 226,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80mors",
   "message": "Dating I wasted my youth working I didn’t start dating till I was well in my 30s when I finally started dating so far no luck but I’m not giving up I’m sure I’ll find someone some day",
   "created_utc": 1699237025,
   "score": 143,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80nvm3",
   "message": "Finding a way to stick some money away into a 401k or other investment on the regular as a priority.",
   "created_utc": 1699237527,
   "score": 49,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80yqtu",
   "message": "Traveling in your 20s is different than your 40s I wish I would have had an epic road trip or backpacking adventure with friends",
   "created_utc": 1699242489,
   "score": 72,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80w4kp",
   "message": "Writing. And learning other languages. Also I should have broken up with a-holes more.",
   "created_utc": 1699241229,
   "score": 64,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k814s4n",
   "message": "Telling more people to fuck off instead of putting up with their BS.",
   "created_utc": 1699245628,
   "score": 66,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80kayv",
   "message": "Stretching. Wake up every day with back pain due to tight hamstrings, hip flexors, and shoulders.",
   "created_utc": 1699235995,
   "score": 137,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80jq41",
   "message": "I regret not staying sober more. Partying is great but everything in moderation… I regret not trying to get into my career field earlier. I regret not doing what I wanted bc I cared what insignificant people thought of me. I also regret not using sunblock more. Most of all though, I regret not listening to people with more experience than me. I am 48. I have a good life, but I could have a better/more financially secure life. Also, what someone else said about caring for your teeth. One thing I don’t regret is my choice to not have kids. Most folks go through a “will I regret it if I don’t?” phase…but you won’t. I’m very happy I did not have kids seeing where all my friends are now.",
   "created_utc": 1699235748,
   "score": 171,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80ijd5",
   "message": "investing In real estate",
   "created_utc": 1699235236,
   "score": 76,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80lk5v",
   "message": "Getting a useful degree",
   "created_utc": 1699236536,
   "score": 52,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80k17x",
   "message": "Telling her how I felt.",
   "created_utc": 1699235879,
   "score": 94,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80wwde",
   "message": "I wish I had understood that it was OK to experiment sexually. I thought I had to be sure, about my orientation, about the individual. I didn't know that I could just ... try.",
   "created_utc": 1699241595,
   "score": 91,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80rshr",
   "message": "Absolutely nothing.",
   "created_utc": 1699239240,
   "score": 26,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80sykf",
   "message": "Travelling and seeing the world.  Moving to and living in a different city than the one where I have now lived my whole life.",
   "created_utc": 1699239764,
   "score": 22,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80w0h2",
   "message": "I regret caring so much about how I looked and not enough about getting to know more about other people.",
   "created_utc": 1699241175,
   "score": 19,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80ibu0",
   "message": "I'm 40. Dating and having sex.",
   "created_utc": 1699235146,
   "score": 68,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80j63o",
   "message": "Not having more sex",
   "created_utc": 1699235512,
   "score": 54,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80pwdf",
   "message": "Is 40 considered older? Oh ya, forgot you kids think anyone above 24 is old and dying.",
   "created_utc": 1699238407,
   "score": 51,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80otjc",
   "message": "Going to bed at a decent hour and starting my day before 6am, doesn’t matter what I’m doing whether it’s working out, stretching, meditating, or reading or whatever (not phone time).  Starting a morning routine has helped me in so many ways accomplish more in my days. Especially mornings",
   "created_utc": 1699237934,
   "score": 79,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k8128ko",
   "message": "There's a definite pattern in the comments it seems most of the 40+ all made the same mistakes and have a lot of the same regrets, Hard to read it's like having someone shove a mirror in your face every comment. \n\nBut bright side guys we lived there's a lot of our generation that didn't.",
   "created_utc": 1699244249,
   "score": 17,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80j98x",
   "message": "Learning to invest.\n\nBeing more adventurous with my style.",
   "created_utc": 1699235550,
   "score": 34,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80o5xi",
   "message": "I wish I’d stopped drinking alcohol way sooner.",
   "created_utc": 1699237649,
   "score": 59,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k811yix",
   "message": "Not wearing sunscreen on a daily basis.",
   "created_utc": 1699244104,
   "score": 16,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80ra19",
   "message": "Staying in the military. I’d be retired by now with a nice pension…",
   "created_utc": 1699239018,
   "score": 15,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k810qa6",
   "message": "My father died when I was 22. I had been accepted to a couple of prestigious grad schools. I was taking the year off to work and save up money. \n\nHe was an improvident man, an architect who spent every dime he made on clothes and dining out, but couldn't be bothered to save a dime or get a life insurance policy. \n\nMy mother would have been in the poorhouse if her mother hadn't died six months later. Meanwhile, I was the only one of their four children who was still in town. So I felt obligated to stay and support her. \n\nI gave up grad school and had to create an entirely new plan in life. It worked out, but I'll always wonder what my life would have been like had I stuck with my original plan.",
   "created_utc": 1699243477,
   "score": 16,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80y8ff",
   "message": "I regret waiting so long to adopt a puppy. I never had a dog growing up, she's been with us for a year and she is my pride and joy! 🐶 (I'm 47)",
   "created_utc": 1699242241,
   "score": 28,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80mc95",
   "message": "Being chill and drinking more with friends instead of being so deeply religious",
   "created_utc": 1699236878,
   "score": 53,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80u6f7",
   "message": "Travel abroad.  I’m almost 60, my husband is not well enough to travel now so my only trips are solo or with my grown children.",
   "created_utc": 1699240321,
   "score": 13,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k8139n7",
   "message": "Not believing in myself:\n\nPhD in philosophy  \nProfessional work in ballet.  \nI had trained seriously for both.  \nDid not think I was \"good enough.\"  That is a fucking toxic phrase almost all of us use in talking to ourselves.",
   "created_utc": 1699244793,
   "score": 14,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80sn4v",
   "message": "Having a kid, prob not gonna be a popular answer but had one when I was 39, almost 40. Will prob have 2nd when I’m 42. The idea that when they’re an adult I’ll be 60 and not get to see a lot of their adulthood is a huge bummer. I wish I had one mid 30’s at latest, life moves so fast",
   "created_utc": 1699239618,
   "score": 53,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k811v2l",
   "message": "Not trying to talk to other girls after basically getting rejected by the one girl I fell hard for. I spent all that time thinking about her, even though she didn't give two shits about me. Because of that, I never even knew how to talk to other girls. Now, as an old fart, I have no clue how to interact with women (or anyone for that matter), beyond the formal, \"Hi. How are you?\" So, I'm most likely gonna die alone.",
   "created_utc": 1699244054,
   "score": 10,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81994u",
   "message": "I should’ve fucked more.",
   "created_utc": 1699248334,
   "score": 11,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81d2r1",
   "message": "Being single longer. It would have been nice to live life on my own terms for a while.",
   "created_utc": 1699250908,
   "score": 11,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80j9ol",
   "message": "Getting my ADHD diagnosed.",
   "created_utc": 1699235555,
   "score": 35,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k818l65",
   "message": "Saying no in relationships.  Do I want to have brunch w your mom and sister while my friends have sunday funday in the park...? Do I want to see a coffee house back yard shakespeare production in february...?  I always said yes to be nice but hated every minute.  In the end, yes, I was with the wrong person and I'm not saying don't be supportive when called for BUT things like that subconsciously build resentment.  Trust yourself.  Or in my case, realize this isn't the right person, and when then right one came along, holy hell it's soooo nice to be on the same page almost all the time.",
   "created_utc": 1699247910,
   "score": 10,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81c95d",
   "message": "I should have had a lot more sex.",
   "created_utc": 1699250330,
   "score": 10,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80lm3m",
   "message": "Never taking NSAIDs (Aspirin, Advil) with food. I didn’t ever abuse them or even take them more than a few times a month, but give it 30 years and that’ll create an ulcer!",
   "created_utc": 1699236559,
   "score": 27,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80hzle",
   "message": "Nailing every hot chick I had a chance with.",
   "created_utc": 1699235007,
   "score": 86,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80wpg3",
   "message": "Investing. I’m 41. Had I started investing at 18 like my first supervisor suggested, I’d be nearing retirement at this point.",
   "created_utc": 1699241505,
   "score": 20,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k8153xf",
   "message": "Getting to know myself better. Respecting myself. I spent way too much time seeking validation in other peoples eyes. I didn’t understand that you should always you bite through your own lens and no one else’s. It is literally the only way to be happy.",
   "created_utc": 1699245814,
   "score": 8,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k816lt8",
   "message": "I should have went harder at everything, school, work, parties, gym.  I definitely left gains on the table which you simply can't build at 50.  \n\nWhen you are 20 you think you have a lot of time to get your shit together.  You dont, especially once you start your family...",
   "created_utc": 1699246691,
   "score": 9,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80r40q",
   "message": "Hmmmm....I think just caring too much about too many things and dividing my attention and cares too far.\n\nCare about some things a lot and honestly, relax about a lot of other things.",
   "created_utc": 1699238944,
   "score": 10,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80vcpi",
   "message": "I wish I didn’t work so much and spent more time doing things with my kids when they were little. I was so busy trying to make money that I missed out on a lot of milestones. They’re grown up now and I can’t go back and get those years with them. We are very close and I spend as much time as I can with them now since I’m retired, but it’s not the same. It’s like that song “Cats In The Cradle.”",
   "created_utc": 1699240867,
   "score": 8,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k815pts",
   "message": "Buying a house before prices skyrocketed",
   "created_utc": 1699246166,
   "score": 9,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81bgi9",
   "message": "I regret worrying so much about how my body looked.",
   "created_utc": 1699249784,
   "score": 9,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80ubo4",
   "message": "Hot single milfs in my area",
   "created_utc": 1699240390,
   "score": 16,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k818hr0",
   "message": "Let me check this thread while im in my twenties lol",
   "created_utc": 1699247852,
   "score": 14,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80nuf5",
   "message": "Being more social",
   "created_utc": 1699237514,
   "score": 7,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k811ck9",
   "message": "Spending a few more days trying to figure out how to mine bitcoin in 2009.",
   "created_utc": 1699243791,
   "score": 6,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k818i2x",
   "message": "I have zero regrets.  Hindsight is always 20/20.  I know that I have always done my best, and made the best choices and decisions, given the circumstances at the time, what I knew at the time, and how much time I had to react or decide.",
   "created_utc": 1699247858,
   "score": 7,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k8136c5",
   "message": "Played more sports at a higher level.  Knees don't like it anymore.  I'm still active, but would love to still be able to play somewhat competitively.\n\nI worked too much in my 20s and 30s and now that I have more time, the body just can't do it.",
   "created_utc": 1699244744,
   "score": 7,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k818na0",
   "message": "Two dudes at the same time.\n\nSunscreen",
   "created_utc": 1699247947,
   "score": 6,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k819qs8",
   "message": "Sleeping with more people tbh. Having more relationships",
   "created_utc": 1699248652,
   "score": 5,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81aqft",
   "message": "I really regret not trying harder to model when I was 17. I really think I could have been very successful but I was very rebellious and wanted to be a freak. That got me far 😒",
   "created_utc": 1699249298,
   "score": 5,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81cedh",
   "message": "I wish I had started my own business. Working hard just to get by vs. working hard to invest in my own future.  I went back to school during the pandemic and will be opening my own business next year.  Better late than never",
   "created_utc": 1699250432,
   "score": 5,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80jixy",
   "message": "I turned down a lot of girls 😐🔫",
   "created_utc": 1699235664,
   "score": 14,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80vhkm",
   "message": "Not shaving my head into a Mohawk when I still had a full head of hair.",
   "created_utc": 1699240932,
   "score": 11,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80oyr2",
   "message": "Not moving away from my home state like I wanted to.\n\nNot getting a nose job.",
   "created_utc": 1699237999,
   "score": 7,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80p9eu",
   "message": "Saving/investing more and just getting my shit together, in general.",
   "created_utc": 1699238129,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80usmx",
   "message": "Going to a trade school instead of college.",
   "created_utc": 1699240607,
   "score": 5,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k810pf7",
   "message": "Seeing more live music.  I turned down many opportunities to go to concerts and festivals back in the 70s and really wish I had gone.  I even decided not to go to Woodstock with the rest of my hippie house.  Crazy.",
   "created_utc": 1699243465,
   "score": 5,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k810r9r",
   "message": "Traveling the world before my right knee gave me problems.",
   "created_utc": 1699243491,
   "score": 5,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k818gc7",
   "message": "Expressing how I felt openly. Letting people make their own decisions with the knowledge rather than being so afraid to lose them I'd try to manage the situation and make it worse.",
   "created_utc": 1699247826,
   "score": 6,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80tkkp",
   "message": "Take adventures in your 20s. Borrow the money, take what’s offered, pitch parents and family on the adventures you want to take. You’d be surprised who will support your adventures. Your 20s are the magical years where you’re typically broke, but also the most free of responsibility you’ll ever be. Most of your peers are in the same boat. Take advantage of this time by doing as much as you can. \n\n*I know that this is not true for everyone. Many people are saddled with responsibility from an early age. If you’re one of the lucky ones that don’t have to deal with this - embrace these years. Everyone is about to get attached to something (job, mortgage, spouse, kids, car payments…). Your 20s are the last time you have all of the perks of adulthood with the least amount of the responsibilities.",
   "created_utc": 1699240044,
   "score": 11,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80psfl",
   "message": "I use to think it was not getting married but I got married later on \u0026amp; I love it.",
   "created_utc": 1699238359,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80r6v8",
   "message": "Traveling. Triple demerits for not doing so , sooo much earlier with my Dad. He retired over 3 \u0026amp; a half decades ago \u0026amp; was still quite fit. I pissed away all that time \u0026amp; opportunities to go on trips with him, while he was still somewhat able bodied. Waited 'til 2016 before we did a vaycay together \u0026amp; this was way too late, due to how astoundingly quickly his mobility deteriorated. We've done 5 vacations together since our first but they've all been( with one exception) me being like his PSW.",
   "created_utc": 1699238979,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80uo7g",
   "message": "I’ve not had the easiest life , but I can’t say I have regrets , I don’t look back . I move forward and I learn a lot through the hard times …. Life isn’t easy .. forward March",
   "created_utc": 1699240550,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80z842",
   "message": "Drinking and doing drugs.",
   "created_utc": 1699242723,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80z8hc",
   "message": "I am a white middle class female and I was SHOVED into college and the business world in some 80s feminism wave of female empowerment, and we had no internet and I had really no idea what else was available to me and trades were really frowned upon as \"poor people school\" and so I never even really knew I could go to cooking school and a chef. It seemed 100% unattainable to me at the time and I just went with what my parents and teachers wanted out of me and failed miserably.",
   "created_utc": 1699242728,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80zp0w",
   "message": "Travel. And I already traveled more then some people. The older I get the harder it is to travel as easily. (Family, career, responsibilities). \n\nHonestly, knowing what I know now, I would have loved to spend a couple years abroad in a different country learning their culture.",
   "created_utc": 1699242955,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k8139c9",
   "message": "Saving for retirement.",
   "created_utc": 1699244788,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k814nt4",
   "message": "Saving money",
   "created_utc": 1699245562,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k815mmf",
   "message": "Living single in a big city.  Recently had a business trip in Manhatten (park and 9th).   The excitement of the city was amazing.  If I were 25 and single, I would have loved it.  But at 45 with 3 kids and a wife...it would get old fast.",
   "created_utc": 1699246115,
   "score": 5,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80ozls",
   "message": "Not figuring out I was super gay until my late 20’s. A wasted decade. Although that bi time was fun. I never got more girls until I told them I was gay. And then they all wanted what they couldn’t have so I did indulge a little. \n\nBut I just like dudes better.  \n\nI did make up for lost time, and it’s still a fun ride.",
   "created_utc": 1699238010,
   "score": 10,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80zg5h",
   "message": "Moving away from the Midwest.",
   "created_utc": 1699242833,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k811nhd",
   "message": "Taken better care of my health, invested in stocks much sooner, maxed out my 401K savings much sooner and took better care of my mental health.",
   "created_utc": 1699243945,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k813wvj",
   "message": "I thought college was really hard and I was trying my best.  Turns out life is really hard and I wasn’t trying a fraction as hard as I have the capability to.  \n\nI wish I could go back and put in an effort that 40 year old me would be happy with.",
   "created_utc": 1699245145,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k8141x5",
   "message": "Lots of stuff. I regret not learning Spanish, but I believe I'm just not capable of speaking two languages, I've tried since middle school and high school to learn through friends and on line and I just can't get the hang of it. \n\nI also regret not furthering my education after high school. Im glad I don't have massive loans, and I worry that I wouldn't be doing much better pay wise any way, but I wish I had learned a skill or a trade of some kind.",
   "created_utc": 1699245223,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k816z2w",
   "message": "Hmmm, actually do a better job at dating. I’m 44 and wish I had been married or had kids at some point. Now I don’t feel motivated.",
   "created_utc": 1699246915,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k817h4p",
   "message": "Absolutely nothing. I trust younger me to have made the choice they made.",
   "created_utc": 1699247218,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k8180hi",
   "message": "Doing a cool photo shoot because I would have been topless… now the photographer is famous. \n\nKept up with my drawing \u0026amp; piano classes",
   "created_utc": 1699247550,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81aatg",
   "message": "My forties have been better than my pretty awesome thirties and the thirties were better than my difficult twenties and my twenties were so much better than my terrible teens. Obviously I wish I made better decisions but think I was did the best with what I got.",
   "created_utc": 1699249015,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81avdq",
   "message": "Starting skincare in my 20s.",
   "created_utc": 1699249390,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81beu7",
   "message": "Buying property as soon as I could instead of my late thirties.",
   "created_utc": 1699249752,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81bo4i",
   "message": "Missing friends weddings. If you don’t have a really really good reason for not going, it’s a fast way to lose those friend forever.\n\nI regret not going to therapy or counselling for alcoholism and SA sooner. \n\nI regret not keeping up with doctor appointments. (Also, get your PAP smears people. Use protection. Get vaccinated. Cervical cancer is no joke.)\n\nI regret not taking enough photos of friends and events, also my own idiot fashion choices. This is a reminder to print your photos, if they’re all on your phone. \n\nNot getting diagnosed for adhd sooner. \n\nI shoulda bought that damn house in 2006 when I had the chance. \n\nI regret not taking myself seriously. I regret not taking job opportunities that were offered to me - because I felt I wasn’t smart or responsible enough for those roles. I was and I am, damnit.\n\nI regret not spending more time with my grandma before she died. \n\nI regret not walking away from that awful and toxic friend group. There are so many people in this world who aren’t assholes, there’s NO NEED to hang out with soul suckers. Dump them and make room in your life for people who fill your cup, not drain it.",
   "created_utc": 1699249928,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81c2wu",
   "message": "\\- Saved more retirement $\n\n\\- Traveled w/wife before having kids instead of figuring we'd do it after they were all grown and out of the nest\n\n\\- Cut back on my drinking",
   "created_utc": 1699250208,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81olcz",
   "message": "Losing weight! The world is nicer when you are not obese.",
   "created_utc": 1699259942,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k81xu97",
   "message": "NGL, maybe a dick thing to say but I am feeling pretty good about my life right now.",
   "created_utc": 1699267677,
   "score": 3,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k80uxme",
   "message": "I have more regrets regarding what I did.",
   "created_utc": 1699240672,
   "score": 4,
   "submission_id": "17oroom"
  },
  {
   "comment_id": "k816v9e",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17oroom"
  }
 ]
}