{
 "submission_id": "17os3vm",
 "title": "Those who have been shot with a firearm: what did it feel like?",
 "selftext": "",
 "created_utc": 1699236278,
 "permalink": "/r/AskReddit/comments/17os3vm/those_who_have_been_shot_with_a_firearm_what_did/",
 "score": 166,
 "url": "https://www.reddit.com/r/AskReddit/comments/17os3vm/those_who_have_been_shot_with_a_firearm_what_did/",
 "comments": [
  {
   "comment_id": "k81ctuv",
   "message": "memories a bit blurry cause i was like 12. moms-friends-kid stole his dads gun and was messing around w it and shot me in my right thigh on accident. it felt like a crazy wasp sting and i probably would've assumed it was had i not immediately felt my whole thigh get warm from the blood + felt like my leg get shoved (and obviously looked down and realize i'd been shot LOL). once the adrenaline wore off a bit most of my leg felt like it was on fire, and i felt feverish in general. this could just be because i don't remember it very well, but it honestly wasn't as bad as it looked. still was absolutely horrible obviously, but it mainly just felt very very hot, kind of itchy, and like i'd been hit w a baseball bat or something.",
   "created_utc": 1699250734,
   "score": 85,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k80urp1",
   "message": "My mom said it felt like having a piece of fire in her arm",
   "created_utc": 1699240595,
   "score": 146,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81fd4a",
   "message": "I was shot in the chest and elbow by a home intruder. Elbow hurt infinitely worse than my chest from what I remember. Adrenaline rush was very short lived, probably less thab 30 seconds(at which point I realized I had been shot). I don't remember much as I went into shock moments after.",
   "created_utc": 1699252554,
   "score": 140,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k80p4w3",
   "message": "Not me, but my dad was shot in the shoulder with a 22 round as a boy. He said that at first he thought he had been stung by a wasp. It was the blood that persuaded him otherwise.",
   "created_utc": 1699238075,
   "score": 157,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81e9lb",
   "message": "My dad took a 7.62 through his arm. I don’t recall how he described how the bullet itself felt, no doubt he was full of adrenaline. It sort of knocks the wind out of you. He mentioned feeling very tired, and then they gave him morphine it made him very happy and then very tired again.",
   "created_utc": 1699251752,
   "score": 70,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k814qd8",
   "message": "My dad accidentally shot himself in the hand with a pistol when I was a kid (he was obsessed with guns). He didn’t really react too much to my shock. Took it like a champ. The funny story is that my mom was on the phone with his sister, my aunt, and after it happen just calmly and nonchalantly told me aunt, “I have to go, Mark shot himself in the hand”. \n\nThen like 8 years later he shot himself in the head with the same pistol so he could avoid prison. Not sure how the asshole felt about that one and I could never ask him.\n\nEdit: Glad yall enjoyed my summary lol. I’m doing okay today though considering. Just got some anxiety and depression (along with all 5 of my siblings lol) but I’m still chugging along life. This was back in 2001-2002 when he died. I was 11 or 12 or something. Went to foster care for awhile but got out and returned back to mom after he died. Mom has now passed on as well (cancer) so I do really miss her but not him. Won’t get into details but dad was a child molester and this is why he did what he did. All in all, I don’t miss him at all. He was a terrible man, a terrible husband and terrible father.  His actions led to all 6 of us (including my mom) to struggle immensely with anxiety and depression. All from one man. But If he were still in my life, I would not have had the recovery that I have today. It would be much worse.\n\nThis is just a reminder to keep fighting the fight to not be a victim no matter what. You can overcome injustices and even if it’s a constant struggle, you should keep at it at all costs. :)",
   "created_utc": 1699245601,
   "score": 124,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k80ok9e",
   "message": "Assuming this is a serious question……it doesn’t hurt as much as you think (right away, anyway) but it burned like hell.  The adrenaline and shock tend to kick in right away.  And for me, I was wondering if I was gonna die….not in a hysterical way but more in disbelief that I was short (twice in my case).",
   "created_utc": 1699237822,
   "score": 229,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k80w3v9",
   "message": "Was shot in the arm when I was in 6th grade, felt like the most pissed off wasp in history got a hold of me",
   "created_utc": 1699241220,
   "score": 6,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k814bkl",
   "message": "Not me, my Dad.  Hit in the left ass cheek by a 12.7mm round, which exited a few inches above his left knee.  He did describe it, said it felt like a sledge hammer slammed him out of his seat (OH-6 helicopter).  He barely managed to land (well, technically crash), that landing injured him additionally, which he said hurt worse than the bullet wound.",
   "created_utc": 1699245373,
   "score": 158,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k819q52",
   "message": "I was accidentally shot with a 9mm inthe leg. Felt like taking a muay thai kick. Didn't register what had happened until I heard my friend screaming apologies.",
   "created_utc": 1699248641,
   "score": 98,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81jrtq",
   "message": "Not me, but my best friend at the time.\nHe was driving home in a somewhat rough area one night and heard something smack his windshield and saw a small smash pettern or hole in the upper-right corner Thought he'd picked up a rock or something and continued onto the freeway. Was driving for a bit when he started drifting off to sleep. Pulled into a gas station and passed out. Turns out, he'd been shot in the upper/inner left thigh (just missing his junk) and was bleeding. But he had no idea. Nothing. Didn't feel a thing. Woke up in the hospital. Doctors left the bullet in his leg because they felt it was too risky to remove or something like that.",
   "created_utc": 1699255956,
   "score": 71,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k80p7tu",
   "message": "Caught a ricochet to the leg 5 years ago honestly I was surprised by how much it burned more so than any actual pain tho I think my experience doesn’t necessarily count as mine was a ricochet after hitting a steel target",
   "created_utc": 1699238110,
   "score": 204,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k819d23",
   "message": "Slightly off topic but someone surprised me and discharged a .380 3 feet away from my head yesterday while I wasn't wearing ear protection and my hearing is affected.  \n\nMy head was ringing and I was virtually deaf for an hour, and am still having problems 36 hours later.  Not only is my hearing diminished, but what I can hear sounds different. \n\nDon't let this happen to you.",
   "created_utc": 1699248404,
   "score": 27,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81pcgh",
   "message": "In October of 1990, while I was working as an armed security guard in California, I got into a physical altercation with a trespassing suspect while assisting another guard. In the course of the struggle, he managed to get my revolver out of the holster (it was a break front) and shoot me with it four times-- once in the left leg shattering the femur, once in the right upper thigh, once in the right hip and once in the lower left abdomen at muzzle contact which was stopped by body armor. The other two rounds went wild. The suspect fled on foot and was apprehended by the local police. I was transported by ambulance to the hospital. The only shots I actually felt were the first and the last. The first one felt like being hit across the thigh with a baseball bat, and the one that hit my vest felt like I'd been punched really hard, however, I didn't feel a burning sensation as others have reported just extreme pain in my left leg.\n\nI found out later that the reason he fought so hard was that he was on parole and didn't want to go back to prison. He ended going to prison anyway. Six years for the parole violation, five years for grand theft for taking my gun, five years for each shot he fired and five years for possession of a firearm by a felon. All together, he was sentenced to 46 years in prison with no eligibility of parole as he had demonstrated that he couldn't handle parole.",
   "created_utc": 1699260593,
   "score": 48,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81gy7d",
   "message": "I got shot in the head, but I don't remember it at all. I suspect that's a good thing.",
   "created_utc": 1699253730,
   "score": 77,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k817r3b",
   "message": "I got shot in the buttocks. Felt like something jumped up and bit me. Bit me right in the buttocks. They said it was a million dollar wound, but the army must keep that money 'cause I still haven't seen a nickel of that million dollars.",
   "created_utc": 1699247388,
   "score": 14,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81hlx4",
   "message": "I took a 5.56 ricochet to chin, the jacket an fragments traveled up the left side of my cheek. I knew something happened, but I didn’t know what, it was everyone else’s reaction that made me realize I got hit. I don’t remember a lot of pain, I remember it sucking like hell having it some of the larger pieces pulled out from under my skin but it happened so fast, it wasn’t like i felt much other than a slap and than soreness. \n\nSeparate occasion, I took frag to the eye ball. Again, happened quickly, wasn’t terrible…at first…a day or two later it was the most unbearable unrelenting pain I’ve ever felt. It was inescapable headache. The frag had started to rust and infection had set in, this caused my eye to swell and the pressure made me want to dirt nap myself. When I got to a clinic to get checked out, they basically used a Dremel to drill out all the frag and than gave me a bunch of topical medicine. Yes, I watched a drill bit approach my eyeball and touch it like 8 times - absolutely nightmare fuel. Got lasik to fix some problems from that years later and scoffed when the said a blade was going to cut my flap on the lens.",
   "created_utc": 1699254236,
   "score": 93,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81js84",
   "message": "I’m an L\u0026amp;D nurse and I had a patient once who had been shot previously. She was trying to go natural and was really struggling with the contraction pain. After she opted for the epidural I asked her which hurt worse, being shot or the labor. She didn’t even have to think about it. The labor was worse. \nSo, it’s not as bad as labor pain apparently.",
   "created_utc": 1699255964,
   "score": 63,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81b914",
   "message": "This is going to sound strangely specific but when you were in school, did you ever go running down the hallway, collide with someone, and get stabbed by something they had sticking out of their backpack?  Like the edge of a ruler or a compass or something?  Because I was shot in a drive by and first thought that's what happened to me. That someone bumped into me and had something sharp in their pocket.",
   "created_utc": 1699249642,
   "score": 58,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81lvig",
   "message": "Even with a vest on, taking a .762 round center mass feels like an 18 wheel truck shrunk itself, put a cow catcher on, and had the Flash launch it from the pitcher's mound 90 feet away.",
   "created_utc": 1699257670,
   "score": 61,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k819tx7",
   "message": "I've never felt the impact, only the burn. Even that only after I or the guy next to me realized I was bleeding. In one case, my body started to just give out due to blood loss. Can't say I've ever felt pain from the shot itself.\n\nSimunition and rubber bullets hurt more, at least initially.",
   "created_utc": 1699248710,
   "score": 81,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k80vlu5",
   "message": "My brother shot me in the leg with a bow \u0026amp; arrow. It sucked ass",
   "created_utc": 1699240988,
   "score": 189,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81bh8h",
   "message": "Shot myself in the foot when i was 14 with a 12 gauge while hunting (safety was faulty and i was an idiot). It felt like tv static at first (5ish minutes). Sorry, that's the best way i can describe it. After the static feeling went away, it was painless for the first 30ish minutes like nothing had happened, but after that, it was an intense throbbing with a slight burning sensation. It didn't hurt as much  as you would expect. Though the freezing needles between the toes were WAY worse than the actual gunshot. 0/10 would not recommend.",
   "created_utc": 1699249798,
   "score": 48,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81jx9c",
   "message": "Got shot with a 22 at 16 from about 8 feet away. Went clear through my elbow and out the other side. Felt like I hit my funny bone really hard for a few seconds then went to just a really mild tingle as it proceeded leak blood all over the floor.",
   "created_utc": 1699256082,
   "score": 19,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81pq2e",
   "message": "The closest thing I've got is I met a guy in county jail about 20 years ago that had been shot in the head at close range with a pistol. He had a pretty good sized portion of his head missing. During a game of spades the subject of guns came up \u0026amp; he said \"I don't like guns because they'll do shit like to you\" \u0026amp; pointed at his head. One of the other guys asked him wtf happened \u0026amp; he said he was driving a taxi in Charlotte in the 90's \u0026amp; a dude randomly shot him shortly after getting in the car. \n\nHe said all he could remember was \"overwhelming pressure on the back of his skull\" then he woke up 25 days later in the ICU. He did say once his memory started coming back that it felt like what he imagined a sledgehammer would feel like.",
   "created_utc": 1699260912,
   "score": 17,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81t4u7",
   "message": "This is what George Orwell had to say about it:\n\nOrwell expected to remain at the front until late summer. But around dawn on May 20, 1937, he was moving through the trenches, checking on the sentries, when he was hit. He knew it was a dangerous time because his trench, facing west, had the rising sun behind it, which silhouetted his tall frame for enemy snipers. Of being shot, he would write, “Roughly speaking it was the sensation of being at the centre of an explosion. There seemed to be a loud bang and a blinding flash of light all round me, and I felt a tremendous shock — no pain, only a violent shock, such as you get from an electric terminal; with it a sense of utter weakness, a feeling of being stricken and shriveled up to nothing. The sand-bags in front of me receded into immense distance.” The bullet’s impact knocked him to the ground. “All of this happened in a space of time much less than a second. … I had a numb, dazed feeling, a consciousness of being very badly hurt, but no pain in the ordinary sense.”\n\nThe American sentry with whom he had been speaking started toward him. “Gosh! Are you hit?” The American, named Harry Milton, recalled, “I thought he wouldn’t make it. He had bitten down hard on his lip, and I thought there must be a lot of damage. But he was breathing, and his eyes were moving.”\n\nOrwell provides one of the best accounts ever written of what it is like to be badly wounded by a bullet and expecting to die soon. He knew he had been shot, but could not tell where. When informed that it was a neck shot, “I took it for granted that I was done for. I had never heard of a man or animal getting a bullet through the middle of the neck and surviving it.” Blood dribbled from a corner of his mouth. He assumed that a carotid artery had been severed, which would mean that he had only a few minutes to live. “My first thought, conventionally enough, was for my wife. My second was a violent resentment at having to leave this world which, when all is said and done, suits me so well.”",
   "created_utc": 1699263831,
   "score": 13,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k811evy",
   "message": "I didn't realize at first, when my friends pointed the blood in my shirt I was in awe. \n\nThe recovery is the worst.",
   "created_utc": 1699243824,
   "score": 47,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81jk4h",
   "message": "\"It felt like I was shot\" -someone who was shot",
   "created_utc": 1699255782,
   "score": 11,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81hp8i",
   "message": "My dad was shot in the shoulder and in the head with a 9mm. Interestingly, he was recently stung by a stingray in the foot, which he said hurt way more",
   "created_utc": 1699254307,
   "score": 22,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81kjrj",
   "message": "How are there so many people who’ve been shot here? I just came to say it feels like severe rug burn to get grazed by a .22, but I’m staying to say I’d feel better about life if there were fewer of us.",
   "created_utc": 1699256588,
   "score": 20,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81fd11",
   "message": "ITT: everybody’s dad has been shot",
   "created_utc": 1699252552,
   "score": 29,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81iant",
   "message": "I shot myself by mistake once, with a .22LR though and it was a ricochet that went through my wallet first. By the time it hit me, it didn't have much energy left. It hurt but it wasn't anything crazy, I'd liken the feeling maybe to a really painful bee sting. I needed two stitches but it wasn't serious.",
   "created_utc": 1699254770,
   "score": 8,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81pu1t",
   "message": "My brother shot me through the left calf with a 22 when I was 14.\n\nYou know how in school you'd play the game where you cracked each other on the leg or arm with a ruler? It felt exactly like that. Just a sudden and sharp stinging pain that slowly dissipated.\n\nI was very fortunate the round entered at a sharp angle and pretty much traced the circumference of my calf between the skin and muscle, rather than punching straight into the muscle.",
   "created_utc": 1699261008,
   "score": 9,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k82251i",
   "message": "I caught shrapnel from a 50 cal in my gut, face, and mouth. The gut hurt a little bit at first, kinda felt like I had something sharp caught between my kit and skin. The one in my mouth took a piece of my tooth off which didn’t really “hurt” but my tooth was super sensitive after that, couldn’t even breathe through my mouth without aggravating it. And then the piece in my lip hurt pretty good at first but it didn’t really bleed much and healed quick. \n\nOverall, 0 stars would not recommend",
   "created_utc": 1699270741,
   "score": 7,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81jbtw",
   "message": "I took a 9mm ricochet to the face and it felt like getting punched and burned with a cigarette at the same time",
   "created_utc": 1699255590,
   "score": 7,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81up41",
   "message": "When it first happened I didn’t even realize it. I turned and went inside to find my husband calling emergency services. I asked him why because I was fine. He pointed to my bloody leg. As soon as I looked at it, I felt it. It felt like a very bad burn.",
   "created_utc": 1699265154,
   "score": 8,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81m1ab",
   "message": "Why tf is there so many 12yos stealing daddy guns",
   "created_utc": 1699257802,
   "score": 12,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81j7pw",
   "message": "Really nice. Would do it again.",
   "created_utc": 1699255498,
   "score": 10,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81sng0",
   "message": "I haven’t been shot. But I’ve been in cross fire. \n\nIt was terrifying. \n\nI was in between A and B.  While also lawfully carerrying. \n\nEverything was a threat but I didn’t want to pick a side is I realized there were two sides.  \n\nI got my Ass out of the situation.  As safely and properly as I could.  \n\nWhen I think back on it I’m glad my\nWife or daughter was not part of the situation. \n\nSituation was a “gang war” at a market.  I was there for tobacco.  Not a “player” in the situation.  I would have Been a player had my wife and kid been in the vehicle \n\n\nI don’t go to “market” with my family since that day.",
   "created_utc": 1699263423,
   "score": 4,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k80nnob",
   "message": "It felt like god kissed me with the second amendment, Hu-Rah!",
   "created_utc": 1699237435,
   "score": 79,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81au62",
   "message": "Not me but a kid I was standing next to at Boy Scout camp when it happened.\n\n“Felt like I got slapped in the forehead.”\n\nSo there you have it.",
   "created_utc": 1699249367,
   "score": 9,
   "submission_id": "17os3vm"
  },
  {
   "comment_id": "k81l8fg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17os3vm"
  }
 ]
}