{
 "submission_id": "17oznoi",
 "title": "What is the stupidest thing someone has told you with complete conviction?",
 "selftext": "",
 "created_utc": 1699265994,
 "permalink": "/r/AskReddit/comments/17oznoi/what_is_the_stupidest_thing_someone_has_told_you/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/17oznoi/what_is_the_stupidest_thing_someone_has_told_you/",
 "comments": [
  {
   "comment_id": "k823aeu",
   "message": "From a coworker: \"If you don't have a social security number then the government can't do anything to you\"\n\nI asked if that meant, if I didn't have an SSN then I could just go kill someone on the street and the government couldn't arrest me.\n\n\"Yep\", he said, \"if you don't have an SSN then they can't enforce any laws on you\"",
   "created_utc": 1699271480,
   "score": 117,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k81yeb8",
   "message": "She said\n\n\"If you are dream about falling and you hit the ground in your sleep you'll actually die. It's been proven.\"\n\nI said \"If you die in your sleep, how can anyone know what you were dreaming?\"\n\nRuined a favorite story of hers. Sorry.",
   "created_utc": 1699268096,
   "score": 214,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82cgys",
   "message": "That we set the clocks forwards and backwards so the birds don’t get confused with their migration patterns",
   "created_utc": 1699276575,
   "score": 25,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82f95m",
   "message": "\"Two people can breathe underwater forever if they have a hose. The first person breathes in while the second breathes out, then the first person breathes out and the second person breathes in etc.\"",
   "created_utc": 1699277915,
   "score": 16,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82cbxv",
   "message": "A guy I work with said that a football referee runs over the distance of a marathon during a game. I pointed out that a football game was only 90 minutes long and that the marathon record was just over two hours so that would be impossible. He said it was possible, because a football referee “changes direction a lot during a game, and it all adds up.”",
   "created_utc": 1699276505,
   "score": 169,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k829xp9",
   "message": "“Cars? They don’t have cars. They have donkeys or walk to their huts” 40’year old Black women talking to me about Africa.\n\nShe refused to believe me (who had been to Kenya) that there are cities and people have cars. \n\nEven after showing her pic and explaining Africa has normal stuff just like the west. She refused to believe it or the internet.",
   "created_utc": 1699275298,
   "score": 72,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82dkot",
   "message": "Pineapples aren't real.  They're entirely manmade and do not exist in nature.",
   "created_utc": 1699277106,
   "score": 69,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k81vx0k",
   "message": "That the speed of light wasn’t like an actual number, it was just a figure of speech",
   "created_utc": 1699266157,
   "score": 76,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82c9hz",
   "message": "At one of my first jobs as a graphic designer, a client called me into his office and pulled up a photo he took. He then asked me if I could turn it around. No, not rotate it, but turn the viewpoint around. He wanted to see what was behind the camera when he originally took the photo….\nGod, I have so many stories from that job.",
   "created_utc": 1699276471,
   "score": 137,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82i84v",
   "message": "My dad was experiencing end stage renal failure (was on dialysis at the time and has since had a transplant). My best friends boyfriend at the time looked at me dead in the eye and said he could reverse his condition with a vegan diet and that the only important organ in the body was the skin, so as long as you take good care of your skin, your other organs will function properly. Mind you, by the time my dad got on dialysis his kidneys were functioning at 11% and his SKIN WAS JUST FINE.",
   "created_utc": 1699279271,
   "score": 238,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82phx9",
   "message": "A girl I worked with was convinced that every single mythological creature was real. I’ll never forget one of her claims.\n\n“Think about it, every movie you done seen all those creatures and aliens and shit, all that’s real. Someone has to have actually seen it to come up with that!” \n\nApparently there’s no such thing as the human imagination to her. So yes, transformers are real, Godzilla is real, Independence Day is real. This was a 20 year old that said all of this.",
   "created_utc": 1699282326,
   "score": 241,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82frwo",
   "message": "Sunburn is not caused by the sun, it is actually caused by sunblock. If you don't use sunblock then you will never be burned. Sunburn was created by the sun cream industry to see their products.\n\nSeems easily testable, why not lie on the beach all day in one position with no sun block and see what happens? Make sure you fall asleep for maximum effect.\n\nspoiler: You go bright red and then blister to the point that you get taken to hospital for a combination of sunstroke and the beginning of shock then spend the rest of the holiday indoors face down with regular application of creams and replacement paraffin patches on the burns. It puts a bit of an dampener on your 2 week break.",
   "created_utc": 1699278170,
   "score": 223,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k829oa7",
   "message": "First girlfriend was religious, and apparently it was okay that we had sex “as long as she feels bad about it after”. Pre planning regret was her loophole to do what she wanted.",
   "created_utc": 1699275163,
   "score": 187,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82dllt",
   "message": "I'm a dental hygienist. We had a patient come in with terrible teeth. \n\nThey thought toothpaste caused cancer.",
   "created_utc": 1699277118,
   "score": 3,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82drbt",
   "message": "My cousin -- a city boy who's never been around farm animals -- once told me that only human women feel pain from childbirth (on account of punishment for original sin) and that I -- a country gal who has seen many a farm animal give painful, difficult birth (as well as a mother who has experienced the same) -- was wrong in asserting that he was incorrect.",
   "created_utc": 1699277192,
   "score": 132,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82jldq",
   "message": "A distant relative, recently retired, once told me that he was going to hire a gardener and a housekeeper because \"the government will give you a grant to pay for them now.\" \n\nThis was a few minutes after a lengthy rant about how the welfare state should be scrapped because only lazy people lose their jobs and need to claim benefits.\n\nThe same relative, some years ago, also announced with absolute conviction that he was going to hire a neighbour as a cleaner because \"she won't have anything to do now her kids are grown up\".",
   "created_utc": 1699279863,
   "score": 37,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82ezrr",
   "message": "The jews actually were behind the holocaust in a joint attempt to rid themselves of the weaker jews and also to blame the Nazi party who were totally innocent.",
   "created_utc": 1699277786,
   "score": 223,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82tn24",
   "message": "Wife’s uncle was certain I didn’t pay any taxes as a Federal employee. He said it didn’t make sense for the gov to pay me a salary derived from tax revenue only to then have me pay taxes back to the government . \n\nYes that does make sense and it is exactly how it works.\n\nEven still he screamed at me at Thanksgiving one year.",
   "created_utc": 1699283964,
   "score": 50,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82qxi5",
   "message": "Girl I was talking to, with complete seriousness, tried telling me that the testosterone produced in women's bodies was structurally different than the testosterone produced in men.\n\n*If it was structurally different, then it wouldn't be testosterone, it'd be a different hormone.*",
   "created_utc": 1699282895,
   "score": 112,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k831ggp",
   "message": "I literally believed Elvis shat his spine out and that’s how he died until I was 15 and realized that didn’t make any sense. My older brother told me that when I was like five and I just took it and ran with it.",
   "created_utc": 1699286937,
   "score": 136,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k8272c5",
   "message": "That celebrities drink the blood of children to stay young and that's why celebrities on zoom calls during covid looked worse because they couldn't get their blood.  Or maybe they just didn't have access to professional makeup artists during lockdown.",
   "created_utc": 1699273733,
   "score": 102,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k81w0r5",
   "message": "JFK Jr. is alive and is going to reveal himself as Donald Trump’s running mate next year.",
   "created_utc": 1699266242,
   "score": 16,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82qj1h",
   "message": "Once had a guy who tried to argue that periods were nature's way of saying that a girl was ready to have sex. They also not only tried to use this to rationalize sleeping with someone who was underage, but also tried to argue that it wasn't pedophilia to sleep with someone underage if they had gone through puberty (because in their mind puberty = no longer child). They also believed that if an underage girl got pregnant then that wasn't a big problem because they believed the body wouldn't get pregnant if it couldn't endure pregnancy.\n\nIt wasn't just stupid \u0026amp; highly uneducated, but also ****ed up on so many levels (and the clincher? The man was aspiring to become a teacher).",
   "created_utc": 1699282734,
   "score": 117,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82vxou",
   "message": "My mother forbid us from eating Mexican food growing up because \"It's for Mexicans not for people, it will make you sick\".\n\nI am now married to a lovely man from Mexico and needless to say I'm none the worse for cooking and eating Mexican food!",
   "created_utc": 1699284853,
   "score": 131,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k834sox",
   "message": "We can make money selling Amway products.",
   "created_utc": 1699288183,
   "score": 125,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82lwi7",
   "message": "An woman once said to me, \"It's amazing that we are at sea level, so high up in these mountains.\" \n\nWe were at Lake Tahoe, which is over 6,000 feet above sea level. \n\nWhen I asked her what she meant, she said \"all water on Earth levels out, so we are at sea level.\"\n\nHer adult daughter told her to shut up and then whispered to me, \"the worst part is she's a teacher...\"",
   "created_utc": 1699280855,
   "score": 56,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82rrko",
   "message": "That women don't burp or fart, because only men have (the ability to pass) gas. Spoiler alert: he was horrified when I burped in front of him.",
   "created_utc": 1699283231,
   "score": 103,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k83etv2",
   "message": "We were watching the Olympics and a competitor from China was out-running everyone in his heat and my friend said \"Wow, that Chinese guy is fast!\"  Someone overheard that, cleared their throat, and said, \"it's *Asian-American*\".",
   "created_utc": 1699291841,
   "score": 203,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82dcmq",
   "message": "Worked with a guy who was adamant that evolution was fake. I pointed out human guided, sped up evolution- domesticated dogs and the often harmful breeding for certain attributes, seedless fruits and vegetables, that elephant tusks are getting smaller as the larger tusked specimens are killed for their ivory leaving smaller tusked ones as the main breeders- and even pointed out how in a small span of time we can see *human evolution* in average heights, shrinking pinky toes, and prevalence of certain eye and hair colours.\n\nHis response was \"that's not evolution, that's genetics\".\n\nHe refused to believe when I explained that genetics + time = evolution.",
   "created_utc": 1699277002,
   "score": 226,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82afwr",
   "message": "In early 2021 I was informed , quite earnestly, by a random lady in a shop that you could tell who had been vaccinated against COVID 19 by placing a magnet on them  as the vaccine made you magnetic.",
   "created_utc": 1699275558,
   "score": 253,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82yi3l",
   "message": "My grandmother believed if you laid in the sun, while on your period, the blood would cook inside your body and never come out",
   "created_utc": 1699285822,
   "score": 76,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k833gex",
   "message": "A former coworker *insisted* that the body believes the ears are injuries, and we are all constantly trying to heal our own ears closed. The only thing keeping them open, you ask? *Ear wax*\n\nWe worked in healthcare.",
   "created_utc": 1699287688,
   "score": 77,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82ifz0",
   "message": "Scientists planted dinosaur bones to disprove god.",
   "created_utc": 1699279364,
   "score": 6,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82help",
   "message": "I had a doctor tell me that it's impossible for Mathew Mcconaughey's character in Interstellar to age less than his daughter while being in the planet close to the backhole, bcs everyone has the same biological clock.",
   "created_utc": 1699278909,
   "score": 195,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82ldt6",
   "message": "My friends boyfriend said to me (a veterinary technician): “A dog’s mouth is extremely clean \u0026amp; if you have a wound \u0026amp; let them lick it, it will heal it.”",
   "created_utc": 1699280631,
   "score": 129,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82izoc",
   "message": "My mom is really not stupid at but older generations and internet I guess.\n\nOnce a while ago she told baby ears close for protection when being touched or something. Imagine like a flower.\n\nWell I was really confused so I asked her if she had ever witnessed this happen because my mom has FIVE children.\nAlso I had a baby that time and surprisingly never saw his ears do anything.\nTurns out Facebook is not a good place to take information from.",
   "created_utc": 1699279605,
   "score": 23,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k81w2ax",
   "message": "That the center of the earth was 40 km away 💀",
   "created_utc": 1699266277,
   "score": 125,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k838kj0",
   "message": "Just yesterday I had a lady tell me that she does reiki over the phone with pet parrots to get them to stop feather picking. She does it over the phone because birds are so sensitive that her healing energy is too strong to do it in person with them.",
   "created_utc": 1699289569,
   "score": 123,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82fj29",
   "message": "We were in a Restaurant in spain. Conversation as follows:\n\n-Me:\"what do you want to eat?\"\n\n-him:\"pesto carbonara\"\n\n-me:\"you mean pasta...right? Because pesto is a sauce\"\n\n-him:\" no no, i mean pesto. In italy and spain you can say pasta or pesto\"\n\n-me:\" you're joking aren't you? You cant really believe this? Pesto is even listed as an sperate menue right under carbonara\"\n\n-him:\" no serious, you can ask the waiter if you dont believe me\"\n\n\nI didn't ask the waiter because i know i made him feel stupid over something he said way too often already in the two days we were there.. this was the most exhausting vacation i ever had..",
   "created_utc": 1699278052,
   "score": 219,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82lu9v",
   "message": "That darker-skinned people were marked by a curse, but that they would be lighter skinned once they went to heaven (if they were \"good\" on earth)",
   "created_utc": 1699280828,
   "score": 121,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82empp",
   "message": "\"The data is safe! It's in the computer.\"",
   "created_utc": 1699277610,
   "score": 217,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82onxc",
   "message": "“If a bear is chasing you, start running around a tree because circles confuse bears. The bear will either get lost, or confused about who is chasing who and leave.”",
   "created_utc": 1699281992,
   "score": 51,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k8373at",
   "message": "I was using an  Hex key (Allen wrench ) and some guy told me I was using it wrong and that I should use the small side to turn and the long one in the screw because it gave more lever.\n\nAnother guy said a dragster could accelerate faster than light (again accelerrate, not go faster wich is also wrong but less)\n\nImagine my face hearing that knowing I'm a engineer..",
   "created_utc": 1699289032,
   "score": 51,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k81w5bu",
   "message": "Extraterrestrial apes populating this planet.",
   "created_utc": 1699266344,
   "score": 100,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k826gu6",
   "message": "The guys in production at work 100% think Michelle Obama is a man. Ive heard it several times. Pretty disturbing.",
   "created_utc": 1699273397,
   "score": 5,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82bz24",
   "message": "\"No, it's still just one job. We used to have one person do all of this stuff.\"\n\nYeah. Office manager, event coordinator, and what should have been director of membership are all 3 separate titles; you just don't want to pay 3 salaries.",
   "created_utc": 1699276327,
   "score": 221,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k81w3zi",
   "message": "That the world is flat 🤦🏻‍♀️",
   "created_utc": 1699266315,
   "score": 213,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82guja",
   "message": "\"There is a war on Christmas going on.\"\n\nNot since the Massachusetts Bay Colony, dear.",
   "created_utc": 1699278663,
   "score": 240,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82wmqf",
   "message": "My very best friend in the world told me that Obama - not some people from the government, but Obama himself - was going to come to his house and take his guns.\n\nI could not possibly over-stress how serious he was.",
   "created_utc": 1699285117,
   "score": 167,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k831pq0",
   "message": "A couple years ago when there was a solar eclipse, a lady complained that the planned eclipse party was inconveniently scheduled during the day, and could they please move it to that night so she would be able to attend.",
   "created_utc": 1699287033,
   "score": 133,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k835q5v",
   "message": "That if I fed my daughter chia seeds she would walk and no longer be paralyzed.",
   "created_utc": 1699288531,
   "score": 49,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82hhrg",
   "message": "I told a family member that you still need to be cautious about sunburn on cloudy days, especially if it's a thin layer of high clouds, because UV rays still get through, and while it seems like you're safe from sunburn, you can still burn just as bad.  \n\nSix months later I overheard this family member confidently telling a friend that they couldn't go outside when it's cloudy because that's when the worst sunburns happen.",
   "created_utc": 1699278948,
   "score": 199,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82p0v6",
   "message": "\"You're not Bi, I worked in bars, I know what bi women look like\"...... I wish he elaborated , I'm curious to know.",
   "created_utc": 1699282136,
   "score": 46,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82jly3",
   "message": "He said that white people like me were made in the laboratory",
   "created_utc": 1699279870,
   "score": 78,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k820fjb",
   "message": "That Obama's first name was Obama.",
   "created_utc": 1699269576,
   "score": 143,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82qm63",
   "message": "I had a co-worker explain that there is a hyper advanced society living underground called \"Agartha\". It is accessible through a giant hole in the south pole. It's where the people of Atlantis went.\n\nI explained that was fiction. \n\nThey insisted it was real. Also, Atlantis was actually buried under the Sahara desert. Also, humans were an alien experiment generated by breeding themselves with apes.\n\nAnd I swear this person believed it all.",
   "created_utc": 1699282769,
   "score": 40,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82v9oc",
   "message": "\"Like attracts like\".  This is why they put hot coils behind your refrigerator.  To suck all the heat out of the refrigerator into the coils.  - Source:  My grade 7 science teacher.",
   "created_utc": 1699284594,
   "score": 37,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82z1ko",
   "message": "I was discussing nuances in recipes for some food and drink products with someone, and this random guy just chimes in saying how two different recipes of the same food or drink will always taste the same regardless of the ingredients used because \"It's the same end result either way\" and something along the lines of people who think they can taste flavor differences are insane because no one's sense of taste is that precise, etc.\n\nI think this guy just genuinely had a messed up sense of smell/taste, but he kept insisting he was right and everyone else was wrong about it. He was saying garlic didn't have any actual flavor and didn't make a difference in pasta sauce because \"It only tastes like tomato anyway,\" and that coke, pepsi and all other brands of cola tasted exactly identical to him (and he was also assuming they tasted identical to everyone else too).\n\nAnd this wasn't just a one off interaction, he continued trying to convince people that their senses of taste were wrong and flavors didn't actually exist for nearly 2 hours.",
   "created_utc": 1699286024,
   "score": 35,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82kuc9",
   "message": "A friend of my ex’s thought cats were venomous creatures.\n\nMy ex had recently adopted a cat, and the three of us met up for dinner or something. We were talking about the cat and I mentioned that me and the cat were playing and she playfully bit me. My ex’s friend, in all seriousness and genuine concern, was like “Omg are you okay? Shouldn’t you go to the doctor or something??”\n\nI was like, uhhh no? It’s just a cat and it didn’t even break skin. I’m used to this from the cats we had growing up.\n\nAnd she responded by telling me that cats are venomous since the bites always swell up and get super red.\n\nI seriously thought she was fucking with me, but she genuinely thought that cats had venom in their fangs or something. Granted, she was just seeing the infections you can get since cats have tons of bacteria in their mouths, but still. Venomous cats was one of the funniest things ever",
   "created_utc": 1699280395,
   "score": 70,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82tuz2",
   "message": "Girl in High School: “I hate Bohemian Rhapsody.”\n\nEverybody else in class: “Why? It’s a classic?”\n\nGirl in High School: “It just doesn’t make sense. Why would he tell us his mom killed a guy and then make the song about himself?” \n\nEverybody else in class: “…..his mom didn’t kill anybody he did?” \n\nGirl in High School: “No, he said *momma just killed a man.* Nice try, it doesn’t make sense.”\n\nEverybody else in class: “He’s telling his mom he killed somebody. It’s *Momma. Just killed a man.*” \n\nYep.",
   "created_utc": 1699284052,
   "score": 118,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82su7x",
   "message": "\"If circus animals were sad, they wouldnt do the show they are doing, they surely are happy\"\n\nGod, my aunt's a critical thinking fail in herself.",
   "created_utc": 1699283650,
   "score": 31,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82dgu4",
   "message": "I had a coworker who was born and raised in North Carolina and she was utterly convinced that enslaved people could come and as they pleased and that plantation owners were benevolent charities that housed people who had to where else to go.",
   "created_utc": 1699277055,
   "score": 133,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82cqr4",
   "message": "That's there baby blood in Pepsi.",
   "created_utc": 1699276710,
   "score": 83,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82bpif",
   "message": "Just recently someone at work told me with a straight face that the Hawaiian wildfires were actually started by a secret government energy weapon so that the government could seize more land from the Hawaiians.  I looked at them dumbfounded and just walked away.",
   "created_utc": 1699276197,
   "score": 126,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k83a7wc",
   "message": "Joe Biden is meeting a secret cabal of world leaders in Switzerland to plan a new world order where no one is allowed to travel more than 15 minutes from their city center. \n\nI think I did a slow “WTF turn,” before I asked “…Why?” And she got all flustered and started stuttering about how I should “look things up.”\n\nShe has a million of these little gems. I can hardly believe this person and her ideas exist. \n\nBy the way, she is married to a trans Filipino man, who fled the Philippines to *escape persecution for being trans*, and is a staunch Trump voter because “family values.”\n\n🤦‍♂️",
   "created_utc": 1699290165,
   "score": 54,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k82hbkz",
   "message": "My friend said that you can't turn iron into a gas. To which I replied that under certain conditions you can turn every element into a gas. He still wouldn't admit being wrong and we had a funny back and forth for a couple of minutes. I still sometimes tease him about it",
   "created_utc": 1699278872,
   "score": 26,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k83ncmi",
   "message": "Bi racial means half black and white. I explained that bi means two and racial means race so it applies to anyone if two races not just black and white. Apparently I’m not biracial because I’m half black and half south Asian and that doesn’t count.",
   "created_utc": 1699294916,
   "score": 29,
   "submission_id": "17oznoi"
  },
  {
   "comment_id": "k84614n",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17oznoi"
  }
 ]
}