{
 "submission_id": "17pi027",
 "title": "For those who have careers that keep them out at sea for long periods of time, what is the creepiest thing you’ve seen out in the water?",
 "selftext": "",
 "created_utc": 1699317715,
 "permalink": "/r/AskReddit/comments/17pi027/for_those_who_have_careers_that_keep_them_out_at/",
 "score": 138,
 "url": "https://www.reddit.com/r/AskReddit/comments/17pi027/for_those_who_have_careers_that_keep_them_out_at/",
 "comments": [
  {
   "comment_id": "k85yfgb",
   "message": "I used to be an oilfield diver in the Gulf of Mexico. I'd say about 80% of the dives I logged were at night. Mostly 500 ft and under DSV's. \n\nIt's very eerie feeling sitting on the downline doing in water decompression in the middle of night. I'd always ask topside to turn off my headlight. \n\nLike a worm on a hook. Just bobbing in the darkness.",
   "created_utc": 1699326335,
   "score": 66,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85tq73",
   "message": "This sort of qualifies. Former navy here. Somewhere off the coast of Italy saw a very, very small boat, not much bigger than a rowboat, about 9 or 10miles offshore. This was sometime around midnight. There was no light from land, and no other ships around. It had a light. Our ship captain said it was a fisherman, and the fish would be attracted to the light at that time. \n\nImagine being in a rowboat about 10 miles off shore in the middle of a pitch black night, waiting to see what finds you",
   "created_utc": 1699324362,
   "score": 62,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k864thm",
   "message": "In 20 years the weirdest shit I’ve seen is other people that work out here…. \n\n\nThere’s about 40% of the sailors like what they do and are good at it. Another 40% that are good at it, but would do something better if the money was right. But there’s another 20%…. If they lived ashore for more than 6 months a year they’d end up dead or incarcerated. There’s no more “west” for them to go to so they went offshore and became our problem.",
   "created_utc": 1699329163,
   "score": 254,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86a8r8",
   "message": "Some 20 years ago...\n\nOn the MV Explorer (since sunk) down near the Antarctic circle, sailing around the 'bergs and occasionally making landfall...\n\nWe rounded into a small bay area, and there, amongst the ice and coast was an unmarked sailing yacht. Which is odd as generally yachts have some identifying markings on them.\n\nTo add to it, they didn't respond to any radio contact, and whilst I wasn't privy to the conversation (and it was a long time ago), some crew went across via Zodiac and were refused boarding. \n\nSo basically a yacht, not a particularly large one, that was unmarked was hanging around in the inhospitable waters of the Antarctic and didn't want any help or contact.\n\nProper weird.",
   "created_utc": 1699331853,
   "score": 209,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86198o",
   "message": "I am a recreational sailor who travels for weeks at a time at sea. I once saw a flame on the water not ten yards from me. Just freaking burning at midnight.",
   "created_utc": 1699327565,
   "score": 223,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85uiwg",
   "message": "Not so much creepy, as eerie, but being out in the blue at night in a lightning storm in a slack wind.\n\nThe ocean was very flat - no big rolling swells - just tiny little ripples. The whole world would be black, and then there would be a flurry of bolts, and the whole world would be silver. The ocean looked like nothing so much as aluminium foil that had been scrunched up, and flattened out - the water looked like mercury, and all the little ripples made these very dramatic black shadows.",
   "created_utc": 1699324695,
   "score": 187,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85u36o",
   "message": "I worked on the sailboat one summer in the Bahamas and something that you see a lot when you’re in the ocean is kayaks and life jackets floating around and you always radio them in but they always just fell off a yacht or something and it’s never a big deal. \nOnce we found a kayak floating and it had a fishing rod in the rod holder which basically meant someone was using it",
   "created_utc": 1699324514,
   "score": 39,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85mjj9",
   "message": "A dead human body. It was the tropics and it wasn't in good shape. We turned it over to the authorities at nearest land. There were enough teeth left to identify it by dental records. Here's hoping the man's family got closure.\n\n*edit*\n\nu/Altril2010 is correct: the body was double bagged and stored in the walk-in freezer until our next port visit. There was quite a bit of cleaning and decontamination involved, but that's the gist of it.",
   "created_utc": 1699321406,
   "score": 80,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k861q6p",
   "message": "The bioluminescent animals (or whatever they are) in the water is pretty amazing. Our toilet would fill up with seawater and if you took a piss in it in the middle of the night it would agitate the water and it would glow sometimes",
   "created_utc": 1699327773,
   "score": 242,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85j694",
   "message": "Empty boat far out at sea",
   "created_utc": 1699320016,
   "score": 234,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k861pcd",
   "message": "Somewhere in the Atlantic, nice cold as fuck night, decided to step out and look at stars. About ten minutes on and a boats mast pops up, sits there a few minutes and then back under. No alarms, nothing. Just some sub boys getting a bit of late night o2 in the middle of nowhere next to some friends.",
   "created_utc": 1699327763,
   "score": 159,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k860vn0",
   "message": "What I'm learning from these comments is that the ocean makes people poets.",
   "created_utc": 1699327397,
   "score": 244,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k866q60",
   "message": "Creepiest thing I’ve seen has definitely been seeing myself and other crewmates lose our minds. \n\nOn one particularly awful voyage, everything that could go wrong went wrong and we found ourselves without food, water, and sleep for a very unhealthy amount of time. It started off with auditory hallucinations. Ships are noisy, and when you’re going crazy, you begin to think those noises are talking to you. I heard children laughing, a choir singing, and creepiest of all, a particular splash sounded like it was calling my name from the sea. Combine that with visual hallucinations and then things get really terrifying. I was convinced we were in the desert at one point with sand all around us and mountains in the distance. Another crew member freaked out and told us we were about to run into an apartment building. The creepiest thing I saw was an all-black flying pig with red eyes on the bow. I think the scariest though was when someone was convinced we lost part of our crew overboard. It turned into a massive, delirious argument over where everyone was even though we were all accounted for. That trip was brutal, and the captain put us all in a terrible situation due to sheer incompetence.\n\nOther than that, there was this one time I saw three gigantic ships in the distance with no lights and they did not show up on AIS. Suddenly they were gone. It was extremely creepy.",
   "created_utc": 1699330060,
   "score": 197,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85hr13",
   "message": "Not exactly in the water but body parts in a sea chest.  \n*(The sea chest is a hole in the hull which is used for water intake)*",
   "created_utc": 1699319432,
   "score": 183,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85pajs",
   "message": "I was on a 32ft speedboat and got caught by nightfall in between islands. No night lights on the boat, navigating using gps and depth finder. Captain knew the way like the back of his hand since he’d sailed those waters since he was a kid but for me it was my first time in the middle of the ocean at night. Pitch black but for the stars. As above so below, it seemed as if the boat was floating in the blackest void of the universe. Years later I saw the movie Life of Pi and the scene where Pi is in his lifeboat floating in the dark among the stars no above no below : it was exactly like that. I still have dreams about that night. . The engulfing dark and the silence that was not silent. Surreal.\n\nWe made it safely to port. Captain fitted the nightlights on that boat the day after.",
   "created_utc": 1699322536,
   "score": 110,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k866ki3",
   "message": "I was drinking in an airport bar and met a woman who worked as a commercial fisherman, on her way to SE Asia for R\u0026amp;R with her family. Real salt-of-the-earth lady. She regaled me with stories about her work, all the good stuff about working in her world, all the reasons she kept doing it for decades.\n\nI asked her what the scariest thing she saw out on the open ocean was and, without any hesitation, she said \"Oh, an underwater UFO. I saw one rise up out of the ocean next to my boat and fly off into the sky.\" The matter-of-fact-ness of her answer bothers me to this day.",
   "created_utc": 1699329983,
   "score": 131,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85qv9j",
   "message": "An empty sailboat with no mast, 300 miles from land",
   "created_utc": 1699323183,
   "score": 32,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85xn78",
   "message": "I was underway from the Port of Houston to Cartagena, Columbia. The vessel cuts all lights off on the outside of the boat, so it's pretty dark outside. I would always go and sit out on the deck and listen to my headphones, and look at the stars. Well one night, somewhere in the middle of the Caribbean sea, I noticed a swarm of lightning bugs cross the boat. Totally blew my mind to see light out or nowhere. At least I think it was lightning bugs. \n\nOn the same trip heading back to Houston from Columbia, I witnessed a satellite crashing. At least, that's what I think it was. It steadily strobed and lit up the night sky and water for about 15 min till I couldn't see it anymore. \n\nAnd on a different trip, I was in the middle of the Gulf of Mexico. No moon, no clouds, no light pollution, the amount of stars that I saw made me cry. Never thought starlight alone could cast a shadow. Definitely mesmerizing I still remember it like it was yesterday.",
   "created_utc": 1699325997,
   "score": 122,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k861pk3",
   "message": "Right. Long time lurker, first time poster here.. I’m no longer at sea but used to as a younger chap with romantic ideas spend months on end on cargo ships. Mostly tankers, crude oil VLCC and refined product tankers but with a little time in oil and gas and towing, I came ashore in 2017 with a Master unlimited ticket, sailing as chief officer. My last ship was a self discharging bulk carrier. \n\nAnyway I digress.. it wasn’t so much about what I saw which was creepy I saw plenty of interesting things I wouldn’t have seen anywhere else. However, I was second mate on a tanker distributing refined oil products around the coast of New Zealand. A yacht had sailed from a port on the east coast, bound for another port just down the coast abit but it had disappeared. Solo sailor on board - aside from his dog. None the less, the search proved fruitless and it was suspended. However, for weeks afterwards at about 0130 in the morning the rescue coordination center would broadcast a plea at the end of the weather and navigation warning broadcast asking for the yacht to make contact if it could hear the message and was able to do so. \n\nI’d sit in the dark, chain smoking and working on my 7th cup of coffee looking out into the black imagining the guy who’s had a stroke or heart attack on board with the same broad cast playing out on his radio while his dog ate his face to keep from starving.. or imagining him having fallen over the side imagining what it’d be like watching your yacht sailing indifferently off into the distance with your dog in the cockpit pacing and agitated unable to do anything about it. Knowing you were fucked and had a matter of hours - if that left to live before the cold got you or exhaustion. Or, imagining the dog starving and dying on a yacht by itself weeks later listening to the same broadcast in the dark. \n\nThe places your mind goes in the dark by yourself… \n\nThey found the yacht in the end. \n\nThe dog was still alive. \n\nhttps://www.maritimenz.govt.nz/about-us/what-we-do/safety-and-response/rescue-coordination-centre-rccnz/tafadzwa/",
   "created_utc": 1699327766,
   "score": 227,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85m70a",
   "message": "i have a friend who works on ships. he said the single scariest thing he had ever seen was looking out a window and seeing a wave that he said looked like it was 100 meters high pass right by their boat and suddenly disappear. he knew about rogue waves but he said seeing one that big, and that close, and watching it suddenly just vanish was so creepy and shocking that he was literally stunned for a minute.",
   "created_utc": 1699321261,
   "score": 112,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85ujf5",
   "message": "One night on the 00-04 watch in the Persian gulf on a Military transport, the whole sky went from pitch black of 0200 to fully lit in a second. This went on for about 30 seconds then back to pitch black. We called up the neighboring ships and HQ no one knew what happened. Our best guess was a meteor. \n\nSecond story was a couple years before the first, cruising around the Philippines and see nothing at all visual and on radar, All of a sudden we see a faint white light about 100 yards off our port bow. Typically we don't let anything get within a mile of our ship. Grab the binos and head to the bridge wing and there is just a little banca boat with his outboard motor and a flashlight. Even with Radar, NVG's and an infrared camera we couldn't see this guys little 20 foot boat in a 6 foot sea without lights on.\n\nObviously more crazy stuff than creepy in my career so far. \n\nThe people are the craziest thing you will experience at sea, had one guy who wouldn't go outside the skin of the ship at night because the aliens would abduct him... again!",
   "created_utc": 1699324701,
   "score": 100,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85v245",
   "message": "Sometimes, during night time I have went out of the accommodation (leaving compartment onboard merchant ships) to breathe some fresh air or to take out the trash since the garbage station was outside. And when it is completely dark, and the water is calm, you hear the splashing water against the ship's hull. Well I can't explain why, but the ocean water was luring me, but at the same time you are terrified, since nobody will find you if you fall overboard. So sometimes I was just staring at the water in the dark, and inside me was some struggle, like some part of me wanted to jump in, while the other was terrified that it would be a one way ticket. Can't still find the explanation for this. This hypnotic, mesmerising feeling I get, and at the same time the chills running down my spine, that if I would fall in the water. It's game over for sure.",
   "created_utc": 1699324917,
   "score": 63,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k861khz",
   "message": "I was in a glass bottom boat in the 1970’s off the coast of Oahu. We were going out to see a pod of whales. The boat Captain was a grizzled old Hawaiian sun baked to the color of Mahogany. It was an older boat, retrofit with a glass bottom and bench seating. He was narrating over a PA as we left the dock.\n\nWe motored out for about 30 minutes and the view out of the bottom of the boat was disappointing, just long streams of bubbles obscuring the view. Finally he stopped the boat, and the view was simply amazing. The Captain pointed out a pod of whales about 1/4 of a mile away. They were cavorting about, diving and jumping. The Captain was explaining their behaviours, but keeping his distance. It was pretty cool.\n\nAll the whales suddenly dived and disappeared, emerging moments later, right next to our boat. They were swimming all around us, diving and jumping and splashing us with water, children were laughing, everyone thought it was part of the show. They were right there, almost so close that you could touch them. The Captain told us how lucky we were, to see them up close.\n\nSuddenly, the mood changed when they started bumping up against the hull of the small boat. People were sliding all over the place, some fell onto the floor, children were crying. Most telling, the Captain had stopped narrating and had a look of abject terror on his face. I remember thinking what it must take to make this guy scared, and as he looked terrified we should probably be too.\n\nSuddenly, as quickly as they appeared, the whales disappeared. They were just gone. People picked themselves up and sat back down, mothers consoled children, we started back to the dock. The Captain got back on the PA and tried to downplay the seriousness of the what just happened, but there was a definite quiver in his voice as we headed back to shore.",
   "created_utc": 1699327703,
   "score": 221,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86axkp",
   "message": "A few things come to mind, but i have to say, \"Deadheads.\" In my younger days, I was captain of a dragger out of Kodiak AK. She was a 130' Gidddings marine trawler. I will never forget my first week in the wheelhouse with the owner who was retiring and showing me the operation before I took over. After a night busting ice off the rails in freezing rain and 2 meter seas, he went to bunk and left me to wheel watch. It was clearing up with a medium haze and flat calm waters. Most of the crew was sleeping or hanging out in the galley, so I was alone and the only eyes forward. \n\nI'm drinking some nasty folgers and sucking down a Marlboro red when I see what looked like an old pier piling, straight ahead. I kept looking at that spot, and, nope, nothing there. A few seconds later I swear I saw that thing again but only closer. Nope, gone again. I thought, shit I've been up waaay too long and I'm fucking hallucinating. Then out of nowhere this tree trunk shoots directly up into the sky, this thing had to be 60' tall and was about 30'off the bow, dead center. I damn near shit myself. I pushed to port and rubbed the \"tree\" with the right side of the bow. We were at a good 14knot clip which is fast as hell for an almost fully loaded trawler. Then it shot town and disappeared about midship. \n\nI later learned that these are pretty uncommon in the Aleutians, where we were fishing. They're called \"deadheads\" and only 2 of the guys on the boat had seen them before. They float vertically, and Bob straight up and down. These things were known to destroy older wood boats and kill crews. I'm just glad I wasn't dragging the net, and it would have cost us in the ballpark of 100k.\n\nI've seen what most people would consider worse, but the fear that a huge bobbing tree in the middle of Alaskan waters come out of fucking nowhere tops my list.",
   "created_utc": 1699332224,
   "score": 127,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85o5jd",
   "message": "I was in the USN back in the late 80s early 90s. Cruising thru the Indian Ocean in 100% blackness then waking up the next afternoon and looking over the rails and seeing 100's of sharks swimming along side of us constantly. Every now and then we would get a \"man overboard\" alert. They never recovered even one of them at night. They were usually suicides.",
   "created_utc": 1699322071,
   "score": 151,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k865wt5",
   "message": "Back when i was a cadet at a merchant ship, i used to be exhausted and over worked all the time that i started hallucinating stuff at night. My watch used to start at 4 in the morning , one fine day we hit a storm and the wind was coming with such a force that it was creating a wailing sound like somebody is crying outside. I went to check outside and saw a shadowy figure sitting at the corner, i knew i was hallucinating but still i shat my pants. Never went outside during a storm after that.",
   "created_utc": 1699329668,
   "score": 151,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85v3hh",
   "message": "Nothing too out of the ordinary, but two things stick out to me.\n\nOn occasion, I have to get in the water in the middle of the ocean for Man Overboard Drills. Looking down and seeing literally nothing is actually a little eerie when I think about it.\n\nSeeing storm systems develop in the distance is pretty cool and trippy at the same time. You'll literally see massive storm clouds developing a water spout (although they seldom fully develop), and lightning light up the horizon. It's especially powerful at night to the point where all you see is white light. \n\nOther than that, it's just occasional Marine life. My job is mundane but it has its moments.",
   "created_utc": 1699324933,
   "score": 16,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85tyyo",
   "message": "I don’t think I’ll ever get used to how dark it can get. On moonless nights, calm seas can be a bit hypnotic.",
   "created_utc": 1699324465,
   "score": 14,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85m98x",
   "message": "Oh hey one I can actually answer!\n\n\nSo this isn't the creepiest story, I'll admit that straight off. I was working on a tiny oil rig off the Gulf Coast, it was about 2pm. I was on what was called \"sliver duty\", basically you wait in-between two relatively close together walls on the exterior of the rig, strapped into a safety harness , while someone skirts through a long flow cable that you direct. Boring, but you get a nice view of the ocean for an hour or two.\n\n\nSuddenly my buddy on the other end of the sliver starts screaming to look down, I do and saw the biggest sea creature I've ever seen in my life. End to end it must of been the size of most rural hospitals I've seen. Just pushing below the surface of the water, it raised its head out and... \n\n\nI realized I was really dumb and was staring at an undersea cable placer.",
   "created_utc": 1699321288,
   "score": 15,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k863sxr",
   "message": "Nothing too extensive like some of the stories here, but I worked as a tuna fisherman for a tiny bit, where I’d spend 3-4 weeks out at a time, taking around 3 days of 24 hour travel to get where we (me and one other person - the captain who was a 5th generation fisherman) were fishing.\n\nSo many stories of insane things that I could be here all night - but one was near the end of the season, and we pushed out farther than we should have (over 100 nautical miles) where we had NO business being as a 37 foot trawler. And then we’re caught in a bad storm.\n\nI had barely enough time to, very carefully, board up all of the windows before the boat started “scooping” when coming down one of the 12ft waves, the first third of the boat dives underwater before popping back up, only to travel up another wave and do it again…and again…as waves got larger and things got worse.\n\nBasically, the captain and I stayed the cabin, bracing ourselves with each wave, staring at the radar in hopes we could stay in the position of taking the waves head-on and avoid being capsized. After a few minutes, and the fear that this 5th generation fisherman was exuding, I just accepted that I was going to die there - and the experience of that acceptance, and the event itself, had a profound effect on my perception and the way I’ve lived life afterward.\n\nWe eventually made it out, and didn’t say a lot to each other afterward. Lots of stories from that time, but this was the “creepiest”, I’d say!",
   "created_utc": 1699328703,
   "score": 128,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k868elj",
   "message": "I sailed on the American aircraft carrier USS George Washington in 2000 and 2002.  A couple of things I remember are:\n\n-Pulling into Lisbon, Portugal for a port visit.  Carriers can’t pull pier side in Lisbon so we had to take boats back and forth.  I was looking down at the water and there wasn’t a square inch that didn’t have a jellyfish in it.  We were sailing through a giant bloom of them and all I could think of is if someone could survive if they fell in.  \n\n-The USS Cole was part of our battle group.  We left her behind in the Red Sea while we went through the Suez Canal.  Once we entered the Mediterranean Sea the Admiral went on the 1MC (ship speaker system) and told us that a rib boat had hit her and blown a hole in the side.  \n\nAbout a month later we were pulling into Palma, Spain when a rib boat came barreling towards us.  The security detail was called on deck and they were ready to blow them out of the water.  The Commanding Officer quickly told them to not shoot.  It turned out to be Greenpeace.  For the next five hours Greenpeace and hundreds of their friends circled the ship in their boats and jet skis.  Those guys probably had no idea how close they came to getting killed that day.  \n\n-Sailing across the Atlantic, especially in the winter, can get intense.  Carriers have advanced stabilization capabilities because the flight deck needs to be safe for landing.  Even with that, there are times where the ship bobbed around like a cork.",
   "created_utc": 1699330896,
   "score": 126,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85m4q3",
   "message": "Contract Mariner.  I disappear into the blue area for 6-8 months a year.  Creepy?  Not much honestly.  The sound of moaning steel due to slack tanks when you’re rolling really hard can be a bit unnerving.  St. Elmo’s Fire is pretty neat.    Fata Morgana aka “The flying Dutchman” is pretty cool to see in real life.  After awhile the only thing out there that really spooks you is a problem you have that directly influences your survival.  \n\nAll the spooky shit I’ve ever been a part of have been no bullshit emergencies.  Fire in the engine control room?  Im the first responder down there to see if it’s an actual emergency or a fucked up Consilium sensor?  Wall of toxic smoke from burning electronics and the high voltage room?  Oh fuck.\n\nHave an emergency weather sortie because we are dragging anchor and rolling 30 degrees with 50ft UKC and we’re getting pushed toward the island?  fuck me 10 shots ain’t enough we are about to run aground in a 55,000 ton 800ft ship.  Pucker factor.  Oops now we get the hook up to get the fuck out of there we immediately lose steering and propulsion?  Good shit.\n\nI’ve seen brand new million dollar sport fishers capsized and bobbing around like a cork 1000 miles from land.  \n\nI’ve seen tiny little song birds skipping along the surface just barely clinging to life but they’re flying as hard as they can to find land.  Some of the saddest shit I’ve ever seen are those little birds skipping off the water as they fly further out to sea hoping to all fuck they come across some land.\n\nI dunno.  I’m on the Yuengling at a port bar and I’m rambling.  To answer your question TLDR style;\n\nThe creepiest thing about being out there are the bottomless depths of sadness, loneliness and heartache.  You will go places in your mind that words will never be able to do any justice in trying to describe.",
   "created_utc": 1699321235,
   "score": 20,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k866g63",
   "message": "So I've worked in hospitality, including on a private yacht. This is in the Baltic. We were not near shore. It's very late. I assume everyone else had gone to sleep but I was not very sleepy after a pretty stressed day. I went on the deck and just looked at the ocean. Do you know that very strange feeling when you feel that somebody is looking at you? I could swear that there was something just below the surface. I don't remember how much time passed. It felt like a long, long time. I was just staring just at the edge of my eyesight, thinking that I would see something. I mean I guess it could've been fish or some sea mammal, but it felt wrong. I wish I had a more interesting conclusion than that. I actually don't even remember going back to my cabin that I shared with two others in the stew crew. The next morning I didn't talk about it, but then a few days later, I brought it up. No one thought much of it except one of the deckhands that had been working at sea for a long time. He said he had felt the same thing and seen the same thing several times, but only at night, and only when he was alone.\n\nI have no idea what to make of it. But I really feel in my heart it was not an animal.",
   "created_utc": 1699329924,
   "score": 106,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k8607yi",
   "message": "A friend told me this. He was a competitive endurance rower, rowing across the Atlantic. It was night and his little boat was floating right in the Middle Passage where many slave ships sailed hundreds of years ago. It was an extremely calm sea with no wind. He swears he could hear voices whispering in a language he did not understand.\n\nHe also mentioned being in high seas at another point and he could look up into the waves above his head and see shark silhouettes. \n\nI like being on land. 👍\n\nETA they made a documentary about the race. https://www.pbs.org/video/directors-cut-tom-mailhot-row-hard-no-excuses/",
   "created_utc": 1699327112,
   "score": 45,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85hc60",
   "message": "About a 12-15 foot tiger shark.",
   "created_utc": 1699319261,
   "score": 190,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85uokn",
   "message": "USN Sailor. I have seen a lot of remarkable things, but the creepiest was a great white shark that swam (more like drifted) inbetween the two ships during an underway replinishment off the coast of Australia. I could make an educated guess on how big it was, but just let me tell you it was way, WAYYYY bigger than the biggest sharks I've seen on the Shark Week shows. Much longer and twice as massive as the \"biggest shark ever seen\" on the youtube videos I've seen. It didn't move a single inch... it just floated, mouth open, inbetween as everyone on the bridgewing exclaimed \"Holy fucking SHIT!\" It's teeth were as big as a man's head. And it had massive scars down its' back and tail from a ships propeller. I wouldn't have believed it if I didn't see it with my own eyes.",
   "created_utc": 1699324760,
   "score": 191,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k864j5a",
   "message": "I worked on a commercial fishing boat in Alaska one summer. I got up one early morning before sunrise because I heard what sounded like a woman moaning not far from the boat. We were probably a few miles off the coast near Bristol Bay. It was really creepy the captain said it was seals. Shortly after that a massive storm blew in.",
   "created_utc": 1699329033,
   "score": 119,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85rllh",
   "message": "Submarine sailor\n\nNothing creepy but some of my best memories are sitting on top of the sail smoking a cigarette in the pitch black under the stars. \n\nScary, we had an electrical fire in the engine room one time. Another time during a SCRAM exercise we flooded the diesel. Scary scary\n\nEDIT: just remembered one of the worst memories. We were on patrol (underwater) for an extended period of time. I’m talking weeks and weeks and weeks without fresh air. We had completed our mission and were heading in to port. I went up the sail to get in a smoke, almost immediately after we had it rigged. Climbing back down afterwards, the smell that filled my nostrils. 175 men who had limited their hygiene routine for many weeks. Amine and Ass. It was downright putrid. Since we were surfaced we ventilated and only the 3 of us got to experience it!",
   "created_utc": 1699323482,
   "score": 175,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85ytyi",
   "message": "A toilet. I mean a literal regular household toilet floating hundreds of miles from land…and why was it floating? I’ll never know.",
   "created_utc": 1699326507,
   "score": 56,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k865np9",
   "message": "My answer won't get top billing but I loved watching flying fish when the ocean was perfectly calm.  Incredible. \n\nI worked on giant war ships in the U.S Navy",
   "created_utc": 1699329551,
   "score": 136,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k861fsj",
   "message": "Was on a two week cruise on a huge ship and one morning there was a tonne of commotion coming from one side of he ship.\n\nIt looked like a woman had fallen off the ship and was in the water below, face down in a summer dress - her hair sprawling around her as she lay face down and completely motionless in the water bobbing up and down as she was carried by the gentle waves of the ocean.\n\n\nYou think you're tough until you see some shit like that. People were crying, taking their curious kids elsewhere, others were frantically trying to find staff to go rescue her.\n\n\n\nAs it turns out a woman had left her sun dress and wig out to dry on her balcony the night before and the wind that morning had blown it into the water. \n\nAn announcement was made and everyone was so relieved and there was a lot of laughter. It was surreal to see everyone going from such worried, sad expressions (some were outright bawling their eyes out) to completely in hysterics laughing and hugging one another.\n\nI think we were all reminded of how precious life was that day, and it really was a HUGE relief. It was terrible in the moments where we thought it was an actual person. What made it believable is that  you're up so high on this ship it's hard to see details down below because of the distance along with the waves and water obscuring finer details.\n\n\nMy friends and I, who were on the cruise together, drank and laughed a lot that night. It was a very sobering event.\n\n\nEdit: Uhhh... your replies are making me doubt what I was told :\\",
   "created_utc": 1699327645,
   "score": 209,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86a181",
   "message": "This happened to my cousin's ex wife about a few months ago. This was in Ecuador, she is some sort of researcher or scientist of that nature. I  believe the company she worked for chartered a captain and a boat to go somewhere off the coast.  \n\nSo the boat starts sinking (idk how). She manages to get a signal on her phone and was able to call and text my cousin about the situation that was unfolding and she lost signal again. My cousin managed to contact the authorities and the Coast guard and the search began.\n\n8 to 10 hours had gone by and luckily they found them. When the coast guard found them, what they found was that my cousin's ex-wife had absorbed so much water that her face and body started being very puffy, and completely sunburned. If it not have been for the life jackets and plastic gasoline containers that they manage to hold on to because it floated they would have sank and drowned.",
   "created_utc": 1699331742,
   "score": 105,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k8667hs",
   "message": "It was 1998, I was only 11, was out for a quick boat ride with some family. Swiss Air Flight 111 had recently crashed a bay or two away. We saw a suitcase floating from afar, my dad quickly turned the boat back to shore.",
   "created_utc": 1699329808,
   "score": 42,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85mhxs",
   "message": "Reefs in the middle of nowhere. You can anchor and see everything, but they don't get above sea level, so looking from the horizon, nothing's there.",
   "created_utc": 1699321387,
   "score": 114,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85x1q6",
   "message": "I think I answered this a few years ago. \n\nWhile sailing in Northern Alaska, during the northern lights. We saw, what we thought was a bright spotlight from some air craft at like 3am. It shined for about 10 secs. Went away. And shined one more time. And didn’t make any sound. It was high over some mountains, so we couldn’t quite see what it was. \n\nOnly 4 of the crew saw it. And we laughed that if we told anyone, not a single person would believe the way we would describe it. \n\nAn unforgettable night for us! That was a good crew to sail with.",
   "created_utc": 1699325750,
   "score": 165,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k862fuo",
   "message": "Dammit, why do I always find these super interesting posts while I’m getting ready for bed. I’m gonna have to read the rest of this later. Awesome Isea for a post OP!",
   "created_utc": 1699328093,
   "score": 87,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k869l4n",
   "message": "Former comercial fisherman. \n\nOne morning we had a Russian Submarine surface about a quarter mile off the stern with it's periscope fully raised. We had a marine biologist from the state as an observer, and I'll never forget him saying \"is that a got damn submarine\". We were drinking coffee early in the morning when this happened, and the captain kinda just pretended it wasn't there. Didn't call it in on the radio or anything. In fact we assumed it was an American sub as we were near a US navy base. Coast Guard showed up and started trying to hail the sub via the radio, which the captain had left on an emergency channel to listen in. I'll never forget our faces as we hear \"Russian submarine victor leonov please respond\".",
   "created_utc": 1699331505,
   "score": 88,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k865gvj",
   "message": "Former Navy. The Indian Ocean is absolutely infested with sharks. You see nothing but dorsal fins extending all the way into the horizon",
   "created_utc": 1699329462,
   "score": 186,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86gh4b",
   "message": "I was in the US Navy for about 10 years, and have 10s of thousands of miles at sea in an aircraft carrier. Countless nights on the flight deck in the middle of the night and middle of the ocean... \n\nCreepiest: A HUGE patch of the ocean glowing. Like nuclear waste in the Simpsons glowing. I've seen bioluminescent algae of a few kinds and this was nothing like it. I've never seen anything like it before or since. \n\nWeirdest thing: hundreds of mile out to sea from land and there was a MASSIVE fire on the water. It was like the top of a gas refinery, but on the water with nothing under it but water. Flame going a few stories into the air.\n\nSaddest: a fellow sailor trying to jump overboard. He apparently got a 'Dear John' email and pictures from his cheating wife and decided to end it. We were on the smoke deck, he bummed a cigarette, then asked the time, we said 2300... he replied \"sounds like a good time to die\" and in one motion tried to launch over the chest high wall (with an opening to the water below). Luckily we were faster than him. We grabbed his legs and wrestled him down and laid on him and basically hog tied him till the MAs (Navy cops) got there. Broke my heart because he was a good dude. I never saw him again. He got transferred off the ship shortly after. Not sure what happened to him but I hope he's doing better.\n\nFunniest: 2 flying fish collide mid-air. I was smoking when we were in the Persian Gulf and saw the fish fly from a pretty far distance towards each other. I remember thinking 'there's no fuckin way they're going to hit' them SPLAT SPLASH! I was in tears laughing but no one saw it. Everyone just thought I was a weirdo, but I got to see a miracle of nature lol",
   "created_utc": 1699335491,
   "score": 180,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85rvu1",
   "message": "I saw someone pick up their half eaten snickers bar off a deck riser next to the toilet in the head of combat systems berthing and keep eating it. That head flooded with CHT (black water AKA poop) at least once a week because the sounding and security watch would go to sleep instead of responding to the tank full alarm and pressing the button to pump it out.",
   "created_utc": 1699323597,
   "score": 137,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k864luh",
   "message": "Middle of the Pacific, went outside at 2am, saw a blue light in the shape of an orb about 30 feet away from the ship.  It hovered next to us (we were going probably 12 kts) and then it took off faster than anything I had ever seen move. \n\nI have also seen some weird floating things that looked like a lifeguard chair from the beach, but made of bamboo just floating way out in the Pacific.  No idea what they could have been, not really creepy in and of themselves, but just being out there so far from land was weird.  It also helps that I usually would see them on days where the ocean was super calm, like glass.",
   "created_utc": 1699329068,
   "score": 164,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85wxc1",
   "message": "This is one of the rare Ask Reddit's that is genuinely interesting and spooky.",
   "created_utc": 1699325699,
   "score": 74,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k8696l7",
   "message": "More morbid than creepy, I used to go out for months onto a mexican oil rig right after college, one time a beat up makeshift boat drifted near us,  there was nobody on board but some bags with what looked like personal objects, children clothes and a couple water jugs that were still hanging from it, most likely was transporting illegal immigrants from the caribbean at some point, we used to see them fully packed of people all the time...",
   "created_utc": 1699331292,
   "score": 75,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86e9ug",
   "message": "Two things. \n\nFirst was the amount of stars you can see from the middle of the Atlantic. Had a girlfriend with me and we would talk while watching shooting stars. I swear some of them were just...moving and not shooting but who really knows. Gave me the sense that humans are really just egotistical ants in the universe.\n\nSecond was when the ocean was smooth as glass. When I walked out the skin of ship, I silently gasped because I was really scared. The calmness of it all and the lack of distinction of the horizon was terrifying. I went back in the skin of the ship out of fear then came back out about ten minutes later and just breathed. The most terrifyingly amazing aspect of the calmness was seeing the details of the clouds in the ocean then the occasional ripple. Felt like I had crossed dimensions into a heaven I was not supposed to see.",
   "created_utc": 1699334153,
   "score": 150,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85x0hy",
   "message": "Drunk Crewboat captain ran into unmanned oil platform 20 miles away. Lit up the sky like the sun was rising but at 2 am",
   "created_utc": 1699325735,
   "score": 145,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86dr3y",
   "message": "I posted this story a few other times. I was in the navy, sailing the black sea. We were far off the coast and I was watching the stars, chatting with a colleague of mine. It was late in the night. We noticed three stars moving from one side of the sky to the other, really fast. They were perfect aligned, forming a triangular shape. They were far from each other but moving in perfect synchrony. The moment they disappeared in the far end of the sky, a fourth star went after them, closing the shape as it was a rhombus. The fourth star was the fastest thing I have ever seen.\nTo this day I have no idea of what we saw.",
   "created_utc": 1699333842,
   "score": 74,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85x008",
   "message": "Worked for Disney Cruise and saw Goofy playfully grab the character attendant’s breasts right before going on stage with kids.",
   "created_utc": 1699325730,
   "score": 100,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85n53l",
   "message": "Whales",
   "created_utc": 1699321654,
   "score": 246,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85kggx",
   "message": "It's not my whole career, but I've been out at sea.  Ironically, it's not the bodies of refugees in the water so much as boots, backpacks, etc. that have washed up on shore that stick with me.",
   "created_utc": 1699320548,
   "score": 71,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k861hoy",
   "message": "Nothing. Just miles and miles and miles of nothing. No lights, no towns, no mountains, no clouds, nothing.",
   "created_utc": 1699327668,
   "score": 132,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86awch",
   "message": "Not me, my dad in Nam.... Was on an aircraft carrier.  He said they were on the \"nets\" hanging off the side getting sun.  A plane comes in to land and they stand up with their heads above deck to watch the plane land.  As the plane comes in the stop cable breaks \u0026amp; in a second it snaps his friend's head clean off perched about a foot from him.  Head goes flying like a football into the water body drop into the net.  \n\nDad said they stopped the ship to \"attempt\" to find the head but zero chance.  More of a courtesy.",
   "created_utc": 1699332206,
   "score": 128,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k868wfh",
   "message": "I wouldn’t say it was creepy per say, but it was definitely strange. A while ago I used to work on a cruise line which meant I practically lived on a boat for the better part of a year. This is about the only phenomenon that still makes me scratch my head. \n\nWe were probably about 10-15 miles off the coast of Mexico, traveling between of the Caribbean islands. It was beginning to head towards the later hours of dusk and I was outside on one the walkways taking my break. I looked over the railing and against the horizon was this… black cloud. It was probably floating about 15 feet above the water, just kind of hovering in the air. \n\nThought at first it might’ve just been birds that had been displaced by a tropical storm, but after watching it for a little while the way the thing remained stagnant led me to believe otherwise. Usually with birds there tends to a bit of a wave with the hover pattern of the flock, but this thing hardly moved at all. In fact it didn’t move an inch as we passed it heading to our next destination which took probably around 10 minutes, and then an additional 5 for it to leave the line of sight completely. No movement at all. I took a quick picture of it and showed it to some of my coworkers later and none of them had any clue as to what it was either. Sadly that phone has long since passed.\n\nI never saw anything else like it.",
   "created_utc": 1699331146,
   "score": 63,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k85pmbl",
   "message": "Just watched a great thing about narco subs and that shit looks crazy but theres a whole industry of independent sub builders doing their thing trying to sell subs to drug cartels",
   "created_utc": 1699322668,
   "score": 3,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86blor",
   "message": "Ex Coast Guard here. Not creepy, but eerie. We'd be in the Caribbean and the water would be flat as glass, no wind, no movement except us. We'd stop and have swim call, but I never got in the water.",
   "created_utc": 1699332600,
   "score": 58,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86ec6p",
   "message": "Floes of ice passing by, covered in blood - then i remember that polar bears exist \n\nLegitimately though, calm water and flat light. You can’t see where the sea and sky split, it’s really dangerous for helicopters and generally unsettling",
   "created_utc": 1699334191,
   "score": 53,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86avan",
   "message": "Not creepy, but totally weird. \n2 Chinese boats, like small, old, fishing vessels, meeting up in the middle of the Atlantic Ocean like half a mile behind us.\n\nThis was so random, within international waters but so freaking far away from China, I still wonder what the hell they were doing there. They had no AIS. The first one to arrive close by, passed next to us as if to check who we were and if we were keeping course  (sailing vessel) and then went straight towards the other ship and mated. \n\nMaybe drug trafficking or maybe just fishing. But yeah, still pretty far away from their most likely official harbor and kind of weird. It was litteraly in the middle of the pond, around 10 degrees North of the equator, so not your typical fishing route.",
   "created_utc": 1699332189,
   "score": 51,
   "submission_id": "17pi027"
  },
  {
   "comment_id": "k86e3xs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17pi027"
  }
 ]
}