{
 "submission_id": "17pznbm",
 "title": "What “unforgivable” act by a celebrity did the public seem to forget too easily?",
 "selftext": "",
 "created_utc": 1699378537,
 "permalink": "/r/AskReddit/comments/17pznbm/what_unforgivable_act_by_a_celebrity_did_the/",
 "score": 1,
 "url": "https://www.reddit.com/r/AskReddit/comments/17pznbm/what_unforgivable_act_by_a_celebrity_did_the/",
 "comments": [
  {
   "comment_id": "k898pnh",
   "message": "ceelo green... the way he straight up admitted to raping people bc he thought it didn't 'count' if they were drugged?? it was so disillusioning to see him still get features/invites/media attention after that",
   "created_utc": 1699386242,
   "score": 55,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89d57k",
   "message": "Cee-Lo Green going viral with a new song on TikTok after drugging a woman, raping her and then saying “People who have really been raped REMEMBER!!!”",
   "created_utc": 1699387862,
   "score": 153,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k895c49",
   "message": "Soulja Boy beat a pregnant woman into having a miscarriage",
   "created_utc": 1699385030,
   "score": 80,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k8969ai",
   "message": "Richards, Robert H. IV\n\nThe heir to the estimated $14 billion fortune of the du Pont family, Richards was jailed in 2009 for abusing his three-year-old daughter sexually. In an attempt to clear his record, the billionaire offered to take a polygraph test; nevertheless, he failed the test and ultimately admitted to the accusations.\n\nHe could have faced a thirty-year jail sentence, but his attorneys managed to have the accusation reduced to fourth degree rape, earning him an eight-year sentence instead. But the court decided that he wouldn't “fare well” in jail, so they suspended his sentence and released him on probation.",
   "created_utc": 1699385362,
   "score": 98,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k895e76",
   "message": "Floy Mayweather beat the shit out of his former girlfriend, and got away with it because the judge allowed him to train for a fight he was headlining.",
   "created_utc": 1699385050,
   "score": 21,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k895a1j",
   "message": "Boy George abducted \u0026amp; tortured a man in 2007.",
   "created_utc": 1699385009,
   "score": 100,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k899iju",
   "message": "Film reviewer, journalist, and executive in the film business: Philip Berk. assaulted Brendan Fraser sexually, but he was spared since he claimed it was all in joke and had no sexual intent. If any of us had raised that defence, we would have all been imprisoned underground.",
   "created_utc": 1699386546,
   "score": 40,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89i90j",
   "message": "Why the fuck does Chris Brown still have a career",
   "created_utc": 1699389715,
   "score": 58,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89e46h",
   "message": "He got his comeuppance now, but R. Kelly in the early 2000s peeing on a 15 year old girl and recording it. People seemingly forgot and forgave him so quickly, Boondocks did an entire episode about it.",
   "created_utc": 1699388213,
   "score": 134,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89i7r5",
   "message": " John travolta denying his son medical treatment. Then his son dying from sudep\n\nhttps://www.reuters.com/article/idUKN05399200\n\nhttps://www.mercurynews.com/2019/01/24/john-travolta-and-kelly-preston-praise-scientology-on-10-year-anniversary-of-sons-death/",
   "created_utc": 1699389703,
   "score": 97,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k896b8b",
   "message": "After reading the comments, I feel like I’ve been living under a rock. Disgusting world we live in!",
   "created_utc": 1699385382,
   "score": 111,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89anqc",
   "message": "it's weird how Roman Polanski drugged and anally raped a 13 year old girl, then fled the country to avoid prison, and Hollywood basically said \"that's fine\".  \n\nIt wasn't until 43 years later that the Motion Picture Academy finally expelled him after deciding child rape was no longer ok.  but for decades Hollywood actors, industry executives, and award committees ignored the fact that he was a fugitive rapist and even signed letters of support for him.",
   "created_utc": 1699386957,
   "score": 205,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k88oxqv",
   "message": "Chuck Berry has been lauded as the \"King of Rock n Roll.\"\n\nHe's also a voyeuristic sicko who installed hidden cameras within the womens' restroom of his restaurant. In his even younger days, he also did time for transporting a 14 year old girl across state lines for sex.",
   "created_utc": 1699379191,
   "score": 167,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89rjrj",
   "message": "Nicki Minaj supporting her rapist husband and rapist brother, trying to keep her brother from going to prison by harassing his victim with her family. Absolute trash",
   "created_utc": 1699393047,
   "score": 83,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k898x41",
   "message": "28 year old Jimmy Page in a relationship’ with a 13 year old.",
   "created_utc": 1699386318,
   "score": 217,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89dkcc",
   "message": "I’ve seen a new rise in awareness surrounding it in the last couple years, but for like 30 years no one talked about how Karl Malone knocked up a 13 year old while he was in college. \n\nEDIT: Originally thought thought it was when he was in the NBA.",
   "created_utc": 1699388015,
   "score": 132,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k898lmd",
   "message": "[removed]",
   "created_utc": 1699386200,
   "score": 109,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k896nh9",
   "message": "Jack Nicholson beat a sex worker so bad in the 90s that she suffered permanent injuries.",
   "created_utc": 1699385504,
   "score": 201,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k88yfhb",
   "message": "People seem to really seem to ignore how many musicians from the 60s, 70s, and 80s were blatantly taking advantage of children. Especially the musicians that are popular enough to basically be memes. That stuff probably wouldn't fly today, considering how Drake's texts are seen by the public, but I'm always surprised it isn't brought up more.",
   "created_utc": 1699382543,
   "score": 0,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89520q",
   "message": "Remember when a 16yo girl overdosed in Don Henley's house, he pled guilty to minor misdemeanor charges and then wrote a song about how mean the media was to him?\n\nBecause I feel like almost no one does.",
   "created_utc": 1699384932,
   "score": 176,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k8a38zn",
   "message": "Ted Kennedy after [rolling his car off a bridge and leaving a young woman trapped in it to drown, and not bothering to report the incident until the next morning](https://en.wikipedia.org/wiki/Chappaquiddick_incident).",
   "created_utc": 1699397360,
   "score": 171,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k88ncfl",
   "message": "Chris brown beating up Rihana",
   "created_utc": 1699378626,
   "score": 230,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89j4ag",
   "message": "The current First Lady of France, Brigitte Macron, literally groomed her own husband when he was a 15 year old boy and she was in her 40s. She was his schoolteacher and acted extremely unprofessionally when she started sleeping with her own underage student. The boy Emmanuel's parents told her to stay away from their son. As they did not appreciate a 40 year old woman preying on their 15 year old boy. She didn't care. She continued grooming poor Emmanuel and even pressured him into marrying her.\n\nNobody is talking about this. Apparently it's considered \"okay\" by many people in France because \"they love each other\" because \"look he married her when he was an adult\".\n\nBoys can get groomed too. No this was never ok. Emmanuel Macron is a victim of grooming and possibly CSA.",
   "created_utc": 1699390030,
   "score": 208,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k895qn7",
   "message": "Shocked by the lack of mentions to Jared Leto thus far.",
   "created_utc": 1699385175,
   "score": 157,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89u4cv",
   "message": "Luc Besson\n\nBesson's second wife was actress and director Maïwenn Le Besco, whom he started dating when he was 32 and she was 15.[25] They married in late 1992 when Le Besco, 16, was pregnant with their daughter Shanna, who was born on 3 January 1993.[26] Le Besco later claimed that their relationship inspired Besson's film Léon (1994), where the plot involved the emotional relationship between an adult man and a 12-year-old girl.[25] Their marriage ended in 1997, when Besson became involved with actress Milla Jovovich during the filming of The Fifth Element.\n\nRoman Polanski\n\nOn March 10, 1977, 43-year-old film director Roman Polanski was arrested and charged in Los Angeles with six offenses against Samantha Gailey (now Geimer),[2] a 13-year-old girl:[3] unlawful sexual intercourse with a minor, rape by use of drugs, perversion, sodomy, a lewd and lascivious act upon a child under the age of 14, and furnishing a controlled substance to a minor. At his arraignment, Polanski pleaded not guilty to all charges[4] but later accepted a plea bargain whose terms included dismissal of the five more serious charges in exchange for a guilty plea to the lesser charge of engaging in unlawful sexual intercourse with a minor.[5]\n\nPolanski underwent a court-ordered psychiatric evaluation,[6] and he was placed on probation.[7] However, upon learning that he was likely to face imprisonment and subsequent deportation,[8][9] Polanski became a fugitive from justice, fleeing to England and then France in February 1978, hours before he was due to be formally sentenced.[10] Since then, Polanski has mostly lived in France and has avoided visiting any countries likely to extradite him to the United States.\n\n(But none of this stopped Hollywood from giving him a standing ovation at the Academy Awards in recent years)",
   "created_utc": 1699393965,
   "score": 104,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89k3dd",
   "message": "Dr. Dre hitting female reporter Dee Barns in the face and attempting to throw her down a flight of stairs.",
   "created_utc": 1699390377,
   "score": 69,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k897i3x",
   "message": "Didn't Corey Feldman say Charlie Sheen sexually abused him?\n\nI feel like that kinda just died and nobody remembers or did anything about it.",
   "created_utc": 1699385812,
   "score": 131,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89edsm",
   "message": "Tupac dropped his gun and killed a 6 year old, and gang raped a woman.",
   "created_utc": 1699388311,
   "score": 190,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k88npei",
   "message": "Vince McMahon being found out to have given something like $15 million dollars in hush money to women he raped",
   "created_utc": 1699378753,
   "score": 163,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89xhih",
   "message": "How Chris Brown hasn't been completely shunned by society is beyond me.\n\nHe fully attempted to kill Rihanna, and people still fawn over him because he has an alright voice.\n\nComplete and utter gutter cunt",
   "created_utc": 1699395196,
   "score": 82,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89f05n",
   "message": "John Landis got two children and Vic Morrow killed while filming a segment of *Twilight Zone: The Movie*. He was breaking child labor laws by having the kids on set in the first place, and according to their parents, never told them that they'd be near explosives or the helicopter.\n\nHis next movie was *Trading Places*, which made a mint, and he also directed Michael Jackson's \"Thriller\" video, so he was not criminally convicted and he did not take much of a hit to his career.",
   "created_utc": 1699388539,
   "score": 193,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89a3wa",
   "message": "Director and child rapist Roman Polanski.\n\nHe romanced a 15-year-old at 43, then raped a 13-year-old, pled guilty to it, fled France to avoid prison, and has been on the run ever since--still working, still getting awards and praise.",
   "created_utc": 1699386763,
   "score": 129,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k898e59",
   "message": "Caitlyn Jenner killed someone",
   "created_utc": 1699386125,
   "score": 118,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89bxrs",
   "message": "Too many pedophiles and rapists to list at this point...",
   "created_utc": 1699387421,
   "score": 242,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k894o42",
   "message": "David Letterman had a bedroom installed at his studio so he could have sex with interns, and so he could cheat without his wife finding out.",
   "created_utc": 1699384793,
   "score": 204,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k8981h5",
   "message": "Jack Nicholson severely battered a prostitute he hired, causing permanent brain damage.",
   "created_utc": 1699386002,
   "score": 42,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k8968wb",
   "message": "Travis Scott. So many people died and he knew. Everyone suddenly just forgot ?",
   "created_utc": 1699385358,
   "score": 48,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k896bz9",
   "message": "Everything Charlie sheen did",
   "created_utc": 1699385389,
   "score": 25,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89g7lt",
   "message": "Tom Cruise being a member of a cult that disappears people",
   "created_utc": 1699388974,
   "score": 52,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89s8eg",
   "message": "Vince Neil of Motley Crue knowingly drove drunk, high, and sleep deprived after a 3 day bender and killed his good friend and roadie Razzle Dingley. They were on their way back from a liquor run. Dingley was holding dozens of bottles of liquor on his lap. Neil lost control of the car and veered into oncoming traffic going 65 in a 25mph zone. He’d been awake for 3 days, taking enormous quantities of cocaine, and blew a .17 bac at the scene. \n\nHe was given a fine and served 15 days of a 30 day sentence.",
   "created_utc": 1699393290,
   "score": 236,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k894aba",
   "message": "Anthony Kiedis of the Red Hot Chili Peppers openly admitting to SAing a 14 year old while in his 20s with no repercussions and being charged with Sexual Battery in ‘89(?), only to pay fines and no other repercussions. There is a plethora of other accusations against him as well. \n\nHis birthday just passed and it seems he is loved as ever by almost everyone.",
   "created_utc": 1699384650,
   "score": 162,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89aobb",
   "message": "Never meet your heroes everyone",
   "created_utc": 1699386962,
   "score": 240,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89gokk",
   "message": "Tyreek Hill. Extremely popular NFL player who threw his pregnant girlfriend across a room",
   "created_utc": 1699389146,
   "score": 175,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k896kzs",
   "message": "Tupac raped someone and served time for it.",
   "created_utc": 1699385480,
   "score": 181,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89hhf4",
   "message": "Chris Brown beat the shit out of Rihanna and people still love him and buy his music and I have no idea why",
   "created_utc": 1699389437,
   "score": 16,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k892g3c",
   "message": "The world seemed to look past Kobe's transgressions real fast when his helo crashed to the ground.",
   "created_utc": 1699383970,
   "score": 35,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k896fzj",
   "message": "Chris Brown.\n\nEdit: Lil story for y’all. \n\nSo I was working in a pretty shitty law office and I had this beautiful coworker (doesn’t really matter, but I’m a male). \n\nAnywho, one day she starts talking about how she watched this Chris Brown documentary and how *he* was actually the victim..not the girl(s) whom he abused and bragged about. \n\nI said something like “um..didn’t he abuse Rihanna and literally get a tattoo of her black and blue face on himself..?”\n\nShe responded with some fluff about he’s the victim. The next day she said some guy hollered at her from his car while she was getting lunch and he was “just her type”. \n\nNever looked at her the same way after the Chris Brown comments, but being into some dude yelling at her from his car just cemented it.",
   "created_utc": 1699385429,
   "score": 223,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89e4fu",
   "message": "Just Eric Clapton in general.",
   "created_utc": 1699388216,
   "score": 35,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89aldo",
   "message": "James Franco. I'm shocked by the amount of people who still defend him.",
   "created_utc": 1699386933,
   "score": 111,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89l2c7",
   "message": "The many Rock n Roll pedophiles over the years. Jerry Lee Lewis, Elvis, Jimmy Page, Steven Tyler to name a few. All had penchants for 14 yo or so  girls whom many of their parents willingly allowed their girls to go off with these grown men.",
   "created_utc": 1699390724,
   "score": 201,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89alzi",
   "message": "Truly\nWhy is James Charles still famous?",
   "created_utc": 1699386939,
   "score": 136,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k8a1lp6",
   "message": "Shia LeBouf is a violent alcoholic who has been arrested multiple times, usually for attacking people. \n\nOne time he had to be muzzled during an arrest because he wouldn't stop spitting on everyone. \n\nDuring another arrest, he accused the African American police officer for arresting him \"for being white\" and told the officer he was going to hell for being black. \n\nHe's currently facing a lawsuit for assaulting multiple women.",
   "created_utc": 1699396732,
   "score": 25,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89fabr",
   "message": "Stone Cold Steve Austin beat the shit out of his wife, Debra 20 years ago. He’s still a beloved figure in wrestling, that everyone gets excited to see.",
   "created_utc": 1699388641,
   "score": 214,
   "submission_id": "17pznbm"
  },
  {
   "comment_id": "k89wkgr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17pznbm"
  }
 ]
}