{
 "submission_id": "17q88f1",
 "title": "What did you see happen in the hospital waiting room?",
 "selftext": "",
 "created_utc": 1699400852,
 "permalink": "/r/AskReddit/comments/17q88f1/what_did_you_see_happen_in_the_hospital_waiting/",
 "score": 141,
 "url": "https://www.reddit.com/r/AskReddit/comments/17q88f1/what_did_you_see_happen_in_the_hospital_waiting/",
 "comments": [
  {
   "comment_id": "k8awldg",
   "message": "Like 20 years ago waiting in the ER I see a guy dressed up as a full Monkey being wheeled on a stretcher past a large doorway and then 3 other monkeys following him. They were performers from the Live Lion King Show at Animal Kingdom.",
   "created_utc": 1699409347,
   "score": 95,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8an0su",
   "message": "It's tame compared to all your stories, but I was in the emergency waiting room with my Mom. I was the one with an emergency and was drowsy the whole time, but I remember that at some point a man was wheeled into the room while making throat noises (think the Grudge) and my Mom took my face in her hands and told me, very calmy and without an inch of panic in her voice, to look through the window and tell her what that weird tree was because she'd never seen one like that (she definitely had). I had no idea what was going on so I kept staring at that tree, and then it was my turn so we left the waiting room.\n\nDays later she told me that the man who was wheeled into the room had one of his legs hanging on for dear life and that there was blood everywhere on his pants, but also on his clothes. He was drunk so he probably had a fight. I hope he's okay now. \n\nMy Mom is the best. She was worried and didn't want me to see this. So she took in the sight but protected me from it. Sometimes, I think we don't deserve Moms.",
   "created_utc": 1699405383,
   "score": 79,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aoqnw",
   "message": "Cat walked in once. Shamelessly caught everyone's attention. Maybe due to how long we were kept waiting but a few of us jumped at the chance to grab the cats' attention.",
   "created_utc": 1699406096,
   "score": 115,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8axkok",
   "message": "I work as a nurse in the emergency, I’ve seen some crazy things. But on a lighter note, while security was busy doing two separate take downs an old guy dressed up like Santa unzipped his backpack and started handing out beers to everyone in the waiting room",
   "created_utc": 1699409758,
   "score": 43,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aqdv2",
   "message": "I saw a very pregnant woman walk herself into the waiting room unable to talk because she was shot in the head. One of the worst things I’ve ever witnessed.",
   "created_utc": 1699406771,
   "score": 167,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8atiis",
   "message": "My doctor hired her son to be a receptionist. He announced a woman’s STD tests in the lobby. He didn’t work there long.",
   "created_utc": 1699408069,
   "score": 122,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ax7g4",
   "message": "I’ll never forget it. I went to the ER with a kidney stone and there was an old couple sitting across from me probably in their 60’s or 70’s. The lady was bickering to the man complaining about how long they’ve been there. The only thing is that this woman was completely purple. Like all of her face and head was this dark purple. She didn’t appear to be in any pain but my fuck was she ever purple.",
   "created_utc": 1699409604,
   "score": 103,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8atiqn",
   "message": "I was sitting in the ER waiting room and this young couple comes in. The man pushing his girlfriend in a wheel chair. She’s barely conscious, slumped over and pale. As the boyfriend is checking her in, she wakes ups and Exorcist-style projectile vomits onto the floor. Nurses rush her back. The boyfriend then sits down and not a minute passes before out of nowhere he does the same! Everyone waiting slapped masks on real quick once that happened.",
   "created_utc": 1699408072,
   "score": 60,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ac8d7",
   "message": "I once saw a guy cut himself with a piece of broken glass to be seen sooner by the nurses during triage.",
   "created_utc": 1699400940,
   "score": 245,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ad60l",
   "message": "A doctor going from patient to patient asking them health questions, symptoms and so on. She did this for an hour until there was a code white announcement. 2 orderly's and a 2 security guards surrounded her and hauled her off. She was not a doctor after all..",
   "created_utc": 1699401319,
   "score": 19,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8am1ry",
   "message": "I worked at an ER where a guy pulled out a knife in the waiting room and started stabbing himself. When security got to him they found that the knife had a dulled, rounded tip",
   "created_utc": 1699404982,
   "score": 229,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8apxwa",
   "message": "Watched a guy fake passing out so he didn’t have to wait, since there were a lot of people waiting.  Asshole winked at me as he was wheeled back on a gurney.",
   "created_utc": 1699406589,
   "score": 89,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8atwif",
   "message": "I took an employee with kidney stones to the ER one time. While sitting in the waiting room, a guy came in with chest pains. He was taken back for immediate treatment. And then came the rest of his crew. He had been at a potluck picnic when it happened. And they brought the whole dang thing to the hospital. Like 40 people with casserole dishes and meat trays and such. Only disappointing thing was they didn’t invite me to eat.",
   "created_utc": 1699408231,
   "score": 210,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aqu2o",
   "message": "Doctor came out and told the woman next to me that her (the woman’s) husband was addicted to opioids. The woman just broke down crying. \n\nI didn’t know if I should’ve tried to comfort her and tell her it’s okay, my brother was addicted too and he’s fine now (actually it killed him), or pretend I hadn’t heard and just mind my own business and not embarrass her. I minded my own business.",
   "created_utc": 1699406960,
   "score": 85,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8apqdy",
   "message": "Fell off my bike and fractured both bones in my wrist, while at camp. While in the waiting room a boy and girl both in Wendy’s outfits, boy holding a very bloody towel around his hand and her holding a back of ice. I kid you not his line was, “so after they reattach my finger, do you wanna grab a bite to eat?” Then a bunch of cops come in escorting a man in full prison jumpsuit with the arm and leg cuffs bleeding profusely from his head.  Quite the crazy experience!",
   "created_utc": 1699406504,
   "score": 229,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aueh2",
   "message": "This is pretty tame but early ‘00s. \n\n I was in college and my grandmother spiked a fever (immuno compromised due to lymphoma) so my mom and I took her into her preferred ER in town. It’s not quite last call so the lobby is pretty dead for a weekend while the 3 of us wait. \n\nSuddenly I hear my name booming from by the doors, a friend from school is being brought in by *his* buddies because he’s so skunked they think it may be alcohol poisoning. \n\nSo I ended up introducing my feverish late 80’s grandmother to my very drunk school friends while we all waited our turn.\n\n Amazingly she quite liked them and they asked about her Monday 🤣",
   "created_utc": 1699408437,
   "score": 224,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8asx9c",
   "message": "My husband had just had a major seizure out of the blue in the middle of the night and was taken to the ER in an ambulance. He left the house still seizing. I was waiting to find out what was happening to him and was in complete shock. Sitting in the chairs just across from me there was a lady with a lot of bags just talking and talking away on the phone that was on the wall. I don’t even know what she was saying, I was too out of it to even comprehend. She hangs up the receiver.  Gathers up her bags. Walks to the front desk. And asks what the code to call out is. The nurse tells her she won’t tell her again that she can’t use that phone. So the lady sits down, picks up the receiver, and starts talking away again.",
   "created_utc": 1699407826,
   "score": 77,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b1gdh",
   "message": "I watched a robot filing cabinet press the elevator button and guide itself to a different area of the hospital.",
   "created_utc": 1699411402,
   "score": 69,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8avy8m",
   "message": "Girl trying to get admitted to the mental health unit, turns out her boyfriend was a patient. She didn't get admitted, she wasn't happy about it but she left.\n\nNext thing we know there's a car doing donuts just outside of the ER entrance, she was throwing things out the window and screaming \"am I crazy enough now?\"\n\nShe ends up driving around to the other side of the hospital and driving right through some sliding glass doors. She's lucky she didn't kill someone, another 10 feet and she would have crashed over a railing and into the cafeteria below, where staff was napping on a couch.\n\nDefinitely got carted away, but not to where she wanted to go.",
   "created_utc": 1699409078,
   "score": 92,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8bbzoc",
   "message": "over the summer i popped a rib out of place (literally wasn’t doing anything, just breathed wrong and my chronic illness apparently wasn’t a fan of that)\nmy mother took me to the ER after she heard me yelling for her in the living room unable to move or breathe. when we go there they took me back for an ECHO because i couldn’t breathe+pain in the chest and back concerned them, and when i got back to the waiting room a man came up to my mom and I. \nhe seemed like he was hurting pretty bad too, in a wheelchair (i’m assuming broken leg)\n\nfor context, i’m 20, i had been in the ER at this point for 45+ minutes, crying due to the pain the whole time and unable to move more than just a few inches at a time, it was storming bad, it was freezing in the ER, and i was terrified. i have never felt this much pain in my life. \nthis man looked to be around 50-60. \n\nthis man came up to me, told me his wife was on the way with a blanket (after we had already asked for one and the woman at the counter said they couldn’t bring the blankets into the waiting rooms) and asked my mother and i if we would both take his hands and his wife’s when she got back. \nA few minutes later, his wife walked through with a walmart bag that had a blanket and some fuzzy socks (there was a walmart across the street). they took our hands and he looked me in the eyes. he told me i was going to be okay. he told me that he believes there is a higher power in the universe watching over everyone, and that it didn’t seem like i deserved this pain. he told me that in this moment, I am the only thing that matters to this power. that every god known to man is working together to make sure i get through this. he walked me through some slow breaths, told me a story about his daughter to help take my mind off of the pain, and told me that all i need to do until they call me back, is focus on staying calm and getting through it. \n\nhe helped me so much. that man and his wife were so kind for no reason. i had never felt so cared about by a stranger. i hope he’s doing okay. i hope you all are doing okay",
   "created_utc": 1699416252,
   "score": 48,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aowhm",
   "message": "Urgent care, sitting in the waiting room trying not to cough my face off from bronchitis. Woman comes in, bypasses the \"take a number\" stanchion, goes right to the window and demands to be seen. Receptionist tells her to take a number and a seat.\n\n\"Can you BELIEVE her?! She told me to TAKE A SEAT. I NEED TO BE SEEN NOW.\" \n\nHer number was eventually called, she went to the desk, stated her complaint. They logged her in and asked her again to take a seat and she'd be called back when it's her turn. \n\nShe then spends her entire wait bitching about having to wait, and then says, \"I bet if I go cough in her face I'll be seen faster.\"\n\nYeah, lady, by the police and the CDC. \n\nThen she says she should have gone to the ER to be seen faster. Lady, you have enough health to be sitting upright and bitching your face off. You'll be triaged and made to wait there too, for 10x the cost. \n\nTHEN... she starts asking everyone why they're there and one-upping everyone's illnesses. Asking how long they've been waiting. Offering to pay to cut the line. \n\nMeanwhile, there was a 4 year old girl who was coughing as bad as I was, but was so polite and quiet and minding her own business...\n\nI was never so glad to get called out of that waiting room!",
   "created_utc": 1699406162,
   "score": 202,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8akkfz",
   "message": "Someone tried to call an ambulance from the A\u0026amp;E because they thought it would make them get seen quicker.",
   "created_utc": 1699404373,
   "score": 88,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aufn1",
   "message": "I work in IT at a hospital. We were replacing a wireless access point on the ceiling in the ER. Guy waiting starts screaming “what the fuck are you doing!?” At my guy on the ladder. My guy calmly explains we’re just replacing some equipment, but that just makes the waiting room guy more pissed and he gets up looks like he is about to charge at us. Security guards dash over and threaten to kick him out, all was relatively peaceful after that. Although the AP we needed to replace on the other side of the room was above a lady who reeked of urine, so I’m not sure which one was worse.\n\nLater we were replacing one in the inside waiting room and there was a page that a stabbing victim was coming in. Overheard the nurses saying, “WTF, it is way too early in the day for stabbing victims” “Well you know what they say, ‘Sun’s out, guns out’”. Made me laugh.",
   "created_utc": 1699408450,
   "score": 82,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8avgc5",
   "message": "When my wife was going through chemo, she got a fever once after a round. We ran to the nearest emergency room to get assistance and while waiting an older man started playing porn on his phone. Well, the sound was at full blast and he frantically trying to turn the volume down.",
   "created_utc": 1699408867,
   "score": 167,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aqocd",
   "message": "Getting off of my shift at the hospital I worked at I was heading to the parking lot by the ER.\n\nAll I heard was this woman screaming \"If you love me you won't leave!!!\" at the top of her lungs.\n\nSeconds later there was a screeching of tires and a car left the parking lot sideways in a cloud of smoke.\n\nMy buddy walking with me says \"I guess he doesn't love her.\"",
   "created_utc": 1699406894,
   "score": 104,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8av9m6",
   "message": "My moms favorite ER story (she spent a lot of time there with my dad as he fought drug and alcohol addiction on top of health issues) is when they were in an ER that was kind of an open concept, with just curtains for visual privacy. A couple beds in, there was a woman just moaning and screaming in pain. When the doctors went to see her and tell her what was wrong, the woman was moaning so loudly they had to yell “YOU ARE LITERALLY FULL OF POOP!” loud enough for the whole department to hear. The woman promptly quieted down.",
   "created_utc": 1699408791,
   "score": 54,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8amuwc",
   "message": "A stabbing victim gets wheeled through and tries to show me his wound. This was at like 11 am in the Bronx",
   "created_utc": 1699405315,
   "score": 160,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ax278",
   "message": "A major celebrity brought a worker in to the Emergency Room from his orchard and waited in the waiting room while we worked on his employee.  The celebrity was so gracious and kind to everyone who approached him, once we saw he was being approached we found him somewhere private to wait.  He was just worried about the guy who worked for him.",
   "created_utc": 1699409542,
   "score": 174,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ae062",
   "message": "I went to urgent care for a cortisone shot for allergic reaction, and while there, I saw a guy bring his side piece there for something bloody(couldn't tell what happened just saw big amount of blood on girl's top)\n\nAnd the nurse at the front desk was wife and she threw a fit and started screaming and hitting the guy. She was screeching and swinging on him like a hurricane. \"N-word you brought that skank into my job?!\" And other variations of calling the bloody girl a mistress were a few I could remember.\n\nThey made the front desk lady go into the back, they made the guy sit on the benches outside the building, and they took the bloody girl to care for her",
   "created_utc": 1699401663,
   "score": 110,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aq8sz",
   "message": "Doctors’ waiting room. A young woman (18 years-ish) is obviously ill. Sweating profusely, jaundice skin, doubled over, and limping to the front desk. She’s holding a white plastic kitchen garbage bag from the red ties at the top. The bag is filled at the bottom with dark yellow liquid. She held it up when the receptionist asked if she had brought in her urine sample.",
   "created_utc": 1699406713,
   "score": 77,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aqkuh",
   "message": "From my last visit it is a three way tie. I was in said waiting room for 12 hours. I saw a lot but these stick out.\n\nFirst the lady who kept intentionally sticking her finger down her throat to throw up. Over and over you'd hear her retch. Finally after a couple hours, she exhausted herself but then laid down in the puke. She had to be picked up and put in a wheelchair as she refused to get up and move.\n\nSecond was the really huge guy coming in for a blood clot per his loud phone conversation. Fell asleep mid eating and had sleep apnea. The best was his tweaker girlfriend would try to wake him up by giving him a handjob. When that was unsuccessful, she went through his wallet.\n\nThird was the obvious frequent flyer homeless man who created a small nest in a corner and went to sleep. After about 2 hours, security came over to wake him up by his name and tell him it's time to go. He promptly stood up, farted very loudly and left a huge mess as he left.",
   "created_utc": 1699406853,
   "score": 194,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b2b6z",
   "message": "Grandma brought her 19 year old grandson in with his 19 year old girlfriend.   He tried added a stainless steel cockring into his sex life and was apparently wrong about the size. \n\nGrandma was half laying into them for being dumb,  and half busting their balls.",
   "created_utc": 1699411770,
   "score": 163,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ayvfr",
   "message": "As a child, went to the emergency room for my dad. He was ok, but while waiting a guy burst in with a woman on either side of him holding him up. Everyone is screaming and I see why....guys foot was half gone. He was mowing the lawn in socks. They took him in immediately and one of the women ran into the restroom to vomit. A few minutes later hear the guy screaming as they took him down the hall. \n\nStill remember it decades later.",
   "created_utc": 1699410305,
   "score": 161,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b1r99",
   "message": "A person came with a high blood pressure his mom and pulled him in a wheelchair into the waiting room and his mom said to him that she will fill the form and come back to him he said fine and just lowered his head and passed away I was just shocked out of my wits",
   "created_utc": 1699411530,
   "score": 157,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ankw5",
   "message": "I saw an ambulance bring in a guy who drilled through a 2x4 while the wood was in his lap. Needless to say the power drill did its job and then some. Went through the wood then through his wood. He had the drill and 2x4 stuck to his bloody groin while screaming. The kicker of it all, he wasnt the most attractive person on the planet but his wife could've been a model. I found this out talking to the paramedic afterwards. Hope they saved his mangled member.",
   "created_utc": 1699405616,
   "score": 176,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aj5ua",
   "message": "All at the same time: family come pouring in following a stretcher being rushed through, all screaming and yelling that someone shot their baby, a grandmother (guess) holding a toddler horizontally so she could pee into an open trash can, and a dog tied to an ashtray outside snapping and wailing every time the door opened, spilling ashes everywhere. I was just there for 4 stitches in my head. I just took them out myself at a bar rather than go back there. It was Woodhull Hospital in Brooklyn in 2002. Good times…",
   "created_utc": 1699403796,
   "score": 101,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8az28k",
   "message": "Saturday night, 2:30am.  I’m in the waiting room at the hospital with incredible stomach pain.  I look around at a room full of haggard looking people holding their heads.  I’m practically keeling over, clutching my guts in a heavy sweat when a staff member brings me to the attention of someone who rushes me to a wheelchair to take me in.\n\nAll the junkies in the waiting room stopped holding their heads and grabbed their stomachs and started rocking back and forth like I was.  If my appendix hadn’t just blown, it would have been hilarious.",
   "created_utc": 1699410385,
   "score": 157,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8asgpy",
   "message": "Dude rushed into the overcrowded ER waiting room with his hand wrapped in a bloody towel; he was screaming in pain and shouting that he had been caught in a wood chipper on the job.\n\nDefinitely wasn’t chipper after that, let me tell ya.",
   "created_utc": 1699407634,
   "score": 175,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ayle5",
   "message": "I held a woman’s hand as she delivered a baby right after walking into the ER. I was there with my son who was 8 at the time. And that’s how my son learned where babies come from. He told me afterwards that he always thought they came out of the belly button lol. Mom and baby were totally fine. It was pretty amazing.",
   "created_utc": 1699410189,
   "score": 3,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aw50h",
   "message": "Paramedic here, I’ve told some of these before but here we go:\n \nA man, 4 point restrained, being aggressively fellated by another patient, who subsequently ended up restrained. \n\nA one legged psych patient chasing a nurse swinging his prosthetic leg at her quite adeptly. \n\nWall to wall suburban white blonde teenagers tied down still trying to fight the restraints and sedatives following a Bieber concert at a major venue in my area.  \n\nA dozen or so women in bikinis and butterfly costumes after a bunch of people at J’ouvert got maced and the fight reignited in the ER.  \n\nMy all time favorite human rolling herself out of the bathroom in her wheelchair, actively hitting. A crack pipe cackling with laughter at the fight that had broken out between a drunk dude and a nurse. \n\nThe curtain being pulled before hospital security restrained a woman who was yelling “really!? Really!? You’re gonna put your hands on a drunk pregnant woman like that!?”",
   "created_utc": 1699409156,
   "score": 108,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b1mby",
   "message": "I see this one kid, a teenager of maybe 17, come in with his parents. He’s looking pretty bad, with a black eye and a split lip and suffering at least some degree of concussion. He refuses to tell his parents what happened, just saying “I can explain later” or “I don’t want to talk about it”.\n\nA few minutes later a guy a little older, maybe 18 or 19, comes in limping heavily and having to be supported by his friend as he enters. Looks around for a seat, sees the first guy, and yells “That’s the motherfucker right there!”\n\nHis friend sprints at the younger kid, gets tackled by security and zip-tied, it takes nearly every security guard on the floor keeping them separated because apparently already being in the ER wasn’t enough they wanted to go another round.",
   "created_utc": 1699411472,
   "score": 123,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8axub2",
   "message": "When I was roughly 11 years old, my parents and I ended up in the emergency room of one of the larger hospitals in the city due to a family emergency. This was my first experience in a city emergency room and it was much more chaotic than the country ERs (obviously).\n\nHowever, mom and dad needed to speak with the medical professionals without a precocious 11-year-old listening, so my dad instructed me to sit in the waiting/triage area and he vaguely gestured behind me.\n\nI sat down in the red triage area, trying to stay in view of the hallway so my parents could find me, and then looked up to observe my surroundings.\n\nAcross from me was a 30-something man, his swollen face is bloodied as well as his clothing and his entire head is bandaged – wrapped tightly around his forehead to the back, and over and under his chin. A rather large butcher knife is protruding from the left side of his head, with the handle pointed straight to the ceiling and the blade edge facing away from me. The knife is firmly wrapped to the side of his head, and I’m guessing, keeping his ear in place. I can also see fresh blood slowly wicking through the bandages.\n\nThe man is sitting with his legs crossed and is casually reading a magazine. The knife wobbled slightly as he turned his face from page to page and he seemed particularly unconcerned there is a knife stuck in his head. I don’t recall much thought processes regarding this situation, other than a flood of questions that I was holding back.\n\nDad came around the corner to collect me and followed my fascinated stare, jumped slightly at the sight of the stabbed man and hauled me out of there pretty quick.\n\nThus, my first introduction to a city ER in a sketchy part of town.",
   "created_utc": 1699409871,
   "score": 227,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8azonl",
   "message": "Does the bathroom count?  I am a Nurse.  Patient was admitted.  Taken into the back to be triaged, blood pressure, initial assessment, etc.  Patient asked to go to bathroom.  Hear a gunshot in the bathroom.  Patient shot himself in the head.  The tiny bathroom was covered in red splatter and brain.",
   "created_utc": 1699410653,
   "score": 112,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b08u1",
   "message": "Once upon a time i was waiting on news of a friend who'd been in an accident. \n\nI saw a guy (about early twenties) come in with him mom because he'd fallen off of his roof and dislocated his shoulder. After about an hour of waiting his mom just says \"fuck it! this is taking too long!\" and legit began to google how to reset a shoulder. \n\nAfter about 5 mins of research, she took off her belt, folded it up and told him to bite down on it. She then proceeded to violently shove her son's shoulder back into the socket while he naturally screamed in agony. \n\nSecurity and nurses rush over to see what the commotion is and more or less need to pull her off of him. Security sits her down and the nurses take the poor kid and get him treated.",
   "created_utc": 1699410894,
   "score": 112,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b56wo",
   "message": "This just happened a couple of weeks ago. I was in the ER waiting room and there seem to be a lot of commotion over an elderly Asian woman who was sitting there with a large suitcase. Apparently her family just dropped her off there and she had no where to go. She was not ill and did not need medical attention. They abandoned her.They just left her like an unwanted puppy at the shelter. One of the saddest things I’ve seen.",
   "created_utc": 1699413038,
   "score": 107,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aw6yd",
   "message": "I saw a woman who just couldn't get comfortable because of severe constipation. She couldn't stand, sit, lay down or anything. She was moaning and crying like she was dying. I've never seen someone in that kind of agony before.",
   "created_utc": 1699409179,
   "score": 92,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b7xgt",
   "message": "I was like??? 13? I think? I forget why I was in the ER but I remember not feeling good at all. My hometown is a small rural Ohio town, great hospital but long wait times in the ER. So I had been there for about an hour and a half. My mom went to the bathroom and right after she left a lady was wheeled in in a wheelchair.\n\nRather obese woman with a very thick leg (looking back now I know it was Lymphedema) and I remember her leg looked like it was leaking fluid? The person who wheeled her in went to window to start the check in process and the woman was grumbling about her leg itching.\n\nShe bent over in the wheelchair, reached down, and her leg split. Liquid and what looked like fat busted out of her thigh and she screamed bloody murder. And like she had every right to that shit looked like it was agonizing. Immediately some nurses came out and whipped her into the back. When my mom came back asking what had happened I didn't even tell her just, \"I think we might be waiting a bit longer mom.\"\n\nI guess it's very rare, but apparently if you're not taking care of your lymphedema properly it can happen.",
   "created_utc": 1699414285,
   "score": 95,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aj84q",
   "message": "A lady laying down on the chairs, crying.\n\nIt was me.\n\nBecause I broke my tailbone in 2013",
   "created_utc": 1699403822,
   "score": 7,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b8ppf",
   "message": "Holy crap!!! I forgot I made this post because I was…well, bored in a hospital waiting room. I’m loving these stories.",
   "created_utc": 1699414659,
   "score": 93,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b4rhn",
   "message": "When I was in my early 20's I had a nasty staph infection I caught at work. Eventually I ended up having surgery because I was *this* close to losing part of my ankle tendon due to several pockets being right on it and the doctor basically rushing me into surgery unexpectedly. Before all of this though, the Air Force in its infinite wisdom decided they couldn't treat me on base and would just send me to the ER downtown however many times it would take to have them give me antibiotics to clear it up. Why, I don't know, but tax dollars at work right?\n\nAnyway one day I'm in there waiting to be seen when this older farmer looking guy walks right up to the front desk holding a small yeti style cup. This was before Yeti became big but that's what it looked like.\n\n\"Hey Ron\" said the nurse\n\n\"Hey Pearl\" said the farmer\n\n\"Brought your lunch today?\" asked the nurse\n\n\"Nope, it's just my fingers\" replied the farmer as he then held up his other hand that he had previously tucked away in his coat, wrapped in bloody rags. \"Damn machine got me again\"\n\nAnd that's when I realized that 1) There are some really tough dudes out there who can lose multiple fingers and drive themselves to the hospital in the same calm manner they would have going through the McDonalds drive thru and 2) Whatever machines he was operating, I would like to never be closer than 100' to them in my life.",
   "created_utc": 1699412847,
   "score": 183,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b6f44",
   "message": "A man walked in, maybe 30 years old. Totally calm, looked like your average Joe. I was sitting by the triage station, and he was there for feelings of wanting to harm himself and others. I want to add, he was super respectful the entire time. He communicated that his thoughts were scaring him and he was pleasant to the nurse. \n\nThe triage nurse was amazing. She was thanking him for coming in, being so sweet, so understanding, and there was no thick tension in the air, all because of how she handled it like a true professional. \n\nI wanted to comment this because, if you are feeling those feelings, you won't be ostracized for getting help. It says SO much about you for getting the help you need, and these healthcare professionals do NOT judge you for it. They WANT to help you and I have seen it first hand that day. ❤️",
   "created_utc": 1699413591,
   "score": 87,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8auqcm",
   "message": "Went to the er at 2am after puking up a whole lot of blood. Like a lot lot. Gf said yeah I would definitely go to the dr on Monday to get that checked out. I said hell nah I’m going to the ER. Was Saturday night and they were busy. Got checked in and waited all the while going into the bathroom to puke a bellyfull every 5 minutes it seemed like. I looked fine and told the nurse I was feeling faint and started sweating a lot. She said there’s just no room right now. I said I am losing a LOT of blood. She said we will let you know when it’s your turn. I said k but I’m boing to the bathroom and puking up blood a lot can I have one of those puke bags? She said yes and gave me one. Was a pretty big puke bag. I filled it 3/4 the way up in about 15 minutes and they came in with a wheelchair immediately and took me to the back. Emergency surgery to stitch up the tear in my stomach. I told the surgeon do what you can and if I die than I die no biggie. Dispatch papers said I was in critical condition but there were no beds in the icu. We’re going to do a blood transfusion but didn’t so I was low on blood for awhile after that. When I told the nurse I was feeling faint I just told myself I’m about to die… and it really wasn’t that bad",
   "created_utc": 1699408570,
   "score": 57,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b27ub",
   "message": "This is a second - hand story from my mom. I was a kid. I had horrible asthma as a kid, and was frequent flier in the ER for oxygen when my inhaler wasn't enough. I was in the waiting room, they had given me a portable oxygen tank in the meanwhile, and we waited. Mom went to go use the payphone to call my grandparents to check on my sisters. I was a really well-behaved child in public, and she trusted me to stay put. I'm sure she also asked someone to keep an eye on me. \n\nShe came back, I wasn't there. She immediately starts panicking and asked all the nurses she could see where the hell I went. \n\nTurns out some guy was brought in my ambulance who had a deadly strain of some contagious disease, the triage nurse realized he would need to pass right by the sick little kid on oxygen, and immediately grabbed me, threw me in a wheelchair, and promptly moved me halfway across the hospital where I wouldn't be at risk of infection. \n\nMom said she had never been so grateful and furious at the same time",
   "created_utc": 1699411731,
   "score": 164,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8acqx6",
   "message": "not as a patient, but my job was in the emergency room. one day a man with an OPEN HEAD WOUND (his head was literally crushed) got up from the couch, wandered to the toilet, locked himself in there, and then started smoking, because the smell of cigarettes was throughout the entire department. there were blood trails on his way... me and my friend, realizing the fucked up situation, first tried to peacefully persuade him to leave, but it didn’t work. they called the security. there was a lot of screaming and stuff. I literally had to break down the door. when the door was broken down, we found him sitting on the toilet with a cigarette in his mouth. absolutely everything was in the blood and his feces",
   "created_utc": 1699401149,
   "score": 225,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8az8j0",
   "message": "A panicked guy sitting with his girlfriend, holding a ziplock bag with the tip of one of his fingers inside.\n\nHer: “What are you going to do?”\n\nHim: “Well I’m NOT going to be a chef.”",
   "created_utc": 1699410459,
   "score": 67,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8as99p",
   "message": "Some guy that seemed to be having a mental health crisis was in the waiting room at this urgent care I went to a couple years back. The place was packed and I had to wait with an IV bag because I had a kidney infection. \n\nDude seemed to be having a rough time, pacing back and forth and making a lot of noise. He was trying to get placed in the psych ward. I’m not really sure what happened but it seemed to me since the way the staff treated him, he’d been there multiple times. He also could have been on drugs.",
   "created_utc": 1699407546,
   "score": 65,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8auwsc",
   "message": "I was waiting to be seen for a suspected allergy when two builders 'walked' in.\n\nI say 'walked' because what one of them was doing only vaguely resembled walking. Imagine you put your leg on the ground to take a step but the bottom part of your leg moves sideways across where your knee should be and then slides up alongside the upper part of your leg so that bones are now poking out. It wiggled like jelly when it was in the swing between steps.",
   "created_utc": 1699408643,
   "score": 128,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8bd2ah",
   "message": "I'm probably too late for people to read this, but I took my (young adult) son to ER because he was having a repeated issue with heart palpitations. It wasn't that serious, but his doctor wanted him to get a scan if it happened again.  \n\nWe were walking to the door of the ER and saw a minivan pull up with the people around it helping a woman into the hospital. She was sobbing, so we slowed down so she and her family could get in first.   \n\nIt became obvious that she was in labor, and when they got in the door, she let out a heart curding scream, paused, and then a lump fell down her pants. A bunch of workers ran out, got the baby out of her pants...there was just complete silence for a few seconds. Then the baby cried and the whole waiting room erupted in applause! It was amazing",
   "created_utc": 1699416788,
   "score": 62,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b0kde",
   "message": "A guy walked in, told the tech at the desk he having chest pain. He then dies. Right there.\n\nThey had to do CPR right there. \n\nThankfully he got thru the Cath Lab and was up talking when I got my asthma settled down and got discharged.\n\nIt also made the Karen shut up. She finally realized she might not be the sickest person in the room.\n\nEdit,\n\nIt's not that a heart attack is weird in the ER but that he actually had a full cardiac arrest at that moment",
   "created_utc": 1699411031,
   "score": 124,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b26lc",
   "message": "I was coming out of the hospital during the pandemic after having an MRI.  I’m very hard to medicate, so I’d had quite a bit of Xanax and felt really high. I decided I HAD to have a Diet Pepsi immediately while I waited for my husband to come pick me up. I bought my three dollar vending machine Diet Pepsi and went outside to wait for my ride because pandemic. \n\nAt this hospital, the ED and main entrance are right next to each other. This larger man walks huffing and puffing and sort of stumbling. I was immediately annoyed and just wanted to drink my DP in peace. All of the sudden, this guy says “I’m having a heart attack! Help!”  So, high as a kite, I run into the ED and tell the triage nurses there’s a man outside having a heart attack. They race outside, and I follow them for some reason. The man gets seated in his wheelchair, and I didn’t know what to do so I put my hand on his shoulder and said, “good luck to you sir.”",
   "created_utc": 1699411716,
   "score": 120,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ad7yg",
   "message": "All happened in one night: a guy comes in and waits hrs after shot in hip,he fights with extremely dirty and barefoot 500 lb woman in a wheelchair who falls asleep drooling during said fight, then a 90 yr old lady was waiting with me having had a hatchet to her forehead after a robbery. I was there with a broken ankle. Waited 11 hrs and they were still there when I left.",
   "created_utc": 1699401340,
   "score": 83,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8az8og",
   "message": "I work at a local hospital, typically in triage due to my paramedic background. I had to go out and physically separate 3 women 2 years ago during a covid surge... The youngest of the 3 was 87. They were out for blood.",
   "created_utc": 1699410460,
   "score": 56,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b1u5c",
   "message": "Once had to take my child to the er for his fever, while waiting in the intake line, the old man in front of me (around 80 years) , collapsed and cracked his head open on the floor, his head gushing blood. Him being semi conscious, was still being hounded for him to fill out his intake form until he passed out. \nOnly then did they admit him.",
   "created_utc": 1699411565,
   "score": 57,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b56vr",
   "message": "Old man decided to take his pants off in the lobby before heading to the bathroom. Ended up spraying shit in a path on his way there. From what I understand, he was just there with a family member; not even needing to be seen.",
   "created_utc": 1699413037,
   "score": 62,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ap7z4",
   "message": "The worst was probably actually in my hospital room.  I was young and not yet a professional patient (Tm).  I very clearly had CDIF.  Every nurse who walked in the room was like, “damn, is this your fist time with CDIF?”  I was covered in my own fowl - top to bottom.  Great part it was a second date.  My date showed up to the emergency room, while I was trying to hold my balls out of the bedpan.  (We were married for 18 years, so you know).\n\nI finally got admitted to my room around 4 am.  When they rolled me in, the tv for the fellow patient was blasting, I asked the nurse to get him to turn it down.  She discovered he’d coded.  Surmised he was hitting the call button, but it was really the volume up.  They worked on him for what felt like forever.\n\nThen, came over and told me no one was working in the morgue, so his body would have to stay in the room with me.  Asked if I wanted an ambien.",
   "created_utc": 1699406294,
   "score": 154,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aw6nv",
   "message": "Not a hospital, but the school nurse. I had gone bc I didn’t feel good (and also just kinda wanted to go home) but while I was waiting a girl came in with a pencil shoved *uncomfortably* far into her ear. It was bleeding. I then said I felt better and ran out of there.",
   "created_utc": 1699409176,
   "score": 139,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aopnj",
   "message": "I’m a nurse. About a week ago, a security guard was being an asshole to a man and unnecessarily tased him.",
   "created_utc": 1699406084,
   "score": 174,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b1ovm",
   "message": "* Bleeding\n* Moaning in agony\n* Crying/weeping\n* Groups of people praying\n* People arguing with staff\n* Bodily fluids spilled on the floor\n* People strapped to gournies fighting to get out\n* Police escorts\n\nI've been torn and banged up many times, needing stitches and/or bone scans, but emergency room visits remind me to count my blessings.\n\nCount your blessings and make them count.",
   "created_utc": 1699411502,
   "score": 46,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8awh8y",
   "message": "I was the patient once in what must have appeared to be some inception level nonsense. \n\nI was working as a first responder in my full navy blue highly recognizable uniform when I fell terribly ill (severe vertigo causing repeated loss of consciousness) so I got wheeled into the hospital - on the ambulance gurney - in my uniform. Everyone was visibly confused. The triage nurse, the doctor, the other patients witnessing my dizzy ass go in and out of consciousness. \n\nThere was also vomit involved in the theatrics so overall - horror movie.",
   "created_utc": 1699409298,
   "score": 123,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8avwl9",
   "message": "I've been to ERs lots of times. Some for me, some with other people. The strangest time was when I went to one in a rural area and it was absolutely empty except for a few staff members. My SO's family has a little summer cabin in the Catskills of NY. It's in a very rural area. I messed up my knee and it was a Sunday. I asked my SO to take me to that little hospital we pass about 20 minutes away. We pull up and there's not a car in the parking lot. We were questioning whether it was even open. We walk in and it was. It was surreal being the only patient and the ER was so silent. Eventually another patient walked in.",
   "created_utc": 1699409059,
   "score": 84,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b0c9z",
   "message": "Watched a girl pop her own eyeball out then put it back in. Not a fake eye.",
   "created_utc": 1699410935,
   "score": 86,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aqk5o",
   "message": "There was a guy from the local super max in chains with a cop either side",
   "created_utc": 1699406846,
   "score": 44,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8ayrb9",
   "message": "A young girl that had a bee crawl into her ear… during her birthday party.",
   "created_utc": 1699410257,
   "score": 43,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b1fhy",
   "message": "It was just a walk-in clinic, but it was right downtown in the heart of the city I live in, so there was always characters.\n\nOne time I'm in the waiting room, and this woman who is very clearly in the throes of some form of addiction leans over to the woman sitting beside her and says \"hey girl, thems some nice ass boots.  Where'd you get those?\".  I couldn't hear the response but she follows it up with \"damn, I was hoping you were gonna say Wal-mart so I could steal me a pair\".  I laughed.",
   "created_utc": 1699411391,
   "score": 41,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8an59y",
   "message": "Not too crazy, but since it just happened yesterday I’ll share. I was partway through filling out my intake forms, and a mom with probably 10+ kids came in. Several of them were screaming and the mom looked like she hadn’t slept in a month. Some nurses came over to assist her and as they moved them towards the entryway the clerk stopped them to say that I had checked in first and that she would have to wait.\n\nYeah, I let her go first",
   "created_utc": 1699405435,
   "score": 33,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8asf03",
   "message": "I was at the ER months ago for horrible neck pain. I witnessed a divorce happen in the lobby, where you check in. A woman was there for nausea, her husband was with her. It turns out she was pregnant and she didn't know. It caused an argument with her husband, and the divorce word was thrown into their argument. He ended up leaving the hospital and I'm not sure what ever happened to her, because I was called back in the midst of it all.",
   "created_utc": 1699407614,
   "score": 75,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8acbip",
   "message": "Kept seeing people just sitting there, coughing, without covering their mouth or wearing a mask or anything. Like, what kind of barn were they raised in?\n\nEDIT: A different time, I saw a guy being stopped by like 9 security gaurds. His girlfriend didn't want to see him. He called the police because they were stopping him and the police were like, \"really bruh?\"",
   "created_utc": 1699400976,
   "score": 170,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b0sse",
   "message": "I will never forget this \n\nThe ER was super crowded. There wasn’t any room for anyone to go anywhere. People being hooked up to IVs in the waiting room. \n\nThere was a man who had cancer and was on chemo and immunosuppressants who very obviously had sepsis (blood infection) and the person next to him had covid and was hacking away. The wife of the man with cancer was begging and crying to the nurses to give her husband a room so he wouldn’t get sick with any other illness due to his immunodeficiency. They said their hands were tied. I waited next to him in the ER for 12 hours. It was absolutely absurd.",
   "created_utc": 1699411127,
   "score": 73,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8aegi1",
   "message": "My wife and I were in the ER a couple of months ago and we were in a pod with a homeless man, a woman and a couple… then two junkies got put in the pod with us and they were drinking Pepsi and eating fast food and they stepped out for a smoke and the homeless guy grabbed one their Pepsis and a fry and went to another pod and all of us just sat there looking at each other like WTF and when the junkies came back in they looked all around the pod for their drink",
   "created_utc": 1699401856,
   "score": 165,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8azdn0",
   "message": "Once i was in the er waiting room and there were 3 young kids all looked under 10 and police coming to talk to their parents, the kids were acting really weird, they had apparently gotten into their parents meth stash. It was awful. I wonder whatever happened to those kids this was like 10 years ago, I hope they are safe now.",
   "created_utc": 1699410520,
   "score": 36,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8awcdz",
   "message": "When I was a kid, waiting in casualty with my mum because I got in some scrape. The guy say opposite us had a real life broadsword stuck in his foot. He’d been working in some old stately home and a suit of armour toppled over and the sword impaled his foot. It was all bandaged up and not obviously bleeding. So he was just sat there, cool as, waiting for his turn, holding this massive sword lodged in his foot.",
   "created_utc": 1699409241,
   "score": 30,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b2ofn",
   "message": "Like 8 years ago I was dating a guy who had cancer and we were at the hospital trying to get in for his appointment. All the entrances were closed except the door next to the emergency room. The ER had a huge glass wall and you could see straight into the entire thing. We got to the door next to it and saw that the ER and the main entrance and everywhere else was locked because something was happening, there was a group of people also waiting to get in and a bunch of cops standing by all the exits, you had to go in one at a time. So we stood there waiting our turn and staring at the cops in and around the ER through the glass, and they're all staring at the ceiling. One cop has a broom in his hand and he's poking ceiling tiles, they're all crepping around quietly. We were so confused, then out of nowhere there was a huge crash and some yelling, a dudes entire leg fell through one of the ceiling tiles and the tile busted on the floor, the cops were scrambling top speed one jumped on his leg and everything trying to pull him out of the ceiling. They started ripping the tiles off in fron of where the dude was crawling, it looked like something straight out of a cartoon. The actual story ended up being a little sad he had been baker acted and was losing it trying to escape. But damn in the moment, seeing that, you can't help but laugh. We watched as long as we could.  \n\nhttps://www.nwfdailynews.com/story/news/2015/03/02/1-445080/33960135007/",
   "created_utc": 1699411928,
   "score": 35,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8b2vae",
   "message": "While my husband was waiting with me at the Hillcrest ER in San Diego a border patrol agent came in with a border crosser who was complaining of chest pain. Apparently it’s a common tactic. The ER is busy. When it gets to end of their shift the border patrol agents just leave. They can’t be bothered with overtime to babysit someone. After the agent leaves the border crosser just walks out of the hospital. \n\nThe ER docs said it happens frequently.",
   "created_utc": 1699412012,
   "score": 31,
   "submission_id": "17q88f1"
  },
  {
   "comment_id": "k8bbgia",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17q88f1"
  }
 ]
}