{
 "submission_id": "17q96l1",
 "title": "What's an underrated sexual experience that you think more people should try?",
 "selftext": "",
 "created_utc": 1699403561,
 "permalink": "/r/AskReddit/comments/17q96l1/whats_an_underrated_sexual_experience_that_you/",
 "score": 204,
 "url": "https://www.reddit.com/r/AskReddit/comments/17q96l1/whats_an_underrated_sexual_experience_that_you/",
 "comments": [
  {
   "comment_id": "k8bb03s",
   "message": "Sensory deprivation.\n\nOne partner tied up, wearing a blindfold and noise cancelling headphones. The other partner is then in charge of pleasuring the deprived.\n\nFor the deprived, it is very intense as you are giving yourself fully to your partner and entrusting them to bring you pleasure. You can't see, you can't hear and you are tied up so you can only move as far as your bindings allow. The anticipation alone has brought me to orgasm.\n\nSide note: make sure the music in the headphones is conducive to the situation.",
   "created_utc": 1699415757,
   "score": 14,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b1wey",
   "message": "stop being shy during sex,i like when my wife masturbates in front of me and i like to masturbarte in front of her we use toys and let the sheets get wet.\nsex has been extraordinarily good.",
   "created_utc": 1699411592,
   "score": 143,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b2ee5",
   "message": "If you’re older (late 30’s here), making out and over the clothes rubbing and grinding. Sex becomes this rushed thing when you get older. Every once in awhile, spending that little extra time to get that build up and tease each other is just 🥵",
   "created_utc": 1699411808,
   "score": 62,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8aum9r",
   "message": "Playfighting leading into facesitting",
   "created_utc": 1699408523,
   "score": 127,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b72o0",
   "message": "The build-up, teasing and foreplay.\nMost people try to get to the main event as fast as possible .... But the build-up is where most of the actual fun is. The main event is the act of releasing that tension.\n\nBuilding up that sexual tension and arousal to (almost) the breaking point makes the main event soooo much better. Chances of mutual orgasms are increased dramatically when done well.\n\nAs for main event stuff?\nIt depends on the individuals and their comforts/tastes.\n\nBut I can tell you that from experience, if you build up the tension just right ... you'll both be willing to do almost anything.\n\nWay more (mutually) fun and pleasurable sex ensues.\nWhatever your tastes.",
   "created_utc": 1699413887,
   "score": 191,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b5zv0",
   "message": "Went for a walk with an ex and we sat down in a nice field by a creek at around 9pm.  When she realized nobody was around, she told me to lay back, not say anything and look up at the stars.  I did just that.  A few moments later, she pulled my shorts down and proceeded to give me an incredibly slow, sensual blowjob for nearly a half-hour, purposely edging me repeatedly and not letting me cum until she wanted me to.  A few weeks later, we did another walk and I returned the favor for her.  Some of my favorite sexual experiences of all time.\n\nSo for my money... have your partner lay back, relax and look up at the stars while you do all the work and pleasure them.",
   "created_utc": 1699413400,
   "score": 148,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8amkhh",
   "message": "Using toys in sex, if it improves my chances of giving the woman I'm with an orgasm then I'm gonna take advantage because it'll improve the whole sexual experience",
   "created_utc": 1699405196,
   "score": 249,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bk2pe",
   "message": "Sensual naked massages as foreplay.\n\nDim the lights. Make sure the room is nice and warm. Light a nice scented candle. Put on some relaxing or erotic music. Use a massage oil bar that she loves the scent of. Take your time, the slower the better. Make her melt into a puddle of warmth, relaxation, safety, and comfort under the trusted power and security of your hot oily hands as you worship every inch of her. Make her feel like a goddess. The rest of the night will be goooooooood",
   "created_utc": 1699420606,
   "score": 248,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bcci4",
   "message": "Try the lotus position.  I'm not sure what it is about that position but it makes sex feel so intimate.  French kissing in that position is my weakness.",
   "created_utc": 1699416428,
   "score": 24,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bgjuy",
   "message": "Kissing like your in high-school with heavy petting.",
   "created_utc": 1699418628,
   "score": 222,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bd3fm",
   "message": "Vibrators on a woman’s clit while man is inside. This turns her into a vibrator for the man. Win-win.",
   "created_utc": 1699416804,
   "score": 149,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8athi1",
   "message": "Making love with the love of your life knowing she loves you equally and you’ll be together forever…\n\nAlso saw a dude get his ass ate so good he came completely hands free. That seems like it would be nice",
   "created_utc": 1699408058,
   "score": 119,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b7lb5",
   "message": "A bit off-topic but \"missionary position\" is not a bad or boring sexual position, it just suffers from shitty marketing.  It's the homebase of sexual positions.  You might venture out and wrestle into other ways to entangle, but you'll always come home to the missionary position.",
   "created_utc": 1699414127,
   "score": 213,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b3521",
   "message": "Having a Swedish penis pump, but claiming that it’s not mine baby yeah!",
   "created_utc": 1699412130,
   "score": 241,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8aw9x2",
   "message": "I used to get so turned on while eating my gf out in 69 that I could cum without her doing anything to me",
   "created_utc": 1699409212,
   "score": 18,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8at218",
   "message": "Getting a really decent hug from someone who loves you. Have yet to experience it but I’ve heard it’s Insane. Let me know your experiences.",
   "created_utc": 1699407880,
   "score": 208,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b4esy",
   "message": "Control play, dominant and submissive. Doesn't have to be extreme leather bound BDSM stuff but playing with those roles and flipping your forward facing life on it's head in the bedroom can be incredibly gratifying.\n\nMy forward facing life, career and otherwise, is dominant. I'm responsible for decisions that impact people. I don't want that in the bedroom anymore and it took awhile to become comfortable with that reality. It's helped a lot and helped with my own mental health.",
   "created_utc": 1699412689,
   "score": 200,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b9veu",
   "message": "Dry humping is almost nonexistent nowadays",
   "created_utc": 1699415208,
   "score": 61,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b3fe5",
   "message": "Cumming at the same time.\n\nMy first comment over a thousand.  Thanks everyone!",
   "created_utc": 1699412258,
   "score": 50,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8ajj5l",
   "message": "Ffm blowjob cured my depression",
   "created_utc": 1699403947,
   "score": 141,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8axu2n",
   "message": "A prostate orgasm, for people who have them.\n\nIt is incredibly intense, it's like the pleasure slowly builds up and pleasure spasms spread across your whole body. And you just want more, more and more, there's no refractory period. It keeps feeling better and better and before you know it you'll be unable to control your moaning and gasping and completely lose yourself in the moment.\n\nWhen you're finally done you feel so light and peaceful, like you just came down from orgasm heaven.",
   "created_utc": 1699409868,
   "score": 30,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bexgc",
   "message": "Getting a full night’s rest",
   "created_utc": 1699417752,
   "score": 71,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b3xj7",
   "message": "Communicating what you need/want.",
   "created_utc": 1699412476,
   "score": 99,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8at4e5",
   "message": "In the woods while it's raining",
   "created_utc": 1699407907,
   "score": 209,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b69wc",
   "message": "Vanilla sex with someone you love free of all the weird psychological baggage of porn and just some good healthy intimacy is about as underrated as it gets judging from the comments.",
   "created_utc": 1699413526,
   "score": 75,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b45g9",
   "message": "So much ass play in this thread",
   "created_utc": 1699412574,
   "score": 19,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bfnzz",
   "message": "For anyone who wears glasses and has to take them off for sex, find a partner that lets you leave them on. 10/10",
   "created_utc": 1699418147,
   "score": 121,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bdd0j",
   "message": "3 words. Hitatchi magic wand.",
   "created_utc": 1699416942,
   "score": 246,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8askfp",
   "message": "Using lube.",
   "created_utc": 1699407676,
   "score": 246,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bclo9",
   "message": "As a guy, getting my nipples licked. I didn't realize how many guys have never had it done to them. I absolutely love it",
   "created_utc": 1699416555,
   "score": 191,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b3x3n",
   "message": "More people, especially attractive women, should try having sex with me.",
   "created_utc": 1699412471,
   "score": 1,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bclvx",
   "message": "Play with HIS titties!",
   "created_utc": 1699416559,
   "score": 39,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8azpbl",
   "message": "Guys is it gay to touch your own asshole?\n\nNo and your cum button is there. Maybe clean yourself and try it",
   "created_utc": 1699410661,
   "score": 221,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bbd2a",
   "message": "Getting someone close to climax then stopping and making them wait till later in the day while teasing them throughout the day.\n\nHas to be someone receptive to that.",
   "created_utc": 1699415935,
   "score": 255,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8aycu2",
   "message": "Being absurdly in love with the other person",
   "created_utc": 1699410089,
   "score": 180,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bh9z5",
   "message": "Being with someone who makes you truly happy.",
   "created_utc": 1699419025,
   "score": 39,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8apjyq",
   "message": "The prostate orgasm is out of this world",
   "created_utc": 1699406431,
   "score": 189,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bpix5",
   "message": "Sex when camping.\n\nIt's in tents",
   "created_utc": 1699424011,
   "score": 131,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b7fp1",
   "message": "Getting tied up and giving up control.",
   "created_utc": 1699414055,
   "score": 121,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b3lge",
   "message": "Ear licking",
   "created_utc": 1699412332,
   "score": 142,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bh7wy",
   "message": "Remote control vibrators… get dressed up, go out and about in the city and see if she can keep a straight face…",
   "created_utc": 1699418993,
   "score": 96,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b7znm",
   "message": "Sex-Wrestling. I know it sounds wild but it’s an interesting experience specifically when you get a good session with a good Orgasm at the end. But it also depends on the rules you and your partner decide on.",
   "created_utc": 1699414314,
   "score": 30,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8ba0o6",
   "message": "Bondage. Intense trust. Intense release.",
   "created_utc": 1699415280,
   "score": 84,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b2z6d",
   "message": "Blind folds",
   "created_utc": 1699412059,
   "score": 105,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b7czj",
   "message": "Motherfuckin' Rimjobs. Look, people who eat ass are people who will also run a Marathon on a dare and eat a whole Apple Pie in one sitting. Why? Because of the gawddamn experience. It's not the easiest thing in the world. It doesn't sound overly romantic. However, when it's done correctly it's one of the most fulfilling and pleasurable things in this world.   \n\n\nImagine it. You're face down and ass up. Completely naked and hopelessly vulnerable. Your cheeks are spread and one of the most Taboo parts of your body is openly displayed in front of your partner's face. All of a sudden a warm tongue glides along a part of your body that is seldom touched, but yet composed of over 20,000 nerve endings. Your mind begins to race. Your legs begin to involuntarily tremble. Your heart starts hammering into your chest. Your whole body is alight with waves of pleasure.  \n\n\nI'm telling you...\n\nEAT. THAT. MOTHERFUCKING. ASS.",
   "created_utc": 1699414020,
   "score": 9,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b1is9",
   "message": "Making love and having an actual emotional connection with someone. I feel like it’s almost a lost art these days with dating and hook up apps",
   "created_utc": 1699411430,
   "score": 50,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b614i",
   "message": "Having sex or mastrubating while high. It's truly a next level experience.",
   "created_utc": 1699413415,
   "score": 202,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b38b3",
   "message": "Kissing on earlobes",
   "created_utc": 1699412170,
   "score": 97,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8baolc",
   "message": "*Actual* foreplay. Building in little moments of intimacy throughout the day, then turning up the heat when it’s time to actually have sex. It’s hard to explain, but doing so creates this sense of desire mixed with urgency, even though you’ve built toward it throughout the day.",
   "created_utc": 1699415601,
   "score": 100,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8baram",
   "message": "Have sex like you've never watched porn",
   "created_utc": 1699415637,
   "score": 53,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bp979",
   "message": "Ethnusiastic happy sex. When both people really want it and are in a fun joyful mood.\n\nLazy casual sex, where you're both kinda just bored and want to be close and it turns into this almost half assed attempt at sex but you're comfy about it. \n\nI see so many people make sex into this unenjoyable thing that can only be horny and \"Nasty\" or one side is just giving in so the other will stop bothering them.\n\nIt seems dreadful. \n\nI dont know why people have to be so dead serious and resistive to casual sex stuff all the time, and wont take it casually and in a fun manner.\n\nThe best thing ever for me is when both enjoy it and it's a FUN thing to do together. It's ok to smile and laugh and enjoy yourself.",
   "created_utc": 1699423832,
   "score": 24,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8atphm",
   "message": "Fucking that one guy’s dead wife",
   "created_utc": 1699408149,
   "score": 176,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b1k5c",
   "message": "69ing. If you aren't enjoying it I really feel you gotta be doing it wrong.",
   "created_utc": 1699411446,
   "score": 195,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b2unn",
   "message": "Dom/sub dynamics. Particularly getting into dom/subspace",
   "created_utc": 1699412004,
   "score": 161,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bksup",
   "message": "Yelling into someone’s anus. Feel free to practice your stand up set in there, great analcoustics.",
   "created_utc": 1699421033,
   "score": 20,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8bt2lh",
   "message": "Pussyjobs/tribbing/frotting/whatever you'd call some combination of dick(s) and/or clit(s) rubbing. My ex would rub the head of his dick on my clit thinking he was teasing me, but I liked it more than piv",
   "created_utc": 1699426453,
   "score": 21,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b6onx",
   "message": "Have an orgasm fast (no don’t cum fast, I mean abstain intentionally). Go a week without masturbating or having sex. THEN have sex. When you break that fast it’s intense as hell. My wife and I do this a few times a year sort of as a sexual reset. It’s hot as hell.",
   "created_utc": 1699413712,
   "score": 20,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b550y",
   "message": "Ever made love to the woman of your dreams \r  \nIn a room full of money out in London as she screams?",
   "created_utc": 1699413014,
   "score": 83,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8axnqb",
   "message": "Some of these answers are wild fr💀",
   "created_utc": 1699409794,
   "score": 5,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b236s",
   "message": "feeling loved 😔",
   "created_utc": 1699411674,
   "score": 133,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b5k71",
   "message": "Skipping it and going for pancakes.",
   "created_utc": 1699413203,
   "score": 65,
   "submission_id": "17q96l1"
  },
  {
   "comment_id": "k8b2uqo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17q96l1"
  }
 ]
}