{
 "submission_id": "17qgyn9",
 "title": "What's the darkest side of humanity you've ever seen?",
 "selftext": "",
 "created_utc": 1699430935,
 "permalink": "/r/AskReddit/comments/17qgyn9/whats_the_darkest_side_of_humanity_youve_ever_seen/",
 "score": 221,
 "url": "https://www.reddit.com/r/AskReddit/comments/17qgyn9/whats_the_darkest_side_of_humanity_youve_ever_seen/",
 "comments": [
  {
   "comment_id": "k8c4bdr",
   "message": "I worked in Child Protection so I saw alot. Worst was an 8 year old that had been trafficked and abused for 4 years and killed herself at 10 years old",
   "created_utc": 1699435492,
   "score": 80,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c9j7y",
   "message": "I was in hospital (I was a sick kid) with a 3 or 4 year old. His mom had given him caustic soda in his bottle. It melted half his tongue away. He lived in a hospice with some nuns and he'd come in weekly to have his tongue stretched in the hopes he'd be able to talk one day.\n\nHe was cute as a button. I wonder how he's doing. He'd be in his 20's now.",
   "created_utc": 1699439763,
   "score": 141,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c207v",
   "message": "2 years ago a girl from my school got raped by 3 guys and posted online. One committed suicide and the other 2 had fled the country. \n\nMost of my school has seen it and she is living in severe depression and social anxiety. So sad",
   "created_utc": 1699433528,
   "score": 25,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c9y3i",
   "message": "Its probably nothing compared to the other stories shared here, but what I witnessed is a testament to the darkness that can reside in some people's souls.  \n\n\nSo Three years ago, I was driving in the countryside on my way home. I was on a very quiet road when I noticed a group of ducks crossing the road, so I stopped to let them pass. Soon after, I saw an oncoming vehicle with a man driving towards me from the other side. I used my headlights to signal him to stop and let the ducks pass. He also saw the ducks because it seemed like he was responding to my request to stop. He slowed down as he approached the ducks, but then suddenly accelerated, killing a large number of baby ducklings. I felt sick to my stomach witnessing the carnage. And while he was driving besides me he was smiling, as if relishing the notion that he had caused harm to the ducklings. I got out of my car and tried to say something, but he sped off. Some people are just messed up 😟.",
   "created_utc": 1699440075,
   "score": 110,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c84xa",
   "message": "1983, watched a mob drag a man out of his car, beat him up, and set him on fire. I was 9.\n\n1988, watched bodies float down the river, and people who had been tied to telephone poles and set on fire with tyres. (15)\n\nHelped drag bodies out of two bomb sites (17 and 26)\n\nHumanity sucks\n\n*ETA* Sri Lanka. I maintain we have a national-level PTSD",
   "created_utc": 1699438657,
   "score": 143,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cb1w6",
   "message": "Any genocode memorial in Rwanda - they have a couple where they kept the corpses as they were found. Horrific. I was shown a large brown stain on a wall and informed that this wall was where they swung infants to kill then by bashing their brains.\n\nI still cannot phantom that 100,000 people were butchered in the space of a month and half by HAND - machete.",
   "created_utc": 1699440902,
   "score": 31,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cbm4j",
   "message": "When I was 10 y/o, my babysitter (F 16 y/o) died in a traffic accident. She was also my neighbor's daughter. My neighbor (the girl's mom) was ofcourse heartbroken. \n\nSince the girl who died was a popular girl, the adress was in the newspaper so people knew where to send their respect letters.\n\nAt the night of the condolences ceremony, burglars broke into my neighbor's home and stole whatever they could find (including stuff from her daughter that had just died).\n\nAfter finding out what happened, I developed a very dark and disgusted view on humanity from a young age.",
   "created_utc": 1699441318,
   "score": 88,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c8se2",
   "message": "I used to work the night life scene. I saw a fair number of fights and other messed up shit, but the worst for me wasn’t even graphic exactly, it was just traumatizing. I had a 15 minute conversation at 6am with a date rape victim who was trying to get her phone and purse back from the bar she remembered being at the night before. All she could remember was getting a drink and blacking out. She woke up in some guy’s bed and ended up going to the ER and having a rape kit done, then had to go to the bar to try and find her stuff.",
   "created_utc": 1699439172,
   "score": 97,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8car9s",
   "message": "Girl in the middle school I went to was raped by two guys. They never faced any consequences.\n\nMultiple girls in the high school I went to were forced into doing sexual stuff with the PE teacher. Again, he faced no consequences.\n\nWhen I became a teacher later on, two of my students died of drug overdose.\n\nWhen my brother was in high school, one of his classmates was murdered. Supposedly 5-6 people were involved, but there wasn’t enough evidence to convict any of them. That boy’s family has been wrecked by it.\n\nUgh… that’s way too much to remember for one day.",
   "created_utc": 1699440685,
   "score": 107,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8caksy",
   "message": "The day after Christmas sale at a major department store. The gift wrap was half price. A woman keeled over onto the floor with what appeared to be a heart attack. People continued shopping over the top of her legs. Store employees had to form a circle around her to try to get her blocked off from the crowd. Ambulance crew had to nearly fight their way through the crowd to get to her; no one would move. The attempt at rescue took far longer than it should have. Even when she was on the gurney being taken out, people were still shoving the crew",
   "created_utc": 1699440549,
   "score": 195,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c4bkv",
   "message": "Since the question asks about the things I have personally seen and not the things thatve happened in the world or are going on....I'll go with this.\n\nSo this one time I found a sponge ball with a smiley face on it lying around in a ground. We have these here as stress busting balls. This ground is a place where there have been fights bw animal feeders and local residents. So without much thought I picked up the ball and squished it cuz well...it's spongy u know. Guess what...my hand starts bleeding bcz there are bunch of nails inside. I figured bcz of the altercations I've seen here before, someone put nails in the ball and threw it so some dog bites on it and gets hurt. I can't even say if some dog did get hurt inside the mouth and This perhaps is not a big deal considering the things we see everyday...but for someone to take their anger out on an animal like that bcz they don't agree with people feeding them there...this act must come from the lowest darkest side of their humanity.",
   "created_utc": 1699435497,
   "score": 224,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8camvk",
   "message": "Personally?\n\n\nI was shot at as a toddler by some ex-military freak getting over a really bad breakup and deciding to take it out on a kid: Me.\n\nHe was trying to shoot my dog too.\n\nStill haven't quite got over that.\n\nStill haven't quite got over most things that happened to me during that era of my life.\n\n\n\nThe darkest side of humanity I've ever heard about for sure is Unit 731 or what Japan did to China during WW2.",
   "created_utc": 1699440593,
   "score": 23,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cbqmu",
   "message": "Human trafficking. I was involved in CSEM production when I was no more than 3 years old. I wont go into too much detail but the things I went through were some of the most disgusting and vile parts of humanity. I still feel guilt for things I was forced to do, even though I was just a toddler when I had to do them.",
   "created_utc": 1699441409,
   "score": 108,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8caac8",
   "message": "My husband's relatives(his uncle and his family) who run from war in Ukraine were shoot by russian troops. Parents died immediately, older daughter (15yo) has been lost for more than a year. They've found her remains recently, she died from pain shock.",
   "created_utc": 1699440332,
   "score": 183,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cbq28",
   "message": "I was a Paramedic for 34 years. I’ve dealt with murders, rapes, hangings, people burned to cinders,children burned to cinders self inflicted slashed throats, cot deaths, drug overdoses by the dozen ete etc. So I guess I’ve seen more of the dark side of humanity than is good for anyone to see.",
   "created_utc": 1699441398,
   "score": 81,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cfvbm",
   "message": "I know this pales in comparison to all the fucked up stuff in the thread, but: I once heard some weird noises from a dumpster, opened it and found - inside a plastic bag - six dog puppies, all cold as fuck and pretty much passed out except the smallest one, who kept wailing and wailing.\n\nTook them out and to a vet, he basically told me \"nah mate, they're done for\". Took them home, put them in a basket with blankets and stuff. They died one after the other in a couple of days, the smallest being the last one to go. It fucking broke my heart and I don't even like dogs.\n\nI can sorta understand - for a very narrow definition of \"understanding\" - how hatred can bring people to do horrible things to other people; but this? You could have solved it in a dozen different ways, without spending a dime and wasting maybe two hours of your life, but you chose this? What the FUCK are you?!",
   "created_utc": 1699444199,
   "score": 39,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cbwxg",
   "message": "I was beaten up by a mob. And someone in that mob repeatedly try to hit on my medulla-oblongata region.\n\nI was coming back from visiting my would-be wife (Our engagement was over). It was well past midnight. I had parked my car a  bit away from my would be's home, because would-be's neighbour had a new born baby and i didn't want my car's sound disturb the baby's sleep in the middle of night.\n\nWhen i was walking back to my car i found a group of youngsters gathered near the car. They asked me where i had gone. I told them. They got suspicious because apparently there were thieves in that region. Someone took away my phone and checked my messages. About 10 people surrounded me. I tried to keep calm and tell them that if they have doubt about me we could go to the police station. The person who took away my phone, came running and kicked on my chest. I fell on the road. He was accusing me of philandering. Immediately rest of the mob, kicked all over my body while i was lying on the road. They then pushed me off the road and started beating me up from all sides. I was trying to protect my vital areas. There was nothing else i could do. Then came the repeated heavy punches with some solid object from my back. The first one landed on the back of my neck. I quickly covered the back of my head with my hands. I knew what one serious blow in that region could kill me or put me on my bed for life.\n\nAfter  a while somehow the leader of that mob realised that i was coming from my would-be's home. ( received her call on my phone ).  And he asked the mob to disperse.\n\nI ended up with a broken nose, torned dresses, broken neck chain etc. I drove my car straight to hospital.  Took a photo of my face before the nurse dressed it up. Gave a complain for attempted homicide in the local police station. I was okay with the mob violence and the beating. That was not something i couldn't take. I was pissed off because someone was trying to hit on the Medulla Oblongata region. My life had been very hard and i was finally having a good time in personal life and at work. And  some reckless kid taking all that away with a few blows was infuriating. \n\nThe case was later settled outside of court.\n\nFor a while i after this incident, i felt a previously unknown fear when talking to a group of people. In my mind, i felt that someone from that group can immediately land a kick on my chest and then i would be beaten up. It got alright after a while.\n\nA sequel to the story is that, the mob leader was caught by the locals from a home where he was philandering with a woman who husband was working overseas. He was arrested based on some charges and the news came in newspapers. There was also reference to the mob violence that i was a victim of in that news article.\n\nPS: This gang was comprised of young muslim men(Some of them even under 18 ). And the people who came to me in order to request a withdrawal of the case were from the local Islamic political party. Such homogenous group ( of any religion) is a recent trend. (Earlier friends group used to have people from all religions. Religion was not the criteria for friendship. ) They lack an external perspective and have no empathy for the other. I specifically think that violence is an easy option for such homogenous groups because there is no second voice within the group.\n\nThanks for reading.",
   "created_utc": 1699441536,
   "score": 125,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c3t2b",
   "message": "Visited my uncle in New York once. Was walking down the street and saw two cops beating the ever living shit out of someone. I later found out all he did was steal a pack of cigarettes from the convenience store around the block. Another thing that comes to mind, is how cruel kids can be. Went to school with a kid that was a little strange. He was nice and polite, just had odd interests and was more introverted than most. He got bullied so bad in late elementary school and middle school that he's basically still a basket case. Excluded from everything, constantly made fun of, beaten up or at least hit on a regular basis, etc. Hurts to know that he's still in pain and stuff all because some asshole kids decided to make his life hell for no reason.",
   "created_utc": 1699435053,
   "score": 59,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cawir",
   "message": "In writing an essay on psychiatry in Nazi Germany and how they treated disabled or mentally Ill adults/children and it’s horrible. I know everybody knows that Nazi Germany was evil, but reading first hand accounts of it is really hard. It’s not the evil that got to me (although they were absolutely evil) it’s the coldest and the lack of humanity that really fucks with me.",
   "created_utc": 1699440792,
   "score": 62,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c93sh",
   "message": "I couldn't read all the comments. My heart is broken. People are the worst parasites of the world.",
   "created_utc": 1699439426,
   "score": 165,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c90e4",
   "message": "There was this one woman with her daughter who lived around my neighborghood, she used to pimp herself out in order to feed her daughter and herself, welp when she got old and wasn't attractive enough for the business to make alot of money, she decided to start pimping out her 13-14 yo daughter to old dude for money. I know its tame compared to other stories, but it's fucked up, and what's even more fucked up is how often things like that happen. And other then that all the cartel videos are some of the other side of the darkest stuff humanity has to offer.",
   "created_utc": 1699439352,
   "score": 40,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8bzpwq",
   "message": "I worked in a Service Abuse department for an internet service provider. That meant we had to deal with all the different crimes people can commit over the internet. Self-harm, bullying, CSAM, trafficking. It wounds your soul.",
   "created_utc": 1699431616,
   "score": 183,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8bz09y",
   "message": "Ever been to Auschwitz? That's dark af",
   "created_utc": 1699431038,
   "score": 55,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c8ajv",
   "message": "Animal cruelty and child abuse would legit make this world like a 100% better to live in if they didn’t exist.",
   "created_utc": 1699438781,
   "score": 74,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cai2g",
   "message": "I saw the worst kind of homeless people when I lived in Santa Ana.  Not just the addicts who need help, but the violent types who are just laying low to avoid outstanding arrest warrants.",
   "created_utc": 1699440492,
   "score": 22,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cbiuc",
   "message": "My job is about support and civil claims for victims of child abuse. Religious organisations enabling sexual abuse against children and doing everything in their power to protect the abusers. Also grooming gangs that targeted children as young as 7 and showed no remorse at all.",
   "created_utc": 1699441251,
   "score": 21,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cbnec",
   "message": "Soo i remember when i was around 11 and my friends we used to wake up at 4 am and go play in an nearby park area . As regularly we would go and play one day after a major festival here my friends and i met on our regular point and as we started to cycle the street there is this crossing ( where 4 streets met ) we saw a cutted head lying there . We fuci kg fell off from cycles and took the bicycle and back to my house now we lay there 1-2 hours passed whole street was blocked police , agencies and god knows whatever . Later it was all over news and what not . So it was a men’s head which was cutted by his own wife which she cutted following some black magic fuckery still spends chills down my spine remembering those closed eyes",
   "created_utc": 1699441344,
   "score": 21,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cf30q",
   "message": "I was visiting family in Cambodia. We had a ceremony in my wife’s village and during I was told an old friend couldn’t make it because he doesn’t feel well. We decided to pack up some food to bring to him. I had gotten used to the style house there, so it was a surprise to find a single house western style. White picket fence, kids toys on the lawn, garden. Sticks out like a sore thumb.\n\nWe were actually going across the street to the ditch. Bamboo and mosquito net was haphazardly thrown around. Dirty dishes everywhere, a chicken in a much too small cage, garbage. In the middle was a skeleton with skin over it. I couldn’t believe a human still moves and talks in that state. He almost looked like a movie puppet. He spoke about his pending death and what his body will allow that day. Out popped an elderly woman that chimes in she will not be far behind him. She shows off what looks like a pregnant belly. It’s  from hepatitis. \n\nI was obviously taken back by people willingly passing away in a ditch. I asked if they have family. My wife said yes, and pointed to the western style house. The owner was watering his lawn at that point. He smiled and waved at us. We waved back. It took the old man three weeks from that point to die…in the ditch…..across from his son watching tv on his couch.",
   "created_utc": 1699443697,
   "score": 19,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c2wyf",
   "message": "Working as an adolescent health nurse, reading the history’s of so many young people and what their families, friends and strangers have done to them. Worst of all is adolescents who believe that these people care about/love them, and remain in horrific situations by their own choice",
   "created_utc": 1699434299,
   "score": 89,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c4mmq",
   "message": "I have seen animal testing, What drug dealers will make a woman go through for her fix\nI have seen how parents strong out on trank will leave thier kids in dippers filled with sh*t and cockroch cralling on them. \nCartel treatment of people they catch or think they stole from them.\nOne of the worst I have seen, was a young man get put on the ground after he was severely beaten,  most his teeth kick out, Then they cut his eye lids off with scissors and split his tongue length wise, then they urinate on him, right after that they do a lot of crazy shi* just to inflict pain. In the end they very slowly run a very long skinny knife threw his neck and hold him in a sitting position, as he looks at the camera you have no other option but to see the eyes as the knife is pulled up with a rope attached to a fork lift and his hole body is just dangling in the air.",
   "created_utc": 1699435762,
   "score": 75,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c658c",
   "message": "father left, mother left, and still i get informed if someone of my family died and i can inherit their debt.\n\nmeh\n\n\\*Edit: earn = inherit",
   "created_utc": 1699437036,
   "score": 80,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c4tyj",
   "message": "After I decided to commit suicide, I was watching suicide videos to see what it was like, especially those who hang themselves. I came across a very disturbing video of a 12-year-old girl hanging herself. To be honest, the video did not traumatize me that much because I became numb as a result of the severe traumas I experienced and I do not feel sorry for others that much. When I go to the comments, I see those who enjoy the suicide of this little girl, who say \"we need more little girl who commit suicide, I love it when women hang themselves, especially when they hang themself without breaking their necks. I have seen people say that they love to watch them die in pain\" almost all comments were like this. I hate and disgust the whole world I hate everything else. The comments on any gore video on the site I visited were many times scarier than the video itself. THEN I DISCOVER THE GURO SOME PEOPLE REALLY WATCH AND ENJOY GURO LIKE WTFFFFFFFF İS THAT. I saw a video where they put an anime girl through a skewer, cook her like a chicken AND SERVE HER. THE SUBREDDIT IS FULL OF WEIRDEST STUFF LIKE THIS HOW ARE THESE NOT SHITPOSTS, HOW CAN YOU ENJOY THIS??!?!?!? WTFFFFFFFFFFFFFFFFFF AAAAAAA i cant tell anyone about this that's why i wrote here anonymously and wanted to pour out my heart.",
   "created_utc": 1699435937,
   "score": 235,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cb423",
   "message": "Luckily I have yet to see anything irl, but there's a few Netflix documentaries and movies that get super fuckin close dude. \n\n-Audrie and Daisy, a Netflix documentary about two girls who were drugged and sexually assaulted. I watched this one during a week of out-patient therapy after trying to kill myself. it's rough man \n\n\n-Don't Fuck With Cats, a Netflix docuseries about an online group trying to chase after a killer after watching a video of them torturing kittens. Fuckin yikes dude\n\n-Man Behind The Sun, a movie about the horrors of unit 731. Brutal, couldn't finish it",
   "created_utc": 1699440948,
   "score": 36,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c5yd6",
   "message": "The pain olympics. IYKYK.",
   "created_utc": 1699436879,
   "score": 43,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c0shz",
   "message": "Joined a gaming group that I didn't find out until after I was a member were hardcore Neo-Nazis.\n\nLike \"we're playing ARMA 3 to practice fighting the police\"\n\nBailed right the hell out, didn't think to report them to the authorities.",
   "created_utc": 1699432505,
   "score": 95,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cdse4",
   "message": "Not directly, but the Manchester arena bombing really got me, for a few reasons, I'd been stood in the spot the bomb went off a few days earlier, I had firends working at the arena, and a friend of my wife's was killed.\n\nThe biggest thing for me, was that the demographic at the concert was predominantly young girls, hardly a geopolitical threat. This guy stodd there, watching them leave the arena, having had a great time, probably looking them in the eye and was still filled with enough hatred to press the button.\n\nTerrorism is horrific regardles, but this felt evil in a way I'd not considered before. I was so angry in the days after that i struggled to breathe at times. I'd never felt anything quite like it.",
   "created_utc": 1699442843,
   "score": 10,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cejwn",
   "message": "I had a very good friend that was a simple, but very sweet guy. He had gotten mixed up with a woman that was bad for him. She had two children from two previous relationships and she bragged regularly about having lied to get one of her previous husbands thrown in jail for raping one of the girls when he had actually done nothing wrong, so people should be nice to her. \n\nMy friend had repeatedly caught her cheating on him, or attempting to, but he always took her back, and never tried to leave her. I was sleeping on his couch one night when he had found on her on the front porch with another man with his pants down. He had tried his best to create a really good family situation for the two girls at home and was worried that if they separated, it would really mess them up worse. So after being separated for a few days/weeks at a time, they would always get back together. \n\nOne day, during a period of separation with the wife because he had caught her cheating again, his daughter had gotten mad at my friend because he had made a deal with her to send her on a trip if her grades were good enough and she ended up not scoring well on the test, and, in my opinion, like a good father, he was standing his ground and not letting her go. \n\nShe got so mad that after she spent some time with her mother during the separation, she called the police and told them that my friend had been raping her for 10 years and she finally got brave enough to say something. \n\nMAYBE he had really done it, which is inexcusable, but I had heard his wife threaten before to say he had done that to the girls if he made them mad enough. And I had spent hundreds of hours with him and the kids and never seen any cause to believe that. \n\nIt went to trial, and I watched the whole thing. The only evidence they had was the daughter’s testimony. The psychological evaluation and the physical examination both concluded that “it’s possible” she had had sexual contact although there was “no evidence.” \n\nSo basically it came down to a “he said, she said” scenario and they put him in jail for the rest of his life. \n\nI always believed in the American justice system and that you were “innocent until proven guilty,” but that’s not true. As it turns out, you’re innocent until someone a jury would believe over you says that you’re guilty. I was sick for years over this and I still lose sleep over it from time to time.",
   "created_utc": 1699443357,
   "score": 9,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c0uy0",
   "message": "some porn on twitter is really messed up",
   "created_utc": 1699432561,
   "score": 47,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8casuw",
   "message": "Buddy of mine went down to Tijuana with some friends for a girl's 18th birthday. Toward the end of the night, they had lost track of her. One of them spotted her getting in a car with a couple dudes they didn't know.\n\nThe rest of the group hopped in the car and followed the car to the border where they flagged down border patrol, telling them their friend was in that car against her will.\n\nBorder patrol surrounded the car the girl was in and extricated the two males she was with. When they got her out, turns out she was dead. She had been cut open, gutted, and her body cavity was stuffed with bricks of cocaine.\n\nI happen to know the cartel will do the same to infants and force their mothers to carry their dead children across the Columbian border.\n\nI've seen some pretty dark shit as a homicide detective, but that shit takes the cake.",
   "created_utc": 1699440718,
   "score": 43,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c70jl",
   "message": "Fried of a friends from high school who was on the fringe of our social group got beaten to death by her longterm boyfriend out of the blue",
   "created_utc": 1699437750,
   "score": 35,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8ca4if",
   "message": "My grandma lived in a creepy ass little town, she lived in a secluded area but had neighbors like .5 mile radius. My grandma had strays come in the garage and my grandma was in her 90s so the neighbor boys would come over and look at the cats. A cat had kittens and the neighbor boys killed the mother cat with a shovel and took the kittens. \n\nAfter a while it happened my grandma passed away so we never got to say anything. But I wish I would’ve and still would if I ever came across them.",
   "created_utc": 1699440210,
   "score": 9,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8ccmsh",
   "message": "I wish for once people wouldn’t fill the comments with things they’ve seen on the internet. Like yeah we’ve all seen, heard, or read about it.",
   "created_utc": 1699442049,
   "score": 8,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cjbvm",
   "message": "Families racing from a relatives funeral to the deceased persons house to fight over their belongings.",
   "created_utc": 1699446238,
   "score": 8,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cfjt7",
   "message": "After losing both their parents to dv and suicide some of my relatives ended up being raised by a family that would make them fight each other for food so who ever won got fed. They also suffered s.a over those years too. They've turned out really well considering.",
   "created_utc": 1699443998,
   "score": 7,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cbdal",
   "message": "Something people don't get, war is horrible but it's the suffering it causes, the gut ranching pain, the starvation, the ends people will go to just to survive, the inhumanity. Hell is hell and war is war of the two I'd choose hell every time. I'm tortured by the memories of soldiers on both sides raping and murdering on almost a daily basis... But I'll never forget the sound... The smell... How it felt to have the hair on my neck stand, my stomach turn, my veins turn to ice the moment the bloody kid playing football stood on a land mine, I put people back together for a living, but there was nothing left, the shock on their face, haunts me whenever I close my eyes. War is war and Hell is hell.",
   "created_utc": 1699441138,
   "score": 27,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cd4r8",
   "message": "Human trafficking through New Orleans...most of it was sex workers, but I saw someone I knew who fancied themselves a \"pimp\" hand off 3 kids to someone who I knew was cartel.  Yes, I dropped a fucking dime. They were all gone by the time NOPD showed up...I've always wondered what else I could have done, but being on the streets myself and not strapped the only thi g that eould have happened was os I'd never have been seen again and business as usual would have kept on rolling.\n\nThat was the second time I saw true evil in New Orleans.   I love that city, truly I do, but there is evil in that city that is as old and as ruthless as Father Time himself, and anybody headed there would do best to remember that.",
   "created_utc": 1699442403,
   "score": 13,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8ccoh8",
   "message": "As a 10 year old, in middle school I went to Auschwitz concentration camp with other kids from my school during visit to Kraków. Almost every middle school in Poland goes for trips to Kraków and when they do, they go to Auschiwtz too. We were too young in my opinion to go there. Seeing little children shoes and hair with pieces of skin bc the Germans didn't bother to shave the heads of victmis carefully or the nail scratches in gas chambers was to too much. Kids were obviously knowing history, but it was very emotional seeing sbawling their eyes, one of my friends almost passed out. Overall, I recommend going there when you are older.",
   "created_utc": 1699442083,
   "score": 6,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c614z",
   "message": "War",
   "created_utc": 1699436944,
   "score": 19,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cagxf",
   "message": "Back in 1999, an India army scout team was ambushed and captured by Pakistan's army on the border.\n\nTheir nails were plucked, eyes gouged out, penis cut off and God knows why. Don't think any professional modern army would do such gory acts.",
   "created_utc": 1699440469,
   "score": 16,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c7jh6",
   "message": "I see it everyday on reddit.",
   "created_utc": 1699438174,
   "score": 13,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cd679",
   "message": "When I was in highschool I still went to church. There was some issue with the pastor and the church had decided to move on from him and find a different pastor. Durring the process, there was a vote by the congregation to move on, and then again to guarantee the severance package. \n\nOne person actually stood up in the church and made the case to deny the severance. The pastor just didn't work out, he didn't do anything bad or controversial. I (15 at the time) watched my mom stand up and say \"your can't do that, they have 3 small children. How would they survive?\"\n\nAnd the person who originally made the case to deny the severance said \"sometimes people need to be punished.\"\n\nThe church still voted to give him and his family the standard severance, but it wasn't long after that that I left the church",
   "created_utc": 1699442431,
   "score": 10,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c8oo3",
   "message": "The darkest side would be the old days of the internet. Some videos had titles that made you think it was cartoons or a film but even the devil himself would say fuck that shit and leave the room.",
   "created_utc": 1699439090,
   "score": 26,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cabq8",
   "message": "Go visit any random gore website. Watch what the cartels and ISIS do to people.  Or the numerous other brutal murders and depravity on them. Your question will be answered in spades.",
   "created_utc": 1699440360,
   "score": 6,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cd4af",
   "message": "I saw a kid in my neighborhood take a sledge hammer to a turtle. So violent and unnecessary.",
   "created_utc": 1699442394,
   "score": 6,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8c9eaz",
   "message": "I was having a walk when a man drove over a stray dog. He then pulled over, gave the dog a look and chuckled while saying it's just a stray dog. He said smth like thanks god my car is okay and left. Unfortunately the dog died.",
   "created_utc": 1699439656,
   "score": 11,
   "submission_id": "17qgyn9"
  },
  {
   "comment_id": "k8cl3f0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17qgyn9"
  }
 ]
}