{
 "submission_id": "17roqfo",
 "title": "Science nerds of reddit, what pseudoscience drives you bonkers the most?",
 "selftext": "",
 "created_utc": 1699568427,
 "permalink": "/r/AskReddit/comments/17roqfo/science_nerds_of_reddit_what_pseudoscience_drives/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/17roqfo/science_nerds_of_reddit_what_pseudoscience_drives/",
 "comments": [
  {
   "comment_id": "k8khlik",
   "message": "That one hidden food that was recently discovered to have all the cures and vitamins like mangosteen and jojoba.",
   "created_utc": 1699570510,
   "score": 238,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kmpzo",
   "message": "[Quack cancer treatments](https://www.livescience.com/4040-dying-desperate-lure-quack-medical-clinics.html). They take thousands of dollars from desperate people, some of whom decline actual treatment that might have saved their lives, or at least extended them. Nothing more vile.",
   "created_utc": 1699572578,
   "score": 203,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kd4ev",
   "message": "Facebook/Instagram “psychology” like “psychological fact #425: those who smile the most are the saddest”",
   "created_utc": 1699568772,
   "score": 255,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kkerm",
   "message": "When someone says \"X is only like ONE molecule away from being Y so you're basically eating/taking poison\"",
   "created_utc": 1699571631,
   "score": 38,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8ko0a9",
   "message": "Polygraph",
   "created_utc": 1699573103,
   "score": 129,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8krk2f",
   "message": "I've been a Registered Dietitian for sixteen years. I just can't with the \"nutritionists\" on Instagram hocking their MLM diet bullshit. It's not worth my time to argue with them though. In fact it is a total waste of time.\n\nEdit: I’ve never had a response on Reddit get this level of feedback before. Thanks guys!! I’m glad to find out that some of you have heard of registered dietitians, and that all of you appreciate some common sense.",
   "created_utc": 1699574574,
   "score": 77,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l4tul",
   "message": "As a physicist, it is astounding how many people who couldn't pass an algebra course also seem to have \"theories\" about \"quantum physics\". I honestly love hearing them at this point.",
   "created_utc": 1699580101,
   "score": 196,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8ky7lo",
   "message": "Magnetic. Fucking. Bracelets.",
   "created_utc": 1699577344,
   "score": 31,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8ku11i",
   "message": "Saying a chemical is too dangerous to eat because you can't pronounce it.",
   "created_utc": 1699575617,
   "score": 94,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kdsvt",
   "message": "“Toxins” and “cleansing” them.",
   "created_utc": 1699569032,
   "score": 87,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l397j",
   "message": "When I took astronomy in college my parents kept asking me to tell their fortune...",
   "created_utc": 1699579453,
   "score": 198,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kd380",
   "message": "As an environmentalist I run into lots of anti-science stuff in hippy circles.\n\nThe most common one I see is people selling food products with no 'chemicals' in it",
   "created_utc": 1699568760,
   "score": 97,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8ktoj3",
   "message": "Nutrition and fitness science are full of so many gurus who just say things in ways to sound like their way is THE right way, or conclusions are made based off age old bro science assumptions that “make sense” just because of some basic reasoning that breaks down when analyzed",
   "created_utc": 1699575471,
   "score": 168,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kczjs",
   "message": "Crystals for sure. I’m a geologist and I love collecting rocks and minerals and fossils. People who are into crystals for healing and shit make me look like an idiot.",
   "created_utc": 1699568721,
   "score": 68,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8ku85d",
   "message": "Any time I see quantum mechanics or string theory used to try and explain some spiritual woo-woo nonsense.",
   "created_utc": 1699575698,
   "score": 232,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8lm9ta",
   "message": "\"Don't eat it if you can't pronounce the ingredients\"\n\n*cries in organic chemistry class*",
   "created_utc": 1699587459,
   "score": 168,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8ks2ah",
   "message": "Whenever people find out I am a PhD in Psychology they immediately start to tell me about their weird dreams and ask me what they mean. Bruh I don’t know (nor do I care) and neither does anybody else.",
   "created_utc": 1699574793,
   "score": 138,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l6yg7",
   "message": "Chemtrails.  Worked in aircraft maintenance software development. It’s like Lego manuals for 737s.  No chem trail nozzles or tanks or piping. I promise.",
   "created_utc": 1699580962,
   "score": 91,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l93z9",
   "message": "When my child is sick, and people tell me \"try elderberry oil! It worked on my kid!\" \"Put cut up potatoes in their socks before bed. It removes all the toxins.\" \"I give my kid lemon, cayenne pepper, fish oil, and honey when they are sick. Works wonders!\" \n\nNo lady. Potatoes in the socks aren't going to help my kid when he has asthma and bronchitis. He's about to make some gnarly mashed potatoes in his socks and still be sick. And now I have to clean potato out of his socks.\n\nEdit: I know the lemon and honey from the last example can help soothe sore throats and is commonly used. But the fish oil and cayenne pepper added is just unnecessary. Plus the person who suggested that said that's ALL she gives her kids when they have a cold. \n\nNatural remedies are one thing. Ginger for nausea, honey and lemon for sore throats, gargling salt water... those work. But when you're coming up with random stuff and acting like it cures everything, then it bothers me.",
   "created_utc": 1699581839,
   "score": 91,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kgo9w",
   "message": "I can’t choose between flushing toxins out of your body or astrology. They are just both so far beyond stupid.",
   "created_utc": 1699570150,
   "score": 0,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kdgnl",
   "message": "When someone says it’s hot out today so that proves global warming / climate change. \n\nOr when someone says it’s cold out today so that disproves climate change. \n\nIt’s about long term trends. Not individual hot and cold days.",
   "created_utc": 1699568903,
   "score": 187,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kgd3d",
   "message": "Homeopathy",
   "created_utc": 1699570028,
   "score": 147,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8lb82h",
   "message": "I was having a conversation with two moms at school pickup the other day and started talking about bringing their newborns for chiropractic adjustments at TWO WEEKS OLD. I was absolutely dying inside.",
   "created_utc": 1699582707,
   "score": 32,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8km0iw",
   "message": "Homeopathic medicine. What. The. Hell.",
   "created_utc": 1699572288,
   "score": 97,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kvdor",
   "message": "the whole “alpha male” thing. alpha males don’t exist in wild wolves, and the poor guy who made that study debunked it and has spent his whole life trying to get people to drop it. but even if it did, it doesn’t mean they exist in humans and doesn’t mean we should model our society after them.",
   "created_utc": 1699576177,
   "score": 19,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l1rmk",
   "message": "Scientology, holy fucking shit balls. These people can talk pure, unadulterated shit all day long, have a huge amount of loyal followers and resources at their fingertips, and literally disappeared the leader's wife. If anyone deserves to get raided by the FBI, it's them.",
   "created_utc": 1699578833,
   "score": 52,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l9004",
   "message": "Horoscopes.",
   "created_utc": 1699581794,
   "score": 55,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kjq6w",
   "message": "\"Vaccines cause autism\"  \n\n\nWe're not even talking about the covid shot or whatnot, we're talking about the polio vaccine or MMR vaccine",
   "created_utc": 1699571356,
   "score": 196,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kpyc1",
   "message": "Any/every time some tabloid publishes “LOOKIT THIS ASTEROID THAT HAS A 0.000000000000001% CHANCE OF MAYBE HITTING EARTH!!”\n\nNo. No it doesn’t. Shut up. There are actual problems to solve on this planet right now",
   "created_utc": 1699573905,
   "score": 53,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kva7j",
   "message": "Toxins, because it's just the most obvious cash grab there is.\n\nFlat Earth. Because.....Sweet Jesus, I am not going into it.\n\nPerfectly fine with Witchcraft though. Let them have their fun.",
   "created_utc": 1699576136,
   "score": 46,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l68cc",
   "message": "Homeopathy. I'm a pharmacist, so it really grinds my gears. It is really dangerous, I've seen patients stop using proper meds because some homeopathy quack got to them and they don't believe \"Big Bad Pharm Industry\" anymore. Thing is, homeopathy can get you a LOT of money so some properly educated people take advantege of that.",
   "created_utc": 1699580663,
   "score": 128,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kgtnf",
   "message": "Honestly, it's the entire attitude and stance of psuedoscience/conspiracy people. Instead of finding reliable sources to be good, they purposefully seek out the least reliable and fantastical things they can find and put their faith in THAT instead. Anti-expert mentality is everywhere in our society and it's dangerous.",
   "created_utc": 1699570209,
   "score": 224,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kvgj9",
   "message": "Pop-psychology. Personality tests specifically.",
   "created_utc": 1699576210,
   "score": 185,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8lbwgd",
   "message": "Homeopathy and alternative medicine. No, my nephew with brain damage from a birth defect did not see improvements from colloidal silver and essential oils. All that did was drain my sister's wallet. But apparently, big pharma is poisoning us with real medicine, so there's no changing her mind.\n\nEdit: I am aware homeopathy refers specifically to a disproven sudoscience involving dilution. However I've also seen it used as a blanket term to include other alternative forms of medicine, but apparently, that's incorrect, so I'll make it more specific.\n\nI should mention it was a homeopathy clinic that sold the silver and oils. They also sold her other forms of alternative medicine and even prescribed weird diet changes. For example, they claimed his trouble seeing is from eating too many carrots. In reality, the part of his brain that processes the signals from his eyes is underdeveloped. It's not a dietary issue. Even my sister saw through the BS on that one.",
   "created_utc": 1699582985,
   "score": 163,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kfkp9",
   "message": "Traditional Chinese Medicine. It has decimated all sorts of animal populations from rhinos to leopards to pangolins. And now even the World Health Organization is bending over to give TCM more legitimacy when it doesn't deserve any.",
   "created_utc": 1699569719,
   "score": 199,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kw6s5",
   "message": "All of the negative GMO crap, don’t tell me you think your carrots are all the same colour by accident.",
   "created_utc": 1699576514,
   "score": 238,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8klaxx",
   "message": "Any time someone says \"Trust the Science\", without actually referring to any scientific study.",
   "created_utc": 1699571997,
   "score": 230,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8khqht",
   "message": "The Meyers-Briggs personality test.  It's completely nonsense, maybe one step ahead of astrology.  In fact, the people I see putting weight in it the most often are people who used to believe in astrology but decided they wanted something more \"real\".  \n\nBut what the fuck do I know, I'm an ESTP, right?",
   "created_utc": 1699570563,
   "score": 15,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kok73",
   "message": "Spiritual hippy types who mash together things like quantum entanglement and consciousness, or \"The double slit experiment proves there is more than one reality.\"\n\nAlso 5G. People in the UK were burning down 5G masts. Apart from the fact that microwave radiation at that level is completely harmless, these people were seemingly unaware of the fact that every WiFi router in the country is already emitting radiation in the 5G frequency range, and has been for years.",
   "created_utc": 1699573329,
   "score": 90,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l3ead",
   "message": "Young-Earth Creationism.\n\n\u0026amp;#x200B;\n\nThey are so utterly convinced that their imitation of science is the actual truth that the misinformation bubble they've built can fill entire textbooks full of what appears to be solid reasoning and evidence. \n\n\u0026amp;#x200B;\n\nThey even cite actual, valid scientific ideas sometimes in defense of their theories, which can sound incredibly persuasive if one happened to know nothing about the 99% of actual biology, geology, archaeology and chemistry they conveniently omit.",
   "created_utc": 1699579511,
   "score": 111,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kh1a1",
   "message": "Lemme see... \n\nAlkaline diet/water\nEssential oils\nAnti vaxx rhetoric \nTerrain theory\n\"Detox\" diets, products etc. And the \"toxins\" influences\n\"Resonance\" or \"vibrations\" as a panacea \nCraniosacral therapy \nInflammation (nonspecific) as the cause of ALL disease \n\nUgh I could go on. \n\nI'm a physiologist and physiology professor and I get asked about these a lot.",
   "created_utc": 1699570291,
   "score": 7,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l6g1a",
   "message": "People who oppose nuclear power because they don’t understand it, so they’re scared of it and claim a nuclear power plant meltdown has the potential to cause as much destruction as an atomic bomb.",
   "created_utc": 1699580751,
   "score": 191,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l9uz8",
   "message": "I'm an immunologist.\n\nDuring the pandemic, I was in a constant state of rage. It's the primary reason why I no longer have any social media except Reddit.\n\nEdit: just want to clarify for the sake of transparency; I'm not a medical doctor. I was a medical researcher and most of my work was in vaccine research. I work in industry now but my company is a biotech that specializes in immunology products.",
   "created_utc": 1699582149,
   "score": 224,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8l4ic9",
   "message": "Eating fat makes you get fat.",
   "created_utc": 1699579969,
   "score": 125,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8krlpb",
   "message": "Flat earth theory",
   "created_utc": 1699574594,
   "score": 96,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kei71",
   "message": "Essential oils. Sure they smell nice but they don’t cure shit",
   "created_utc": 1699569305,
   "score": 153,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8ldwbg",
   "message": "Homeopathy.....something that literally CANNOT be true at all, yet too many people take it seriously. People can die because of quack ideas like that!",
   "created_utc": 1699583813,
   "score": 29,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8lbyhs",
   "message": "Using your hair to test for food sensitivities. Apparently it uses \"bioresonance\" and \"physics machines\". If I have one more person tell me that it's legitimate because it's performed by a certified lab I will lose my mind. I develop scientific assays for a living and have a graduate degree designed around investigating antibody specificities. This is some real bullshit.\n\nEdit: changed an unfortunate autocorrect \"antibody sensitivities to antibody specificities\". Iykyk.",
   "created_utc": 1699583007,
   "score": 67,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kjkpi",
   "message": "technical analysis for stocks/crypto gets to be a bit woo-woo sometimes. likened to astrology for men by some lmao.",
   "created_utc": 1699571295,
   "score": 84,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8kn1xb",
   "message": "Chiropractors",
   "created_utc": 1699572714,
   "score": 147,
   "submission_id": "17roqfo"
  },
  {
   "comment_id": "k8nt0lf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17roqfo"
  }
 ]
}