{
 "submission_id": "17srbzl",
 "title": "What is a place that you're afraid of visiting again and why?",
 "selftext": "",
 "created_utc": 1699696583,
 "permalink": "/r/AskReddit/comments/17srbzl/what_is_a_place_that_youre_afraid_of_visiting/",
 "score": 138,
 "url": "https://www.reddit.com/r/AskReddit/comments/17srbzl/what_is_a_place_that_youre_afraid_of_visiting/",
 "comments": [
  {
   "comment_id": "k8rlyto",
   "message": "I use to live in a town called Paradise, California. My dad and I visited it years ago, we had such fond memories. It’s now burned to the ground. Makes me sad just thinking about.",
   "created_utc": 1699696875,
   "score": 109,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rlv54",
   "message": "Syria, I went before the civil war and it was honestly one of the loveliest places I’ve ever been, with super nice friendly people. Add to that the food is amazing. It would break my heart to see some of the places now.",
   "created_utc": 1699696793,
   "score": 149,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rsp07",
   "message": "Jamaica. That place is scary. Not just the locals wanting to machete you to pieces, the police are equally vicious. The cops will toss you into a jail and hold you hostage to milk your family for “bail.” The cops are scarier than the crooks.",
   "created_utc": 1699702102,
   "score": 80,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rsv87",
   "message": "I wouldn’t go back to parts of Central America again. There are some beautiful places and some friendly people, however the police are very corrupt and many people are desperate. A tourist is an easy target. Especially if you can’t help standing out from everyone else around you.",
   "created_utc": 1699702227,
   "score": 32,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rpsj4",
   "message": "Winchester Mystery House",
   "created_utc": 1699699911,
   "score": 22,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rnjw6",
   "message": "Ireland because I got stranded in customs there.",
   "created_utc": 1699698149,
   "score": 41,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rufzg",
   "message": "The last time I was in Cambodia, I’m not sure if I bribed an immigration officer, or got extorted for money but either way, getting detained there was enough to make me never want to go back. Fuck that was sketchy.",
   "created_utc": 1699703317,
   "score": 17,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rnmuc",
   "message": "Ugh, no way am I stepping foot into my ex's favorite coffee shop again. That place is a whole bag of memories I'm not ready to unpack. Every latte and indie song reminds me of those cringe-worthy date nights. It's like a haunted house of heartbreak, and I'm not about to voluntarily go back there and stir up those old feelings. I'll stick to my corner café, thank you very much. No emotional turbulence with my morning brew, please. ☕💔",
   "created_utc": 1699698213,
   "score": 55,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rojlb",
   "message": "The last time I was in Paris, I was attacked by a whole bunch of street mimes.\n\n\n\nand they did some unspeakable things to me..",
   "created_utc": 1699698931,
   "score": 106,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8ro10l",
   "message": "Jail lol",
   "created_utc": 1699698526,
   "score": 24,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rpl5n",
   "message": "Ugh, no doubt it's my ex's hometown.",
   "created_utc": 1699699755,
   "score": 26,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rncz5",
   "message": "[removed]",
   "created_utc": 1699697998,
   "score": 11,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rsehy",
   "message": "My highschool. So many memories. So many terrible memories.",
   "created_utc": 1699701887,
   "score": 11,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rv48s",
   "message": "Nuevo. Laredo. Cops are scary. Cartel runs the town and I've had a gun pulled on me twice. It use to be fun ages ago.",
   "created_utc": 1699703760,
   "score": 10,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rz609",
   "message": "I visit my family's cabin deep in the Canadian bush. Nearby, there is a trail that takes you to a lake. A couple of years ago, I was walking that trail when out of nowhere, a large rock seemed to be thrown at me and landed almost at my feet. I then heard what I thought was a gorilla. It was so loud that I could feel the bass of the screaming in my chest, and it seemed to last for so long. I don't go to Penelope Lake anymore. I don't feel welcome....",
   "created_utc": 1699706226,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rud09",
   "message": "Darien Gap. Thick jungle, a 66 mile hike with absolutely no roads.\n\nCartels, 5 deadly native tribes, jungle predators, flash floods, huge rivers, mudslides, piranhas, robberies, rapers, disease, traffickers.\n\nHad to go for some research project but don’t work in that industry anymore and never will return.",
   "created_utc": 1699703261,
   "score": 21,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rz4f6",
   "message": "Los Angeles because it was dirty, hot, and I saw two people get robbed at gunpoint in a week.",
   "created_utc": 1699706202,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8ro3tx",
   "message": "Theres this one alley near my street and I dont like driving by there at night.\n\nsome psycho lives there, puts heavy metal and satanic music all evening.\n\nApparently police cant do much because of his mental disability\n\nAnd he once chased people with an axe, also owns a machete for the same use.",
   "created_utc": 1699698589,
   "score": 17,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rum97",
   "message": "A month ago, I visited a historical part of town. They opened up an underground jail that was used by the Japanese to torture and kill people in WW2. It is a small space but it is really eerie. It doesn’t help that the exhibit ends with life size Japanese soldier mannequin.",
   "created_utc": 1699703432,
   "score": 9,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rovrs",
   "message": "The toilet. After last night's curry, this morning's visit would have breached the Geneva Convention and certainly was a ring-stinger.\n\nMy arse looks like the Japanese flag.",
   "created_utc": 1699699195,
   "score": 47,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rx2oi",
   "message": "A classic scam to avoid abroad is hiring a water ski and then the damage which you didn’t cause is revealed.”Pay or we call the Police”.",
   "created_utc": 1699704996,
   "score": 7,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8ryyss",
   "message": "Dagestan, Russia. People are too wild there and attitude towards women is awful, though the nature is beautiful",
   "created_utc": 1699706115,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rmo8d",
   "message": "I visited a torture museum once. It wasn't torture to visit, but they sure have a lot of butt stuff there. Personally, it's exit only.",
   "created_utc": 1699697437,
   "score": 13,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rrhuc",
   "message": "Downtown Houston by the bus station.",
   "created_utc": 1699701225,
   "score": 8,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rybc5",
   "message": "Tunisia. As a blonde haired, blue eyed woman (I’m also very short at 5ft 2) I was honestly harassed every single day. I didn’t get a minute of peace anywhere and it’s put me off ever going back",
   "created_utc": 1699705734,
   "score": 18,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rnrkv",
   "message": "The hospital’s ER, almost died there twice.",
   "created_utc": 1699698316,
   "score": 9,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rwhwh",
   "message": "Baltimore. Went there for a psychology conference. I'm also a photographer and I did a photo walk with a fellow psychologist and we were approached by a woman with obvious schizophrenia screaming at us \"excuse me! I need your help! Excuse me!\", multiple homeless people asking for money and they got pretty aggressive following us. Some people asking for business opportunities. One woman tried leading us into an alley saying she's certified (she had a bus pass around her neck looking like some city worker badge)\n\nWe feel for all of them but we can't do anything for them right there on the street. It was sad and I had a hard time taking photos of the harbor and the buildings. We ended up going back to the hotel and swearing to stay in our safe little city of... St. Louis. \n\nYeah. We're from the murder capital of the country.",
   "created_utc": 1699704641,
   "score": 10,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rwydx",
   "message": "North train station in Brussels",
   "created_utc": 1699704925,
   "score": 4,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rxaqn",
   "message": "Paris.",
   "created_utc": 1699705129,
   "score": 4,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rnytx",
   "message": "South Africa. Because I live here.",
   "created_utc": 1699698478,
   "score": 12,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8ruski",
   "message": "San Francisco, specifically the Tenderloin",
   "created_utc": 1699703547,
   "score": 5,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rvwjv",
   "message": "Walmart. What horrible creature from my past will show up this time and try to talk? My 6th grade vice principal? Jenny the pot dealer who stole my Adderall? It’s just too risky.",
   "created_utc": 1699704277,
   "score": 7,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8roi9x",
   "message": "\r  \nAn old house that sits at the end of our street. It's a place frozen in time, with boarded-up windows and a history that whispers through its peeling paint. Every creak and groan feels like the house is trying to share its secrets, but I'm not sure I want to hear them. The air there feels heavy, like it's holding onto something, and it's a weight I'd rather not carry.",
   "created_utc": 1699698903,
   "score": 9,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rxkkp",
   "message": "The place I was born and spent the first 8 years living in NZ. We moved to Australia in 1992 and I haven't been back. \n\nI want to visit NZ again, just not where I used to live. The memories I have of it are innocent and through the eyes of a kid. I just know it won't be the same, and I don't want to ruin those memories.",
   "created_utc": 1699705293,
   "score": 3,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s0gor",
   "message": "Honestly my home. I’m originally from New Mexico but my family moved to Texas when I was around 10. I love my home, I love New Mexico with all my heart and will take any chance to visit but I will admit I’m always afraid when I do. It’s a dangerous place, especially in Albuquerque where I grew up. Terrible people, lovely land and nature.",
   "created_utc": 1699706960,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rq9af",
   "message": "Downtown Portland Oregon. But only at night.",
   "created_utc": 1699700277,
   "score": 5,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rsa9g",
   "message": "my home town because i had a traumatizing childhood",
   "created_utc": 1699701802,
   "score": 5,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rqhdm",
   "message": "school",
   "created_utc": 1699700450,
   "score": 2,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rxwsr",
   "message": "Salt lake. There were spiders and wasps everywhere!",
   "created_utc": 1699705489,
   "score": 3,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8ry9ag",
   "message": "I lost my baby in the NICU- so yeah, definitely there.",
   "created_utc": 1699705700,
   "score": 2,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s01md",
   "message": "Memphis Tennessee",
   "created_utc": 1699706727,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s0as2",
   "message": "Washington DC, the disparity of life between bigwigs and poors is highly disturbing.",
   "created_utc": 1699706870,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rm1g2",
   "message": "A zoo,I will never visit a zoo again,l I believe they violating  the animals fundamental right besides it's scary.",
   "created_utc": 1699696934,
   "score": 8,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rntsa",
   "message": "Australia because of all the crazy animals",
   "created_utc": 1699698365,
   "score": 2,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rr606",
   "message": "There's quite a few places from my childhood like that - I don't want to go as an adult because it'll ruin the great (but probably flawed) memories I have of the place.",
   "created_utc": 1699700970,
   "score": 2,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rss4x",
   "message": "gay club because my ass was squeezed too many times in one night",
   "created_utc": 1699702166,
   "score": 2,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rqwf9",
   "message": "America.\n\nWe don’t have gun violence issues like the US does. \n\nI couldn’t afford to get sick there or need assistance.\n\nThe way most states devalue women’s lives and voices, not to mention anti-LGTBQ issues and race problems. I wouldn’t feel safe.",
   "created_utc": 1699700772,
   "score": 252,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rtuym",
   "message": "Any blood work place cause of my fear of needle",
   "created_utc": 1699702915,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rvvy3",
   "message": "A good friend had a genuine bad experience  visiting Borley Rectory so like the Ouija Board should be avoided",
   "created_utc": 1699704267,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rwf6z",
   "message": "Many years ago during the troubles when the troops would board your bus I visited the Zoo in Northern Ireland.The poor animals seemed to look like they were on death row.",
   "created_utc": 1699704596,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rreyn",
   "message": "Russia - obvious reasons \n\nAnd my home country, the US, it is no longer the country of my birth",
   "created_utc": 1699701164,
   "score": 254,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rp9l5",
   "message": "Costa Rica. Because its Costa Rica.",
   "created_utc": 1699699503,
   "score": 254,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rqtsz",
   "message": "Meghalaya.\n\nNo border disputes, and a nice community. It's the cold that scares me.",
   "created_utc": 1699700717,
   "score": 0,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rva2r",
   "message": "Mental hospital locked units are fairly horrendous. \n\n30k feet during a storm in a commuter flight, kinda sucks too",
   "created_utc": 1699703871,
   "score": 0,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rxbpf",
   "message": "My last house. It was the first home that I purchased four years ago. It made me sick with hidden toxins, including evil spirits that haunted it. I avoid that area at all costs. Some places should never be revisited. ☠️👹👺",
   "created_utc": 1699705145,
   "score": 0,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rxl0w",
   "message": "I am not returning to Dubai. Mainly because my mother had a severe heatstroke (it was in the winter) even though she drank a lot of water. And also Dubai felt so eerie while I visited (2021)",
   "created_utc": 1699705301,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rzxwu",
   "message": "Florida. I was walking on the beach and I was a bit sun dazed. I accidentally walked into someones back yard. They ran out ready to fight pointing to the sign and I'm so dazed out by the sun, I couldnt make sense of what was happening. Luckily my sister was with me and yanked my arm and we walked in the other direction. When I got back to my hotel room I realized that situation could gave gotten bad if he was a \"stand your ground\" gun owner.",
   "created_utc": 1699706670,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rsdow",
   "message": "Bonn. I assumed there'd be bars, couldn't get a drink anywhere",
   "created_utc": 1699701870,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8runfn",
   "message": "Not afraid, but Belfast - never will I go back there, and I’ve been to the West Bank.",
   "created_utc": 1699703453,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rvo99",
   "message": "Shani shingnapur temple, chances of getting scammed.",
   "created_utc": 1699704133,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rxsny",
   "message": "North Korea",
   "created_utc": 1699705422,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8ryllq",
   "message": "The 9/11 memorial museum in NYC. \n\nNever have I ever felt so emotionally drained as I did when I walked out of there. \n\nI won't visit again. It was too much.",
   "created_utc": 1699705903,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rzln4",
   "message": "Wiley Ave and Park Heights. I was pretty sure we were going to die. Got like between a quarter and a half for $20 tho.",
   "created_utc": 1699706470,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8rzy3s",
   "message": "Oakland, CA. My  hotel was behind a huge locked gate. The first thing I saw on the local news was down the street from where I was a man was found burned alive in a trash can.",
   "created_utc": 1699706672,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s0are",
   "message": "Atlantic City, NJ ..just a ghetto with a few casinos.Beware of Darkness!!",
   "created_utc": 1699706870,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s1xpm",
   "message": "Brussels and New York. I also felt uncomfortable in Prague. I dunno. Haven't seen that much of the world.",
   "created_utc": 1699707753,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s2c1h",
   "message": "Birmingham, I just had to stay there one night for my flight the next day. As I was walking to my hostel (like a 10 min walk) I was harassed 3 times, two guys literally put their car to the side of the road to catcall me and drive slowly behind me. Did not like those vibes.",
   "created_utc": 1699707960,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s2lcf",
   "message": "Bulgaria. Because we caught a bug that made us severely hill with food poisoning. We were both taken to hospital and given some strong German medicine I’d never heard of. We were so ill projectile vomiting and shitting at the same time. That was back in the late 80’s when the country still had supermarkets were you could buy anything ultramodern. The catch was they only accepted western currencies. For that reason the exchange rate was useless as the black market was offering 4 times the rate. We chose the black market rate. We gave our maid, who really helped us when we were sick, our travel kettle, and she was overcome with gratitude.",
   "created_utc": 1699708099,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s2llb",
   "message": "My mothers house.",
   "created_utc": 1699708103,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s2o6o",
   "message": "Bay Area (San Francisco, CA). I grew up there. My last visit was for my mother's funeral. I was hit by serious CPTSD hallucinations/flashbacks. It didn't feel like home anymore. I then started questioning if it ever did. I live in a different state and things are much better (therapy, etc.).",
   "created_utc": 1699708139,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s2t7e",
   "message": "I wanna say NYC cause I just haaaaaate it so much. But I have friends there and my husband loves it so I know I’ll go again.\n\nBut gods I hate NYC, and I was born and raised in the NYC metro area, close enough it was a normal adventure to drive into the city late at night when traffic was calm.",
   "created_utc": 1699708209,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s3atd",
   "message": "Mexico.  I grew up in El Paso, Texas during the 1950s and 1960s.  I left in 1972.\n\nI spent a lot of time in Juarez—going to the Pronaf Center, the Old Market, the glass blowers’ studios.  \n\nThings changed with the advent of the Cartels and Juarez, along with the rest of Mexico, became a violent, dangerous place.  \n\nThere is no way I would set foot over the border now.",
   "created_utc": 1699708459,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s3bkv",
   "message": "Any american school",
   "created_utc": 1699708470,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s3dfd",
   "message": "The cardiac unit in a hospital.",
   "created_utc": 1699708496,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s3m30",
   "message": "I visited a friend of mine in Berlin, she wears a hijab the amount of abuse on the street she got was fukin sickening. Never again !!!",
   "created_utc": 1699708619,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s3og0",
   "message": "My childhood home and farmland. My brother was murdered there. I’m afraid of all the memories it would bring forth. Will it make all the progress I’ve made to heal from ptsd, just disappear?",
   "created_utc": 1699708652,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s3y7d",
   "message": "I don't particularly want to visit the home town of my ex girlfriend. Even though we're on okay terms and there'd be nothing to worry about if I bumped into her- simply going there makes me upset because of how we aren't together anymore. It reminds me of what I've lost.",
   "created_utc": 1699708789,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s3y9x",
   "message": "Nowadays, in the US, any town with Israel/Palestine protests.",
   "created_utc": 1699708790,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s496w",
   "message": "Psych ward",
   "created_utc": 1699708939,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s4fii",
   "message": "The local children's hospital that was eventually turned into a media center. I had 4 surgeries there before it changed, and then I had to go there as an adult to visit one of the clinics. They had renovated so much but the smell was the same and I felt like a kid going in for another major surgery.",
   "created_utc": 1699709025,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s4l36",
   "message": "The trailer park I grew up in and lived in for 16 years. Very bad memories and a lot of trauma in that place. It’s only 10 minutes away from where I live now.",
   "created_utc": 1699709101,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s4t4h",
   "message": "Darwin. A lot of racial tension \u0026amp; I had minders that wouldn’t let me go out alone when I was there. Or Cairns, where I watched a guy put something in my drink and mix it around \u0026amp; then caught my eye and tried to hand it back to me. \n\nCouldn’t wait to leave.",
   "created_utc": 1699709211,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s4xy3",
   "message": "Mexico \n\nDuring my younger years, I travelled solo everywhere. The travel agent suggested Cancun, the all too familiar tourist trap.\n\nThe first day was good.\n\nThen I sprained my ankle on a go cart boat.\n\nAs time went on (I stayed for a week),\nI got rufied at a club before getting totally taken advantage of….\n\nThe next 4 days were spent in bed due to the salad I’d had that same night…\n\nIf all that wasn’t terrible enough, the only thing to watch on TV was The Mission Impossible movie, over and over again. And I hate Tom Cruise.",
   "created_utc": 1699709278,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s5dlg",
   "message": "jail",
   "created_utc": 1699709493,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s5hvo",
   "message": "Indiana resident my entire life. Took the wrong exit in Gary once and ended up in the heart of Gary. Broad daylight. Didn't matter. Never felt so unsafe in my life. Never again!",
   "created_utc": 1699709553,
   "score": 1,
   "submission_id": "17srbzl"
  },
  {
   "comment_id": "k8s5q65",
   "message": "I've had a few thoughts that I never want to visit again",
   "created_utc": 1699709670,
   "score": 1,
   "submission_id": "17srbzl"
  }
 ]
}