{
 "submission_id": "17wdf8c",
 "title": "What’s the scariest 100% true story you’ve heard of?",
 "selftext": "",
 "created_utc": 1700107086,
 "permalink": "/r/AskReddit/comments/17wdf8c/whats_the_scariest_100_true_story_youve_heard_of/",
 "score": 185,
 "url": "https://www.reddit.com/r/AskReddit/comments/17wdf8c/whats_the_scariest_100_true_story_youve_heard_of/",
 "comments": [
  {
   "comment_id": "k9h57qm",
   "message": "[removed]",
   "created_utc": 1700122008,
   "score": 1,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h5lta",
   "message": "One of my friends family growing up had a beach house and I'd get invited every now and then. \n\nThey had $ and the house was massive, pretty cool place too. They even had a full time maid who had her own 'flat' at the back.\n\nOne day they go there for a long weekend and when they opened the door, the place had been ransacked. It was all a mess, missing TVs, furniture, broken stuff... you get the picture.\n\nThey went to check on the maid and her flat was empty, all her belongings were gone.\n\nThey called the cops who came over and had a brief look (not interested from what they said) and left saying the maid probably had something to do with. And that's what everyone believed for week.\n\nUntil the dad returned the following weekend to try and change the locks and etc and he brought their dogs along with him. Yep, you know it... one of the dogs started digging and found the maid buried in the backyard under a tarp they had close to the pool. So the theory now is that whoever came in probably knew her and she recognized them and 'she had to go'",
   "created_utc": 1700122311,
   "score": 211,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gq5i7",
   "message": "The story of The Lake Nyos Disaster.\n\nThe lake periodically belches a cloud of invisible carbon dioxide gas that suffocates everything within a 16 mile radius. In 1986, over 1700 people and all their livestock died without even understanding what was happening to them.",
   "created_utc": 1700111814,
   "score": 192,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gxni7",
   "message": "I work midnight shift at a gas station and I have for quite awhile at various stations in different areas with varying levels of criminal activity.\n\nI have regulars, of course. I’m a small-statured woman (as is my partner the other half of the week, and we’ve always been partners) so these regulars often worry about us and keep watch on creepy occurrences when they can.\n\nI had one man who worked in the metro an hour away who would stop in every morning for his cigarettes. He never smiled or seemed friendly, and as I often do, I tried to think of what I could do that might make him smile one day.\n\nIt took many months but I finally pulled it off by having his cigarettes ready on the counter and already scanned for him to pay for as he walked in. He smiled, and then asked me\n\n“Do you ever get scared on the night shift? You small girl, is not safe.”\n\nI said I sometimes did but we could lock the doors and hide if we had to, and that the provincial police (think state troopers, if you’re American) had a station close by and came in often to get their highway vehicles washed. I had a good rapport with those police. He nodded and then told me a story about when he first moved to our country from Eastern Europe with his wife and child back in the late 80’s, early 90’s.\n\nHe fell asleep at work one night at the gas station he worked midnights at. When he woke up, the phone had been ringing for hours and his manager was shaking him violently asking if he was alright. He was fine, he said, what was the problem? He was sorry he fell asleep.\n\nHis manager screamed that it was fine he fell asleep, to look outside. All of their motor oil was missing and the outside of the place was a mess.\n\nThe thieves had come and swiped all the oil and left him be because he slept through the entire thing, and then moved down the road to the next station for an encore. At that station, the clerk was awake and fought back, so the thieves stabbed him to death and left him to bleed out.\n\nWhen he finished telling me this, he concluded with\n\n“If you ever feel sleepy just lock the door and do it, it might save your life”\n\nI don’t work at that station anymore but I think about that guy all the time and wonder how his grandkids are.\n\nHere is a link to an article talking about how that poor other clerk’s killers were finally found 25 years later:\n\nhttps://toronto.ctvnews.ca/mobile/arrest-made-in-1990-murder-of-gas-station-attendant-1.2650933",
   "created_utc": 1700116496,
   "score": 97,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hjy7k",
   "message": "My uncle was in a bar one night and started talking to this random guy. He described him as \"a really nice guy.\" \n\nHe met him a few other times in the same bar. They drank and talked about random stuff. Soon after, my uncle stopped seeing the guy at the bar. \n\nIdk how long after, but my uncle got notified that he had jury duty. He showed up and found out what it was for. A serial killer and the killer was his friend from the bar. Derrick Todd Lee. \n\nMy uncle was promptly dismissed from jury duty for obvious reasons.",
   "created_utc": 1700133477,
   "score": 77,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gr0dz",
   "message": "[removed]",
   "created_utc": 1700112309,
   "score": 6,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9glbm3",
   "message": "One of my parents' neighbors had shingles so bad that he committed suicide.",
   "created_utc": 1700109173,
   "score": 212,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h605j",
   "message": "Well, it's my story. When I was a little kid, 5-6? we had this neighbor like Grandma to me. I'd go over and have snacks, and she had a Mr. Potato head I played with that was her (now adult) son's toy. Weird core memories!\nHe came home, in his twenties, from the army I think. I don't remember much about him, but he asked about taking my older brothers camping, but my mom said no, she had a weird feeling about him. (Side note, we lived out in in the country, not even a town, just a place). There were no locked doors, everyone trusted each other.\n\n My mom saw him at our little store with bee stings all over and was concerned . He said he got them at the creek. She thought that was weird, because that's just not a thing where we went all the time, but okay? \n\nA little while later (not sure how long), the news said there was a murder of some campers out past where we lived, no leads. People were shocked - this doesn't happen here!  My mom remembered her weird feeling and the bee stings that didn't make sense. She called the police to say, hey, probably nothing, but here's what I got. I remember detectives coming to our house to talk to her. \n\nThey had some other evidence that matched, but not enough to link him to the murder (a couple with their child). It's unsolved to this day, though the detective said he knew it was him. A few years later, the guy went to prison for an abduction/attempted murder of a woman who ran out of gas and he offered her a ride. She lived, thank god.",
   "created_utc": 1700122625,
   "score": 154,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hd4gn",
   "message": "In the 1990s, a nurse in New Jersey killed hundreds of hospital patients.\n\nSometimes he would sneak into patient's rooms at night and inject them with fatal medication doses. Other times, he would put the medication into IV bags in the supply room, so they would kill whatever random patient they were given to later. \n\nHe was accused several times. Some patients pointed him out before they died. Some staff thought he was creepy and dangerous, and refused to work with him. He kept getting fired from hospitals. But the hospital managers knew that if he got arrested, they would be sued by the families of the patients he murdered. So they just fired him, and didn't call the police.\n\nThat happened at 12 different hospitals over the course of 16 years. Investigators believe he killed as many as 400 people. \n\nAfter he was arrested, he confessed to 40 murders. In 29 of them he gave enough detail to be charged and plead guilty. He is linked to 300+ more deaths than that, but details of those will probably never be known, because so much information was lost over time or destroyed by the hospitals.",
   "created_utc": 1700128280,
   "score": 140,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gt1wp",
   "message": "World War II, the Pacific theater. My great uncle on my mother's side fought at Okinawa. While taking cover behind a rock, he was shot through the foot by a Japanese sniper and evacuated to a hospital for recovery. He was the only member of his platoon to make it off the island alive.",
   "created_utc": 1700113521,
   "score": 251,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gooif",
   "message": "My high school gf called late one night after I was home and in bed. She said that something had happened and asked if I could come over. She was clearly shaken and not full of details. So I told my parents and drove over towards her house. \n\nAt the top of her subdivision I was met by a cop with lights on. He asked where I was going and I told him about the call from my gf. He lets me go by and I come over the hill to the cul de sac where she lives and I see multiple cop cars around the circle. They watch me pull up and get out of my car. My gf comes running out of her house and meets me in the street. She explains that someone had broken into her neighbor’s house and started beating her with something heavy. The neighbor managed to get out of the house and headed to my gf’s house where she started banging furiously on the front door. My gf’s dad was out of town, so her mom answered the door and the neighbor just fell into the foyer bleeding profusely from the head. Her mom looks up to see the attacker headed up the walkway towards the front door. She pulls the neighbor into the house and closes the door hitting the attacker with it before it fully closed. He then took the heavy tool he had used to beat the neighbor and smashed the little window at the top of the door. Her mom started screaming and the attacker just turned around and walked up the street into the darkness.\n \nI spent the night there that night (along with two or three cops outside in their cars) and in the morning we could see blood still pooled on the floor in the foyer and splattered blood above the front door from where the attacker had swung the bloody tool to smash the window. \n\nNo one was ever caught or even identified. It was just completely random. \n\nThe neighbor survived and to my knowledge had no permanent physical injuries beyond scarring from having her scalp stapled shut. She moved away shortly after the incident. \n\nEdit : Update on victim’s status and paragraphing, though probably not correctly. \n\nTLDR: gf’s neighbor was brutally attacked in her home. She ran to my gf’s house and the attacker fled after nearly getting into their house too. No one was ever caught.",
   "created_utc": 1700110977,
   "score": 7,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gq7ju",
   "message": "My aunt fell asleep on her couch one night and my uncle was asleep upstairs. She woke up around 12am to a random man staring at her while she slept. He said “the guy upstairs was sound asleep.” Meaning he came in, saw my aunt on the couch, looked around, saw my uncle asleep upstairs, and then sat there and watched. She told him to leave and somehow by the will of god HE LEFT. He slid in through the back door……. We live in a relatively safe area! Craziest shit I have ever heard",
   "created_utc": 1700111846,
   "score": 80,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hh1mp",
   "message": "This only happened earlier this year; a work colleague was off work for a long time, not like him at all. When he eventually returned we found out that his friend had been murdered by a group of football(soccer) wankers.\n\nThey'd been in a pub watching a match for the team they supported; they were celebrating a win when a group of men from the opposing team got angry and started arguing. When my colleague and his friends left the pub, they jumped his friend and beat him so bad he ended up in hospital where he eventually succumbed to the injuries.\n\n\nThis is one of the reasons I hate football, especially where I am (England). Riot vans, hundreds of police etc always around every train station and football stadium. Sad little men willing to take a life over a bag of air getting kicked around. It's not the first time, certainly won't be the last, someone has died over fucking football.",
   "created_utc": 1700131359,
   "score": 174,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h0bdk",
   "message": "I was around 10 years old. I was at school but my mum told me she was thinking of taking me to the doctors in the afternoon (recurring eye issue).\n\nLunchtime and I'm in the dining hall when the office woman told me there was a taxi outside for me and I needed to go. I assumed my mum booked it for me as she can't drive. I cleared up my stuff and got my bag.\n\nJust about to leave when I remembered my jacket in my classroom. I rush to get and head out for the taxi. Office woman tells me I'm too late and the taxi had gone without me. I just went back to class but panicking my mum would be angry at me.\n\nSchool finishes and my mum is waiting for me at the gates. I burst into tears apologising for missing the taxi and thinking I was in big trouble. She never ordered a taxi and had no clue what I was talking about. She ended up not making the doctor appointment.\n\nNo-one ever found out who ordered the taxi, or who driver was. My mum doesn't like to think what would've happened if I hadn't forgotten my jacket and got in that taxi.\n\nTLDR missed a taxi I thought my mum booked for me, only to find out it could have been an attempted  kidnapping.",
   "created_utc": 1700118358,
   "score": 214,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9i4b7p",
   "message": "My college girlfriend called me one night. \"The Baton Rouge Serial Killer\" had been active a while and she was being followed - all over town and even after going in circles -  by a while truck, which the killer supposedly drove. She fit the victim profile, she was brunette living in (house sitting for her aunt) a wealthy neighborhood.\n\nMy roommate and I drove over and we filed in line behind her and the triuck. She lived essentially ON the LSU grounds so I assumed it was a stupid student prank or something. She parks at her aunt's house, truck stops one house short of her aunt's and we pull in behind her.\n\nI explain I'm going to go diffuse the situation. Walk over to the truck, the FBI says the killer is a white guy, this man is African American. Explain no one is upset but he's freaking out my girlfriend, he needs to leave. He looks side eyed at me and drives off.\n\nI see the guy again a few months later, on the cover of the Baton Rouge paper, he's been arrested. He was the killer.",
   "created_utc": 1700144230,
   "score": 87,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hf12r",
   "message": "When I was learning to drive, my instructor advised me to always lock my car doors, as soon as I get into my car. I asked her why \u0026amp; she told me her personal experience.\n\nThis happened almost a year after she passed her test. She finished work about 3am. She just gotten into her car \u0026amp; gotten her keys in the ignition, when 3 guys jumped into her car. She had a knife to her neck \u0026amp; was told to drive. They give her directions to an alleyway. They dragged her out of the car \u0026amp; raped her. After they were done with her, they left her in the alleyway and stole her car \u0026amp; purse. It took her awhile to get help. Police did find her car a few days later, abandoned \u0026amp; on fire, on the outskirts of the city. But the guys were not caught. \n\nThe reason she started to teach driving, was her way to protect other women \u0026amp; make sure no one else goes through, what she went through. So she advised all her female students to lock their car doors, as soon as they get in.",
   "created_utc": 1700129795,
   "score": 76,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hiejp",
   "message": "This guy I used to work with, Rowan Baxter. Seemed nice enough but a friend I worked with and I used to joke about him being \"dead behind the eyes\" or call him \"old Shark-Eyes Baxter\".\n\nThis man followed his estranged wife while taking the kids to school. When she stopped at lights, got out and set fire to the car with her and the kids in it. Then killed himself, the fucking coward.",
   "created_utc": 1700132377,
   "score": 240,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hq71d",
   "message": "So when I was around 18 I went to town to drink something with my friends. We went all in and by 2 am I was completely wasted. Couldn't see, walk or think straight.\nOne of my mates remained sober to drive us back home. We went to the parking lot and I could hear a voice whimmering somewhere in the dark. I turned around and saw 2 guys carrying a girl to a car. I got closer and now I could hear her voice. She obviously was drunk but she repeated ,,no,, and ,,I don't want,, over and over. Adrenaline kicked in and I became sober instantly. I screamed at them and immediately called the police. I wasn't fast enough so they could get in the car and drive off. But I saw the license plate, gave it to the woman I talked to at the police station and they informed me about 10 minutes later that they arrested the two guys. The whole scene was so terrifying.\nThis was in Germany.\nEdit:\nThanks for all the nice comments and upvotes. If you need help dealing with sexual violence or need someone to talk:\nUSA: 988 I think\nGermany: 0800 116016",
   "created_utc": 1700137377,
   "score": 126,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hcldo",
   "message": "Not scary but disturbing, in my neighborhood there was an elementary school teacher, the elementary school that I went to. Apparently one day he became very angry, very early in the morning he chased his wife out onto the lawn, executed her with a shotgun then shot himself, all while I assume kids were headed to school.",
   "created_utc": 1700127853,
   "score": 229,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gzr4m",
   "message": "My grandfather's village was razed by the Nazis. He had 9 siblings. The Nazis came to the village in retribution due to guerilla attacks and they believed the guerillas were hiding there. Most young men fled before they arrived. The men that were in the village were lined up against a wall and shot. My grandfather's mother put half her children, the youngest, in the cellar and she took the other half with her because the Nazis were rounding up the entire village and locked them inside the church. The reason she had split her children was because she feared they would all be killed, so she wanted at least some of them to survive. The Nazis ransacked and burned nearly every house in the village, including my grandfathers. He was in the cellar with his siblings and their house burned above them, but they were saved. Those in the church also survived but many didn't. After this the Nazis would come again some time after and pretty much force all the young men and boys, including my grandfather, to help make roads and fortifications for them. Despite it all they all survived the war, though many in the family didn't.",
   "created_utc": 1700117954,
   "score": 251,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gkfrj",
   "message": "When I was a freshman in high school, I saw two men get in a fight, and one man put a gun in the other man’s mouth and told him to beg for his life - which he did. \n\n14 year old me peed his pants multiple times after that and needed counseling.",
   "created_utc": 1700108719,
   "score": 94,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hl9fb",
   "message": "When I was 17 I was hanging out with 2 friends and they wanted to go smoke weed in the woods. I didn't feel like it so I drove them and waited in the car.\n\nAfter a while I was getting bored and decided to go meet them but there were 4 paths going off in different directions so I just took the biggest one. After walking for a few minutes in the pitch black forest (before flashlights on phones), I come across this dip in the trail and on the other side is a bench lightly visible due to the moonlight.\n\nOn the the bench is sitting a man and another one in standing in front of him but I can only make out silouhettes. Being sure these are my friends I yell out to them before walking over. If you ever walked the woods at night it's just an uneasy feeling all around so I was cautious to begin with.\n\nWell it turns out, juste after yelling out to my \"friends\", both silouhettes turn around towards me. Not a word, not a sound, the guy sitting down starts sprinting FULL FUCKING SPEED towards me in complete silence. I got the absolute fuck out of there sprinting also the other way and tripping over shit because I couldn't see anything. \n\nI finally get out and lock myself in my car, but I was really worried for my friends. Maybe a minute later I see them both coming out of a completely different path, they also confirmed they never saw me or anyone else. My heart still sinks just thinking about that dude sprinting in silence wtf was that shit",
   "created_utc": 1700134365,
   "score": 8,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h4sb4",
   "message": "The case of [the Clutter family murders](https://en.m.wikipedia.org/wiki/In_Cold_Blood), told expertly by Truman Capote in his book, *In Cold Blood*. What really gets me about the case is that **all it took was one person knowing the family to make the connection that ultimately ended their lives.**\n\nFloyd Wells, a former employee of the father, told his cellmate about the Clutters and that inmate (Richard Hickock) became convinced the family had a fortune stored in a safe at their house. Upon his release, Hickock contacted another former cellmate, Perry Smith, and they planned to rob the family.\n\nThere was no safe and no fortune. Instead, the pair left with a small radio, a pair of binoculars, and less than $50 cash, along with the lives of Herb, Bonnie, Kenyon, and Nancy Clutter.\n\nA quote from Hickock talking about Herb has especially stuck with me: \"I thought he was a very nice gentleman. I thought so right up to the moment I cut his throat.\"",
   "created_utc": 1700121684,
   "score": 15,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hi3b3",
   "message": "My grandfather was a British FEPOW in Japan in WW2. He did something to piss off the guards of his camp one evening and they beat him badly and tied him up on a fence with the promise to kill him the next day. Another young prisoner died during the night so they switched my granddad and the dead lad so the guards assumed he’d died from his injuries. Luckily he survived and came home in 1945",
   "created_utc": 1700132145,
   "score": 243,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h7y9r",
   "message": "A chimpanzee named Travis attacking his owner's friend.\n\nTravis attacked and mauled his owner's friend, blinding her, severing several body parts, and lacerating her face, before he was shot and killed by a cop.\n\nThe owner called 911 during the attack. Travis' screams can be heard in the background at the start of the tape as the owner pleads for the police. Initially they believed the call to be a hoax until she said, \"He's eating her!\"",
   "created_utc": 1700124146,
   "score": 49,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gt7oq",
   "message": "[The murder of Sylvia Likens.](https://en.wikipedia.org/wiki/Murder_of_Sylvia_Likens)\n\nIt's equal parts heartbreaking and scary (due to the fact that humans can be so cruel).",
   "created_utc": 1700113621,
   "score": 80,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9i5k3y",
   "message": "My brother was dating the love of his life up until a few years ago.\n\nThey met because the both worked in a restaurant, he was a piano player, she was a waitress. Things were going amazingly between them.\n\nThe only problem was, she had a jealous ex.\n\nHe knew when they left work, and what shifts they'd work since it was the same each week. He decided for whatever reason he was going to teach my brother a lesson for dating his ex, and planned to attack him with a stanley knife when he left work one evening.\n\nThat night, my brother and his partner were getting ready to leave, and he stopped for a second to talk to a colleague, meaning she left first.\n\nAs soon as she stepped out the door, he slashed her throat, and then ran. She died infront of him. That attack was meant for my brother.\n\nHe's gone through a lot of therapy, and down some very dark paths since then. But is finally coming out of the other side of it. But it's terrifying how close I came to losing my little brother, and how much he lost as a consequence, because of some fucking deranged nutjob.\n\nIf I could get my hands on that guy, I'd get locked up myself. But he's in prison for a long time, and so far he's staying there.",
   "created_utc": 1700144751,
   "score": 175,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hpwyw",
   "message": "When I was about 18 my friend and I went to the movies and then decided to walk home. It was a bit of a walk but we didn't want to pay for a cab. \n\nI'm always pretty vigilant when walking, especially at night, so I noticed a guy with his hood up walking behind us. Every so often I'd look over my shoulder to check on him. He started pretty far behind us but was gaining ground weirdly quickly. The last time I turned my head I caught him SPRINTING at us. I panic and tell my friend to run for it. She's in those fucking Birkenstock slip on sandals that were popular then and she's struggling to run so I'm dragging her until we get to a gas station. I bang on the window and beg the clerk to let us in but he says he can't because it's past a certain time at night but he promises if the guy comes near us he'll call the cops. The guy comes down the hill, through the gas station, staring at us the entire time. I swear the only reason he thought better of it was because the gas clerk had the phone visibly in his hand (plus he was a big guy).\n\nI completely broke down after he left. Just the thought that he was running at us while I had my back turned scares the shit out of me. What if I hadn't turned when I did that last time?",
   "created_utc": 1700137221,
   "score": 84,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hz59p",
   "message": "Every 'orphan source' report from the IAEA is terrifying and well documented with pictures.  One of the most horrifying is the Goiânia accident in 1987.\n\nFor those who don't know, an orphan source accident is when radioactive material that had been lost (usually from an abandoned hospital), is discovered by people unaware of the danger who inadvertently expose themselves and others to lethal and/or permanently disfiguring doses of radiation.  You read in horror as survivors describe people inviting their neighbors to see the oddity they found and share samples, children playing with the sparkly dust, all unaware that they have just doomed themselves.\n\nAcute radiation exposure is a truly nightmarish way to die.  Your flesh rots away over months while skin grafts are ineffective.  You deteriorate in pain in the hospital until you die of infection or necrosis.\n\n[Wiki article](https://en.wikipedia.org/wiki/Goi%C3%A2nia_accident)\n\n[Official report](https://www-pub.iaea.org/MTCD/publications/PDF/Pub815_web.pdf)",
   "created_utc": 1700141924,
   "score": 165,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hz84z",
   "message": "The other night, my wife took our child out for several hours. In that time I wrapped up work, then left to get dinner around 4:30pm. Got home around 6:30, played with our dog and did a few chores,. Then, when my wife got home about 7:30, we relaxed a bit and I headed for bed about 9:00pm (usually up early with our kid).  \n\nMaybe two minutes after crawling into bed I get a text from my wife with a picture of our dry-erase menu board on our fridge. See, usually at the start of the week, my wife will fill out a rough menu for dinners that week. I remembered seeing it earlier in the day and it was filled out as expected.\n\nThe picture she sent was of the menu all scrambled up, like the letters were all moved everywhere, with random words and squiggles throughout. Some of it was her writing, but others were incomplete words, or rewritten words in handwriting that wasn't hers or mine.\n\nThis freaked us out, as our one year old certainly didn't do it. The county Sheriff showed up and swept the house and found nothing. Nothing was out of place or missing either. He was spooked by it a bit too. He said they never get a call out in the country where we are and recommended we change our locks (we hadn't as the couple we bought our home from were elderly). So, we did that night.",
   "created_utc": 1700141961,
   "score": 76,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h2p6o",
   "message": "A robbery at my place but the way in which it happened.\nI lived in a basement suite with my younger brother of a quiet neighborhood. The entire front of the house is exposed to the sidewalk but the sides and the back are covered with fenced and trees. The only way to see if anyone is in the basement is through this small window in my bedroom that’s about 5 feet from my bed.\nI got word while I was out that my place had been robbed. The robbers went through the basement suite door through the back, kicked it open, then made themselves upstairs after robbing the basement suite.\nThey just so happened to rob the place in a 30 minute window when myself, my brother and the people upstairs were out. This means they were watching us for a couple days and monitoring our patterns. \n\nWhat scared me was not really the robbery, but the image of me sleeping while a robber presses his face against the window 5 feet from away from my bed just watching me.",
   "created_utc": 1700120109,
   "score": 253,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9ht9wr",
   "message": "Not as scary as some of the other stories here, but a good cautionary tale for those who never experienced a dictatorship.\n\nMy father was in his last year of high school. Brazil's dictatorship period of 1964 had started a few years before. One day, two soldiers come into the class, grab one of my father's classmate by the arm and take him out. Neither the classmate of his family were never seen again. No explanation, no warrant, no process, they just vanished.\n\nMy father and his brother told us stories of the \"spies\" who would appear at times on schools and universities. Random \"students\" who would sit in for a couple of classes, sometimes even befriending classmates if they stayed longer. When those \"students\" stopped coming, usually another real student would disappear too.\n\nWhen the military government issued what is called Institutional Act Number Five (AI-5), it suspended basically every civil right, and the military could just enter people's houses, search whatever they wanted, take whatever and whoever they wanted, and leave, no explanations needed. People were tortured and killed to \"save the country from communism\" (which was never a real threat to begin with).",
   "created_utc": 1700139045,
   "score": 31,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hyrhc",
   "message": "Something weird happened to me; more scary in a what could have been kind of way, so not on the same scale as the poor people in the comments. \n\nI was 17 years old (male) and walking home from a night out quite drunk and stoned about 2am. I’m in a lonely part of my walk no people, few cars: just a road and some large shops: a B\u0026amp;Q and a carpet showroom - out of town shopping complexes that have since become ubiquitous in the UK.  \n\nAnyway, In a lay-by about 15 feet away is a silver car pulled up lights on. As I stumble past two men step out and call me over. \n\nSomething about the situation immediately sobers me up. I keep walking and one of them shouts “it’s fine we are the police: we will drive you home”\n\nI stop for a moment and reply with some smart arse comment along the lines of how police would never do this and that they were dodgy. \n\nCalling them dodgy always sticks in my mind. \n\nHe insists I’m too drunk and it’s not safe  for a young man like me and I should let them take me home. \n\nI say no and he then tells me to come over here and listen to the police radio in the car to prove they are real police. It’s weird the guy is almost begging me; desperation in his voice. \n\nI repeat a firm no, tell them I’m fine and keep walking. Minute I’m out of sight, I run as fast as I can and don’t relax until the 30 minutes later I’m home. \n\nI can only assume they didn’t man handle me into the car because there was the very occasional taxi driving past. \n\nIm 45 now and occasionally think about how that  could have ended for me. None of the scenarios seem good. \n\nSadly stories like this are probably  more routine for women but at the time it really shook me up.",
   "created_utc": 1700141748,
   "score": 15,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hrutt",
   "message": "There was an incident in Trinidad where some maintenance divers were removing a plug from an oil pipeline and were instantly sucked into it. One was able to escape but the other 4 were trapped for days in a small, oil coated pipe for days with only a small air pocket to breathe in before they died. Thinking about it in detail and imagining what it must have been like for them makes me extremely uncomfortable.",
   "created_utc": 1700138295,
   "score": 133,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h9dyz",
   "message": "Some guy from Malaysia applied for a job application which needed him to travel to Cambodia.\n\nIt ended up a scam where he got basically imprisoned and forced into working as a scammer for some crime syndicate and he somehow escaped, but the syndicate is still out for him and caused irreparable harm to his marriage. It’s a fucking horror story and I can’t believe it’s real.\n\n[Documentary for those interested](https://youtu.be/PhAgBjVGPIM?si=PSVnglo7TGY3vme4)",
   "created_utc": 1700125291,
   "score": 122,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hhmxh",
   "message": "Friend of mine (100% true) was SA and had her mother murdered by a young neighbour who had become obsessed with her. He'd waited until her dad and brother had left for work then entered the house, stabbed the mom in her bed, and attacked her. All the time taunting her about what he'd done to her mom and how she'd better let him finish so she could see if her mom was still alive.....  he was 15. Truly evil.",
   "created_utc": 1700131804,
   "score": 244,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h5l03",
   "message": "My mom is from El Salvador, she lived there at the height of the civil war. She told me that one time, the terrorist group in her country found out someone in her town was part of the military. He had twin daughters with extremely long hair. They tied their hair to the trailer hitch of their trucks and proceeded to do donuts in the middle of town and drag them until they both died, they then left their bodies on his front door",
   "created_utc": 1700122293,
   "score": 138,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hlkim",
   "message": "I'm the firstborn, and when I was just a wee babe, my mother put me to bed and headed off to bed herself. \n\nBeing new parents, they were all about the baby monitor. Dad was already asleep, and just as my mom was drifting off, she heard the telltale crackle,\n\n\"Don't worry, sweetheart, mommy's here.\"\n\nNeedless to say, my mom about shit herself and catapulted to the nursery...to find me fast asleep and totally alone.\n\nTurns out the neighbor had just had a baby too, and they were picking up each other's signals.\n\nThey actually picked up all kinds of things over time. Used to hear the truckers radioing to each other from the highway like a mile away.",
   "created_utc": 1700134569,
   "score": 37,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hph7z",
   "message": "Girl I briefly dated 10/11 years ago lived alone in 1br apartment.  Every other morning she’d wake up, there was dirt/mud beside her bed.  This happened for 6 or so weeks.  One night she woke up and there was a homeless man standing beside her bed masturbating.  She screamed and he climbed out of the window.  Turns out she was 1 of 4 girls in the neighborhood that this was happening to.",
   "created_utc": 1700136968,
   "score": 118,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h0p42",
   "message": "Up to this day, I'm still looking for a logical explanation to this. This happened in 2003. \n\nSo I and an ex were checked in, in a coastal resort where the cottages were far apart, like 200m away. \n\nAround 11-1130pm while we're both drinking beer with the lights turned off and only the TV on, the door knob suddenly rattled violently, like someone was forcibly trying to get it open. \n\nThere was no double lock on the door so my first reaction was to jump from the bed and block the door with my weight. The force of my landing must have been heard from the other side but the twisting of the doorknob continued. \n\nBy this time I was already pressing my face to the floor, trying to look/estimate how many people were outside the door via the small gap between the floor and the bottom of the door. \n\nThere was nothing. Not one pair of feet or anything. But the door knob just kept rattling.\n\nI should point out that the gap between the floor and the door was enough for me to see the outside, or at the very least notice any change in shadow/light caused by movement, but there was nothing. \n\nThe turning of the door knob then stopped. But I never heard any footsteps or any other noise. \n\nWaited a few minutes and opened the door. Everything was quiet. No foot prints outside or on the sand surrounding the cottage. \n\nWe just noped out of there immediately.",
   "created_utc": 1700118636,
   "score": 198,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h81lx",
   "message": "My great grandpa was a combat medic in the army. He was climbing the cliffs on D-Day at Omaha beach without a gun, having to stop and remove bullets, bandage wounds, and other things all while people with machine guns shot down at him. \n\nThe fact that he got to sit in his favorite leather recliner and tell me that story some 70 years later is a miracle.",
   "created_utc": 1700124220,
   "score": 18,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9he6et",
   "message": "I’ll take “posts I shouldn’t click on at 2am” for $1,000, Alex",
   "created_utc": 1700129131,
   "score": 189,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hbs8w",
   "message": "I grew up in South Africa circa 90s and 2000s.\n\nDon’t remember much about the 90s but I do remember the 2000s. Everyone I knew had been a victim of crime of some sorts. I had 3 cars stolen from my driveway. My parents house were broken into 28 times in one year (a semi good neighbourhood called sunning hill in Joburg). My parents were hijacked where my dad ended up with facial surgery. Friends and family have all had some exposure to crime. Ask any expat here in Australia, England, New Zealand, America…all have similar stories.\n\nIt is because of that, that I had an imaginary situation that repeated in my head so many times. If I were to be hijacked…what do I do? I’ll suck my head below the dashboard and floor it. I don’t care if I kill the person…I just want to make it out alive. In 2003 it ‘inevitably’ happened. And I can tell you there are two different people on this earth.\n\n1. The guy that went viral for driving a (cash in transit van or Ute) and was shot at and managed to escape with defensive driving. https://youtu.be/oGZLYx8StWk?si=51HIeiKiebiwZSh5\n\n2. Then there’s guys like me. I drove from Durban to umhlanga one evening and on the highway 4 gunmen appeared. The scenario didn’t play out the way it did in my head. I stopped about 50m past the hijackers.  Not because I wanted to. I was scared shitless to the point where I tried to press the accelerator but my muscles wouldn’t let my foot work. I was paralysed with fear. They took everything except my life.\n\nIn 2011 it happened again. But this time (with 10 more years of driving experience and dealing with more crime), I was angry as a Rabi dog. I did not stop. I was driving towards them with red in my eyes. Shooting at my car. I got home okay, but jumped on the internet and applied for a visa to Australia. 2 weeks later my visa was granted and 2 days later I was on a plane.",
   "created_utc": 1700127201,
   "score": 14,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hwvuu",
   "message": "Jeff Bush\n\nA sinkhole opened up beneath his bed while he was sleeping and pulled him into the Earth, never to be seen again.  That's fucking horrifying.",
   "created_utc": 1700140856,
   "score": 198,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hir7q",
   "message": "Came home to find out that someone had broken in to my appartment and a lot of my things were missing.\nRan outside to find a payphone and called the police.\nWhen i came back to my appartment even more of my things were missing, so i guess he was hiding under my bed when i first found out.",
   "created_utc": 1700132632,
   "score": 86,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9go1dq",
   "message": "[removed]",
   "created_utc": 1700110614,
   "score": 45,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hdhgo",
   "message": "[The Nutty Putty Cave Incident ](https://cavehaven.com/nutty-putty-cave-accident/)\n\nJohn Jones was a cave explorer who died in 2009, attempting to explore the Nutty Putty Cave in Utah.\n\nI cannot understand people who go caving. Especially here - it's the type of cave that you have to explore by popping one shoulder, then the other, through a narrow slit in the rock and then inching forward by your fingers and toes. You're under tons of rock, it's cold and silent, and pitch dark. Even if all goes well that sounds hellish to me. But it didn't go well.\n\nPart of the cave is nicknamed The Birth Canal, and it's a nearly vertical descent about the width of a washing machine door. But John misses his turn and goes into the wrong passage, a dead end. So he ends up trapped upside down, underground, with his hands pinned backwards underneath him, for 29 hours. Other cavers in his party get help, and for most of it he seems optimistic (if a little embarrassed). But all the while his heart is struggling to pump blood upside down and CO2 is building up around him. There's a massive rescue effort that nearly manages to winch him out with climbing ropes, but one of the pulleys breaks loose and he falls back in and gets wedged deeper. He's stopped responding. The rescue is abandoned.\n\nJust absolutely makes my skin crawl from secondhand claustrophobia...",
   "created_utc": 1700128573,
   "score": 179,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gja4p",
   "message": "The legend of Bearman. \nSo people think of that one South Park episode with bear man pig, no, it’s not even close to that. \nSo there was this camp I use to go to during the summer. \nThere was probably around 500 kids there for a week straight. \nEveryone had cabins they would stay in assigned by gender and age and had an older person be in charge of one cabin. \nThe older person was around 17-18 watching 13-16 year olds in the cabins.  \nAnd then the staff were actual adults who had their own cabins but they would be on night shift duties to walk around and make sure everyone was staying in their cabins. \nSo now that you kinda know the  setting let’s get into the legend. \nAs it goes, in the woods and when all the kids were in the cabins and the lights were out a bear would come out from the deep woods and wonder into the camp grounds. \nThe bear would then stand on its back legs and walk as if it was a human. \nThen it would choose to go into a cabin and if you were unlucky it would go by your bed and watch you sleep. If you made any single move it would grab you and take you into the woods never to be seen again. \nHearing that scared the crap out of 14 year old me. \nIt was something the older girl told all of us. \nA bunch of the other girls were like “pfff it’s so we stay quiet and sleep”, but other kids from cabins heard of it too.\nI never stopped thinking about it and I would always try to stay as still as possible when I slept. \nFlash forward a few years later, I ran into one of the staff that use to work at the camp and I told them about how scared I was about bearman but it was a good trick to use to get kids to stay quiet. \nWell turns out, it’s actually based off a true story. \nI guess back in the 80s, a man dressed in a bear costume which was some sort of mascot for the camp at the time, and take girls out of their cabin. \nSoooo, as you could imagine to my horror, I was completely bewildered that bearman actual existed at some point in time.",
   "created_utc": 1700108133,
   "score": 142,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gxs63",
   "message": "I would probably say one of the overdoses I’ve responded to, kid was black , no pulse …. Nothing. Hit him with 5 doses of nasal narcan and chest compressions before he woke up and refused treatment the paramedics on scene",
   "created_utc": 1700116583,
   "score": 183,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hhj7y",
   "message": "My grandpa and his hunting buddy were out moose hunting years ago, when my mom was still a kid. They were about an hour into a hike, looking for a big bull, when they decided to split up to cover more ground. My grandpa, after about 15-20 of walking through dense brush, came into a small clearing of trees. And a mama grizzly and her two cubs. \n\nAlmost instinctively, my grandpa scramble up the closest tree, just out of the angry mama bear’s reach, even kicking at her snout a few times. After circling and scratching at the tree he’s in, Mama Bear ambles off into the brush, her cubs right behind her. When he thinks he’s in the clear, he starts climbing down, but a crashing from the same bushes Mama Bear walked into makes him go straight back up the tree. \n\nShe must’ve seen him trying to climb down, because she charged right back at him, now furiously snapping at his feet and shaking the tree. Again, after circling the tree and growling up a storm, she leaves a second time, and again, my grandpa waits, but a little longer. He manages to carefully make his way down and sort of speed-walks in the direction where he and his buddy parked their truck. \n\nMama Bear had *definitely* been watching, because as soon as he was almost out of the clearing, she came charging out once more. He quickly shot up another tree, this time a little higher up than his previous safe spot. After a good long while of her snarling, shaking and scratching the tree and overall terrorizing my grandpa, she left, this time a little faster. \n\nMy grandpa was in that tree for what seemed like forever, listening carefully for any movement, but after about half an hour, he slowly made his way down the tree, pausing every so often to make sure Mama Bear wasn’t just peeking over the brush, waiting for him. After making it to the ground and checking to see if the coast was clear, my grandpa made a quick but quiet getaway back to the truck, where his hunting buddy was waiting, equally empty-handed. \n\nWhen questioned why he didn’t bring anything back, my grandpa explained he just had a run-in with the world’s most persistent mother bear. That was explanation enough.",
   "created_utc": 1700131728,
   "score": 245,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hklvs",
   "message": "Back in 2019 \nI was in a place in thailand for people who got caught on drug using.Its like a prison for children.One day the new prisoner transfer in he was a young 17 year old boy with good skills in sport(he is the best player of country badminton club)The second day he arrive he come to me and say hey you wanna escape this place with me? I refuse.Next day we all being call to gather in center hall and his dead body is lying there and cops every where.\n\nThere the story is : after i refuse to go with him he do the escape thing itself at night.He climb through the wall then start swim cross the river but at last he couldn't make it. The police said he drown like 12 hour before someone see his body. \n\nAfter the thing happened i was in shock for 2 week my mother have to take me to another hospital .\n\nRest in peace my friend \n\nSorry my english is very bad",
   "created_utc": 1700133926,
   "score": 244,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9i3zu8",
   "message": "My grandfather's stories from being in Auschwitz concentration camp for almost 18 months. I don't know why he told us those stories; but I think he felt it important that we know. He painted a picture of horror that more than 30 years later, I can still feel whenever I think about them and even as I write this comment, gives me goose bumps.",
   "created_utc": 1700144094,
   "score": 167,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hrvrh",
   "message": "I fell down a YouTube wormhole of people finding cars in water and recovering them. \n\nIn more than one they talk about loved ones with memory problems getting lost,  and they often find their cars in places where they most likely drove in on accident rather than intentionally ending their lives. \n\nDementia and Alzheimer's are already scary enough,  but the thought that a loved one might decide to go take a drive they've taken dozens of times and then they disappear for years... that's terrifying.",
   "created_utc": 1700138309,
   "score": 84,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9i6ybq",
   "message": "This story kind of creeps me out even to this day but I have a pretty good one\n\nI lived in mesa Arizona when I was 10 years old, we lived in a rough area but I was just a kid completely ignorant to the dangers of the world. I was walking back home from my friends house and my mother wanted me home by 9 and id always start walking back at around 8:40 to make sure I wasn't late, and its only like a couple blocks from my house so it wasn't a super long distance. it was around the time of year when the sun would set at 5:30 and be dark well before 7pm. so it was very much night time.\n\nAs I'm walking I hear a woman calling my name, I turned to look and see it was one of my moms friends, but she didn't know her too well. however I just saw that she was familiar and wont say a name, but I turned around and said hello and smiled. she walked up to me and told me my mom had called her and asked her to come get me and ride me back because something happened at my house, she said it was an emergency and that I needed to go with her and her husband whom my family was also familiar with.\n\nI was only about 5 minutes from my house but I was told it was an emergency and I agreed to go with her. As I'm walking I get this weird feeling in my gut and this shaking in my legs that I now today realize was my instincts being on HIGH alert. I stopped for a minute and asked if we could call my mom and she said my mother was in the hospital right now and that I need to hurry. right as we were opening the door to the car i hear my mother SHOUT my name as loud as she can. and i turned on a dime and quickly walked towards my mom.\n\nMy mom asked what's going on and the woman replies and says that she was just giving me a ride home because she saw me. Was not the story she gave me so I told my mother what she told me and asked what was going on. My mom just looked at me and she could always tell when I'm lying vs when I'm telling the truth. The woman then goes to interrupt me likely to lie and my mom cuts her off and just stared back at her with the most shocked look ever and these words still send shivers down my spine. she says in the most shocked voice ever. \"you were trying to take my son\" and the husband looks out the window hurrying his wife in the car and as I looked back at towards him, I can see a syringe on the dashboard leaning against the windshield that he grabs right as I see it.\n\nshe gets in the car because at that point my mom was ready to kill her, and reached into her purse because she keeps a pocket knife. but they drove away and right after they did my mom looked at me and just burst into tears saying \"I'm almost lost you\" my mom knew full well what was happening and I was still too shaken to even say anything and just hugged her back and we went home. I was still in denial and to cope, I would convince myself that maybe i wasn't in any danger.\n\nMy family ofc never kept in contact with any of them but my step dad at the time submitted a tip to the police of the incident. when they caught up with him about 3 months later we had found out that he was arrested for having CP on his computer and found restraints in his closet as well as some containers of Propofol. They found pictures of me from my moms Facebook downloaded on his computer as well, leading them to believe that I was actually being watched for a good bit.\n\nI never liked talking about it because to this day, if I hadn't stopped for those 10 seconds to ask the woman to call my mom, I don't know where id be or if id even be alive right now making this comment. and while it may seem like something that would have easily been forgotten, it was never the case for me. I haven't even told my closest friends this story but I might sometime soon. I asked my mom what happened that night, why she came looking for me. she described the same feeling I remembered feeling moments before I was almost abducted. just a lot sooner than I did. and just had the instinct that I was in danger.\n\nI'm not usually a lucky person, it seems the odds are always against me but I always remember how lucky I was that night, that my mom decided to listen to her instincts when I didn't. I've never ignored my instincts since and every night after that when I finally did decide to leave my house. my mom would walk with me all the way up until I turned 13 to come back to live with my dad. And that to date is the scariest thing I think I've ever experienced. its some shit you only hear of on the news and nobody ever assumed it will happen to them but my life was a mere 20 seconds from being completely different.",
   "created_utc": 1700145336,
   "score": 227,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hem0t",
   "message": "I'm 30 years old now. From about the age of 25, I began having extreme, vivid nightmares about being sexually assaulted by a very distinctive man. I had them almost every night, wake up sweating and crying. I had no idea why it  happening. \n\nA few weeks ago, my old primary school posted a picture of a grounds keeper that had passed. Sure enough it was the man in my dreams. I attended the school at the age of 6.\n\nI still don't know what exactly happened but through therapy I believe I was rapped as a 6year old and my mind chose to forget about it. But the monster never left my head and returned in my dreams to haunt me every night.",
   "created_utc": 1700129469,
   "score": 112,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hfe5m",
   "message": "Sad, true, and societally scary: \n\nWhile I was on life support, there was this other girl on a ventilator, just down the hall. \n\nLike me, she’d had all of the right symptoms: headaches upon waking, vomiting without nausea, and getting lost in the house where she’d lived for years. \n\nLike me, she researched them extensively.\n\nUnlike me, she reached the right conclusion, and asked her parents for a scan. But they had a bunch of other kids, and money was tight, and she was at the right age to see symptoms as unduly catastrophic. So they said no. \n\nMeanwhile, I was treating my symptoms with the gym. My mother had begged me to get a scan, and I’d said no. Until I had health insurance of my own, I couldn’t afford it, as it would show a preexisting condition that would destroy my future insurability. \n\nThe other patient took up three jobs to save the money for a scan. She made the rounds of several neurologists, begging. Each responded dismissively: she was too young, and looked so well that she had to be a hypochondriac. Finally, one took pity on her, and gave her a scan, telling her outright that it was only so that she’d stop asking, and that she’d hear results in some weeks. \n\nI kept going to the gym until the day that I collapsed, vomiting blood, bursting a pupil. \n\nShe went in for her first craniotomy walking, talking, fine. \n\nMy parents and boyfriend would sit beside me through my coma, holding my hand, telling me how much they loved me. \n\nShe’d have her own such trio, doing the same. \n\nI’d wake. \n\nI’d meet her parents, her boyfriend. \n\nI’d visit the ICU. \n\nI’d see them growing more gaunt, more desperate, each time, until the trip when I learned that she’d gone to long-term coma care. \n\nI’d recover. \n\nShe’d die. \n\nBrain cancer is that kind of a bitch. \n\nSince then, I’ve taken the survivor’s guilt to do everything that I can with my life… but that so easily could’ve—should’ve—been her outcome instead. That’s the outcome for so many. \n\nIt’s terrifying because it demonstrates how we, as a society, often dismiss the health complaints of all but a narrow slice of the population, without even registering that we’re doing it. How many lives do we, unthinkingly, throw away?",
   "created_utc": 1700130077,
   "score": 8,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9h8nu9",
   "message": "Either the murder of Junko Furuta or the brutal attack and torture that ended up killing Jyoti Singh. The fact that there are human beings _actively out in the world_ who can commit such evil.. I don’t know, both stories genuinely terrify me even years later after I first learned about them. Don’t know if that counts in this context but it’s the first thing that came to mind",
   "created_utc": 1700124712,
   "score": 165,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9haaxr",
   "message": "My personal scariest was  in 2013 I was driving about 40 or 50 feet behind this red truck at midnight. This is a decently long bridge that peaks in the middle, about 3/4th of a mile on either side.The roads on either side are also another straight mile of length open with no roads branching off. When you’re at the middle of the bridge you can see about 2 miles in either direction. \nWell I was following this truck just jamming to my music headed home from a GF’s house. For some reason right before the red truck crested the top I got a really weird feeling in my gut like when you’re on a roller coaster. The truck passes the peak and from my point of view you can’t see anything passed the peak until you get over it. About 4-5 seconds later I reach the peak and the truck is completely gone. I look down the long stretch and there isn’t a single vehicle. Even if that had been a Bugatti that slammed the gas pedal they wouldn’t have been able to drive out of my view by then. I tried looking it up if a red truck had driven off that bridge before and never could find anything. To this day I’m not sure but I can clearly remember that red Ford Ranger.",
   "created_utc": 1700126019,
   "score": 142,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hh1od",
   "message": "There’s an abandoned house in my town. Some dude inherited it after his aunt died. He’s just leaving it to crumble. But that’s not the scary part. \n\nSo this lady took in every stray cat she found. And she was good to them. They were always fed and healthy and brought to the vet often. \n\nShe was nice. To anyone who was nice to her cats anyways. She’d sit outside in spring and summer and nice autumn days. So when winter rolls around and she’s nowhere to be seen, people think nothing of it. \n\nThen spring comes. People realise she’s not out and after a week concerns arise. A wellness check is found and the cops get into the house. \n\nThey say the place stank of cat piss and crap and there was a lingering smell of decay. They walk around noting trash not taken out and stinking, cat carriers with tags on in a spare room. And then her room. They open the door and find her on her floor being eaten by the cats. She was long dead and decaying by then",
   "created_utc": 1700131360,
   "score": 198,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hkd1s",
   "message": "[removed]",
   "created_utc": 1700133758,
   "score": 80,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hj7ik",
   "message": "A man in my city dressed up as Santa on Christmas Day and slaughtered his entire family- killed his ex wife, their two teenagers, his wife's sister, his brother-in-law, his niece and then himself. Apparently he was having huge financial problems and the stress on his marriage made him snap. Google “Grapevine Texas Christmas Murders”. It’s so sad",
   "created_utc": 1700132956,
   "score": 135,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hog64",
   "message": "Not really scary, but messed up.  I know someone who was working in the middle of nowhere. He had to take a leak, so he walked over to a fence, and while he was pissing, he noticed a \"dead animal\" about 20 feet into the woods. After crossing the fence, he saw a pair of shoes attached. He called the cops and they came to bag the body. Turns out. It was an 80 year old lady who had her head and hands  chopped off. A young couple had stolen her tax returns, so they killed her, dismembered her,  and dumped her body in the woods. They had befriended her just to rob her.",
   "created_utc": 1700136368,
   "score": 64,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9gth6a",
   "message": "That tik tok about that girl finding a apartment behind her bathroom mirror. I mean what the hell is that shit. Then on lupin it’s show a whole house behind the mirror/wardrobe but wasn’t creepy or scary.",
   "created_utc": 1700113786,
   "score": 81,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hb5vk",
   "message": "One of my many experiences with night terrors/sleep paralysis left me with memory loss and now I have to live with the fact that my body kinda operated without me for a week.\n\nI was about 7 years old and woke in the middle of the night to find this smoke creature crawling up the bottom of my bed. It was terrifying, as you can imagine, and I booked it for the landing, which is weird for me because looking back I would have expected it to be sleep paralysis (I still get these occurrences often) but I could move perfectly well on this occasion. I reached the top of the stairs outside my bedroom and another one was slowly making its way up, step by step out of the darkness of the floor below. I froze and looked around for somewhere else to run to, but I was pinned because the first one was making its way through my bedroom doorway toward me. Both of these smoke demon things were advancing on little 7 year old me, so I did the only thing I could thing of: screamed the house down. \n\nMum comes running just as I start to go blind with smoke creeping into my vision. Blood pressure was wonking out - it was the same smoke I get when I stand up fast. Mum ends up soothing me, taking me back to bed, and at some point she leaves and lets me go back to sleep.\n\nNext morning, I apologise for waking her up last night. She has no idea what I mean and we’re both confused. I tell her “I woke you up on the stairs. I was having a nightmare.” She informs me that that happened over a week ago, not last night. I have no memory of that week occurring, not a single shred, but apparently I had gone to school every day, played with my friends, eaten my dinner, done my homework, had my baths - all without knowing that I had done it. Apparently I’d been kinda quiet during that week, and my mum assumed I was having trouble at school, which was not an uncommon experience for me. But I still, to this day, don’t remember anything after that night and it gives me the creeps to imagine that my body has done things - gone through the motions of every day life - without me having any knowledge of doing it.",
   "created_utc": 1700126705,
   "score": 65,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hhq9x",
   "message": "My mother's aunt and her family decided to move to Bangladesh during the Partition of India. Years later in Bangladesh's War of Independence from Pakistan, her uncles fought against the Pakistani army, they'd surrounded their house with one of them in it. Great-aunt sent him up to the roof and told him to pretend to pray to buy some time. He did and jumped from the roof into the river nearby when he got the chance. He was able to make his way to India to his family there (my mother describes him as a very jolly person) and was eventually able to contact his mother after some months. She had spent her time walking along the river, turning over dead bodies to find him.",
   "created_utc": 1700131874,
   "score": 119,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9iekok",
   "message": "I’m late to this but I have one. This is a reminder to solo travellers everywhere. This happened to me, it was terrifying, and I’m lucky nothing worse happened. \nI’m a heavily tattooed woman and I often like to travel to get pieces. I’ll make a whole trip of it, it’s like collecting memories you’ll have forever. With that being said, I booked a trip from Vancouver, Canada to LA for a piece. I was going to be spending 4 days there with my girlfriend but because my appointment was scheduled for all day Friday my gf didn’t want to miss a whole day of work while I’m in the studio all day, so we agreed I would go Thursday night, get my tattoo Friday and then meet up with her Friday night at our airbnb. Unfortunately I arrived at lax around 11pm, it was dark, I was alone in a city I had only been in once before when I was 12. I followed the map she wrote me to try and find the taxi area. Eventually I walk up to a spot where I see two taxi drivers standing and one of them asks me if I need a ride. I say yes, put my bag in the taxi, give him the address and away we go. It takes .002 seconds for this normal seeming guy to get creepy. I can see him staring at me through the rear view mirror as he’s asking me questions “what are you here for, are you alone? Are you Russian? Are you sure you’re not? I’d really like to take you out for some Russian food, you’re really not Russian? I’d like to take you out.” Nope, no thanks, no I’m not. \nWe get to the airbnb and I say thanks, go to get out and he says “I need to make sure you get in safe.” I said that’s not necessary, he insists. It’s past midnight by this point, no one’s around I’m in a quiet residential area and he’s persistent. I walk up to the apartment door and there’s a lockbox I need to get the key from. This man was clearly hoping it would unlock the door because as I’m typing in the code to unlock it he’s repeating the numbers back out loud… “9…6….3…1” it opens and I grabbed the key inside and go alright thanks I’m good now. He says “no. I need to make sure you get all the way in.” I’m panicking now. He follows me to the apartment door which happens to be on the first floor of course. Now he knows what unit I’m in. I open the door and slide in. I told him my big buff boyfriend was waiting for me at this place (I’m gay, I am the big buff man) and he sees that no one else is in there. I say thanks and go to close the door. He put his foot in the door so I can’t close it and goes “what, I don’t get a hug?” I just wanted this man to leave so I gave him a quick hug, pushed him away and slammed the door. I slept with a knife by my bed and had to make sure all the windows were locked. By the way ladies, if a man is asking if you’re Russian what he’s really asking is are you a sex worker, I found that out later. I am so SO incredibly lucky that nothing else happened. I was really shaken up though, I barely slept.",
   "created_utc": 1700148351,
   "score": 119,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9he8em",
   "message": "Sort of eerie I guess...\n\nMy mom had always told me to not approach/talk to strangers.\nOne day when I was walking home from elementary school from the bus stop which was around the corner and down a block, an older man drove up to me. I was on the right side of the road and he was driving towards me and parked next to me, so he was on the wrong side of the road in a residential neighborhood. He had a map in his hand and asked me if I could tell him \"where this street was\" as he pointed at the map. I took a couple of steps toward the car and remembered the lesson my mom had taught me and stopped and asked \"what street is it?\" He told me the street name and I gave him verbal directions and started walking again.\n\nSomething didn't seem right to me though and I don't get why he needed a map to ask where a street was that was not difficult to find. It was literally a few miles down the main road a block away.\n\nI just figured he wanted to kidnap me.",
   "created_utc": 1700129172,
   "score": 162,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9hd8ls",
   "message": "My friends got robbed at gunpoint a few blocks from our place, also saw a drive by shooting happen. We eventually moved from the city to a quiet suburb where the biggest risk is having you mailbox knocked over. Plus we have two county police officers that live on our small street. We like it here.",
   "created_utc": 1700128373,
   "score": 56,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9i11ju",
   "message": "Friend driving home at night on a freeway when someone jumped in front of his car and he ran them over. Stopped, called emergency and it turned out it was someone we knew pretty well, they lived in the same town and was not all there. The man died. \n\nFriend took it pretty hard, I don’t know if he ever got over it. One of the nicest people that would never harm anyone. \n\nI think about this every now and then.",
   "created_utc": 1700142791,
   "score": 57,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9it1hg",
   "message": "The story of Kyle Plush. He died in the back of his van in his high school’s parking lot. \n\nHe became caught after the third row seating flipped up and trapped him upside down while he was reaching for his tennis bag. He was able to use Siri to make two 911 calls. The first dispatcher sent police to the school and they searched the parking lot. About a half an hour later he made a second call where he gave identifying details about the color, make, and model of the van, but the dispatcher did not relay this information to the police, who were at the school at the time. He knew he was dying by the second phone call and asked them to pass a message to his mother. \n\nLater that night his father used Find My Phone to track him and found the van in the parking lot. He had suffocated. He died because the police did a half assed search and the second 911 dispatcher thought it was a joke.",
   "created_utc": 1700153755,
   "score": 58,
   "submission_id": "17wdf8c"
  },
  {
   "comment_id": "k9i7lwc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17wdf8c"
  }
 ]
}