{
 "submission_id": "17wkuhl",
 "title": "What are some bedroom tricks that actually work well?",
 "selftext": "",
 "created_utc": 1700134789,
 "permalink": "/r/AskReddit/comments/17wkuhl/what_are_some_bedroom_tricks_that_actually_work/",
 "score": 193,
 "url": "https://www.reddit.com/r/AskReddit/comments/17wkuhl/what_are_some_bedroom_tricks_that_actually_work/",
 "comments": [
  {
   "comment_id": "k9id2e4",
   "message": "pee before going to bed",
   "created_utc": 1700147773,
   "score": 142,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9in2jv",
   "message": "If you're afraid of ghosts ask it to go down on you. When u notice it doesn't, u realize there's nothing there.",
   "created_utc": 1700151591,
   "score": 173,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9iq8f7",
   "message": "I love how some of the tips are like \"Move your alarm clock\" while others are like \"Buy a cock ring to blast her booty cheeks\"",
   "created_utc": 1700152740,
   "score": 1,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i5yw6",
   "message": "Two comforters instead of trying to share one. Saved my marriage.",
   "created_utc": 1700144921,
   "score": 254,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i9mu6",
   "message": "I don't know but that pillow under my butt works like magic every time. I use it purely for the angle tho.",
   "created_utc": 1700146423,
   "score": 131,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hxjvw",
   "message": "Short, well manicured nails. Jagged nails are gonna cause some serious problems and take her out of the moment, or much worse.",
   "created_utc": 1700141176,
   "score": 81,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i74nj",
   "message": "If you tuck in the opposite corners of the bedsheet first then it won’t keep popping off when you put another comer on",
   "created_utc": 1700145409,
   "score": 57,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hyrbx",
   "message": "Pillow under her ass",
   "created_utc": 1700141746,
   "score": 137,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ihxqb",
   "message": "If you have night stands on either side of the bed, keep towels stored in one of the drawers.",
   "created_utc": 1700149623,
   "score": 226,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ivzwa",
   "message": "If you touch G spot and clitoris at the same time it takes a screenshot",
   "created_utc": 1700154837,
   "score": 79,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hu30g",
   "message": "if she says that shes about to come, it means that what you're doing is working, not that you have to speed it up.",
   "created_utc": 1700139456,
   "score": 244,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hzl1j",
   "message": "If you stay really still and cover your head up the boogeyman can't see you.",
   "created_utc": 1700142128,
   "score": 228,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hv6dz",
   "message": "Put your phone out of arms reach so that when your alarm goes off you have to get out of bed to turn it off.",
   "created_utc": 1700140012,
   "score": 235,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hpjmq",
   "message": "I bought one of those vibrating cock rings from a vending machine, in the bathroom of a bar. I was only in there for a pack of ribbed, strawberry flavoured condoms, but the novelty sex toy piqued my interest. Worked like a treat in the bedroom, gave her clitoral and vaginal orgasms with barely any effort required. \n\nThe ring was a bit tight around the old chap but helped me maintain serious wood. The only drawback is the preparation time of donning the rubber, then the ring. She also now insists I wear a cock ring every time we get it on. Oh, and don't activate it until it's at the base of your junk, or the stimulation from the vibrations may make you nut too early.",
   "created_utc": 1700137006,
   "score": 54,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9imga7",
   "message": "Sleeping 8 hours a day is proven to improve cognitive function.",
   "created_utc": 1700151356,
   "score": 68,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hq6k9",
   "message": "Keep your hands/nails clean.",
   "created_utc": 1700137370,
   "score": 126,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ikzl4",
   "message": "Take the mattress off your bed once in a while and thoroughly clean the floor under it. You'd be surprised how much it helps with allergies and congestion. Clean the top of your headboard too.",
   "created_utc": 1700150791,
   "score": 40,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9itl0y",
   "message": "If you’re putting on an ambient YouTube mix to fall asleep to, make sure you have sort of adblocker working.",
   "created_utc": 1700153949,
   "score": 68,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i4kge",
   "message": "Ollie. You'd be surprised how little space you actually need to do one. Easier if you have carpets too.",
   "created_utc": 1700144338,
   "score": 198,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ikmqu",
   "message": "Heated blanket, until now it's the second best purchase of my life. Edit: I was talking about an heated mattress pad but didn't knew the correct word due to not being mother tongue (I'm Italian) and not doing my research. Scusatemi.",
   "created_utc": 1700150651,
   "score": 252,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ibqek",
   "message": "If you have her on the edge of orgasm, DON'T stop what you are doing, don't change frequency, technique, intensity, nothing. Women aren't like men, once they are launching off, they need consistency to reach altitude.",
   "created_utc": 1700147250,
   "score": 95,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hmpwy",
   "message": "You’d be surprised how well LISTENING works!",
   "created_utc": 1700135309,
   "score": 49,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ih8pm",
   "message": "Using blackout curtains in the bedroom can help mitigate your heating bill",
   "created_utc": 1700149363,
   "score": 71,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9j2byk",
   "message": "Tricks are what whores do for money, Michael.  What I do are ILLUSIONS!",
   "created_utc": 1700157111,
   "score": 97,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i3fnv",
   "message": "i cant be the only one that came to comments expecting house/room diys to make you bedroom look cool or sumn like that 😂",
   "created_utc": 1700143852,
   "score": 170,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i5416",
   "message": "Sunlight alarm clocks make getting up easier",
   "created_utc": 1700144567,
   "score": 80,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ho68s",
   "message": "ALWAYS GET HER OFF AT LEAST ONCE FIRST",
   "created_utc": 1700136202,
   "score": 42,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i8ie8",
   "message": "If someone tells you to \"don't stop, keep going.\" \n\nDON'T STOP!!!  \nKEEP GOING!!!\n\nYes, variety and change is nice, but what you're doing *to* them, is doing it *for* them.",
   "created_utc": 1700145977,
   "score": 200,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9jwgx6",
   "message": "*Be there*. \n\nNot just physically, but in spirit, in romance, and in love. When you kiss her, *kiss her*, and don't think about the mortgage, your golf game, or whether  or not she's up for anal. Just be in the moment, and let yourself be absorbed by her scent, her sounds, and her sensuality. \n\nIt takes practice. It's easy for random thoughts to creep in, especially if it's with someone you've been with for a while, and the raging lust has abated somewhat. But it's worth it, believe me!",
   "created_utc": 1700168427,
   "score": 226,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9j992u",
   "message": "If you slow your thrust and focus on your rhythm, you can continue having sex through and well past your orgasm and possibly into a second one. I call it the downshift",
   "created_utc": 1700159598,
   "score": 154,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hn6qj",
   "message": "Play with the dog as you watch TV and you will fall asleep really fast.",
   "created_utc": 1700135596,
   "score": 86,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9jembi",
   "message": "For sex: if in missionary put a pillow under her hips to raise her up a bit.  Better angle for the action.  And it may differ for others but I find doggie-style is the best position for finishing off and achieving orgasm.  So be careful if you're not saving it for last.\n\nFor sleeping: make the room colder so that it is more comfortable under the covers and snuggling.  Much easier to fall asleep than being too hot.  I use a fan for both cooling and some backgroud white noise so that you're not distracted by random little noises from around the house or outside.\n\nRandom advice: if your dogs like to jump on the bed and you have hard floors, consider getting those interlocking foam mats and put them on the floor beside the bed.  It gives the dogs better grip to jump up, less likely to slip and get hurt when they jump down, and if you have an older dog like I do and they sometimes don't make the jump or accidentally roll off the bed, then the floor is padded and much less painful for them.",
   "created_utc": 1700161563,
   "score": 59,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9j33mr",
   "message": "Eat snacks on his side of the bed so your sleep will be crumbfree",
   "created_utc": 1700157388,
   "score": 148,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ilgrm",
   "message": "Life hack if you're single, you can rub your genitals with your hands and have an orgasm",
   "created_utc": 1700150976,
   "score": 114,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9iad9t",
   "message": "You can try spinning. Thats a good trick.",
   "created_utc": 1700146713,
   "score": 58,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9jj1lj",
   "message": "\"If you're not sure what you're doing, don't do it faster\".",
   "created_utc": 1700163222,
   "score": 51,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ic62g",
   "message": "Rubbing the clit with your thumb in missionary, works like a fucking charm on my girl",
   "created_utc": 1700147420,
   "score": 5,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ixs1h",
   "message": "Men: don’t bust a nut before she does\n\nWomen: please bust a nut before he does",
   "created_utc": 1700155479,
   "score": 141,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ijgek",
   "message": "Call in the stunt cock and tag out for a minute then tag in for the big finish and claim the victory.",
   "created_utc": 1700150193,
   "score": 101,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ijywp",
   "message": "Putting your fitted sheet using the opposite corner method makes it infinitely easier. Top left, bottom right and then the other 2 in whichever order. I not longer fight my sheets lol",
   "created_utc": 1700150391,
   "score": 173,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9kljpx",
   "message": "If you tuck your feet under the covers monsters can't eat them.\n\nSource: tucked feet, still have em both",
   "created_utc": 1700178778,
   "score": 94,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i6flz",
   "message": "Pillow under her lower back also eat her. Eat that poom poom before you enter",
   "created_utc": 1700145120,
   "score": 115,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hul4s",
   "message": "Blackout the room , keep it cool , raise the lower bed few inches , get a grounding mat , cum in her to keep the sheets clean",
   "created_utc": 1700139709,
   "score": 144,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i5plv",
   "message": "dont put a tv in your bedroom.\n\nyour overall sleep will improve.",
   "created_utc": 1700144814,
   "score": 102,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ijl2d",
   "message": "Install black out blinds. Your sleep will thank you.",
   "created_utc": 1700150242,
   "score": 72,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hpexx",
   "message": "Actually communicating. It doesn't matter if you and someone else were a 10 in bed together, you might be a 6 or even a 3 with some ekse if you don't learn what makes them tick",
   "created_utc": 1700136931,
   "score": 218,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hrwnj",
   "message": "[removed]",
   "created_utc": 1700138323,
   "score": 224,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ithtt",
   "message": "Weighted blanket. Especially during the cold winter months.",
   "created_utc": 1700153917,
   "score": 32,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9jx8b4",
   "message": "Start with missionary. Warm her up for a while.\n\nWhile you're still inside her, sit up. Move your legs beneath her legs and butt, and then up towards her shoulders. Now lay back down flat. It's almost like scissoring, except your legs go under her butt and towards her shoulders. Your heads will point in opposite directions - e.g. your head will lay between her feet, and vice-versa. Stay inside her while you're changing the position, as it's not easy to get back in. You must maintain a firm erection for this to work. If you're semi-soft, don't try this, it just doesn't work.\n\nGrab her thighs (which are more or less on top of your abdomen) and pull her closer so you drill deeper into her - you may have to pull her towards you several times during this routine, so hold on to those legs and pull her into you as needed.\n\nNow commence thrusting.\n\nThe part of the tip of your penis that gets stimulated is the opposite of what happens in missionary. It's the back of the tip, a not a very sensitive area, so you can do vigorous thrusting for a long time.\n\nAs for her, you're pushing right into her G-spot. It doesn't get much better than this.\n\nYou don't get very strong stimulation, so you will last a long time. Whereas she will roll her eyes into the back of her head, moan, cry, shake, twist. The neighbors are likely to hear about it, live. And you can keep going, basically forever.\n\nDo a bunch of sessions of this, over some period of time. After she becomes accustomed to it, after some weeks or so, take it to the next level: lubricate your thumb with a bit of saliva and start rubbing her clit while you're thrusting into her G-spot; some women like a strong stimulation of the clit, some like it more gentle, or very gentle, so try and see what works. This is literally next level - expect her to do basically the whole demon possession routine from The Exorcist. You can mix and match - e.g. stop thrusting and focus on the clit, then resume thrusting, then do both, etc. Just see how she reacts, and adjust the technique accordingly. Play her body like a crazy, hot violin.\n\nHave fun.",
   "created_utc": 1700168734,
   "score": 29,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9il6fb",
   "message": "You don't always have to fuck her hard\n\nIn fact sometimes that's not right to do\n\nSometimes you got to make some love\n\nAnd fuckin' give her some smooches too\n\n\nSometimes you've got to squeeze\n\nSometimes you've got to say please\n\nSometimes you got to say hey\n\nI'm gonna fuck you, softly\n\nI'm gonna screw you gently\n\nI'm gonna hump you, sweetly\n\nI'm gonna ball you discreetly\n\n\nAnd then you say hey I brought you flowers\n\nAnd then you say wait a minute Sally\n\nI think I've got something in my teeth\n\nCould you get it out for me\n\nThat's fuckin' teamwork\n\n\nWhat's your favorite posish\n\nThat's cool with me it's not my favorite but I'll do it for you\n\nWhat's your favorite dish\n\nI'm not gonna cook it, but I'll order it from ZANZIBAR\n\n\nAnd then I'm gonna love you completely\n\nAnd then I'll fucking fuck you discreetly\n\nAnd then I'll fucking bone you completely\n\nBut then\n\nI'm gonna fuck you hard\n\nHard",
   "created_utc": 1700150864,
   "score": 212,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hmuii",
   "message": "Not asking the same question 3 times in 3 minutes.",
   "created_utc": 1700135390,
   "score": 129,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ht9m9",
   "message": "Fellas take notes to help please your women!!! Pull up the hood of her clit with one hand, start to suck AND lick on her clit at the same time and speed, then take your other hand, put a finger or two inside and do a curling up motion on to hit her G-spot at the same speed your sucking and licking. Start slow and slowly pick up the speed. NEVER fails to make her orgasm! 💕💕💕💕💕",
   "created_utc": 1700139041,
   "score": 248,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9i7g78",
   "message": "Study the person's body. if they tense up, moan louder, stretch out, roll eyes, they are really enjoying what your doing. If they get quiet you should do something else.",
   "created_utc": 1700145541,
   "score": 134,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9ky866",
   "message": "Don’t be afraid to bring toys in. Most girls don’t orgasm from penetration alone. Me and my gf usually go through a few positions depending on where/how we get started but unless it’s one of the rare times where she comes just from penetration, we get into the “orgasm position” or whatever you want to call it. \n\nIt’s either doggy or I put pillow under her ass and go missionary. Reach over and grab the hitachi and either hold it myself or let her grab it because finding the perfect spot can be tricky and it’s no good if it’s off the mark. Once that hitachi is on her clit it’s almost always countdown to orgasm within a minute or two. She can then decide if she wants to try to have a second or third while I (now confident she’s had at least one orgasm) am free to fire when ready. \n\nI’d say it’s a 98 percent success rate for getting her off. \n\nThe moral of the story is make sure she gets off. If I can’t hold back for whatever reason before she’s cum (which happens sometimes) then we have a dildo I can use to finish her off combined with the wand. \n\nSeems obvious right but some guys really do just roll over when they’ve gotten theirs. Lazy fucks.",
   "created_utc": 1700184551,
   "score": 20,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9iixyt",
   "message": "You sleep better in a cooler room, and try to limit phone usage right before bedtime instead try reading a book",
   "created_utc": 1700149999,
   "score": 57,
   "submission_id": "17wkuhl"
  },
  {
   "comment_id": "k9hv6w8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17wkuhl"
  }
 ]
}