{
 "submission_id": "17wr96v",
 "title": "Radicals of Reddit, what are you strongly opinionated about?",
 "selftext": "",
 "created_utc": 1700152572,
 "permalink": "/r/AskReddit/comments/17wr96v/radicals_of_reddit_what_are_you_strongly/",
 "score": 227,
 "url": "https://www.reddit.com/r/AskReddit/comments/17wr96v/radicals_of_reddit_what_are_you_strongly/",
 "comments": [
  {
   "comment_id": "k9istgc",
   "message": "You should always question those in power, especially if it's you",
   "created_utc": 1700153674,
   "score": 96,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9ixhus",
   "message": "If you get to a stop sign first, don’t be “courteous” and way on the second person. You’re crumbling social normals",
   "created_utc": 1700155378,
   "score": 69,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jrw11",
   "message": "Sort by controversial to see real radical opinions. \"I think politicians are too old\" is not a radical opinion.",
   "created_utc": 1700166649,
   "score": 71,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jj248",
   "message": "The economy and flow of work will collapse without high capacity infrastructure expansion. Traffic will become too bad to reasonably get to work or home on time, and it will become more and more dangerous. We need high speed rail, and we need to alter roadways to better facilitate pedestrian use.",
   "created_utc": 1700163227,
   "score": 198,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iy5a7",
   "message": "Depending on who you talk to this is a very radical opinion: I think nuclear power is generally safe and we should be building a lot more nuclear power plants, not close down the ones we have",
   "created_utc": 1700155611,
   "score": 198,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j9mph",
   "message": "People should have access to free or cheap healthcare regardless of income. There is no reason that anybody in the US should be dying of things like abscessed teeth or lack of access to insulin in 2023.",
   "created_utc": 1700159733,
   "score": 168,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iwxi1",
   "message": "[removed]",
   "created_utc": 1700155176,
   "score": 25,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iutsj",
   "message": "Government and public education MUST remain secular.",
   "created_utc": 1700154407,
   "score": 161,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j02k0",
   "message": "We gotta be a lot fucking nicer to kids",
   "created_utc": 1700156304,
   "score": 214,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iuxte",
   "message": "[removed]",
   "created_utc": 1700154447,
   "score": 171,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j1hcn",
   "message": "There should be an age limit for politicians. No one over 60 can be in the government. The old farts in politics are so out of touch and can't even finish a speech without having a thousand years stare for a good five minutes that I'm tempted to report their families for elder abuse.",
   "created_utc": 1700156807,
   "score": 243,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9isf9s",
   "message": "If you don't clear the time remaining on the microwave after pulling your food out early so that it clearly displays the time then you are a despicable human being that natural selection failed at weeding out of our gene pool.",
   "created_utc": 1700153532,
   "score": 136,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iy3ss",
   "message": "I think the first topics you should discuss on a date are religion, politics, economics, etc.",
   "created_utc": 1700155595,
   "score": 91,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jjntf",
   "message": "Opinions! OMFG, you can't swing a dead cat by the tail in this place without hitting somebody that has an opinion about stuff they have neither experience nor expertise in.",
   "created_utc": 1700163456,
   "score": 16,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iz8y9",
   "message": "White liberals treat non white people like children and it’s demeaning.",
   "created_utc": 1700156008,
   "score": 172,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9ju4mi",
   "message": "A large percentage of our population is not responsible enough to have either children or pets. I say this as a veterinarian who also volunteers as a court-appointed social services advocate for children. When push comes to shove, a scary amount of people will treat children or animals as disposable.",
   "created_utc": 1700167522,
   "score": 34,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j0t8n",
   "message": "For profit healthcare is evil.",
   "created_utc": 1700156567,
   "score": 97,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jhprw",
   "message": "The toilet paper roll must be hung with the loose end draping over the top of the roll and facing the user.  To do otherwise is an abomination.",
   "created_utc": 1700162719,
   "score": 55,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j784x",
   "message": "We should have a rabid obssession to eliminate poverty, like a nuclear war against it",
   "created_utc": 1700158884,
   "score": 69,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9kga5v",
   "message": "If someone experiences a medical emergency in your house and you call 911 for help, FOR THE LOVE OF ALL THAT IS HOLY send someone outside to wave the ambulance down!\n\nI get you all wanting to be with that person in their distress but if I’m slowly cruising down your street trying to decipher the 40 year old chipped paint that is supposed to represent house numbers and can’t find you their care will be delayed.\n\nIf I see someone doing jumping jacks I go there.  EMTs are not the mailman who knows the neighborhood or the police who have more resources.\n\nIf there are multiple people or you can leave the patient safely, flag us down!",
   "created_utc": 1700176483,
   "score": 10,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iw16g",
   "message": "It's bowl, cereal, then milk. Any other combination is just wrong.",
   "created_utc": 1700154849,
   "score": 103,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iuid6",
   "message": "[removed]",
   "created_utc": 1700154288,
   "score": 32,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jyhdj",
   "message": "“You’re perfect just the way you are” is a harmful fucking lie that does not highlight potential to be better or achieve more, especially for children/young adults, and instead fosters complacency and confirmation bias.",
   "created_utc": 1700169223,
   "score": 18,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jgtes",
   "message": "One does not need to add “of reddit” to posts posted on reddit.",
   "created_utc": 1700162385,
   "score": 31,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j8jfw",
   "message": "There is nothing positive about working 9-5 M-F. It causes so much depression and leaves little room for personal growth or the chance to do anything with your week during the best hours of the day. All that shit about “it used to be 80 hours a week” is bullshit because 100 years ago sure, but there’s more than enough technological advances that we could shorten the work weeks in this era. Put simply, if corporations and the government wanted to, they would. But they know they have everyone by the balls by keeping us corporate slaves.",
   "created_utc": 1700159345,
   "score": 32,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iuqe0",
   "message": "Brisket is smoked FAT UP.",
   "created_utc": 1700154371,
   "score": 24,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9it8jy",
   "message": "Shelter and access to healthy food is a human right.",
   "created_utc": 1700153824,
   "score": 100,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iwfxx",
   "message": "I very strongly believe that queer people should have all the rights as regards marriage and expression that cishet people do, and that, as far as \"religious freedom\" plays into that, freedom of religion should end where it harms others or interferes with the rights of others, but by federal law, it currently does not.",
   "created_utc": 1700154998,
   "score": 56,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jdbgg",
   "message": "The news is opinionated and we should stop using TikTok since it’s run by a questionable country",
   "created_utc": 1700161078,
   "score": 13,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jd08l",
   "message": "Having a pet doesn’t make you a parent.",
   "created_utc": 1700160964,
   "score": 27,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jhxnu",
   "message": "Human rights: higher minimum pay, easier access to food and health, free school lunch that is more than just a single sandwich, easier access to housing.",
   "created_utc": 1700162800,
   "score": 40,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9ivfj9",
   "message": "Billionaires should not be allowed to exist. The wealth generated by our markets should be extremely heavily taxed and used to create a better life for the many, not the few. Nobody needs a yacht but everyone needs a dentist.",
   "created_utc": 1700154629,
   "score": 139,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iuqdn",
   "message": "according to other radicals, im too strongly opinionated about my right to live and i should debate them about it.",
   "created_utc": 1700154371,
   "score": 54,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j0ghy",
   "message": "Legalize all drugs, and sell them to adults in any quantity they desire.\n\nThe government should only regulate them in terms of ensuring that the manufacturers are providing the chemical they claim to be selling, and that they are meeting quality \u0026amp; purity standards. \n\nI'm not just talking about illegal recreational drugs here. Eliminate the need for prescriptions to get medications.\n\nCartels, gangs, and terrorist organizations will lose funding. Addicts will have no need to commit thefts to feed their habit when prices bottom out. Ultimately, addiction problems will sort themselves out.",
   "created_utc": 1700156442,
   "score": 31,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jk7vy",
   "message": "Sorry Im trying not to get IP banned",
   "created_utc": 1700163672,
   "score": 6,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j2imd",
   "message": "I am very strongly set in my belief that no gods exist. I am aware you cannot disprove it, but equally aware that there is absolutely no proof. Anything that Jesus supposedly did could be replicated easily by a good magician, and anything you feel when you pray can be replicated with the proper pharmacology. I am equally strongly opinionated that those who do believe in gods should be allowed to waste their time doing so, as long as they don't foist their opinions and religion on me, I am very happy to interact with them. However if they try to legislate their beliefs on to my friends and me, fuck them. ( I am looking at you anti-abortion pushers)",
   "created_utc": 1700157177,
   "score": 26,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iqknc",
   "message": "I was taught that Pluto was a planet my entire life and I intend to stick to it.\n\nI will fight anyone who disagrees.",
   "created_utc": 1700152862,
   "score": 50,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9iv0bx",
   "message": "Circumcision is genital mutilation, and they should be illegal to perform on children.",
   "created_utc": 1700154473,
   "score": 116,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9ito7z",
   "message": "Christian nationalism needs to die, quickly. I am tired of seeing politicians try and turn my country into a theocracy.\n\nKeep religion out of politics, hospitals, schools, and get rid of tax exemption for religious institutions.",
   "created_utc": 1700153981,
   "score": 91,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9k41z3",
   "message": "That there should be a term limit for all elected officials",
   "created_utc": 1700171410,
   "score": 5,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9k7u01",
   "message": "People should be allowed to do whatever they want so long as it doesn't affect the wellbeing of a nonconsenting other person. Doing drugs, owning a weapon, being gender or sexually diverse, following a religion, anything.",
   "created_utc": 1700172930,
   "score": 5,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9khab3",
   "message": "All people should be treated with kindness, respect, and dignity regardless of race, religion, sexuality, financial situation or identity",
   "created_utc": 1700176920,
   "score": 3,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j6oi5",
   "message": "I used to be the most libertarian person you’d ever meet \n\nNow, I unironically believe snacks (specifically chips, candy, etc) should be either taxed to hell (think 30% excise tax on all purchases) or outright made illegal to sell in public schools and to children younger than 16\n\nOur country is declining in terms of life expectancy, and it’s mostly due to lifestyle issues and obesity- it’s just made worse by a bad healthcare system",
   "created_utc": 1700158688,
   "score": 35,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9izrek",
   "message": "I want democracy rather than Fascism",
   "created_utc": 1700156193,
   "score": 20,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9ixkz0",
   "message": "[ISO 8601](https://en.wikipedia.org/wiki/ISO_8601) and [Unix time](https://en.wikipedia.org/wiki/Unix_time) are the only acceptable date/time formats. Everything else needs to stop.",
   "created_utc": 1700155409,
   "score": 9,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jtjrg",
   "message": "\u0026gt; Radicals of Reddit\n\nSo, Reddit then.",
   "created_utc": 1700167296,
   "score": 10,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j6wzg",
   "message": "It's immoral to be a billionaire. We should rob them.",
   "created_utc": 1700158774,
   "score": 36,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j5e4p",
   "message": "Suffering is not ennobling, and most suffering is created by bad social structures. \n\nThings being traditional is not in itself a justification for them continuing to exist. \n\nLess bad is better than more bad.",
   "created_utc": 1700158224,
   "score": 8,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9j6giq",
   "message": "How corporate America treats their employees and the shit they get away with.",
   "created_utc": 1700158609,
   "score": 16,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9is9fw",
   "message": "Drug laws.",
   "created_utc": 1700153474,
   "score": 3,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jc2pd",
   "message": "Anything less than a 100% volunteer workforce is immoral. It's not realistic now, but maybe in a thousand years.",
   "created_utc": 1700160623,
   "score": 3,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9kqcc9",
   "message": "Loyalty doesn't pay. I advise people (in my field of work) to skip employers every 2 (if you dislike it) to 3 (if you like it) years. Don't fall for the carrots on the sticks they beat you with. \n\nNow I'm in two companies myself (founder at one and CTO at a scale-up) I know exactly why companies don't have retention budgets: employees talk.\n\nIf I give John Doe a 20% raise, then others will learn of this and demand the same. The potential for strife is immense, unless I give everybody a 20% raise.\n\nIf I let John Doe go and find (expensive) and hire someone who is 30% more expensive, and who has to be trained and onboarded (also expensive) it's still far less risky than giving John Doe a big raise.\n\nThe new employee won't likely talk about his salary, and even if it does come out: people will not know them yet, so they'll think \"they are probably worth it\" and \"well the market is expensive now\". \n\nIs that what people on Reddit want to hear? No. It feels unfair, and maybe it is. But it's also how you run a company with many employees. And it's pretty much how every for-profit company out there works.\n\nQ: That's unfair!\n\nA: Yes, hence my recommendation: switch jobs every 2 to 3 years. Get yourself a 40% to 50% raise and 10 years later, you'll be making bank.\n\nOr in other words, assuming two individuals start at 60k per year and they keep this up for 15 years:\n\n### Loyalists get, at best, an average +2% per year\n\n    $60000 * 1.02 ^ 15 = $80k per year\n\n### Job hoppers get, on average, +8% per year\n\n    $60000 * 1.08 ^ 15 = $190k per year\n\nAnd if you're good and in the right field and the right location and you're willing to travel or even move? Then you could do what I did:\n\n- In 2001 I started out at $40,000 per year\n- In 2017 I was earning over $400,000 per year\n\nLoyalty doesn't pay. Companies aren't your friend. I'm quite radical about this, and I hate that I cannot recommend this to the people I hired, because I'd get fired so fast...",
   "created_utc": 1700180930,
   "score": 3,
   "submission_id": "17wr96v"
  },
  {
   "comment_id": "k9jhb3r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17wr96v"
  }
 ]
}