{
 "submission_id": "17x50lp",
 "title": "Redditors who are 50+ years old, what has changed the most about working when you started working vs working nowadays?",
 "selftext": "",
 "created_utc": 1700189099,
 "permalink": "/r/AskReddit/comments/17x50lp/redditors_who_are_50_years_old_what_has_changed/",
 "score": 155,
 "url": "https://www.reddit.com/r/AskReddit/comments/17x50lp/redditors_who_are_50_years_old_what_has_changed/",
 "comments": [
  {
   "comment_id": "k9la416",
   "message": "Skirts/dresses and pantyhose required of women in many offices through 1990’s.",
   "created_utc": 1700189856,
   "score": 180,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9l9836",
   "message": "Having to go to the bank to cash my paycheck",
   "created_utc": 1700189460,
   "score": 161,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lkmex",
   "message": "Direct deposit. No more waiting in line Friday afternoon our most of Saturday morning at the bank to cash your paycheck with everyone else.",
   "created_utc": 1700195065,
   "score": 90,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m0z6q",
   "message": "so when i started working my first job was to install a computer and printer into a bank where they had 50 people typing form letters for late mortgage payments.  they had a form and they would line up the blank areas of the form and type in the numbers.  imagine a giant rectangular room with desks, each one holding an inbox and an outbox and a typerwriter.  manual typerwriter.  ibm selectrics hadn't come up.\n\ni installed the computer, a copy of wordstar with  mailmerge and when this room of workers watched all of the letters they needed to produce in a week come out of that printer before lunch they all knew that their jobs were over.  banks are not sentimental.\n\nmy second job was installing computers into video rental stores.  they would have a card catalog with 3x5 cards for each movie.  when they rented a movie they'd move the card into a \"rented\" box and they would figure out who was late by having someone go through the cards one by one and look at the due date for that movie when they brought it back, or they would, once a month, go through the box to figure out what movies were long term missing.\n\nafter the computer was installed they'd do two to three weeks of data entry, entering all of their inventory into the system, and it got a lot more efficient, and some of the clerks weren't needed any more.  i'd fly back in after they did their data entry to find 1/3 to 1/2 of the staff gone.   people were low-level angry with me, as the face of technology, but mostly just resigned to it.\n\nmy third job was installing monitoring software into telephone company call centers.  these are where people answered the phone, got the person to tell them what name they wanted and looked up the person in the phone book.  giant rooms operated by mostly bell south, with a supervisor on a raised desk in the center.  there would usually be a mini-riot after the monitoring software went it - we could tell how many calls each person was taking, whether it was incoming or outgoing, call duration and about 15% of the workers were either taking very few calls or making outgoing calls on their shift for their entire shift.  they were union, and they hated the machine.  so the management changed it so that the workers could pull their individual stats up and compare it to the average worker at the facility.  only the averages were cooked - we would slowly ratchet up the \"average\" stats to whatever the management wanted them to be.  the workers never figured it out.  the worst performers got weeded out immediately and they would just not replace them.  they contributed nothing to the work being done, so their loss wasn't even a blip.  and the other folks worked harder, so they'd basically fire 10 to 30% of their staff in the first few months.\n\nthe common thread here is that none of these jobs exist any more.  information operators, form letter typists, and video store rental clerks are all gone.  I'm watching AI be able to code, and people crowing about how they can do their programming tasks in minutes with it, but I don't think they realize that their employer doesn't want to pay them six figures for their work if they can possibly avoid it.  they will pay 7 to 8 figures to the guy who figures it out and lay everyone else off.    there's a reason top AI staff are getting offers of $500k to $1m.  It'll be paid for by the folks they make obsolete.\n\nSo whats changed most is that 45 years ago, when I started working, I had the perception that I could work hard and then retire and that I could do the same thing for that entire period.   That isn't how it worked out for me, or any of the people that I personally have displaced.\n\nI am 60 years old.",
   "created_utc": 1700205847,
   "score": 145,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lax5c",
   "message": "There was a lot more understanding back in the 80's and 90's that each employee had a life outside of work, and work would end at 5PM. You could leave work and go do something that you liked, maybe a martial arts class or some learning workshop somewhere. There were no phone calls. Text messages and email hadn't happened yet. Pagers were rare. People were in better shape. They had time to workout and were encouraged by their bosses to go do something to keep in shape.\n\nThese days, it's the opposite. There's no encouragement from your boss or your coworkers other than to just work around the clock. You're never \"off\". Emails, text messages, Slack messages, video calls, and \"tickets\" from your company's internal issue tracking system come in at all hours of the day. You're tracked in every way possible these days. You're given impossible deadlines. It now takes incredible willpower to break free and \"sneak\" away to go workout. You're exhausted all the time, so you lose the desire to workout. You just want sleep. Instead of meeting up with friends somewhere for dinner, you are happy to just get home, get something hot to eat from your microwave, and numb yourself by watching YouTube and Reddit. What you do now during your down time is very low quality and is just done to unwind from the stress which follows you no matter where you are. They call this Flex Time, and its purpose is ostensibly to give you the ability to walk away from your work and go enjoy life. Funny.",
   "created_utc": 1700190234,
   "score": 83,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lto0o",
   "message": "I'm in the UK. \n\nIt was a great deal easier to find work. You'd get vacancies posted in various places and could go down to the Job Centre, browse vacancies posted on postcards on boards, pick out the jobs you were interested in, and get a member of staff to arrange an interview for you. Just like that. \n\nDress codes were more formal and you actually had to go to work. If you worked in an office for the right company work finished Friday lunchtime when you'd go with your colleagues to the pub. You'd go back after the 'liquid' lunch hour and work Friday afternoon, but no shit got done and work piled up for Monday. \n\nYou got paid either direct debit, cash or if you were unlucky by cheque. You had to deposit your cheque in the bank or a building society and wait for the cheque to clear, usually 4 days, but sometimes 10 days. If you got paid cash you'd get it in a small brown envelope known as a wage packet which listed all deductions on the outside. It still felt good to tear open the wage packet and take out the cash.",
   "created_utc": 1700200475,
   "score": 64,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9l9eho",
   "message": "I'm 42 but feel like I want to chime in.\n\nHealth and safety has changed loads. You wouldn't get away with half the shit we did when I was 17",
   "created_utc": 1700189533,
   "score": 114,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9ll9rq",
   "message": "Hardly anybody has a pension anymore.",
   "created_utc": 1700195420,
   "score": 191,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m7fbq",
   "message": "The people at the top earned a great salary and everyone else a good salary. \n\nNow the people at the top subscribe to the pirate life, take everything, give nothing back.",
   "created_utc": 1700211316,
   "score": 36,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lchd8",
   "message": "Men had to wear suit/tie to work every day and women had to wear what our company defined as 'interview attire' (professional dress/pantsuit).  I remember when our first 'jeans Friday' was implemented, our manager wore jeans to support the effort, but they were ironed with a crease down the middle - hilarious.  Now, for the same role at the same company, people work remote and wear sweats or whatever the hell they want.",
   "created_utc": 1700190983,
   "score": 69,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9ly37n",
   "message": "We took a company van with a logo on it to take out of town guests to a strip club. I don’t even think I can say that out loud at work today.",
   "created_utc": 1700203599,
   "score": 25,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lzwkg",
   "message": "I watched office work go from sedentary to virtually immobile.  We used to retrieve paper files, pass memos around, consult with coworkers in other sections and floors.  Now everything is available on the screen in front of us, everything can be shared with a few clicks.  It’s convenient, but so unhealthy.",
   "created_utc": 1700205000,
   "score": 28,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m1hsz",
   "message": "People smoking indoors. Clouds of smoke everywhere in the office and no way for a nonsmoker to avoid it. That was the norm so you just had to suck it up.",
   "created_utc": 1700206270,
   "score": 29,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lqh5y",
   "message": "Sending a memo meant typing something, sometimes on an actual typewriter. Physically passing said document to the people in the “to” line. They would sign their initials signifying they read it. Then pass on to the next.\n\nI remember people used to smoke cigarettes in their office.",
   "created_utc": 1700198433,
   "score": 46,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lqqdz",
   "message": "Workplace was a lot looser in how coworkers interacted with one another. I would say there was more camaraderie back then. Now no one even wants to work around other people, let alone socialize.",
   "created_utc": 1700198589,
   "score": 38,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lyrx4",
   "message": "Lots of random things:\n\n*  When I started my career I had to wear a tie every day. Now, it’s t-shirts and shorts.\n*  Sales people would dictate their correspondence using a cassette tape recorder and the secretaries would type it up. Today…type your own damned sh#t. \n*  Sexism was mostly OK, as long as you were joking and no one got hurt. This culture disappeared quickly in the wake of [Anita Hill’s testimony at the confirmation hearings for (now) SCOTUS Justice Thomas](https://www.cbsnews.com/news/anita-hill-vs-clarence-thomas-the-backstory/).  \n*  No email or voicemail. I actually had to call into a the office and ask one of the secretaries if they had any messages for me. \n*  Smoking in my cube or office was OK.",
   "created_utc": 1700204114,
   "score": 36,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m5rvb",
   "message": "People used to answer their business phones.",
   "created_utc": 1700209859,
   "score": 14,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9me1qo",
   "message": "Things run so much leaner now as the excess is gone. When I started, it seemed everyone at VP level and up had an EA. Eating lunch at your desk was weird. You always went out, always had a beer and it was almost always paid for with an exec’s company card.\n\nIt could get kind of nuts. Bonuses were almost considered mandatory. I remember a holiday party at the company owner’s mansion - about 150 hammered employees and their equally hammered spouses. The evening culminated in him standing at a balcony throwing envelopes of cash to everyone below like some anemic Caligula.\n\nThe fucking around on the job was legendary. We weren’t tracked, Teams and Slack were a decade away and we were on the most basic desktops with an internet that was still an incredibly weird and alluring distraction. You could lose a day online and just lie on your time sheet or not do your timesheet at all (time tracking was done to adjust employee ratios internally and not to get paid by our clients). Plus, there was always the rarely used conference room a few floors down where meet your pals for an afternoon of hacky sack. And one floor up was a room dedicated to the smoking of cigarettes, so you could sit there and shoot the shit with various smokers as they’d come and go. You’d leave smelling like an ashtray with stage four cancer, but nobody ever mentioned everything because 25% of the entire world smelled like that anyway.\n\nNot sad to see those days gone, but really glad I got to experience the old school for a few years.",
   "created_utc": 1700217196,
   "score": 15,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m14pl",
   "message": "Doctor. Less likely to be literally worked to death due to so called “safe hour” rules where 23 and 26 hour shifts without sleep are now banned. Officially anyway. \n\nAlso the newer residents are pushing back against unpaid overtime and taking hospital management to court and winning for unpaid wages.",
   "created_utc": 1700205972,
   "score": 25,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mf4lq",
   "message": "That you chose a career, and you worked for an employee - and they valued your experience. You rose in the ranks of your profession, you became a valued team member, and you stayed until you retired. Changing jobs often is frowned on, if you make a job commitment - you follow through on it. People get bothered and quit/move/change really quickly now. That's not necessarily bad, but it has created a gap in expertise - everyone is new all the time, and there isn't any value in having experience. If you happen to be an elder in your field with some level of legacy knowledge -it doesn't seem to matter because your boss is likely younger than you, and less experienced. There used to be jobs - what you did to get paid and live, and careers - what you did because you wanted to invest time into being good at something AND that was how you made a living. Moreover - you went to school to be in a career. So you put time and energy into attaining your job, therefore you'd want to stay in it and grow. In theory. \n\n I'm not sure anyone cares about being in a career anymore. Because we all feel so betrayed by the system - wages not keeping up with COL, inflation, (and inflation subsiding and prices staying high because its what the market will bear) - when everyone is replaceable, then no one is an expert. I'm GenX. I work in healthcare. I work in a broken system that no one actually wants to fix. Those of us working in this system are now just grist for the mill. It's too bad because we spent a lot of time and money to go to school to be able to work in our chosen field. \n\nIn contrast - my mom was also a nurse. She had a career. She worked in it until she was 70 and retired. She worked with a team that mostly stayed the same, over decades. I don't work with anyone I started with at my job 6 years ago.",
   "created_utc": 1700218112,
   "score": 9,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mgbww",
   "message": "Insurance costs more and covers less. Having affordable health insurance tied to your employer is terrible",
   "created_utc": 1700219092,
   "score": 10,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lsql1",
   "message": "*what has changed the most about working when you started working vs working nowadays?*\n\n**I get paid a fuck ton more.**",
   "created_utc": 1700199865,
   "score": 31,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9ljcky",
   "message": "It was expected and accepted to take office supplies home. Almost everyone did it and it wasn't looked at like the evil act it is today. (No, I'm not dying to \"steal\" from my job, but it's just an interesting difference.)\n\nHealth insurance... I don't think I need to elaborate on how that's gone \n\nChristmas bonuses were much more common.\n\nDamn, I keep trying to think of changes for the better lol...\n\nOh, well, at least the pay's the same 😂",
   "created_utc": 1700194392,
   "score": 34,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lu8wv",
   "message": "My first job nobody had a computer, now everybody does.",
   "created_utc": 1700200871,
   "score": 7,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m0191",
   "message": "I could get away from work by leaving but now I am never away from work with technology now.  I had to wear a suit every day as an engineer now is very casual.  A lot of the processes and procedures were much more specific and detailed but now it’s much more relaxed.  Shit people said at work 30 years ago would never be heard today.  HR existed and helped with career planning and people strategy and no idea what they do now?!?",
   "created_utc": 1700205102,
   "score": 6,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m3ajr",
   "message": "My mom said back in the 80s some people would do coke at work. Also a lot of sexual harassment happened a lot and no one ever did anything about it. \n\nThis was at a government job...",
   "created_utc": 1700207740,
   "score": 6,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lb893",
   "message": "Computers",
   "created_utc": 1700190380,
   "score": 17,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9ly597",
   "message": "I’m tired more",
   "created_utc": 1700203640,
   "score": 5,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mpj2n",
   "message": "My first health insurance was Blue Cross, top level.  Cost me nothing monthly and I had $5 copays.",
   "created_utc": 1700225393,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9l8suk",
   "message": "Mental health days weren't a thing",
   "created_utc": 1700189271,
   "score": 13,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m3csr",
   "message": "I’ve only been in the workforce 10 years , but letting people do whatever on their phones all day wasn’t as accepted back then .",
   "created_utc": 1700207792,
   "score": 5,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mm2wh",
   "message": "Benefits. \n\nI used to get 20 vacation days and 10/12 sick days. Now I get 20 PTO days. So, that’s a one-third reduction in benefits. \n\nI always purchase the best health insurance my employer offers, now the best is garbage. Twenty years ago, I was hospitalized, tons of tests and specialists, private room, final bill: $0. My kid was born five weeks premature, spent four weeks in NICU, final bill: $0. Now, if I go to the doctor, every single thing costs extra.  \n\nAll the benefits have been dramatically reduced, but profits skyrocket.",
   "created_utc": 1700223324,
   "score": 4,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mbltt",
   "message": "58 YO engineer. When I started we shared computers at work. They were expensive and lots of things were still done by hand. I did not have a computer in college. We also did not have cell phones, texts, e-mail, video conference, internet, etc…. It was nearly impossible to collaborate with people in other offices . Blue prints were sent out for printing and we had flat drawers full of archived prints.  We would have to hand sign/seal every page. Now we can collaborate between offices and every thing is an electronic file. It is amazing to me.",
   "created_utc": 1700215087,
   "score": 8,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m9pb3",
   "message": "It used to be that when you took time off/vacation, you were actually off. Technology has made it so that we are always “on,” and therefore the expectation is to work and be available to work regardless of where we are and what are status is. I cannot recall the last time that I had time OFF away from my office. Even when on holiday overseas, I am pressed and pulled upon to work. Some thrive on this, I simply find it upsettingly exhausting.",
   "created_utc": 1700213372,
   "score": 3,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9masih",
   "message": "Ghosting seems to be a huge thing now especially in a professional work area.  And there is no reprecussions,  even 20 years ago I would of been fired, especially if you show up the next day like nothing happened.",
   "created_utc": 1700214370,
   "score": 3,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mfngg",
   "message": "In the 1980s, people getting shit-faced drunk at lunch was a regular occurrence. I've only seen it twice in the last 5 years.\n\nFlexible time and WFH didn't exist.",
   "created_utc": 1700218543,
   "score": 3,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9msfie",
   "message": "We went from standard office hours being 9-5 to being expected to work 8-5.",
   "created_utc": 1700226992,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lzbfs",
   "message": "Using a PC had inherent risk. When the system memory was used up, it simply stopped working. No ability to save; any work was lost since your last save. This led to obsessive saving of all docs.",
   "created_utc": 1700204535,
   "score": 5,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mb3x7",
   "message": "A living wage.",
   "created_utc": 1700214652,
   "score": 4,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lo9w4",
   "message": "Dress codes are now laxer.  We can work WFH now. It wasn’t technologically possible back then. Back then we also got away with a lot more joking around and goofing off and a lot of conversations back then could now get us reported for sexual harassment if the wrong person would’ve overheard and reported it. But I also see a lot more entitlement surrounding benefits.",
   "created_utc": 1700197110,
   "score": 7,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m828e",
   "message": "We used to physically take stat lab results across the hospital to the ER, or down the street to the doctor’s office.",
   "created_utc": 1700211889,
   "score": 2,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m9e3x",
   "message": "Could smoke in the office.",
   "created_utc": 1700213086,
   "score": 2,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9ma6kq",
   "message": "When I started working, people had ash trays on their desks, not computers.",
   "created_utc": 1700213813,
   "score": 2,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mgead",
   "message": "People are no longer able to smoke at their desks and women can do “men’s work” without getting harassed nearly as much. \n\nAlso, computers on every desk was not a thing, dedicated word processors (like Wang and DEC) were used by secretaries. They don’t have them most places anymore. I used to have a secretary and I was a lowly engineer.",
   "created_utc": 1700219143,
   "score": 2,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mi0so",
   "message": "I was fired from my first office job out of college (as a secretary for a job recruiting shop) for suggesting the business would fail if the owner didn't give us Internet connectivity. Today the very idea of not having the Internet at an office job is  ludicrous. \n\nMy third office job was working for one of the big accounting firms-- and I spent an inordinate amount of time at work building my little home on the web at Geocities. No one in IT was paying any attention to what people were doing on their computers because it was relatively new. Today it wouldn't take long for IT to discover that misuse.\n\nI work 100% remotely right now-- that would have been impossible even four years ago: when i started at this job, the head of my company was on-record saying that she believed working from home would lead to loafing and a tank in productivity. I'm still an exception at 100% WFH, but nearly every employee works a hybrid schedule now... with an increase in productivity. \n\nThis is going back a bit further-- like to my first job at the age of 16--I was fired for refusing to sleep with the boss... and there were witnesses. At the time sexual harassment hadn't been deemed federally hostile. If he'd pulled that crap today, I would have owned his business by the time my court case was done.",
   "created_utc": 1700220508,
   "score": 2,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mmnvn",
   "message": "Drinking, smoking, sexual harassment, harassment of various groups was open and encouraged.  So were pensions and church on Sunday.  Malls were closed on Sunday.",
   "created_utc": 1700223687,
   "score": 2,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mn6rh",
   "message": "You had to dress up a lot more formally (i.e., uncomfortably). Many many more people taking cigarette breaks.",
   "created_utc": 1700224007,
   "score": 2,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mo19o",
   "message": "For myself, it was a culture of fear. Sexist bosses who would harass female employees constantly. They didn't have to be male either. I had a female boss that would measure your skirt length by having you kneel on the floor, and would measure your hem with a ruler. More than two inches? Clock out, go home and change and then come back. Rinse and repeat. Many male managers took pride in being able to make women cry. There was public embarrassment if you made a mistake. Feeling like your job was in jeopardy at all times. \n\nSurprisingly, I don't miss it.",
   "created_utc": 1700224517,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mo7l2",
   "message": "The loss of stigma about changing jobs every few years. It used to be a yellow flag if someone switched companies \"often\".",
   "created_utc": 1700224621,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mov61",
   "message": "The use of desktop computers.  We used to handwrite (!) draft reports,  give them to a secretary (!) to type (!), review, make corrections, and give it back for the final report to be typed.  \n\nNeed to send a memo to Personnel? It went into an interoffice envelope and was delivered by the mail clerk.  \n\nThere was a whole department that analyzed data and metrics. You waited weeks for a report on last months' productivity. \n\nInventory control was twice a year,  office folks out in the warehouse with clipboards physically counting things.  That count was then rectified against the electronic Inventory- which was slips of paper that were entered into the mainframe (!) by a data clerk.",
   "created_utc": 1700225006,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mozpe",
   "message": "Working for a company for many years was seen as honorable and a sign you were a good worker. Now it’s viewed as someone complacent, scared of change and stupid for not salary hopping. I don’t disagree though I’ve been at my company for a long time and it’s anything but complacent and always changing.",
   "created_utc": 1700225080,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mpv0v",
   "message": "People still smoked in their offices when I started working my first “real” job.",
   "created_utc": 1700225576,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mqdp2",
   "message": "To piggyback on some of the other comments, yeah, you actually had to show up at work. We had a huge snowstorm in NYC when I was living and working there and it was so bad the subway was barely functioning. My company sent vans around to pick us up and take us to our building so we could work. I had totally forgotten about that until right now.",
   "created_utc": 1700225869,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mqqsc",
   "message": "Then: Ties were a common sight.  Now: nearly extinct.  \n\nThen: 3 jobs in 5 years was a red flag.  Now: 3 jobs in 5 years does even get noticed. \n\nThen: Company layoffs are shameful, and the sign of a dying company. Now: its a Tuesday.",
   "created_utc": 1700226073,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mrnb8",
   "message": "Smoking at your desk in the office and dress codes (pantyhose anyone!)",
   "created_utc": 1700226570,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mrvkm",
   "message": "People used to be able to smoke at their desks.",
   "created_utc": 1700226696,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mscsf",
   "message": "Being able to get a job, without filling in loads of forms and having multiple interviews.\n\nI got my first real job in IT with no technical questions and no forms to fill in. We just chatted..got on well and was offered the job immediately.",
   "created_utc": 1700226952,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lrs5q",
   "message": "Quality is terrible",
   "created_utc": 1700199248,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m6scq",
   "message": "Nobody takes pride in their work.",
   "created_utc": 1700210746,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9miirf",
   "message": "The one thing that I noticed even 10 yrs ago, before all the current cost/salary issues is the lack of drive in many workers. Part of this, I think, is the way society has changed over the years. Back in my parents' day, the man would look to move up so he could be a better supporter of a family. Even in my younger years, two people tried to move ahead when they were married to have a good life. The last 10 years, I've seen more 30 yr olds just taking a starting position and staying there. Many were still living at home, playing video games, and generally being grown teenagers. I'm not saying it's everyone, and it's not the current economy. It just seems there was less and less interest in \" adulting,\" which I don't understand.",
   "created_utc": 1700220881,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lel6x",
   "message": "quality of workers is terrible..",
   "created_utc": 1700191994,
   "score": 244,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mc49m",
   "message": "Far too contactable with bloody mobile phones. so many waste of time emails. Got to watch every word and every action because everybody is so precious and needs to be offended over something every day.  Young managers lol.  If you could call them that, who haven't got a Scooby doo how to manage people, they just became a manager and 90% of companies then give them absolutely no training or coaching as to how the hell to be a manager..",
   "created_utc": 1700215534,
   "score": 0,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mgltl",
   "message": "The chics are less receptive to hooking up",
   "created_utc": 1700219311,
   "score": 0,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mcub5",
   "message": "Everybody wanted to work back when I was younger, these days it seems people think the world owes them a living while they stay at home doing nothing.\n\nWages were paid in cash on a Friday at the end of a shift. \n\nTraffic for any commute was just a fraction of today’s. \n\nIt’s a long list.",
   "created_utc": 1700216161,
   "score": 247,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9lyhyz",
   "message": "Corporations are so corporate now with so many rules and regulations. It was not anything like this 30 years ago.",
   "created_utc": 1700203904,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m229o",
   "message": "Internet. When I started working internet didn't exist. And later Cloud. When Cloud came out it was a second revolution to me. Accessing all info from different computers without carrying usb key, external drives etc.\n\nWhen I started working on a computer the most advanced OS was DOS where you just stared at a blank screen where a blinking cursor was waiting for your commands. Sad, huh?",
   "created_utc": 1700206724,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m5o7y",
   "message": "So much business is done over text message! That was an adjustment for me. I left the corporate workplace in 2008-ish and texting wasn’t like it is today. I got back to working with a group of people a few years later and realized a lot of conversations and decisions were made via text. And also since it was a professional setting I had to really start to pay attention to grammar, spelling, typos etc. Now, texting is a huge part of how I communicate with customers and my team, people don’t read emails anymore.",
   "created_utc": 1700209769,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m6ylb",
   "message": "We don’t get paid in envelopes with cash in them anymore.",
   "created_utc": 1700210902,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m785j",
   "message": "Hate working from home, not healthy. And pension changes.",
   "created_utc": 1700211135,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m7mtt",
   "message": "Dress code is more relaxed.\nI now call all colleagues by their first names regardless of their position.",
   "created_utc": 1700211504,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m7o5s",
   "message": "51 and already retired. When I started working as a programmer most people were around my age or a little bit older. When I stopped working (and I changed jobs often as a freelancer) my coworkers were still around my age.",
   "created_utc": 1700211537,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9m8ocm",
   "message": "Always worked in IT and back in the 90s only managers and executives had laptops. \n\nThe plebs had desktops.\n\nNow everyone has a laptop. Incidentally, it allows everyone to be on call all hours of the day.",
   "created_utc": 1700212445,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mbxvy",
   "message": "Smoking in the offices.",
   "created_utc": 1700215383,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mcwsa",
   "message": "It changed a lot, the arrival of IT revolutionized everything, suddenly we were using a clipboard, tracing paper, ink pens... soon after we were programming AutoCad, working with a plotter, productivity increased and so did the pressure. But the change allowed a series of new opportunities, the world became smaller and more distant. Email, believe me, was a revolution. But before we were calmer, there were more live iterations, more barbecues with colleagues, more physical meetings... it changed a lot.",
   "created_utc": 1700216220,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mdbh9",
   "message": "The telemarketing bureau I started in, had one computer (50 odd employees). Each of us got several printouts of paper with telephone numbers to call, regarding whatever project we were working on. \n\nWe'd call up the number, talk with the company (b2b marketing) and then note whatever outcome on the paper in front of us, and whether to call back or not. \n\nAt some point, I was part of an analyst team, and was selected to be the person typing in all the results. It was glorious! The rest of the team was kinda jealous, since it was considered a cushy job that could take several days.\n\nI'm only 51 mind - so things have changed REALLY fast.",
   "created_utc": 1700216571,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9meu82",
   "message": "**Bad**  \nRelying too much on technology. Memory is not used anymore. Much more transactional and short term thinking vs. strategic and long term one. Everybody should make money the big and small company, but now the big one take all the money on the table.  \n**Better**  \nSpeed in everything. Work pace, finding information, finding resources, development, etc.",
   "created_utc": 1700217867,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mi76g",
   "message": "Productivity is much higher now, many hours out of the day not doing shit back when I worked at NG in my 20s. Sometimes weeks without real work. Always left after 8 hours. Now I work 10-12 hours a day fully concentrated and most weekends.",
   "created_utc": 1700220640,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mjseh",
   "message": "Lot of business was conducted over the phone. Now it’s all emails.",
   "created_utc": 1700221791,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mjxcm",
   "message": "I remember when we got email for the first time. I worked in a company with offices in different cities and would have to deal with people in different offices. This meant using the phone, but if the other person want there you had too rely on leaving a message with another person and hope that they got it and would respond.\nThen came email. If you called someone and they weren't there you could send them an email explaining what you had called about and what you needed from them. Communication become so much clearer and quicker as a result.",
   "created_utc": 1700221885,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mkftn",
   "message": "Received an envelope of cash on payday, I would divy it up into envelopes- rent, food, petrol, that fortnight’s expenses and bank the rest for the bigger bills, car rego and insurance. My entertainment budget for the two weeks was $20, which would get me a movie or takeaway or two drinks at a nightclub.\nEdit typo",
   "created_utc": 1700222238,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mkkwp",
   "message": "Gifts from vendors were a thing. I used to get things like free bottles of booze from enterprise software companies we licensed from. That dried up years ago.",
   "created_utc": 1700222334,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mkp4u",
   "message": "When I started working I made 4.25 an hour now I make 40.",
   "created_utc": 1700222414,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mkq2u",
   "message": "Income- started off at 7.50/hr with a Masters degree. $25,000 annual income was a really good income (turned that job down because it was out in the boonies)\nHow much people dressed up when going to conferences- first day women wore dresses, second day women tended to wear dress pants\nInsurance- there was no cost to the employee",
   "created_utc": 1700222431,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mkqjq",
   "message": "No more smoking rooms at work.",
   "created_utc": 1700222440,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mla5j",
   "message": "From reading the manual (RTFM) to asking ChatGPT.",
   "created_utc": 1700222806,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mlxzj",
   "message": "1) Role of communication technologies…symmetric: skype / zoom / teams etc and asymmetric: wikis, teams etc, collaboration boards etc\n\n2) Role of consultants and outsourcing\n\n3) loc cost air travel for work\n\n4) better people practices in general",
   "created_utc": 1700223239,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mlz8n",
   "message": "Technology and email\n\nMy first job was transitioning from typewriters to computers and they were just starting to get email.  If you needed to ask Bob in accounting something, you got up to see him or you called him.  \n\nResearch was done in the library by looking through books and old news articles \n\nToday, if the internet goes down, nothing can get done.",
   "created_utc": 1700223261,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mm6yc",
   "message": "This maybe unpopular, lower work ethics. Alot of the younger ones starting out in my place of work these days are to put it bluntly, lazy. There was of course the odd lazy ones back then as well but to nearly as many, and there is also some fantastic new starters now but they are in the minority.    Or maybe I'm just old and grumpy.",
   "created_utc": 1700223396,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mm7q4",
   "message": "Well, I'm not being paid 3.50 an hour anymore when I worked in a steakhouse in high school... Everything else is not as important.",
   "created_utc": 1700223409,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mmtrn",
   "message": "I'm 44 can I see participate?! 😉",
   "created_utc": 1700223786,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mn5kg",
   "message": "You can’t yell at young people when they fuck up…..I’ve been told I have a unique ability to make 20 somethings cry…. Never thought I’d be the one to call them snowflakes hahahaha….my early kitchen work I was cursed out by chefs in three different languages",
   "created_utc": 1700223986,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mnawb",
   "message": "There are lots more part-time, no benefits jobs nowadays--as there were in the 90s. \n\nAnd even if the job has benefits, they often aren't as generous as they were back in the day.",
   "created_utc": 1700224077,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mncb1",
   "message": "Drinking culture around work. Back when I started work in the mid 90's, it wasn't completely uncommon for those of us in our mid 20's to go out for a few or more after work on any old night.\n\nNow, it's basically never - the drinking and bar aspect is gone, replaced with closet alcoholism.",
   "created_utc": 1700224100,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mng7k",
   "message": "53 yo here. The biggest and favorable thing I have seen is a downward (yes, downward) trend to 40 hrs per week for better work - life balance . I worked 10 to 12 hours per day as a norm for most of my life with an occasional 6 day. It was what I did to survive. Now, I work 40 to 45 per week and I think that’s a huge improvement. Even though recent tik tok “influencers” post otherwise. It’s much better from a time to work commitment.",
   "created_utc": 1700224167,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mnidu",
   "message": "No fees at the ATM back in the day",
   "created_utc": 1700224204,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mnwqb",
   "message": "When I started there were no computers in the office. The electric typewriter ruled and appointments were written in pencil in a big leather binder with loose-leaf calendar pages. There was an answering service to take messages overnight and over lunch. There wasn't even fax!",
   "created_utc": 1700224444,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9moq1v",
   "message": "Aside from a more formal dress - working in IT meant that to support customers we had to go onsite. Remote computing was not yet widely reliable or available. \n\nEven if the problem only took 15 minutes to solve we sometimes had to drive up to an hour (or more) to get to their office. \n\nI also recall our office supplies were ordered weekly from an office supply salesperson who visited weekly with a clipboard and took an order for whatever supplies were needed. \n\nAnd the first fax machine was leased and looked upon with wonder and amazement. \n\nCar phones were bolted into the car by people who spent all day presumably going customer to customer installing them when you got a new job you sometimes got a new phone installed.",
   "created_utc": 1700224922,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mox94",
   "message": "Took all my life to get from $1.95 an hour to $30 an hour.\nThings don’t change except the cost of living.",
   "created_utc": 1700225040,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mozzm",
   "message": "Customer service:  how rude patrons have become",
   "created_utc": 1700225084,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mpf3k",
   "message": "Maternity and paternity leave are new (US). When I started working it was still common to fire women who were expecting. Or require them to take very little leave. Women used to brag about taking only a few days off.\n\nToday the young men where I work get months off as paternity leave when their spouses have a baby.",
   "created_utc": 1700225331,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mpn39",
   "message": "I have a wild story from the early 90's. \n\nWorked in the processing office for an insurance company. Around 80% of the staff were women including a similar percentage of management. Anyway, it was one guys birthday. 30th or 40th. \n\nFor his present, one of the female managers organised a whip round for a female stripper in the office in the morning. Desks were moved and everyone, women included, sat in a circle while she performed in the middle. Everyone was clapping and cheering. For a naive teenage boy just out of school it was pretty shocking.",
   "created_utc": 1700225454,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mpwtm",
   "message": "I’m 52. If you take all the technological advancements away and look at it at the base level, absolutely nothing has changed.",
   "created_utc": 1700225605,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mq020",
   "message": "I used to be the youngest guy in my trade at work, now I am not.",
   "created_utc": 1700225655,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mq68u",
   "message": "In the 90’s low-paying jobs like food service and retail hired more teenagers. Today more people in their prime working years fill these roles.",
   "created_utc": 1700225752,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mq7pg",
   "message": "I mean, the internet.",
   "created_utc": 1700225776,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mqhez",
   "message": "Paper. Lots of paper. Before email, there were people (secretaries or admins) who would take a memo someone printed out on their computer, make physical copies, and either walk around to every executive’s desk, or put into inter-office mail. This memo could be to a few people, one person, or for a general announcement needed to go to everyone.\n\nFor expediency, these memos would also be posted in public areas (lunchroom, messaging board) if it was a general notice. These memos were often routed from the head manager throughout the department if it was more for general information.\n\nWe once had a wave of new hires (about 20 people in our company of 400) and each got their own announcement. So, 20x50 copies = 2 reams of paper. Copied. Hand carried or inter-department mailed. For one set of announcements. \n\nOh, and each department admin had their own routing slip (small piece of paper with each person in the department’s name) that was stapled to the announcement. When you got the memo, you read it, crossed your name off and gave it to the next person on the list. \n\nThat’s where “they must not have gotten the memo” comes from.",
   "created_utc": 1700225929,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mqums",
   "message": "When I started at the job, the boss said proudly; all typewriters are electric. We had to fill out a form to get permission to make fotocopy. The only electronic calculator (just the basic calculations) was as big as a typewriter. No computers of course.",
   "created_utc": 1700226132,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mr891",
   "message": "The application process. I printed my resume on 20lb bond cream colored paper, ensuring that it had the proper font and formatting, and sent it out in stamped envelopes :-). Now we put minimally formatted text into a web form to achieve the same result. Truthfully most employers didn’t care too much about the esthetics of your printed resume, but it was a huge emphasis in college resume writing workshops and I spent about $150 on software to manage the different resumes I sent out. \n\nAlso, cell phones weren’t easily available in the 90s. My dad had an in vehicle “mobile” phone because he worked in the construction industry, but you had to have a land line and an answering machine with a hopefully somewhat professional sounding message not recorded by your mother. \n\nAnd though I had an email address due to being a computer programmer and hosting some early web domains for nonprofits in my area, it was not unusual for an applicant not to have email.",
   "created_utc": 1700226342,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mrmjr",
   "message": "Got paid weekly in cash. \n\nDidn’t get paid one week as the van was stopped and money stolen.",
   "created_utc": 1700226559,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mro3p",
   "message": "So many things, but I'd say the most drastic and unexpected is due to technology that was barely even dreamed of in the 80s and early 90s, the ability to work remotely .",
   "created_utc": 1700226582,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9msm08",
   "message": "Talking to women naturally. You have to be on your guard all the time in case you say the wrong thing. I'd rather not work with women these days.",
   "created_utc": 1700227089,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9msrk4",
   "message": "Well back in the late 80's/ early 90's we watched in awe as they manually cranked up the sun at the beginning of each day",
   "created_utc": 1700227174,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mtiyw",
   "message": "My first job out of college was retail. I worked a consistent schedule, got 40 hours weekly and two consecutive days off for a weekend, full benefits including medical/ dental/ vision, two weeks of vacation and additional paid sick time, 401K with small match, and a little bit in stock options. My husband earned similar wages, and we were able to rent a decent apartment in an expensive college town. This was mid/late-90s.\n\nETA: we still struggled and had a lot of debt, but were were able to make it until money got better",
   "created_utc": 1700227573,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mtkpc",
   "message": "Overt sexual harassment and sexually explicit inappropriate breakroom jokes and stories.",
   "created_utc": 1700227599,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mtld7",
   "message": "Smoking at my desk.  *(Gave that up 35 years ago BTW)*",
   "created_utc": 1700227609,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mtoz5",
   "message": "1. There was no internet—my company had a local network for file sharing \n2. Casual Fridays appeared in my first ~5 years working, and a lot of people hated it\n3. Sexism was more pervasive. I had a boss who used to openly grope female colleagues \n4. I would say racism too, but the corporate world is still pretty fucking racist\n\nWhat *hasn’t* changed much is salary, despite a massive change in cost-of-living. My entry level salary in 1994 $34k/year",
   "created_utc": 1700227661,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mtrfb",
   "message": "Smoking in offices.",
   "created_utc": 1700227696,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mu5na",
   "message": "You could actually support yourself on minimum wage. You weren't rich by any means, but you could rent a small apartment and put food on the table.",
   "created_utc": 1700227899,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9muafy",
   "message": "Sexual harrassment. In the 90s it was considered funny to comment on a woman's body, or just suggest to a woman that you have sex, in front of colleagues.\n\nBeing gay made you invisible, which was an improvement over getting fired for being gay, up until the 80s.",
   "created_utc": 1700227967,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9mue2b",
   "message": "People smoked in their offices and conference rooms.  There used to be way more secretaries (before widespread adoption of PC's).  The accounting department used to have the most people.",
   "created_utc": 1700228019,
   "score": 1,
   "submission_id": "17x50lp"
  },
  {
   "comment_id": "k9muf31",
   "message": "There is still sexual harassment, but it was incredibly common, like an everyday thing when I first entered the workforce. \n\nWomen do get to access a lot more types of work than before.\n\nMinimum wage changed a little, but not enough. It was $2.30/hr when I entered the work force. But $7.25/hr is still pitifully low.",
   "created_utc": 1700228034,
   "score": 1,
   "submission_id": "17x50lp"
  }
 ]
}