{
 "submission_id": "17xazy0",
 "title": "What is the most disturbing thing you've heard said casually?",
 "selftext": "",
 "created_utc": 1700211713,
 "permalink": "/r/AskReddit/comments/17xazy0/what_is_the_most_disturbing_thing_youve_heard/",
 "score": 117,
 "url": "https://www.reddit.com/r/AskReddit/comments/17xazy0/what_is_the_most_disturbing_thing_youve_heard/",
 "comments": [
  {
   "comment_id": "k9mj3lc",
   "message": "i worked medical health equipment delivery in college for a short amount of time. I was delivering some equipment from the company to an old sweet couple. Husband was wheelchair bound .. with severe issues.\n\nas i was doing the assembly within ear shot of them.. the old man was groaning saying he had given up and was ready to check out.\n\nhis old lovely wife was sitting there rubbing his face giving him words of encouragement..\n\n\"cmon jim, you are the strongest man i have ever known. you will come out of this. you are a fighter and survivor. Remember who you are. You are the man that *killed three people and the cops didnt catch him...\"*\n\ni pretended i didnt hear that and noped it outta there",
   "created_utc": 1700221304,
   "score": 165,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9m9hrz",
   "message": "Something I once heard a passing stranger say for which I have no context: \"He wears a scarf around his neck so you can't see where he's decaying.\" I've been curious for years and it annoys me that I'll never know.",
   "created_utc": 1700213178,
   "score": 210,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9m88x8",
   "message": "“I picked up my roommate’s hamster and threw it against the wall!”",
   "created_utc": 1700212055,
   "score": 15,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mdg7u",
   "message": "how there’s gonna be gang fight and my neighbours wanted to apologise for noise beforehand",
   "created_utc": 1700216682,
   "score": 254,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mcgar",
   "message": "An ex after I ended things “I don’t understand, if I want to be in a relationship with you but you don’t want to be in a relationship with me why do you get to win?”",
   "created_utc": 1700215830,
   "score": 72,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9m84cb",
   "message": "We had a recording for an international commercial where I work and my colleague asked me if I’ve ever been in television, I said “Yes a couple of times, but nothing major. HBU?” In which she replied with “Once, when my best friend was murdered and they tried to catch the killer”",
   "created_utc": 1700211941,
   "score": 196,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mhtyc",
   "message": "I had this indian classmate and we would occasionally cycle back home together from school. During one of these trips home he casually dropped that he killed someone in a car accident back in India. He got arrested but since he knew the right people there he managed to have someone take his place in prison for him for the right price. To be fair the guy was a bit crazy but this still shocked me",
   "created_utc": 1700220363,
   "score": 36,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mjx2v",
   "message": "I was smoking a blunt with my gf's, brother's gf and her younger cousin. As were smoking the younger cousin says to brother's gf that this reminds them of a \"funny story about their step dad\". They look at eachother and start laughing and me making convo was like what funny story. Brothers gf was like the story where he was drunk and acting crazy. Brothers gf then proceeds to tell me in vivid detail how her step dad kidnapped her, her mom, and younger cousin, while drunk off his ass. He had them all in the car, was speeding and threatening to kill everyone by driving off the road and hitting something. So brothers gf and younger cousin are laughing their asses off while I just sit there stoned with a shocked look on my face. They asked what was wrong and I said \"I'm still waiting for the funny part\" they start laughing again and say \"It wasnt funny at the moment but looking back now it was funny\" to which I said \"That doesn't sound like a funny story it sounded like yall got kidnapped and almost died\". They just kept laughing.",
   "created_utc": 1700221880,
   "score": 95,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mjfzt",
   "message": "I when younger I worked at a pool and had to lifeguard senior aerobics classes. Most participants where 65+.\n\n“Where’s so and so” \n\n“Oh he won’t be here, his wife was put into hospice”\n\n“Well I feel bad for him, but we do need some more single men around here. He’s not bad looking, has a retirement too”",
   "created_utc": 1700221552,
   "score": 93,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mjdnc",
   "message": "\"I wish it was still legal to beat your wife, never would have happened if we hadn't gave them rights.\" - a charming coworker of mine.",
   "created_utc": 1700221506,
   "score": 179,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mdqt0",
   "message": "\"scientists are so mean to each other - why are they always trying to prove each other wrong?\" She followed this with, \"I saw a study that said praying over your water makes it taste better. The molecules align into little turtle shapes\".\n\nThis was a grown ass, (seemingly) healthy young woman.\n\nI know this one isn't evil or violent, but this is the one that keeps me up at night. What if most people think like this? What if I actually think like this and I'm the one that's totally out of touch? Scary shit man.",
   "created_utc": 1700216935,
   "score": 209,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlrs2",
   "message": "I’m a pre-k teacher, and one day when I was doing lessons, one of my 4 year old boys asked me if I kill small animals. Horrified, I said NO, why would you ask me that? And he said “I want to do that, because I’m not big enough to kill people yet.” Had to report it to my admin staff, they called a meeting with his parents, the parents just laughed it off. I’ll be looking for that kid’s name on the news in 15 years…",
   "created_utc": 1700223129,
   "score": 149,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mljvm",
   "message": "Quite recently, a friend's boyfriend. We were all finishing with a climbing session and she fell from a big height, felt it in her upper spine.\nWe were surrounding her telling her to be careful, checking if she had a concussion etc. She was a bit shaken.\nHer boyfriend then said jokingly, \"if you die I'll just freeze your body and use it for sex haha\"\n\nEverybody froze. She laughed feebly and awkwardly.\nWe've told him several times he's being a sexist jerk. She won't leave him, she tried once but he manipulated her into coming back. \nThese days I can tell he doesn't understand why we're all avoiding him. He wonders why he has no friends and blames \"snowflake culture\" sometimes. Absolute dick who thinks he's a good person.",
   "created_utc": 1700222983,
   "score": 146,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9me2jc",
   "message": "Somebody I work with in college, stated that he went to a sleepover with his younger brother to a close friends house and later that first night, the friend attempted suicide in the bathroom and would've been successful had the younger brother not caught him. Later, the dude I work with also stated that he was being called \"a bad friend\" because he didn't let it become successful. Dark shit, still not even sure if I believe his story though.",
   "created_utc": 1700217214,
   "score": 134,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9me0nr",
   "message": "Girl I was on a date with dropping racist slurs as casually as if she was commenting on the weather.",
   "created_utc": 1700217169,
   "score": 247,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mhu4x",
   "message": "Was talking about how many cats my mom had while I was growing up.  A friend of mine said she would have been tying them up in bags and dropping them in the river like it was something you just do with cats.",
   "created_utc": 1700220367,
   "score": 91,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mj921",
   "message": "Girl 1: \"Ugh, I'm so hungry.\"\nGirl 2: \"Why don't you eat something? You're pregnant.\"\nGirl 1: \"Because I don't want to have it!\"\n\nThis was in line for a roller coaster by the way.",
   "created_utc": 1700221413,
   "score": 97,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mj2ar",
   "message": "\"If I didn't believe in Hell I'd murder so many people.\"\n\nDuring a discussion about morality in a college sociology class.",
   "created_utc": 1700221278,
   "score": 175,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9me9oc",
   "message": "Worked with two men about seven years ago who had a very casual conversation about getting teenage girls drunk at a local bar and seeing how long they could remain standing before they passed out.  They realised I - and my manager - were listening to every word they were saying and tried claiming that they hadn't done \"anything nasty to them\".  I still called the Police anyway.  I don't think they got prosecuted or anything like that but it sure made them shit themselves (plus them getting sacked was a nice wee Brucey Bonus).",
   "created_utc": 1700217382,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mkske",
   "message": "\"I know for a fact you can kill a man with a brick.\"  Overheard in a restaurant.",
   "created_utc": 1700222478,
   "score": 42,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mfho1",
   "message": "A guy in a bar once told me I‘m good rape-material, after I told him which my favorite car was, and thought it was a very nice compliment",
   "created_utc": 1700218409,
   "score": 115,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlmjx",
   "message": "\"If the Earth is spinning, then why my front door is always facing east?\"",
   "created_utc": 1700223032,
   "score": 38,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mh5lj",
   "message": "\"We should let kids in elementary school expiriment with drugs\" the dude who said it was a psychonaut and not in the best mental state.",
   "created_utc": 1700219828,
   "score": 64,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmybd",
   "message": "I was working at a gas station when I was 17/18. The corporate offices were directly behind us, so they would come and get lunch and snacks from time to time. One man in particular always came to my register. One day, when his wife stepped away to grab something, he casually said to me, “I want to tie you up, throw you in the back of my truck and drive away.” It was the creepiest thing anyone had ever said to me, and the way he said it so casually and nonchalant… I quit very quickly after that.",
   "created_utc": 1700223863,
   "score": 31,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9m99yq",
   "message": "How he paid a gangster friend of his to try to burn down the apartment of some guy.",
   "created_utc": 1700212980,
   "score": 54,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mjd2z",
   "message": "Worked at KFC in earlier years, I was making burgers and the guy on fries duty said.\n\n\"I wonder if fucking a dead body would be as warm as these fries\"\n\nHe left a few days later.",
   "created_utc": 1700221495,
   "score": 55,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9ml1b3",
   "message": "I drive for Uber and I once had a man who super casually said that he would do me a great favor by marrying off my teenage daughter because she should already be having children if I myself performed my womanly duty of having his children because he knew other people who were ready to get married as well. My daughter was 14 at the time by the way and yes this guy was completely serious",
   "created_utc": 1700222641,
   "score": 27,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmcy9",
   "message": "I come from from Asia where sex is pretty taboo. So my roommate was bragging about how he fuck a girl (he has 3 other gf btw, also he is a lovable popular guy but he is a monster) and called that girl a slut and stupid little cunt for sleeping with him. He took bunch of videos and photos of them having sex and the girl naked sleeping and boast about how he will spread this and sent this to her future husband if she intended to get married to let the guy know what a stupid slut she is. I fucking hate that guy but everyone loves him.",
   "created_utc": 1700223501,
   "score": 25,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mg7rv",
   "message": "I was at my neighbor's party. Some of her old friends were there, I had never met them before. All of them are 50+ ladies, much older than me. They planned on going clubbing, I was about to head home. One of the friends asked them to call a mutual friend for a ride and casually explained to me \"I don't want to end up in a taxi with a black driver\".",
   "created_utc": 1700219001,
   "score": 88,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mh2qw",
   "message": "While working in a local restaurant, a guy at the counter, who I had never seen before, casually mentioned anyone who has an Opioid addiction should be lined up and executed. \n\nMy son went thru an Opioid addiction and was homeless for two years. He struggled, got himself clean, has a great job, nice home, a loving relationship and a beautiful daughter. Which he never would have had if the solution was to execute him.\n\nI was shaking I was so mad. I literally ripped into his ass and management threw him out. Fucking moron",
   "created_utc": 1700219764,
   "score": 165,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlpqd",
   "message": "Rode a taxi, radio was discussing lgbt. Driver started complaining that his daughter is a lesbian. He said he’s planning on getting her raped so she “can feel what a man can do for her and change her mind”.",
   "created_utc": 1700223092,
   "score": 61,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mj9mv",
   "message": "“Oh my god, I completely forgot to kill my boyfriend!”",
   "created_utc": 1700221424,
   "score": 18,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mkbt7",
   "message": "\"we should bring back slavery\" my stupid brother in law.\n\nHe got kicked out of a restaurant when he and his wife were on the second floor and I guess he wasn't happy about the race of people in the room with him and said out loud \"I would love to hang some people from a noose out this window\" and they heard and he got into an argument with them \"what??? If YOU PEOPLE knew how to behave in public we wouldn't have this issue!\"\n\nOne time we walked by a car and it had a bumper sticker that said \"Naga Hunter\" and he was like \"I like this guy, you know what that means?\" And I thought it was something nerdy like the Naga lizard people in dnd or something but he was like \"NO! It means N****r Hunter!\"",
   "created_utc": 1700222162,
   "score": 43,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmd8u",
   "message": "Started a new job and struck up a conversation with a fellow employee. Made small talk and she told me about her grandchildren. She then says she tells them if they misbehave while they're at her house she will punch them in the face.  I thought she was joking, but no, she said it again \"I. WILL. PUNCH. THEM. IN. THE. FACE.\"  (What!?!??!)",
   "created_utc": 1700223506,
   "score": 14,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mkh7z",
   "message": "“It was annoying me and so I just threw it into the wall and hit it with a hammer” - my former friend, to his pet rat.",
   "created_utc": 1700222263,
   "score": 30,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9ml0ns",
   "message": "my dad saying the legal age should be dropped to 13-15. yikes",
   "created_utc": 1700222629,
   "score": 31,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlipy",
   "message": "\"Let's go around the room and say a few things about ourselves \"",
   "created_utc": 1700222961,
   "score": 32,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mm4sz",
   "message": "“My dad knew some of those guys, they just changed the names.”\n\nWhile watching Casino with a friend. Same friend who saw the best man arrested his dads wedding. \n\nI began to have suspicions.",
   "created_utc": 1700223358,
   "score": 12,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmbya",
   "message": "That Diddy blew up their Car. The person was Kid Cudi.   \n\n\n\u0026gt;“In February 2012… Mr. Combs told Ms. Ventura that he was going to blow up Kid Cudi’s car and that he wanted to ensure that Kid Cudi was home with his friends when it happened,” read court documents obtained by The Post. “Around that time, Kid Cudi’s car exploded in his driveway.”  \n  \n\u0026gt;  \n\u0026gt;Through a spokeswoman, Kid Cudi confirmed Ms. Ventura’s account to the New York Times that he had a car that exploded.  \n“This is all true,” he said\n\n  \nExcuse me. WHAT?!?!?!?",
   "created_utc": 1700223483,
   "score": 12,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9ml090",
   "message": "Took a law class in college. Sat next to a friend. One day we talked about how threatening to unalive yourself in order to get someone to do or not to do something is a crime. Friend looks gobsmacked and goes \"wut, my mom did this to my dad, like, all the time\"",
   "created_utc": 1700222621,
   "score": 46,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mk898",
   "message": "A year ago after a funeral i found out i had a brother.\nThen after the funeral, my father invited him over so they could have a talk after not seeing each other in like 20 years or something. That was the day i found out my dad was not the nice guy i always thought he was. When i was trying to listen to them and he casually told the Man, my brother, that my dad had hired someone to kill my brother, so he wouldnt have to pay Child support anymore(€90 a month), that my grand father was paying. And he was costing him too much time and money he couldnt focus on his drug and weapons trade. \n(Appearantly He stopped doing that before i was born, so i never knew)",
   "created_utc": 1700222094,
   "score": 22,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlvek",
   "message": "I have a very Waspy name for a Jewboy and the anti-Semitic and racist shit that I hear just reinforces my opinion that people suck.",
   "created_utc": 1700223193,
   "score": 9,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mme5m",
   "message": "\"oh yeah, that party where Ana was raped, what year was that?\"",
   "created_utc": 1700223522,
   "score": 9,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mnyha",
   "message": "I was on a train one time and across the aisle from me was a young father, his wife or gf and their two twin baby girls in a double stroller. A dude gets on the train and it’s like a reunion. They’re doing the whole ‘hey how ya been?’ thing. He’s kneeling on the ground playing with the girls and talking to them in a baby voice. \n\nDad says to him, “hey you ever see so and so?” And without missing a beat, drops the baby voice and says, “We had to fuck him up. Bashed in his knees with the butt end of a shotgun”. Goes right back to telling the girls how cute they are. Mom and dad didn’t seem phased at all. I didn’t get the whole story but it sounded like snitches get stitches kind of thing.",
   "created_utc": 1700224473,
   "score": 9,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mnzdn",
   "message": "Last week I was in this fancy neighbourhood in Rome where people usually go to party and I heard this English guy saying “I just want to stick my finger in somebody’s butthole”",
   "created_utc": 1700224488,
   "score": 9,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mn8vd",
   "message": "I helped out this East Asian fellow standing infront of me at the grocery store, with some change to pay his bill. He looked at me and said “ don’t drink Coke in December” then walked away. It allwags bothers me",
   "created_utc": 1700224043,
   "score": 8,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mnmzc",
   "message": "There was this dude in highschool who ended up getting arrested and is now a registered sex offender for jacking off in class while putting his hand on a girl’s shoulder. But before that, there was one day he was talking about how annoying a certain teacher was and verbatim he said, “I wish I could travel back in time to when she was a little girl, chime her and rape her and say, your future self did this to you! You deserve it!”",
   "created_utc": 1700224281,
   "score": 8,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mbuvk",
   "message": "Homosexuals should be strung up with the Muslims.",
   "created_utc": 1700215308,
   "score": 42,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlb3q",
   "message": "“My dad beat me til I was bloody to the face but we are cool now”",
   "created_utc": 1700222823,
   "score": 14,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9momc5",
   "message": "Worked on an island in SE Asia a while back. Someone came in to work and asked to put up posters. After she left I saw that they were of a friend of her's that had been missing for three weeks from an island nearby, a tourist.\n\n A boss of mine, a local man from the capital city who grew up in gangs, said \n\n\"it's either he doesn't want to be found or he's dead, either way they'll never find him.\".\n\nI said \"what makes you say that\". He looked at me with a menacing grin.\n\n\"The best way to kill someone around here is to use truck tyres. You take them to the jungle, beat them, tie them up, and burn them, burns so hot theres nothing left.\"\n\nI don't think he's ever done it before. But he definitely knows people that have.",
   "created_utc": 1700224862,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mkqym",
   "message": "It's okay though, nothing happened till she was 18",
   "created_utc": 1700222448,
   "score": 13,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9ml1f3",
   "message": "\" she’s so hot , makes me wanna rape her \"",
   "created_utc": 1700222643,
   "score": 13,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmiy7",
   "message": "one time i was at taco mac causally talking to a server with a friend when he brought up a recent story how his friends were going around asking each other what the most fucked up thing the other has done and he just nonchalantly tells us how he killed a cat. like in the serial killer way. forget how exactly he did it but i remember me and my friend having to nod it off, telling him that’s fucked up they judged him so hard, etc, and then when he left we just looked at each other in shock",
   "created_utc": 1700223604,
   "score": 6,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mn9i9",
   "message": "We shouldn't have stopped him so soon.\n\n-- An older family member discussing Hitler.",
   "created_utc": 1700224053,
   "score": 6,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mnoqd",
   "message": "Off the top of my head, here's three\n\n\u0026amp;#x200B;\n\n\"hope you never marry a black guy\"\n\n\"she used to poison dogs\"\n\n\"he fucked his family therapist\"\n\n\u0026amp;#x200B;\n\nMy family isn't great. I'm sure I could think of a ton of other awful shit. Oh last time I was visiting, I was struck by how often they drop the N word, like with a HARD R.",
   "created_utc": 1700224310,
   "score": 11,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mjzsm",
   "message": "“The only solution is to round up every Palestinian and shoot them. They’re all guilty.”\n\nI nearly threw up, this guy is known for being an asshole but to casually mention genocide was disturbing. I was just doing my job…",
   "created_utc": 1700221932,
   "score": 30,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlqzc",
   "message": "If it wasn’t for my horse, I wouldn’t have spent that year in college….",
   "created_utc": 1700223115,
   "score": 5,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmotl",
   "message": "\"There's nothing wrong with being a mime.\"",
   "created_utc": 1700223703,
   "score": 5,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mneam",
   "message": "“All jews should be eradicated “",
   "created_utc": 1700224134,
   "score": 5,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mo76l",
   "message": "That one clip of a cop laughing while talking to another after he fucking drove over and killed some college student",
   "created_utc": 1700224614,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mrycz",
   "message": "A young woman with whom I'd been working with for a short time was in our locker room, inside the restroom stall. She exited the stall and went to the mirror, looked at herself then said, \"I'm bleeding to death.\"  I said, \"I'm sorry, I know how bad that can when you're on your period.\"\nHer response was a shocker to me. \nShe replied, \"Nah, I had an abortion. I bled like this the last couple times, too.\" She just so nonchalantly said it...\n\nI walked away, thinking of the two miscarriages I'd recently had, and it broke my heart. \n\nLife is not fair.",
   "created_utc": 1700226738,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmabe",
   "message": "Two elderly women standing outside a grocery store… “ I hear he has shingles now, but I don’t feel bad for him because he’s a Democrat.”",
   "created_utc": 1700223455,
   "score": 9,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlmwj",
   "message": "Credible threats of murder pales in comparison with when a convicted arsonist said he liked me.",
   "created_utc": 1700223039,
   "score": 5,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mng5h",
   "message": "Met a fellow teacher, who was around 67, for coffee and he casually said, “when I was 30 I was sleeping with a load of 13 year olds! They were just throwing themselves at me.”\n\nI left shortly after, walked back to the school and informed the owner that if this man taught children I’d quit on principle. Turns out he had already been banned for pinching a kids nipple.",
   "created_utc": 1700224166,
   "score": 4,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mnzn2",
   "message": "At Macy's, two teen girls: \"Women over 30 have the ugliest elbows.\"\n\n\"OMG. I know. Very disturbing.  I always ask my mom to wear long sleeves when we go out to eat.\"",
   "created_utc": 1700224493,
   "score": 4,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mo043",
   "message": "I was dating a new Girl, met her at a Party, I was in her House, I walked to the bathroom, Her Father was on the phone, said to who ever he was on the line with. My daughters new BF is from Queens I think he is a FFFFN JEW, Should I turn on my oven, This was in 1979. BTW I am Irish Catholic, Needless to say I knew I was not hanging around for long.",
   "created_utc": 1700224500,
   "score": 4,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9moiiz",
   "message": "\"I breaked the neck of my ex-girlfriends pet snake, she thought it just died sleeping.  That's the price of breaking up with me\"    \nA dude eating his KitKat and trying to have conversation with me on the train.",
   "created_utc": 1700224800,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9ms0sd",
   "message": "some people talking about holidays.... \n\nguy 1 \"where is the embassy in this country\"...... \n\nguy 2\"which embassy?\", \n\nguy 1\"Our embassy\"\n\nguy 2 \"we don't have an embassy, in the country that we live in... we have a government\"",
   "created_utc": 1700226775,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mge2z",
   "message": "_\"...only white people can be racist.\"_\n\n_this was said by elected official from Orlando, FL., Regina I. Hill_",
   "created_utc": 1700219139,
   "score": 40,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mlf8d",
   "message": "A friend of mine casually said one day while she was showing me pictures of her from school \"I used to cut myself for fun, infact I had a group of girls and we used to draw tiny patters on each others arms and legs\".  \n\n\nWhats disturbing was when her teacher complained about this to her parents she wasn't scolded about it.",
   "created_utc": 1700222897,
   "score": 7,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9moh8h",
   "message": "\"I was there on Jan 6.\"",
   "created_utc": 1700224779,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mmkpv",
   "message": "Someone once told me about them mucking around with an air rifle, they were shooting cotton buds out of it to see if they worked like bullets. They saw a dog who was behind their owner being dragged along while having a poo and shot at the dog. They killed it. They laughed about it while telling me. I was horrified and the 'friend' is someone I no longer spend time with.",
   "created_utc": 1700223634,
   "score": 3,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mnmrq",
   "message": "Many years ago I was an assistant manager at a tobacco shop. We had one customer, I cannot remember his nickname, but I do remember his name.  Ricky Ray Lastname.  He was a Vietnam era vet.  I had asked one of our other customers (she worked at the VA) about him because his behavior was so....  Off.  I got out of him that he was stateside and was a Marine. When the VA lady got back to me, she said there were several Ricky Ray Lastnames from that time that were stateside and two had been seen since for mental health, my Ricky Ray Lastname was one of them. I had asked her to check up on him because he came in one day like normal buy his Clove Bidis that he said kept the spirits away, but we were out. He conversationally started telling me about the demon woman that slept in his bed sometimes. She wasn't a human. She would come into his apartment sometimes and break his plates and sleep in his bed.  He said if he could get the magic from the Bidis, she's start letting the bugs out of her stomach and then he'd be in real trouble. He said, I guess I'll have to go home and kill her.\"  as if someone was accepting the fact that they'd outgrown their favorite shirt and needed to buy another.  Turned out Ricky Ray was batshit, but never violent.",
   "created_utc": 1700224277,
   "score": 3,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mpy3a",
   "message": "I was a camp counselor during the summers in high school and often had the youngest group of boys, usually 8-9 years old.  While we were at the lake catching frogs and tadpoles and stuff, one kid picked up a bag with the group’s frogs and spun it around and then slammed it into the ground very hard—killing the frogs.\n\nMy co-counselor kind of yelled at him like “why would you do that?! You killed them!”\n\nThe kid responded with this weirdly sick smile: “I kill things all the time. I kill rats. I kill squirrels.  I kill snakes. I kill dogs. I even killed a cat once when I caught it.” \n\nEveryone was kind of stunned by this.  Even the other kids were creeped out and nobody seemed to respond for a long few seconds.  My co-counselor and I were like ok that’s enough lake for today.  The kid was weird. He didn’t have many friends and we thought he was bullied because he got picked on early on that summer (and we later found out beat the shit out of the kid who picked on him), but it turned out the kids knew better than us that he was a complete psycho.  I don’t know what happened to him. He moved away so didn’t come back to camp after that year, but I’m convinced he’ll end up in a news headline some day.",
   "created_utc": 1700225624,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mq3by",
   "message": "A boy in my school went around bragging about how he took part in sexual activity with his sister. Who btw blushed whenever he said that. It was so disturbing that we informed our professor.",
   "created_utc": 1700225705,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mqvwj",
   "message": "I am a tutor.\n\nI heard some of my students say \"What's the point in learning history? We should live in the present.\"\n\nWe are German.",
   "created_utc": 1700226151,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mqz1j",
   "message": "\"I don't like animals, they make me do mean things\"\n\nMy cousin who I met twice, then never again because we found out he was killing kittens from his dad's farm for fun and progressively moved to chickens, and eventually got caught mid-attack of one of the hens. \n\nThe cousin was 16 when I met him, I was in my early 20's and he nearly towered over me. Dude scared the hell out of me ngl.",
   "created_utc": 1700226199,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mqz9l",
   "message": "My mom \u0026amp; I were out to breakfast \u0026amp; waiting for a table. An older man kept staring at my mom, \u0026amp; when she noticed, he told her, “Oh, I was just reading your shirt.”\n\nOh okay, no problem. We relaxed a little…just in time for him to add, “Actually, I was looking at your breasts.”\n\nThankfully we got our table not too long after that \u0026amp; didn’t have to deal with Mr. Peeper for long, but…wow.",
   "created_utc": 1700226203,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mr3ra",
   "message": "I once went to a party and heard this guy comment that I looked “rape-able” I noped out of there after he said that. \n\nThis was back in high school about 8 years ago and this year, one of my friends and a bunch of other woman came forward that the guy in question abused them. Over 50 woman have come forward now",
   "created_utc": 1700226272,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mrc1b",
   "message": "“There are so many places to dump a body in this area where they could never find it”\n\n-abusive ex husband as we drove through expansive forest.",
   "created_utc": 1700226400,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mry6r",
   "message": "“If you ever try to run from me, you won’t get far before I sink my teeth into you and drag you back to where you belong” - My ex",
   "created_utc": 1700226735,
   "score": 1,
   "submission_id": "17xazy0"
  },
  {
   "comment_id": "k9mn6m5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17xazy0"
  }
 ]
}