{
 "submission_id": "17xlawa",
 "title": "What’s something people eat or do that they think is healthy, but is useless?",
 "selftext": "",
 "created_utc": 1700245005,
 "permalink": "/r/AskReddit/comments/17xlawa/whats_something_people_eat_or_do_that_they_think/",
 "score": 147,
 "url": "https://www.reddit.com/r/AskReddit/comments/17xlawa/whats_something_people_eat_or_do_that_they_think/",
 "comments": [
  {
   "comment_id": "k9p6abx",
   "message": "I watched a \"what I eat in a day\" video by a professional ballerina who eats a slice of tomato every day but her nutritionist told her that sesame seeds are good for your bones so she eats tomato slices with a shake of sesame seeds for lunch every day thinking it's going to help her bones.",
   "created_utc": 1700262430,
   "score": 55,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ov2xa",
   "message": "\"Detox\" with a juice fast. Your liver will do it.",
   "created_utc": 1700257749,
   "score": 45,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ovza5",
   "message": "Any of the cleanses. They don’t do anything. So stupid.",
   "created_utc": 1700258112,
   "score": 240,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p46am",
   "message": "Granola. Hikers eat it because it's full of calories and light. Not because it's good for a desk worker to eat as a snack.",
   "created_utc": 1700261519,
   "score": 59,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ogfic",
   "message": "Taking too many of certain vitamins.  I know some can cause harm when over-used, but many just become expensive urine.",
   "created_utc": 1700251942,
   "score": 139,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9palzx",
   "message": "Those silly foot stickers that “remove toxins through the feet” toxins are not excreted through the skin and the pads change colour due to a reaction to the air",
   "created_utc": 1700264398,
   "score": 203,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pcf55",
   "message": "Does anyone remember in the ‘90s when we convinced ourselves that gigantic muffins constituted a healthy breakfast?…it’s fuckin’ CAKE for chrisssakes!!",
   "created_utc": 1700265246,
   "score": 33,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9oyxyp",
   "message": "Everything sold through an MLM such as Herbalife or Essential Oils. It's all absolutely useless crap that morons buy.",
   "created_utc": 1700259318,
   "score": 154,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9otejo",
   "message": "Alkaline water",
   "created_utc": 1700257072,
   "score": 48,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ok96x",
   "message": "Juice",
   "created_utc": 1700253445,
   "score": 61,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9po7f2",
   "message": "You lot are freaking me out. Have a cup of tea.",
   "created_utc": 1700270815,
   "score": 165,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9oa9df",
   "message": "Superfoods.\n\nUsually they have some tiny additional percentage of some micronutrient that you're almost certainly not deficient in anyway. In some cases too there are foods that are not considered superfoods that have more than that micronutrient, but are boring like apples or something, so are disregarded to market the overpriced superfood.",
   "created_utc": 1700249531,
   "score": 72,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ojqoq",
   "message": "I don’t think these exist anymore but there used to be this exercise machine that had this wide belt that went on the back of your rear end and the front ends were attached to the machine that would jiggle the belt and it was supposed to be great exercise but it was essentially useless.\n\nWow all! Hit the jackpot here with all these comments to my post!",
   "created_utc": 1700253239,
   "score": 28,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ow6o4",
   "message": "Cleanses. People spend a ton of money on juices etc. to do something that your body already does on its own.",
   "created_utc": 1700258195,
   "score": 47,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p6ysv",
   "message": "Axe Anti Hangover Showergel...",
   "created_utc": 1700262731,
   "score": 123,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9owc0n",
   "message": "Granola bars",
   "created_utc": 1700258254,
   "score": 181,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pcbou",
   "message": "Often the stress of eating the donut when you're not supposed to has worse affects than the donut does.\n\nI'm talking about the self hate and feeling like a weak piece of shit being worse for you than the sugar and empty calories",
   "created_utc": 1700265201,
   "score": 170,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p287c",
   "message": "Naked Juice, 34 grams of sugar per bottle. HA",
   "created_utc": 1700260691,
   "score": 182,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9opr9s",
   "message": "Any junk food that is processed and advertised as “healthy because it has x healthy ingredient” \n\nMy MIL is constantly bringing chips, cakes, etc that are under 5 layers of plastic and say healthy on the packaging because they used a potato somewhere in the process. \n\nAnd then will proceed to eat 47 servings and act like I’m anorexic for not being interested.",
   "created_utc": 1700255622,
   "score": 233,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p0jys",
   "message": "The gut cleanses or parasite cleanses lol. They actually are more likely to do harm than good.",
   "created_utc": 1700259984,
   "score": 90,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9oxzn5",
   "message": "Eating a salad that barely contains any vegetables besides lettuce that they absolutely douse in ranch dressing.\n\nJust drink the ranch and skip the extra steps.",
   "created_utc": 1700258926,
   "score": 171,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9phwex",
   "message": "I think lean cuisines and healthy choice are pretty useless. Hardly any calories and plenty of sodium. It is hard to imagine eating one and not being hungry a couple hours later. But ooh, I can eat chicken Alfredo. 1 tiny cup of it….",
   "created_utc": 1700267816,
   "score": 40,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ozx2b",
   "message": "Himalayan pink salt\n\nThe nutrients in it are nill.  Just use kosher salt or Redmond brand pink harvested in the US\n\nedited- brand name was wrong\n\nedit 2- redacted the bit about it being \"basically slave labor harvested\"",
   "created_utc": 1700259721,
   "score": 186,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p6fq1",
   "message": "Any MLM drink.",
   "created_utc": 1700262495,
   "score": 75,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pukm0",
   "message": "Everything praised by Dr Oz.",
   "created_utc": 1700273885,
   "score": 134,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ou2lk",
   "message": "Fat free really isn't doing anything for you one way or another. It will actually probably make you MORE hungry, more likely to eat something that is legit bad for you, or overeat more than you desire. \n\nJust eat the whole egg, put a little actual half and half in your coffee. Unless you are allergic to eggs or dairy, it will not kill you.",
   "created_utc": 1700257342,
   "score": 61,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9om66d",
   "message": "I've heard so many people say, \"I don't eat fast food.  Except Chick-Fil-A.  You know, because it's healthy.\"\n\nWTF?!  It's fried chicken.  There's nothing healthy about it.\n\nI once had a coworker that hand no idea how to eat healthy. He was straight out of college.  He even thought ranch dressing was healthy because it had veggies on the label.\n\nI'd give him simplified tips while we'd discuss food.  Like \"in general, creamy dressings are pretty unhealthy.\"  I didn't want to sound like I was lecturing him.  Eventually he got serious about learning more (good for him!) and he probably lost like 100 lbs.  It's all about education and will power.",
   "created_utc": 1700254202,
   "score": 238,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pcjfn",
   "message": "Wraps instead of bread. Check the label - same amount of calories and carbs. It's just a compressed bread.",
   "created_utc": 1700265302,
   "score": 7,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pg00r",
   "message": "Weight loss gummies where you can eat “anything you want”.",
   "created_utc": 1700266921,
   "score": 33,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pmz9b",
   "message": "Well, we just found out today that those Balance of Nature supplements in thousands of commercials got yanked by the FDA for being hokum.",
   "created_utc": 1700270229,
   "score": 33,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p5bn3",
   "message": "lemon water. bonus points = gwyneth paltrow having “alkaline water with lemon in”…. so alkaline + acid…? so just… water??",
   "created_utc": 1700262007,
   "score": 83,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9q1o0t",
   "message": "Drinking too much water while simultaneously not consuming enough salt.",
   "created_utc": 1700277441,
   "score": 182,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p4608",
   "message": "Detox stuff, we have a liver, let it do its job.\n\nOk idk how to put this down but on tiktok I saw people shoveling a tube up their arse to \"clean\" their colon, wtf? This is not only useless, it's also dangerous. \n\nThe useless and infinite supplements world.\n\nDrinking water and lemon early in the morning, a great opportunity for gastritis. \n\nAvoiding lactose and gluten when you don't need to. Also avoiding lactose will probably give you lactose intolerance.",
   "created_utc": 1700261516,
   "score": 56,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9opdxz",
   "message": "“Healthy desserts” that are baked goods just as full of of carbs and fat, just not white sugar and butter.  I know that trans fats are not good, but natural oil  and coconut oil packs on the pounds too and honey and maple syrup will still rot your teeth.  I enjoy real desserts for what they are and try to exercise moderation.",
   "created_utc": 1700255475,
   "score": 72,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ogkhj",
   "message": "\"Gluten Free\" is only helpful if you have Celiac disease or something similar.  Otherwise it has a very good chance of being the *less* healthy option because non-gluten flour tastes terrible and requires extra additives to be appealing; more sugar, more butter, etc.",
   "created_utc": 1700251995,
   "score": 103,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p8kw0",
   "message": "Drinking their own urine.\n\nEnemas, especially using things other than water, e.g. coffee.\n\nDouching.\n\nUsing anything other than water on the mucus membranes of the labia.\n\nTaking antibiotics for viral infections.\n\nTaking a dose of vitamin C for three days because it’ll “cure their cold”.\n\nPutting essential or fragrance oils on your skin and expecting them to heal stuff.\n\nEt cetera.",
   "created_utc": 1700263457,
   "score": 237,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pme3t",
   "message": "Let's talk about Farmer's Markets, where we have been conditioned to believe the people selling at the market grew them and they are organic, fresh etc.\n\nOne year I bought an \"organic\" chicken from the market, and  when I asked the harvest date, it was  a YEAR old. A year. I paid a hefty price for a year old frozen chicken. And found they didn't even have chickens! They were buying harvested chickens and slapping their own label on it and charging a huge price. And keeping the ones that didn't sell last year for a long time instead of marking down and selling it at the end of the season.\n\nBut from there, after the outrage faded, I started looking into Farmer's Markets and found it's nothing like we think it is. A lot of the seller''s purchase their 'organic' products at Costco or other wholesellers in the region. \n\nIt's an absolute scam, and we are paying premium prices to 'buy local' and 'organic' when it's NEITHER.\n\nNow, there is a local bakery that does bake on site and sell their goods. There is exactly ONE of the six so-called ranchers who actually grows and butchers the meat. The others are purchasing the meat elsewhere.  If you cannot visit the ranch and see if animals are being harvested as they claim, then it's a scam.\n\nThere was a documentary on the subject:\n\nhttps://www.youtube.com/watch?v=YYwB63YslbA\u0026amp;ab_channel=CBCNews\n\nI don't go to Farmer's Markets anymore.",
   "created_utc": 1700269950,
   "score": 68,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9pc496",
   "message": "Chiropractic care.",
   "created_utc": 1700265103,
   "score": 211,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9owk6l",
   "message": "Those green powders. Just eat some real veggies",
   "created_utc": 1700258345,
   "score": 82,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p9z57",
   "message": "Drink alkaline water. Goes right into their pH 1 stomach acid and turns acidic anyway. \n\nSource: I’m a chemist",
   "created_utc": 1700264107,
   "score": 89,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9ps9xp",
   "message": "Bottled water for everything... add to that all the plastic in the landfill and the oceans. 💌",
   "created_utc": 1700272766,
   "score": 36,
   "submission_id": "17xlawa"
  },
  {
   "comment_id": "k9p8enc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17xlawa"
  }
 ]
}