{
 "submission_id": "17yaner",
 "title": "People who have been really drunk, whats the worst thing that you have done?",
 "selftext": "",
 "created_utc": 1700326516,
 "permalink": "/r/AskReddit/comments/17yaner/people_who_have_been_really_drunk_whats_the_worst/",
 "score": 252,
 "url": "https://www.reddit.com/r/AskReddit/comments/17yaner/people_who_have_been_really_drunk_whats_the_worst/",
 "comments": [
  {
   "comment_id": "k9scjqc",
   "message": "Fell asleep in the alleyway. It was dumb and dangerous. Friend found me.",
   "created_utc": 1700329107,
   "score": 15,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sspqy",
   "message": "I threw a chicken into a swimming pool once and then dived in to rescue it. According to my friend I was so distraught that I took it to bed with me to keep it warm.\n\nWhen I woke up the next morning I had no memory of the night before and found a chicken in my shower.",
   "created_utc": 1700336133,
   "score": 8,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9srxto",
   "message": "Went out drinking with fellow booksellers and got very drunk indeed. Had the brilliant idea to sleep close to the bookshop rather than go home. Walked around and eventually found a little hut near the car park for the attendant to work in during the day. Climbed through the window and slept in his chair. At some point in the night I felt very ill and rather than make a mess I puked in the little drawer in his little desk. Filled it completely to the top, closed it and went back to sleep. Woke up with a terrible hangover and went straight back to work. Remembered halfway through the day about the puke and have felt terrible about it ever since. Still find it hard to read Goldilocks and the Three Bears with the kids.",
   "created_utc": 1700335794,
   "score": 165,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sup1l",
   "message": "telling my girlfriends mother that i couldn't fuck her daughter that evening cause i was too drunk to get a condom on",
   "created_utc": 1700337003,
   "score": 219,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9s7zjk",
   "message": "Stole the hosts lunch in their fridge, ate it, then threw it up all over their deck and it froze over in the -30°C weather and they had to hack it off with a shovel",
   "created_utc": 1700327185,
   "score": 181,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sdqmg",
   "message": "got arrested after puking on a cops shoes swearing i wasn’t drunk",
   "created_utc": 1700329610,
   "score": 177,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sefa2",
   "message": "I've been black out drunk but never had a great story to tell other than passing out in random uncomfortable positions. However my older brother got extremely drunk one night and I woke up to him standing over my bed. I asked what are you doing. He proceeded to unzip his pants and piss all over me and my bed. Then he stumbled around and passed it in a plastic tote.\n\nHe has no memory of this but unfortunately I do.\n\nEdit: just realized I said passed it instead of passed out. Eh I'll leave it tho.",
   "created_utc": 1700329898,
   "score": 228,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9skpwn",
   "message": "My buddy told me he'd take me home after a night out. He got too drunk and didn't want to drive (good choice), so he called me a cab and got me a hoagie from Wawa.\n\nThe last thing I remember was climbing into the cab. I really wish I could recall the events of the night after that. \n\nThe next morning I woke up in someone's gravel driveway, no hoagie and no phone, I only had my wallet.\n\nI just hope I didn't ruin that cabbies night but I can almost be assured that I did.",
   "created_utc": 1700332630,
   "score": 143,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9ssfak",
   "message": "I was too drunk to drive so I drove my RC car to the liquor store while walking behind it and it got ran over by a drunk driver \nRip SCX10",
   "created_utc": 1700336005,
   "score": 226,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9s7q38",
   "message": "Trying to walk in higher heels than usual I fell into a swimming pool at a party where I didn't know the hosts very well.  Nobody wanted to fish me out as I was wearing a long maxi dress it was hard to climb out on my own.",
   "created_utc": 1700327073,
   "score": 38,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sfvdi",
   "message": "Pooped on my floor",
   "created_utc": 1700330520,
   "score": 121,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sdexk",
   "message": "Had a Christmas party and there was a different party next door that was having an awards type event, I got up on stage and starting singing Jessie’s Girl. \nEven to this day I am mortified.",
   "created_utc": 1700329473,
   "score": 168,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sjnq9",
   "message": "Ugh I had been enemies with the neighbors we shared a fence line with and that all went down the shitter once I had a few shots of tequila on a new years eve thing. Screeched at the neighbors that I loved them and then passed out. Not as bad but my pride hasn't forgiven me since",
   "created_utc": 1700332166,
   "score": 116,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sg6cn",
   "message": "Shared food with a stray dog.",
   "created_utc": 1700330651,
   "score": 89,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sgb03",
   "message": "Walked away from a party, went to my friends garage and slept. Woke up, went back. They had called police and coastal guard becuase they thought I had drowned or went missing.",
   "created_utc": 1700330706,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9s8rmj",
   "message": "Drive",
   "created_utc": 1700327518,
   "score": 232,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sgv0s",
   "message": "Pissed my pants mid conversation, put my head through drywall on my way to change, bled all over my roommate’s floor, got the cops called on me, and ended up with an expensive ambulance ride and overnight hospital stay. It was a 3-person bday party, and it turns out our hidden personal igloo of jungle juice had a liter of codein dumped into it by a friend who thought it would be a fun surprise for the bday boys \u0026amp; girl.",
   "created_utc": 1700330947,
   "score": 205,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sygdy",
   "message": "Repeatedly pet my boss like a cat at the work xmas party. Hit on the female bartender and loudly announced my bisexuality to everyone. Ended up being bundled up in a cab by colleagues and sent home, whereupon I puked on myself right at the door. Stripped in my living room and then fell asleep on the floor.",
   "created_utc": 1700338650,
   "score": 68,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sqw3c",
   "message": "I was 21, maybe 22. Just transferred to UW-Milwaukee. Every weekend I was going out to the bars/clubs with a bunch of international students I befriended. One weekend, we all went to a frat party where some of the guys asked me to join. I wasn’t interested at the time so politely declined.\n\nFast forward a couple of weekends later, me and my buddies are at a club and I got so drunk I realized I just needed to go home. I called a cab (Uber and Lyft wasn’t a thing back then) and (in my drunken stupor) realized I didn’t have any cash on me. The cab driver was so pissed he took me all the way back to the club that he picked me up at and dropped me off. I started walking home, fell down and broke my cell phone so I couldn’t call anyone for a ride. While I was walking, a policeman pulled up beside me probably realizing I was completely hammered and maybe needed help. \n\nNot sure why, but I told the cop I was part of the fraternity that had asked me to join a couple of weeks ago. He said “wait really? I’m an alumni from there. Get in, I’ll drop you off.” Brought me right back to my dorm lol.",
   "created_utc": 1700335333,
   "score": 29,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sf1st",
   "message": "Fingered my friend of a friends mum while she was having an arguament on the phone with her boyfriend, they broke up, i fucked her and they made up all in the same night.\n\nTold my closest friends what happened and none of them really believed me until we met one friend who was IN THE ROOM when me and her were getting it on and he confirmed it all for them.\n\nRoom was dark, he didnt see much but she did keep talking to him while riding me. He even asked to \"be tagged in\" and she told him to fuck off.\n\nNot the worst thing someone can do but its very shitty and out of character for me.",
   "created_utc": 1700330164,
   "score": 197,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9s8mj7",
   "message": "left my own birthday party (walked!), called my mom, and apologized for every shitty thing i did as a teenager. Then i proceeded to accidentally sit on a shard of broken mirror. Thankfully I was able to calmly deal with it as I couldnt feel a fucking thing.",
   "created_utc": 1700327457,
   "score": 120,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9s79lm",
   "message": "Jump in a pool and try to hold my breath for as long as possible",
   "created_utc": 1700326876,
   "score": 113,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9si19d",
   "message": "Jumped off a balcony and shattered my femur",
   "created_utc": 1700331458,
   "score": 56,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9skfij",
   "message": "My best friend and I used to go to a local holiday ale fest every year and get shit faced. Also, every holiday season in our city a group of volunteers would knit little scarves and hats for all the statues downtown (mostly of animals). One year my friend thought it would be funny to take one so she snatched a tiny knit hat off of a deer statue and shoved it in my coat. A few days later I saw a news report about all the knit items being stolen and how the knitting group was going to work tirelessly to replace them. I still have it and feel ashamed whenever I come across it lol.",
   "created_utc": 1700332505,
   "score": 50,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9srk26",
   "message": "My brother one time got so drunk that he passed out and slept on his arm in a bad way all night. When he woke up it was completely numb from the shoulder down and this lasted months. He ended up needing physical therapy for three months to get feeling and movement back.",
   "created_utc": 1700335627,
   "score": 51,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9s859f",
   "message": "Drove. Got into an accident and messed up my car. Luckily the only other participants were a few trees. Otherwise I could have really screwed up someone else’s life or mine without any hope of recovering, physically, criminally and financially. Luckily that was my wake up call to get my life back on track.",
   "created_utc": 1700327253,
   "score": 9,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sqeff",
   "message": "Was in a nightclub in Nottingham absolutely hammered and thought it’ll be fun to throw those disgusting piss covered urinal cakes at my friends…amazingly they did not see the funny side.",
   "created_utc": 1700335119,
   "score": 72,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sznq0",
   "message": "I shat in my friends brand new car…after taking my pants off and before declaring it a christening of his hot new wheels. Miraculously we are still friends (after a couple years of not being friends so that I could “self reflect”)",
   "created_utc": 1700339175,
   "score": 64,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sq8ki",
   "message": "i got blackout on a ”midsummer” party in sweden 2 years ago and i walked (stumbled) away from the party into the neighbours garden and fell asleep in their bushes. apparently said neighbour tried for 20 mins to get me to leave until my friends showed up  and they told me we had to leave. only sentences i said were ”yeah chill just let me rest a bit we’ll leave soon” over and over again😭😭",
   "created_utc": 1700335047,
   "score": 36,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t2mwa",
   "message": "Bought everything in my Amazon “saved for later” list.",
   "created_utc": 1700340473,
   "score": 30,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9svwhv",
   "message": "Started a fight with a postbox. Slept on the wall outside the pub. Pissed all over my mums car. Decorated my mates bathroom with vomit. Taken a 4ft fir tree home with me. I could go on… but there will be far worse answers!!!",
   "created_utc": 1700337523,
   "score": 26,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9swvq2",
   "message": "I bought a huge ziplock bag of weed. I guess then I was walking around town showing to every cop that drove by.  I'm surprised I didn't get arrested. I don't remember doing it. I woke up with a big bag of weed in my pants. Wouldn't fit in my pockets and my friends told me the story.  That was the last day I drank to get drunk",
   "created_utc": 1700337954,
   "score": 26,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sbup0",
   "message": "Started dating. It’s been 2.5 years I’m still here",
   "created_utc": 1700328817,
   "score": 76,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t5o3o",
   "message": "New Years eve 1998. A few friends and I rented a suite in a hotel and had a bunch of people up for drinks. I ended up getting so drunk I blacked out.  The next morning, I woke up in a different hotel room (same hotel) alone, tucked in bed, wearing only my t-shirt and underwear, with my pants folded neatly on a chair. My belt and shoes were on the counter near the sink along with a $50 bill.  I sat there for a few minutes in horror, trying to remember what happened but I had no recollection. Lots of horrible thoughts and fears were racing through my head while I tried to remember. I didn't know if I should call the police or hide the evidence and leave or go take a 'crying game' shower because I had no idea what was going on. Eventually I made it back to our room and asked my friends and they all knew I had left, but no one had any idea when or why. At some point I just had to accept that whatever happened was over and irreversible, and if it ever caught up with me I would deal with it then, so I took the $50 to the Denny's that shared parking with the hotel for a big plate of salty hashbrowns with two glasses of water for my hangover then went surfing for the rest of the day.",
   "created_utc": 1700341827,
   "score": 22,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tfvoa",
   "message": "I bought a ukulele on Amazon. I don’t know why I did this, but I remember thinking “oh, I can take it on vacation.” I even attempted to learn to play it but I just struggled too much. I gave it to my daughter. She thinks it’s a guitar. Whatever, it’s fine.",
   "created_utc": 1700346433,
   "score": 25,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9srxl7",
   "message": "OK so east coast Canada late March party, high school party about 50 ppl. still bits of snow here and there. We'll I stumble outside to take a piss cause bathroom is full and I see  a snowbank its dark out side its late so I walk over and start relieving my self and the damn snow bank whimpered and run off across the yard. Party host had a white Shepard that was hanging out  outside.   Whoopsie my bad",
   "created_utc": 1700335791,
   "score": 42,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9suwae",
   "message": "I am told that when I’m drunk I become an asshole, but when pressed on the things I’ve said while drunk, they’re not that different from things I’ve said or thought while sober, I’m just more open about offering my thoughts, and politically I’m on the opposite side of the aisle of most of my friends. \n\nSince I stopped drinking I’ve come to the conclusion that just because I wholeheartedly believe something, it’s not generally worth throwing a wrecking ball into my friendships for, and when it is, it’s more effective to just avoid that person for a while than to start an argument. \n\nNow, the most *embarrassing* thing I did while drunk was ruin a friend’s birthday party by completely blacking out, then trying to bribe the bouncer at a club by claiming I that I was a British aristocrat who survived the sinking of the Titanic. I vaguely remember crying in an alleyway about how unfair it was that Titanic survivors are treated so poorly, but that’s my only memory of that night.",
   "created_utc": 1700337088,
   "score": 40,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sgrlz",
   "message": "Drove. Thankfully nothing ever happened. \n\nNext to that, while being a passenger, I threw up everywhere in their car and was too drunk to help clean up.",
   "created_utc": 1700330906,
   "score": 74,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t4cj1",
   "message": "I once went to a party in Krakow, Poland, and woke up on a train to Hungary.\n\nBased on the state of my belongings and the documents i had on me. I had gotten on a train to Belarus, had been denied entry in Belarus and they put me on a train to Hungary because i had a Hungarian passport.\n\nLuckily i had time to sober up and get off the train while i was still in Poland. My business partner was not amused i missed several meetings.\n\n\nOne other time i went to a pub in Czechia with a few friends and i woke up in a WW2 tank that was on display. Once the cop who caught me figured out I was just a hungover moron and wasnt going to go full Killdozer on his city, he was pretty nice about it, and gave me a ride back to my hotel. Other than a stern talking to, he let me off.",
   "created_utc": 1700341226,
   "score": 15,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sdok1",
   "message": "Drove to an exs house, slept with her.",
   "created_utc": 1700329586,
   "score": 31,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9se41h",
   "message": "I threw up on a friend and kept the rest of my friends up all night because they were worried about me. I felt so guilty about it when I sobered up. Apparently though, I spent most of the night when I wasn’t sick, apologizing to them.",
   "created_utc": 1700329765,
   "score": 38,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sj51i",
   "message": "Not drunk but just out of it on some allergy medicine.  I shared quite of bit of cheese with my dog and I really paid a price for that.",
   "created_utc": 1700331937,
   "score": 46,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9u79m3",
   "message": "Shit my pants and almost froze to death passed out in a bush. Had to walk home with shit frozen to my leg. That was the last time I ever drank.",
   "created_utc": 1700359212,
   "score": 15,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sr1j7",
   "message": "For context, I like to put on music and relax in a hot bath when I’m not feeling 100%. On two separate occasions, I have blacked out drinking and woke up in an overflowing bathtub, in a flooded bathroom, with a landlord pounding at the door and the water still running. Both times, I had apparently began the process of flooding my downstairs neighbor as well and both events happened after 3AM, so a real pain in the ass for everyone involved. Luckily, it was two different apartment buildings, so not the same neighbor or landlord, so I guess that’s a plus? Being depressed and alone with a healthily-stocked liquor cabinet is a dangerous combination. I’m sober now though!",
   "created_utc": 1700335401,
   "score": 59,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sqyge",
   "message": "No goddamn clue.",
   "created_utc": 1700335362,
   "score": 44,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tbyah",
   "message": "I was roused by the police in an alley. I'm assuming that I was stumbling home, had to pee, and tried to go behind a dumpster. I pissed all over myself when I didn't get the zipper down. I received a $50 public drunkenness ticket. Oh, and I was a HALF a block away from my apartment. I have been sober for a while now, and I definitely don't miss that.",
   "created_utc": 1700344625,
   "score": 15,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tfa4v",
   "message": "I knew someone whose work colleague announced at a Christmas party it was his dream to be naked at work. \n\nThe next morning him and two other guys were found passed out on the boardroom table absolutely naked. \n\nCCTV footage showed them going back to the office, stripping off and running around the building until passing out.",
   "created_utc": 1700346160,
   "score": 16,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t0tc9",
   "message": "I ended up buying drinks for like 20 strangers",
   "created_utc": 1700339679,
   "score": 12,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t6d9z",
   "message": "I have only ever been blackout drunk once and it was the last time I drank.\n\nI was on vacation at Lake of the Ozarks and got hit with multiple personal events that mentally wrecked me; daughter had a miscarriage and mother diagnosed with stage4 were the top two but there was so much more….\n\nIt was really hot that summer and I proceeded to drink myself into oblivion; at some point I started playing on a childrens playground gym and apparently was very protective of being on the gym and not allowing real kids on it so the cops were called, I ran, stole a boat and then subsequently crashed that boat. Woke up in a holding cell with absolutely no knowledge of what I had done, it took several hours before it was confirmed that I had not hurt or killed anyone.\n\nNever drank again.",
   "created_utc": 1700342141,
   "score": 14,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tc6lq",
   "message": "\nWhen I was 19 I went to my girlfriend’s mom’s wedding, we all started doing tequila shots near the end of the reception, and it turned into a shitshow.\n\nMy girlfriend and I get back to the hotel suite we are sharing with her siblings, and get into a drunken squabble. \n\nI leave the room, but have no way back in. \n\nI chilled in the stairwell of the floor for a while on my phone being pissed. But not willing to swallow my pride and really having to pee, I relieved myself in the ice machine.\n\nLater on in life I realized that likely the shoot beneath the machine was likely being recycled back into the system to make more ice for future hotel guests. \n\nEeeesh",
   "created_utc": 1700344731,
   "score": 15,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9srx5r",
   "message": "Stolen my bosses wife's underwear from a laundry basket",
   "created_utc": 1700335786,
   "score": 24,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t8trc",
   "message": "I had a roommate/ex best friend that is a massive alcoholic. One time he had his mom come pick him up and give him a ride to \"his friend's house\", aka an orgy he found on Grindr. He showed back up at the house at 6am or so and started screaming along to Tori Amos, waking me up early af when I had to work at 11. I realized that I was not going to get to go back to sleep so I decided to just take a shower and go to work early. I went into the bathroom and it looked like a pipe broke or something- the whole place was destroyed and there was rusty water or something all over everything. I went into his room and asked if he knew what happened, he said no and kept screamsinging. I went back into the bathroom and started putting things back together well enough to be able to take a shower. I stick my finger into some of the rusty water stuff and smell it wondering what the hell it was.\n\n\u0026amp;#x200B;\n\nIt was santorum.\n\n\u0026amp;#x200B;\n\nIt was a poop/cum/lube mixture. It all instantly made sense. He came home, got in the shower, and used the detachable head to give himself an enema and blow all of the poopy cum out of his asshole and all over the bathroom. Walls, ceiling, my toothbrush, everything. It was insane.\n\n\u0026amp;#x200B;\n\nI went back into his room and told him I have to go to work and he has a half hour to clean it up. He told me to go fuck myself.\n\n\u0026amp;#x200B;\n\nI waited a half hour, went and checked, he had done nothing. I went back into his room and he instantly started mocking me and telling me I deserve it and that he should have done it in my room etc and he swung on me. I'm 6'2 220. He's not. I knocked him out and then called his mom, who was very aware that he was a hyper abusive alcoholic. She started crying and apologized to me for having to punch him, and she came and got him.\n\n\u0026amp;#x200B;\n\nI ended up using the contents of his closet and dresser to clean the bathroom. Bagged it all, put it on the curb, and told him if he wanted his clothes they were all out there covered in his own cumpoop.\n\n\u0026amp;#x200B;\n\nThere's a \\*lot\\* more to this story and how awful this guy is, but this story in particular is my personal all time highlight of him because it was targeted at me. It's only maybe the 20th worst thing I've ever seen him do though overall.",
   "created_utc": 1700343231,
   "score": 28,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tbn7x",
   "message": "When I was a delinquent teenager at a house party, whilst hammered, I stole money from a leather handbag and proceeded to fill it with my piss.",
   "created_utc": 1700344484,
   "score": 10,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tbqz0",
   "message": "Alcohol never got me into trouble. I mostly drank alone though.\n\nNow meth, that's a whole different animal",
   "created_utc": 1700344531,
   "score": 18,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sq0xs",
   "message": "Fell asleep in the middle of the road",
   "created_utc": 1700334954,
   "score": 8,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9srqq7",
   "message": "Puke and rallied at a grad party. Went right back to eating food shortly after",
   "created_utc": 1700335709,
   "score": 11,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sybpq",
   "message": "Ooof, well I got really drunk on a cruise and I woke up in my boxers to take a piss but I walked out of my cabin instead. Made it down the hall and in my drunken stupor realized I was in my boxers and I didn't have my room key and I didn't make it to a bathroom and instead pissed myself in front of the cabin door. The look of disgust when the poor staff member let me into my room was unforgettable. Then I was reminded of my accident when I stepped in a wet spot on the carpet the next morning when I left my room.",
   "created_utc": 1700338591,
   "score": 10,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t1tik",
   "message": "Not me but almost 14K people a year die people in drunk driving related accidents so I think that's probably the winner.",
   "created_utc": 1700340116,
   "score": 8,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9skwaz",
   "message": "Several hit and runs (on property not people thankfully)\n\nAttempted suicide twice\n\nGot alcohol poisoning/took drugs on top of alcohol and nearly died waking up In hospital x3\n\nGot someone pregnant (thankfully she miscarried but still)\n\nGot into a fist fight with best friend and won\n\nDestroyed the inside of the bathroom at a 24 hour diner then did a dine n dash\n\nBlew up a random person’s car (wasnt alone on this one)\n\nTore apart a construction site (also with friends)\n\nCaused thousands of dollars of property damages on a golf course at a five star hotel, then stole the head of a statue \n\nProstituted myself for booze and drugs\n\nTheres probably more but thats the gist of it. Thankfully been sober coming up on seven years soon so I haven’t engaged in anything like this in a long time.",
   "created_utc": 1700332708,
   "score": 86,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sqyl2",
   "message": "Wrecked my bicycle so bad that I broke my jaw and lost teeth",
   "created_utc": 1700335364,
   "score": 9,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9ss7lj",
   "message": "The second or 3rd time I got drunk I threw up out my bedroom window and my vomit stained the side of the house. My dad saw and didn’t say anything. Tbh I would be mad if my child was drunk. I was a sophomore in highschool that’s how u know alcohol is so normalized he didn’t even care at all I got drunk as a sophomore that can be a slippery slope for someone that young thankfully it wasn’t for me",
   "created_utc": 1700335911,
   "score": 10,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9stowb",
   "message": "Keep messaging my toxic ex!",
   "created_utc": 1700336559,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9svqcx",
   "message": "Besides driving, I once woke up with a bloody pillow. I went to urgent care. I had a laceration on my head. Got staples to heal it. I have zero memory of how it happened.",
   "created_utc": 1700337447,
   "score": 7,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tbbwo",
   "message": "Let’s just say I’m a mean drunk or a fun drunk. Kinda why I’ve quit",
   "created_utc": 1700344343,
   "score": 10,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sbxfo",
   "message": "Nice try, Mr. police man.",
   "created_utc": 1700328849,
   "score": 45,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sive9",
   "message": "Sat on the edge of a parking deck archway 8 stories high that I climbed in beat up cowboy boots at 4 in the morning.\n\nI didn't fall...",
   "created_utc": 1700331821,
   "score": 16,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sv598",
   "message": "Decide to OD myself with the whole bottle of vodka in an hour, and i weight 47kg",
   "created_utc": 1700337193,
   "score": 15,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sb6aq",
   "message": "I dont remember",
   "created_utc": 1700328534,
   "score": 23,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sx53z",
   "message": "After a drunken Taco Bell run puked on the bathroom floor of my friend’s house. And very thoughtfully covered it up with a throw rug.",
   "created_utc": 1700338067,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9ta8pn",
   "message": "Got wasted at a bar at 21, puked in my friend's back seat, passed out in a bush later on, and woke up in the hospital. \n\nThe cops were going to arrest me for being drunk in public but I was too drunk so they called an ambulance for me instead. \n\nI beat the system? Idk. \n\nGood thing I had cool friends and the cops cared about my health over arresting me. \n\nWhen I woke up in the hospital I had zero memory of it all and just put on the clothes that hadn't been cut off of me and called a cab (before Uber). I didn't even check with anyone at the hospital, I just took out the IV and got out of there. Got a huge bill for an ambulance ride later on though. My insurance later covered it. \n\nAll in all, I got out pretty clear. Woke up in the hospital feeling just fine, rested in fact. My friends were not even mad, not even the one whose back seat I puked all over. \n\nI take better care of myself these days.",
   "created_utc": 1700343862,
   "score": 7,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9u06nw",
   "message": "When I was a teenager, I went to see Autograph at the boys club. Yeah, that was in the 80s. Lol. I went out drinking with this dude who was older and could drive, he had schnapps. I wasn't a seasoned drinker at the time. I met my 2 friends at the show, and I was shitfaced. The female friends decided to get me out of there. I ended up peeing off a bridge on a busy road right in front of them. And somehow ended up asleep on a boxcar. Still notnsure how to this day. A train worker found me, called the cops, and my dad ended up coming to get me. I don't remember anything but the schnapps. \n\nI am still friends with the 2 girls to this day, but not the guy with the schnapps. That would be criminal these days. Maybe even then. As punishment, my dad made me go to the landfill with him the next day and his buddy put me to work. I vomited more than I ever have. Lol. Good times.",
   "created_utc": 1700355851,
   "score": 8,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9ucj4m",
   "message": "Ran butt nekkid though my college campus. Luckily this was before camera phones.",
   "created_utc": 1700361809,
   "score": 7,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9st3ph",
   "message": "I’m not proud of this, used to be a really shitty person who’s excuse was always, “I’m young, this is my time to have fun!” But got lost at my ex gf’s best friend’s party trying to find the bathroom to piss, accidentally found her bedroom where she was changing and apologized immediately, she whisper screamed, “just get in here and shut the fucking door!” She was in a bra and leggings, but I turned and faced the door anyway, after a few seconds she said, “dude your fine just turn around, and all she had on was her thong. Yes I hooked up with her while my ex was 40 feet away partying with the others. We didn’t date long after that, my guilt consumed me, we broke up, I told her the truth, she called me a scum bag and every other name in the book which I deserved. Yet somehow to this day, her and that girl are still best friends.",
   "created_utc": 1700336303,
   "score": 41,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9syrhc",
   "message": "Just yesterday I was drinking. Started at noon. Around 8 pm I went for a walk downtown, forgot where I was, snuck into this concert where some Mexican musicians were playing at, spent every cent I had.\n\nMind you, cars in the shop, 4300 fix. Life be rough.",
   "created_utc": 1700338787,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t1e6e",
   "message": "A lot. Ruined multiple friendships, was crying on the toilet blacked out drunk about my friend moving away (at his going away party, I don’t remember any of it, but I do remember what countless others told me), tried to bring a guy home to my dads after a breakup and the dude was so wasted along with myself, we fell onto a badass bench that my brother in laws grandpa made for their baby as soon as we walked in the door with everyone watching us, cheated on people who deserved the world, attacked someone with an antler on a few occasions, almost ODed due to mixing too much substances with alcohol, have thrown tantrums in public (thank god I live in a small town with extremely empathetic people who stopped to help when they should’ve just ignored me)\n\nMoral of the story, alcohol is not good for you by any means and I hope anyone struggling is able to find happiness",
   "created_utc": 1700339927,
   "score": 5,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t1fp0",
   "message": "This just happened last night, we had went to the plug’s house and I was in the back seat asleep. I only had $10 and most plugs I know won’t sell you anything for $10. My friend told me I woke up and said” as much as I come over here and spend my money he’s gonna take these $10 fucking dollars!” I’m slightly embarrassed but I did get my weed 😂",
   "created_utc": 1700339946,
   "score": 7,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t22j8",
   "message": "I fell asleep hanging halfway out the window(bottom floor) of a house after puking my guts out, and dry-heaving for a long while. Woke up with frozen vomit, and frost all over my face and facial hair.",
   "created_utc": 1700340223,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t2fao",
   "message": "Drank a party ball of Coors light. Proceeded to bar where I partook in several shots of Cuervo Gold and other assorted shot worthy types of alcohol. Puked in the back alley behind the bar. I was in the military and the guys felt someone should sit with me that evening to make sure I didn't die. One of my buddies took me home and sat there to watch me all passed out. At some point I decided I needed a bath. So, I hopped into the bathtub fully clothed, soaking away in the warmth of the enveloping bathwater. I was so comfortable  and I was so drunk, I ended up shitting myself right there in the middle of my lovely bath. Now, I'm floating in brown water and realize what has happened and start puking all over again. Somehow managed to get cleaned up and off to a clean bed to sleep things off.\n\n\u0026amp;#x200B;\n\nAh, Cavalry life!",
   "created_utc": 1700340379,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t2fwv",
   "message": "Well I wasn't the one who did this but I witnessed this.\n\nWe got really drunk once with my best friends. We were staying at home and playing Wii. Well most Wii games are up to 4 players but there were 5 of us. So the one that was the most drunk wasn't playing at the time so he grabbed a TV remote and started playing Wii sports tennis with it. \n\nHe got really angry that he lost, so he got up and literally started peeing into the home owner's sink. Well he tried to stop him and then started to pee all around the kitchen. \n\nFinally after finishing up he slam dunked onto the floor and fainted.\n\nVery funny when that memory comes back to me.",
   "created_utc": 1700340387,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9t80w2",
   "message": "So there I was, three sheets to the wind after an impromptu college reunion at a local bar. As the night stumbled on, my friends and I decided that we needed a grand adventure. Enter Steve, the self-proclaimed 'Duck Whisperer', who had this brilliant (read: utterly ridiculous) idea to 'liberate' the ducks from our town's public park.We tiptoed into the park, giggling like school kids, armed with nothing but a bag of stale bread and overconfident inebriation. Our mission: to lead the ducks to freedom (or at least to Steve's bathtub, which he argued was 'practically the same thing').As I clumsily tried to coax a particularly plump duck with my bread trail, things took a turn. The ducks, perhaps sensing our tipsy incompetence, revolted. They began quacking in unison, as if calling the spirits of all ducks past and present. Then, they charged.What ensued can only be described as a feathery blur of chaos. We were outflanked at every turn by these surprisingly strategic waterfowl. In the midst of the fray, I remember looking over to see Steve, the Duck Whisperer, being chased by what I can only assume was the duck general, a large, menacing bird with a look of determination in its beady eyes.Eventually, we retreated, defeated and duck-less. As we fled, I heard one of my friends yell, \"Retreat! The ducks have won this battle!\" We returned to Steve's place, nursing our pride with more drinks and laughter, recounting our valiant yet failed effort in what we now refer to as 'The Great Duck Heist.'To this day, every time we pass that park and hear the ducks quack, we can't help but wonder if they're laughing at us, the foolish humans who thought they could outwit the guardians of the pond.",
   "created_utc": 1700342871,
   "score": 7,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9tciq3",
   "message": "Woke up in a ditch with an actual pig. It was Sunday morning and a well dressed couple walked by and said \"You really should be careful of the company you keep\"\n  The Pig got up and sheepishly walked away",
   "created_utc": 1700344888,
   "score": 5,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9td7e0",
   "message": "(all with friends) Put a couch on train tracks to watch it explode, then threw an old box tv out of a second story window, covered ourselves and a friend's bathroom in highlighter (because we had a blacklight), then while driving home there was a cop behind me, I panicked, tried to concentrate on the road, heart racing, the cop's siren turned on and as I was starting to pull over, the cop went around me to get the guy driving in front of me. I was so drunk, I didn't realize how drunk the guy was in front of me and he crashed into a tree in someone's front yard. When I got home, I ran inside as fast as I could. Never again.",
   "created_utc": 1700345204,
   "score": 6,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9u4mgf",
   "message": "This probably isn't the worst or even the dumbest thing I've done while drunk.  I lived in a small town probably 1 mile square radius. \n\nI was drinking at friends house and decided it was time to leave ( I was apparently to drunk to continue) on my way out of his apartment I noticed their neighbors had a razer scooter calling my name. Dreading this 10 min walk home I decided it would be much faster to scooter home. I proceeded to take the scooter, but still had a drink from the party I was not ready to part with. I decided it would be best to ride the scooter home one handed so I didn't have to waste my drink. \n\nI'm not sure if you've riden a razer scooter but they have tiny wheels and will front flip over a tiny pebble. \n\nI proceeded to ride the scooter one handed (drink in other) the 8 blocks home. I vaguely remember this adventure.  However, after waking up the next morning I started to piece the night back together. To my best recollection it took me roughly over an hour to scooter home from my 10 min walk.  I woke up with 1 shoe, rode rash on my face, my knees, elbows and a broken wrist. \n\nI did however some how manage to save my drink. When I woke up my cup was on the counter with probably a mouthful of liquor remaining.",
   "created_utc": 1700357940,
   "score": 5,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sme78",
   "message": "When I was younger I used to drink so much I would just wake up driving, or wonder how am I in front of my house in my car with no recollection of how I got there.",
   "created_utc": 1700333363,
   "score": 10,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9sfnui",
   "message": "Threw my cat in a kiddie pool 😢 he popped my pool (serves me right) and forgave me but I felt so bad. From what I’ve been told I said he ‘wanted to go swimming like a purrmaid’",
   "created_utc": 1700330428,
   "score": 19,
   "submission_id": "17yaner"
  },
  {
   "comment_id": "k9vaymk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17yaner"
  }
 ]
}