{
 "submission_id": "17ycnkk",
 "title": "Men of Reddit who have gotten a vasectomy, what was your experience?",
 "selftext": "",
 "created_utc": 1700332114,
 "permalink": "/r/AskReddit/comments/17ycnkk/men_of_reddit_who_have_gotten_a_vasectomy_what/",
 "score": 67,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ycnkk/men_of_reddit_who_have_gotten_a_vasectomy_what/",
 "comments": [
  {
   "comment_id": "k9t7q99",
   "message": "For the love of God, do the follow-up appointment. The last thing you want is to be accidentally playing with a loaded gun",
   "created_utc": 1700342740,
   "score": 177,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9swl75",
   "message": "I was super anxious, but I had a great procedure. I was more freaked out about the shot of numbing agent to the balls, but it was legit nothing to worry about. \n\n20 minutes and two weeks of not jerking it, then two weeks of jerking it A LOT (to clear the tubes) and I got the all clear. I honestly couldn’t recommend it enough. SO much easier than my girl being on hormonal BC or getting her tubes tied.",
   "created_utc": 1700337827,
   "score": 49,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9sjx9b",
   "message": "Little operation, blue balls and no wanking for a week, then back to normal but without getting anyone pregnant",
   "created_utc": 1700332282,
   "score": 217,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t2xd4",
   "message": "Had it done twice while living in Japan no less. Why twice? The first one failed.\n\n... apparently, so did the second (says my now 6 year old daughter).",
   "created_utc": 1700340600,
   "score": 28,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9stmxx",
   "message": "It only change the color of my friends child",
   "created_utc": 1700336535,
   "score": 128,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9smym0",
   "message": "Local anesthesia stings for a second or two then all you can feel is tugging after all is done the pain I would describe is like blue balls for like 2 days tops. I took a week off work recommend by doctor since I’m a construction worker and the heavy lifting but I felt like after day 3 I was good to go. Cons: minor pain discomfort, no hanky panky until last semen sample came out clear. Pros: unlimited cream pies, no unplanned pregnancies(it’s still possible very rarely). \nI’ve noticed though that after I got it I don’t get blue balls anymore no matter how long the edging is it’s like a cherry on top.",
   "created_utc": 1700333607,
   "score": 191,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9soqop",
   "message": "I learned that I love frozen peas.",
   "created_utc": 1700334391,
   "score": 79,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tbebl",
   "message": "Not to give you fear, but mine was awful. Lidocaine hadn’t kicked in fully when they started and the pain from the cutting of the vas  caused me to nearly pass out. Year of pain afterwards and to this day I will still get pain during intercourse. Still, I don’t regret getting it. The peace of mind is worth it. My wife did so much to bring us children that I will gladly do my part.",
   "created_utc": 1700344373,
   "score": 71,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t9rlg",
   "message": "I’m seeing a lot of frozen peas. \n\nYou know, you could use frozen corn, Lima beans, the assorted veggie mix, I mean, the sky is the limit.",
   "created_utc": 1700343651,
   "score": 44,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9uijvr",
   "message": "When your wife suggests a vasectomy, the wrong answer is “but what if my next wife wants kids?”",
   "created_utc": 1700364804,
   "score": 39,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9sztd9",
   "message": "No big deal. The worst part for me personally was the shot they gave me to numb the area before hand, that burned like hell. Actual procedure was easy. Spent the weekend on the couch with a bag of frozen peas and then got on with my life.",
   "created_utc": 1700339243,
   "score": 80,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9skseh",
   "message": "To me, the only bad part was the smell of the cauterization of my vas deferens.. the procedure was fine. Local anesthesia before and during just felt slight tugging no pain. Recovery was easy. No pain. No cons. Only pros. And if absolutely need be it’s reversible. Much easier and less invasive than a woman getting her tubes tied and significantly less harmful than birth control. I’m an advocate. Get it done!",
   "created_utc": 1700332660,
   "score": 105,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tgxui",
   "message": "I told my wife I was gonna get a vasectomy. She bet me I wouldn’t because I didn’t have the balls.",
   "created_utc": 1700346910,
   "score": 38,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9ucflq",
   "message": "Oh boy, here we go. I had my vasectomy 2 weeks ago. First operation went as expected.  Local anesthesia and the smell of burnt flesh. 2 hours later my sack was the size of a grapefruit. And I kept passing out every time I stood up. \nI went back to the same office, and they did an ultrasound on my testicles to make sure sure the hemorrhage and clots didn’t stop the blood flow\n\nThey sent me home and said if it gets worse, go the the ER. A couple hours later, my sack was so full of blood I couldn’t sit to pee or stand to pee because my penis looked up to the ceiling and I couldn’t bend it down to make the toilet. So I had to pee in the shower\n\nMy wife gets home from work and asks to see it. She freaked out and and took me to the ER. By this time my sack was larger than a cantaloupe. I had to carry it into the ER. The front desk lady let me in right away and gave me a bed within a minute of getting there. \n\nI ended up having emergency surgery. They cleaned out lots of blood clots and pockets of blood. And had an 8” incision with stiches and a drain tube with a bulb. \n\nMy sack was 100% full of blood and my stomach up to my belly button was swollen with blood\n\nIt’s still black and blue but almost back to the original size",
   "created_utc": 1700361761,
   "score": 30,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t0jmy",
   "message": "The procedure was mostly easy besides the feeling that something was being tugged out of my torso, felt that in my entire body. I waited a week before doing anything strenuous. Eventually went for an easy walk and woke up the next morning with a mass that felt like a painful third testicle.\n\nOf course I was freaked out a bit. Called the urologist and went in for an ultrasound. The UC tech 'couldn't find' the mass and referred me back to the urologist. They opened me up again, determined it was inflammation and sent me home with instructions on tending the new hole in the boys. Packed the hole with gauze for almost 2 months before the inflammation went down.",
   "created_utc": 1700339562,
   "score": 22,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t15pe",
   "message": "The physical experience was fine. I didn’t take it easy enough afterwards so I swelled up pretty badly. But about 2 weeks later I was good to go. \n\nThe worst was the emotional experience. I was sexually assaulted as a boy and dealt with lots of trauma. I didn’t even think about it, but as soon as the urologist touched me, I had a horrific response. That was one of the worst experiences of my life. Felt like I was assaulted all over again. I wish during the appointments leading up to it they would warn this kind of response could happen. It’s no one’s fault, but it was terrible for me. Took me a few days to recover psychologically.",
   "created_utc": 1700339823,
   "score": 145,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9sup8u",
   "message": "Spent a year dealing with lingering pain and discomfort but it settled after that. Also, I don’t ejaculate as much as I did. Other than it is what it is. I’d still do it again.",
   "created_utc": 1700337005,
   "score": 70,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t7ulm",
   "message": "Recovery wasn't bad.\n\nGetting to sleep with psycho chicks trying to get pregnant is totally worth it.",
   "created_utc": 1700342795,
   "score": 101,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9sw9m4",
   "message": "Hurt every day for four years until I got a reversal, which cost me about $10,000 out of pocket. Now it only hurts some days. Also really reduced my enjoyment of ejaculation. Ejaculating sometimes literally felt like nothing was happening down there except muscles clenching. Sensation came back about 50% after reversal. 1/10 would not recommend. /r/postvasectomypain",
   "created_utc": 1700337683,
   "score": 182,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tfd22",
   "message": "Got a vasectomy, it worked.\nGot it reversed, that worked.... twice\nGot another vasectomy...17 years later, all good.\nJust go to a legit great Dr. I mean top of the field Dr. For ANY messsin around down there. Vasectomy is WAY easier now than 25-30 years ago. In/out in an hour... The only thing that hasn't changed? ...  The bag of frozen peas ..😂",
   "created_utc": 1700346197,
   "score": 32,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9swyot",
   "message": "10/10 would do it again. Had it on an afternoon, was playing table tennis by the evening. No pain.",
   "created_utc": 1700337989,
   "score": 78,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t4470",
   "message": "Just remember that you may not be in pain when you get home, but that doesn’t mean you can’t pick your kid up as she runs to welcome you home… yeah that was my mistake. After that bags and bags of peas!",
   "created_utc": 1700341124,
   "score": 15,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9swcss",
   "message": "Starting with the Op itself, the first thing they do is inject the anesthetic. To me, the initial jab was fine, but the stuff pushing in did feel like someone was squeezing my balls for a good few seconds before it kicked in. The cutting was completely painless after that. Yeah, you feel a bit of a tug and can hear the snips being made, but the doctor was nice and chatty so you don't focus on it. The smell as they cauterise is interesting to say the least, then they put on some burny stuff right at the end to seal you up. That feels like a tingle that gets steadily hotter and hotter. Didn't hurt as much as the starting ball squeeze though (forgot they do this again when moving onto the next ball).\n\nPost op I was uncomfortable and the balls did feel bruised. Had to dodge my children who often run around at ball height. I would say I felt comfortable enough to have a tug at around 2 weeks. After 3-4 weeks, all back to normal. No change to how it looked before except for occasional bit of blood mixed in.\n\nNext step is to tug and have sex as much as possible. You have 4 months to wait for your first test, and you want to aim for about 80 releases or so to clear your tubes as it were. That is a long 4 months by the way, and waiting on my first test. Still then have to do another test a month later to get the all clear.\n\nOverall, defo the right choice for me and the wife. Just waiting for the benefits now 😁",
   "created_utc": 1700337723,
   "score": 21,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9sxr54",
   "message": "45 minutes in and out,  don't feel anything in your balls during,  but I got the hit in the balls feeling in my stomach a few times.  The Dr who did it was hilarious and we joked the whole time.   Afterwords was sore but nothing bad.  They say wait 7 days before sex.  We waited 24 hours to have sex (gently) and nothing bad happened.  A week of slight soreness and trying not to lift anything heavy or standing up to fast and I was back to normal.   12/10 would get snipped again.  Make sure you go back to get your jizz checked when they tell you to. We bought a microscope off Amazon to check ourselves just for fun.  Overall a great time,  lots of laughs.\n\nEdit: fixing autocorrect spelling",
   "created_utc": 1700338342,
   "score": 37,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tljjh",
   "message": "I think mine only took about ~3-4 songs in terms of length of how long it took the doctor. He surprised himself by how quick it was.\n\n\nI also accidentally scared the shit out of him and the nurse. The cauterization sound was LOUD and I flinched and yelled. I was super embarrassed since the both looked concerned, but then I revealed I didn't feel it but the sound caught me off guard.\n\n\nMy advice is to stock up on Imodium. I had to poop ~6 times in my first ~3 hours after I got home. I definitely had that feeling of where they pull on your tubes for hours after and it upset my belly super badly until the Imodium kicked in. \n\n\nAlso, I realized that the cramping feeling I was experiencing was very likely what women felt with menstrual cycles. My discomfort only lasted about the rest of the night, but they deal with that all the time.\n\n\nAs the others have said, not using your new toy for a week afterwards is not a good time, and my co-workers were giving me shit for it. But then they followed up with questions about it since they were younger than me. \n\n\nMine was done just over a year ago last week, and I would definitely make the same decision again.",
   "created_utc": 1700349002,
   "score": 12,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t98ax",
   "message": "I tend to play too much. \n\n\nNurse: here sign this paperwork saying you won’t sue and that you’re here for a vasectomy. \nMe: A vasectomy?\nNurse: WHAT?!?!?!?\nMe: Just kidding, that’s correct. \n\n30 minutes later when they removed that part of the tube:\n\nNurse: Do you want to see it?  \nShe proceeded to hold it up to my face before I could respond. She got me back pretty good.",
   "created_utc": 1700343409,
   "score": 6,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t8crd",
   "message": "First time I jerked off after the procedure, I came blood.  I quickly developed a UTI. Probably the sickest I have ever been in my life. Went back to the urologist and he said it was just a coincidence. Sure Doc, whatever. Gave me antibiotics and everything was fine after I got the infection cleared up.",
   "created_utc": 1700343020,
   "score": 11,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tcnee",
   "message": "Asked my doctor, she immediately said \"yeah I'll refer you\", I got a call a few days later to schedule an appointment, and  about an hour after I got there I walked out and drove home.  \n  \nFor specifics, the first half of the procedure was easy and mostly painless BUT... about halfway through I noticed the anesthesia start to wear off. It started as a sort of dull ache, then when the throbbing started I decided to say something and the doc gave me another shot. ...which only lasted a couple minutes and before long I was four shots deep and my lower body was starting to shake and sweat profusely. I wouldn't say it was *painful* per SE but it was intensely uncomfortable. Thankfully he finished up before things got worse; when I stood up the sheet under me was absolutely **soaked** so that was embarrassing.  \n  \nAfterwards it took about a month for the stitches to dissolve and the pain (which again I would just describe as \"intensely uncomfortable\") to go away. A bit longer than they said it would take but no complications to speak of. Plus it barely cost anything with my insurance, I think I only paid like $90. I'd highly recommend.  \n  \nFun aside: my so and I definitely took note that not one person asked me if I was sure I wanted the procedure. Not even so much as a question about my current familial situation, and I'm under 40. Meanwhile my wife was told she would literally have two options, be paralyzed or die, if she tried to have a baby, and they *still* wouldn't let her get it done. *In the same conversation*.",
   "created_utc": 1700344947,
   "score": 6,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tp0k1",
   "message": "Anyone had one done 5-10+ yrs ago? Still doing good? Was all for it until I read about the increased risk of prostate cancer…\n[Vasectomy and Prostate Cancer Risk: A 38-Year Nationwide Cohort Study](https://pubmed.ncbi.nlm.nih.gov/31119294/)",
   "created_utc": 1700350604,
   "score": 5,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t2yke",
   "message": "MOST IMPORTANT TIP. Wear briefs not boxers to the operation and for the week after, they are way too loose and the swelling will be awful.",
   "created_utc": 1700340614,
   "score": 11,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t2af5",
   "message": "Started having a panic attack while the doc was doing the first side. I felt like I was going to pass out and was hyperventilating. The doc looked at my and said \" you don't look so good do you want to stop\" I thought to myself oh jeez are you serious? No I don't want to stop hurry up and get this done. He ended up getting it all done. \n\nRecovery definitely hurt the first week. I was glad I took time off, it hurt to walk or really do anything. I would say it took about 3 months for the pain in my groin to be completely gone. First couple months it would hurt every time I came and would feel discomfort in my balls. But not that's all gone and I have no residual symptoms. So all in all it was worth it.",
   "created_utc": 1700340320,
   "score": 4,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t3bns",
   "message": "Four minutes total procedure time. After the anesthetic wore off, it felt like I had been kicked in the balls the day before. I had it done the day before Thanksgiving, so the next day I kicked back with a cocktail and a bag of frozen peas and watched the parade. Felt better by the time I was sober. The worst part was applying neosporin every day. Incision full healed super quick, and ever since the only difference I notice is never worrying.",
   "created_utc": 1700340772,
   "score": 4,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t3mg3",
   "message": "a little pain. a lot of numb. Some tugging originating at my ball sac but felt up in my stomach. Ice packs for four days. Balls turned this amazing shade of purplish black for about a week. had to have something like 20 or 30 ejaculations before jizzing in a cup two separate times and awaiting the vasectomy pass/fail diagnosis before going on a raw dog frenzy for the rest of my life.",
   "created_utc": 1700340905,
   "score": 5,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t6imz",
   "message": "Just got one a couple months ago. 30 minute outpatient procedure. Two hits of moderate discomfort, one hit of extreme pain at the very end (almost passed out). Local anesthesia just wasn't quite strong enough.\n\nNothing else of note except that I'm apparently one of 15-40% to develop a \"sperm granuloma\" which is inflammation of the snipped end of the vas deferens as a result of sperm leakage. Need to take anti-inflammatories for an indeterminate period of time and it'll usually go away on its own, but the night I found the lump, I was very concerned (no one mentioned this). Just feels like a little ball on the end of some of the wires in the sack. Otherwise, everything's functioning fine.\n\nOne weird thing I can't find an answer on- as a circumcised man, after the vasectomy, the head of my dick will occasionally get consumed by the hood (when soft obviously), which literally never happened before, but I haven't seen a single person share a similar occurrence, so big shrug on that one. Just a cosmetic thing I noticed; not really important.",
   "created_utc": 1700342206,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t7wce",
   "message": "Had mine last Saturday, so I'm a week in. I've had tenderness pretty much all week but it's definitely subsiding now. Did my first 3 mile run this morning and all was fine.\n\nWith regards to the procedure, I felt her pulling my tubes out and she had to apply more anesthetic, it was as bad as all the men reading this are imagining it was.",
   "created_utc": 1700342816,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tam8p",
   "message": "Only felt a slight sting getting the numbing agent injected.   mentioned to the doc he needed a fan running during the cauterization. Worked on cleaning out the pipes for a few weeks while looking forward to the \"all clear\" from the test shots.  Some lingering pain/discomfort during doggy which happens to some guys but it passed after a few months.\n\nAnd lost my love of frozen peas.",
   "created_utc": 1700344028,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tbgy5",
   "message": "Don’t handle your kids after it. One of them kicked me in the nuts. They swelled up to the size of two baseballs. Don’t let them jump on you, jump into your lap etc. Seriously keep them away! Shitty recovery but still worth it.",
   "created_utc": 1700344406,
   "score": 5,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tcgeg",
   "message": "Interviewed a few urologists. Went with one doing non-scalpel vasectomies (this was 20 years ago). \n\nShowed up. The nurse went to prep me and complimented me on how well I had shaved my balls and she didn’t have to do anything. Doc came in. They put a topical on my sac. Then injected a local. Made a hole. The only disturbing part of the experience was the smell during cauterizing. Imagine burned meat.. but you’re the meat.\n\nAfterwards, they put in a single dissolving stitch; Packed my tighty whiteys with gauze (was instructed to wear these day-of); and sent me home with Tylenol.\n\nRecovery was frozen peas, lounging around, and periodically repacking gauze. Pain level was on par with hitting the cross bar on a bike for about a day.\n\nTwo clean tests before giving up alternate birth control. Two decades later and no surprises.",
   "created_utc": 1700344859,
   "score": 4,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9td127",
   "message": "My dr knicked something and it bleed a lot more than normal on one side. Hematoma swelled to the size of a baseball. Took about 2 week for it to mostly disappear. He said I’ll forever have a marble size nodule.\n\nEdit - still 100% worth it and recommended.",
   "created_utc": 1700345125,
   "score": 5,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tf19n",
   "message": "Trim your finger nails so when the doc sticks that needle in your nuts, it doesn't require anyone to pull you off the ceiling!",
   "created_utc": 1700346049,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9ttpn7",
   "message": "I had mine about 4 years ago, little swelling for about a week and very little pain for two days.\n\nFor me sex feels way more free. No \"accidents\" or surprises. Also - and I wonder if anyone can confirm: My orgasms became way more intensive/better",
   "created_utc": 1700352809,
   "score": 4,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9udf6z",
   "message": "I couldn’t walk for a week. Sex had a strange pain for the next year. The “explosive release” is gone. Sex drive significantly continued to drop over time. Now I could care less.",
   "created_utc": 1700362253,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9uihir",
   "message": "They gave me Valium and Percocet prior to even walking into the room. Then gave me another pain pill following the procedure. Then said go home and ice your balls for a few days. Had to jack off to make sure they didn’t jack up the procedure. \n\nBeen shooting blanks for 8 years. Saved a ton on condoms. Granted it would have only been a single 3 pack but still. Saved money!",
   "created_utc": 1700364771,
   "score": 5,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t1j8m",
   "message": "Piece of cake - the procedure, from numbing to deed, took 30 minutes. Felt sore for a few days, then felt 100%. After the sperm test, I was back to getting it on without worrying about spawning another mini-me. Two is enough for us. Recommend 11/10. Should’ve had it done sooner. Since my partner doesn't bear the burden of birth control, sex feels much more spontaneous and fun.",
   "created_utc": 1700339990,
   "score": 12,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tbvtr",
   "message": "I have had two. First one went normal, my wife at the time had schizophrenia and we did not want to pass along to a child. We got divorced and then wife#2 suggested we try. \n\nI got the reversal and that was pretty rough. I have two awesome kids so went back for a second one. For some reason no amount of anesthesia worked. It fucking hurt. \n\nThe guy finally ran out of whatever he was injecting me with and I told him to just get it over with.",
   "created_utc": 1700344594,
   "score": 7,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9st5nl",
   "message": "No big deal. Procedure was easy enough. I just hung out on the couch a few days with frozen peas. No complications. Now I'm sterile and otherwise everything is the exact same.",
   "created_utc": 1700336326,
   "score": 14,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9sym7o",
   "message": "Sore for a week and a half but felt alright after that.  Don’t lift anything heavy for a bit or it will feel like someone pulling down on your nuts.\nAlso I might add my area is more sensitive than it was before to pain as well.  A few buddies I know agree to the sensitivity.",
   "created_utc": 1700338723,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9t1ktg",
   "message": "Serious: Buy tighty whities..  Friend told me and I didn't want to believe him until the pain.  After tighty whities the pain was bearable.\n\n\u0026amp;#x200B;\n\nDon't over-ice, very bad feeling when they thaw.",
   "created_utc": 1700340009,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tae2l",
   "message": "Worst part about mine was of course that's the one and only time I've had a cute nurse my age in the room. I was 21, she had to shave my balls",
   "created_utc": 1700343928,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tcdhk",
   "message": "Well, let's just get to the nitty gritty....my body doesn't respond to numbing agents normally...I didn't go numb. My mom was the records clerk for the doctor. Once he was done with me, he went out and talked to my wife and Mom. Told them that he felt bad. It was obvious it hurt but it was successful. The bed I was laying on was wet from my sweating during the procedure. Healing and everything was fine. My mom got me one of those cones you put on dogs... She thought it was funny.",
   "created_utc": 1700344820,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tdg6t",
   "message": "Doc: \"Hmm, one of the chords is a bit thick. Should be OK, but we'll put you out in case\"\n\nWake-up nuts size of a basketball.\n\nNurse: They nicked a blood vessel.\n\n1 in 500 chance I'm told\n\n2.5 weeks of can't do much of anything but sit and even that is not a good time.\n3 months of super annoying discomfort and jock strap to try and get rid of the blood clotted up.\n\nStill annoying after affects years later.\n\nOther than that, no big deal.",
   "created_utc": 1700345318,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tgfp3",
   "message": "My doctor bitched about Hilary Clinton while my pants were around my ankles",
   "created_utc": 1700346683,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9tmnp5",
   "message": "A+ no notes. Not even an incision.",
   "created_utc": 1700349513,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9u0joc",
   "message": "I actually wrote a pretty long Twitter thread about it awhile ago to help men thinking about it know what to expect. I’m also a pretty self deprecating person so I wore an “All Juice No Seeds” shirt to the procedure. Suffice to say, it’s a serious, but not without humor thread. The most interesting part was the number of people that jumped in the thread convinced I castrated myself, was somehow no longer a man, etc. I learned there are some that think calling me a “castrated soy cuck” will somehow destroy me. Internet be wild, yo. If you would like to read it you can here: https://x.com/eanmeyer/status/1395784930362335233?s=46\u0026amp;t=adWLVyO5sKm5jL8MODaIpQ",
   "created_utc": 1700356021,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9ueamk",
   "message": "so the local wore off in the middle. doc: hmm weird it shouldn’t. ya think!? \ndrove myself, so every braking moment on the way home was intense pain (literally had to lift myself off the seat to stop. every time.) recovery at home wasn’t too bad actually. pretty tender and took it easy.  \n\ncouldn’t “go” without some serious throbbing pain for about 3 months. still painful for 6 ish months total. doc: some soreness is normal. great. \n\nit worked, so there’s that.",
   "created_utc": 1700362697,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9uefzw",
   "message": "The second snip hurts more",
   "created_utc": 1700362771,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9uemb9",
   "message": "Mine sucked. Two weeks recovery and I have persistent sensitivity, and it’s been about 6 years now. It’s been looked at and I just have permanent damage, swelling and varicocele from the operation.",
   "created_utc": 1700362858,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9ufbb7",
   "message": "My urologist asked if it was ok if a group of potential urologists watched the procedure. I'm not shy, so I said sure. It ended up being 10 or so students all taking notes and drawing my anatomy on a diagram.\n\nThe worst part was my 6 or 8-week check to see if I was sterile. I go to the lab, and they see what I'm there for. They handed me a cup and told me that all the bathrooms were full, and I would have to find a bathroom elsewhere. I asked if I could take it home, and they said no. \"We have to see the specimen within so many minutes.\" So I find some privacy away from the main areas of the hospital and do my business. I brought the cup (now with \"specimen\" in it back to the lab. \n\nShe sees that my Dr ordered a blood panel and asked if I was ready for that too. I said sure and tried to hand her my cup. She said \"just give that to the lady that does your blood work, it all goes to the same place.\"\n\nAfter meeting and greeting the absolute nicest grandma I've ever met, I'm forced to hand her a cup-o-cum as I sit down to get my blood drawn. She sat it next to me, and i had a full conversation about volume, viscosity, color, etc. of different peoples semen. Super awkward 😬",
   "created_utc": 1700363199,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9vb3bg",
   "message": "Many will have different experiences on the procedure but mine was fairly quick and easy.\nPaid 50 bucks on copay. That was it. 20 mins in and out.\n\nRecovering wasn't painful. Like most guy I did worried it will mess up my sex drive or functionality of my penis. \n\nAfter 2 weeks of no sex. It with fine and sex drive is about the same. One less thing to worry about is pregnancy. Unlimited cream pies.",
   "created_utc": 1700383638,
   "score": 3,
   "submission_id": "17ycnkk"
  },
  {
   "comment_id": "k9ua4au",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ycnkk"
  }
 ]
}