{
 "submission_id": "17yn2o9",
 "title": "People who shoplift on the regular: why do you do it?",
 "selftext": "",
 "created_utc": 1700361725,
 "permalink": "/r/AskReddit/comments/17yn2o9/people_who_shoplift_on_the_regular_why_do_you_do/",
 "score": 146,
 "url": "https://www.reddit.com/r/AskReddit/comments/17yn2o9/people_who_shoplift_on_the_regular_why_do_you_do/",
 "comments": [
  {
   "comment_id": "k9unwy6",
   "message": "I’m going to give an actual honest answer as someone who has not done this in many years… it becomes addicting.",
   "created_utc": 1700367610,
   "score": 189,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uviwu",
   "message": "I was greedy and poor impulse control. While shoplifting was terrifying...having the shiny new thing after gave me a dopamine hit. I got caught three or four times and I thank christ I was under 18 each and every time",
   "created_utc": 1700372219,
   "score": 128,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uiqv5",
   "message": "Much to my mom’s embarrassment, I was a serial shoplifter as a baby. At least I had the presense of mind to take off my socks and shoes and leave them scattered around the store in exchange",
   "created_utc": 1700364903,
   "score": 60,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ujci7",
   "message": "I see people shoplift 900 dollars worth of merchandise with no consequences, then I start wondering if I'm the idiot sheep npc for paying...",
   "created_utc": 1700365209,
   "score": 83,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uda9q",
   "message": "Nice try officer",
   "created_utc": 1700362185,
   "score": 39,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9udsch",
   "message": "My easily influenced mind was corrupted by TV. If its good enough for Marie Schrader then it's good enough for me",
   "created_utc": 1700362435,
   "score": 126,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9umacw",
   "message": "As a former loss prevention officer, most of the people I stopped were stealing to resell the items. Many people were clearly drug addicts and many people I stopped had meth and other drugs on them. Not every shoplifter is stealing to buy drugs, but a ton of them are. A lot of other people just stole items they wanted, and some people just have a stealing problem and would take whatever random BS they came across and thought would be easy to steal. If I ever saw someone stealing food id usually look the other way, but that was pretty rare to see someone taking food, it was usually clothes, electronics, makeup or tools.",
   "created_utc": 1700366750,
   "score": 230,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9umeqd",
   "message": "In high school I date this guy who would shoplift and I got influenced to start doing it. After we broke up I kept doing it all throughout college since I was a broke college student who had no self control. I only shoplifted from big retail stores and told myself it was “okay”. Post college I stopped because the possible consequences as an adult and to my career were not worth it.",
   "created_utc": 1700366813,
   "score": 237,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uivzk",
   "message": "I’m not perfect. I only hold myself to a 90% accuracy when performing self checkout.",
   "created_utc": 1700364974,
   "score": 27,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uzr0s",
   "message": "If I go to the store for something that’s 10$+ and is small enough to fit in my pocket, guess where it’s going?\n\nThat’s right, in my ass",
   "created_utc": 1700375078,
   "score": 100,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ufm0p",
   "message": "When I was bedridden due to covid, I had a friend who shoplifted a whole damn box worth of medicine from different drugstores\n\nI was very impressed and confused, as I didn't ask for it. Great friend tho!",
   "created_utc": 1700363347,
   "score": 171,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uemqe",
   "message": "I didn't shoplift anything, the cashier failed to scan it at the check out.",
   "created_utc": 1700362864,
   "score": 144,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uz3b2",
   "message": "I used to do it as a means to support my drug habit. I wouldn't call what I was doing shoplifting though. I moved volume and high end merchandise. Honda generators from home Depot or Lowe's. Shopping carts full of tide pods, Similac baby formula. I'd hit Nordstrom during the holidays for their perfumes and colognes. COACH, Burberry for purses. I made a good chunk of change from it, yet I was still homeless. Most of my money went to drugs, hotel rooms at shitty hotels. I'm no longer like this. I reached out and went to rehab this past July. I now have 132 days clean and sober, and work an honest job. My life's boring as hell now and I love it. \n    Even though people on the street complimented and applauded my skills. I was never proud of myself for any of the stealing I was doing. There was no good in it. Now I feel good about myself and can be proud of what I do. It's a nice feeling to go into a store and not have to be aware of my surroundings and not tighten up when the greeters ask for a receipt. Because now, I can happily show them one. Lol.",
   "created_utc": 1700374631,
   "score": 35,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uqk0c",
   "message": "I add a story. When I was in high school, I worked at small family grocery store... Before there were convenience stores everywhere. I once saw a mother with three children stealing milk. I didn't say a damn thing. In reality even the father who ran the store would have just given it to her... Because that's the kind of person he was. Cool",
   "created_utc": 1700369127,
   "score": 59,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ud340",
   "message": "Have you seen prices these days?",
   "created_utc": 1700362085,
   "score": 90,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uvsrl",
   "message": "I work for a 3-letter retail store in NV and we have a ton of theft. I see a lot of random product for sale on FB marketplace. If it adds up to over $1,200 it’s grand larceny and you get arrested.\n\nWalmart also allows up to certain amount to be returned with no receipt and you get cash back.",
   "created_utc": 1700372404,
   "score": 12,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ucv8g",
   "message": "Poor",
   "created_utc": 1700361977,
   "score": 89,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uw6zt",
   "message": "I don’t. \nBut have you seen the cost of living these days?",
   "created_utc": 1700372666,
   "score": 38,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uojbg",
   "message": "It makes me feel alive.\nJk I don't any more but as a kid it was for sure a thrill thing.",
   "created_utc": 1700367955,
   "score": 10,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uen83",
   "message": "They give me the convenience of self checkout and I conveniently do it wrong every time.🤷‍♂️",
   "created_utc": 1700362870,
   "score": 197,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uzcbq",
   "message": "I don’t shoplift, but considering how many businesses and institutions are in collusion to take just about every dime from us, I can see why some people would have no problem stealing from businesses.",
   "created_utc": 1700374805,
   "score": 19,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uz05e",
   "message": "Everything I’m saying here is what I would feel if I did shoplift **hypothetically**. Shoplifting is highly immoral, and I feel utmost contempt for all shoplifters.\n\n1. It’s a victimlessless crime. A lot of the crap you hear about it raising prices of good and losing employee wages isn’t true. Companies track what they call “shrink” and they already know how much they’re going to lose before the year even starts. The billionaires that own Walmart can afford to pay their employees more, they just choose not to, that choice is not on me.\n\n2. I just can, *you* just can. Once you get away with it and realize most of time, no one is coming for you, you start questioning why you paid for stuff to begin with. I feel far more guilty about spending money than I do shoplifting. To me, spending money is the deviant action in my mind. I know someone that walked into a store and stole a single $600 item and walked out and nothing happened to him.\n\n3. The thrill. The research and planning the theft is almost addictive, I go in, check their cameras, check what their loss prevention is like, see if they have an EAS (electronic article surveillance) gate, if they have RFID (radio frequency identification) tags. Then when I actually conceal the stuff and exit the store, the dopamine hit I get is pure bliss.\n\n4. The ego aspect. There is something kind of narcissistic about it. Like I look around at all the dumb people who’ve bought into the system. They wouldn’t even think to take something and walk out with it because there minds are so limited to what the big businesses tell them. Largely it isn’t true, but the large scale compliance even under the dystopian circumstances in America scares me. I’m far more afraid of being a “free” drone than any jail cell. Hopefully this doesn’t sound too neurotic lol.\n\n5. Also me and my family are struggling financially.\n\nI hope someone finds this interesting to read.",
   "created_utc": 1700374571,
   "score": 59,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9un22a",
   "message": "Because its easy if I’m being entirely honest. I don’t do it allot but when I do it I usually shoplift small things.",
   "created_utc": 1700367155,
   "score": 26,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ucsvv",
   "message": "Because meth",
   "created_utc": 1700361944,
   "score": 33,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9v5tnj",
   "message": "Addiction. And that's addiction to shoplifting, not drugs. It's a rush. Confidence grows with each success. It becomes an obsession. It brings an amount of power when stealing from giant corporations. For me, this question is similar to asking an addict why they are addicted to drugs or alcohol. \n\nI haven't shoplifted in three years. I attended Shoplifters Anonymous and continue to go to therapy which are both very helpful. I'm very lucky I didn't lose everything.",
   "created_utc": 1700379534,
   "score": 5,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uxexk",
   "message": "I don’t, but isn’t the reason obvious? Free stuff.",
   "created_utc": 1700373479,
   "score": 12,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ufepp",
   "message": "Not myself, but I met this lady who worked at Walmart that recounted her daily interaction with a shoplifter. I’m not sure if the Walmart policy has changed, but this homeless man who didn’t know any English would every day go into the store and steal one bottle of sun block. He would take that item and go to the return line and return it. Now the Walmart policy was that if it was under some dollar amount, you don’t need a receipt to get a “refund.” Essentially, the man conned the system and he got free money every morning. But to answer your question, survival.",
   "created_utc": 1700363245,
   "score": 25,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uo48d",
   "message": "Stealing from megacorps is a moral imperative at this point",
   "created_utc": 1700367722,
   "score": 30,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ucy5k",
   "message": "I dont shoplift , but I think people usually do it because money is tight and they are fed up with a system that they think treats them unfairly.\n\nAlso tbh, I’m sure some of the youth do it because it feels cool.",
   "created_utc": 1700362017,
   "score": 78,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vkt99",
   "message": "Nice try fbi",
   "created_utc": 1700391530,
   "score": 5,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9unt8l",
   "message": "I catch shoplifters for a living. Most times people are stealing to sell the stuff for drugs or alcohol. It’s a deep rabbit hole.",
   "created_utc": 1700367553,
   "score": 13,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9unqft",
   "message": "Went to a local gas station to get beer and ice. Apparently they don't sell beer and an attendant never appeared. So at least I got free ice",
   "created_utc": 1700367512,
   "score": 10,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9v16e6",
   "message": "I don't do it anymore, but I used to steal from stores a lot when I was a teenager. I never took anything to sell, and never really needed or even wanted most of the things I took except for some drinks/food. I was also never caught by the stores.\n\nI guess it was just an urge, though I don't think I ever really got a \"rush\" out of it. I was just very good at it and was able to remain calm/act normal no matter what. The largest and most expensive thing I ever took was a tv. I just picked it up and left with it like it was normal, and I left it in the parking lot because I didn't even want it to begin with. Confidence is the key to theft. If you look like you're supposed to have something and aren't sweating and looking around like a crackhead then no one will look twice at you.\n\nI came home from high school once and my mother was sitting in the living room with an entire outdoor garbage can full of items (many still in packaging) asking me where I got them all, knowing I'd stole them. I mostly stopped after that. I never stole or had the urge to steal from people or small stores, it was always chain stores like walmart where I knew they wouldn't necessarily feel the loss. Not super proud of it like people seem to be these days, but it happened.",
   "created_utc": 1700376102,
   "score": 10,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uv81q",
   "message": "when i did: at first it was bc i saw how easy my friend did it and i was a poor high schooler and then it became so easy for me, it was like, why not? if i can scoop stuff for free, why pay?",
   "created_utc": 1700372020,
   "score": 5,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vug0j",
   "message": "Well, it's just a simple fact\n\nWhen I want something,\n\nI don't want to pay for it\n\nI walk right through the door\n\nWalk right through the door\n\nHey all right!\n\nIf I get by, it's mine\n\nMine all mine!",
   "created_utc": 1700398318,
   "score": 1,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ud728",
   "message": "Food is very expensive, I need to eat.",
   "created_utc": 1700362141,
   "score": 37,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9upoja",
   "message": "🎵 When I want something and I don't wanna pay for it 🎶",
   "created_utc": 1700368614,
   "score": 7,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9udka2",
   "message": "I stole your girl does that count",
   "created_utc": 1700362323,
   "score": 17,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ui0di",
   "message": "because why should megacorporations like walmart and kroger be able to charge what they do and claim inflation while the CEOs are billionaires making incomprehensibly massive profits while i stress over being able to pay for fresh food? Fuck that. It’s a sick system we live in and no one in this country (US for me obviously) should be food insecure while there are rampant rich folk living lavish. I will steal from this system for as long as it takes to watch it fall apart and i hope other people do too.\n\nedit: typo",
   "created_utc": 1700364532,
   "score": 65,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9v1ld0",
   "message": "When I was in high school I was at a restaurant that had a mini grocery store in one half.  I watched a mom with a young daughter rush out with a frozen meal without paying while the cashier wasn't looking.   Mom looked stressed and terrified, daughter was obliviously complaining that her mom said she could have ice cream.  I was the only person who saw, and I didn't say anything.  It affected me a lot bc I was so young and that was when I solidly decided I'd never turn in anyone stealing things like food.",
   "created_utc": 1700376409,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vewqb",
   "message": "I don't, but my long-dead grandma did, and the answer was *thrill.* When she was over 70, she could play the \"welp, I am a poor confused old woman, I don't know if it is Friday\" scene if caught. Amazingly, it worked and they never called the police on her.\n\nHer mind was perfectly OK until she died aged 90. (By that time, her body wasn't up to any mischief, but I think she still did it \u0026gt; 80.)",
   "created_utc": 1700386705,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vf9mb",
   "message": "For me it was because I am/ was a stress junkie. It was thrilling and fun until I got caught and escorted back to high school and arrested in front of the staff, got a misdemeanor, lost my license for a year, got a MIP for having weed in my bag (the school police officer found it when he searched my bag) and was suspend for two weeks.\n\nStill a stress junkie, just decided that a terrible marriage and doing things that wouldn't get me in trouble with the law was better way to remained stressed.",
   "created_utc": 1700386988,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vfjdc",
   "message": "Because self checkouts",
   "created_utc": 1700387202,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vgmh9",
   "message": "My uncle was/is a serial shoplifter. Simply put, he did it to fund his crack addiction. He is good at shoplifting, too. He's never been caught unless he wants to. He steals a lot of fishing tackle and sells it to a friend that sells it at a flea market. After he's done with his crack binge, he'll go in to the store and intentionally get caught stealing something small. He knows he's banned from Walmart and that they'll call the cops over some of the small stuff",
   "created_utc": 1700388097,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vihtk",
   "message": "I used to for two main reasons - addiction and being angry at the foster care system. I slept on the floor in clothes way too small for me for so fckn long, so I stole new ones. I was being underfed, so I’d steal food. Other foster kids would get Christmas presents, I didn’t so I’d just steal myself a nice treat like a book or smth 💀\n\nNo longer in foster care or extreme poverty + replaced the addiction with other ones now that I’m an adult :P",
   "created_utc": 1700389636,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9viwvs",
   "message": "Poverty. I only shop essentials and I have to steal diapers regularly. We were always paycheck to paycheck at least now we can afford to get tires or another essential without dam near starving. We need fucking universal Healthcare, having an autistic child makes life impossible.",
   "created_utc": 1700389982,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vj73x",
   "message": "I used to shoplift small things as a youth, usually basketball cards and CDs from K-Mart or Hills. I did it because 1. I wanted those things. 2. I knew that there was pretty much NO loss prevention. 3. I was angsty and wanted to stick it to the man.   \n\nI don’t know how I never got caught. I took so many basketball and football cards. It’s also how I got my copy of Hello Nasty by The Beastie Boys .\n\nI haven’t shoplifted anything since I was probably 15. Just kinda grew out of it. 🤷🏻‍♂️",
   "created_utc": 1700390202,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vl8j5",
   "message": "I'm lazy and quickly annoyed. \n\nI use the slef scanner you take into the shop so you can pack as you go. If something doesn't scan (error/wrong food code/etc...) I might try it a second time and then just throw it in the bag cause it isn't worth my trouble. Probably no more than an item a month, and in the beginning it felt a bit rebelious but now it is just lazy.\n\nA while ago my gf noticed something wasn't scanned and unpacked the bag so she could also fail at scanning it and then forced us to walk back so she could scan another one. Then my laziness was punished (and no she doesn't know because she would be way too nerveous anytime we go shopping together)",
   "created_utc": 1700391869,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vqm8u",
   "message": "Not really regular - but sometimes stuff doesn’t scan at self-checkouts and I’ll get impatient and… oops 🤩",
   "created_utc": 1700395807,
   "score": 3,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9v6wgs",
   "message": "It makes me happy stealing from corporate.",
   "created_utc": 1700380335,
   "score": 9,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uvbiu",
   "message": "Had a friend of friend who was prolific, don’t think he ever? paid for groceries unless he was with his girlfriend. \n\nDude was a little anarchist sure, but also just had zero qualms about ripping off a multinational corporation. He never touched targets, but it was a regional grocer with intl owners and a policy of chill behavior. \n\nHe viewed it as low risk. He never took his ID or Phone, always wore a mask, and got away with it for two years before being asked to leave. He left and that was a that. Just takes shit from a different one of their locations now.",
   "created_utc": 1700372083,
   "score": 7,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ujdj5",
   "message": "Groceries are expensive and it’s very easy to do with self checkouts. Everyone should steal from whole foods",
   "created_utc": 1700365224,
   "score": 33,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9usz2b",
   "message": "I used to shoplift because of poverty.",
   "created_utc": 1700370577,
   "score": 6,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9ucyvk",
   "message": "I wouldn’t say I “shoplift” per say..but I never pay for the reusable bags out of principle. I understand the banning of plastic bags, but that does not mean grocery stores should have an additional stream of income from selling bags while simultaneously charging out the ass for food claiming “inflation”. So yea I steal reusable bags for the greater good idk 🤷‍♂️",
   "created_utc": 1700362027,
   "score": 19,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9unrwv",
   "message": "We shoplifter here,I thought people were dumb for paying for the same stuff I got for free,grew up and realized I was the dumb one",
   "created_utc": 1700367533,
   "score": 5,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uojbo",
   "message": "I don’t anymore but back when I was a teenager I had a budget of exactly $20 for food every week for myself and my abusive bf. We paid for what we could and stole the rest. It’s what we had to do to survive.",
   "created_utc": 1700367955,
   "score": 2,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9uv4ei",
   "message": "they want free stuff",
   "created_utc": 1700371952,
   "score": 2,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9v8sfy",
   "message": "The bags at the self checkout at grocery stores. I always hit zero otherwise WA will get another one if its needless taxes",
   "created_utc": 1700381782,
   "score": 2,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vdnqn",
   "message": "Self checkout at Kroger has a lot flaws.  I have managed to find a lot of them.  Once I scanned a half cart of groceries when I noticed nothing was ringing up.  The second item I scanned was not in the system, but for some reason didn’t flag.  The self checkout let me keep going.\n\nI shop at night after 8:00 PM so the part timers are usually gossiping and not paying attention.",
   "created_utc": 1700385706,
   "score": 2,
   "submission_id": "17yn2o9"
  },
  {
   "comment_id": "k9vbsy7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17yn2o9"
  }
 ]
}