{
 "submission_id": "17ystkr",
 "title": "How important are your partner’s political views to you? Is it a dealbreaker if they don’t align with your own?",
 "selftext": "",
 "created_utc": 1700383465,
 "permalink": "/r/AskReddit/comments/17ystkr/how_important_are_your_partners_political_views/",
 "score": 102,
 "url": "https://www.reddit.com/r/AskReddit/comments/17ystkr/how_important_are_your_partners_political_views/",
 "comments": [
  {
   "comment_id": "k9vf7kq",
   "message": "You don't have to agree on every single issue, but you have to share a similar worldview and set of values. I assume there are couples who can be together regardless, but I can't imagine my significant other would see the world in a completely different light than me.",
   "created_utc": 1700386944,
   "score": 29,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vkekr",
   "message": "i think they dont have to be the SAME but they cant be polar opposites",
   "created_utc": 1700391197,
   "score": 27,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vgg2t",
   "message": "Extremely important. I can’t be with someone who doesn’t share my values. For example, when Covid hit, my spouse and I were 100% on the same page about how we would handle our safety, masks, vaccines etc. even though we had never discussed what we’d do in a global pandemic. But we agreed because we shared values. \n\nI watched many of my friends’ marriages struggle because the pandemic revealed their ideological differences. Politics are not theoretical. They affect your life in ways you can never anticipate.",
   "created_utc": 1700387948,
   "score": 221,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vb3nr",
   "message": "I don’t think you can have a long-term relationship with someone who has different values",
   "created_utc": 1700383645,
   "score": 43,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vct8i",
   "message": "Politics are an expression of our basic values. *\"The personal is political.\"*\n\nI can't be in a relationship with someone who has fundamentally different values than I do.\n\nWe can disagree on pizza toppings, not on whether basic human rights apply to all humans.",
   "created_utc": 1700385052,
   "score": 243,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9voaaq",
   "message": "Very important. Political views are influenced by someones morality and can be a good signal for what the person is like. What they think the lower class should be treated like, disabled people, what rights people should have and how far they extend. If you can judge a community by how it behaves to those it deems criminals, you can judge a person by how they think those criminals should be treated for the rest of their lives.",
   "created_utc": 1700394149,
   "score": 20,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vkn4i",
   "message": "Political views are based on core values and, in a relationship, are an element of what I qualify as \"compatibility\". So no, I can't be in a LTR with anyone who has drastically different viewpoints. Some small differences around the same edge are absolutely ok and, in a mature relationship, make for enriching conversations. But fundamentally different political views - no way.",
   "created_utc": 1700391392,
   "score": 31,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9ve8w6",
   "message": "Yes because if they don’t align with mine they will be literally voting laws into place that directly hurt me and my friends. It doesn’t matter if you say I’m “one of the good disabled people”, if you’re trying to cut social services for other disabled people you are hurting me and my community and I refuse to ignore that.",
   "created_utc": 1700386184,
   "score": 101,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vo0ud",
   "message": "I have a close family member who is married to someone with opposing political views, and frankly, I think it hurts their marriage. (Obviously it's not their only issue, but it plays a role.) Personally, I could never do it. Like other people have already said, it speaks to a person's core values.",
   "created_utc": 1700393958,
   "score": 12,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vopnk",
   "message": "We disagree on some details, especially because of our professions (I’m a nurse and he is a manager in manufacturing).  But hearing each others’ viewpoints is helpful in staying balanced regarding the things we do disagree on.  \n\nWhen it comes to human rights, though, we are completely on the same page.  And I could not be in a relationship with someone who felt differently than me in that area.  We have children, and it’s important to me that we are aligned with how we raise them.",
   "created_utc": 1700394465,
   "score": 11,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vmq4k",
   "message": "Very important. A persons values and beliefs are a huge part of who they are. How they want people treated is incredibly important . No, I couldn’t date someone fundamentally different",
   "created_utc": 1700392974,
   "score": 11,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vjtae",
   "message": "100% deal breaker.",
   "created_utc": 1700390711,
   "score": 29,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vqwz0",
   "message": "Substitute the word *values* for *political views.*\n\nVery important.",
   "created_utc": 1700396005,
   "score": 9,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vmmku",
   "message": "My ex-husband talked politics at (not to, or with) me all the time. Or views aligned almost entirely, but when I got sick of hearing nothing but politics from him, and requested he tone it down, and he said he would but only got worse, it killed our marriage. \n\nSo, they’re important, but I don’t want to hear about it every night for five hours straight.",
   "created_utc": 1700392902,
   "score": 7,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vclvj",
   "message": "Our economic politics can be fairly different but our social politics need to be similar.",
   "created_utc": 1700384875,
   "score": 61,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vmi65",
   "message": "This is an interesting one outside of the US, where we have multiple similar parties that can run the government together in coalitions. I have no problem with partners and relatives voting for different parties to me, as long as the core values are similar with variations in the implementation. But how an American Republican can be with a Democrat in 2023 is beyond me.",
   "created_utc": 1700392815,
   "score": 12,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vpj6f",
   "message": "I couldn't be in a relationship with someone who didn't share similar values to me.",
   "created_utc": 1700395053,
   "score": 5,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vu0p9",
   "message": "If the person I’m in relationship with doesn’t share the same values as me (humanism, equal rights, respect and care for the earth and its life forms, etc.) which are expressed as political ideals, then we are not meant to be together. The politics don’t have to match up exactly, but if my partner’s politics are not based on compassion, then we can’t be partners. Politics of selfishness, greed, isolationism, authoritarianism, and corporatism is like “being rude to the server” but the server is everyone and everything outside of their political in-group. No thanks. We can’t even be frenemies, let alone lovers. My compassion extends to wanting them to have the rights and benefits I wish for everyone, but it stops at tolerating hateful ideology.",
   "created_utc": 1700398047,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vmc0t",
   "message": "I think its critically important. There are certain issues that we can disagree on the best solution, but I'm having trouble imagining someone lining up with me on important values while ending up on the other side of the political aisle. If they are still pretending the 2020 election was fraud or that January 6th wasn't a big deal I can't imagine we would get past a first date even if none of that ever came up.",
   "created_utc": 1700392689,
   "score": 9,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9viuom",
   "message": "It's very important to me. Like, I'm black. I don't need a conservative partner that wants to move backwards politically considering...y'know. How the past was.",
   "created_utc": 1700389932,
   "score": 40,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vmwpd",
   "message": "Very and yes. Especially now",
   "created_utc": 1700393109,
   "score": 6,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vqy1l",
   "message": "very important bc its a window into their personal values",
   "created_utc": 1700396024,
   "score": 5,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vq5at",
   "message": "The problem with different political views is that they often mean different morals. I can tolerate different political views, but I don't even want to be friends with somebody that has grossly different morals.\n\nI once ended a relationship with somebody that repeatedly argued against trans rights.",
   "created_utc": 1700395476,
   "score": 9,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vrjoz",
   "message": "Very important, since they're tied to ethics. They don't have to be the exact same, but I feel like you're just compromising too much if they're that different. \n\nSo, you could literally not care much about politics, that's fine. But your ideas of what is good and bad have to be close. Same for religion, I'm an atheist but I could manage being with someone religious as long as they hold moderate views and are socially progressive. It's not the belief of a higher being that is a red line as much as the fact that you think gays or non believers are commiting sin just because the church says so.",
   "created_utc": 1700396426,
   "score": 7,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9voo2w",
   "message": "i'm a queer disabled individual. i could not date somebody and be on an equal page if they believe me or my friends deserve death for existing in a body or way that offends them. \n\nyou tend to see the right be able to say \"it's just politics/words\" more in regards to dating people with opposing alignments more than people who are more left in views. that's usually because the one thing i can do to make a conversative man do to be comfortable in my existence is die. for me, it could boil down to life or death, and i can't gamble with that. \n\nsomeone who's on the right can brush it off because a lot of the things they get red in the face about aren't things that directly kill or harm them. i'm not saying there's not people who are republican/conservative who cannot brush it off, but you tend to hear it more from them because the gravity isn't as hard",
   "created_utc": 1700394433,
   "score": 11,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vnwfr",
   "message": "It can show moral values so I don't think so",
   "created_utc": 1700393865,
   "score": 3,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vqg0e",
   "message": "I think what drives the political views matters more to me than the views they end up with. I know people of various political stripes who come from a position of goodwill and people of various political stripes who seem mainly motivated by hate/contempt/snobbery about other people.\n\nWhat I find most unpleasant tbh is those who agree with me but for terrible reasons.",
   "created_utc": 1700395682,
   "score": 3,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vt6yo",
   "message": "They don't need to vote for the same party, but we do need to have similar values. \n\nI'm not from the US though, there's more of a spectrum of parties in UK politics, with overlap between the parties, rather than the polar opposites that are the Democrat and Republican parties.",
   "created_utc": 1700397511,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vtued",
   "message": "A difference in opinion on nuance of economic policy is one thing.   \nThinking that parts of the population don't deserve basic rights is a deal breaker.   \nSo considering one party is all about screwing over everyone who doesn't fit their main demographic and specifically taking my rights away, it absolutely is shorthand for a forest of red flags.",
   "created_utc": 1700397936,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vugii",
   "message": "They can have a different idea than me on how to fix poverty (just an example) but they have to believe poverty is a problem.  I need someone who lives in the same reality as me.",
   "created_utc": 1700398327,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9viwcd",
   "message": "They would never make it to becoming my partner if they were right wing. I simply don't want arseholes for children.",
   "created_utc": 1700389970,
   "score": 30,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vdrwk",
   "message": "My parents have been married 53 years and they had opposite political views until Jan 6th.",
   "created_utc": 1700385800,
   "score": 7,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vmlbb",
   "message": "I think it’s important to have the same values, however, my partner is more extremist I’d say in certain views. I agree for the most part with what they say, but just not to the extent they bring it to. I think it’s a little much sometimes with the rants that happen. But it’s nothing I’m really worried about or against.",
   "created_utc": 1700392876,
   "score": 2,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vroi7",
   "message": "To an extent. I don't think they need to be 1 for 1 the same, but they should line up on important things.",
   "created_utc": 1700396515,
   "score": 2,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vslp1",
   "message": "Very important, we can have different approaches, but the view about a political issue must be the same, otherwise it's a deal-breaker for me.",
   "created_utc": 1700397127,
   "score": 3,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vss57",
   "message": "Yes dealbreaker. You gonna have kids and it’ll blow up fast.",
   "created_utc": 1700397246,
   "score": 3,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vsyn0",
   "message": "Total deal breaker",
   "created_utc": 1700397362,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vw2lg",
   "message": "that depends. they dont agree with me on how much we should work a week, thats fine\n\nthey dont agree with me that genocide is bad, thats not fine.\n\n\u0026amp;#x200B;\n\nlike, we can disagree on pizza topping guys, not on our rights to live.",
   "created_utc": 1700399321,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vw5c2",
   "message": "I expect my partner to have well reasoned opinions. Even if they don’t align with my views, having opposing views that are grounded in facts is a valuable part of our relationship.",
   "created_utc": 1700399368,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vw98n",
   "message": "My very existence is deemed political, they bloody better be 100% the same as me ideologically.",
   "created_utc": 1700399434,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vjni6",
   "message": "They dont have to align on economic issues but social issues they need to be pretty damn close , complete alignment would make for boring debate but if my partner started expressing opinions diametrically oppossed to mine on issues involving personal freedom of others then that partner would quickly become an ex.",
   "created_utc": 1700390576,
   "score": 8,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vg58q",
   "message": "Politics have bled too far into social issues. I could handle the old financial conservatives. But not a conservative who holds their current views.",
   "created_utc": 1700387695,
   "score": 11,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9viy9z",
   "message": "They don't need to entirely align but if we're going to raise a family we at least need to be in the same ballpark.",
   "created_utc": 1700390014,
   "score": 3,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9viqxb",
   "message": "I would absolutely never date anyone who would vote for Trump. [His rhetoric is nearly indistinguishable from Hitler’s.](https://www.snopes.com/news/2023/10/04/trump-poison-blood-quote/) As someone of Jewish descent, dating someone who would vote for him is tantamount to suicide.",
   "created_utc": 1700389848,
   "score": 8,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vhq7n",
   "message": "I'm quite apolitical, but I still have some political views. The partner's views would need to be relatively similar, not 100% the same, but if they aren't, then yes, it can be a dealbreaker for me.",
   "created_utc": 1700389014,
   "score": 4,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vt29k",
   "message": "Political views are great.  How do we manage the budget, taxes, roads, schools?   I like varied opinions. That is all good.  \n\nIf your candidate is popular because of a special brand of hate you have no place in my life.  If you tell lies and spread hate about my people, fuck off.  This is not politics, it is raw hate.  If you hate like that I will not spend my time with you.",
   "created_utc": 1700397425,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vm9md",
   "message": "They need to be very similar.",
   "created_utc": 1700392637,
   "score": 2,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vnnt4",
   "message": "They need to be pretty similar at least. Like, I have a disability. I couldn't be with someone who wants to cut services that help me or if they vote to privatize healthcare (I'm in Canada) in an attempt to save a minuscule amount in taxes. If saving a couple extra grand a year is more important to them than me and others like me, it couldn't work.",
   "created_utc": 1700393684,
   "score": 2,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vj4e1",
   "message": "I would like to answer this, but everyone else is so much more eloquent in what I was about to say. There's no way politics is never going to affect your love life.",
   "created_utc": 1700390143,
   "score": 2,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vj8rn",
   "message": "Moderately important. \n\nThey don't have to align 100%. But we can't be complete opposites, we have to have a similar way to see the world and how we think things should work.\n\nAnd I don't date with extremists. On either side of the political spectrum.",
   "created_utc": 1700390238,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vrf4i",
   "message": "I’d like them to be at least a little close. We don’t agree on guns? Dope. We don’t agree on abortion? Not dope dude everyone should have the human right.",
   "created_utc": 1700396342,
   "score": 3,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vsc4l",
   "message": "I would leave if my husband started voting for conservative candidates.  Idk I used to have Republican friends and now I don’t.  Things changed for me after the Trump election, I think.  I can’t stand to be around people opposing abortion and condoning racism and both-sides-ing.  \n\nI know it’s not particularly healthy to keep myself ensconced in my liberal bubble.  I know everyone lives differently and has different views.  Why can’t i just let it go at that and move on?  I don’t know.  It feels like betraying myself and my kids when I try.",
   "created_utc": 1700396952,
   "score": 3,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vcx1r",
   "message": "If their values are radically different, and my perception is that they came by their platform from logic and reasoning, as opposed to indoctrination or emotion, I can be with them.  I would expect spirited debate and extra arguments in the relationship.",
   "created_utc": 1700385141,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vkh1u",
   "message": "We have to agree on the fundamentals. All humans have basic human rights. All Cops Are Bastards. We can endlessly disagree on the finer points but for a relationship to function our core values must align more or less.",
   "created_utc": 1700391253,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vlacr",
   "message": "Political views? If you mean if they would vote in the obvious racist/sexist guy then yeah thats a big issue.  \n\n\nBut if we're talking about every day political stuff then na, it doesn't matter to me, the only way it becomes a deal breaker is if they base their personality on it and or bring it up all the time.  \nDon't care if you dont vote the way I do, but I do care if u bring it up all the time.",
   "created_utc": 1700391908,
   "score": 2,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vt5m2",
   "message": "Very important. \n\nThere’s a reason the maga crowd has to create their own dating apps lol nobody wants to find out later they are married to a racist loser",
   "created_utc": 1700397486,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vaysl",
   "message": "We don't see eye to eye on politics so we don't talk about it. We've been married for 17 years.",
   "created_utc": 1700383539,
   "score": 250,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vn67l",
   "message": "To me, party line does not matter. You may vote for a different party or candidate. \n\nBut it is the set of values that matter. We need to have similar values.",
   "created_utc": 1700393308,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vqj7e",
   "message": "Previously, no, but after the MAGA movement, 100%. In the past, political alignment was more about economics and foreign relations, but now it's become a gauge of someone's morality. Unless the tides can change in the future, political views are moral views and those are deal breakers.",
   "created_utc": 1700395747,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vs5n3",
   "message": "Well, my wife and I are both on our second marriages and we both agree with each other about 95% politically my first wife and her first husband are both Maga supporters and our nuttier and fruitcakes and our kids want nothing to do with their other parents, nor do they allow their children to talk to their other grandparents so yeah, I think you have to be somewhat politically aligned in order to stay married for 25 years",
   "created_utc": 1700396831,
   "score": 2,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vseia",
   "message": "Depends. I could be together with someone who disagrees with me a bit concerning how gun regulation should work, or whether capitalism is a good system or not.\n\nBut I wouldn't be together with someone who is anti-abortion, or a sexist, or a homophobe, or a racist.",
   "created_utc": 1700396997,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vta2x",
   "message": "Now that I think about it I've been with my husband for 12 years and I don't know his political views as neither of us really care or discuss politics. Lol",
   "created_utc": 1700397568,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vtn3i",
   "message": "they don't have to agree with me on every single policy, but human rights are non negotiable. in the current political climate, I would not even consider dating a conservative, because in my experience (again -- MY EXPERIENCE, not meant to be taken as a blanket statement) all the conservatives I have met call for some form of oppression. \n\ntrans people have rights, women have rights, black people have rights, lgbtqia+ people have rights, Jewish people have rights, any human being has rights. one person's personal freedom isn't freedom if it encroaches on another's rights. that's not up for debate for me.",
   "created_utc": 1700397804,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vbw6s",
   "message": "I don't think it's important unless it begins to affect the relationship. Of course if they have far left or far right views it would likely be an issue. No use trying to argue or change their mind. It won't happen \n\nBut for the vast majority of people, I'm happy to respect their views if they're happy to respect mine.",
   "created_utc": 1700384287,
   "score": 255,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vbatr",
   "message": "Doesn’t matter unless you want to make it matter.",
   "created_utc": 1700383808,
   "score": 245,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vcu2p",
   "message": "I think it depends on what.\nWe don't discuss politics and I don't know what my husband votes. \nBut we have similar values in terms of childcare, elderly care, schools etc, so I imagine that we pretty much vote the same. \nIf he was on the total opposite side of the spectrum, politically, we wouldn't agree on what areas need the most funds.",
   "created_utc": 1700385072,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vi3g5",
   "message": "It can work. My girlfriend is Chinese and rather proud of CCP politics. I am not. But we do not fight 😉",
   "created_utc": 1700389317,
   "score": 252,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vs6fa",
   "message": "Yes especially when they believe something that can oppress me.",
   "created_utc": 1700396846,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vs9ki",
   "message": "There are limits, but it shouldn't be a deal breaker. This strikes me as a young mindset. \n\nMost people will find their political beliefs shifting throughout their lives, often in response to real world events and personal experiences. If you're instantly counting someone out of the dating pool because of some political differences, you're selling yourself (and potential for growth and change) short too.\n\nDifferent political beliefs aren't necessarily about different values. They are often about different understandings of how to best achieve those values. In fact, if you think \"political beliefs\" is synonymous with \"personal values,\" that's an error for most people except the most rabid political obsessives and is a reflection of current cultural forces.\n\nObviously, if you can't sit down and have a conversation without it devolving into a political fight, you're not compatible. But people also seem inclined to pick political fights these days in a way that wasn't nearly as common a few decades ago. \n\nAn exception to this general rule are people who've built their own bespoke belief system around a conspiracy or delusion. I could deal with someone who votes differently. I could not deal with a flatearther or 'parasites cause all disease' type person.",
   "created_utc": 1700396905,
   "score": 255,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vsxo9",
   "message": "Absolutely a dealbreaker. I can't abide conservatives anymore. I already didn't get along with them well, but the last 8 years has made it even worse",
   "created_utc": 1700397344,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vdcdl",
   "message": "As long as they're not constantly talking about it",
   "created_utc": 1700385472,
   "score": 248,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vhjpq",
   "message": "Nope, I don't give a shit.",
   "created_utc": 1700388864,
   "score": 251,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vl157",
   "message": "I don´t have a partner but friends and family with different views. I can´t be bothered, why woud I? People have a right to their own opinion. It can be food for though and good discussions.\n\n\u0026amp;#x200B;\n\nThis said, I would never date or befriend an aresehole, so little  chance there would be great diffirences in polital thinking.",
   "created_utc": 1700391707,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vma6w",
   "message": "Some people are just more flexible.  Like I started my relationship as a conservative, and that wasn't a problem.  Maybe 5-6 years later, I'm shifting left.  And then in my thirties and on, shifting more pro-business, but like still much much more progressive and left than my teenage self.  We've never really seemed out of sync, and she definitely has a strong moral compass, but like not churchy or judgmental.  But we started young and evolved over time.  If was starting over now, there's be a laundry list of things I wouldn't put up with that I don't think will change (ie, wouldn't date a Trumper, anti-vaxxer, conspiracy nut, religious, etc).   \n\nI remember very early on, even though I was conservative, saying I didn't want a religious marriage or religious upbringing or baptism for any kids, like we'd both had growing up, and we stuck to that, and it hasn't been a problem.  But I'm pretty sure if I'd said, the opposite, that I wanted baptism and a church marriage, she'd have gone with that too.  Some people just don't care as much, and that's ok.  \n\nLike election time, I think she mostly votes based on my recommendation.  I definitely don't require that, but like I usually tell her what I'm thinking about our choice on the ballot, and what I'm gonna do, and she does the same thing.  I don't think she's hiding voting differently than me, because if she was, I'd want to know about her reasoning, cause I love, trust, and respect her.  I've voted for every major party at least once.",
   "created_utc": 1700392649,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vnxnx",
   "message": "I avoid and deflect all talks of politics.",
   "created_utc": 1700393891,
   "score": 255,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vq9m5",
   "message": "Its not the views that bother me, it's the conviction, if their entire personality is their politics, I honestly will dread every conversation regardless of which side of the aisle they're on. Be less 2D.",
   "created_utc": 1700395559,
   "score": 255,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vc7qa",
   "message": "Nah because I live in Australia and it’s all the same nonsense",
   "created_utc": 1700384553,
   "score": 249,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vnwys",
   "message": "I think politics are bullshit, in particular it's polarizing nature. All too often conflict is started where realistically their could and should be none whatsoever. The most petty and miniscule topic can tear otherwise like-minded people apart in seconds. I've known really amazing people who I admire and respect, that decided to distance themselves from me for miniscule political indifferences. it really hurts to say the least. I can understand why someone might consider it a deal breaker if their respective partner has majorly conflicting views on very obviously controversial topics. for example racism is bad, duh, and anyone who disagrees is not someone I could be with romantically or otherwise; the broader nature of politics is far more sinister in my opinion. brutally separating individuals into specific categories that can or cannot interact with each other for very specific reasons, which I myself will never fully understand.",
   "created_utc": 1700393877,
   "score": 252,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vuqyj",
   "message": "Some issues matter more than others and I’d like to be with someone with similar values. For example, i can’t imagine being with a woman that’s okay with abortion or believes in gun control.",
   "created_utc": 1700398511,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vvn6y",
   "message": "Pretty much zero. I have friends with differing political opinions on all sorts of policies, we get along fine because we all understand having different opinions doesn't make you a bad person.",
   "created_utc": 1700399058,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vx12i",
   "message": "I could never date a lib. So it’s kinda important. They have to at least be awake to see what’s happening. And not be one of those people who are all about the gays and trans and whatnot.",
   "created_utc": 1700399893,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9ve3il",
   "message": "It depends. If my partner talked about the issues all the time, then yes, that would be a deal breaker. If they knew I didn't agree with them and decided not to bring it up, that'd be cool. \n\nThe only times that I think it would matter is if the politics altered our individually-defined quality of life. As in pro-choice/pro-life, the social security program in the USA, things like that.\n\nI dated a man a few years ago who wouldn't let up on the politics thing, and tried to get me on board with his viewpoints. When he did, I usually just grey rocked him. It got to the point that I barely had a conversation anymore.",
   "created_utc": 1700386067,
   "score": 251,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vcvpx",
   "message": "Frankly I've never really discussed politics with her and I'm not interested in starting.",
   "created_utc": 1700385110,
   "score": 246,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vngfs",
   "message": "IMO, if it is a dealbreaker, they are better off without you.",
   "created_utc": 1700393530,
   "score": 255,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vo3do",
   "message": "Absolutely. I'm not so small minded as to generalize or hate another person as evil merely for voting for a different political party. I dont see an entire party or side as a malicious enemy who can only seeks to do harm. I dont see them as inherently the problem. Chances are that they too jusy want a better world, and are pursuing it kn the way they think will work. Especially when this kind of thinking makes you blind (if not willingly) to the bad your own side does. \n\nIf anything, being with someone who sees things differently is beneficial. \n\nAnd for the tons of posts here, [I see a lot of people proving these studies right. ](https://www.aei.org/research-products/report/partisan-attachment-how-politics-is-changing-dating-and-relationships-in-the-trump-era/)",
   "created_utc": 1700394011,
   "score": 253,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vq0ii",
   "message": "I think in any part of life, if you start hating people because of their political views then you’re the problem.",
   "created_utc": 1700395385,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vqdch",
   "message": "Not a dealbreaker for me.\n\nArgentina is currently extremely polarized. As a Centrist I believe I've slept with most of the political compass, except for extreme lefties.\n\nCan't ever seem to find one that showers.",
   "created_utc": 1700395631,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vb8np",
   "message": "No you know why because I am 40 and we didn't give a shit about your political association growing up . You knew some on all sides but none of us cared .. I could care less if my wife told me she was voting for Biden.. id probably laugh at her but that's about it",
   "created_utc": 1700383760,
   "score": 235,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vsqwf",
   "message": "The wife and I have aligned almost perfectly for these 47 years; politicians are corrupt, thriving, liars. Two wings of the same dirty bird.",
   "created_utc": 1700397223,
   "score": 255,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vvqia",
   "message": "Depends on the particular issue in question.  You can want a balanced budget and a government that understands each dollar should be spent wisely, while also making sure those dollars go to help people who need it, and to ensure everyone is treated equally in society.  \n\nThe problem with politics right now is too many people throwing *every single issue* into one neat little box and demanding total acceptance of *everything* in the box, instead of taking each issue one by one and making an informed decision on each item in the box.",
   "created_utc": 1700399113,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vgzdy",
   "message": "Not identical is fine, but diametrically aligned would be a problem.   I tend to chaotic neutral, my partner is lawful good.",
   "created_utc": 1700388393,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vo6oi",
   "message": "My only criteria is that they aren’t a controlling maniac if we hold different views- something a lot of the people commenting seem to have.\n\nPolitics don’t have a place in the relationship as having a decent personality has nothing to do with politics.",
   "created_utc": 1700394076,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vq54g",
   "message": "We've been married 30 years.  We don't even talk about politics or religion because they don't don't matter to us.  We share our lives, and don't let those things be part of our lives.",
   "created_utc": 1700395472,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vqoaq",
   "message": "I dont care, in theory it sound important but in practice I am a conservative and It is becomming hard to me to find a strong, independet conservative woman. So I think I will end up married to a Liberal woman. The only problem I see is on how to raise the kids, but then I want my kids to be independent and develop their own political point of view.",
   "created_utc": 1700395846,
   "score": 254,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vfh7q",
   "message": "I am super conservative, but not the religious kind, the small government kind.  My fiancé was very very liberal.  When she turned 30, she wanted a house, babies, lower taxes, a gun, and thinks killing babies is bad.  Kinda weird how that works.",
   "created_utc": 1700387155,
   "score": 236,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vqd7m",
   "message": "Depends how different they are. Long as you aren't at the far opposite ends and willing to fight for your views constantly, it should be fine",
   "created_utc": 1700395628,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vrtnu",
   "message": "Radicals = Out that hoe.",
   "created_utc": 1700396611,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vs3ji",
   "message": "I have thought about contacting my ex to find out if she is a Trumper. It would make it much easier for me to no longer love her.",
   "created_utc": 1700396792,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vs50t",
   "message": "It would be an absolute deal breaker.",
   "created_utc": 1700396819,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vtjow",
   "message": "If it's a matter of which path in the same direction, then it's fine. If it's a matter of one wanting to go down a path and the other wanting to go back up it, then that's bad.",
   "created_utc": 1700397742,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vtri2",
   "message": "We can disagree on the details, but there are certain political beliefs that would underlie foundational-level differences in our outlooks on the world and on life that would inform all our thoughts and behaviors and make us incompatible for anything more than a short-term, superficial relationship.",
   "created_utc": 1700397883,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vu7lx",
   "message": "If the political difference is whether we should prioritize light rail over building more pedestrian and bike infrastructure or vice versa, sure. If the difference is they don’t believe I should have bodily autonomy, fuck no.",
   "created_utc": 1700398170,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vu9ia",
   "message": "It's a deal breaker in that supporting certain political parties or policies means the difference between supporting human rights and social aide systems or not. My husband and I have vacillated between voting NDP or Liberal and that's not a big deal at all - we can disagree about certain things and debate things with total equanimity. We can have different opinions but our core values are the same and that's what matters.",
   "created_utc": 1700398204,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vua2s",
   "message": "Your political views are your morals.  If you ignore someone’s politics you’re ignoring who they are as a person.",
   "created_utc": 1700398214,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vuscm",
   "message": "As long as our values align, political views don't mean a whole lot. Most people want the same thing, they just might disagree about how to get there.",
   "created_utc": 1700398535,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vuwze",
   "message": "They need to be similar\n\nOtherwise it will lead to division\n\n\nRemember, the little things you ignore as quirks in the honeymoon stage become huge annoyances over time, once the glow wears off and you're now fully aware of who you're with, and politics I'm this day and age are a huge division",
   "created_utc": 1700398615,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vv0if",
   "message": "My partnet cannot be a zionist all the rest i can tolerate",
   "created_utc": 1700398678,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vv5hl",
   "message": "They don't have to exactly align, but there's no way I'd date someone who was a bigot or a Qanon idiot",
   "created_utc": 1700398762,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vvcye",
   "message": "James Carville and Mary Matalin have shown that being polar opposites is possible.  Though I doubt any normal couple could ever duplicate what these seasoned political debaters do. \n\nI think the population suffers from the show that politicians put around politics enough that they’d never survive as a couple without knowing that there are many friendships across the aisle in politics.",
   "created_utc": 1700398885,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vvxau",
   "message": "Depends on how lenient both parties are. I don’t see how I can stay in a relationship with my partner if we have completely separate world views, but at the same time, you can’t expect to agree on everything. If my partner has some right ideologies to my left lenient ones, it’s fine, just as long as our general political views aren’t complete opposites.",
   "created_utc": 1700399230,
   "score": 1,
   "submission_id": "17ystkr"
  },
  {
   "comment_id": "k9vxxxa",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "17ystkr"
  }
 ]
}