{
 "submission_id": "180rjhn",
 "title": "What's the most ridiculous explanation a company has given to deflect themselves from the real reason something has happened?",
 "selftext": "",
 "created_utc": 1700600945,
 "permalink": "/r/AskReddit/comments/180rjhn/whats_the_most_ridiculous_explanation_a_company/",
 "score": 139,
 "url": "https://www.reddit.com/r/AskReddit/comments/180rjhn/whats_the_most_ridiculous_explanation_a_company/",
 "comments": [
  {
   "comment_id": "ka81y7l",
   "message": "McDonald’s and the coffee burn victim, claiming she only did it for the money. She didn’t - she was horribly burned by coffee kept far too hot that McD’s had been warned about repeatedly in the past and they still refused to fix.",
   "created_utc": 1700606466,
   "score": 225,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka7yoch",
   "message": "“We are experiencing higher than usual call volumes”.",
   "created_utc": 1700605198,
   "score": 225,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka7qvoc",
   "message": "Amys Baking Company after going nuts on facebook. They claimed they were hacked and were now working with the FBI to find out who was behind it",
   "created_utc": 1700602327,
   "score": 155,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka88nz4",
   "message": "[Air Canada 624 landing in Halifax](https://en.wikipedia.org/wiki/Air_Canada_Flight_624).  For a while their press releases stated that it was a \"hard landing\".  The fact that 24 people were injured, engines separated from the wings, and the plane was written off didn't seem to figure into it.",
   "created_utc": 1700609182,
   "score": 80,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8dmxy",
   "message": "Many companies are notorious for calling their customers stupid when they're sued for something. For example, when Subway was sued for undersized sandwiches, Subway argued that \"Footlong\" was just a trademark and there was no reason for anyone to think that it meant that the sandwich was 12 inches long.",
   "created_utc": 1700611287,
   "score": 78,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka812vz",
   "message": "\"Pride and Accomplishment\"\n\nEdit:\n\nOh yeah, and also \"Don't you have phones?\"",
   "created_utc": 1700606128,
   "score": 60,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8942p",
   "message": "I quit a job after the entire company was being forced to sign away our rights to ever sue the company. (This was after they were getting sued for not paying their employees accurately). \n\nThe topper was that if we elected not to sign, we would be forfeiting ALL BONUSES until we did sign. \n\nI quit within a couple weeks and told my boss directly that a leading factor in why I was leaving. \n\nHe left shortly after too.",
   "created_utc": 1700609371,
   "score": 57,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka81cum",
   "message": "SpaceX offered to build a submarine to rescue people in a cave. They drew a design and everything. Had a whole plan. A guy said no thanks so Elon Musk called him a child molester.",
   "created_utc": 1700606236,
   "score": 154,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8jp77",
   "message": "[“The intent was for players to have a sense of pride and accomplishment for unlocking heroes.”](https://www.reddit.com/r/StarWarsBattlefront/s/lW58ZYYvu9)",
   "created_utc": 1700613905,
   "score": 1,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka7rawa",
   "message": "“You’re holding it wrong!” \n\n- Apple with the iPhone 4.",
   "created_utc": 1700602480,
   "score": 92,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka7ru2t",
   "message": "The reason we're not making any money is because our fans are toxic and sexist.",
   "created_utc": 1700602673,
   "score": 67,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8f29w",
   "message": "\"We reduce the performance of your older iPhone to keep it from crashing.\" Sorry, Android doesn't do this and this type of thing hasn't been a problem for over 10 years. It WAS an issue with some of the earliest smartphones, but not since 2012 or so. Apple just does it to try to get you to upgrade or pay for a battery replacement.\n\nEdit: gotta love the Apple sheep down voting me for speaking the truth.",
   "created_utc": 1700611914,
   "score": 55,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8gpt6",
   "message": "\"We work better when we're all in the office together...\"",
   "created_utc": 1700612629,
   "score": 28,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8jl88",
   "message": "Lululemon's founder, when confronted about the threadbare, see-through quality of his yoga pants claimed that it was women that were \"bigger\" shouldn't use them because their thighs rub together, damaging the fabrics.\n\nNope, you just sell crappy, overpriced pants.",
   "created_utc": 1700613858,
   "score": 1,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8nihs",
   "message": "Tesla's Full Self Driving is *always* only waiting on regulators to approve it.\n\nReally it's shit software that doesn't work.",
   "created_utc": 1700615551,
   "score": 1,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8oefj",
   "message": "Tucker Carlson being sued as part of Fox News and his lawyers stating that what he says “cannot reasonably be interpreted as facts.”",
   "created_utc": 1700615940,
   "score": 1,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka7otix",
   "message": "The election was rigged",
   "created_utc": 1700601589,
   "score": 66,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka7t4va",
   "message": "Even though someone posted something entirely anti-Semitic and our CEO said it was \"the truth\" it is being misreported that he himself is anti-Semitic.",
   "created_utc": 1700603143,
   "score": 32,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8bgg3",
   "message": "Surprise and delight.",
   "created_utc": 1700610356,
   "score": 3,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8kyq0",
   "message": "Spent hundreds of thousands of dollars getting everyone new uniforms with belts, hats, and new wool boots. Just to tell us we don't have to wear it because of the first amendment. I still don't understand it.",
   "created_utc": 1700614448,
   "score": 1,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8pl6h",
   "message": "When Rockstar decided to remove about 200 cars from the game and claimed it was to improve the user experience... that's gotta be somewhere up in the top 100, at least?",
   "created_utc": 1700616451,
   "score": 1,
   "submission_id": "180rjhn"
  },
  {
   "comment_id": "ka8q05o",
   "message": "\"The one opinion, which I think is extreme, is represented by the NGOs, who bang on about declaring water a public right. That means that as a human being you should have a right to water. That’s an extreme solution. The other view says that water is a foodstuff like any other, and like any other foodstuff it should have a market value\" - Peter Brabeck-Letmathe, former CEO of Nestle.",
   "created_utc": 1700616630,
   "score": 1,
   "submission_id": "180rjhn"
  }
 ]
}