{
 "submission_id": "180rfzd",
 "title": "What's your most regrettable fap?",
 "selftext": "",
 "created_utc": 1700600698,
 "permalink": "/r/AskReddit/comments/180rfzd/whats_your_most_regrettable_fap/",
 "score": 204,
 "url": "https://www.reddit.com/r/AskReddit/comments/180rfzd/whats_your_most_regrettable_fap/",
 "comments": [
  {
   "comment_id": "ka82f2o",
   "message": "When I was a dumb young teenager I heard about the benefits of lube, so, not having any around, I decided to use washing up liquid. And my schlong shedded skin like a snake for a month straight. One of the worst painful times in my life ha, and by the end of it my schlong was pink and sensitive for another week or so. I'm just glad there was no long term damage, wasn't even a good fap.",
   "created_utc": 1700606651,
   "score": 115,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8im12",
   "message": "This is definitely gonna get lost in the comments, but when I was like 14, I went to my sisters karate practice, and being 14, I got a random urge to jerk the gherkin. So I told mum I was gonna wait in the car, then proceeded to beat my meat in the front seat for what felt like eternity. Unbeknownst to me, a few parents had walked past and noticed, and told the buildings manager, and I had a flurry of people come outside and mum came raging towards the car. I knew I had been caught, and mum asked me what the fuck I was doing in the carpark beating my dick, and I tried to play it off as a mosquito bite that I was itching on my thigh. Don’t think anyone believed that, and my sister dropped out of karate that same week lmfao",
   "created_utc": 1700613444,
   "score": 192,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka7w8tt",
   "message": "Any time I'm watching porn on phone and someone calls.",
   "created_utc": 1700604284,
   "score": 10,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka815cy",
   "message": "When I ended up breaking my dick afterward. I wish I could go back in time 4 years",
   "created_utc": 1700606155,
   "score": 172,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka7vy01",
   "message": "When my mom walked in and said that the diner was ready.",
   "created_utc": 1700604173,
   "score": 114,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8nbzw",
   "message": "Back in the day as a teen lad I was abusing myself 10x a day in the summer (did not have enough going on to stay busy) and I fell asleep immediately after finishing once. My dad comes in to check on me, spots me passed out trousers down asleep on the bed. \n\nI wake up like… oh no. See my dad come breakfast, mentions I went to bed early last night. The look of horror on my face as I lock eyes with his. Dad says ‘Yeah, if you could not do that again’. Mortified 😂",
   "created_utc": 1700615472,
   "score": 91,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8f59f",
   "message": "Fell asleep after a fap dick in hand with girlfriend’s dirty panties hanging out of my mouth  and her brother woke me up laughing his ass off.",
   "created_utc": 1700611950,
   "score": 115,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka887sb",
   "message": "In the Army, training for a deployment to Kosovo. Unit was set up in a mock village in Germany and I was on guard duty in this bell tower in a fake church.\n\nI decided the lingerie section of the PX mailer I found was worth a fap, so I proceeded to do the deed. Spit in my hand (because I’m a lube guy) and went to town.\n\nAbout 30 seconds after I buttoned up, I felt the worst burning around my lil soldier I’d ever felt, so I dropped my pants.\n\nWhat I observed scared me half to death and I almost ran down screaming…till I remembered the huge chaw of Copenhagen dip in my mouth, which I had unwittingly spit part of in my hand to do the deed.\nIn my haste, I had rubbed tiny granules of tobacco snuff all up and down my Jimmy, causing the worst case of chaffing imaginable. The next two weeks in the field without a shower were interesting.",
   "created_utc": 1700608992,
   "score": 43,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka87fgl",
   "message": "Trans-Pacific flight. I didn't got caught, but I still think about how terrible it was for me to do that. But that's what teenage boys do.",
   "created_utc": 1700608665,
   "score": 123,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8szwf",
   "message": "Post nut clarity after buying mid videos from a girl on onlyfans.",
   "created_utc": 1700617916,
   "score": 8,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8hiwg",
   "message": "One time I shit my pants when I came",
   "created_utc": 1700612978,
   "score": 136,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8hz0t",
   "message": "Not fab but when I was like 14 or so I was about to go out with a friend of mine I had a crush on. So I found this bottle of concentrated Eucalyptus Oil in the bathroom you’re supposed to add to the hot water in the bathtub when you have a cold. Somehow I thought it would be nice if my penis would smell fresh in case of the cases we’d end up making out.\n\nIt was a horrible pain lasting for at least 30 min and a burning sensation every time I pulled back the foreskin for another couple of days like someone would cut through your dick with a hot knife.\n\nDo not put concentrated eucalyptus oil on your dick!",
   "created_utc": 1700613173,
   "score": 171,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8dn8b",
   "message": "So, story time, I haven’t thought about this in years and I have never shared it with anyone.  This seems as an appropriate time as any.\n\nSo I was 16 and like most American teenage boys, I was horny all the time.  I usually got home from school and had a few hours before anyone else made it home for the afternoon.  I use to walk home with a small group from our neighborhood.  One of the members of our walking gang lived a few streets over and was an absolute cutie.  Would always flirt with each other but I hadn’t really attempted a move.  One day I used the afternoon walk home and empty house to try and get lucky.  I invited her over and she accepted.  We were hanging out in my room and things were progressing nicely.  After what felt like an eternity, she had reached into my pants and pulled my cock out..I could have burst at any moment..it was quite the double edged sword.  She lowered her mouth next to the head of my cock and just gently touched her lips to it..let out this huge blow of hot air on me..to this day, it is still one of my favorite memories..\n\nShe asked me if I had a condom..of course..because I’m 16 and don’t fully form a plan..I didn’t..\n\nShe told me that’s too bad..and she said “don’t worry, I’ll be free on Friday..I’ll swipe one from my brother and we will finish this.”.  She reaches up her skirt and slides her panties off..and proceeds to tie them in a bow around my cock.  Shortly after she leaves and I furiously beat my dick like it owes me money.\n\nThat night I’m messaging her on ICQ..and I can’t stop thinking about it.  I log off and it’s late, probably 11-1130.  I assume everyone in the house is asleep.  I reach over and grab her panties..I’m smelling them in so deep..and just wailing away on myself..suddenly, the door opens and it’s my mom..there are no lights on in my room so I just freeze..panties shoved to my nose in one hand, my cock squeezed by my other hand.  The hallway light is on..it’s slightly shining into the room…my mom doesn’t have her glasses on and I can see her squinting to see if I’m awake or not..\n\nSuddenly the door closes..my heart is racing…I felt ashamed of myself.. and then I continued on like any good soldier would do.",
   "created_utc": 1700611291,
   "score": 38,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka7mlux",
   "message": "[removed]",
   "created_utc": 1700600787,
   "score": 253,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka7vhg0",
   "message": "I fapped in the back of my van on deliveries. Was so horny, just parked up, climbed in the back and beat it furiously. Fuck knows what I did with the evidence",
   "created_utc": 1700604005,
   "score": 34,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8fzzy",
   "message": "Anytime family text notifications appear mid porn sesh. Wish there was a porn mode on my phone.",
   "created_utc": 1700612322,
   "score": 211,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka88td3",
   "message": "Not me but my parents and I walked in on my brother...",
   "created_utc": 1700609246,
   "score": 197,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8bgk4",
   "message": "Over a character.ai chat :/",
   "created_utc": 1700610357,
   "score": 132,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka83jfp",
   "message": "Ehhhhhhhh\n\nA lot of them, specially the one where my brother was 1 seat or something away",
   "created_utc": 1700607091,
   "score": 235,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8536c",
   "message": "Fat albert's back titties",
   "created_utc": 1700607704,
   "score": 30,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka88eiq",
   "message": "I matched on a casual dating app, saw a couple of red flags but horny brain activated override and fapped to the mental image of a nude burned into my mind. Still finished, but fuck catfishers and scammers.",
   "created_utc": 1700609071,
   "score": 146,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka86e56",
   "message": "I was 14 at the time, just lost my virginity to a really good friend of mine, well we had to stop (I didn’t get to finish) but that’s a story for another time, my step father came home from work and started yelling at me from down the hall. Well instead of putting on my pants and walking out there she got off my bed and hid from him behind my dresser I wrapped a small blanket around my waste as he walked into my room still with one hand under the blanket and kinda toying with myself because she was still naked. And I could still see her. Well he left to go get cigarettes after yelling at me for another good 15 minutes probably about sobering stupid. Well when he left I asked if she wanted to finish she said no, so I continued on my own, a sweaty gross 14 year old boy jerking off to a 16 year old girl that looked very disgusted. And annoyed… she didn’t talk to me after that, felt very ashamed and awkward from then on.",
   "created_utc": 1700608233,
   "score": 104,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka84r5c",
   "message": "The one where I thought I'd try using toothpaste as lube.",
   "created_utc": 1700607572,
   "score": 52,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka88z7q",
   "message": "Getting caught at 16 by my mom walking in my bedroom one morning. God that was so embarrassing.",
   "created_utc": 1700609314,
   "score": 61,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka7ohgc",
   "message": "my wife’s best friends",
   "created_utc": 1700601470,
   "score": 169,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka7n2u8",
   "message": "That time I masturbated to some furry fetish art/story about a slave owner who punishes one for talking too much by locking her in a permanent iron mask and harness and chains her in some dark cell where she basically lives 24/7",
   "created_utc": 1700600958,
   "score": 162,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka95mkz",
   "message": "When i was younger i had a girlfriend and we were doing stuff in my room, I'm about to finish and i hear footsteps. Immediately i pull my pants up, but I'm still right about to finish. My dad walked into the room and decided that was a perfect moment to start a conversation, while i was actively ejaculating in my pants. The worst part was that that was probably the most I've ever came in my life. I hadnt seen my girlfriend in like a month and was saving up for when i did see her. I started cumming, my dad came in, had an entire conversation with me, and left. It started as he walked in and finished like 5 seconds after he walked out. I'm amazed he didn't notice but more than that i am absolutely pissed off because he ruined the longest most powerful orgasm of my entire life.",
   "created_utc": 1700623558,
   "score": 56,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8fr4j",
   "message": "Post breakup with my fiance.  It was like the saddest most regrettable fap ever.  Specially since I was living in my parents basement again....",
   "created_utc": 1700612215,
   "score": 160,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8pygg",
   "message": "13 yo dumbass me built a \"penis vibrator\" based on st I had read in my stepdad's Playboy. It involved cranking an exercise bike wheel and sticking my erect dong into the moving spokes (like a baseball card!). \n\nIt abraded the top layer of skin off my tip almost instantly (owowow). It led to a truly embarrassing phone call to my Mom and a truly awkward talk with stepdad.\n\nAside from some residual shame (no more than the average American wrt sex) I am happy to report everything works as it should and I lead a fairly normal adult life.",
   "created_utc": 1700616611,
   "score": 52,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8tgxe",
   "message": "Tje one where I wa sleeping back and that shit hit my fucking lips and eye\n\n\nIt was followed by a visceral and terrible shout",
   "created_utc": 1700618122,
   "score": 49,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8xcsz",
   "message": "When I was a kid I washed my penis a bit too hard and that’s when I learned I could make my own soap.",
   "created_utc": 1700619852,
   "score": 50,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8qb1s",
   "message": "I had the house to myself so like any 15 year old I whacked it 9 times til I tore my banjo string... had to fess up when the parents got home because I was doubled over in pain.",
   "created_utc": 1700616760,
   "score": 96,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8dtlo",
   "message": "The 2 times my mum walked in on me. I was more pissed off than anything and I yelled at her to knock next time.",
   "created_utc": 1700611368,
   "score": 44,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka9ejiq",
   "message": "I set up an audio recording device in my living room when I was certain my now ex was cheating on me and wouldn't admit it. So one day I come home from work and check it, and sure enough I hear her let in her boss and they get to screwing around. And it was everything I've ever wanted in our relationship that she always said she\"wasn't into\". Turns out she just wasn't into me and she was more into old married men. So yeah, I fapped a few times to that before and after we broke up before eventually getting over her and deleting it.",
   "created_utc": 1700628070,
   "score": 49,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka83ynv",
   "message": "In highschool me and my friend jerked each other off during a sleepover. It was in my friends room. (We slept in the living room) There was six of us total. The person who's room we were in walked in on us... It was more funny than anything. I do regret it though.",
   "created_utc": 1700607259,
   "score": 82,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8kcr1",
   "message": "This was back in dial up internet days. It took forever for photos to download, but I somehow found a video and was so stoked. Everyone in the video was disgusting, and the quality of the video was so bad it was more like a series of pictures one after another. Anyway, I finished because I was a teenager, and when my mom got the phone bill that month it was like $1000, because of me watching this absolutely disgusting gang bang, and she knew it. No redeeming qualities there.",
   "created_utc": 1700614187,
   "score": 127,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka7tja9",
   "message": "Sissy Hypnosis",
   "created_utc": 1700603290,
   "score": 136,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka96x2w",
   "message": "So uh...\n\nBuckle up.\n\nWhen I was a teenager, I would always try to time my sessions around when my mother was gone for awhile so I'd know she was out and not expected to come back well after I decided to choke it.\n\nExcept once. \n\nI think I took a nap and I woke up without checking the time or bothering to call her (I guess in my defense this was before cell phones).\n\nSo I went at it and found some appropriate material. \n\nUnfortunately, just when I was about to finish my mom was walking through the door. And I zipped up in a panic and ran out to greet her .\n\nUnfortunately, I think I went a little far and as I greeted her walking through the door I proceeded to jizz in my pants.\n\nIn front of my mom.\n\nYep.",
   "created_utc": 1700624175,
   "score": 62,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8jprh",
   "message": "The time I used an empty toilet paper tube as a paper pussy.  Hurt like hell.  Very regrettable.",
   "created_utc": 1700613912,
   "score": 34,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka9dqkn",
   "message": "Found something hot on a sketchy porn site. Gave my computer a virus, a bad one. So bad that I shut it, and walked away completely flaccid. I tried opening it up in safe mode, but I couldn’t. My dad knocked on my door and asked why I was still up (it was 2am, which is odd for me) and I told him that I was fooling around online and clicked on something suspicious. He helped me get rid of it, but not before I realized the volume was on… so when we regained control of the computer, the long and prolonged moan of a juicy prolapsed asshole screeched over the speakers, which my dad stopped, hit the mute button, and said “we just won’t talk about this I guess…”",
   "created_utc": 1700627644,
   "score": 32,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8a3oh",
   "message": "Earlier today.\n\nI got laid later at night, and despite me trying my best (and she trying her) I couldn't finish.",
   "created_utc": 1700609788,
   "score": 88,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka89jin",
   "message": "The one I did after cutting a red chilli pepper, didn't wash my hand enough after cutting it.\n\nNot my best moment.",
   "created_utc": 1700609551,
   "score": 101,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8y0ho",
   "message": "Some girl I saw on google maps in Brooklyn",
   "created_utc": 1700620146,
   "score": 79,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8pnwv",
   "message": "I was having sex, had a problem with finishin up for 30 minutes , my partner started to feel like she wasn't sexy enough for me to finish after trying literally everything and i didn't know what to do to comfort her and then she started crying, i went to grab some tissues for her got some for myself went to the toilet and i did finish in less than 2 minutes ... When i came back to her she wanted to try for a last time to make me cum , i said refused ( i couldn't say that i was able to cum on my own so she doesn't feel bad again ) , she ended up cryin again for thinkin that she messed up and she turned me off ...",
   "created_utc": 1700616484,
   "score": 53,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka89xcp",
   "message": "Was bored watching schindlers list so decided to do the deed, just nicely finished as liam neeson said \"i should have got more out...\"",
   "created_utc": 1700609714,
   "score": 152,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka97una",
   "message": "One time when I was 15 I was dating a girl online. She lived in Canada an I lived in America. ( we now live together) that year for my birthday she sent me a package with all sorts of stuff in it including her favorite bra she snuck in there without her parents knowing. I took the strap off of it am tied it around my dick an proceeded to beat my meat harder than I ever have in my life. The only thing is the lil metal/plastic piece had a very sharp edge on it on the strap an I didn't realize until I sliced my dick open an bleed profusely everywhere. I will say tho. It was very much worth it",
   "created_utc": 1700624636,
   "score": 28,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka9f8sj",
   "message": "Back in the day of downloading porn off limewire….you really never got what you expected. \n\nI remember one video of a dude jacking off on the couch. The camera placement was so far back and you could see so much of the living room that it kinda made sense to my young mind that his partner was going to come into frame. It just never happened….🥲\n\nTdlr; jerked off to a guy jerking off because I was expecting a woman to come on screen soon. She never came.",
   "created_utc": 1700628454,
   "score": 26,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8eg3j",
   "message": "Every fab is a good fap. No regerts",
   "created_utc": 1700611644,
   "score": 87,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8cfxt",
   "message": "Icy Hot \n\nDon't ever ever ever ever ever use it down there. \n\nFirst time I ever screamed in my life.",
   "created_utc": 1700610772,
   "score": 49,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8icee",
   "message": "I once finished looking at the face of my cousin because I had just watched her get the shit fucked out of her in the video. In my defense I did not know it was her when I started the video, but I did not immediately stop when I found out. Family Christmas was never quite the same.",
   "created_utc": 1700613331,
   "score": 61,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka99hnc",
   "message": "When I was 18, I watched porn a lot and I would often use something like a small plastic dipping sauce cup to cum in while I was watching it. So one weekend, my parents were out of town and me and my younger brother who was 15 were home alone and my laptop wasn’t working at the time so while he was busy in the living room playing Minecraft, I went upstairs to his room so I could watch porn on his computer and I looked around his room looking for something to cum in and he has a small trash bin next to his bed and I found a small paper dipping sauce cup and thought it’d be perfect. \n\nAfter I blew my load, I left his room and went back downstairs to watch Adventure Time and from upstairs, a I heard my brother yell “OH MY GOD!!!!!!!!!!!!” And as I was walking upstairs to see what was wrong, he yelled “IS THAT PORN!?!?!?!?!?!?!?!?!?” And I went into his room and he was standing by his computer desk looking at me with pure shock and the porn site was still up on his computer and I realized I pressed the wrong button to close it. I clicked on the button that shrinks it and takes it to the taskbar and my brother also found the cup I came in and he got shocked by what he found and dropped it so the cum was now on the carpet and some of it was on his feet. I had never been so mortified in my life",
   "created_utc": 1700625450,
   "score": 18,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8bv5v",
   "message": "The first one",
   "created_utc": 1700610529,
   "score": 41,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8qr6v",
   "message": "Id say work butt fuck em. boss makes a dollar, I make a dime. Thats why I wank on company time. *edit: spelling",
   "created_utc": 1700616954,
   "score": 58,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka85mln",
   "message": "The one I just did to these comments...",
   "created_utc": 1700607922,
   "score": 103,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8js44",
   "message": "Once when I was a teenager I got an idea and called it a kamikaze rush. Basically you start warming up and when you feel that lil razzle dazzle in your meat you yell for mom and have to do it before she appears in your room. Of course you have to do it unnoticed. It's stupid as shit and my blanket was filthy as a mf. Would not recommend. And yes I was hella weird",
   "created_utc": 1700613941,
   "score": 68,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8ovx8",
   "message": "When I heard the news that August Ames killed herself I did a farewell yank to her stuff. Made me question my own morality for about a week.",
   "created_utc": 1700616148,
   "score": 32,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8buaj",
   "message": "And regrettable faps\n\nI've made a few\n\nI've had my share of sand\n\nKicked in my face\n\nBut I've come through",
   "created_utc": 1700610519,
   "score": 72,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8l9sh",
   "message": "When I was like 12 I was early in school, because the first class was canceled, but I didn't know it. So as I was just chilling in the hallway of the school, a wave of horniness overcame me and I decided to use my chance to make the once in a lifetime experience to masturbate in a school hallway.\n\nSo, I jerked off thrilled by the thought that someone could walk by any second (I looked down a hallway with like 15 doors where classes took place that had the potential of opening up and catching me and there also was a glass door around the corner to my right, that I couldn't see). I finished before someone saw me, but like 2 minutes later my class teacher walked by and I realized how dumb and risky this whole thing was. If someone would've caught me, I would've needed to switch school immediately and probably even beg my parents to move by telling them some fake story that I get bullied or sum.\n\nI never did such thing again, but it was an experience I will never forget.",
   "created_utc": 1700614581,
   "score": 50,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka9kt4w",
   "message": "Back in the day when it would take like 5+ mins to load one image file over dial up, and the image would progressively load from top to bottom. Sometimes there would be packet loss and the image would stop loading like half way through and you needed to start over. \n\nLong story short the image broke, I was too far along to stop and try to reload the image, and I finished to just the top of someone’s head from like mid bangs up.",
   "created_utc": 1700631610,
   "score": 16,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka88kb6",
   "message": "Mom called me downstairs, told her I was c(umming)oming. Can’t lie to mama",
   "created_utc": 1700609139,
   "score": 51,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8rb89",
   "message": "The first time I fapped was when I was around grade 5. I used my mom's phone and searched \"blonde pov blowjob\". I was watching in our garden covered in trees and flowers. I enjoyed it the first half, ngl. But when I was about to nut for the first time in my history, the blonde girl??? stood up and she???? Has a dong. Man she's so pretty... How could this... How.... Why....",
   "created_utc": 1700617195,
   "score": 40,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8tcq2",
   "message": "Let's just say I have a very attractive aunt",
   "created_utc": 1700618070,
   "score": 21,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8oomk",
   "message": "I dunno why I was but I wasnt paying attention to what I was watching while I was doing it, was on my phone , looked up and turned out to be the very last episode of Band Of Brothers…",
   "created_utc": 1700616061,
   "score": 11,
   "submission_id": "180rfzd"
  },
  {
   "comment_id": "ka8oqah",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "180rfzd"
  }
 ]
}