{
 "submission_id": "1821qj6",
 "title": "Redditors who’ve witnessed something that you’ll absolutely never forget, what was it?",
 "selftext": "",
 "created_utc": 1700747839,
 "permalink": "/r/AskReddit/comments/1821qj6/redditors_whove_witnessed_something_that_youll/",
 "score": 14,
 "url": "https://www.reddit.com/r/AskReddit/comments/1821qj6/redditors_whove_witnessed_something_that_youll/",
 "comments": [
  {
   "comment_id": "kafxdec",
   "message": "Tampa Florida 2015. A man and a woman were arguing in the parking lot of a bowling alley. The man shot the woman in the head, turned the gun on himself and pulled the trigger too. The woman died and the man was barely alive. Still not sure if he died. I had front row seat as everything unfolded about 20 feet in front of me. I was so stunned. It happened so suddenly. I'll never forget watching the life drop out of both of their bodies and the woman's lifeless gaze.",
   "created_utc": 1700750050,
   "score": 17,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kag11j3",
   "message": "~40 years ago, SoCal freeway, on my way to work. Close to or in the fast lane. Traffic starts slowing up, I catch a motorcycle rider in my peripheral vision to my right not paying attention. Cars are virtually dead stopped. He rear-ended a car doing probably 65. Head over heels, what appeared to be a hundred somersaults as he bounced all over the freeway. I almost threw up when I saw it.\n\nFast forward a few years, I'm at work somehow chatting with a group of co-workers. One of the co-workers that I had seen but didn't know, also missing his right arm was in the discussion. After some discovery, we both came to the conclusion that it was him that was the motorcycle rider. Yikes. I figured after that he was dead.",
   "created_utc": 1700751694,
   "score": 243,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaghe9z",
   "message": "I watched a man get run over and killed by a monster truck in 2007.  He was the announcer guy for the event and walked right in front of one of the trucks as it was coming back from a jump.  His wife and kids were in the audience and witnessed it as well.  The driver of the truck was one of his friends.  A really sad and horrible situation that I’ll never forget seeing.",
   "created_utc": 1700758391,
   "score": 0,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagcz91",
   "message": "Was at London Heathrow Airport and was waiting in customs. I saw an Asian woman about mid-early 30s sprint towards the express passport line to catch up with family and one of her boobs popped out of her shirt.",
   "created_utc": 1700756635,
   "score": 229,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah1nmc",
   "message": "While working in the pulmanory ward at the university hospital in my town, I got to know this older man in his mid- to late seventies whom I ended up having this grandpa/grandson relation with. We could joke about pretty much anything. The darker, the better. \n\nOnce I came into his room with all his kids and grandchildren present, he said to me:\n- «Alright, Håvard.. So they haven’t fired you yet?»\nI replied:\n\n- «And you’re still breathing?!»\n\nWe both laughed, his family had this big «wtf?» look on their faces, not understanding anything going on between us.\n\nPerhaps a month and a half later, I was working a night shift. And we always visit the patients when we start our shifts to let them know who’s working that night. \n\nHe was sitting on his bed eating a sandwich watching the news on the television. This was around 22:00 (10pm). He seemed fine and everything was great. \nWe talked and laughed and I told him that I’d come back in a few hours, and that he’d call if he needed anything. \n\nAt 02:00 am I made another round to his (and the others) room to (literally) make sure that they are all breathing.\n\nI found him hyperventilating on the bed, I pressed the alarm button and two other nurses came running. \n\nI sat down next to him, he took my hand and squeezed it hard. He looked at me as he started to tear up - obviously scared. Perhaps a minute later his heart stopped and he died right in front of me. \n\nI’ve seen alot of death in my lifetime, but after this incident, I quit my job and never looked back. \n\nI still miss him after all these years.",
   "created_utc": 1700766397,
   "score": 154,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagl03l",
   "message": "About 20 years ago I was driving up the mountains of western Wyoming one morning at the end of a mild rain storm. To my left was a rainbow that appeared to follow me just a few yards away from my car. As I turned a corner, the rainbow seemed to drop directly into a mountain lake. I wish I had found a place to pull over and take it in longer.",
   "created_utc": 1700759822,
   "score": 14,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah807l",
   "message": "While in Singapore, I once saw a toddler sneeze so hard her knees gave way and she fell on her bum.\nIts not particularly exciting but I was suffering from depression at the time and it was the first thing that had made me truly smile in weeks, it still makes me smile now",
   "created_utc": 1700768996,
   "score": 129,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah1hfe",
   "message": "Watching my mom get electrocuted by running over the cord with a lawn mower.   That shit will live with me forever.  For me it was half watching my mom sizzling away (smoke was coming from her hands and her hair) and yelping because the force/power of the electric shock wouldn't let her scream and half the complete lack of help from my neighbors.  I was maybe 6 years old and was SCREAMING for help.  My neighbors all just starred at me but no one helped. I even remember a guy walking by with his dog while I was screaming and pleading that my mom was dying and I needed help and he just kept on walking. I lived in a nice suburb in a nice city and we were on good terms with all of our neighbours.  Taught me VERY early on that there is no guarantee people will help you even if they see what's going on.  Lead to a bit of a hero complex where when I see someone in trouble I immediately run to help regardless of risks to my safety. This isn't me trying to boast but rather that I have a knee jerk reaction now to people in distress bc I know what it's like to ask for help and get 0 response.\n\nShe survived - but had a lot of burns and some heart problems afterwards.",
   "created_utc": 1700766328,
   "score": 84,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kafzk77",
   "message": "Driving across town on Xmas Eve. Sprinting across the yard and into my parent's house to see my mom under a sheet with police all over and my sister sobbing in the corner. It was sudden and unexpected. It shattered us.\n\nI've not been able to enjoy the holidays since.",
   "created_utc": 1700751044,
   "score": 38,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kafxrxu",
   "message": "Car accident and we used to live near a train track that was a famous suicide spot soo I’ve seen a lot of dead bodies",
   "created_utc": 1700750232,
   "score": 91,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahcgxl",
   "message": "I was young, going into 7th grade, when my family moved to a new state. We were at a pool with a pretty big water slide. I was just swimming around underwater with my new goggles having fun when a girl (high school at least, possibly college) went down the slide. She hits the water, top goes up, I saw my first pair of boobs. \n\nA few weeks later, we were at a water park going around on one of those lazy rivers. There's a waterfall you could go under. Another high school/college girl went under it. Boob popped out.\n\nAll I thought was, \"man, seeing boobs in this place is easy!\"",
   "created_utc": 1700770857,
   "score": 90,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagcd0s",
   "message": "The body of a drowned 8 year old boy being washed in on the tide. They found the body of his carer who dashed in after him the next day.",
   "created_utc": 1700756390,
   "score": 142,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah2xr7",
   "message": "Back in the early 90’s a bunch of us we’re coming back from a day long of paintball. We were all pretty bushed, no one talking, just cruising along in the car. As we passed this one car I notice this Mom and her two kids, all of them with red hair and predominantly bucked teeth just laughing their heads off. I didn’t say anything to anyone else or even if anyone else noticed them.\nIt  just struck me as such a nice snapshot of this family really enjoying their time together.\nIt was so endearing I’ll never forget it.",
   "created_utc": 1700766914,
   "score": 253,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagvlut",
   "message": "I was in Iraq in 2003. Of the many things I saw, one that stands out is a suicide bomber that walked up to a vehicle to attack it. He chose an armored personnel carrier which was not really impacted other than being coated with blood and body parts. His head was found nearby.",
   "created_utc": 1700763975,
   "score": 131,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah2cpp",
   "message": "My mom's passing. Had to make the call to take her off life support.",
   "created_utc": 1700766681,
   "score": 63,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kag4e20",
   "message": "Saw a dead moose on the side of the highway, and the volume of blood that covered 3 lanes of highway as a result of it was staggering. That image is burned into my brain forever.",
   "created_utc": 1700753136,
   "score": 54,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagxajc",
   "message": "Had just transferred colleges and was doing homework in front of a window and looked up just in time to see and hear a car run right over a little puppy. The screams from the dog and its owners were agonizing. What made things even worse is that I had posted something about the whole ordeal on snapchat and a friend DMed me saying it was her friend’s dog who broke off its leash and died on the way to the emergency vet.  I think I had a little PTSD after the event because it took me about a month to be able to fall asleep without hearing screaming in my head.",
   "created_utc": 1700764647,
   "score": 60,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah6pyd",
   "message": "I was walking in Manhattan at evening rush hour and a commuter van just pulls over in the middle of the street and a guy goes flying out of the side door. Then the van emptied out and like five  other guys in suits jump out yelling and start beating the shit out of the first guy. This went on for like 20-30 seconds and then everyone except the first guy got back in the van and drove off. The guy who got beat down just stood up and walked off. To this day I badly want to know wtf he did in the van to get his ass beat by his coworkers on the drive home.",
   "created_utc": 1700768468,
   "score": 54,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagi44k",
   "message": "The raccoon lost his sugar Candy 😞",
   "created_utc": 1700758673,
   "score": 4,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahdq8i",
   "message": "There was a wreck in front of me once. A teen girl who was not buckled in smashed her face into the windshield and proceeded to bleed out through her smashed face. \n\nHer boyfriend was injured too but was sitting up beside her crying and obviously losing it as he watched his gf die. I wasn't really able to do anything related to getting her airway open or stopping the bleeding due to the nature of the injury. I tried but was also just talking to them to try and just help them feel like they weren't alone in this moment before the ambulance got there (just in case she had any awareness at that point). Ambulance got there pretty quick but she didn't make it.\n\nI still think about that boy sometimes and hope he's doing ok now and somehow found a way to move on with his life. I can't imagine what that was like for him...",
   "created_utc": 1700771393,
   "score": 47,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagwm13",
   "message": "My cousin on my mom’s side was supposed to be babysitting me, he decided to bring me along with his big homie (he was trying to get into MS-13), they ended up pulling into a parking lot, just chilling and talking, a rival recognized their colors, shot his friend several times point blank, pointed the gun at me and realized I was just a kid (six years old at the time) then ran. I blocked out a lot of what happened after the next few days, I just remember my cousin giving me a bath and making me repeat that nothing happened and I wouldn’t tell my mom. 21 years later, she still doesn’t know.",
   "created_utc": 1700764375,
   "score": 193,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaftbt9",
   "message": "The local train yard being blown apart over the course of a day as munitions on an overheated freight train began cooking off. It was solid entertainment that day. There was one hell of a lot of property damage, but no deaths.",
   "created_utc": 1700748117,
   "score": 127,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah1p29",
   "message": "An organ harvest. It was the most amazing and heartbreaking thing I've ever seen. Watching a patient flatline and doing nothing goes against every instinct that I have, but because of their donation multiple other people's lives were fundamentally changed for the better.",
   "created_utc": 1700766414,
   "score": 149,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kafv507",
   "message": "Hawk eating a pigeon alive.",
   "created_utc": 1700748996,
   "score": 39,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah5cya",
   "message": "This is a dark depressing one, but my friends toddler died suddenly at the end of 2020, so family only in the church for the funeral. All me and the rest of us could do was stand by the graveyard when they arrived at it after, and I'll never ever forget the screams of anguish as he was being carried in",
   "created_utc": 1700767906,
   "score": 37,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kag21a7",
   "message": "Not in person but back in the early 2000s(2005ish maybe?), I was cruising efukt and, I don't remember the title, but watch this one video where a man was walked into an integration room. Cop asks if he needs anything, man says some water. Cop comes back with a bottle water and walks out. Man take a few sips, sits back and pulls a gun.puts it to his head and boom. Slumbs down and cops come running in freaking out and trying to figure out what happened(its obvious) then asks if anyone patted him down then the video cuts. To this day I can still hear the gurgling of air going in while blood goes out and see it vividly. Oh the internet.",
   "created_utc": 1700752124,
   "score": 70,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaft6zf",
   "message": "Just a dead guy in the middle of the road. Dressed up really nice, grey suit. There was a car not too far from his body, I assume the driver was standing beside it. The driver was clinching his own head and breathing very heavily. I assume he was panicking because he accidentally ran over the other guy",
   "created_utc": 1700748052,
   "score": 96,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kags3qg",
   "message": "While driving one day a bunch of cars started slowing down and rubbernecking a car wreck, of course I was doing the same thing. When I drove by there was a damaged car, a motorcycle on the side of the road and the body of the motorcycle rider. A few feet away was the motorcycles helmet. And there was blood, lots and lots of blood.\nThat night on a local news was a story about the wreck.  Apparently the motorcycle and car hit, the motorcyclist was wearing his helmet and was decapitated, he died on scene.\nI stopped rubbernecking car at wrecks after that.",
   "created_utc": 1700762617,
   "score": 30,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagy7ru",
   "message": "Downtown Portland Oregon.  I was on the Max and I saw a guy walking on the sidewalk with a goat.  The goat had, like, saddle bags?  It was a city pack goat.",
   "created_utc": 1700765016,
   "score": 36,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahcr2p",
   "message": "My significant other's attempts at ending his life, and finding him right after the last one that was successful. I'll never get those images out of my mind and the feeling I had when I couldn't save him and the paramedic being super non-chalant about him not making it. Worst day of my life and so traumatic. Wouldn't wish that on my worst enemy.",
   "created_utc": 1700770973,
   "score": 31,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahreuo",
   "message": "Watching the Berlin Wall fall the day I was at guarding it.",
   "created_utc": 1700777388,
   "score": 34,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaggj0d",
   "message": "Lady at a taco truck trying to carry an armload of tacos back to her car, she stumbled and the tacos went flying, the horror, I still have nightmares about this.  I send her a card every year on the anniversary of that horribly dreadful day.",
   "created_utc": 1700758052,
   "score": 107,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kafssdm",
   "message": "NSFW added due to the possibilities",
   "created_utc": 1700747852,
   "score": 56,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagj2mz",
   "message": "Late 2019 I was 18-19 years old. And I was going to a motel to buy coke from a guy I had never bought from before. But had a good friend vouch for. \n\nI showed up at the place and texted him to say I was there, walked inside and up to the door. But the person who answered was not at all the person I was supposed to meet, which spooked the fuck out of me at first. \n\nBut then he said he was at the gas station right now but should be back in a minute. So I walked inside the room to wait for him. \n\nAfter I walked in, I saw tin foil and baggies everywhere with all sorts of rocks, powders, weed, and pills all over the fucking place. \n\nThere were two double beds on the right. And on the right side bed was two girls who looked kinda small and young to me. \n\nDidn’t take long for me to realize they were definitely younger than me..  and I was 18/19 years old at the time mind you… \n\nI sat down on the edge of the other bed and pulled out my phone to text my guy and some other people. When the dude that was there started making out with and getting frisky with the girls. \n\nI thought for sure they’d be more.. terrified and scared but it was like they were completely pacified, and didn’t even really make so much as a noise.. \n\nIt was horrible.. \n\nI stood up and said i was leaving to wait in my car. So I opened the door… and right there in front of me was a female cop. Who pulled me out into the hallway to ask me questions. \n\nThey let me go before going into and checking out the room much.. which I’m thankful for because I could have had my life ruined forever if I was bunched-in with the other guy.. \n\nI saw it and was there for about 20-30 minutes total. yet walked away completely unscathed.. physically at least. quit coke a week later and I’ve only done it one time since then in the past 3-4 years. \n\nI had nightmares for a long time about this. Took a few years of therapy to fix and even now I still dream about some really fucked up shit sometimes.",
   "created_utc": 1700759057,
   "score": 97,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaglsqt",
   "message": "I was traumatized when I was unlucky enough to watch \"Unedited Footage of a Bear\" while it was broadcasted on television",
   "created_utc": 1700760135,
   "score": 24,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah5n1a",
   "message": "This is also my earliest memory. I was 3 1/2 years old when a red-hulled freighter washed up on Quincy Beach after a strong winter storm. The family drove to view it and it struck me that this giant red ship was the largest thing I'd ever seen and of course it was so out of place. \n\nIt's been 67 years now, so I doubt I'll ever forget this.",
   "created_utc": 1700768021,
   "score": 27,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah7ip6",
   "message": "Watching my husband give the order for the nurse to turn off his 50 year old mothers life support",
   "created_utc": 1700768799,
   "score": 26,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah9xe5",
   "message": "I was in High School sitting in the front row and next to me was another student who was a constant smartass. One day he said something that really pissed off the teacher, who happened to be a football coach. The teacher grabbed him and pulled him out of his desk, which was one of those combo desk/seat type. I watched him drag the kid and desk together a few feet and then once he had him up he started pushing him towards the door while yelling at him to get the fuck out of his classroom. The kid turned around quickly and held up his fist and when the teacher saw this he went full Mike Tyson on the kid and started delivering lefts and rights to his face and body and they were literally about a foot in front of me. The entire class watched in stunned silence and the kid managed to get away and run out of the classroom. The teacher then turned to us and spent the next 10 minutes yelling at us in a rage about how you can only push someone so far and so on. We were all terrified and thankfully the end of class bell rang and we left, completely stunned.",
   "created_utc": 1700769791,
   "score": 29,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaggos1",
   "message": "Drive-in movie theater. I do actually forget what movie we were watching. But what I will never forget are the lights that appeared in the sky next to the screen. They didn't have a definite shape and just twinkled there for a second before shooting off into the sky at an impossible speed. I thought I had imagined it until I heard someone near me make a comment about them too. Not saying it was extraterrestrial in nature but it's the closest thing to it I've seen. To this day I have no idea what it could have been.",
   "created_utc": 1700758114,
   "score": 20,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah37fw",
   "message": "Tampa Florida, Late 90s. Was coming out of my apartment, cop ran past me, chasing a guy. Guy turns, shoots cop in face. \n\nI freaked, slammed door, called 911.\n\nGuy kicks in a neighbors door and holds them hostage for hours. He finally gave up.",
   "created_utc": 1700767021,
   "score": 22,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah0457",
   "message": "I was 6 years old when my Family and I were driving to a relative's house at a really cold morning at 4am, when we happened to pass by an ambulance and they were inspection the body of a man that have just died freezed with his body in fetal position and his eyes open.\n\nNever forget his deep lifeless black eyes.",
   "created_utc": 1700765773,
   "score": 19,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahjs1w",
   "message": "At the World Science Fiction convention in L.A. in 1984, we were making paper airplanes and tossing them out of our hotel room window. We were on the 11th floor, so there was a good bit of airspace for the planes. I made one really good one, and let it fly. It was almost a perfect flight, it made it all the way to a grassy area next to the pool at the hotel next door. There was a cat sitting there. The plane, silent and deadly, landed right behind the cat. That cat jumped, literally, six feet in the air. It was hilarious. I wish I could have filmed it.",
   "created_utc": 1700773985,
   "score": 39,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahoec7",
   "message": "My dad trying to strangle my mom to death when I was 5",
   "created_utc": 1700776041,
   "score": 17,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagdm7y",
   "message": "Two goats fucking 😭😭I was in school and we had a small zoo",
   "created_utc": 1700756893,
   "score": 14,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagu4ak",
   "message": "Old lady flying through the air after being hit by a car. What a sound.",
   "created_utc": 1700763392,
   "score": 16,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah6bau",
   "message": "I'll go one good, one bad. \n\nI was traveling New Zealand, and had planned around seeing as many LOTR/Hobbit film sites as I could. \nI hiked into the base of the Lonely Mountain. Had the whole place to myself. Absolutely incredible, one of the greatest moments of my life. \n\nI was wildland firefighting, and all of the sudden there was panic on the radio. It goes dead silent (on site, and radio), then there's an emergency call for first aid,  and a heli request, something to do with the faller we had on site. I look across the field to where I know he's working, as I heard his saw shut off a minute before. Then he comes walking out, covered in blood just staggering around. A widowmaker branch had come down and tagged him on the head. There was a lot of red. \nHe did make a full recovery.",
   "created_utc": 1700768301,
   "score": 16,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah6nqm",
   "message": "I witnessed a 18 year old get shot and killed in Parkville/Towson MD",
   "created_utc": 1700768442,
   "score": 15,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahn5go",
   "message": "Was working on hospice. I had a little old lady who liked me to visit her every couple weeks, mostly just to chat.  Her family moved her to a nursing home, and I told her that I would still come by and see her there. She had a private room all to herself.   \n\nOn one of my first visits to the nursing home, I asked her if I could bring her anything, and she said a chocolate bar and a bottle of Coke, bc they had neither at the nursing home. So it became our routine, every other Wednesday afternoon at 3 pm I'd be there with a Coke and a candy bar. \n\nSo on this one Wednesday I come in and she's lying down in bed. I tried to wake her to tell her I was there, but she just sorta mumbled that she was tired and didn't really wake. I walked around the facility for a bit to kill some time to see if she would wake, but if anything, she was even deeper asleep. So I left the Coke and the M\u0026amp;M's on her dresser with a note saying that I was there and that I would see her again in 2 weeks.  I did my documentation for the job that I was there, and then I headed out to the parking lot. I had been there a total of maybe 30 minutes. As I'm opening my car door, my boss calls me and says \"we got a death; I need you to go there and stay with the body till the funeral home comes,\" (regular hospice policy). I ask for which patient at which address and she says *the name of the nursing home I'm at* and *little old lady's name.*  At that point I started crying and saying there's no way that she's dead, I was just with her. I was just with her. Apparently, I had talked to little old lady just as she was passing away. I went back in and sat with her body till the funeral home came for her.",
   "created_utc": 1700775481,
   "score": 16,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah453c",
   "message": "Around 5AM a few years ago in UK, it was still pitch black apart from a few street lamps around. I was walking to the bus stop, one other person nearby.\n\nThe entire sky was lit up with thousands of meteors, it was a sight to behold forever, I'll never ever forget it. How small it made me feel, but also the endless beauty of the universe we live in.\n\nThere was just so many, and the sad part about the person near me.. They were stating at their phone the whole time. They missed possibly one of the most, in my opinion, awe inspiring things I'll ever see.\n\nI often think about just how many meteors there were that night, I've never seen anything more than one before or after. Wish you could have all shared in the beauty of it.",
   "created_utc": 1700767401,
   "score": 53,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaftpdj",
   "message": "Childbirth",
   "created_utc": 1700748304,
   "score": 41,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagaw1l",
   "message": "The sound as I cut the umbilical cord of each of my sons.",
   "created_utc": 1700755802,
   "score": 39,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah2o6z",
   "message": "Watching a private stream where a family friendly content creator in need of money masturbated for her audience. It's a long story",
   "created_utc": 1700766809,
   "score": 14,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah6re1",
   "message": "Part of a plane falling out of the sky after a mid-air collision.",
   "created_utc": 1700768484,
   "score": 12,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagvbrs",
   "message": "My next door neighbor shot and killed 2 police officers basically in my front yard. So that?",
   "created_utc": 1700763863,
   "score": 13,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah8ae2",
   "message": "About 20 years ago I saw a guy get gunned down in front of me.",
   "created_utc": 1700769110,
   "score": 13,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahx3k5",
   "message": "My hometown is notorious for suicide by train, because on the other side of town there are multiple mental and drug abuse institutions. Once I was smoking a joint with a mate on the train platform when a small (around 1,60 cm) woman was standing next to us. One or two minutes before the train arrived she jumped on the track and just sat there. Me, my friend and another bystander pulled her of it. But the thing I will never forget was the absolute strengt that woman had in her body. We were holding her down with 3 people until the police came but she was just so abnormally strong, se almost got loose from our grip like 5 times. I guess that came from the willpower to kill her self. Sometimes I wonder what happened to her and if she is still around.",
   "created_utc": 1700779986,
   "score": 12,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahbj33",
   "message": "Heathrow airport about 15 years ago going through security. An elderly Sikh couple were having their carry on bags inspected having raised concerns during the xray. When they opened the suitcase it glowed gold like Marcellus Wallace's briefcase in Pulp Fiction. Except it was packed entirely full with tubs of \"I can't believe it's not butter\".",
   "created_utc": 1700770460,
   "score": 23,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahefzh",
   "message": "Watched two camp counselors fuck on the floor in front of me when I was 12.\n\nIt was at summer camp and I was spending the night on the couch in the camp counselors residence before going home early. I had a macrame blanket over my entire body including my face so I could see through the holes in it. She acted reluctant about doing it in front of me but gave in and road him for all she was worth. The intensity of it impressed me.",
   "created_utc": 1700771700,
   "score": 11,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahw9vg",
   "message": "Waking up from a Coma.\n\nAnd to answer any questions I sometimes get when I say this:\n\n* No,  I don't remember any of my time in the Coma.\n* No, I couldn't hear things going on around me.\n* No, I did not dream. But I've been told I cried. Just tears, not wailing.\n* Yes, It was scary when I woke up, but the fear was followed by a feeling of helplessness and acceptance. Which was strangely calming.\n* Yes, It felt like time had passed before I was told I was in a Coma, but it also felt instant at the same time.",
   "created_utc": 1700779605,
   "score": 10,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagii18",
   "message": "A raccoon being skinned alive for its fur on a Chinese fur farm, then thrown into a dumpster - still alive...",
   "created_utc": 1700758827,
   "score": 43,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaglp70",
   "message": "My friends and I when we were like 15 noticed this one woman who moved in to our neighborhood, actually on the side of our block. She was all, at least 5'9\" or 5'10\" with banging body and always pushing a baby carriage. Best way to describe her she was a fit big passed and big titted version of Mortician Adam's but she was stacked like Christina Hendricks.\n\nAnyway one day we are playing outside by her apartment when we hear loud moaning and lots of 'oh gods' coming from an open window. So all of us perverted fucks sneak a longer a few minutes peek to see her getting rammed by her bf/husband.\n\nThe weird part is while enjoying the show, they both looked at us and smiled. So the question now is who are the real perverts lol",
   "created_utc": 1700760096,
   "score": 39,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahb6rs",
   "message": "A snake eating a frog. Like the outline of the frog was in the snake’s throat? Esophagus?",
   "created_utc": 1700770317,
   "score": 10,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahklei",
   "message": "Used to work at a biohazard waste processing plant. We used a big machine called a hydroclave to sanitize and pulverize everything. This thing was old and has to be coaxed into unloading its contents proper. Two man job; One guy on the floor with a crowbar reaches in to work up any tangles (like wires, bedding, etc), before calling up to the guy on the deck to cycle the machine to keep unloading it.\n\nUntil the dumb motherfucker on the floor decides \"I'll just do that with my hand.\". Naturally, as you grunt and groan to try and pull a clog out, the guy on the deck thinks thats his signal to cycle the machine. \n\nI've never seen a hand-less person run so fast out of a building before.",
   "created_utc": 1700774345,
   "score": 9,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahqt5v",
   "message": "A rocket launch at the Kennedy Space Centre. It was a childhood dream to see one in real life - you couldn’t wipe the smile off my face for days after.",
   "created_utc": 1700777117,
   "score": 11,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahy0eg",
   "message": "When I saw a pigeon slip over on some ice. I swear that if I die tomorrow I have had a life well lived after witnessing that.",
   "created_utc": 1700780412,
   "score": 10,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaft7wf",
   "message": "A rabbit eating a bird",
   "created_utc": 1700748064,
   "score": 20,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kafv9ab",
   "message": "blood spraying out of my dick bc my pee string ripped during sex.",
   "created_utc": 1700749052,
   "score": 21,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahmla7",
   "message": "Stumbling across a guy on his last few breaths covered in blood.\nCouldn't see where it was coming from to even attempt first aid.\n\nFound out from the cops a few days later that he'd been at a party and got kicked out and punched a window on the way out and in turn cut himself from wrist to elbow.\nTried walking home 2km instead of going to the hospital a few hundred metres away.\n\n\nAlso giving first aid to a shooting victim. Him and another guy were sitting in the salon below my apartment and the other guy pulls a gun and shoots him. I heard the shot and screams and went downstairs and everyone was just staring at the victim and doing nothing. Had to help until EMS arrived.",
   "created_utc": 1700775231,
   "score": 9,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahnvoi",
   "message": "I was boogie boarding in the ocean with my dad in North Carolina. We were sitting in waist high water when a massive shark fin just casually cruised right by us. That was the end of the day’s festivities.",
   "created_utc": 1700775811,
   "score": 8,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagyaid",
   "message": "I have 2. serious one. was waiting to cross the street and saw a Motor bike t bone a car and the biker go flying about 30' before hitting the ground and sliding another 60'. I don't think he lived \n\nthe funny one. was eating lunch in high school at a sandwich shop. group of guys I am with are all laughing and joking around. one of them says something stupid and another just whips his egg salad sandwich at him and it exploded off his face. I couldn't stop laughing at the sight of the sandwich hitting him in the face",
   "created_utc": 1700765046,
   "score": 8,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah6vvy",
   "message": "A class trip to the Bronx zoo in 6th grade, silver back 🦍 2 were fighting and the 3rd was vigorously jerking off. A bunch of 6th graders, and teachers and parent chaperones. We all went in 😊  and everyone walked straight faced and 😶",
   "created_utc": 1700768537,
   "score": 7,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahtw5a",
   "message": "Walking home from high school a couple kids raced their cars down the street. They hit a girl crossing the road and she slid down the asphalt. There was no friction; it looked like a water slide. She came to a stop under a parked car after about 50 feet of sliding.  I was a freshman, walking with my twin sister. My sister was traumatized so I just made sure to get her home. This was immediately after school and barely off school property, so there were at least 50 people around.",
   "created_utc": 1700778507,
   "score": 7,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahxw4b",
   "message": "Two total solar eclipses. It's pretty amazing.",
   "created_utc": 1700780357,
   "score": 8,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah43dl",
   "message": "A loved one getting hit/run over by a truck (they survived 🙏)",
   "created_utc": 1700767381,
   "score": 7,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah7k47",
   "message": "A bombing of nearby relay station by two  bomber aircrafts. It was during the 1999 NATO bombing of Yugoslavia, and my family moved to the village in order to evade potential consequences, we felt way safer in the village than in the city.I was 8 at that time and it was during the lunch time. The bombing place happened approximately 2 kms straight line from our place. I was eating a soup and out of sudden two black aircrafts came from the sky and dropped several bombs on the relay. It was a pretty hard explosion and a black fog and the fire came soon after. I remember I dropped my spoon out of shock while my grandpa, who remembered WWII quite good, just smiled and said it's nothing. After that I was scared AF every time the sirens alarmed for incoming planes.",
   "created_utc": 1700768815,
   "score": 7,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaht84d",
   "message": "My buddy hit a sparrow out of the air with a golf ball. Unbelievable.",
   "created_utc": 1700778200,
   "score": 6,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahunrt",
   "message": "I must have been around 15, I was outside, at daytime, and saw a group of people all staring up and pointing to something in the sky.  I turned around and saw a 747 piggybacking a space shuttle, flying low (it had just taken off).  I lived in Canada so was NOT expecting to see a freakin' *space* *shuttle* fly above my hometown, ever.  I will never forget that.",
   "created_utc": 1700778861,
   "score": 7,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagg3p5",
   "message": "Someone beheading a chicken on the sidewalk.",
   "created_utc": 1700757883,
   "score": 7,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah4om6",
   "message": "My first call as a firefighter, person wasnt seen for a while, we got called to check on them, didnt open the door themselves to we \"breached\" it, i pulled the lock, opened the door, first thing i see was an already decomposing body, not very nice to see",
   "created_utc": 1700767628,
   "score": 6,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahf8qa",
   "message": "I saw a guy get hit by a regional rail in Philadelphia. He got thrown about 30 feet and then got up and tried to walk away.",
   "created_utc": 1700772039,
   "score": 6,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahm3jc",
   "message": "Seeing a motorbike accident on the FDR where the rider hit a car, flown off his bike, hit the lamp post in the divide and chopped in half.  His torso and entrails spread 50 yards up the other side of the FDR, and his lower half, legs, feet, all separate on my side, strewn all over the road.  Not somehting I want to experience again.",
   "created_utc": 1700775013,
   "score": 6,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahugpg",
   "message": "Some guy in Wroclaw grabbing some women by the hair and smashing her head into the concrete wall. I saw how her nose and jaw were sideways.",
   "created_utc": 1700778770,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahuz88",
   "message": "This was a while ago back in school\n\nI'm friends with a girl who has quite a few mental health issues, most notably being autism and BPD. Our friendship tends to be a bit rough because she has BPD but I always tell her I don't hold it against her. I was walking down the hallway and she was a few feet in front of me walking to her next class. She told me to stop talking to her the day before so I figured I would give her a little time to cool down so I just stayed walking behind her. This one kid who is notorious for picking on everyone starts trying to bully her so I immediately step in to help her out. For whatever reason, as soon as he notices me walking up to him, he hits her in the face about 3 times. I ran to him and pushed him away from her and some other kids started to restrain him. Then I went over to her and she was absolutely terrified, completely shaking and crying nonstop. I sat down next to her and started doing whatever I could think of to comfort her so I wrapped my arm around her and kept telling her that she was safe now. I walked her to her next class and somehow wasn't bitched at for being 3 minutes late to class.",
   "created_utc": 1700779005,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahwygl",
   "message": "I was driving with my mom along a really rural rode at like 6:30 in the morning, so it was still dark out, when I looked out my window and see a car on fire on the side of the rode. There was no one there, it was just the burning vehicle. It took forever to get the smell of smoke out of our car.",
   "created_utc": 1700779920,
   "score": 6,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah7cw1",
   "message": "Being with my father as he passed away (he was dying and hospice was there so it was an end of life deal). If that wasn't enough my mother had some odd idea that we should dress him before the funeral services people arrived. By the time we got over the shock of his passing rigor mortis had set in. Lot of first experiences that day.",
   "created_utc": 1700768736,
   "score": 6,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahgi7o",
   "message": "I saw a hawk hunt a pigeon out of the sky and slam it into a wooden fence. It was pretty rock and roll",
   "created_utc": 1700772572,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahilfk",
   "message": "When I was about 6, my sister and my mum and I were walking back to the bus stop from a dentist visit. It was early evening and dark. Someone was run over by a car just up the road. We were facing the other way so I didn't see it happen, but when I turned around, I could see the silhouette of the car with this long, flat thing lying in front of it, and my immediate thought (in my random kid brain) was that the car's tyre had 'split open' and rolled out flat on the ground rather than being around the wheel. It was only the horrified screaming from someone who was with the victim of the accident that clued me into what had really happened. No idea if the person lived or not, but that bizarre image of a silhouetted car with a 'long, flat tyre' in front of it is seared into my brain.",
   "created_utc": 1700773469,
   "score": 4,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahinqw",
   "message": "Someone crawling asking for help then dying after getting shot multiple times in a gang shooting.. Can't unsee or unhear it.",
   "created_utc": 1700773496,
   "score": 4,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kag8g1z",
   "message": "Fatal car crash",
   "created_utc": 1700754815,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahaoob",
   "message": "In july 2002, I witnessed the plane crash above the Bodensee. I was at a youth vacation camp in that area at that time and we were sitting around a campfire.\nOne girl suddenly exclaimed \"oh look, fireworks!\", and pointed to the sky. We were seeing a small yellow-reddish spot, which slowly expanded and stretched out to form some twisted line before fading. Nobody had any clue what we saw.\nThe next morning we were told, we saw two planes colliding and exploding.\n\nHere is everything in detail:\nhttps://en.wikipedia.org/wiki/2002_%C3%9Cberlingen_mid-air_collision?wprov=sfla1",
   "created_utc": 1700770103,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahcr3b",
   "message": "I was waiting to turn left onto a busy North/south road. A school bus was in front of me and was going through that intersection into a parking lot across the street, the bus was stretched across the two northbound lanes and the tail of it was in one lane of South bound traffic. A guy in a little red car was speeding south bound and I believe was texting when he crashed into that bus. I saw his face in slow motion hit the steering wheeling as the car crashed. People in the parking lot ran to help him. It was horrible.",
   "created_utc": 1700770973,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahewpv",
   "message": "Driving down a freeway during an absolute downpour, I see some guy come flying up behind me me and switch the the left lane. Only, it’s wet and homeboy is doing at least 85. He hits the median and the car flips and rolls twice. I pull off and call 911 and during the call see the guy crawl out of the car hop the median sprint across the opposite side of the highway and off he goes. I left the scene after that wtf was I gonna do.",
   "created_utc": 1700771896,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahgvt3",
   "message": "Creepy: was driving down a road at night that crossed a bridge with a low guardrail. A deer ran across at an angle headed towards me, \u0026amp; jumped over the rail off the bridge. That drop is at least 200ft. My friend theorized the deer had some sort of disease making it act erratically, \u0026amp; idk if that's more terrifying or not.\n\nFunny: in the McD's drive-thru 2 cars away from the pickup window, \u0026amp; I saw a guy climb out the window of the car in front of me to sit on the roof. A second one reaches out to pull him in, but he's insistent that it's too damn hot in the car. The driver leans half out of their window laughing his ass off. When they finally get their food the guy on the roof takes one of the bags, the car pulls into the lot nearby \u0026amp; parks. All I can hear is laughter as all 4 doors open \u0026amp; a pack of 20-something boys pop out.",
   "created_utc": 1700772730,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahicw2",
   "message": "Once saw a car hit a big dog and it slid on its side/back across the road for a good 30 feet.",
   "created_utc": 1700773366,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahlsrc",
   "message": "Found my father-in-law dead of a heart attack in his bathroom. He lived alone. Happened on Boxing Day. He was 72 and very overweight. Sad.",
   "created_utc": 1700774878,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahnavo",
   "message": "My neighbor from across the street was murdered and his house burned down.\n\nI woke up from a nightmare that it was happening only to find out it was real.",
   "created_utc": 1700775550,
   "score": 4,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahogpa",
   "message": "Witnessed a guy wrap his truck around an El Train Column in Downtown Chicago. Im the one who called the ambulance.",
   "created_utc": 1700776069,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahrv2o",
   "message": "My brothers suicide attempt. I remember every moment of it. I'm glad I was there to keep him here.",
   "created_utc": 1700777590,
   "score": 4,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahtkeg",
   "message": "When i was about 8 years old my mother was taking me to my kickboxing training. We were driving thru this little town and some reckless dudes on a bike drove past us really fast. Next thing i see big truck just smokes them. One dude got instantly killed and the other one ran away.",
   "created_utc": 1700778356,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahv2jk",
   "message": "A boy hit by a car. The blood covered a big meter square. \nHis brother crying asking again and again to his grandma if he would love. And the grandma answering with obvious lie.",
   "created_utc": 1700779048,
   "score": 4,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahxsgc",
   "message": "We were on the highway heading towards the American border near the niagara falls area\nTraffic is piled up and there are sirens. We drive past... I see a body laying on the road splayed out in  an odd position and further along somebody knelt over. \n\n my mum and step grandma get out, because they're nurses. They come back after the ambulance arrives. Shake their heads and just say what a shame it is and how sad it is.\n\nSomehow one of the riders had been beheaded. the other was relatively uninjured but concussed.",
   "created_utc": 1700780309,
   "score": 4,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahyb7v",
   "message": "My uncle was hit by a car in the street in front of our house, and his leg landed in our front yard. He didn’t make it",
   "created_utc": 1700780552,
   "score": 5,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahlue2",
   "message": "Arrived home from school, my step dad had picked me up. We walked into the house and one of our dogs ( Dixie) growled at us. It wasn't her fault her hair was over her eyes.  My step dad thought he'd teach me a lesson in loyalty that day. He said once a dog growls at you it has to go. He grabs the dog tells me to follow. He pulls out a derringer and shoots her in the head. It all happened so fast I didn't have time to react. He had me dig the grave in the back yard. I'll never forget the red blood pouring out. Fuck that guy.",
   "created_utc": 1700774898,
   "score": 9,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah1v5z",
   "message": "Went to go buy some fast food one night and right there at the stop street was a guy I knew from school just a few years back begging on the road. I couldn't bear to look him in the eye so I just covered my face from him. Crazy.",
   "created_utc": 1700766482,
   "score": 7,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kai5yqm",
   "message": "Trump getting away with insurrection, crimes that would land any of us in jail for life, and he is still going to get on the ballet to be present again.",
   "created_utc": 1700784311,
   "score": 9,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kagxafu",
   "message": "In a line of slow moving traffic passing the aftermath of a multi-vehicle crash, one of which was a white flat-bed truck. The door was crumpled inwards but what stuck with me most was the blood on the outside of the driver's door.",
   "created_utc": 1700764646,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kah4b7x",
   "message": "I saw my coworker blow his arm off in an industrial accident that was the result of a HP hydraulic line rupturing.\n\nBlood, lots of blood.",
   "created_utc": 1700767471,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahbrcr",
   "message": "A huge rain spout or tornado as I entered the Texas panhandle…it looked like the Mindflayer from Stranger Things.",
   "created_utc": 1700770559,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahcnt2",
   "message": "Saw a leg by the base of a tree.\n\nI was 7 at the time.",
   "created_utc": 1700770935,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kaher4q",
   "message": "The blood on the floor of a neighbors house after she fell from a ladder getting a compound Femur bone fractured and nearly bled to death but survived because we heard her screaming.",
   "created_utc": 1700771832,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahhc98",
   "message": "The last total solar eclipse of the 20th century. August 1999 on Dartmoor, Devon, England with my new girlfriend (now wife of 23 years).\n\nSeeing the shadow of the eclipse swallow up the countryside in front of us as we sat up on one of the tors was spine tingling. Then almost pitch black as we looked at the eclipse (through a filter) before the light came back again, as the shadow swept away.",
   "created_utc": 1700772923,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahjv82",
   "message": "Glowing fungus",
   "created_utc": 1700774024,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahk3bb",
   "message": "Someone unaliving themselves",
   "created_utc": 1700774123,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahmksa",
   "message": "Serbian IFBB bodybuilders instagram live stream, friend sent me it as he was showing his beat up ex girlfriend, his son(baby) on the floor crying and then live-streamed as he shot her in the head point blank, leaving the scene and leaving the baby on the floor. He live streamed 2 times after that explaining he shot and father and a son, and that he is waiting for cops to kill them too. A hero gunshop owner gave him blanks when he robbed him.",
   "created_utc": 1700775225,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahyly3",
   "message": "I was still living in Baltimore at the time and I was taking the bus to college. I’m half-asleep, resting my head on the window and….I see out the window this random bull just strutting along down the road like he was on the way to work. A minute later cop cars sped by.",
   "created_utc": 1700780694,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahyo35",
   "message": "I was an on-site witness of a car accident. Drunk driver drove through a bus stop full of people. 5 young students died, four on the spot. A boy on the bus stop was in shock, his friend died and he was calling somebody on the phone just saying \"he killed him.\" I'll never forget the backpacks and notepads strewn around on the grass. I'll never forget face of the dead boy. It was so tragic and preventable.",
   "created_utc": 1700780722,
   "score": 3,
   "submission_id": "1821qj6"
  },
  {
   "comment_id": "kahoyn6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1821qj6"
  }
 ]
}