{
 "submission_id": "1827vp3",
 "title": "What is today's a juicy Thanksgiving drama?",
 "selftext": "",
 "created_utc": 1700764762,
 "permalink": "/r/AskReddit/comments/1827vp3/what_is_todays_a_juicy_thanksgiving_drama/",
 "score": 206,
 "url": "https://www.reddit.com/r/AskReddit/comments/1827vp3/what_is_todays_a_juicy_thanksgiving_drama/",
 "comments": [
  {
   "comment_id": "kai11bd",
   "message": "My relatives are arguing over my great aunt’s estate.\n\nI couldn’t care less, but everyone else is fighting with the family member who served as the executor to the estate.\n\nMy grandma is also being scammed by someone she thinks is an army general. She is constantly fighting with my aunts and uncles about whether or not he’s real, and why it’s okay to send him a grand at a time when she has it.\n\nI stayed away from that mess this year.",
   "created_utc": 1700781862,
   "score": 0,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kah0v5c",
   "message": "[deleted]",
   "created_utc": 1700766077,
   "score": 69,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai7e09",
   "message": "My cousin was recently converted into being a flat earther and wanted to argue with people",
   "created_utc": 1700785009,
   "score": 91,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai2033",
   "message": "Dog jumped on the table and ate a turkey leg",
   "created_utc": 1700782338,
   "score": 133,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahkn7s",
   "message": "I found out yesterday that my BIL and his new wife are accusing me of domestic violence through a completely unmerited source. The source allegedly saw me strike my wife while having an argument in the parking lot of a wedding and caused my wife to have a black eye. Even though an hour later my wife was posing in numerous wedding pictures with no such black eye and I have never struck anyone in anger, ever. Apparently this information has been spread through the new wife’s family and I am being slandered. \n\nSo that’s putting a damper on the mood today.",
   "created_utc": 1700774367,
   "score": 72,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai0h8e",
   "message": "Was planning on my mother, my brother and his wife for dinner with my family. It’s our first Thanksgiving in our new house. My brother’s house is tiny (no dining room and 1 couch) and we are a family of 5 so can’t fit. My mother is a hoarder and there’s no place to even sit in her house. My brother decided he couldn’t leave his house, SIL stayed with him. Mother decided to go to their house. I have spent a ton on food, my wife spent the last two days cooking and I spent the days cleaning. Now I have a ton of food and I am left with the realization I am only good to fix all the stuff that breaks around their houses.",
   "created_utc": 1700781600,
   "score": 134,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai1t85",
   "message": "Nothing. For once, nothing. I picked up Thanksgiving from a local restaurant and only invited my sister. Currently, my wife, son, and I are watching movies in our pajamas. I am having a beer. Life is good today.",
   "created_utc": 1700782243,
   "score": 19,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahwa3s",
   "message": "Current argument is my sister in law arguing with my brother about the proper way to measure screen size.\n\n\n\nHe's right you measure diagonally.   But I am staying out of this",
   "created_utc": 1700779608,
   "score": 85,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai2yi3",
   "message": "My dog rolled around in raw sewage that had leaked from my wife's aunt's septic tank.",
   "created_utc": 1700782814,
   "score": 213,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai2b47",
   "message": "My tablecloth is ugly...according to my aunt",
   "created_utc": 1700782492,
   "score": 46,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai6ooo",
   "message": "My parents and I ended up staying at home this year because my dog just had surgery a week ago, and yes he is recovering well",
   "created_utc": 1700784665,
   "score": 104,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai7455",
   "message": "Nothing serious.. We're celebrating Saturday and Grandma (90) is concerned about the turkey being spatchcocked, because it cooks in only 2 hours and she's used to waking up at 2AM to start it cooking to be ready by noon. Hers is normally extremely greasy on the bottom and dried out in the breasts. She is unsure if this way will taste as good, but she was very sweet to being open to let us try it this way.\n\nI was mildly irritated by catching her licking the spoon multiple times while scooping mashed potatoes from the mixer into a bowl (she didn't realize anyone was in the room bc she can't hear anymore), but I didn't say anything cuz I love her and I didn't want to hurt her feelings 😕",
   "created_utc": 1700784877,
   "score": 88,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai58nr",
   "message": "I *love* holidays with my partner’s family. It’s a huge family. They don’t tend to discuss politics. Everyone gets along (for the most part). And there are a lot of kids and little ones (ranging in age from infant to teens) so we do everything early. We were home before 5 pm. Now he’s watching football and I’m about to take a bubble bath. No drama is such a good feeling.",
   "created_utc": 1700783950,
   "score": 17,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahu4ph",
   "message": "First Thanksgiving I'm completely alone as an adult. Living in WA and my family is on the northeast coast. Almost a year after separating from my wife. The only family I had out here was her mom.\n\nJust got off from work, so I'll just rest and maybe journal a bit.",
   "created_utc": 1700778617,
   "score": 71,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai1f6s",
   "message": "Mother in laws artificial hip popped out of joint. The last 2 times this happened they had to surgically repair it. This time the doc got it back in place and she is able to drive and go home. Told my wife she needs to buy a lotto ticket because our luck is never that good.",
   "created_utc": 1700782049,
   "score": 108,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai46xf",
   "message": "The parade really sucked and there was a corn musical number.",
   "created_utc": 1700783427,
   "score": 150,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahw8ol",
   "message": "SOMEONE over salted the deviled eggs!",
   "created_utc": 1700779589,
   "score": 143,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai1g63",
   "message": "We ordered our food from a local grocery store. We told everyone they didn't need to bring food. 5 people didn't show. Everyone still brought food. Fewer people and double food. Spent the morning doing so much work for no reason lol.",
   "created_utc": 1700782063,
   "score": 138,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai1y9o",
   "message": "My daughter called after two months of no contact, so that’s a positive.",
   "created_utc": 1700782312,
   "score": 223,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai9gkd",
   "message": "My dog and the neighbor dog just had a pretty solid argument.  Not sure what it was about",
   "created_utc": 1700786030,
   "score": 46,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai6yvf",
   "message": "Grandma forgot the whipped cream for the pie",
   "created_utc": 1700784805,
   "score": 37,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai91xp",
   "message": "Just Dad and I this year, as my mom is with my great-uncle (great-aunt passed away recently, he didn't want to be alone but also didn't want a crowd). So we've been entertaining ourselves by keeping an eye on the crazy lady next door. (For anyone familiar with the Bucket Lady saga over on r/pettryrevenge, there's a very similar vibe)\n\nA few things Neighbor Lady has done in the past:\n\n* Accused my dog of killing her grass (he's a Chihuahua, and doesn't even pee in her yard because I don't let him over there)\n* Told the HOA that my dog also \"cornered her on her porch\" and that she \"feared for her life\" (again, 10lb Chihuahua, and he never gets let out without supervision because there are bobcats around here). Claimed she had video evidence but that's never appeared because it's a flat out lie.\n* Screamed in the face of the nice couple on the other side of her house that she has more money than them (???)\n* Claims that everyone in the cul-de-sac hates her because she's Christian (so is everyone else up here except for my family, who aren't religious but culturally Christian)\n* Complained to the HOA about \"an excessive number of cars\" being parked at another house in the cul-de-sac. The homeowner's brother was terminally ill in the nearby hospital and their extended family was in town to say goodbye. It should be noted that she had her bigass RV sitting in her driveway for almost 6 months, explicitly against the HOA rules, until my mom casually asked her about it during yet another conversation about how my dog is not the devil incarnate and it suddenly vanished.\n* Called the cops on one of the other neighbors for... standing in his own yard and asking her not to put property stakes in his yard (she's obsessed with the property lines). Said neighbor is *also* a cop in a different precinct and was in full uniform at the time. \n\nSo the most recent drama now is that she called the chief of the precinct where that other neighbor works and basically complained about him \"threatening\" her and \"trespassing\" on her property. This is still about that first incident which was, no joke, 4 months ago. Cop neighbor is pressing charges for filing a false report (potential felony). Every other family up here has our fingers crossed that she moves soon, as apparently she told someone a while back that she never lives in any house for more than about 2 years, and we're coming up on 2 years with her next month.",
   "created_utc": 1700785832,
   "score": 61,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai6vby",
   "message": "Graduated basic training yesterday and I've been roaming around this base all day waiting to ship out somewhere else.",
   "created_utc": 1700784757,
   "score": 79,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai96dx",
   "message": "Not juicy but I caught rsv from my grandchildren. I have food in my house for 25 people but I’m too sick to have people over. Thanksgiving is my favorite holiday since I’m the typical Nana who shows love by cooking. I’m sitting here with my husband, feeling down. Oh well, maybe next year.",
   "created_utc": 1700785894,
   "score": 27,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicdir",
   "message": "Well, my ex wife called me. Asked if she could talk to me about something. One of her male coworkers was on a dating site and saw my girlfriend’s profile. \n\nI didn’t know and later today I get to have a conversation with her and let her know I have screen shots and she is now my ex girlfriend.  \n\nThe kicker? I caught my ex wife (of just over 20 years) cheating the day after thanksgiving last year. \n\nI hate this fucking holiday.",
   "created_utc": 1700787474,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai5x08",
   "message": "I took 2 Xanax as soon as everyone got here. So if something happened, I really don't care.",
   "created_utc": 1700784289,
   "score": 142,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahword",
   "message": "I tested positive for Covid today. My family is supposed to be hosting Thanksgiving. Now none of the guests want to come. We have 20 pounds of food. My Mom is low-key crying. 0/10 would not recommend.",
   "created_utc": 1700779797,
   "score": 211,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai54dm",
   "message": "I will circle back to this later. Something about families coming together that brings out the crazy.",
   "created_utc": 1700783888,
   "score": 23,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai6myk",
   "message": "The sweet potatoes were overseasoned with nutmeg",
   "created_utc": 1700784641,
   "score": 22,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaia85m",
   "message": "Everyone was mad at me cause I chose to stay In Miami for work instead of seeing the family in listen to them bitch and moan about politics,\n\nI don’t regret it",
   "created_utc": 1700786402,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai4z0k",
   "message": "My cousin secretly has 15 cats and two dogs and they had to hurriedly move out of their apartment and into an air b\u0026amp;b because they “forgot” the lease was expiring this month. They also forgot (ie too lazy) to spay and neuter their existing cats. The male cat in question impregnated his mother and sister 🪕",
   "created_utc": 1700783815,
   "score": 71,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai7uxr",
   "message": "My brother-in-law's parents didn't come because they don't like that I say fuck all the time.  Oh well, more fucking pie for me.",
   "created_utc": 1700785241,
   "score": 67,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai9xjr",
   "message": "Well as I type, the woman on Family Feud right now looks so scary she frightened my grandmother with dementia to the point of needing to change the channel.\n\nSo a pretty tame year I suppose!",
   "created_utc": 1700786258,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai7hyv",
   "message": "One year after announcing the ending of my engagement to a man, I’ve announced I’m gay and very in love with a wonderful woman. My Catholic family is less than enthused…",
   "created_utc": 1700785064,
   "score": 94,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai91gq",
   "message": "Im a metro sexual because I cooked our turkey and am a good dad according to my MIL (think she called me gay?)",
   "created_utc": 1700785825,
   "score": 33,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai9tz8",
   "message": "My neighbor’s son was stabbed in jail cause he won a game of dominoes and the other guy got mad.",
   "created_utc": 1700786211,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai4ux3",
   "message": "My grandparents are pedophiles with dementia and I am the only who is getting the sizeable estate",
   "created_utc": 1700783758,
   "score": 41,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai8sfg",
   "message": "Well I and the rest of the family learned that my step-aunt has throat cancer that spread to her brain, so there’s that.",
   "created_utc": 1700785700,
   "score": 13,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai8yqk",
   "message": "My whole family decided to go on vacation for Thanksgiving. They neglected to tell me until yesterday. They were like oh hey we are going to New Orleans and your sister and her family are going to Disney. Which means you get to spend Thanksgiving alone. Oh I'm so blessed....",
   "created_utc": 1700785788,
   "score": 24,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicu38",
   "message": "My dad says I’m fat, and need to get in shape. \n\nI’m 45, middle age *is* hitting me. But I weight within about 10 lbs of what I did in high school, and ran a half marathon this morning. I work out nearly every day, lifting and running. Also, he actually is about 80 lbs overweight, diabetic, and riddled with health problems. \n\nNothing like reminding me of that one right as the turkey comes out of the oven.",
   "created_utc": 1700787707,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaid34i",
   "message": "My kid told her cousin Santa wasn’t real. All hell has broken loose.",
   "created_utc": 1700787837,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai438z",
   "message": "They’re probably talking about it being the third year in a row that I didn’t come. It’s the type of family where if you don’t show up for thanksgiving (or any other major holiday) you better be on your death bed or worse. I don’t care for spending my whole day being uncomfortable around judgmental people, so I just don’t.",
   "created_utc": 1700783377,
   "score": 58,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai9fzy",
   "message": "We planned for six (including my wife and I) to attend. We host and it's always a pleasant time. Thanksgiving is my favorite because it's just about family and food. \n\nUnfortunately my uncle's dementia has really kicked off over the last few weeks and due to various reasons we simply ended up cooking then delivering that food to multiple locations to support a family bring crushed by one of the most horrendous diseases I've ever witnessed. \n\nFuck dementia. Fuck the VA. Fuck the US \"healthcare system\". Fuck social services. Just fuck it all.",
   "created_utc": 1700786022,
   "score": 23,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaic32f",
   "message": "Made my first turkey as an adult for my wife and daughter and the rest of family. Woke up at 5:30 to prep it and get it on the smoker in time for food at around 2 at my parents house. I was terrified it would be undercooked or over salted or have salmonella or something.\n\nTurns out it was delicious. Funny, that.",
   "created_utc": 1700787329,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kah0jvs",
   "message": "I don’t think there is any so far",
   "created_utc": 1700765952,
   "score": 32,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai613z",
   "message": "I hope you have a relaxing Thanksgiving! Also, your username made my day #kresblamaina",
   "created_utc": 1700784343,
   "score": 10,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaiae8j",
   "message": "Went on a solo hike, the best thing I've ever done for myself in a long time.",
   "created_utc": 1700786483,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaiccol",
   "message": "Dad just burned his foot spilling the fresh gravy…cook safely everyone",
   "created_utc": 1700787463,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicu3h",
   "message": "My cousin announced he was a wear-wolf. Like full on…wear wolf gloves and all. No joke.",
   "created_utc": 1700787707,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahnsi6",
   "message": "Mom couldn't be bothered to thaw the game hens, so I gave dinner away to someone in need.",
   "created_utc": 1700775772,
   "score": 32,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaiao96",
   "message": "My cousin's wearing a MAGA sweatshirt and it's taking all my willpower not to take the bait.",
   "created_utc": 1700786621,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai4pmn",
   "message": "An Aussie NBA player got exposed for banging a junior high girl",
   "created_utc": 1700783685,
   "score": 14,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai98fb",
   "message": "Nothing. I’m alone this whole holiday weekend.",
   "created_utc": 1700785921,
   "score": 7,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicl7z",
   "message": "Someone put sour cream in the mashed potatoes",
   "created_utc": 1700787583,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaid2l2",
   "message": "My fiancés mother pulled me aside and essentially told me that the reason she’s been so cold towards me is that she feels I’m an inadequate partner for her daughter. \n\nHer daughter who is a stay at home mom because I bust my ass working to pay for everything we have. Who, upon hearing what her mother said, burst out laughing.\n\nDefinitely not any issues between my lady and I but it does suck to know your future MIL thinks poorly of you.",
   "created_utc": 1700787829,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaib4dp",
   "message": "I'm having an argument over whether to  watch the 49ers Seahawks football game, or the Michigan Stanford basketball game.  It's getting pretty heated, but since I'm here by myself, I figure I can compromise and flip back and forth between the two of them.",
   "created_utc": 1700786844,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kah8lus",
   "message": "The turkey declared a revolt, demanding to be pardoned before being roasted!",
   "created_utc": 1700769240,
   "score": 36,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai9qo0",
   "message": "I’m at work. Way more drama here than at home.",
   "created_utc": 1700786166,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai9wxa",
   "message": "I found out that the wife of my SIL husband's brother most likely murdered her husband's camp gladiator trainer. It was wierd just hearing that and the non-chalance at the certainty of it was very jarring.",
   "created_utc": 1700786250,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaib2xf",
   "message": "I have food poisoning and missed everything ☹️☹️☹️",
   "created_utc": 1700786824,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicaxz",
   "message": "My mom has unfortunately become synonymous with getting drunk and causing drama, this year was no exception though I’m not entirely against her for it in this case\n\nA few years ago my mom’s ex boyfriend Steve died (they were together for like 8 years). He was EXTREMELY abusive towards her and violent in general and ruined my high school years and some of the years after.\n\nMy mom’s sister Cat is close friends with this lady Amanda that hates my mom. Amanda was childhood friends with my mom’s dead abusive ex. Apparently recently Amanda had been saying around town that my mom “killed her childhood friend Steve by abusing him for many years”. My mom is maybe 130 pounds soaking wet and Steve was like 6’4”, 300lb and VIOLENT. \n\nSo, tonight Cat and her husband were in the kitchen (with my mom in the room) praising their friend Amanda to high heaven randomly. They know my mom and Amanda have beef and that my mom’s especially hurt by Amanda’s recent comments. It went on for a while, then my mom finally exploded about what a bitch Amanda is and how she can’t stand to sit around and listen to people praising her. It got very tense for a few seconds",
   "created_utc": 1700787438,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kai9ohz",
   "message": "Brought the dog to the in-laws. She found a mound of cat poop out back and went to town. Didn't realize till later when she slobbered on me and I realized my pants now reeked of wet old poop slobber. Dinner's almost ready, and I don't know about you, but I tend not to bring a change of clothes to Thanksgiving. This will be fun",
   "created_utc": 1700786137,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaic22w",
   "message": "Saw a 3 car wreck on my way to thanksgiving 😬",
   "created_utc": 1700787314,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicl8h",
   "message": "My family finally brought up the fact that my aunt(not allowed at our gathering) would hoard Nutella from several years prior  as she felt it was still good. Grandma defended her for 4 hours. \n\nAlso tried explaining terms of trade and Conparative advantage to one of my uncles. Took abt 10 minutes to get him to literally restate my point.\n\nMy mom went from excited to wanting them gone (in private) by abt 3",
   "created_utc": 1700787583,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicw8i",
   "message": "Our four year old is still resisting all of our attempts to get her to reliably pee in the potty and getting obstinate about it. \n\nOther than that, nada. We noped out of T-day this year, stayed home, made dinner with all the trimmings, watched the Lions lose and then took a nice long walk. Perfect Thanksgiving.",
   "created_utc": 1700787738,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaiezst",
   "message": "Not drama per se, but I told my Mom that this is the last year I’ll be attending Thanksgiving and Christmas with the extended family. Not because I don’t like them; I’m truly blessed to have the family that I do. I told her I’m proposing to my girlfriend next month and want to get more involved with her family and start building our life together. She’s sad, but thinks it’s really sweet. I’m excited to see them for Christmas in a month, but honestly even more excited to ask the love of my life to marry me and start our own chapter! My mom is passing down her ring to me to use, so I think the sentiment is really cool. Waiting until my late 20’s was the perfect move. Today was a great day overall. Good food, good people, no drama whatsoever. Today I truly feel happy. :)",
   "created_utc": 1700788808,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahxh1d",
   "message": "We’re getting sued for nearly a million dollars by my cousin and his girlfriend bc our dog bit his baby",
   "created_utc": 1700780159,
   "score": 45,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kahulm2",
   "message": "My mom opened the oven while it was browning because she thought it was brown enough.    \n\n\nPolice showed up due to a domestic disturbance complaint.",
   "created_utc": 1700778833,
   "score": 54,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaibd93",
   "message": "Learned that two other people in my family can control their dreams to an extent.",
   "created_utc": 1700786969,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaibo7v",
   "message": "Had an absolutely horrible round of Flamecraft, thanks to misreading one of my fancy dragons and not being able to set up another one's perks.",
   "created_utc": 1700787120,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaicb79",
   "message": "Nothing today, but Sunday might be something. My husband and his two brothers will sometimes get into it. Especially if the middle brother isn’t sober, hands might be thrown. Not to mention a house will be filled with dogs. We have a dog, my parent in-laws have a dog and one BIL and his GF have 2 dogs, and GF daughter has a dog. So lots of dogs.",
   "created_utc": 1700787442,
   "score": 1,
   "submission_id": "1827vp3"
  },
  {
   "comment_id": "kaig929",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1827vp3"
  }
 ]
}