{
 "submission_id": "182d0qv",
 "title": "If your pets could understand every word you said for a full minute, what would you say?",
 "selftext": "",
 "created_utc": 1700779505,
 "permalink": "/r/AskReddit/comments/182d0qv/if_your_pets_could_understand_every_word_you_said/",
 "score": 215,
 "url": "https://www.reddit.com/r/AskReddit/comments/182d0qv/if_your_pets_could_understand_every_word_you_said/",
 "comments": [
  {
   "comment_id": "kahx7fu",
   "message": "“I love you so so much. Please don’t use your claws on me, it hurts. It’s ok if you love bite, you are gentle when you do. When I trim your claws you have to be patient it’s not dangerous and if you stay still it will be over sooner. Please let me shave your bum so you don’t get poo stuck in your beautiful fur. Ok times up I love you!”\n\nThat’s pretty much it hahaha",
   "created_utc": 1700780034,
   "score": 195,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai4e5d",
   "message": "You've made the last 17 years of my life worth living, and I love you more than words could ever express. I will cherish my memories of you when you're gone and love you always until my last breath. And I'm sorry for all the times I've forced you to cuddle and kiss you when you wanted to be left alone. I'm sorry, but I'm going to keep doing it because sometimes I remember how short your life is compared to mine, and I just need to cuddle you in case it's the last time I get to.",
   "created_utc": 1700783525,
   "score": 94,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kahzuhx",
   "message": "\"Stop shitting on the floor.\"",
   "created_utc": 1700781292,
   "score": 62,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kahx0dc",
   "message": "My baby girl is on “cage-rest” whilst she recovers from surgery on her leg. I’d tell her that we’re not punishing her, we are protecting her and trying to keep her as healthy and safe as possible. I know she’s sad and feels like we are being cruel, I’d just want her to know we love her so much and wish she didn’t have to be in there.",
   "created_utc": 1700779945,
   "score": 31,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kahwddp",
   "message": "i would tell her how much i love her. she has been a great souce of comfort and support the last couple of months",
   "created_utc": 1700779651,
   "score": 25,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai21mi",
   "message": "Ridiculous question, as we all know our pets already understand everything that we say….How would it be any different?",
   "created_utc": 1700782360,
   "score": 22,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8hs3",
   "message": "Let’s agree on a sign if you are in pain.",
   "created_utc": 1700785556,
   "score": 20,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kahwd57",
   "message": "You free loading, begging, unemployed mooch. Why are you sighing?",
   "created_utc": 1700779648,
   "score": 32,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai14p8",
   "message": "“When you hear me say “shut up”, it means “be quiet”.",
   "created_utc": 1700781907,
   "score": 15,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai5hpf",
   "message": "We are going to be putting down my Doberman tomorrow. That’s not enough time tell him how much happiness he brought us these last 11 1/2 years and growing up with my son who turned 10 a few months ago.",
   "created_utc": 1700784077,
   "score": 13,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai09nm",
   "message": "I’d earnestly ask my three tomcats to please start using the many suitable scratch posts I’ve placed conveniently around the house and, for the love of Christ, quit reducing my furniture to splinters and ribbons. Dirty pricks.",
   "created_utc": 1700781501,
   "score": 11,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai69av",
   "message": "I know Del Taco fries are your favorite. They are mine as well. I'm sharing, but I'm the human, your the dog. 2 for me, 1 for you. Taking your paw and hitting my leg every 12.5 seconds isn't going to make them come faster. Patience, you'll get your share.\n\nWhat? No, mine get ketchup, your's don't. \n\nWhat? No, saying please still gets you no ketchup.",
   "created_utc": 1700784454,
   "score": 12,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai2sxs",
   "message": "My pets already understand every word I say. We have full on conversations all day every day. I know this for sure because they give me the exact same facial expressions, eye rolls, and exasperated groans that my kids do.",
   "created_utc": 1700782736,
   "score": 10,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8cdo",
   "message": "I LOVE YOU, YOUR LITTLE SMOSHY FACE IS SO CUTE, BOOP! YOU'RE MY FAVOURITE,  I LOVE YOU,  YOU'RE THE BEST! WHY ARE YOU SO CUTE? YOU'RE SO GORGEOUS. \nBasically, exactly what I say when they don't understand me.",
   "created_utc": 1700785482,
   "score": 8,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kahyenz",
   "message": "I would tell the cat, if you are vomiting, do it on the floor, you don’t have to climb higher every time. \n\nI would tell the puppy that she needs to pee in her diaper, puddles nearby don’t count. \n\nI would say that going to the vet is important for their health and they only give injections if necessary. \n\nI would also say that if I go away on business, I will definitely return in the evening. I never leave them and love them very much.\n\nAnd I would tell the cat that Grace the dog didn't come back one day because she died of cancer. We did everything possible to save her. The puppy who lives with us now is not a replacement, but a member of the family and an attempt to move on after a year",
   "created_utc": 1700780598,
   "score": 15,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kahxojf",
   "message": "\rI'd tell them how much joy they bring into my life and promise unlimited belly rubs and treats forever!",
   "created_utc": 1700780258,
   "score": 8,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kahwqc9",
   "message": "Ask my pet whether something hurts, so I can fix it. Sometimes we just don’t know and they can’t talk.",
   "created_utc": 1700779817,
   "score": 6,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai22tp",
   "message": "I love you and I'm so happy you love me. You're very much appreciated and there's no better cat and dog than you two.",
   "created_utc": 1700782377,
   "score": 6,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai3q61",
   "message": "“Please stop eating poop. Also I love you”",
   "created_utc": 1700783198,
   "score": 4,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai4zdd",
   "message": "Stop shitting on the carpet. Look I understand accidents happen, so please go in the kitchen. It's so much easier to clean.",
   "created_utc": 1700783819,
   "score": 5,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai67j0",
   "message": " I would tell her she’s my princess that I love her that she has saved me and keeps me going and a reason to live that she’s the best cat anyone could ask for and she’s adorable and fluffy and also is my best friend",
   "created_utc": 1700784429,
   "score": 5,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai7f6g",
   "message": "I’m sorry I left you with the kids and traveled without you, I didn’t expect you to get hurt while I was away, I’m a terrible owner and I’ll never leave again",
   "created_utc": 1700785025,
   "score": 5,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai4vqp",
   "message": "I would say I love you so much, and thank you for your undying love, lack of judgement, and companionship for the last 15 years.",
   "created_utc": 1700783769,
   "score": 4,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai39ii",
   "message": "Get a job please. Looking cute isn’t a job.",
   "created_utc": 1700782966,
   "score": 7,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai40q3",
   "message": "I love you and I wish I could understand you so I could better provide for you. That being said START👏BURYING👏YOUR👏POOP👏BETTER",
   "created_utc": 1700783342,
   "score": 3,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai50lp",
   "message": "My dog’s best friend (also a dog) who lives a few doors down had to unexpectedly be put down a few weeks ago. Now she just sits on the deck for hours, looking into their backyard, waiting for her friend to come out.\nI’d let her know about what happened to her best friend, and that I love her so very much.",
   "created_utc": 1700783836,
   "score": 3,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai638t",
   "message": "I would tell the dog how much I love him.  Explain the things he does not need to bark at. Then also explain some words for how I tell him to walk with me so we can go hiking in lots more places (he is blind).\n\nAnd ask him to PLEASE stop trying to hump every dog. \n\nThe cats,  I would ask Toby to please not attack the dog,  if he is mad at Sparks just come and sit in my lap,  I will protect him. Then just reassure them all that I love them very much.  Very very much.",
   "created_utc": 1700784372,
   "score": 3,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai6ndt",
   "message": "Just make sure she understands that I love her, will continue to keep her safe, and just because it’s five minutes after breakfast, I will be feeding her soon",
   "created_utc": 1700784646,
   "score": 3,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai6uvi",
   "message": "I’d tell them how much I love them, and that everything I do, even if it seems like punishment (like pills or the vet), is for their own good. I’d tell them that I am their mama and I will always protect them, no matter what - so they don’t need to bark at squirrels, or the mailman, or the wind, because they don’t need to be the protector of the house. I’d tell them that I would never leave them and I will always care for them (one is a rescue). \n\nIf I had a few extra seconds, I’d tell them that they gotta stop going to the bathroom inside, outside only!",
   "created_utc": 1700784751,
   "score": 3,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9d1s",
   "message": "If your in pain, touch this sticker on the wall. \n\nWhen your ready to go to a place where there is no more pain forever, touch this one over here. \n\nHe has intestinal cancer and has for years. He’s deteriorating slowly. The vet game him a year when he was diagnosed but it’s been 3. He’s so strong but I want to make him as comfortable as possible and ease his passing when it’s time.",
   "created_utc": 1700785982,
   "score": 3,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai2z6u",
   "message": "I would tell them how much I love them ❤️",
   "created_utc": 1700782824,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai4j0m",
   "message": "“I love you very much, please don’t bite me, poo goes in the litter box, you are so cute when you are sleeping all curled up.",
   "created_utc": 1700783593,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai4vwt",
   "message": "\"I want to be able to let you outside but you have to promise to not go into the road and make sure you come back after your adventures :(\"",
   "created_utc": 1700783772,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai5ap5",
   "message": "I love you. Don't puke on the duvet. I love you. I'll always come back to you. I love you!",
   "created_utc": 1700783979,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai5lgd",
   "message": "When I tell you \"no\", that doesn't mean do it anyways and maintain eye contact.",
   "created_utc": 1700784128,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai7107",
   "message": "Looooove you!!",
   "created_utc": 1700784834,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai71ls",
   "message": "Stop eating shit you aren’t supposed to! I’m not taking you to the emergency room again!",
   "created_utc": 1700784843,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai7g51",
   "message": "Honestly.  Your name is not bad dog.  You have loved me more than I deserve.  I love it when you wiggle, when you snuggle.  Blink twice when are are hurting so I know.  Love you Lila.",
   "created_utc": 1700785039,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai7hff",
   "message": "I love you and you’re my favorite part of being home and you’ve done so much for me, please don’t try to bite the vacuum cleaner,  and please dont bark at the mailman,.",
   "created_utc": 1700785057,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai7hlr",
   "message": "I suspect that one of my dogs understands everything I say, except when I am practicing Dutch or Korean. Then he looks at me weird. The other one needs to have the house rules explained to him.",
   "created_utc": 1700785059,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8al9",
   "message": "If I say ‘Quiet’ please don’t bark. It would really help if you’d poop in one area of the yard so I can keep the yard clean. When we walk on a leash, can you walk next to me? If you get really good, I can take you running, biking, and hiking.  I love you so much. What do you want to do for fun? Food? Adventure?",
   "created_utc": 1700785457,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8jd4",
   "message": "\"I put out the water dish so you have something to drink, not so you have something to splash all over the floor.\"",
   "created_utc": 1700785578,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai91jz",
   "message": "Same shit I say to him already.\n\n\"I love you, you're the best boy and that little asshole yappy dog across the hall is not something you need to get worked up over\"",
   "created_utc": 1700785827,
   "score": 2,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaibj8a",
   "message": "\"Guys, know that I love you, and that I will do whatever it takes to make sure you are always safe, fed, and protected.\"",
   "created_utc": 1700787051,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaibo0m",
   "message": "I miss you. I’m sorry I wasn’t able to tell your cough was cancer. Please forgive me for not taking you to a better vet sooner. I’ll never forget you.",
   "created_utc": 1700787117,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaic0ih",
   "message": "I would tell my dog how much I love her, what a beautiful dog she is and apologize for all the transitions she has had this past year. Last year we had our son and I feel badly about the reduction in how many walks she has and our cuddle time. Its temporary and already changing but I want her to know that we think about it, are trying and she is still a very important part of our family",
   "created_utc": 1700787292,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaicg3x",
   "message": "“I love you wittle baby girlie girlie”",
   "created_utc": 1700787510,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaid2wd",
   "message": "Stop eating each others SHIT! It seems to be the only thing my dogs don't understand.",
   "created_utc": 1700787834,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaifnad",
   "message": "I know you felt better than ever toward the end, but that's because you were on fluids that weren't a long-term solution. Your kidneys weren't keeping up and you had cancer indicators. Even if I had the means your life wouldn't have been comfortable for much longer. Can you forgive me?",
   "created_utc": 1700789134,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaied0j",
   "message": "I love you SO MUCH. Everything I do, I do for you, even when I deny you certain foods that you get sick from. I will protect you. You are my whole life.",
   "created_utc": 1700788486,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai2wdl",
   "message": "I'm really sorry about that \"thing\"!",
   "created_utc": 1700782784,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai4eo0",
   "message": "\"Quit pooping beside the litter box!!!\"",
   "created_utc": 1700783532,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai4rt9",
   "message": "I love you so much, please dont dont or piss on my bed anymore. Im sorry for falling on you. You will die before me but know it will wreck my soul, thats why i shower you in affection.",
   "created_utc": 1700783715,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai51d5",
   "message": "Please stop peeing in the corner thank you",
   "created_utc": 1700783846,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai55n4",
   "message": "STOP SCRATCHING THE FUCKIN COUCH.",
   "created_utc": 1700783907,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai59ga",
   "message": "I would tell my hamsters that i love them so much, and i will never hurt them. Also i will tell one of them to stop chewing the cage",
   "created_utc": 1700783961,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai5nvq",
   "message": "All of them but one I’d tell them how much I love them and why they aren’t allowed outside/aren’t allowed outside off leash (cats and dogs). 1 of the 5 it wouldn’t matter, cause he’s a jerk and wouldn’t listen to me anyways (my tabby cat Jarvis, he’s a jerk to me, the other two cats, both dogs, my husband, and my toddler and he enjoys life that way)",
   "created_utc": 1700784162,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai66fn",
   "message": "i'd be in a lot of trouble cuz i make fun of my cat a lot",
   "created_utc": 1700784414,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai68ry",
   "message": "you dont need to bark at the stupid feral cats, just leave them be, Ill sort it, also stop getting on the bed, your bed is right next to mine sleep there, I can not stand all the hair on the bed, so sort those two things and things will be great. love you.",
   "created_utc": 1700784446,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai77s8",
   "message": "I love you let me kiss you you won't let me kiss you all you do is kiss me stop being so god damn cute",
   "created_utc": 1700784926,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai7g8d",
   "message": "Please only pee in the boxes. If it's dirty, use one of the other two instead of peeing on the floor next to your favourite.",
   "created_utc": 1700785040,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai7gpj",
   "message": "There’s always money in the banana stand, chk chk.",
   "created_utc": 1700785048,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai80fh",
   "message": "“It’s okay that sometimes you have to puke, but if you puke please don’t puke on the only couple feet of carpet we have. Throw-up on a hard surface”",
   "created_utc": 1700785316,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8b91",
   "message": "I give you love and food and shelter, please stop destroying my stuff.",
   "created_utc": 1700785466,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8bpm",
   "message": "I love you so much , but I wish you’d shut the door when you come back into the house.",
   "created_utc": 1700785473,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8e4v",
   "message": "“We’ll always come back. Stop freaking out every time we leave the front door!  Also you don’t need to freak out every time the neighbors dog gets walked.”",
   "created_utc": 1700785507,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai8gr5",
   "message": "Stop barking every time the doorbell rinds",
   "created_utc": 1700785542,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai91g9",
   "message": "“Stop losing your shit every time someone walks past me, the house, or their own house”",
   "created_utc": 1700785825,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9cfh",
   "message": "OMG can you use the doggie door already - it’s safe and easy to use.",
   "created_utc": 1700785974,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9d6y",
   "message": "Only scratch the scratching post and there's no need to scream while you're just walking around the house or drinking water",
   "created_utc": 1700785984,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9huu",
   "message": "Stop giving me that stupid smile. You're making me act like you now",
   "created_utc": 1700786048,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9jdf",
   "message": "Why can’t you jump off the bed and move to the tile floor before you barf?",
   "created_utc": 1700786068,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9y17",
   "message": "\"I love you more than I can say. I never mean to hurt you when I try to brush nasty things out of your fur. When I take you to the vet, it's always only because I care for you and want you to feel better.\"",
   "created_utc": 1700786265,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9y1q",
   "message": "You're such a good girl!",
   "created_utc": 1700786265,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kai9zo4",
   "message": "I would tell him how much I love him, after that I’d ask him what the fuck keeps aggravating his skin, he’s nearly perfect but gets allergies and costs me so much money and vets can’t even get to the bottom of it either. Maybe he knows what irritates him",
   "created_utc": 1700786288,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaia59o",
   "message": "Stop climbing on my tapestries, and I mean that. Also you can turn the electric blanket on yourself by pressing that big button with your head paws. \n\nAlso stop waking me up at night with your loud meowing. It’s annoying.",
   "created_utc": 1700786363,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaiaiek",
   "message": "Same shit I always say to her. \"Thats my baby girl, yes, you're such a nice baby, thats mamma baby, she's the prettiest girl...\" and so on and so on.",
   "created_utc": 1700786540,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaianrs",
   "message": "Please get along with each other, no one likes being growled at. Leave the leather furniture alone, please.",
   "created_utc": 1700786614,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaiaqjk",
   "message": "Dude, the house is not under threat.  You’re safe.  No one can hurt you here.  Stop Pissing on everything.  Your territory is secure.",
   "created_utc": 1700786654,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaiav9p",
   "message": "Don't eat outside, you are getting too fat, it's not healthy because you can't afford the cost anymore, you are 12 years old. \n\nI love you very much. \n\nDo you have any news about Eggy?",
   "created_utc": 1700786719,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaiawzs",
   "message": "I love you",
   "created_utc": 1700786743,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaib1mp",
   "message": "I'm sorry I'm not turning on the sink for you to drink from anymore. I know you hate getting a saucer of bottled water but until the well water test comes back proving it is safe after it started smelling weird you aren't drinking a drop of it. I would rather you be upset at me than gain your favor by giving you poison",
   "created_utc": 1700786805,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaib4hz",
   "message": "Im really sorry that i stepped on your tail that one day, that was an accident.",
   "created_utc": 1700786846,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaib7un",
   "message": "“We’re just going to the vet and she’s a good person and she’s not trying to hurt you, just know that if it accidentally does hurt it’s for your own health and also I’m not leaving you there dont worry we are going home after and then you get a treat. Sound like a plan? Ok good let’s do this.”",
   "created_utc": 1700786893,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaibgzj",
   "message": "They do understand what I am saying!",
   "created_utc": 1700787021,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaibjhu",
   "message": "I love you so much, more than my son does, and that's  who we bought you for. I'm sad that you shit today in the backroom, and I had to yell at you, but Laura was mad. Please quit stealing stuffed animals from all over the neighborhood because those are people's toys.",
   "created_utc": 1700787055,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaibn3c",
   "message": "If you stop picking fights with other dogs, avoid cars, and come when called, I'd let you off leash.",
   "created_utc": 1700787105,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaibni7",
   "message": "I would give my dogs instructions on how to signal different things they want. woulnt get more than 2 things down I bet but yeah. LOL they already know I love them so why belabor the point.",
   "created_utc": 1700787110,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaicgpu",
   "message": "\"Stop barking at every single thing. Let us know if there's strangers on the property, and if we say 'enough', shut your yap\"",
   "created_utc": 1700787519,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaickb3",
   "message": "To the dog, I love you, you’re a good boy. Please bark less. To the cats, please barf on the wood floor and please tell me if you’re in pain.",
   "created_utc": 1700787570,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaicl17",
   "message": "You're safe. I trust you. Come here. How are you? I love these ears. What else would you like me to do? Manana? Mananana? Myawn?",
   "created_utc": 1700787580,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaicono",
   "message": "You have a scratching post you prick use it, also if your stealing my seat go to the side then we can share and I won't have to move you. Constantly meowing to get my attention is cute as hell I love it. If you keep learning tricks you get treats(so far he sits on command, my last cat sat, gave paw and laid down on command)",
   "created_utc": 1700787632,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaicu02",
   "message": "I love you more than you can possibly understand, and nothing I do or ask you to do is for any reason other than your benefit. Even if you don't like something, trust me, it's for your sake.",
   "created_utc": 1700787706,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaid6tp",
   "message": "I'd  be worried. As it is now we have to spell when she is near.",
   "created_utc": 1700787889,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidc5b",
   "message": "Did you ever notice how I never lick my butthole in front of you?  Yeah, that's because it's considered rude...  but also, I can't. So look, I'm not asking you to not live your best life. I was just hoping that maybe the next time your tongue's gonna be in your asshole, if you could just face away from me, that'd be great. Appreciate it.\n\nAlso, I love you, but I assume you know that, since you keep bringing me dead animals. Good lookin out.",
   "created_utc": 1700787963,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidemw",
   "message": "“I love you. You have brought so much joy into my life. You’re my best friend.”",
   "created_utc": 1700787998,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidezp",
   "message": "Don't walk on my boobs, damn it!",
   "created_utc": 1700788002,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidjz7",
   "message": "“Crochet is not a cat toy. Crochet is not a cat toy. Crochet is not a cat toy…”",
   "created_utc": 1700788073,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidksu",
   "message": "Please don't bump or lick my hands when I'm trying to play video games or work on the computer. I don't get why you always need to lick my hands, and I don't mind, but it really gets in the way when I'm trying to do stuff with them",
   "created_utc": 1700788085,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidwbe",
   "message": "Stop shi#%ing on the couch, Bobby!",
   "created_utc": 1700788249,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidy9u",
   "message": "Get a job and stop screaming at me for food.\n\nAlso, i love you 😍",
   "created_utc": 1700788278,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaidzfd",
   "message": "Stop bringing in half dead rats you hairy prick.",
   "created_utc": 1700788294,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaie0t4",
   "message": "Planning to get adopt a cat. \n\nI will love you no matter what. I don’t mind if you don’t reciprocate that love. You will understand it eventually.",
   "created_utc": 1700788314,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaie3oo",
   "message": "Stop fucking barking at everything. I'd try for a boy that called wolf analogy  but time is tight",
   "created_utc": 1700788354,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaiecd5",
   "message": "This is how you could use the toilet on your own, with a practice session.",
   "created_utc": 1700788477,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaiejey",
   "message": "Stop instantly swallowing every damn sock you find in the house. One day you won't be able to poop it out and you will not enjoy that day. When I stick my hand down your throat to retrieve said quickly inhaled sock it isn't because I am stealing your well earned snack. I'm trying to save your life. Knock. It. Off.",
   "created_utc": 1700788577,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaifl7e",
   "message": "You’re the best boy",
   "created_utc": 1700789105,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaifq8r",
   "message": "I love you so much, you're the best dog ever. Thank you for being so great with the kids. I'm sorry that we won't get to spend our entire lives together but I promise you I'll cherish you till you're gone.",
   "created_utc": 1700789176,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaifvs0",
   "message": "I would tell them they’re my furry best friend and tell them how much they mean to me because without them I’d be so empty. I love my pets 🥺",
   "created_utc": 1700789256,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaifyno",
   "message": "I'm convinced my cat does understand me. I've literally asked her to get off the bed and move to the chair without any physical cues and she did as asked. (She's not allowed on the bed because of my allergies.)\n\nThat said, I would explain my allergies. I would also explain my sensory issues and that my leg doesn't start twitching because I don't want to cuddle, but because my nerves are a little wonky. I would apologize for not sharing my food because it's not good for kitties and explain that I just don't want her to get sick. I would apologize because I wish I had more than a minute.",
   "created_utc": 1700789297,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaifzdp",
   "message": "Get off the couch!",
   "created_utc": 1700789307,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaig0an",
   "message": "I love you all so much\n\nAnd talk to one of my dogs about her whining lol",
   "created_utc": 1700789319,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaig2hs",
   "message": "Throw up on the tiles. Stop running for the carpet when you feel it coming on.",
   "created_utc": 1700789351,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaig6i6",
   "message": "I feel like I want to be able to understand them more than have them understand me. \n\nBut I would let my cat know:\n\n-that I'm so sorry for ever accidentally hurting her by stepping on her foot or tail and I would never intentionally hurt her. \n\n- that I need her to take any pills I give her because they're only going to help her.\n\n- that I will buy her a cat tree if she stops clawing carpet, anything that feels like leather, my bed\n\n- that she needs to be more patient when I wake up and right when I get home because I know she's hungry, but I'm likely to pee myself if I don't go to the bathroom right now\n\n- that if something's wrong (she doesn't feel good, is hurt, needs something) to paw at my foot and either go to what she needs or try to show me what's hurt/curl up if she doesn't feel good\n\nAnd finally:\n- that I love her so much and would have literally lost my mind without her. She helped pull me out of some of the worst depression of my life and I will forever be grateful to have her in my life.",
   "created_utc": 1700789409,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaigav1",
   "message": "Just use the damn stairs, Marley!”",
   "created_utc": 1700789470,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaigb8v",
   "message": "We love you(cat), and we’re sorry that we’re so touched out by the end of the day by having 2 children under the age of 4 that we don’t show you the love and affection you deserve.",
   "created_utc": 1700789475,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaigh92",
   "message": "You don’t need to be on the counter any time I’m washing dishes/cooking. You do not need to be on the counter at all. I should change your name to “get off the counter” as I say it more than your actual name.",
   "created_utc": 1700789560,
   "score": 1,
   "submission_id": "182d0qv"
  },
  {
   "comment_id": "kaiglgq",
   "message": "I love you more than life itself. I'm sorry I have to go to work. It's how I make it so you have toys and food. Sorry about stepping on your tail and all your long hairs. Please don't ever go in or near the street without me, it's dangerous. When you cuddle me, try not to slap me in the face with your legs, it hurts. Thank you for following me everywhere and making me feel better. You're the goodness girl in the world. Please stop barking at people we know. I love you.",
   "created_utc": 1700789619,
   "score": 1,
   "submission_id": "182d0qv"
  }
 ]
}