{
 "submission_id": "182v80h",
 "title": "What is something unfair that everyone has simply accepted at this point?",
 "selftext": "",
 "created_utc": 1700841474,
 "permalink": "/r/AskReddit/comments/182v80h/what_is_something_unfair_that_everyone_has_simply/",
 "score": 201,
 "url": "https://www.reddit.com/r/AskReddit/comments/182v80h/what_is_something_unfair_that_everyone_has_simply/",
 "comments": [
  {
   "comment_id": "kal0v60",
   "message": "Planned obsolescence of consumer electronics",
   "created_utc": 1700844909,
   "score": 61,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal75bm",
   "message": "I'm a foster parent. All of our foster kids have had terrible stories. Some have had happy endings...new families, old families that got their act together...some have not had happy endings. trying to help these kids is the hardest thing I've ever done.\r  \n\r  \nUnfair, to me, is knowing that last night six kids, ages 2 through 12, slept on cots in a CPS office near here because their parents couldn't keep clean and there's not enough foster families to handle the load. Tonight they'll probably be in an institution until a placement opens up. Because their parents are fuck ups.\r  \n\r  \nI can't think of anything more unfair than a toddler sleeping on a cot in a strange office building because their parents shouldn't be parents.",
   "created_utc": 1700847459,
   "score": 48,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal3ss5",
   "message": "The decrease of quality of clothes",
   "created_utc": 1700846108,
   "score": 187,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaktltj",
   "message": "\u0026lt;gestures around vaguely\u0026gt;",
   "created_utc": 1700841898,
   "score": 86,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalnxny",
   "message": "Most necessities switching to subscription models and blocking outright ownership as a cash grab",
   "created_utc": 1700854265,
   "score": 148,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal40fs",
   "message": "I took care of a woman who had cancer and was in her end days. She was young, late 30s, and had 3 sons, ages 9, 11 and 18. Apparently she had only just been diagnosed earlier that year. Earlier in the year, when her husband got the news that she had cancer, he was on his way home to comfort her and was killed in a car accident. So these boys lost both their parents in the span of about 10 months. This woman not only found out she was dying, but then was loaded with the grief of his death and the uncertainty of her children's futures. All of us nurses had to rotate care of her, as no one could leave that room and not be in tears. We didn't want to add to the boys grief.\n\nLife is fucked sometimes.",
   "created_utc": 1700846194,
   "score": 242,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaljwbl",
   "message": "Fast food costing as much as real food used to cost.",
   "created_utc": 1700852629,
   "score": 200,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalhy0w",
   "message": "That usually the most qualified, hard working person usually gets passed over for a promotion for someone well connected.",
   "created_utc": 1700851823,
   "score": 56,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal11l8",
   "message": "The expectation that you will always answer your phone or call back immediately. Now a days people even get offended if you didn't pick up or call back.",
   "created_utc": 1700844982,
   "score": 133,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalhfox",
   "message": "Unpaid lunch. It's not like you can leave the premises, you're still tethered to the job. At least do a half-rate during lunch.",
   "created_utc": 1700851614,
   "score": 231,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal5656",
   "message": "I was once at a fundraiser, where the winning prize was tickets to go see Pearl Jam in concert. At the end of the night, they call my name as the winner. WOOOOO...except when I get to the front of the room to collect my tickets, I get looks of confusion and the runaround until the event was over. Turns out, some scumbag son of a bitch told the organizers he was me, and THEY GAVE HIM THE FRIGGIN’ TICKETS! By the time they verified that I was me, he was long gone, and I was out of luck. Best they could do was an apology and a $50 gift card to T.G.I.Friday’s.",
   "created_utc": 1700846663,
   "score": 31,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakx2x7",
   "message": "Freaking U.S. healthcare/health insurance apparently 🙄",
   "created_utc": 1700843348,
   "score": 101,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal2dae",
   "message": "[removed]",
   "created_utc": 1700845523,
   "score": 106,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal581k",
   "message": "When I was in grade school we had a final group assignment to design a community centre, with my teacher promising a lobster dinner for the group that had the highest mark. I had a bit of a crush on my teacher and thought hey, lobster dinner.\n\nMy group busted their asses designing the \"Hijinx\" after school community centre, calling a long list of businesses to determine membership fees, cost of construction (we got hung up on alot looking for price of building materials), community outreach programs and a whole lot more. We even helped the special needs kid in our group write a jingle - and we got the highest mark.\n\nWhen it came time for our lobster dinner, my group stayed in the classroom during recess to enjoy the fruits of our labour. My teacher brings out our \"lobster\", which was a loaf of bread with googly eyes and paper lobster claws stuck in the side.\n\nIt was on that day I learned the true meaning of disappointment.",
   "created_utc": 1700846685,
   "score": 228,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal01ut",
   "message": "Some days are just gonna suck.\n\nYou can’t prevent it, prepare for it, nor avoid it.",
   "created_utc": 1700844576,
   "score": 59,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal4k3x",
   "message": "Life is inherently unfair.",
   "created_utc": 1700846417,
   "score": 81,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal72n8",
   "message": "The beautiful get better treatment",
   "created_utc": 1700847429,
   "score": 220,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal3pa3",
   "message": "[removed]",
   "created_utc": 1700846069,
   "score": 137,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kale4to",
   "message": "Unfriendly family hours in social care jobs \n\nChildcare that costs more than a morgage",
   "created_utc": 1700850263,
   "score": 74,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalhazr",
   "message": "Birth lottery\n\nSome kids have won the game of life just by default while the majority of kids are just destined to be mindless workers grinding their days out for other people's benefits",
   "created_utc": 1700851560,
   "score": 64,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal44zy",
   "message": "Life in general",
   "created_utc": 1700846246,
   "score": 60,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakzfuu",
   "message": "Working 9 - 5 for five days a week just so you can have two days off.",
   "created_utc": 1700844325,
   "score": 93,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal85f9",
   "message": "That anyone with wealth or power get away with everything without EVER FACING CONSEQUENCES.\n\nYou shouldn’t be able to buy your way out of facing punishments.",
   "created_utc": 1700847861,
   "score": 48,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakv6ff",
   "message": "That we have only one life yet we have to sacrifice most of it working so that some awful people with a lot of made-up currency can acquire more made-up currency",
   "created_utc": 1700842556,
   "score": 252,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakvr10",
   "message": "That we have to work until we fall down to our knees as pension is slowly evaporating. It gives me such a depressing perspective on life.",
   "created_utc": 1700842794,
   "score": 134,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakxqyh",
   "message": "That I have to obey the computer's requirements if I want to get anything done.",
   "created_utc": 1700843629,
   "score": 110,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal1j4t",
   "message": "The lack of a good healthcare system in the USA",
   "created_utc": 1700845180,
   "score": 188,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal5c8z",
   "message": "LIFE\n\nSome days you're the pigeon \n\n\nSome days you're the statue",
   "created_utc": 1700846733,
   "score": 21,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalhysc",
   "message": "Nepotism.",
   "created_utc": 1700851832,
   "score": 19,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal6gw6",
   "message": "I think Leonard Cohen covered a lot of it in his song Everybody Knows, and the user who commented ‘gestures around vaguely’ covered the rest. \n\nhttps://youtu.be/Gxd23UVID7k?feature=shared\n\nCohen nails the blaze tepid resignation though.",
   "created_utc": 1700847189,
   "score": 21,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakt9fy",
   "message": "Many adults and teachers have accepted bullying as normal and have brushed it off when the victim asks for their help.",
   "created_utc": 1700841751,
   "score": 158,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalbvis",
   "message": "The way wealth is shared. The least working individuals are getting the most money. While the ones literally breaking their backs get the least.",
   "created_utc": 1700849356,
   "score": 32,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalm0kr",
   "message": "working 40+ hours a week 5+ days a week for your entire life in the HOPES that you can MAYBE retire for like 10 years before you die",
   "created_utc": 1700853491,
   "score": 35,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalmq05",
   "message": "US healthcare being tied to work",
   "created_utc": 1700853775,
   "score": 35,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaldcua",
   "message": "Having to guess what you owe in taxes. It’s absurd",
   "created_utc": 1700849951,
   "score": 66,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kall1tk",
   "message": "If you live life expecting fairness you are going to have a bad time.",
   "created_utc": 1700853099,
   "score": 18,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalag7b",
   "message": "Going to prison forever for stealing an apple if you’re homeless and starving vs getting a stern talking to for defrauding thousands of investors out of their retirements to fund your 3rd super yacht.",
   "created_utc": 1700848778,
   "score": 215,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakunsd",
   "message": "Social class is your *actual* country, not where you live on the map.",
   "created_utc": 1700842339,
   "score": 66,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalitmg",
   "message": "That might is right. Particularly, people in positions of power can get away with corruption/misconduct.",
   "created_utc": 1700852183,
   "score": 17,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kallfta",
   "message": "That some people have more going for them than others.\n\nGrowing up both TV and education seemed too stress that we all have different attributes. The person who was good looking, charismatic and popular but dumb as a rock, self-centered and shallow.  And the person who was smart and thoughtful was usually not hot or charming. We all have different things going for us and it's somehow evens out. That seemed to be what you would get from TV sitcoms and from the self-esteem talks in school and from parents.\n\nLife has taught me that is not true. Cindy Crawford was an engineering major and an honor student. I worked at a bookstore on an Ivy League campus and we would have students come in who would look like supermodels, be very kind, be very charming and clearly were very smart because they were students at an ivy League college. There are some people who have it all: Good looks, intelligence, charisma, kindness, charm, warmth, etc. And unfortunately there are some people in the other direction to.",
   "created_utc": 1700853257,
   "score": 16,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalc8bj",
   "message": "Tipping being mandatory.",
   "created_utc": 1700849498,
   "score": 41,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalk88d",
   "message": "Rich people pay Jack shit in taxes (US)",
   "created_utc": 1700852764,
   "score": 14,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kall6ke",
   "message": "Health insurance. It is no where close to fair that these fucks take hundreds of our dollars each month and we get laughable medical care in return that we still end up paying for. But we've all come accept this. It boils my blood honestly. I'm not saying medical services should be completely free (debatable), but if they're taking $900 from me every month, then they better cover every single penny if I decide to break my arm or if God forbid I get cancer. These ambulance rides need to be free too. \n\nI mean honestly, I have to pay $900 a month just so I don't have to pay full price for surgery? So instead of paying $17,000 for an appendix removal, I pay $4,000 makes total fucking sense to me..... Yeah thanks assholes. Health insurance in the US is bullshit, total bullshit.",
   "created_utc": 1700853152,
   "score": 14,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalnpxm",
   "message": "Convenience fees for paying bills online.",
   "created_utc": 1700854177,
   "score": 13,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal846l",
   "message": "Poverty life",
   "created_utc": 1700847848,
   "score": 27,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaldcfd",
   "message": "U.S healthcare. Im not even American but every time I see even one image of those damn prices I want to drag those people over here to Europe! Like I feel bad for you people.",
   "created_utc": 1700849947,
   "score": 30,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalliz4",
   "message": "Employers underpaying service workers and guilt tripping consumers into paying tips.",
   "created_utc": 1700853293,
   "score": 12,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakssrq",
   "message": "People get more mad at single moms than single fathers.",
   "created_utc": 1700841556,
   "score": 113,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal3wi9",
   "message": "My teacher promised a ticket to Hawaii if anyone could solve a hard problem. I can’t even recall what the problem was. We were in 2nd grade, I suspect he assumed no one could solve it. I did.\r  \n\r  \nHe told me it was a train ticket.",
   "created_utc": 1700846149,
   "score": 37,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalcsv6",
   "message": "Interest rates designed to keep you in debt for years and years",
   "created_utc": 1700849728,
   "score": 46,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kam5z60",
   "message": "Billionaires.",
   "created_utc": 1700861467,
   "score": 9,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakst51",
   "message": "Genetics",
   "created_utc": 1700841560,
   "score": 19,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal1sf8",
   "message": "We have to use those soggy paper straws while bilionnaires and big corporations just keep polluting way more than we ever could.",
   "created_utc": 1700845287,
   "score": 21,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal5mtv",
   "message": "Tipping cultuuuureeeee",
   "created_utc": 1700846852,
   "score": 18,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalghjo",
   "message": "40+ years of working.",
   "created_utc": 1700851225,
   "score": 20,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalduxw",
   "message": "Inflation",
   "created_utc": 1700850152,
   "score": 10,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalssp5",
   "message": "The prices for everything nowadays.",
   "created_utc": 1700856228,
   "score": 9,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaktcdl",
   "message": "Paper straws at McDonald’s, the preachy elites are allowed to jet around all day on their private planes whilst us peasants aren’t even allowed a good straw nowadays.",
   "created_utc": 1700841787,
   "score": 111,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalmztb",
   "message": "Mass Layoffs. Back before Jack Welsh changed the game of business layoffs were looked as a massive failure of operation. Investors would see layoffs as a sign of a failing company. But then he made unadulterated greed fashionable in the business industry. Now it’s to the point that if you are not massively screwing over employee’s regularly it’s a sign of a failing company.",
   "created_utc": 1700853884,
   "score": 16,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalfcah",
   "message": "The fact that you have good health insurance but there are deductibles and in my case $15 dollar per doctors visit. Also have 1,200 a year dental insurance paid by the union but it cannot be applied to implants.",
   "created_utc": 1700850757,
   "score": 10,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakxqmv",
   "message": "The police will never hold themselves accountable for their illegal actions. They’ll always circle the wagons and their union will make sure the worst of them still get their pensions.",
   "created_utc": 1700843625,
   "score": 36,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalf4zx",
   "message": "For-profit healthcare in the USA",
   "created_utc": 1700850673,
   "score": 13,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalfwgv",
   "message": "Prices increasing with 50%, salaries with 10%.",
   "created_utc": 1700850988,
   "score": 13,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalh6f6",
   "message": "That public schools are mostly locally funded. The rich get a far superior education than everyone else. That's capitalism for 'ya!",
   "created_utc": 1700851507,
   "score": 21,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaldqgn",
   "message": "Execs making millions while the company's average salary stays practically the same y/y. They also get golden parachutes written in their contracts.",
   "created_utc": 1700850102,
   "score": 15,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalp77s",
   "message": "Each Kardashian is a millionaire for doing absolutely nothing. I give Jenner a pass because they did win an Olympic gold for… running? Ok. But the rest are all grifters. They really don’t do anything to warrant any attention. Yet have made millions for talking to each other on tape and photoshopping their photos. I take pictures and talk to people. Meanwhile I’m looking for a job that pays more than $8 an hour. That s is unfair but we all kind of accept it.",
   "created_utc": 1700854774,
   "score": 15,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalihtf",
   "message": "The Taliban ruling Afghanistan",
   "created_utc": 1700852047,
   "score": 8,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kale0dr",
   "message": "Corruption into politics. Both sides. No one thinks to be voting a completely honest candidate.",
   "created_utc": 1700850213,
   "score": 14,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kakvll0",
   "message": "Biden and Trump, these are our best choices",
   "created_utc": 1700842731,
   "score": 48,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal7x49",
   "message": "That the Robert Murdochs, Donald Trumps and other horrendous old men contributing to the misery of the world are still alive.",
   "created_utc": 1700847768,
   "score": 30,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal6wg9",
   "message": "That Commodore didn’t win the home computer war and we are all enjoying our Amiga 70000s right now ..or is that just me? …. I feel like that may be just me …..",
   "created_utc": 1700847360,
   "score": 6,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kal8wt8",
   "message": "That fact that inflation exists",
   "created_utc": 1700848165,
   "score": 6,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaldhpl",
   "message": "Self checkouts don’t come with a discount",
   "created_utc": 1700850005,
   "score": 10,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaldcry",
   "message": "Unlimited power of mods",
   "created_utc": 1700849951,
   "score": 5,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalwi5l",
   "message": "Auto renewal of subscriptions, tipping for tipping's sake,  junk fees and capitalism in general.\n\nEdit: we need a bloody revolution.",
   "created_utc": 1700857699,
   "score": 5,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kama9oi",
   "message": "The rich get richer while the poor get poorer.",
   "created_utc": 1700863222,
   "score": 5,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kalkd3z",
   "message": "Wealth inequality. I mean holy shit.",
   "created_utc": 1700852820,
   "score": 13,
   "submission_id": "182v80h"
  },
  {
   "comment_id": "kaloph3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "182v80h"
  }
 ]
}