{
 "submission_id": "183baog",
 "title": "What’s a harsh reality that everybody needs to hear?",
 "selftext": "",
 "created_utc": 1700885869,
 "permalink": "/r/AskReddit/comments/183baog/whats_a_harsh_reality_that_everybody_needs_to_hear/",
 "score": 189,
 "url": "https://www.reddit.com/r/AskReddit/comments/183baog/whats_a_harsh_reality_that_everybody_needs_to_hear/",
 "comments": [
  {
   "comment_id": "kannp7z",
   "message": "Not everyone likes you",
   "created_utc": 1700886058,
   "score": 0,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kannhrt",
   "message": "You can become disabled unexpectedly at any point in your life. Make sure you’re taking advantage of the abilities you have while you have them. :)",
   "created_utc": 1700885953,
   "score": 110,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kansomp",
   "message": "Life does not pause when you go through something terrible.",
   "created_utc": 1700888726,
   "score": 40,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanqors",
   "message": "People are going to *really* hurt you...and 99% of the time it wasn't even personal. They were just being selfish, and acting out their own shit. It wasn't even about you. You didn't deserve it, but now it's your responsibility to get through it, like it or not.\n\nI've seen too many people get fucked up and then use that forever in order to justify any kind of bad behavior or self-sabotaging, etc etc. \n\nYa man that fucking sucked but like, no one is going to show up and fix you in the same way they showed up and damaged you.",
   "created_utc": 1700887640,
   "score": 25,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kano2kn",
   "message": "You don't realize the good/best times as they are happening",
   "created_utc": 1700886249,
   "score": 225,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanpdbd",
   "message": "No one is coming to save you.",
   "created_utc": 1700886933,
   "score": 165,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanolqu",
   "message": "life doesn't always go the way you want or plan for it to be",
   "created_utc": 1700886529,
   "score": 82,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao4rhp",
   "message": "Mental illness may not be your fault, but it is your responsibility to manage it.",
   "created_utc": 1700896300,
   "score": 79,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanpx7h",
   "message": "Life isn’t fair.  People will be rewarded for being a ruthless dick.  People will be savagely punished for being a good person.  Act how you think you act not for the reward but so you can live with yourself later.",
   "created_utc": 1700887229,
   "score": 135,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanp1xi",
   "message": "Things will only change when you put the effort in to change them",
   "created_utc": 1700886764,
   "score": 62,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kansbh4",
   "message": "There are maybe 4 or 5 people who truly care about you.\n\nThe rest of the world has no interest in you.",
   "created_utc": 1700888525,
   "score": 122,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanuj8j",
   "message": "You are alone in the truest sense - no one will ever truly understand what it’s like to be you. While you may share moments and events with others, your subjective experience will always be yours and yours alone.",
   "created_utc": 1700889771,
   "score": 71,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanv3ym",
   "message": "Good looks \u0026amp; youthful age count even in careers where they shouldn't.",
   "created_utc": 1700890103,
   "score": 59,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanydb6",
   "message": "All your money, prestige, and fancy friends are not nearly enough. Happiness is an inside job.",
   "created_utc": 1700892033,
   "score": 28,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanpt28",
   "message": "No matter what you're working towards, you will probably never feel end-game levels of satisfaction regardless of if you meet those goals or far exceed them.\n\nHumans are wired to always want more, the idea that you have nothing left to do is often more depressing than contemplating the possibility of failure. \n\nIt's why world leaders in great positions declare war for small stuff, why millionaires strive to be billionaires, and often why celebrities living \"the dream\" often commit suicide.",
   "created_utc": 1700887168,
   "score": 47,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanr22d",
   "message": "You are not getting any younger",
   "created_utc": 1700887838,
   "score": 23,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanxyvw",
   "message": "love addiction can kill you, learn to let people go when the inner voice is telling you that you love them more than they love you.",
   "created_utc": 1700891791,
   "score": 19,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanvgsc",
   "message": "You may think you know someone for years before they suddenly show their true colors.",
   "created_utc": 1700890310,
   "score": 19,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanpykl",
   "message": "It’s not virtuous to continue to hold fast to a belief in something when sufficient objective evidence to the contrary has been presented. That’s called denial and it makes you really hard to be around when you can’t admit you’re wrong.",
   "created_utc": 1700887250,
   "score": 36,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanvi2u",
   "message": "sometimes you can't save a person from bad decisions.",
   "created_utc": 1700890331,
   "score": 33,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanxuzf",
   "message": "In all likelihood you are about average.",
   "created_utc": 1700891723,
   "score": 17,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanw2yl",
   "message": "We have to die",
   "created_utc": 1700890662,
   "score": 17,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanynnf",
   "message": "Nothing will change if you don’t at least try.",
   "created_utc": 1700892211,
   "score": 16,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao47s5",
   "message": "Miss Piggy was abusive to Kermit.",
   "created_utc": 1700895924,
   "score": 15,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanomab",
   "message": "Nobody gives a fuck about your Instagram and LinkedIn posts.",
   "created_utc": 1700886537,
   "score": 75,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kany8d9",
   "message": "The universe doesn't love or hate; it just doesn't give a shit. Someday you will be gone, then will all the people who ever knew you. Then the earth, everything on it, and all its history. It will all die.\n\nBut eventually the dust will go back to stars and worlds, the way it did to make the earth and you. A famous scientist once said something to the effect of people are how the universe experiences itself.\n\nSo the only way the universe can experience the fact that you ever existed at all is through other people. The universe encompasses all space and all time, so when or how often you really see each other is irrelevant.  Grab hold of them, look them in the eye, tell them you love them if appropriate, and acknowledge each others' existence.\n\nIt's as close as you will come to immortality.",
   "created_utc": 1700891950,
   "score": 25,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanyu0z",
   "message": "No ones gonna make you happy except for yourself",
   "created_utc": 1700892321,
   "score": 11,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao1aee",
   "message": "I worked for a company that was commissioned to do moderation for TikTok.\n\nThe app isn't just unhealthy for its users; its parent company, Bytedance, is downright ***negligent*** and have zero interest in protecting their most vulnerable users, particularly children. This could be said for any social media company I'd wager, but thanks to my personal experiences with Bytedance, I can confidently say that their moderation teams are only in place to check a box so that they aren't run out of business by lawsuits or, in countries that actually give a shit and haven't been rendered utterly brain-dead by lobbying, federal regulation. Apologies for being on a tear about this, but it keeps coming up, because TikTok is a fucking plague on EVERY OTHER SOCIAL MEDIA AS WELL. Reddit is a prime example of this, as I'm sure you've all realized by now. It's like a consumptive virus that cannot be cured because people are happy to continue sneezing into each other's open mouths.  \n\nWhen they have too much difficulty deciphering how to best apply guidelines and tags, ones that would actually result in permanent bans of toxic users, Bytedance would default to castrating whatever rule the users were consistently violating, because they're far more concerned about constant engagement than they are about maintaining any sort of standard. During my time working for them, they disabled several different tags that were CRUCIAL for moderation, the most notorious being the **Reproduced Content** tag, which is the only means we had of curtailing the comically rampant content theft that Bytedance implicitly supports. At another point, they combined a number of unique sexual content tags, turning them into all-encompassing generalizations that made them as vague as possible, because more explicit tags for things like the removal of clothing or the simulation of sexual acts would result in too many bans. Ironically, while they clearly did this because the more strictly definitive tags were hurting their bottom line, it also resulted in an uptick of bans on satire accounts or accounts posting suggestive, but not necessarily explicit, artwork. Yes, instead of pivoting in their approach or simply accepting that their moderation standards were, you know, *working*, they instead chose to muddle the waters so much that we were left with a pair of all-encompassing \"**Sexualized Behavior**\" tags that they then insisted we were overusing. We literally had no other choice if we wanted to tag these videos at all -- adults, teens and kids are CONSTANTLY trying to show skin on that app, and users of all ages are CONSTANTLY trying to encourage other kids to do the same, along with predators *posing* as children. Did it matter? Not at all. No matter what we reported back to them, Bytedance would never walk anything back. Quality accounts were needlessly warned or outright banned, while dangerous or at least apathetic accounts were allowed to skate by. \n\nFurthermore, unless an OBVIOUS CHILD, EVEN A TODDLER WEARING A DIAPER, actually comes out and reveals somehow that they are under 13 years of age (stating as much, revealing their grade in primary school or their birth date, showing their yearbook, etc.), there is nothing we can do besides tagging them as \"**Suspected Underage**\". What did this accomplish? Nothing. The account gets a warning, but no ban and no actual penalty. It's a fucking joke. \n\nTikTok is a predator's dreamland, and Bytedance would rather put children in danger than actually enforce their own fucking rules. People are idiots and parents are no different, so I have no hope that anything will change in the future, but I'm at least glad I'm not forced to endure watching TikTok videos for eight hours a day anymore. It was terrible for my mental health, and not just because I was usually dealing with the manual report queue where I would endlessly be subjected to seeing mutilated bodies or people brazenly posting child sexual assault material. I've seen a man cut his wrist open and then two other people stretched the laceration as wide as they could with their fingertips, right into the camera. I've seen a man's hand literally SHOVED OUT OF THE WAY by a bone shunted from his forearm, again, with the injury shoved right into the camera lens for my viewing pleasure. I've seen SO MANY PEOPLE get turned into human confetti by industrial lathes. I've seen animal mutilations that defy all rationale or explanation. I've seen more horrific, traumatizing abuse inflicted on very young children than I can even begin to describe. On the less violent side, you think people shilling their Only Fans accounts is bad here on Reddit? You have ***NO FUCKING IDEA*** how obnoxious, ubiquitous and BLATANT it was on TikTok. Between that and the ENDLESS FLOOD of crypto scams, fraudulent ads, targeted spam and poisoned links that were directed towards dumb kids that don't know any better, I simply can't even glance at a TikTok video without feeling revolted. Bytedance is an evil company, and they should be taken to court for crimes against humanity for what they've inflicted on the world. \n\nSeriously, fucking delete TikTok.",
   "created_utc": 1700893895,
   "score": 32,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao5pob",
   "message": "Anyone in your life could be sucidal, a predator, a creep, an abuser, or have a deadly disease, and you wouldn’t even know.",
   "created_utc": 1700896971,
   "score": 10,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao8gf2",
   "message": "Aliens exist and we are not the center of all reality.",
   "created_utc": 1700898966,
   "score": 10,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanwv2f",
   "message": "Evangelical Christianity is a medieval hate cult",
   "created_utc": 1700891124,
   "score": 30,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao17gw",
   "message": "Love is a choice.",
   "created_utc": 1700893841,
   "score": 8,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao95cs",
   "message": "Only you can save yourself",
   "created_utc": 1700899487,
   "score": 9,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanuokm",
   "message": "Your kids are not guaranteed to turn out to be good people that will take care of you in your old age, no matter what you do.",
   "created_utc": 1700889857,
   "score": 31,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanyw4q",
   "message": "If you want to have a democracy, you have to participate. That means more than just the basics (paying taxes, voting once  and awhile). You have to go to local meetings, join community groups, fundraise or raise awareness, read about issues, hold office if you can, serve on a jury when you're called, go to protests, and on and on. It won't just run itself.",
   "created_utc": 1700892357,
   "score": 17,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanp6ag",
   "message": "No one owes you anything",
   "created_utc": 1700886830,
   "score": 24,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao6521",
   "message": "You are not your thoughts.",
   "created_utc": 1700897275,
   "score": 7,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao689w",
   "message": "Within 3 or 4 generations after your death you'll be entirely forgotten.  Nobody will be able to name you in a photograph.",
   "created_utc": 1700897340,
   "score": 7,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao7lim",
   "message": "Not everything is a lesson, sometimes you just fail.",
   "created_utc": 1700898330,
   "score": 8,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao116u",
   "message": "You do not know what is best for you. You cannot know for certain what is best for you. You can only try your best to do what you can with what you are provided in a given circumstance. What you are provided with will very likely never be enough\n\nBy extension, you cannot know what is best for anyone else.",
   "created_utc": 1700893727,
   "score": 8,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao5k92",
   "message": "you are what you do, not what you think. same goes for other people.\n\nYour ideas, demands, complaints won't make you a good person.\n\nIf that's all you contribute, you are one of the baddies - because others have to lift their own weight and yours on top of that.",
   "created_utc": 1700896865,
   "score": 6,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanzxb9",
   "message": "Tik tok cannot diagnose you. You don't have autism, you're just an asshole.",
   "created_utc": 1700893012,
   "score": 40,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao2wc2",
   "message": "“Fake it until you make it” and “no one really knows what they are doing” are misleading and taken out of context on a regular basis. \n\nYou actually do need to work hard at things. You actually do need to know how to do your job. You actually do need to learn the parenting techniques that work for you and your family to raise healthy happy kids. Etc etc. \n\nWhat you’re “faking” is confidence. You might be nervous to do something and worried you’ll mess up, but you forge ahead with your skills and educated assessments until you are no longer faking the confidence. You learn from your mistakes and you learn from others. You build experience and knowledge on top of what you know. \n\nSuccessful people do actually know what they are doing. Your surgeon doesn’t say “well no one really knows what they are doing lol.” A surgeon cannot promise you a great result but they are trained to take certain steps under the circumstances for that patient. This sort of things applies to all of us. \n\nIf you’re using these two phrases above as a way to not try very hard because “no one else knows what they are doing either” then you’re only fooling yourself. \n\nTaken appropriately, the advice is fine. But too many people fall back on these things as a way to excuse insecurity and failure. We all fail. We all worry we aren’t good enough. Success only comes when you realize that it’s actually attainable.",
   "created_utc": 1700894993,
   "score": 10,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanzyf0",
   "message": "Larry Bird is not walking through that door",
   "created_utc": 1700893031,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao4s4c",
   "message": "Sometimes there is no reason, no lesson to be learned and nothing to gain. Sometimes bad things just happen.",
   "created_utc": 1700896313,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao8lua",
   "message": "As much as you want to see the good in the world there are people who will try to fuck you over without a second thought.",
   "created_utc": 1700899081,
   "score": 5,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanob8e",
   "message": "You have more control of your life situation than you want to admit.",
   "created_utc": 1700886374,
   "score": 19,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao18rt",
   "message": "Changing your life dramatically takes an extraordinary amount of work and time and doesn’t just happen unexpectedly. The longer you procrastinate doing it, the less time you have to enjoy it.",
   "created_utc": 1700893866,
   "score": 8,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao1lzb",
   "message": "Mods are gonna shut this post down just when it starts getting good.",
   "created_utc": 1700894107,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao84wg",
   "message": "There's no scenario where we just ignore climate change and get away with it.",
   "created_utc": 1700898732,
   "score": 5,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao9nwl",
   "message": "People come in and out of your life. Rarely does anybody stick around “forever”. Even people like your family will someday leave your life in death. You have to be okay with this - the only person that will truly always be there for you is yourself",
   "created_utc": 1700899869,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoen3r",
   "message": "Coke taste better than Pepsi",
   "created_utc": 1700903700,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoiacf",
   "message": "In 100 years everyone we know will be dead, and probably forgotten.",
   "created_utc": 1700906575,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanpjhc",
   "message": "I've thought about fucking each of my female friends \u0026amp; coworkers at least once.",
   "created_utc": 1700887025,
   "score": 25,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao0mwo",
   "message": "Life has no damn meaning or purpose, you exist by circumstance and that is all, that's not a reason to be sad, it's a reason to do what you want in order to have a happy life for yourself without being a dick about it to other people who refuse to acknowledge their own mortality and liberate themselves from their self-inflicted shackles. It's a blank canvas, make your purpose, and if you aren't comfortable with keeping on the same path or lose interest then change it until you find what you want to live the rest of your life doing. Life isn't a competition and who gives a fuck about other's expectations of you. They aren't you, and they can't live your life for you.",
   "created_utc": 1700893465,
   "score": 7,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao6mxh",
   "message": "Maybe not everyone, but plenty of people need to be reminded that they're not the centre of the universe, they're not special, they're not entitled to anything above basic human rights.",
   "created_utc": 1700897628,
   "score": 6,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanouqg",
   "message": "Death' is not an easy way out  of the burden of life",
   "created_utc": 1700886661,
   "score": 7,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanx89h",
   "message": "People that complain about things being unfair sound naive and immature. Not only that, but fair is subjective. The solution that you think is perfect may seem completely unfair to someone else. Each of us at times benefit from things that others may find unfair just as each of us at times suffers in some way due to things that we find unfair. The two will most likely never balance out. It's not fair that the gazelle must die for the lion to eat or for the lion to starve so the gazelle can live. Part of growing up is understanding the reality of our circumstances.",
   "created_utc": 1700891344,
   "score": 6,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanxgwc",
   "message": "It is your own responsibility to make sure you are happy, safe and well taken care of .. no one owes you 💩",
   "created_utc": 1700891487,
   "score": 5,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanvhqu",
   "message": "Politicians don’t care about people and media is actively trying to paint you as the victim and “them” as the source of your misery.",
   "created_utc": 1700890325,
   "score": 7,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao4po7",
   "message": "You cant fit cheese in a mason jar :(",
   "created_utc": 1700896264,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao4umm",
   "message": "The world does not care about you. If you are fortunate, you will have a small handful of people you can invest your energy and emotions in from time to time. The freeing thing about this is that the world isn’t paying attention to you either. It gives you a great opportunity to be exactly what you seek in this world.",
   "created_utc": 1700896360,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao59mb",
   "message": "No one cares",
   "created_utc": 1700896658,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao7biz",
   "message": "Your kid is not gifted, or special. Your kid, is just a kid, average, silly, annoying kid. Why on earth everyone things their kids are advanced geniuses is a mystery.",
   "created_utc": 1700898129,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao90n8",
   "message": "Humans aren’t necessarily created to become much more than 35-40 years old. Just saying that most people really experience a change in their life physically around that age, because biologically this is actually where humans are about to die off naturally (going a few hundred years back in history only it was normal to die in your 30’s).\n\nAlso most people start to care even less about you the older you get. People don’t even look so much at you anymore, expect nothing great from you and don’t really think you’ll achieve huge things after you hit 40…",
   "created_utc": 1700899390,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoawer",
   "message": "One day you will die and no one earth will remember you in the foreseeable future",
   "created_utc": 1700900782,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaofi5b",
   "message": "People talk shit about you to other people.",
   "created_utc": 1700904401,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoh4pm",
   "message": "We always think there's more time. There's not. Do it now. Whatever you're thinking of, do it. Tell your crush you like them, call your parents and tell them you love them, try new things, go new places. Because one day, they'll be gone and you'll never realize how much you missed playing Monopoly with your brother, or how much fun you had with your best friend on game night. You'll never hold them again, hear their voices again, but if you make memories with them now, they will live on with you until the end of your days.\n\nAnd when you are at the end of your days, you'll look back on all the great times you had, and that will mean more to you than anything.",
   "created_utc": 1700905691,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanx060",
   "message": "Life isnt fair, it's a big bad world out there.\n\nLook after No1, no one else will. Look after those, who look after No1.\n\nNo one owes you anything.\n\nRespect is earned.\n\nMost people wont like you, some will even hate, just because you exist.\n\nYou will only ever have 2-3 true friends.\n\nMost people only respect those they fear.\n\nMost people will fuck you over in the blink of an eye.\n\nYou wont get out of life alive.",
   "created_utc": 1700891209,
   "score": 7,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao6wgr",
   "message": "Natural deodorant doesn't work. Put some chemicals on your armpits, everybody can smell you, and they wish they couldn't.",
   "created_utc": 1700897821,
   "score": 6,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanxcc8",
   "message": "Humans are fucking up everything, we really need to get our shit together or there needs to be another flood",
   "created_utc": 1700891413,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao060h",
   "message": "People aren’t thinking about you all the time.",
   "created_utc": 1700893164,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao1wnt",
   "message": "I saved this post because I’m going through a self discovery phase and all the stuff (or most anyway) said in here really is helping me get a grasp on focusing on myself and not letting outside influences from other people drive me down paths I don’t want to go.",
   "created_utc": 1700894302,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao2h6x",
   "message": "In the end the only person you can really trust is yourself",
   "created_utc": 1700894689,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao4r6w",
   "message": "You're going to spend most of your life doing things not because you want to do them, but because they need to get done.",
   "created_utc": 1700896294,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao5d3j",
   "message": "Nothing inherently matters. The things that matter to you are what you decide matters. And you know what that's okay.\n\nIf nothing matters, then everything matters equally and I can care about the parts that matter to me. It might not be important in a thousand years when everyone has forgotten about me, but it matters to me right now. It matters because I say it does.",
   "created_utc": 1700896728,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao6jr5",
   "message": "Yes your kids make mistakes",
   "created_utc": 1700897567,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao7xjc",
   "message": "Good \u0026amp; Bad Co-exist together in anything, anyone, any place.",
   "created_utc": 1700898581,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao9ygx",
   "message": "Fairness is a manmade concept. Life and nature do not know any fairness.",
   "created_utc": 1700900088,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoa6vr",
   "message": "Some people can’t be what they dreamed of.",
   "created_utc": 1700900266,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoahec",
   "message": "Most people are never going to make anywhere close to $100k/year.",
   "created_utc": 1700900475,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoaryv",
   "message": "For society to have winners, it needs losers too. Total equality is impossible because human greed will always prevail. This isn't necessarily a bad thing, because it drives progress and development, but there will never be true equality.",
   "created_utc": 1700900690,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaobd4h",
   "message": "If every friend you’ve had ghosted you, look at yourself bc you’re the common denominator.",
   "created_utc": 1700901129,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaod68f",
   "message": "Life is finite, and everyone we love will eventually be lost to time.",
   "created_utc": 1700902518,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoe8uw",
   "message": "The toilet paper roll goes over not under.",
   "created_utc": 1700903367,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoebsn",
   "message": "Facts never care about feelings",
   "created_utc": 1700903436,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoedxc",
   "message": "Waiting for the love of your life to appear before you will never happen.  YOU have to make this happen and be willing to make compromises in doing so.",
   "created_utc": 1700903484,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoelgx",
   "message": "The government is not your friend. It does not care. The bureaucracy and the people who man it are more interested in making it to retirement so they can binge watch reality TV while they doom scroll on their phone than lifting a finger to help you.",
   "created_utc": 1700903662,
   "score": 2,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaofaby",
   "message": "Your work is not your identity. Your work is not your family. It is simply a place to make money.\n\nIf you leave people will move on and you will be forgotten in a year",
   "created_utc": 1700904228,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaofrff",
   "message": "No body gonna be with u forever and life must go on no matter what.",
   "created_utc": 1700904614,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaogybl",
   "message": "Doesn't matter how young or healthy you are, cancer doesn't discriminate.",
   "created_utc": 1700905553,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoihon",
   "message": "Science doesn’t require your belief or your opinion",
   "created_utc": 1700906731,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoijec",
   "message": "The universe is governed by cause and effect. Very few things \"just happen\" and there are very few shortcuts.\n\n\nEven if your circumstances aren't your fault, your path is 100% your responsibility.  \n  \n\nYour subconscious affects you more than you realize.",
   "created_utc": 1700906768,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoimdp",
   "message": "Your actions and choices affect more than just you.",
   "created_utc": 1700906833,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoimgc",
   "message": "\\\u0026gt;“The demand to be loved is the greatest of all arrogant presumptions.”\n\nYou don't deserve love just because you exist. It's a gift other people give you and it can be taken away at any time.",
   "created_utc": 1700906834,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoit9e",
   "message": "Abortion is being outlawed and criminalized in the US because capitalism wants a huge reserve labor force. If it is illegal for all young women to control their reproductive choices and timing for having children or number of children they birth, then women will be dropping out of education, and will not advance as equitably as men in their jobs and careers. Government efforts to force women into birthing and parenting are not being taken in response to Christian values claiming the “rights” of the “unborn” fetus— it is only a convenient alliance between the Christian male supremacists and the capitalists who run our government. We all need to realize that undoing the progress made for women’s reproductive freedom is a straight line to annihilation of America’s remaining middle class.",
   "created_utc": 1700906978,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kaoj3ah",
   "message": "Just because they're family doesn't mean they want the best for you or love you. They may even hate you and use you for their benefit. \n\nIt's perfectly acceptable to cut ties with family members.",
   "created_utc": 1700907198,
   "score": 1,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanq6r7",
   "message": "The world is fucked",
   "created_utc": 1700887372,
   "score": 6,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanw388",
   "message": "At some point in the future, after you have physically died, there will be a time when your name is spoken for the last time. That is when you will truly be dead.",
   "created_utc": 1700890667,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao12i1",
   "message": "The talent of most pop stars does not warrant how much adulation people throw at them. Tayor Swift is not The Beatles.",
   "created_utc": 1700893750,
   "score": 4,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanyq7t",
   "message": "Sometimes the only answer is violence.",
   "created_utc": 1700892256,
   "score": 6,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao0ofz",
   "message": "If you become homeless, there isnt a golden gate to walk through. If you cant get a job and pay the rent, you will suffer a long drawn out wait to get help from the government. I would say like everything thats advertised, there's plenty of success stories, but the number of people that are approved for government assisted housing, and the number of people that find housing is only 24%. And if you want welfare, it only pays 916 per month. Gas, Insurance, Rent, Food, Hygeine, Accessories, Travel, Spending Money. If you paid 300 dollars in rent, that leaves $87 per category. A steak dinner at outback with cheesecake is $45. A mcdonalds value meal is $15. Deodorant and Toilet paper is $12. Thats the kind of life you live, not the good lazy life. A pound of hamburger is $6 a lb. If you ate 3 lbs a weeks thats $72. Thats what being on welfare is like, all you think about is if you want to buy a box donuts this month and forget the fruit.",
   "created_utc": 1700893494,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao1p4a",
   "message": "The truth will hit you in the face eventually, regardless of other people's gaslighting, or what your religion says, or what other people want you to believe about life and your place in it.  It may be in the dead of night, it may be in the middle of your lunch, it may be when you are driving down the street- Truth has a way of settling in.",
   "created_utc": 1700894164,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kao2zga",
   "message": "Climate Change is very real.  And terrifying,",
   "created_utc": 1700895055,
   "score": 3,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanvfo8",
   "message": "You have to get a full-time job. Stop putting it off.",
   "created_utc": 1700890292,
   "score": 5,
   "submission_id": "183baog"
  },
  {
   "comment_id": "kanypto",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "183baog"
  }
 ]
}