{
 "submission_id": "18a5znr",
 "title": "Men, what is something that your wife/girlfriend dislikes about herself that you actually find attractive?",
 "selftext": "",
 "created_utc": 1701644518,
 "permalink": "/r/AskReddit/comments/18a5znr/men_what_is_something_that_your_wifegirlfriend/",
 "score": 85,
 "url": "https://www.reddit.com/r/AskReddit/comments/18a5znr/men_what_is_something_that_your_wifegirlfriend/",
 "comments": [
  {
   "comment_id": "kbwb09i",
   "message": "Her hair. She has natural curly hair it turns me on. She hates it I LOVE it",
   "created_utc": 1701653984,
   "score": 105,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw8ubb",
   "message": "Her hair is going grey and I think it’s just the best. She hates the idea of getting older. I love growing older with her.",
   "created_utc": 1701653051,
   "score": 180,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwafds",
   "message": "My wife has a white streak in her hair from a birthmark. She hates it. It was the thing that made me stare at her the day we met. Last week was the 29th anniversary of our first date.",
   "created_utc": 1701653738,
   "score": 132,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvu83f",
   "message": "She’s always complaining about her butt,  I think it’s amazing though.",
   "created_utc": 1701647043,
   "score": 210,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw6yyk",
   "message": "Her ears stick out. She covers them with her hair. But I think they are adorable",
   "created_utc": 1701652244,
   "score": 210,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwc61j",
   "message": "all of these responses are so sweet omg 😭",
   "created_utc": 1701654488,
   "score": 160,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw5ixx",
   "message": "That she likes to talk a lot.. I actually enjoy listening to her talk because her voice is like something crafted from god himself \n\nShe always says \"Are you even listening? I feel like I'm talking too much\" and then when I recite everything she said for the past 20-30 mins she kind of blushes 😂",
   "created_utc": 1701651622,
   "score": 170,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw1ffz",
   "message": "Her sneeze. She's not like super self conscious about it but she acknowledges its a bit weird. \n\nI think its cute. She does a normal splutter and about half a second later this little feminine \"choo\" that's totally not part of the sneezy chaos.\n\nIts kinda like \"haaa...spssst....choo\"",
   "created_utc": 1701649907,
   "score": 110,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwdboe",
   "message": "My wife has slightly crooked front teeth. She hates it and constantly says she wants to get cosmetic dentistry to fix it the moment it becomes financially feasible. I, however, love it. It's one of the things I've always loved the most about her physical appearance because it's so unique to her, and I find it so adorable.\n\nThat being said, I would also have no issues paying for her to get it fixed in a heartbeat as well, because as much as I love it, I also want her to love herself and be happy with her own physical appearance.",
   "created_utc": 1701654983,
   "score": 185,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbx44mp",
   "message": "Am I the only one that got sad and moved reading all the sweet comments? I’m in a long term committed relationship and I have never heard these types of comments from my man. Guys please go share those words with your lady. Don’t let her be like me crying while reading comments on Reddit.",
   "created_utc": 1701667742,
   "score": 30,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwlcvh",
   "message": "Her thighs. She was a volleyball player and doesn’t like how big her thighs got, then they got bigger when we got pregnant. But I fucking love them. I think they’re so sexy and they compliment everything about her. She really is the most beautiful woman I’ve ever seen inside and out and she will never believe me. I pray everyday that she can see herself through my eyes, just once, to truly see just how beautiful she is and how much brighter she makes the world around her.",
   "created_utc": 1701658559,
   "score": 222,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwj1g6",
   "message": "My wife talks about how she got kicked out of choir in high school bc she can’t sing. And she can’t carry a tune in a bucket to save her life. But I love hearing her sing her favorite songs. When she gets so excited that she can’t hold it back. I could listen to her sing all day.",
   "created_utc": 1701657518,
   "score": 81,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbweco0",
   "message": "Her stretch marks and extra skin from her weight loss. Some of the larger marks are red but they look badass to me, like she fought someone or something. And the extra skin just makes her extra soft, like the parts with extra skin are some of my favourites. It's so fucking soft.\n\nEdit: forgot to mention she still wants to lose a bit of weight and eventually remove the loose skin, especially if she gets a breast reduction one day. Totally fine by me, it's her body, doesn't bother me. I'm gonna marry her one day anyway, hip dips, cellulite, stretch marks, extra skin, and all. She's drop dead gorgeous and nothing will change that for me. She's seriously the most beautiful thing I've ever looked at and she wants to date me??? Fine by me",
   "created_utc": 1701655430,
   "score": 109,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw6tcl",
   "message": "her face. she thinks she is unattractive although she is the most beautiful woman on earth",
   "created_utc": 1701652177,
   "score": 80,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw2j0w",
   "message": "Her calves.",
   "created_utc": 1701650349,
   "score": 11,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw8p9n",
   "message": "My wife is currently pregnant and is self conscious about the weight she’s gained but I think it’s beautiful.",
   "created_utc": 1701652990,
   "score": 117,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwdn0y",
   "message": "My girlfriend has terrible eyesight and always has to wear glasses. I find them super sexy",
   "created_utc": 1701655120,
   "score": 115,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwbqof",
   "message": "Her legs.\n\nAccording to her, they \"get in the way\" and are unpleasant on aircraft, cars, and public transit. Additionally, she finds it a little difficult to get trousers to fit. Still, I adore them.",
   "created_utc": 1701654300,
   "score": 177,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwc9l3",
   "message": "My ole lady is concerned about her weighing quite a bit more than when we first got together. \n\nTo that point, her cooking is what made me fat again. So like, you made us both fat. Congratulations, we are in this together. \n\nHappy fat.",
   "created_utc": 1701654530,
   "score": 174,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwb7pp",
   "message": "My partner feels that her breasts are uneven or misaligned. Next Tuesday will be my sixth year of staring at them whenever I have the chance. Her visual issues are what worry me the most.",
   "created_utc": 1701654071,
   "score": 28,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwcvrn",
   "message": "She thinks her boobs are too small but I disagree. When I tell her she has fantastic boobs it's like the light of heaven enters her eyes. God bless",
   "created_utc": 1701654794,
   "score": 169,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw8uu0",
   "message": "Aww most of these comments are so wholesome \u0026amp; sweet 😭",
   "created_utc": 1701653058,
   "score": 74,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvod4h",
   "message": "Pretty much my entire wife... she hates that part.",
   "created_utc": 1701644754,
   "score": 225,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw7gab",
   "message": "[removed]",
   "created_utc": 1701652455,
   "score": 226,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwblby",
   "message": "[deleted]",
   "created_utc": 1701654235,
   "score": 68,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwaind",
   "message": "Her accent when she speaks her second language.",
   "created_utc": 1701653776,
   "score": 39,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwgzq0",
   "message": "She’s put on weight. I think she looks way more sexy and voluptuous. She’s tall so - yum! Come here amazing Amazonian. Death by snu snu",
   "created_utc": 1701656592,
   "score": 162,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwpf0m",
   "message": "As a woman reading through these comments, it’s given me so much confidence to just rock whatever I have at whatever size I am. I’m working on becoming healthier, and I feel like my body is going through some strange changes as things shrink, but I’m going to rock it regardless now. Thank you, men.",
   "created_utc": 1701660395,
   "score": 227,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw99w0",
   "message": "Clingy. Makes me feel wanted.",
   "created_utc": 1701653240,
   "score": 111,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwau0a",
   "message": "My wife has coffee coloured skin..dark coffee if anything.\n\nIn her culture (China) paleness is considered desirable and healthy for women.\n\nFor me, I actually like her colour. She always worried about it but it was one of the things that attracted me to her.",
   "created_utc": 1701653911,
   "score": 239,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvw5fp",
   "message": "My wife always complains that she is “dirty” or “sweaty” when I get close and I try to explain that I am extremely turned on by her scent and that sweaty lady parts send my pheromone sensors over the edge",
   "created_utc": 1701647805,
   "score": 214,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwg7r6",
   "message": "Her crow's feet.  \n\n\nI love the lines on her eyes when she smiles. It's so genuine and beautiful that I fall in love all over again.  \n\n\nShe can't help but smile because I look like some oaf that's seen a boob for the first time",
   "created_utc": 1701656250,
   "score": 240,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwh17h",
   "message": "I dated a girl with a mild stutter, it was the thing she was most self conscience about. every single time she would stutter it would give me butterflies. I can’t explain why but I thought it was absolutely adorable",
   "created_utc": 1701656610,
   "score": 150,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw64vb",
   "message": "Her vagina.  She isn’t attracted to it at all but I’m a huge fan.",
   "created_utc": 1701651885,
   "score": 71,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw9vi3",
   "message": "Her height.\n\nShe's 5\"10' and is self-concious. I absolutely love it (I'm the same height). She will wear heels and become 6\"2 and it drives me wild. She's an absolute goddess. Tall, slim and blonde but constantly worries because of society. We have a couple of friends built similarly and they feel the same, and they shouldn't have to worry about that.",
   "created_utc": 1701653501,
   "score": 176,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwc666",
   "message": "She’s very self conscious about how she looks but I think she’s the most beautiful woman in the world.",
   "created_utc": 1701654490,
   "score": 90,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw8ez2",
   "message": "An ex but, her voice",
   "created_utc": 1701652869,
   "score": 84,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvpbw1",
   "message": "Her big butt, i like big butts",
   "created_utc": 1701645134,
   "score": 106,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw812k",
   "message": "Her smile, when she smiles (her real genuine smile) she sticks her teeth out. She calls it her “horse face”, but I can’t help but love how adorable she looks. Especially when she tries to hide it.",
   "created_utc": 1701652704,
   "score": 168,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw9e8g",
   "message": "Answering as The Insecure Partner Of A Man, I hate my hip dips. My boyfriend *looooves* them. ETA: \"glad\" that I'm not the only one that only felt insecure about them *after* hearing other folks being insecure about them... glad in quotes because, y'know, I don't wish insecurity on anyone but at least I'm not alone?",
   "created_utc": 1701653293,
   "score": 110,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw9er6",
   "message": "The way her nostrils flare when she’s snoring.",
   "created_utc": 1701653299,
   "score": 215,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwcb6q",
   "message": "her cellulite on her bum and how she's become even more beautiful now that she had a kid.",
   "created_utc": 1701654549,
   "score": 75,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwgt3s",
   "message": "the way she believes, uncynically, in the goodness of other people's intentions",
   "created_utc": 1701656510,
   "score": 72,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwbw39",
   "message": "My ex had literally perfect 10/10 lips, then got lip filler surgery. They got worse. Don’t mess with perfection.",
   "created_utc": 1701654366,
   "score": 172,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw15r0",
   "message": "A slight belly bulge",
   "created_utc": 1701649801,
   "score": 72,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw14cm",
   "message": "Her boobs it causes her back problems.  I love them but for the sake of her health I wouldn't be upset if she had a breast reduction.",
   "created_utc": 1701649786,
   "score": 36,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw7mcb",
   "message": "Thick thighs for sure",
   "created_utc": 1701652528,
   "score": 135,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvpjm9",
   "message": "That’s she’s my wife….",
   "created_utc": 1701645223,
   "score": 70,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvzqi6",
   "message": "Her nose. She's asian and likes my high bridged \"white\" nose. But I think her little round nose is adorable",
   "created_utc": 1701649235,
   "score": 118,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwbrv5",
   "message": "My wife dogs on herself so much after having two kids. I think she looks amazing, plus the little baby pooch she has meaning for me, she gave me two amazing kiddos.",
   "created_utc": 1701654315,
   "score": 96,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw6i5c",
   "message": "Her weight. In college she was 110lbs, now she's.... more. We've had 2 kids and getting older. I think she looks better now but she doesn't believe me",
   "created_utc": 1701652043,
   "score": 186,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvocfj",
   "message": "She’s very self-conscious about her big rack, but I love it for its uniqueness. After all, it’s not often you meet a gal with antlers.",
   "created_utc": 1701644747,
   "score": 6,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwdwjj",
   "message": "The little silvers in her hair. To me she looks like Marvel’s Rogue. \n\nShe has this gorgeous natural deep copper red and dyes it. I’m never gonna tell her what to do, but damn is it luxurious and beautiful with that silver widows peak\n\n. Looks like a gawshdarn superhero.",
   "created_utc": 1701655235,
   "score": 49,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw86fw",
   "message": "Oh man I want the woman version of this question",
   "created_utc": 1701652769,
   "score": 12,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw7gl2",
   "message": "My ex had a big bum, which I love anyway, and she had little stretch marks around her hips and on her actual bum. She hated them, but it was the first time I’d actually ever saw them on a woman, and they drove me nuts. \n\nI actively look for them now. Big booty for the win.",
   "created_utc": 1701652459,
   "score": 66,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwd00q",
   "message": "Her front teeth gap ❤️",
   "created_utc": 1701654844,
   "score": 82,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvy7hh",
   "message": "My ex was 4'11\" and she was super self conscious about it. I loved her height though, I really enjoyed the awkward kisses and hugs.",
   "created_utc": 1701648625,
   "score": 134,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw69e4",
   "message": "Her hair. She grew up in a super white environment and anything that doesn't match traditional white woman beauty standards is hard for her to see as beautiful on herself. Hair is a big one. Meanwhile I think her hair is absolutely gorgeous, like pretty much everything else about her.",
   "created_utc": 1701651938,
   "score": 16,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwbdiw",
   "message": "She despises the shape of her nose. Looking at it, I genuinely don't see any issues. For 99 percent of girls who detest their noses, this is true. Ladies, what are you seeing?",
   "created_utc": 1701654142,
   "score": 44,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwdbxr",
   "message": "Her stomach",
   "created_utc": 1701654987,
   "score": 42,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwf16r",
   "message": "Her tummy might not be flat, but it's my favorite pillow.",
   "created_utc": 1701655722,
   "score": 84,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbweik0",
   "message": "My wife thinks she’s chubby and is very conscious about it. She’s not chubby at all, she is curvy and super sexy❤️!",
   "created_utc": 1701655499,
   "score": 104,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwdsl9",
   "message": "My wife tries to do a practiced smile that makes her face look skinnier, think close to duck face. She has it down and she looks fine doing it, but I know her real smile is full checked and wide, and it’s the fucking best. She has a natural dimple and closer to a Betty boop face so I just hate that she’s been conditioned to go for anything but her natural beauty. But if it makes her happy I’m fine with it. Just I know in our private time what her true smile is. Wish she was more secure. I’ve told her this as well. And how much I loved it. But. Idk",
   "created_utc": 1701655188,
   "score": 36,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw3war",
   "message": "her Grey hairs",
   "created_utc": 1701650928,
   "score": 71,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw9c26",
   "message": "Dem thighs, thicker than a snicker.",
   "created_utc": 1701653267,
   "score": 97,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbvy32m",
   "message": "My soon-to-be-ex-wife is overly-critical of her teeth. She says they’re crooked but I told her good teeth are a must for me in a partner, and hers were amazing.",
   "created_utc": 1701648574,
   "score": 245,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw7bse",
   "message": "She says she's crazy but if her need to do well and be super organized and have everything on the calendar is crazy I could use some! I'm a bad planner and I sit in chaos most of the time. Granted I'm great in a crisis but I have files at work I should have organized many moons ago.",
   "created_utc": 1701652402,
   "score": 65,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwap0u",
   "message": "Her she doesn’t have much self confidence and when I compliment her she just gets this embarrassed smile and turns red. It is the cutest thing",
   "created_utc": 1701653851,
   "score": 65,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwe8a8",
   "message": "She has put on a few pounds, nothing crazy... I'm all about it",
   "created_utc": 1701655378,
   "score": 65,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwcq1f",
   "message": "Not currently in a relationship, but previously I was told by many girls who had hip-dips that they hated them, I genuinely find them very attractive idk why. Like any girl I’ve ever liked had them coincidentally",
   "created_utc": 1701654727,
   "score": 30,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwky11",
   "message": "She has vitiligo. I find it interesting and like to see it.",
   "created_utc": 1701658375,
   "score": 34,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwog5v",
   "message": "Her stomach. My wife is a little on the thicc side and I am absolutely madly in love with her belly. The softness and comfort of her belly just makes me go feral.",
   "created_utc": 1701659951,
   "score": 33,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwwt1l",
   "message": "My girlfriend hates her nose and says it’s big and people have made fun of her for it before. I love her nose so much. The shape of it, the freckles on the bridge, it’s perfect. She’s perfect",
   "created_utc": 1701663858,
   "score": 29,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwbrps",
   "message": "freckles. She is the only one in her family with freckles, she never liked them. I find her face so beautiful specially  her freckles",
   "created_utc": 1701654313,
   "score": 89,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwdvmq",
   "message": "Her “poop colored eyes”",
   "created_utc": 1701655224,
   "score": 90,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwixsu",
   "message": "I'm dating a man but fuck it I'm gay so here we go. My boyfriend thinks he's ugly because he's fat. But he gives the best hugs and the best cuddles and I don't think they would be this good if he was skinny. I love that he's chubby and cute, but he hates when I say I love his body because he doesn't.",
   "created_utc": 1701657471,
   "score": 215,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwayrd",
   "message": "My spouse has the most gorgeous grin, but she closes her mouth when someone snaps a picture of her. She doesn't believe me, despite my repeated assurances to her.\n\nMy wife doesn't seem to think I look like a troll, but I do.",
   "created_utc": 1701653967,
   "score": 57,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwb8du",
   "message": "[deleted]",
   "created_utc": 1701654079,
   "score": 130,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw39xr",
   "message": "My ex hated her “small breasts.” They were a pretty nice size… they just weren’t porn star HUGE.",
   "created_utc": 1701650665,
   "score": 77,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbw5alo",
   "message": "her. literally.",
   "created_utc": 1701651522,
   "score": 56,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwcl46",
   "message": "My girlfriend says she's overweight but I think it makes her even more attractive.",
   "created_utc": 1701654669,
   "score": 115,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwinbo",
   "message": "Her mama pooch. I looooove it soooo much. I love her entire new mom bod she is just absolutely more hotter than ever. She feels gross about her self alot and I can't stop complimenting her and drooling over her lol.",
   "created_utc": 1701657342,
   "score": 28,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwwoud",
   "message": "wholesome thread 🫶",
   "created_utc": 1701663810,
   "score": 26,
   "submission_id": "18a5znr"
  },
  {
   "comment_id": "kbwdzmn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18a5znr"
  }
 ]
}