{
 "submission_id": "18bdszg",
 "title": "What are some laws everyone claims they agree should be changed, but no one is making any real effort to do so?",
 "selftext": "",
 "created_utc": 1701788540,
 "permalink": "/r/AskReddit/comments/18bdszg/what_are_some_laws_everyone_claims_they_agree/",
 "score": 151,
 "url": "https://www.reddit.com/r/AskReddit/comments/18bdszg/what_are_some_laws_everyone_claims_they_agree/",
 "comments": [
  {
   "comment_id": "kc3pyaj",
   "message": "Civil Asset forfeiture. It is the legal highway robbery where cops can take your stuff (typically cash) without needing proof or charging you of a crime. The department often gets a percentage of the take from the feds. The only way you can get it back is to sue them for it. You'll probably spend more on legal fees than the money they stole. \n\nThere is a little bit of movement on it in some states, but holy crap that should never have been allowed in the first place. The constitution protects us from unreasonable search and seizure, but apparently congress made the loophole.",
   "created_utc": 1701791583,
   "score": 154,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3mjw7",
   "message": "Gaping loopholes that allow lawmakers to accept bribes.",
   "created_utc": 1701790056,
   "score": 211,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3pq0i",
   "message": "[Civil forfeiture.](https://youtu.be/3kEpZWGgJks?si=Xc_8LIcJkedcs76Z)",
   "created_utc": 1701791489,
   "score": 54,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3t14t",
   "message": "Daylight Savings",
   "created_utc": 1701792840,
   "score": 67,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3tlot",
   "message": "Tax Simplification",
   "created_utc": 1701793069,
   "score": 17,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3mcev",
   "message": "American minimum wage laws for tipped employees.     \n     \nReally, American labor laws in general.",
   "created_utc": 1701789931,
   "score": 88,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3khb6",
   "message": "Old people need to get retested for drivers license.",
   "created_utc": 1701788572,
   "score": 96,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3xbz5",
   "message": "Civil forfeit and filial support laws. also where it still exists lifetime alimony that prevents the payer from retirement.",
   "created_utc": 1701794545,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3lira",
   "message": "Blurring Japanese porn",
   "created_utc": 1701789342,
   "score": 46,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3yf35",
   "message": "daylight savings",
   "created_utc": 1701794968,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3u2do",
   "message": "Term limits for the assholes in DC.  Every single one of them.  Stop letting corpses run our lives and our country.",
   "created_utc": 1701793254,
   "score": 38,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3vzz1",
   "message": "Mari-fucking-juana  \n\n\nThe fact that it is legal in almost all states for \"medical\" use  \n\n\nAnd legal for recreational use in a substantial quantities of others\n\n\u0026amp;#x200B;\n\nBut is still a schedule 1 narcotic at a federal level and there's been no serious attempt to change this.  \n\n\nThis borders on dereliction of duty by our elected officials.",
   "created_utc": 1701794021,
   "score": 13,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc40y3s",
   "message": "Members of government (especially Congress) using insider information to get rich. Example- Nancy Pelosi, who hasn’t had a job outside of politics or government in since the 1960’s, is worth [$115 million](https://finance.yahoo.com/news/rich-nancy-pelosi-164446393.html).",
   "created_utc": 1701795948,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3ny7p",
   "message": "Term limits for politicians",
   "created_utc": 1701790741,
   "score": 25,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3lu61",
   "message": "40-hour work week",
   "created_utc": 1701789568,
   "score": 24,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3s2se",
   "message": "reddit really thinks reddit is \"everyone\"",
   "created_utc": 1701792455,
   "score": 21,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc428ee",
   "message": "A little off the beaten path here but:\n\nJunk mail. I know there are registry services available that can help reduce the amount of junk mail a person receives at their home address but at a maximum, they only last 5 years and need to be renewed. And even that doesn't get you removed from all the junk mail lists, just some of them. \n\nHow many forests and trees are cut down and ground to pulp for paper ads in a mailbox that the recipient will most likely just throw in the garbage upon arrive every year? And the ink that the majority of them use are toxic. It's supremely wasteful and it convinces almost no one of anything these days. If I need a dentist, I'll find a damned dentist. I don't need three ads in my mailbox everyday for three different new dental offices. Coupons should be switched to in app use, with rare exceptions for rural areas where internet is spotty. \n\nHow much money could we save every year, how many trees would we save every year if we were to implement something like that? Lots. That's how many.",
   "created_utc": 1701796446,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3oly1",
   "message": "Atheists can’t hold office according to laws in 7 states, including mine",
   "created_utc": 1701791025,
   "score": 10,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3p2wt",
   "message": "There are still sodomy laws and other anti-gay laws on the books in many US states, not being enforced at the moment. Waiting on another conservative trend to force people into heterosexuality and into living by their beliefs.",
   "created_utc": 1701791224,
   "score": 15,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3vq3d",
   "message": "Silencers on the NFA \n\nEntrapment laws: The bar is set so high Entrapment is no longer a defense.",
   "created_utc": 1701793911,
   "score": 7,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3pmwo",
   "message": "Employment laws in the U.S. are archaic and people don't realize it until they are on the losing end of a situation.",
   "created_utc": 1701791454,
   "score": 5,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3o51a",
   "message": "Term limits.",
   "created_utc": 1701790823,
   "score": 8,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3qyoz",
   "message": "Drug laws or tax loopholes seem prodmoniate in this conversation .",
   "created_utc": 1701791996,
   "score": 2,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3wwdx",
   "message": "Restrict stock purchases and enforce insider trading laws for any government employee who is involved in enacting policies that will affect companies, primarily congress.",
   "created_utc": 1701794375,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3y2do",
   "message": "Daylight savings, weed and term limits",
   "created_utc": 1701794832,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3z46o",
   "message": "Everyone wants a secular democracy system until they start acting truly secular about things and not allowing for any special exemptions.\n\nLike damn, being secular isn't inclusive. It's completely removed from any and all iconography associated with religion. Government sans religion.\n\nFair and equal are not synonymous at all times and you can't have your cake and eat it to with this. Either be secular or be inclusive to everyone.",
   "created_utc": 1701795235,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc42sf2",
   "message": "Getting rid of daylight savings time.",
   "created_utc": 1701796663,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc43h9m",
   "message": "Eliminating daylight savings time",
   "created_utc": 1701796927,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc44rx4",
   "message": "Reform surrounding ‘service animals’ and ‘emotional support animals’.\n\nI know a few people that have actual service animals who absolutely hate people that expect ES animals to be treated the same.\n\nThere should be legal certification for a service animal that can be presented when requested, and there is no reason any animal that is trained as a service animal should not receive that certification.",
   "created_utc": 1701797421,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3u72h",
   "message": "Teachers should be paid way more and more money for classroom expenses.",
   "created_utc": 1701793306,
   "score": 5,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3lr1i",
   "message": "Marijuana laws. At least the Republicans are fairly consistent on the issue. They’ve always been proponents of stupid, damaging drug war policies. The Democrats, on the other hand, talk a good game about ending the drug war and repairing some of the damage and legalizing or decriminalizing drugs, but they don’t actually do it. They’ve been promising action on marijuana banking since it started becoming legal, but making promises is all they do. Anyone who knows anything can see plain as day that weed should be fully legal, but even the politicians who claim to agree are doing the absolute bare minimum about it so they can dangle it over our heads for votes as long as possible.",
   "created_utc": 1701789506,
   "score": 3,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3l5a3",
   "message": "Repairing the Electoral College system in the US.",
   "created_utc": 1701789072,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3rtko",
   "message": "The loopholes in our tax laws in the US",
   "created_utc": 1701792350,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc43slo",
   "message": "This is such a good question. Something I think about all the time. The list is long.",
   "created_utc": 1701797049,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc43wv0",
   "message": "The Electoral College.",
   "created_utc": 1701797093,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3tomf",
   "message": "In the US? More sensible gun control laws. \n\nSome 90% of Americans agree that a mentally ill 18 year old shouldn't be able to legally buy an assault rifle with a high capacity magazine, or that violent felons should be able to go to gun shows and buy those same weapons without a background check. \n\nBut the NRA wields too much influence, like so many other well-funded special interest groups. Money subverts the will of the people.",
   "created_utc": 1701793102,
   "score": 245,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3mt95",
   "message": "Charging unhealthy people the same as healthy people for insurance.",
   "created_utc": 1701790194,
   "score": 243,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3nnbd",
   "message": "civil rights type laws usually.",
   "created_utc": 1701790607,
   "score": 253,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3rw4x",
   "message": "I think if more people were familiar with \"Borrow, Buy, Die\" loopholes, we'd have very different views on extreme wealth.",
   "created_utc": 1701792378,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3ysxu",
   "message": "Marijuana being illegal. I looked it up recently. Results from Pew here. https://www.pewresearch.org/short-reads/2022/11/22/americans-overwhelmingly-say-marijuana-should-be-legal-for-medical-or-recreational-use/\n\n59% of Americans support full legalization and 30% support medical marijuana.\n\n89% of Americans approve of legalizing it in some capacity. Getting 89% of Americans to agree on literally anything is almost impossible, yet for some reason that 11% has been able to keep it illegal for large portions of the country.",
   "created_utc": 1701795113,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc3zdj7",
   "message": "Seasonal time changes",
   "created_utc": 1701795333,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc42245",
   "message": "Virtually everyone thinks tax laws should be reorganized in one way or another. The tax act in most western countries are hundreds upon hundreds of pages long (if you make it a book it's probably multiple volumes of thousand pages each). You don't even need to make changes to underlying policy, you can just take the status quo and make it significantly easier to apply and understand.\n\nBut it would never happen because it's virtually impossible to get any politician to run on tax code reform and the tax lawyers/accountants will fight like hell to keep it the way it is because the more arcane/challenging it is to understand the more valuable they are.",
   "created_utc": 1701796377,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc42m3b",
   "message": "Time change.   They actually passed it in senate?  And congress?  (May be reverse)  wouldn't",
   "created_utc": 1701796595,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc42szw",
   "message": "Prescription Medical advertising on Television being legal. At best it should be allowed on specific medical stations geared towards doctors or during specific medical shows, maybe a few exceptions for elective procedures here or there.",
   "created_utc": 1701796669,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc43a7b",
   "message": "getting rid of jaywalking law",
   "created_utc": 1701796852,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc43rfh",
   "message": "Campaign finance reform. The current system is only popular with rich fucks who enjoy their outsized influence on policy.",
   "created_utc": 1701797036,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc44v83",
   "message": "Drug reform\n\nHealthcare reform\n\nCongress profiteering",
   "created_utc": 1701797456,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc44y1i",
   "message": "Bankruptcy laws - somehow mega rich can declare bankruptcy because they gambled wrong and come out a POTUS, but people who have had to declare bankruptcy because of health issues never recover.  It's become a tool of the rich/well-off to shed unwanted debt",
   "created_utc": 1701797486,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc45fp7",
   "message": "The electoral college. I know it’s incredibly difficult to get it done-requires 3/4 of house or senate-but people have been talking about it ever since George W. Stole the election.",
   "created_utc": 1701797672,
   "score": 1,
   "submission_id": "18bdszg"
  },
  {
   "comment_id": "kc45gfy",
   "message": "Term limits for politicians in Washington",
   "created_utc": 1701797680,
   "score": 1,
   "submission_id": "18bdszg"
  }
 ]
}