{
 "submission_id": "18bemry",
 "title": "What made you \"nope\" out of a friendship?",
 "selftext": "",
 "created_utc": 1701790681,
 "permalink": "/r/AskReddit/comments/18bemry/what_made_you_nope_out_of_a_friendship/",
 "score": 116,
 "url": "https://www.reddit.com/r/AskReddit/comments/18bemry/what_made_you_nope_out_of_a_friendship/",
 "comments": [
  {
   "comment_id": "kc409aj",
   "message": "Constantly trauma dumping \u0026amp; making the entire friendship all about themselves \u0026amp; their issues. But when I wanted to vent/rant myself I wasn’t listened to",
   "created_utc": 1701795677,
   "score": 230,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3prvq",
   "message": "I was the only one starting conversations, so I stopped talking and we never spoke again.",
   "created_utc": 1701791510,
   "score": 28,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc46294",
   "message": "My kidneys failed. They healed up. Then I got a funny-looking lab test a few months later. I told a friend, \"I think my kidneys are failing again!!\" She sighed loudly, and said \"AND? What's that to ME?\" She'd just been complaining about her stupid, lazy co-workers for about half an hour. But she couldn't bother to listen to me. That was the last time I talked to her. (My kidneys were OK, though.)",
   "created_utc": 1701797911,
   "score": 136,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3oxmm",
   "message": "Bragged about possibly scamming someone out of 10k.",
   "created_utc": 1701791162,
   "score": 95,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3ov5i",
   "message": "She started using me as an alibi when cheating on her husband. Didn't even ask me first, not that I would have agreed to it, it was so audacious. And her husband was a super nice guy that I really enjoyed hanging out with, and she ruined that friendship too by using me as her alibi.",
   "created_utc": 1701791133,
   "score": 161,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3y308",
   "message": "Someone took pity and sat me down. Explained that nobody I thought of as a friend was really a friend. I was just surrounded by people who acted friendly to me so they could use me. \n\nStarted looking at things with my eyes opened to that and she was right. Lots of people claimed to be my friend but never actually included me in anything they ever did with their real friends and was never available when I invited them to go do things with me as a friend. \n\nIf I don't initiate the contact I never hear from anyone until they show up needing someone with a pickup truck, or to help them with their work, or needed my access to someplace.",
   "created_utc": 1701794839,
   "score": 139,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3q99n",
   "message": "A lack of emotional support whenever you need a listening ear (both positive and negative things) \u0026amp; feeling worse after offloading than before you shared anything",
   "created_utc": 1701791708,
   "score": 56,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc43h88",
   "message": "I tried to hang out multiple times. They canceled or ghosted me day of each time. I get things coming up but eventually you just have to realize your worth.",
   "created_utc": 1701796926,
   "score": 55,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc49lgk",
   "message": "I’d been friends with this guy for like 3 years. I was giving him a ride since he was in a bad spot financially and didn’t have a car. He mentioned that the reason he was working for his friend’s t-shirt printing business for like $9 an hour was because he got paid in cash and his baby mama couldn’t take child support from him. All the time I had known him, I had no idea he had a daughter, and I was giving him rides because of a situation he created himself so he could defraud the mother of his child out of what little support she was owed from him. Fuck deadbeat dads. I kicked him out of my fantasy football league too.",
   "created_utc": 1701799252,
   "score": 77,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc44wcz",
   "message": "Friends with a couple whose kids were the same age as mine. Over 10 years, we’d get together a handful of times each year. We lived in different towns, but close enough to drive to for an afternoon to hang. At one point, I recognized I had been calling him, but either catching him at a bad time or going to voicemail. After the fourth attempt to connect, when I spoke to him, he said he had about 5 minutes to chat as he was heading into a meeting. I said, no worries, call me when you have time. It’s been at least 4 years. Know your worth.",
   "created_utc": 1701797468,
   "score": 37,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3qqc4",
   "message": "They couldn't understand working a full time 9-5 meant I could not randomly go out drinking until 2 AM during the week.",
   "created_utc": 1701791900,
   "score": 60,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3yqzj",
   "message": "25 years. She became obsessed with a sport broadcaster, Brian Formica, and started stalking him. They started dating! I was happy for her. I met them at Chipotle and he said something racist (the n word) about another broadcaster and I felt uncomfortable. Next she started stalking him to such an extreme I didn’t hear from her for a year. Finally he escapes to Arizona. Meets a woman. Goldie met a new guy but kept sending me photos of Brian’s new fiancé. Texting me daily about how much she hates her. For months. Suddenly I had an issue with my teeth. Over 25 years I thought talking about issues was a two way street. I texted her I was headed to the dentist and she wrote back, “omg if you ever talk about your teeth again, I’m going to block you.” I never judged you for your borderline personality disorder, but if you chose this as your hill, meh, you’re shitty. And this was a year after her wedding to the trucker. You’ve inundated me with your continued stalking whilst being married now, but I can’t talk about my medical issue? Bye, Goldie. I’m tired of your shit.",
   "created_utc": 1701795093,
   "score": 60,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3r2ao",
   "message": "She came out as bi, we said cool. She came out as gay, we said cool. She started spending more time in gay spaces, we were supportive. She then became a gay-supremacist saying shit like \"the straights are less evolved than us\" and saying that shit to our friends who are some of the *biggest* allies I've ever known.",
   "created_utc": 1701792036,
   "score": 179,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3shr4",
   "message": "She became an alcoholic with no self control and wouldn't get any help in spite of her young children begging her.  She added prescription drugs to the mix and went further downhill.  Cheated on her husband (who was a lifelong neighbor and friend of mine) and used me as an excuse (without me knowing).  She blamed me for her dog attacking two other dogs and then her.  Color me DONE.",
   "created_utc": 1701792624,
   "score": 25,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4284u",
   "message": "He was always late. It made it impossible to plan anything.  A lunch, movie, even just a walk.  Not worth the aggravation.  \n\nThere were times I'd be at the restaurant at the agreed time and he would still at home but 'on my way'\n\nNope.",
   "created_utc": 1701796443,
   "score": 50,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc41a6f",
   "message": "When they replied “ok I see” or “ ok” to your venting texts and they expected you to reply long paragraphs to them when they’re venting to you.",
   "created_utc": 1701796076,
   "score": 24,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4d214",
   "message": "Not respecting my boundaries.  Expecting me to drop what I was doing at a moment's notice to accommodate her.  Getting together had to always be at HER convenience rather than at a time that worked for both of us.",
   "created_utc": 1701800599,
   "score": 22,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3ugo9",
   "message": "Sexually harrassed two my friends.\n\nNo second chances on that one.",
   "created_utc": 1701793411,
   "score": 40,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc48wqs",
   "message": "It’s lame but realizing 1) they never reached out first 2) they don’t bother asking me how I’m doing. They just talk about themselves",
   "created_utc": 1701798990,
   "score": 17,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc46ria",
   "message": "did not respect my boundaries",
   "created_utc": 1701798179,
   "score": 16,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc430hs",
   "message": "alcoholism. it changes a man for the worse. and that's an understatement.",
   "created_utc": 1701796750,
   "score": 15,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4dg2h",
   "message": "She started gate keeping depression and mental health issues. Because she thought I had a \"better\" childhood and less trauma than her I wasn't allowed to be depressed or have mental health issues.",
   "created_utc": 1701800752,
   "score": 15,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3r6eo",
   "message": "Broken promises",
   "created_utc": 1701792084,
   "score": 14,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc472n0",
   "message": "He once drove over a hedgehog for fun.",
   "created_utc": 1701798299,
   "score": 14,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3rd1j",
   "message": "He turned out to be a pedo",
   "created_utc": 1701792162,
   "score": 31,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4culp",
   "message": "He kicked my dog. That's like kicking my kid.",
   "created_utc": 1701800520,
   "score": 31,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4ebrd",
   "message": "Friend for 3 years - Played in a every-other-week Dungeons and Dragons campaign together.\r  \n\r  \nShe was struggling financially and about to lose her house so I got her a well paying job where I worked (paid almost twice as much as she was making).\r  \n\r  \n2 years into the job she starts telling HR (monthly) about how horrible of a supervisor I am and that I'm verbally abusive and need training. Mind you I have been a supervisor in this department for 7 years at this point and never had this issue. \r  \n\r  \nHusband starts working with us as well, and she begins to tell HR that he is sexually harassing her.\r  \n\r  \nWe were all still in a D\u0026amp;D campaign together and she said she needed time to talk to her therapist about whether or not she should stay friends with us. She claims she didn't feel safe at our house anymore. We tried to be respectful of this and let her do what she needed to do.\r  \n\r  \n5+ months of not only the constant fights at work, but the reporting and almost getting myself and my husband fired, along with holding our friendship like a carrot on a stick, I finally said fuck this and told her that I no longer felt safe with her at my house and she could lose my number.\r  \n\r  \nCOVID thankfully saved a very toxic situation by sending us all to work from home. She was still telling our mutual friends that it was \"any day now\" that I would get fired. \r  \n\r  \nEarlier this year she quit to work somewhere else.\r  \n\r  \nI've never been so happy to get out of a friendship as I did with her.",
   "created_utc": 1701801093,
   "score": 28,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4ancn",
   "message": "Friends for like 12 years. We only ever smoked together and hung out, she was in an abusive relationship so she was never able to leave the house and go somewhere w me. I’d always go to her and try to be a supportive friend. \n\nI got pregnant and she was one of the first few ppl I told. I told her on a phone call btw. \n\nI posted a pic around 18 weeks and she commented saying she didn’t know blah blah. I let it slide. \n\nAt 7 months she asked me to sign up for some things so she could get the free $5 or whatever they offered. She also asked me to borrow money, all of which I did. \n\n2 hours after I gave birth (she knew I was in the hospital) she texted me that her cat died. No congrats, no where’s the baby, nothing about me or my son. I told her I quite literally can’t talk about this right now. She got pissed off about it but I didn’t care. A few months go by and this entire time she’s steadily posting on fb begging for help, for money, for cat food, anything she needed. I knew her financial situation, she received full disability and had no bills to pay.  She was blowing that money on cocaine, alcohol, and tattoos. I got fed tf up and deleted her. Her boyfriend texts me after a week and asks why I deleted her but not him, how she’s bent out of shape and doesn’t understand why I don’t want to be her friend. I deleted him, screenshot the “add friend” on his profile and said problem solved.",
   "created_utc": 1701799657,
   "score": 13,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4fvtb",
   "message": "Tried to help this person get a job. Rewrote his resume, filled out the application, even offered to drive him to his drug test. He was basically hired, and all he had to do was pass the drug screen. He didn't make it to his drug test in time and wasn't hired. He didn't bother to thank me for helping him out, so I didn't bother to continue the friendship.",
   "created_utc": 1701801690,
   "score": 13,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc48goa",
   "message": "Had an ex friend beat the shit of his then girlfriend. Turned out he had a history of it. Done. Had another friend that was manipulating men to giving her money . Done",
   "created_utc": 1701798821,
   "score": 12,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc45go9",
   "message": "About 15 years ago he and his GF moved in with each other and adopted a dog from an animal rescue. A year later they break up. She says he can keep the dog. He didn't make too much money and had to work a ton of hours, so he determined that he couldn't keep the dog any longer. Instead of contacting the shelter to see if they could rehome him, he had the dog put down. He literally could have asked me to take the dog and I would have. I haven't talked to him since. I found out later from his ex that 1) he didn't know if the vet would put down a healthy dog, so he told them that he was biting children. 2) He didn't contact her to see if she would take him prior to making the decision to have the dog killed. \n\nThat should be the end of the story, but it isn't. After she left him, she goes back to college, where she runs into one of her ex's and my mutual closest friends. They start dating and eventually get married. I was a groomsman in the wedding. A few weeks after the ceremony, I received a handwritten letter in the mail calling me all sorts of horrible things and saying if he ever ran into me, he would kick my ass. Three of my other friends and the groom received a similar letter. He hasn't tried to contact me in the last 10 years or so.\n\nLast summer, he sent his ex and her husband a bunch of pictures of the three of them from when we were all in high school. With a note (that I believe was in the form of a poem— but this has been a subject of debate between my friends and I) about how we all betrayed him. They now have a restraining order against him.",
   "created_utc": 1701797682,
   "score": 11,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4srla",
   "message": "Friend of 13 years. We had spent some time not really talking very often because she had done a pretty crappy thing in canceling plans with me to go flirt with a bunch of men at a party, while she had a longterm boyfriend of about 4 years. Besides this, she was also becoming increasingly agitated and aggressive in general. I didn’t say a word about it, I was just dealing with my anger in silence. I wasn’t initiating any conversations or hanging out because I was upset that she wasn’t taking accountability for any of her wrong actions lately, including getting into legal trouble for grand theft. I was taking time to rethink our whole friendship and decide how I wanted to go about it. We lived one street over from each other at the time, so I knew I wanted to go about it tactfully to keep the peace. There was one instance during this period in which she texted me about a new movie coming out, and I replied lightheartedly as normal and that was it for another few weeks.\n\nWell, during these few weeks of us not talking, we ran into each other in a public setting. She said, and I kid you not, that she hoped I’d get hit by a car. That told me that she knew there was a reason we weren’t talking, and that she knew I wasn’t happy with her. Instead of trying to solve it like adults and mend a 13 year friendship, she resorted to death threats. I knew we were never speaking again if I had anything to do with it. \n\nFor about 2 years after the fact, she used apps to call and text me from different numbers. Or she would have a friend of hers call me and pretend to be someone looking to get in touch with me, a grown man for example, and then switch it over to her. She was full on manipulating me into talking to her one way or another. Her text messages would consist of really pitiful lines such as, “It’s me your old best friend, the one you forgot about. I’m still around, you know.” or, “Please just hear me out I really have something to say.” or, “Are you still mad at me? I don’t even know what I did.” Constantly trying to bait me to respond emotionally when she could’ve just typed out whatever she wanted me to know, if it was that important. She never had anything to say for herself, never a SINGLE apology, only some sad attempts to regain contact and control.\n\nI think when it finally stopped for the most part was one night she kept calling my cell phone as well my parents’ home phone very late at night. If you picked up, there would either be silence or some man’s voice saying what a “little slut” I was. My father told the man he needed to stop calling, but he persisted. There had been probably 20 phone calls. I finally gave up and texted HER personal number, telling her that I was over her nonsense and was going to get the police involved. She said, and this is almost word for word, “How do you even know that’s me? I’m sure I’m not the only person in the world who has your cell and home number.” but the calls stopped right away, of course. \n\nThere was never anymore contact from her part, but a bunch of random things kept showing up at the end of my driveway. Drinks, empty fast food bags, a tied-off plastic bag of vomit. Probably like once a week. I put multiple cameras up, one facing the driveway, and that hasn’t been an issue anymore either.",
   "created_utc": 1701806629,
   "score": 11,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3o8yg",
   "message": "He smelled terrible. Once he was let go from work I never spoke to him again.\n\nI worked with him for about a year. He was.. okay. Huge liar. But we had similar interests so occasionally a good conversation would be had.\n\nRegardless. The smell. It was dreadful. It was like BO and Death wrapped into one. I work with another guy who is a volunteer fireman and EMT, and he claims he has smelled dead bodies that didn't stink as bad as this dude. A man who has entered homes that had bodies rotting in them, claimed this guy I worked with smelled WORSE than that. I don't know how that's possible.",
   "created_utc": 1701790870,
   "score": 41,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4cduj",
   "message": "Great question!\n\nI had a friend that was not intelligent in her decision making and I just couldn't take it... \n\nShe would be talking to dudes in jail off of dating sites, sending them her last money to dudes in jail, could never keep a job, dating pimps \u0026amp; really would be delusional enough to think that he wanted love.. I couldn't take being around constant chaos like this.. \n\nSo I said nope",
   "created_utc": 1701800342,
   "score": 11,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3v5v5",
   "message": "It was one way. I did all the inviting and arranging to meet. When I dropped it they couldn’t believe I was no longer interested in being friends at all.",
   "created_utc": 1701793688,
   "score": 20,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3x58y",
   "message": "realized he jsut wanted to be mad at the world and everything",
   "created_utc": 1701794471,
   "score": 21,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc42hlv",
   "message": "All she did was talk badly about people around her and judge.",
   "created_utc": 1701796547,
   "score": 9,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc499jg",
   "message": "I always gave him rides to uni, and one day also picked up another friend of mine he hadn’t met. Second friend being very attractive, first friend decided it was appropriate to basically gush over him and make suggestive comments and even noises the whole ride to school. It was so awful and uncomfortable; I was mortified and walked away from him that day.",
   "created_utc": 1701799127,
   "score": 8,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4a64e",
   "message": "She started going out with the guy she knew i had a crush on and started asking me to third wheel so her parents would let them hang out. they would proceed to ditch me and do naughty things while I was left alone.",
   "created_utc": 1701799474,
   "score": 7,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4fbsp",
   "message": "He admitted to raping someone.",
   "created_utc": 1701801475,
   "score": 8,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4g6cm",
   "message": "When she told jobs not to hire me, slandered my name to a point where I was unemployed for almost two years.",
   "created_utc": 1701801804,
   "score": 7,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4jvw7",
   "message": "that one ukrainian guy decided to move into our town. At first he was a cool guy, one of my best friends. now few moths after words like dickhead and asshole arent enough to describe his behavior (he even was joking that he would stab me with the knife he was holding in his hand because that made him laugh).",
   "created_utc": 1701803226,
   "score": 7,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc61nwf",
   "message": "When I realized I was merely the Chauffeur.",
   "created_utc": 1701824894,
   "score": 8,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc425vq",
   "message": "He thought it was funny to drive by my house and send me pictures of my car in my driveway to prove I was home and ignoring his texts. I get it was a joke because that's just how it is, we both had a fucked up sense of humor but it was low key creepy and made me have a horrible feeling towards him since and I never spoke to him again. We were 17.",
   "created_utc": 1701796418,
   "score": 13,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3sy8n",
   "message": "emotionally needy",
   "created_utc": 1701792808,
   "score": 6,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4dv2f",
   "message": "My good friend, a female. I'm a male. Got into a relationship with a very insecure guy. I painfully had to tell her to have a nice life with him. And only him. It was so stressful to hear about all the problems he would give her for being my friend.\n\nTo this day I am still crushed, but hopeful we may reconnect in the future",
   "created_utc": 1701800914,
   "score": 5,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4szld",
   "message": "We'd been friends over 20 years.  I moved out of state but we always kept in touch.  My mother gets leukemia.  The treatment was supposed to put her in remission and she was supposed to live.  That is not the way it happened.  My friend knew she had leukemia but didn't call for 10 months.  At the end of the conversation she casually threw out \"oh how's your mom.\"  My elderly mother with leukemia?  She's dead, thanks for asking.  You moron.\n\nI wouldn't be so hurt except when her sister got cancer I called her and listened and empathized and did what a friend is supposed to do.",
   "created_utc": 1701806715,
   "score": 6,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc45pln",
   "message": "Not one single event but this one friend, I thought we were good friends, he said we were good friends but he would neglect replying to text’s because he was trying to find something clever to say and then he’d forget. Last time I spoke with him, I told him I was seeing someone but we were both kind of busy so we were going to discuss it then. It was going to be a nice surprise because I’m seeing a mutual friend. This was five years ago. He never followed up, never reached out. I realized I was doing all the work. He said he wants us to be friends but I can’t do it alone. I assume we’re no longer friends as I never heard from him again. \n\n*He’s married and was never interested in me, although for a while I was interested in him 20 years ago, so it’s not a jealousy thing.",
   "created_utc": 1701797777,
   "score": 6,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4e8tv",
   "message": "She acted jealous towards me. It’s really impossible to be friends with someone who cannot celebrate your wins.",
   "created_utc": 1701801062,
   "score": 5,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4eb0w",
   "message": "Started claiming he was a Crip and acting like a big deal despite the fact that he still lived in his moms townhouse and sold weed at 30 yo. Also told me I would never understand how evil the gays are because I don't get black culture.",
   "created_utc": 1701801085,
   "score": 5,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4p8a6",
   "message": "When people don't respect me, my boundaries, and my time. I would love to have some more friends in my city, since my close friends have all moved around the country the past few years. But I've gotten to a point in my life where I am very happy with myself and with my life and I am not willing to bring people in who can't show me the same level of respect that I show for others. If we aren't on the same level of emotional intelligence, I'm sorry but it just isn't gonna work out!",
   "created_utc": 1701805265,
   "score": 5,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5kozs",
   "message": "She was friends with everyone, and talked shit behind everyones back, \"but only to me because we are best friends\"!! Yeah, sure.",
   "created_utc": 1701817439,
   "score": 4,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc49xrq",
   "message": "She came on to my husband in front of me.",
   "created_utc": 1701799385,
   "score": 8,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4mrsa",
   "message": "Friends for 15yrs. Her father dies and I wasn’t invited to the funeral bc it was for family only. He was like a father to me, more than my own. And I certainly was “family” when they asked me for favors.",
   "created_utc": 1701804316,
   "score": 8,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4u5si",
   "message": "When the closeted racist decided I was a good enough friend to start dropping the N word in my presence.",
   "created_utc": 1701807162,
   "score": 4,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4gk80",
   "message": "We used to get high and just chill. Then one day a friend pulled out cocaine and did a line, and my other friend joined in. That was the last day I hung out with them.\n\nOne of them is now passed, and it was never revealed the cause. The other went to prison.\n\nI got married, bought a house, and have a successful career with six figures. We all have a choice.",
   "created_utc": 1701801953,
   "score": 6,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc41ehg",
   "message": "Had a guy who was a friend for a few years and we just grew distant after friend groups started dividing. He’d then sent a message to me like he was referring to someone not on that level, like an employee for lack of a better word, so I left the group he was in (gracefully).",
   "created_utc": 1701796123,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc49mz5",
   "message": "Ex-friend cheated on her partner and when her life went downhill she started acting like a spoiled brat. Was fired from her job for screaming at her boss because she felt entitled to a promotion when she'd only worked there 6 months. Lied about her ex being abusive then admitted she'd lied. Was offered new jobs by friends and her mum but refused to work. Borrowed money for medication but spent it on amazon crap. Stole another friends estrogen pills. Just a mess.",
   "created_utc": 1701799268,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4b9ea",
   "message": "They constantly messaged me and it was always to trauma dump. I haven’t spoken to them in two years now and they’re blocked but every time I get a notification from messenger I cringe automatically and then feel relieved I have them blocked and it can’t be them messaging me.",
   "created_utc": 1701799895,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4bcpp",
   "message": "My former friend didn't respect me as a person and I got tired of walking on eggshells around him. He felt that he had the right to \"do what was best for me\", which to him was basically making me a clone of him. Everything I said or did had to be approved by him, and if I didn't get his approval he would get upset at me. That would come in the form of constant passive aggressive comments at me that he would claim were \"jokes\" if I didn't just sit there and take them. They were in reality just thinly veiled insults. He would scour my social media accounts just to make the same stupid, unfunny \"jokes\". He even found an old reddit account just to do the same shit, and dig up info I wasn't comfortable sharing irl just to bring it up in irl conversations. I couldn't have my own opinions, I had to share his garbage opinions. I couldn't play games the way I wanted to, it had to be his way because it was the \"correct\" way to play. According to him, the \"correct\" way to play was to be a sweat lord all the time. Gaming was supposed to be a time to unwind but gaming with him just became a chore. He'd get upset if I wasn't getting upset enough at the game because he'd claim that I don't care about winning, but if I *did* get upset he'd just mock me and say \"woah bro it's just a game chill.\" He always had rules and expectations for me (and our other friends) to follow but would *never* follow them himself. In our 6 year friendship he apologized a total of *1* time even though there were far more than just that one instance that he should've apologized for. All of the other times ended with me being required to apologize to him even if I was the victim in the situation. Even his one \"apology\" was less of an apology and more of him making excuses for why he felt like he was justified in blowing up at me, again (he blamed work).\n\nI dropped him as a friend a few months prior to the first covid lockdowns, and for 2-3 years after that he kept trying to weasel his way back into my life. I think he finally got it after me ignoring him for 3 years. Ending the friendship in any official capacity would've led to drama that I didn't want to deal with and more likely than not me being pressured to apologize again and remain stuck in that shit friendship. I let some of my other friends know that I wouldn't be speaking to him anymore because I wanted to stay friends with the rest of them, and they advised against cutting him out of my life. I didn't listen and fortunately they eventually relented and those friendship are still alive.",
   "created_utc": 1701799930,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4buer",
   "message": "He told my other friend that I was a bad person behind my back. Said that if my one friend lent me his laptop, I’d probably just steal it because “thats the kind of guy I am.” I’ve never stolen anything in my life apart from a few times I shoplifted chocolate bars from 7/11 when I was like 13. And I would ESPECIALLY never steal anything from my friends. \n\nConfronted him about it and he said he was “just joking” and didn’t apologize. I was friends with the guy for like 8 years all throughout high school and years afterward. We’d had feuds before but this time he actively tried to sabotage me. Haven’t hung out with him since.",
   "created_utc": 1701800119,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4ghng",
   "message": "I have ADD, I'm impulsive, I've embarrassed myself on too many occasions, I have scars from cutting myself, and I have bipolar disorder. That is what makes my previous friends \"nope\" out of a relationship with me.",
   "created_utc": 1701801926,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4gixb",
   "message": "I just felt like she would stab me if she ever knew where I lived.",
   "created_utc": 1701801939,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4hl1m",
   "message": "Found out that she used her partner for an expensive plastic surgery procedure whilst they were cheating on them. On top of that they'd been talking about my sensitive personal situations behind my back to people I didn't even know. Made me wake up to how callous and selfish they were and I couldn't stomach dealing with them any more.",
   "created_utc": 1701802342,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4tmy1",
   "message": "Alcoholism is no joke kids.",
   "created_utc": 1701806960,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5e1f9",
   "message": "Best friend of 25 years adopted being offended as a main personality trait",
   "created_utc": 1701814715,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5gdrb",
   "message": "Wanna know who your friends are? Get sick.",
   "created_utc": 1701815654,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4jubt",
   "message": "She became a Trump supporter.",
   "created_utc": 1701803208,
   "score": 10,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3y186",
   "message": "Would randomly make me uncomfortable and act like nothing’s wrongly",
   "created_utc": 1701794819,
   "score": 6,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4fl4w",
   "message": "Uhh, she was really into astrology. She was a Cancer, but had Sag and Gemini in her big 3. I am a Virgo with Cap and Taurus in my big 3. Once she found out my other two signs, she started to act differently towards me, and use my signs as a way to “truly” understand and know who I was to the core. Since I was heavily earthy, she would make weird comments like “you’re too uptight, you’re too organized, you act like you’re smarter than me, you are boring” and so on. Eventually, it got to the point where I was so fed up with it, because to be very honest…I don’t really identify with any signs. Some people mistaken me for a fire sign or an air sign. Then some mistaken me for a water sign! I don’t really believe in astrology and when I expressed that to her she assumed I was trying to be better than her. \n\nAnyways, it got really annoying and I stopped hanging out with her. She would continuously text me she missed me, but I noticed she talked crap about a lot of her friends to me and it made me start to think how she talked about me to other people. I started to noticed the kind of friend she was to others and it wasn’t someone I wanted to associate myself with. Plus, she would openly express how much she didn’t like this friend of hers and would always tell me how much me and this friend of hers have the same big 3 signs. Weird.",
   "created_utc": 1701801575,
   "score": 5,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3tv4z",
   "message": "When my ex husband told me that he never needed to buy me any gifts bc he gave me two children and that they were my gifts.",
   "created_utc": 1701793174,
   "score": 6,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc45ypt",
   "message": "A girl I was friends with threatened to call the company I work for and make up something I didn’t do to get me fired because I refused to take a day off to spend time with her after a breakup (although I offered to come over after work multiple days). I took a screenshot of her threat and told her I’d go straight to the police if she actually did that.",
   "created_utc": 1701797873,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4aqzh",
   "message": "So the guy was appearently trying to flirt my other hs friends wife, we are in the same friend group. I realized he's a peice of shit when my girl asked, would you trust him alone with me ? Then he's not really your friend friend.\n\nIf a male shows any signs of flirtation to females that are with your bros, get tf away from him.\n\n\u0026amp;#x200B;\n\nIf someone gives you a gut feeling, chances are you trust it.",
   "created_utc": 1701799696,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4b3pd",
   "message": "dude had two girlfriends at once, he was angry at us for not supporting him",
   "created_utc": 1701799834,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4bjqw",
   "message": "She’d been doing post grad studies in another state, and for at least a year it felt like I wasn’t even her top five list of favorite people. The last straw was when she was visiting for winter break, in town for a month, and we briefly met once at the beginning and I think once at the end. She barely stayed in touch while she was here, but she did go on a trip with a few other friends so I know she wasn’t super busy 24/7. I finally had a conversation with her about not feeling valued, and she just said she didn’t feel valued either, without acknowledging my feelings. I’ve been there for her whenever she’s let me, and I’ve tried my best to support her. I wasn’t getting the same effort back lately, so I said goodbye.",
   "created_utc": 1701800005,
   "score": 1,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4d0bu",
   "message": "When they stole from me.",
   "created_utc": 1701800581,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4dujc",
   "message": "I went to visit her and she outwardly told me that she was jealous of my life and that I was going to be making a decent living soon (I’m graduating school this month). She told me this 6 months ago. \n\nShe told me this after she got done making fun of me, my boyfriend, and threatening to cancel my plane ticket back to my home state because she thought it was funny. Her excuse was “that’s just her personality”. I was visiting in her state and all the pictures she took of me were trash. They weren’t even focused and when I asked her to try again she became annoyed. \n\nIt was so clearly obvious that she was treating me that way because she was jealous of my life and relationship especially after she explicitly told me. I  flew back home and blocked her on everything. I have cut off people for less in my life I won’t put up with petty bs.",
   "created_utc": 1701800908,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4iadq",
   "message": "Friend of a friend with some similar hobbies. He started ranting about how he wants another civil war so he can \"kill all of the leftists.\"\n\nThis happened after I said trump is a fascist politician courting a fascist support base. That was his rebuttal... proving me right in real time.",
   "created_utc": 1701802609,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4jx6z",
   "message": "Friend married a guy that quit his job immediately after the wedding. He was moody and unpredictable.  Others and I were concerned about its impact on her.  Suddenly there was nothing I could do correctly.  Got wood floors installed, you said you hated wood floors etc.  I work an insanely stressful job and couldn’t handle more stress from the friendship.  I backed away.",
   "created_utc": 1701803240,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4ky6d",
   "message": "me and her were best friends for 7 months then she asks if I was willing to date her, I just replied with a simple \"I'll get back to you on that\" and never spoke to her again",
   "created_utc": 1701803613,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4odr9",
   "message": "He was horrible to his mother. Like berating her and making demands constantly. He wasn't like that with anyone else, just her. I went over to his house a few times, and just couldn't deal with how he treated her. We ended up drifting apart and then he started setting stuff on fire. Not sure what happened after that, I never saw him around again.\n\nEdit: we were like 10, for clarification",
   "created_utc": 1701804936,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4t2bi",
   "message": "When she started trying for a baby with a dude covered in literal “knot-zee” tattoos that she just met a few months prior, and made excuses for the fact that he’s a registered SO.",
   "created_utc": 1701806743,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4u6ub",
   "message": "She was a teacher, and when she had a few glasses of wine, she tended to 'hold forth'. \n\nShe was the only one who was right about any given subject (/s) and she would just get bossier and bossier. Plus, after 4 glasses of wine she would be completely incoherent and practically on the floor.\n\nIt's too bad, because I really like her when she's sober and part of a group anywhere outside her home, but she always wanted me to come over to her house instead of anywhere else.",
   "created_utc": 1701807173,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4v6rn",
   "message": "She showed me photos of her ‘best’ friend on her phone to demonstrate how badly she thought her friend looked in the clothes she liked to wear and laughed at her. I knew if she could do that to her closest friend then she would do the same thing to me and I immediately felt disgusted. She also said she hated people who were ugly.",
   "created_utc": 1701807555,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc55beh",
   "message": "He cussed at my mom because i blocked him.",
   "created_utc": 1701811332,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5ao64",
   "message": "Asked for a favor, ghosted after I delivered. Erased.",
   "created_utc": 1701813384,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5e4pq",
   "message": "Serial liar with everyone else, finally figured out that she was doing it to me too",
   "created_utc": 1701814751,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5i7af",
   "message": "She told me after sex that she feels really guilty about having premarital sex because of her religion and we should talk about getting married. This was the first time she mentioned religion or marriage. We had been dating less than a month.",
   "created_utc": 1701816397,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5ij91",
   "message": "Seeing a Qanon logo on their fb profile.",
   "created_utc": 1701816534,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5j7uo",
   "message": "Bragging about shit that happened in high school and falsely bragging about stuff they’re not gonna do or have done",
   "created_utc": 1701816814,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5ly3m",
   "message": "I met this older lady through my ex bf. We hit it off pretty well. We. Spent a lot of time together just paling around. Getting stoned, running errands, going on long drives. She's lost her job at local library, and had a lot of time on her hands. But she just got weird some times. \n\nOne time we were in her car, she was driving, and she started threatening me physically. She told me I should be careful because (she was Japanese) \"Japanese women were known to hide razor blades in their hair.\" That was my first big red flag. \n\nEventually I met a new guy, and one day she calls me and starts telling me how he was sending her inappropriate texts and she just thought I should know. She sent me the texts, but they were incomplete. It was only part of the conversation. \n\nI asked him for the texts and he reluctantly showed me. They had been texting inappropriately, but she clearly had initiated it. I think she was just simply jealous and thought I would kick him to the curb and it would be just me and her again. \n\nThey both got kicked to the curb.",
   "created_utc": 1701817979,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5o1ax",
   "message": "The use of the N-word. No thanks, racist.",
   "created_utc": 1701818884,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5pt1g",
   "message": "They got all into Multi level marketing and every hang out turned out to be some kinda sales pitch. Bye! Thank you for 25 years but bye.",
   "created_utc": 1701819657,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5q4mn",
   "message": "We were close friends for several years. She was always a very negative person about everything in life, loved to stir the pot, and lived for drama. The negativity and drama started to wear me down as it's not something I participate in or enjoy in the slightest. If things didn't go her way it was the end of the world and it was never her fault. I tried looking past it, however, the nail in the coffin was when she decided I should live a certain way because she didn't agree with my life choices... my response... BYEEE",
   "created_utc": 1701819801,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5wcfc",
   "message": "got my favourite teacher fired with sexual harassment allegations. Anyway, he was innocent, but can never be a teacher again. Everyone liked that guy, and I then realised what pieces of shit my friend group was. Their reasoning for what they did? \"It was funny\"",
   "created_utc": 1701822547,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc5wnxj",
   "message": "Would ask me for advice, tell me I don't know because I was 2 years younger than her, not do what I said, then lament that things turned out so terribly and no one told her it would.\n\nWe were 19 and 21 at the time. This pattern repeated itself at least 6 times.",
   "created_utc": 1701822688,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc6pvaa",
   "message": "She was an artist and refused to get a paying job.  After 4 years our relationship was to the point where I had to accept supporting someone for the rest of my life or end it.",
   "created_utc": 1701835721,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc6t0ys",
   "message": "Drugs. Not weed.",
   "created_utc": 1701837321,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc6ttvl",
   "message": "Workaholicism and forced religious indoctrination",
   "created_utc": 1701837741,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4ijru",
   "message": "Anti-vaxxer",
   "created_utc": 1701802708,
   "score": 5,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc45yxb",
   "message": "he was my first on any important event of my life. graduation, birthday, great and bad moments. we had been friends more than 15 years.\r  \n\r  \nI wasn't even on his list... he didn't invited me to his wedding, to his graduation, to his birthday or any reunion.\r  \n\r  \nwhen confronting him he said: because I insulted her GF in high-school (which I apologized then and last year for the sake of our friendship). Please note that they didn't even knew each other at that time. They became a couple after graduating from university..",
   "created_utc": 1701797876,
   "score": 4,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4gbsy",
   "message": "Anyone who wasn’t willing to check in or help after I was hit by a car. Byeeeeeee.",
   "created_utc": 1701801864,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3om06",
   "message": "Asked to be friends with benefits but we were both guys",
   "created_utc": 1701791026,
   "score": 5,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3pky8",
   "message": "[deleted]",
   "created_utc": 1701791431,
   "score": 4,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4bhr1",
   "message": "Too many pronouns",
   "created_utc": 1701799983,
   "score": 3,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4fnoy",
   "message": "I was friends with someone for years that I went through a lot with. We both had hard lives. We both became single mothers after abusive relationships (not really a surprise in some people’s eyes, I guess) but…I tried my best to grow and move on. Then she was in a position, again, where she was getting her fifth (or sixth) abortion and I just snapped. I hate to judge and I still understand her but I cannot understand why she was so reckless with birth control when she hated her only child and didn’t treat him well or properly provide. What really was the last straw though was her attitude toward me. I’m always open to hearing what I’m doing wrong and take feedback. But she never listened to me. If I didn’t coddle her or I disagreed she would immediately get angry. I had enough. I couldn’t stand hearing her beat her three year olds ass anymore for her own inadequacies. I’m not perfect but I also don’t have to vicariously endure her hell of a life either. Especially when she is so often morally wrong.",
   "created_utc": 1701801603,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4lj3p",
   "message": "Girl I hung out with for a while tried to baby trap her boyfriend of 4 months because she was obsessed with him. She was tracking everything he did, and once had a meltdown because he spent a day with his mom when his dad died. She went and slept with someone else and then tried to say the baby was his...not knowing he was completely sterile after a bad accident. Once I found out about that I stopped talking to her...and ended up dating the guy for 2 years",
   "created_utc": 1701803836,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc3w0km",
   "message": "One of my best friends in high school kind of dropped off the planet senior year. It was 2008-2009 so in that transition from MySpace to Facebook where I lost contact with quite a few people from MySpace but I knew him from school and still just had no contact with him. His ex didn’t even know what happened to him. Turns out he was getting into heavy drugs and ended up moving to a different part of the state with his family and didn’t tell anyone. I found out years later. I’m not even 100% sure how accurate this is. \n\nA few years ago one of my other best friends killed himself. He also lived in the same area as the other friend who I had recently made contact with on Facebook. I went there for my friends funeral and met up with my old friend and his wife. \n\nWhile eating dinner they told me how they met. They met when he was 23 and just got sober. She was 15 when they met and was also getting into drugs at the time. They said they keep eachother sober. \n\nAfter that we finished up dinner and I said goodbye and haven’t talked to him since and don’t plan to ever again. \n\nThey have been together for 10 years and married for like 9. They got married when she was 16 and he was 24.",
   "created_utc": 1701794028,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc495aa",
   "message": "People exhaust me. After being friends for a little while I usually just lose interest in them, 9 or more times out of 10",
   "created_utc": 1701799081,
   "score": 2,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc6hrkl",
   "message": "Came out as Trans.\n\nFreedom of Association is awesome.",
   "created_utc": 1701831997,
   "score": 1,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4y68h",
   "message": "They denied that the holocaust happened, but somehow idolized hitler/made memes with him. My grandparents were survivors from that time, so it made my stomach turn tenfold when i heard my friend's views on it.",
   "created_utc": 1701808689,
   "score": 1,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc503a8",
   "message": "My care and efforts weren’t reciprocated and I started to feel like they merely tolerated me rather than actually enjoying my company. I was always the one inviting them over or inviting them out to do things, I showed up for them consistently as a true friend does, introduced them to my friends and family. I wanted to include them in my life and the close circle that I’d already had because I really cherished them. However, in two years they never once invited me into their space, I never met their friends or loved ones, and they were never really there for me when I needed it most. There were plentyyy of reasons to end our relationship but yeah ultimately after a while I’d had enough of the lack of effort and walked away",
   "created_utc": 1701809404,
   "score": 1,
   "submission_id": "18bemry"
  },
  {
   "comment_id": "kc4eis8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18bemry"
  }
 ]
}