{
 "submission_id": "18bk9cc",
 "title": "What's a movie fact you know that pretty much no one else knows?",
 "selftext": "",
 "created_utc": 1701805077,
 "permalink": "/r/AskReddit/comments/18bk9cc/whats_a_movie_fact_you_know_that_pretty_much_no/",
 "score": 152,
 "url": "https://www.reddit.com/r/AskReddit/comments/18bk9cc/whats_a_movie_fact_you_know_that_pretty_much_no/",
 "comments": [
  {
   "comment_id": "kc5jlyo",
   "message": "The theme song from Mission Impossible spells out MI in Morse code in repeat.",
   "created_utc": 1701816977,
   "score": 40,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5n7oh",
   "message": "When filming the rooftop scene in The Departed, a giant inflatable Arthur the Aardvark on top of a nearby children's museum would have dominated the background of many of the shots. The museum graciously agreed to temporarily deflate and remove Arthur.",
   "created_utc": 1701818528,
   "score": 215,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc588w2",
   "message": "In Edward Scissorhands, the version shown to critics and reviewers contained a scene that got cut from the final theatrical version. The scene was during the opening when the grandmother starts telling her story to the little girl. Essentially, it made it clear that everything we are seeing in Edward’s story is not as it actually occurred, but rather we’re peering inside the little girl’s imagination, seeing how she’s interpreting what her grandmother is telling her. This brings whole new meaning to things like the way the houses are painted, how all the dads leave for work at exactly the same time, and the quirkiness of how everyone behaves. Once you know that this scene exists, you see the movie in a very different way. Much of what we think of a “Tim Burton weirdness” is actually childlike imagination once you know.  \n  \nSo, go watch it again. It’s not a whole new movie, but it feels and comes across in a whole new way.",
   "created_utc": 1701812441,
   "score": 183,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5njxr",
   "message": "In ‘Contagion’, the autopsy performed on Gwyneth Paltrow used a prop head that was originally made for the finale of ‘Seven’. The latter decided against  showing what was in the box and thus, years later it was repurposed.\n\nIn other words, we finally got to see what was in the box.",
   "created_utc": 1701818675,
   "score": 28,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5rajl",
   "message": "The original choice for Buzz Lightyear in Toy Story was Billy Crystal. He turned it down and went on to say it was one of the biggest mistakes of his career. When the opportunity to voice Mike in Monsters Inc came up he jumped at it, as he didn’t want to make the same mistake twice.",
   "created_utc": 1701820311,
   "score": 245,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5f8zc",
   "message": "Anthony Hopkins is an incredible mimic. Throughout his career, he’s looped (post production sound re-recording) many well known co stars who were unavailable for re-recording sessions. He’s never taken credit for this.",
   "created_utc": 1701815196,
   "score": 245,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5ta3u",
   "message": "In the first Shrek movie Lord Farquaad is removing all the fairy tale creatures from the swamp. He wants Shreks home too.  In the old DVD extras they explain it’s because he wants to build a theme park there.  It’s not explained at all in the movie.",
   "created_utc": 1701821185,
   "score": 214,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5r176",
   "message": "The movie Dead Zone and Christmas Story were being filmed only a couple miles away from each other  at the same time.  Both productions were waiting for snow so they could film.  It was an usually snowless winter.\n\nFinally late in the season there was a significant snowfall.  The scene where Sheriff Bannerman arrives at Johnny’s house is being filmed at the exact moment of the tongue to the flag pole scene.",
   "created_utc": 1701820199,
   "score": 52,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5l5no",
   "message": "In Pixar's Coco, the boy who was going to play Miguel hit puberty, changing his voice. The people in charge replaced him with someone younger. The original boy got a cameo where he is the guy working the stage asking him if he's ready to go on.",
   "created_utc": 1701817638,
   "score": 40,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc62vut",
   "message": "Leslie Nielsen was a critically acclaimed western actor before he did Airplane. On the set, people were intimidated by him because of his status. But they had no idea that he was the set prankster. \n\nHe's actually buried with a fart machine that he used to carry around to mess with people.",
   "created_utc": 1701825441,
   "score": 251,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc51zds",
   "message": "In Aliens, after the first encounter with the aliens, as the Marines are retreating, there is a scene where they get in the troop carrier, and as they are getting ready to leave, an alien tries to get in.  Hicks picks his shotgun off the deck, jams it in the alien's mouth, yells \"Eat this\" and blows it away.  that whole scene was shot backwards because the actor, Michael Biehn, couldn't perform the move properly, so it was shot backwards, played in reverse, and then sound dubbed over it.",
   "created_utc": 1701810094,
   "score": 82,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5jvhl",
   "message": "Robert Englund, Freddie Kreuger...originally auditioned to be Luke Skywalker... but didnt get the role. He told his roommate Mark Hamil to go try out instead.",
   "created_utc": 1701817088,
   "score": 26,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5pwfq",
   "message": "Cary Elwes broke his toe on a 4 wheeler during filming The Princess Bride. He was worried Rob Reiner might fire him so he kept it a secret. He worked the scenes before the Fire Swamp to make his character kind of nonchalant but really he couldn't put much weight on his foot.",
   "created_utc": 1701819700,
   "score": 115,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5emq5",
   "message": "Elle Woods has a different hairstyle in every scene in Legally Blonde",
   "created_utc": 1701814950,
   "score": 185,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5g05e",
   "message": "In Wayne’s World, when Wayne plays Stairway to Heaven and the store clerk points to a sign that says No Stairway to Heaven, the audience is led to believe the clerks banned the song because they were tired of hearing it. However, the actual song was supposed to be featured in the movie but Led Zeppelin’s PR people pulled the plug at the last minute. So when Wayne says “no stairway, denied”. That’s what he means.",
   "created_utc": 1701815500,
   "score": 43,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5omru",
   "message": "John Candy was paid less than $500 to appear as Gus Polinski in Home Alone.",
   "created_utc": 1701819143,
   "score": 123,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5s10x",
   "message": "In Jurassic Park, the goat that gets fed to the T-Tex was named Brunden.",
   "created_utc": 1701820634,
   "score": 132,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5nh1k",
   "message": "Annie (1982, Carol Burnett and, a propos to this tale, Albert Finney)\n\nThe scene where we first meet Daddy Warbucks (Albert Finney), he's looking at the Mona Lisa and tells the servants to \"Take her away!\" Then he changes his mind saying, \"She has an interesting smile. I could get used to that smile. Hang her in the bathroom!\" The joke here is that the first owner after Leonardo died was King Francis I of France, who had her hanging in his bathing room.",
   "created_utc": 1701818641,
   "score": 182,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5aw66",
   "message": "Most of the cast of The Sound of Music, particularly Christopher Plummer, thought the movie was corny as hell. Not that they don’t appreciate its legacy or impact - it’s just objectively a ridiculously saccharine, albeit classic, film. Julie Andrews and Christopher Plummer were so overcome by the corn fest that is the song “Something Good” that they couldn’t get through a take without laughing and giggling. The decision was made to obscure their faces slightly, which is why the scene we see today is in silhouette.\n\nEdit: Plummer, not Plumber.",
   "created_utc": 1701813471,
   "score": 189,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6l6rw",
   "message": "In Free Willy 2 the orcas are all animatronic. My stepdad helped build them. Most people don't know this because nobody watched that movie.",
   "created_utc": 1701833536,
   "score": 97,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5jum8",
   "message": "The whole of Eurotrip was filmed in Prague. Even the US scenes.",
   "created_utc": 1701817078,
   "score": 135,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5jaje",
   "message": "Robert Shaw, Quint, in Jaws, could not stay in Massachusetts while filming Jaws. Had to be flown to Canada daily. Guess he owed the U.S.A. tax money, couldn't take any chances. Oh, and he was sea sick all the time on the Orca.",
   "created_utc": 1701816845,
   "score": 220,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5lfam",
   "message": "Carrie Fisher said that one time Alec Guinness gave Mark Hamill £10 to leave him alone. 😂",
   "created_utc": 1701817754,
   "score": 214,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5appj",
   "message": "I figure people know all facts about movies but my favorite two -\n\nSilence of the Lambs - In the first scene with Hannibal, he gives Clariece the answer for where Buffalo Bill is. She asks about his drawings on the wall and the only one talks about is the \"View from the Belvedere.\" Buffalo Bill was in Belvedere Ohio.\n\nJurassic Park - When Newman slips in the mud after getting his Jeep stuck. There is a slide whistle sound effect. [I can't unhear.](https://youtu.be/MNoWveBtrZc?si=YZkQsk2VfqBY0_VU\u0026amp;t=38)",
   "created_utc": 1701813401,
   "score": 125,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5lsyu",
   "message": "The couple kissing in Hook as Peter and Tinkerbell fly over them are George Lucas snd Carrie Fisher.",
   "created_utc": 1701817918,
   "score": 114,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5n213",
   "message": "The original Halloween (1978) took place in Illinois in October. However, it was filmed in California in the springtime. To make it more believable, they had bags of dead autumn leaves shipped in. \n\nThere was a person whose job it was to scatter the leaves around the set, then bag them back up and move them to the next filming location.",
   "created_utc": 1701818460,
   "score": 63,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5xj6m",
   "message": "I haven’t really seen it mentioned anywhere, but in Step Brothers there is a pizza delivery thing that goes on top of a car in the boys’ room. It’s the same pizza delivery business that Ricky Bobby ends up working for in Talladega Nights.",
   "created_utc": 1701823066,
   "score": 18,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5bptz",
   "message": "The ship built for the Titanic set was 90% the size of the real thing.\n\nJames Cameron spent more time with the real Titanic than those who sailed on her.",
   "created_utc": 1701813795,
   "score": 144,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc667ws",
   "message": "The Emperor's New Groove was the first Disney movie to show a pregnant woman on-screen.",
   "created_utc": 1701826914,
   "score": 132,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5dldp",
   "message": "The crew agreed to do the shower scene in Starship Troopers so long as the director was also naked. And he was",
   "created_utc": 1701814543,
   "score": 46,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5o1sb",
   "message": "Who Framed Rodger Rabbit\n\nJudge Doom (played by Christopher Lloyd) never blinks once the entire movie. I won’t say why for the sake of spoilers.\n\nI could talk at length about the crazy techniques and control rigs they developed to create what was the best ever integration of live action and animation, but that’s my favorite fact.",
   "created_utc": 1701818890,
   "score": 146,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5j7xk",
   "message": "In The Neverending Story, the horse (Artax) didn’t die- however, Noah Hathaway almost drowned during the famous scene where the horse sinks in the swamp. The horse was standing on a platform that sunk into the mud, and Hathaway’s shoe got caught in the mechanism and started to drag him under.",
   "created_utc": 1701816815,
   "score": 103,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc587sb",
   "message": "In [Domino](https://www.imdb.com/title/tt0421054/?ref_=ext_shrhttps://www.imdb.com/title/tt0421054/?ref_=ext_shr), a few scenes are filmed at what was Bonnie Springs Old West Town a few miles outside of Vegas. (Bonnie Springs Old West Town closed its doors \u0026amp; the property was sold to a housing developer).\n\nIn one scene, someone busts into the hotel room where Kiera Knightley was staying, and a Christmas wreath flies off the door.\n\nI bought that wreath, \u0026amp; the room was my sister's apartment. She lived there, \u0026amp; worked in the shops. Her door never closed well after that. She was pissed that they ruined the wreath, and they knocked some of her other stuff around as well. The film crew never compensated her, either. \n\nMy sister passed away several years ago, and I caught *Domino* on TV a couple of months ago. Got a wave of the feels over that.",
   "created_utc": 1701812429,
   "score": 255,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc68o5j",
   "message": "The first iron man movie they lost the 3D rendering of the villain suit they spent almost a year designing do to a hard drive crash and I was the tech that rescued the file.   The designer was freaking out and basically told me that if we didn’t rescue that file his career and the movie would be in a huge pickle.",
   "created_utc": 1701827991,
   "score": 0,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc60nwz",
   "message": "The movies *Goodfellas* and *My Blue Heaven* were both based on or inspired by the same guy. *Goodfellas*  is based on a non-fiction book by Nick Pileggi based on interviews with the real Hank Hill. Nick Pileggi was married to Nora Ephron who wrote the screenplay for *My Blue Heaven.* the two movies even share a line of dialogue! \"Right after I got here, I ordered some spaghetti with marinara sauce, and I got egg noodles and ketchup.\" I like to pretend that *My Blue Heaven* is a sequel to *Goodfellas.*",
   "created_utc": 1701824451,
   "score": 126,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc54xxc",
   "message": "Before casting Martin Lawrence and Will Smith to be the two cops in “Bad Boys,” producers were trying to make it work with SNL’s Dana Carvey and Jon Lovitz. The script was originally named “Bulletproof Hearts.”",
   "created_utc": 1701811190,
   "score": 6,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5nn1m",
   "message": "In Seven, the studios tried to have the head in the box be Pitts dog. The studio even had rewritten the script and sent it to the Director and Pitt. Fortunately they both had already seen and signed on because of the eventual ending, and refused to change it. They also had another ending where Somerset kills Doe before Mills can, thereby ruining wrath. Studios didn't want the protagonist to have a negative ending. Also the head in the box was the same fake head that they used for Gwyneth in Contagion.",
   "created_utc": 1701818712,
   "score": 211,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc67jrv",
   "message": "In Toy Story, Andy is only 5, soon to be 6. It was released in 1995. \n\nIn 1999, Toy Story 2 was released and Andy is now 9. \n\nIn 2010, Andy is now 19-20 years old. \n\nAndy grew up in real time with the audience, and passed his toys to the next generation, just like we did with the movies.",
   "created_utc": 1701827498,
   "score": 202,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6f2z4",
   "message": "When Joe Pesci was young, he worked as a waiter at a restaurant. While attending a mobster, he made a compliment by saying he was “funny”, but the comment wasn’t taken well. \n\nWhen working on Goodfellas, Pesci shared this anecdote with Scorsese, who liked it so much he decided to add it to the film. \n\nHowever, he didn’t include it in the shooting script, so only Pesci and Liotta knew what was happening in the scene, and it was improvised and rehearsed by them, but kept a secret from the rest of the actors in the scene in order to catch their genuine reactions.\n\nEnded up being the some of the most memorable dialogue from that film.",
   "created_utc": 1701830825,
   "score": 100,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5luvd",
   "message": "Die Hard was adapted from a book.",
   "created_utc": 1701817940,
   "score": 14,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc55nak",
   "message": "Every single scene in Home Alone contains something red and green in it.\n\nGo check for yourself if you don’t believe me",
   "created_utc": 1701811457,
   "score": 127,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc4xkh7",
   "message": "In Casablanca with Humphry Bogart and Ingrid Bergman, there is a farewell scene with the two stars kissing inside an airplane hangar. The hanger has a plane outside (Lockheed Electra 12A) with a bunch of people working around it.\n\nThe production was not allowed to film at an airport after dark for security reasons, so they used a sound stage with a small cardboard cutout airplane and forced perspective. The strange part is to give perspective of distance, they used little people for the workers.",
   "created_utc": 1701808463,
   "score": 95,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5mb40",
   "message": "In the original script of Back to the Future, instead of a bolt of lightning, the plan was to power the Flux Capacitor by having Marty drive the DeLorean into a nuclear bomb test.",
   "created_utc": 1701818136,
   "score": 183,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc4p7ht",
   "message": "In _Fight Club_, in the scene where Ed and Brad wreck in the car, Ed crawls out of the driver's side, an early clue that he is Tyler. the part that few know is that there was an argument about it. Production thought it was a continuity error. Fincher was like 'nah' and didn't explain.",
   "created_utc": 1701805257,
   "score": 109,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc4uoeh",
   "message": "In The Professional when Gary Oldman responds EVERYYYONNEEE, he was just supposed to say it quietly like a quick \"yeah, everyone,\" but just started screaming like that instead.\n\nHere's Gary Oldman talking about it in an interview: [https://www.youtube.com/watch?v=MZfqez5qmuA](https://www.youtube.com/watch?v=MZfqez5qmuA)",
   "created_utc": 1701807360,
   "score": 199,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc50ptt",
   "message": "\"E.T.\" and \"Poltergeist\" were developed from the same story about alien abductions.\n\nSteven Spielberg wrote a story treatment called \"Watch the Skies\" and had John Sayles flesh it out as a draft called \"Night Skies.\" Spielberg later decided to shift it in a more heartwarming direction, resulting in \"E.T.\", so he tapped Tobe Hooper to film the original version, but Hooper replaced aliens with the paranormal and it became \"Poltergeist.\"",
   "created_utc": 1701809635,
   "score": 158,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc634cv",
   "message": "In Stuart Little there is a painting in the Little house called “woman holding a black vase”. The original painting was considered lost and an art hunter took his son to the movie and saw the painting and called the studio to check and it ended up being the original",
   "created_utc": 1701825547,
   "score": 220,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5ju25",
   "message": "In Indiana Jones and the Last Crusade, when the two Jones are reunited and Henry Sr. learns his son has his journal, he says: I should have sent it to the Marx Brothers. During World War II, one of the Marx Brothers was suspected of passing informations to the Russians during their shows.",
   "created_utc": 1701817071,
   "score": 207,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc4w846",
   "message": "For the VHS version of the 1967 cult classic The President's Analyst, they couldn't get the rights to a Barry McGuire song, so they substituted an uncredited song that turned out to be really good, and a perfect fit for that scene.\n\nFor the DVD, they went back to the original song, and the other one is not available anywhere except the VHS version of that movie.",
   "created_utc": 1701807949,
   "score": 154,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5sqd0",
   "message": "Jim Carey in the movie Liar Liar on the final scene dressed up as his old In Living Color character Fire Marshal Bill in shades and walki talki in the background with all the people on the street. Lol",
   "created_utc": 1701820945,
   "score": 153,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6dzi8",
   "message": "The first line in the original Dracula 1931 was spoken by Carla Laemmle. Her uncle founded universal studios and she grew up on the studio lot. She was one of the longest surviving actresses of the silent film era. She passed away in 2014 at the age of 104. I had the privilege of spending time with her the last 5 years of her life and the stories she shared were very special. I got to meet Ray Bradbury, Mickey Rooney, and Debbie Reynolds at her 100th birthday in 2009.",
   "created_utc": 1701830343,
   "score": 153,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5u8f8",
   "message": "The 4 segments in the Rodriguez/Tarantino movie Four Rooms are all based on short stories by Roald Dahl.\n\nBut it gets better. (Sorry, this might be a bit UK specific).\n\nThe Taratino segment. The 'I bet my pinky finger my lighter will light first time, ten times on the trot'. That was the story for the very first Tales Of The Unexpected!",
   "created_utc": 1701821610,
   "score": 79,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5yovd",
   "message": "Forgetting Sarah Marshall\n\nJason Segal was cut from his part in Undeclared(the unofficial sequel to Freaks \u0026amp; Geeks) so Apatow and Segal made up a new role for him to play without being paid. Segal had just been dumped by Linda Cardellini(the being dumped while naked scene is based directly from that break-up)and wasn't getting any work, while his closest friends from Freaks and Geeks were blowing up. Apatow told him to make his own work, write and produce his own project if he wanted to star in things. So the guy started writing what would eventually become the Muppet movie- except all his friends were like 'no not like that.' Meanwhile on set of Undeclared he had become good friends with Charlie Hunnam and proceeded to write the script with him in mind for Aldous Snow. Fast forward, Hunham dropped out, Segals unusable script for Muppets turned into his Dracula musical(using Jim Henson Studious puppets) and How I met your Mother was a hit. All of this, led to him writing and starring in the highest grossing Muppets movie ever, which re-ignited the Muppets for new movies and shows after. Also without Forgetting Sarah Marshall we would never have been given the hidden gem that is I Love You Man and more importantly Paul Rudd giving us the line 'Totes Ma Goats'. Most people have no idea that was just a one off line thrown out there by Rudd or that is where that came from. Plus so much else.",
   "created_utc": 1701823578,
   "score": 221,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5qn0u",
   "message": "In the song \"Be Prepared\" in the original animated version of The Lion King, actor Jeremy Irons didn't sing the whole song either because he couldn't hit the notes or because he got bronchitis. Regardless, Disney got legendary voice actor Jim Cummings to fill in. Don't believe me? Check the end credits. Jim is credited right alongside Irons for singing the sing.",
   "created_utc": 1701820027,
   "score": 150,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5m7pp",
   "message": "Fast Times at Ridgemont High is based on a true story. Ratner (the one who had the crush on Jennifer Jason Leigh’s character) was an early personal computer pioneer who wrote several of the earliest, most successful “For Dummies” books",
   "created_utc": 1701818095,
   "score": 12,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6an6f",
   "message": "104 cars were destroyed while filming the car chase scene in The Blues Brothers. Still holds the record.",
   "created_utc": 1701828865,
   "score": 74,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6g6ag",
   "message": "For years I had a childhood memory of watching a super weird Star Wars tv show about Chewie getting home to Kashykk for a Christmas-like celebration. For years when it came up I got told there was no such thing and I was making things up.\n\nThen YouTube appeared. Fuck you, I was right.",
   "created_utc": 1701831299,
   "score": 68,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5n83d",
   "message": "In Willy Wonka and the Chocolate Factory, when the Candyman starts singing the Candyman Can song there is a scene where he lifts the counter to walk out and the counter smacks this little girl in the head.",
   "created_utc": 1701818533,
   "score": 173,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5w3sf",
   "message": "I think only some close friends and family might know this fact; \n\nIn the movie *I'll be Home for Christmas* (1998), staring Jonathan Taylor Tomas, my father and I appear in the background of 2 scenes. \n\nThis was not done on purpose. We were on a trip, and accidentally stumbled into a crowd of people who all happened to be extras, and we just stayed there and participated for maybe 15 minutes before wandering away. We appear in about 2 seconds of 1 scene. \n\nA little less than a week later, we wandered around in a different city entirely not far from the first town (same trip), and ended up being waved over to join a cheering crowd in exchange for some preshooting doughtnuts. We aren't really visible in the quick shot of our section, but my very bright handmade toque is. \n\nSo, there's a fun movie fact almost no one knows, except all you now!",
   "created_utc": 1701822442,
   "score": 139,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5x7lh",
   "message": "In Tin Cup, in the scene where Kevin Costner kept breaking his golf clubs and Cheech Marin yells at him, the script didn’t call for him to get quite that angry. He said later that, in character, watching a talented person who couldn’t stop screwing up brought back all the anger he felt toward Tommy Chong as he watched him fall apart.",
   "created_utc": 1701822925,
   "score": 138,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5c9um",
   "message": "In Titanic, the lake in Wisconsin where Jack says he fell through the ice didn't exist yet.  When Jack told Rose about how cold the water in the North Atlantic was, he mentioned himself falling through the ice in Lake Wissota, Wisconsin.  Titanic sank in 1912, and Lake Wissota wasn't created until 1917.",
   "created_utc": 1701814017,
   "score": 13,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5jxr3",
   "message": "Lucille Ball's first screen role was as a [blonde \"slave girl\" dancer](https://m.imdb.com/title/tt0024507/mediaviewer/rm1247461377/) in the big musical numbers from \"Roman Scandals\" in 1933.  She didn't become a redhead until she dyed it for [\"DuBarry was a Lady\"](https://www.imdb.com/title/tt0035829/mediaviewer/rm1942261761?ref_=ttmi_mi_all_sf_68) a decade later.",
   "created_utc": 1701817114,
   "score": 190,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5l0d6",
   "message": "Paul Bettany had to wear a wig for *The Da Vinci Code* because the blonde dye burned his scalp.",
   "created_utc": 1701817574,
   "score": 134,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc694so",
   "message": "Over the years, Disney has released full length feature films on seven types of physical media formats for home video - VHS, Beta, CED, Laserdisc, DVD, Blu-Ray and UMD. The only film to be released on all of these formats was Tron, thanks to a re-release alongside Tron: Legacy.",
   "created_utc": 1701828193,
   "score": 70,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6cs25",
   "message": "In Halloween H20, Jamie Lee Curtis’s secretary is actually her mother Janet Lee from the infamous Psycho shower scene. \n\nCooler than that, the last time we see her in the movie, she’s getting into her car talking to Laurie (JLC’s character). That is the car she drove in Psycho.\n\nEdit: Janet Leigh*",
   "created_utc": 1701829812,
   "score": 67,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5nl0j",
   "message": "For *My Cousin Vinny*, the director did research at actual criminal trials in the South, and that's where they got those gems like \"Hiy-einous crime\" and \"all our little ol' ancestors.\"\n\n(source: DVD commentary)",
   "created_utc": 1701818688,
   "score": 81,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc4yzuc",
   "message": "The design for Bughuul in *Sinister* was based on a piece of artwork that Scott Derrickson randomly found on Google Images. He paid the original artist $50 for the rights to it.",
   "created_utc": 1701808993,
   "score": 246,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5nf0z",
   "message": "The code in The Matrix comes from sushi recipes.",
   "created_utc": 1701818616,
   "score": 237,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5j3pg",
   "message": " Okay local one from me, just for fun.\n\n Life of Pi movie promotion posters featured a picture of a wrecked fishing boat. \n\nThe boat is a Scottish fishing boat called the sovereign, It can still be seen on Fraserburgh beach in Aberdeenshire.",
   "created_utc": 1701816767,
   "score": 27,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5qbkn",
   "message": "In \"The Godfather\", when Johnny Fontane is talking with Don Corleone at his office, at the end of the scene Don Vito goes to the door and opens it, and you can briefly see an extra, a lady, that steps into the scene, realizes that she shouldn't be there, and quickly steps back.\n\nIf you blink, you'll miss it.",
   "created_utc": 1701819886,
   "score": 61,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc61nww",
   "message": "I supplied the denture in Soul Men, and the leg cast on the actress in Iceman was made on my leg.",
   "created_utc": 1701824894,
   "score": 62,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5memp",
   "message": "It is a widely discussed easter egg in Toy Story 3 that at the beginning of the film, there is a garbage man who wears the same t-shirt that Sid wore in the first movie. Many online outlets were quick to point this out, theorizing that this might actually be Sid now grown up. What all of these outlets failed to realize is that while they were distracted by the credits sequences, Sid was actually listed in the credits. So yes, it is Sid. Hard confirm. You are not a sleuth for noticing this.",
   "created_utc": 1701818177,
   "score": 94,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5x4jy",
   "message": "Ooh I’ve finally got one!\n\nThe Great Race (1965) has the largest pie fight ever put in a movie! It’s four minutes long and was filmed over 5 days. Thassalottapie",
   "created_utc": 1701822888,
   "score": 170,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5adz7",
   "message": "Apparently Al Pancino snorted so much fake cocaine filming Scarface that he has damage to his nasal cavities.",
   "created_utc": 1701813275,
   "score": 37,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5ka3o",
   "message": "In \"Kung Fu Hustle,\" the woman who played the landlady of Pigsty Alley was in the James Bond movie, \"The Man with the Golden Gun.\"",
   "created_utc": 1701817260,
   "score": 163,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc64kdo",
   "message": "The costume designer for Idiocracy found a start up making \"futuristic\" looking shoes to use in production.\n\nAlthough they liked the shoes, the producers wanted to be certain that the shoes wouldn't suddenly become popular and ruin the future look they were going for.\n\nThe designer assured them that the shoes were far too ugly to ever become popular so they used them throughout the film.\n\nThe shoes were Crocs.",
   "created_utc": 1701826187,
   "score": 158,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5hthl",
   "message": "Baby in Dirty Dancing is supposed to be an ugly girl who Patrick Swayze gave all this attention. The hot, good looking girl was the latina.",
   "created_utc": 1701816239,
   "score": 58,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc57rmz",
   "message": "The director of “Drive” called another director mid-shoot for tips on how to depict a scene where a head gets stomped out.",
   "created_utc": 1701812257,
   "score": 110,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5nbub",
   "message": "In the movie \"Taken\": the scene where Liam's character is interrogating his daughter's kidnapper. It shows the electric wires are attached to the chair. Originally, the scene shows large nails jabbed into the kidnapper's legs. Electric wires were connected to these nails.\n\nhttps://youtu.be/-U0YdUZMZSM?si=IwYG-A9Lf0kKDhtr",
   "created_utc": 1701818579,
   "score": 49,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc64wpd",
   "message": "John McClane and Martin Riggs use the same gun, literally. The same prop Beretta 92F was used filming Lethal Weapon and Die Hard.",
   "created_utc": 1701826341,
   "score": 48,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6pjqf",
   "message": "Ok go with me here. I've wanted to share this bit of trivia for FOREVER and my moment has finally arrived!! \n\nTom Hanks' feature film directoral debut was the movie That Thing You Do! Jimmy who wrote the Wonders' hit song That Thing You Do! (which was a ballad until Guy Paterson joined the band and turned it into a hit pop song) also wrote the song on the B side of the record which was called All My Only Dreams. The band signed with the Playtone Record label and in addition to directing Tom Hanks played the band's manager/ record producer. \n\nTom Hanks' production company is named Playtone. One of the first movies he produced was My Big Fat Greek Wedding. At the reception of the wedding (approx 1:25:40) the song being sung by the wedding band is All My Only Dreams by the Wonders. \n\nI seriously don't know if anyone else has ever caught this! It took me a long time before I noticed and these are probably two of my most watched movies of all time. Like 25+ views of each...minimum.",
   "created_utc": 1701835567,
   "score": 55,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc6s7to",
   "message": "In Pulp Ficton, Mia and Vincent don’t win the dance contest, they steal the trophy.  The theft is discussed on the radio in the cab Butch uses to get away from the fight.",
   "created_utc": 1701836902,
   "score": 52,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5spi2",
   "message": "In The Devil Wears Prada, the scene where Miranda says, “Do I smell freesias? If I see freesias anywhere…I will be very \ndisappointed” is actually foreshadowing for Miranda’s betrayal of Nigel. Freesia flowers are commonly used to represent friendship, which Miranda does not value.",
   "created_utc": 1701820934,
   "score": 52,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc66k72",
   "message": "All of the backgrounds in the animated film LILO and Stitch were done in Watercolor",
   "created_utc": 1701827065,
   "score": 43,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5a9l8",
   "message": "Q: There was only one black character in The Godfather.  What was his name?\n\nA: Tony\n\nBackground: The only black character was the horse-groom that was taking Woltz' ill-fated race horse back to the stable. Wolz pats the horse and says \"thanks Tony\". Tony replies \"you're welcome\".",
   "created_utc": 1701813228,
   "score": 203,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5oa3w",
   "message": "In the fifth element, the protagonist and the antagonist never meet.",
   "created_utc": 1701818991,
   "score": 239,
   "submission_id": "18bk9cc"
  },
  {
   "comment_id": "kc5qozd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18bk9cc"
  }
 ]
}