{
 "submission_id": "18bly6y",
 "title": "What happened during your worst nightmare?",
 "selftext": "",
 "created_utc": 1701809352,
 "permalink": "/r/AskReddit/comments/18bly6y/what_happened_during_your_worst_nightmare/",
 "score": 7,
 "url": "https://www.reddit.com/r/AskReddit/comments/18bly6y/what_happened_during_your_worst_nightmare/",
 "comments": [
  {
   "comment_id": "kc502ik",
   "message": "I bought a can of cut green beans and when I got home and opened it they were whole uncut green beans",
   "created_utc": 1701809396,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc50saf",
   "message": "My tooth kept falling out while trying to give a presentation at work.",
   "created_utc": 1701809659,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc51kaa",
   "message": "Biden won and made estrogen injections mandatory",
   "created_utc": 1701809947,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc500jc",
   "message": "Woke up",
   "created_utc": 1701809376,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc50d3t",
   "message": "Lived in it and when i felt too comfortable, i woke up",
   "created_utc": 1701809505,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc50nqy",
   "message": "I don't dream often. Almost never tbh. So when I dreamt my dog was still alive the night after he died I didn't really have any defense against it. I thought it was real life and I woke up devastated all over again. But it took a minute to put it all together. I've never had a nightmare but I imagine that's probably one.",
   "created_utc": 1701809613,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc50yhz",
   "message": "A guy told me he knew my mom and uncle over and over for years and then offered me a ride home. I took it, then realized I had no way of knowing he was telling the truth, so I got out of the unlocked car and ran away. Turns out he was a registered sex offender.\n\nI was a teenager",
   "created_utc": 1701809722,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc5153z",
   "message": "I couldn't tell the difference between dream and reality. I was unable to move or make enough sound to wake up my partner, while I heard someone open the front door with the key... Walk up the stairs... and suddenly a white ball of light at our bed...\n\n..then I woke up for real. The room equally in the state it just was in my dream, only without that light. \n\nMost creepy part of all is that there are more people who've had this type of dream.",
   "created_utc": 1701809789,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc51jt7",
   "message": "Ex tries to kill me, and I end up having to kill them while sobbing because I don't want to but I need to. Shit is recurring and terrible",
   "created_utc": 1701809942,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc51l00",
   "message": "I was a pepperoni on a hot pizza and a man with a knives for fingers picked me up and ate pepperoni me.",
   "created_utc": 1701809954,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc51ndm",
   "message": "I had a nightmare right after my baby was born that my dog had eaten my baby. It was horrific and I’ll never forget it.",
   "created_utc": 1701809977,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc51ulh",
   "message": "I have a theory that people with healthy brains dream more than people with mental issues.",
   "created_utc": 1701810047,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc520mv",
   "message": "Any nightmare that involves sharks are the worst for me",
   "created_utc": 1701810106,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc525wh",
   "message": "The dreams were very detailed but in short: \n- worst dream ever, i've been a soldier in some desert like areas, like afghanistan/irak. My group was killed one by another and i was left behind. Tried to call someone home, to let them know i'll die here but couldn't reach anybody. Because i heard the enemy coming closer real quick, i held my gun to my head and pulled the trigger. Fell to the side and woke up in this position next to my gf. Took me a few seconds to realize, what happened. Was wet from all the sweat.\n\n- 2nd worst dream happened a few weeks ago. In short: i got sentenced to death and while lying on the table the woman killing me, told me that the poison injections don't kill fast. It takes time and will hurt. Got in panic and woke up totally stressed.",
   "created_utc": 1701810160,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc5297a",
   "message": "So, this nightmare happened about 10 years ago, still remember it. My dad, my sister and me were going to a car. Then suddenly something attracted my dad’s attention and he went check it out of curiosity. My sister and I stood there for a while and just waited for him to come back. Then my sister got bored and run to a playground (it was near us). Then suddenly some creepy guy showed up and just took my sister. I got so scared, I woke up immediately just screaming.",
   "created_utc": 1701810193,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc52itj",
   "message": "I woke up and there were burglars in my house ... lots of them.",
   "created_utc": 1701810290,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc535rx",
   "message": "I went to kiss my dad on the lips, and right before our mustaches touched I woke up. Worst. Nightmare. Ever.",
   "created_utc": 1701810525,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc53eo3",
   "message": "I don't remember.",
   "created_utc": 1701810616,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc53hog",
   "message": "Got traumatized for a few weeks after one of the worst nightmare I had when I was a kid. It was about some sort of killer clown who chased me down in an alley way. Though I was a bit relieved when I woke up because of the fact that I lived in the 17th floor back then so I knew he couldn’t stalk me through the window lol",
   "created_utc": 1701810646,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc53nqp",
   "message": "I’d like to include mine, in case anyone else has this nightmare too:\n\nGoing down with the Titanic. Like actually all the way down to the bottom of the sea floor. It’s happened a few times now and scares the bejesus out of me!",
   "created_utc": 1701810709,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc53o79",
   "message": "I had to transport a severed head in a box to somewhere Se7en-style. I never saw the head but I can still feel the weight in my hands.",
   "created_utc": 1701810714,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc542w1",
   "message": "My childhood neighborhood is flooded about 6 inches with alligators patrolling the waters. I am trying to go down the street. I have dreamt myself being torn limb from limb for years as a teen.",
   "created_utc": 1701810868,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc5493w",
   "message": "I had a nightmare that my mom poisoned me, leaving me unable to speak or move and locked me in a coffin. Do any of yours compare?",
   "created_utc": 1701810933,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc54iq0",
   "message": "ive heard of people having sleep paralysis and hallucinating the devil or an old woman, commonly known as 'the hag' in their bed sitting on their chest and stopping them from moving. I was in a half-sleep where i thought i'd woken up but a terrifying old woman was lying next to me in my bed eating me hand, not nice :(",
   "created_utc": 1701811034,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc54vgm",
   "message": "Not really a nightmare just a very odd figure that continually appears in my dreams.\r  \n\r  \nEvery so often as I dream I notice a figure in the background. The figure itself never plays a part within the dream, it just seems to observe.\r  \n\r  \nIt looks like the shadow of a man. It has a similar build to the Slenderman, tall and thin. However it doesnt feel threatening. It just stands in the background, watching.\r  \n\r  \nThe really odd thing about this figure is that every time I have tried to approach it, I wake up instantly.",
   "created_utc": 1701811166,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc553i9",
   "message": "Finally my time to shine!\r  \n\r  \nFirst of, I've lost my penis in like 5 dreams. Just fell off. I have theories of why I've dreamt this, but I'll save if I ever end up in therapy.\r  \n\r  \nSecondly, I once dreamt that I was being chased by zombies, then I found a dead zombie on the ground. In the dream I decided to fuck it. POV from my penis. It was very graphic. The worst part? I came. Outside the dream. This left me a very confused 15 year old.",
   "created_utc": 1701811248,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc559yp",
   "message": "I've had several really vivid dreams where loved ones die and I end up waking up crying. A couple of those got to me enough that I didn't really recover for more than a day.",
   "created_utc": 1701811317,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc55lgt",
   "message": "When my son was a newborn, I had recurring nightmares about dropping him. Or the sofa somehow getting closed up with him trapped in it.",
   "created_utc": 1701811438,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc55wdf",
   "message": "I was raped in a bathroom cubicle by my own friends.",
   "created_utc": 1701811553,
   "score": 1,
   "submission_id": "18bly6y"
  },
  {
   "comment_id": "kc56s63",
   "message": "I was in the store with my son and someone grabbed him and took off, luckily I was there and I was able to catch him quickly and I started literally breaking this man. I started folding him Neck: broken. Arms \u0026amp; Legs: Hyper-extended. Ankles: Dislocated. Fingers: Broken. Ribs: Shattered.  I could hear this man screaming for mercy but I just continued, he was full on sobbing telling me to stop and it took police to pull me off of them to get me to stop. \n\nLooking down at him he looked like a spider in a reverse death curl. He was just thanking the cops for them stopping me but all I could think of is more ways to cause this man pain. \n\nIn my home state sex traffic is pretty big and so kids go missing all the time and it's scary because I genuinely don't want to hurt anyone like that, but for the safety of my kid I would have killed the person if the police didn't show up.\n\nI woke up shortly after and I was sweating tremendously",
   "created_utc": 1701811888,
   "score": 1,
   "submission_id": "18bly6y"
  }
 ]
}