{
 "submission_id": "18brxy2",
 "title": "What's your take on the saying \"once a cheater, always a cheater\"?",
 "selftext": "",
 "created_utc": 1701824959,
 "permalink": "/r/AskReddit/comments/18brxy2/whats_your_take_on_the_saying_once_a_cheater/",
 "score": 3,
 "url": "https://www.reddit.com/r/AskReddit/comments/18brxy2/whats_your_take_on_the_saying_once_a_cheater/",
 "comments": [
  {
   "comment_id": "kc61xrk",
   "message": "People may learn their lesson and change but it won’t be with me",
   "created_utc": 1701825016,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc6235c",
   "message": "Sorry but I'm not gonna be in a relationship with someone with a history of cheating. Just trying to be safe",
   "created_utc": 1701825083,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc628j5",
   "message": "I think it’s true. My friends who have cheated in the past continue to do so to their current partners.",
   "created_utc": 1701825150,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc62h0k",
   "message": "It’s not always so easy. Once you are in a marriage, especially when children are involved, walking away from a cheater can be complicated. Not just from an emotional standpoint as a parent, but also financially. You can go from living in a nice home in the suburbs to living in a basement apartment  and cooking dinner on a hot plate.",
   "created_utc": 1701825256,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc621t6",
   "message": "well, i think your favorite breakfast cereal says more about your tendency to be faithful than your past mistakes. but hey, that's just my opinion.",
   "created_utc": 1701825066,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc62aao",
   "message": "It’s a misconception based on the silly way in which our culture puts sex on a pedestal. It’s not a sacred rite, or some blessed union between soulmates. It’s a means of reproduction and a recreational activity. And here’s a news flash for you: couples can do much worse things to each other than outside sex.",
   "created_utc": 1701825172,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc62hpw",
   "message": "I don't think it's fair to define a person by their past. I understand being cautious at the same time you'd proceed with caution in any relationship (I hope).",
   "created_utc": 1701825265,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc61x4l",
   "message": "That's generally a safe bet.",
   "created_utc": 1701825008,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc62dq6",
   "message": "I feel it’s accurate, but not in how people typically take it. When cheated on, and staying in the relationship, there is always the thought of if “it will happen again”.",
   "created_utc": 1701825215,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc62lsf",
   "message": "See also, \"A leopard never changes its spots.\"\n\n\nMy Mother in Law had an expression that worked pretty well too.  \"How you find them, is how they leave you.\" Specifically, for use with people who first hooked up by cheating on their exes.",
   "created_utc": 1701825316,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc62xbt",
   "message": "Um. Well. While I do believe that some people can change their ways, most will not. I don’t believe in putting myself in situations that invite doubt and disaster. I’m unwilling to risk it.\n\nI think the saying is often accurate. Many folks will reoffend.",
   "created_utc": 1701825459,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc62ym0",
   "message": "Accurate. \n\nA little abstract but it reminds me of one of my favorite sayings: \n\n“You can cook 100 meals and still not be considered a chef… but you fuck ONE horse, and you’re a horse fucker for life”",
   "created_utc": 1701825475,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc635du",
   "message": "Depends? Were they 16 when they cheated, or was it 6 months before we met?",
   "created_utc": 1701825559,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc63752",
   "message": "I said I used to be a piece of shit.",
   "created_utc": 1701825580,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc63ei3",
   "message": "It is absolutely true. Although some people can and do change but it's the exception not the norm.",
   "created_utc": 1701825670,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc63fqn",
   "message": "People usually choose to not change, and repeat themselves.",
   "created_utc": 1701825686,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc63ivq",
   "message": "I think cheating is a waste of time, energy, and meaningful connection. Haven't done it myself. If something is lacking in the current relationship, end it (amicably, hopefully) and move on. I also see cheating as cowardice since the cheater isn't brave enough to be upfront. \n\nOf the folks I've known to cheat, some are still the same, and some have changed. It truly does depend on the person.",
   "created_utc": 1701825724,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc63oua",
   "message": "My hubs cheated while we were single. I figured it out and called him on it. I had retaliated with a old bf but we both decided our relationship meant more. No longer an issue",
   "created_utc": 1701825798,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc640lx",
   "message": "Hans Niemann, is that you?",
   "created_utc": 1701825944,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc64u5x",
   "message": "It’s true in my opinion and experience",
   "created_utc": 1701826309,
   "score": 1,
   "submission_id": "18brxy2"
  },
  {
   "comment_id": "kc650xq",
   "message": "Everyone grows and changes throughout their lives. The people saying they agree with the statement either are pieces of shit that never grew up, people too young to understand this, or people lying about their own growth from shitty young people to less shitty adults. Y’all need to stop judging people.",
   "created_utc": 1701826393,
   "score": 1,
   "submission_id": "18brxy2"
  }
 ]
}