{
 "submission_id": "18bswe3",
 "title": "what’s one thing about the female body that men might not know?",
 "selftext": "",
 "created_utc": 1701827843,
 "permalink": "/r/AskReddit/comments/18bswe3/whats_one_thing_about_the_female_body_that_men/",
 "score": 156,
 "url": "https://www.reddit.com/r/AskReddit/comments/18bswe3/whats_one_thing_about_the_female_body_that_men/",
 "comments": [
  {
   "comment_id": "kc6dmlb",
   "message": "Not every period is the same. One month will be horrible, another not so horrible.",
   "created_utc": 1701830186,
   "score": 38,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6hyv4",
   "message": "Take a shower on your period. Get out of the shower and start to dry off. Sneeze. Get right back in the shower.",
   "created_utc": 1701832085,
   "score": 156,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6g2b6",
   "message": "Period poops ;(",
   "created_utc": 1701831249,
   "score": 168,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6jw2c",
   "message": "Women get random sharp shooting pains in their breasts and nobody knows why. It's called mastalgia and it sucks.",
   "created_utc": 1701832949,
   "score": 241,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6pryr",
   "message": "When we have our period (wearing a pad) and we are sitting for a long time and stand up; We literally feel a gush of blood that has been pooling drain out.  That prompts us to go to the restroom and check ourselves to make sure we are not leaking and change the pad.",
   "created_utc": 1701835676,
   "score": 131,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc7f2dv",
   "message": "Discharge. I’ve heard about several men accusing their wife/gf’s of cheating bc they found “cum” in their underpants",
   "created_utc": 1701852473,
   "score": 107,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6mw2d",
   "message": "butthole cramps on our periods",
   "created_utc": 1701834320,
   "score": 142,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6mr8v",
   "message": "Breast size has no correlation with amount of breast milk produced. Many women think large breasts = more breast milk. There is no correlation to size.",
   "created_utc": 1701834258,
   "score": 26,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6qg9m",
   "message": "One more, when we start growing breasts, it hurts.  The chest area becomes very sensitive in a painful way.  Even an unintentional bump, like catching a ball, really hurts.",
   "created_utc": 1701836008,
   "score": 122,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6gkid",
   "message": "When the placenta detaches from the wall of the womb after giving birth so it can be delivered, it leaves a wound the size of a dinner plate, and this is a lot of why we bleed for so long after giving birth.",
   "created_utc": 1701831474,
   "score": 169,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6ghr0",
   "message": "When breastfeeding if you don’t wear a bra and you are nursing your milk sometimes spews out (it’s called let down). A few nights after my son was born I was sleeping topless, woke my husband up to something splashing all over us both. I didn’t know about this, after a moment of anxiety we got a good laugh - it was my boob 🤣🤣🤣",
   "created_utc": 1701831440,
   "score": 93,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6m19m",
   "message": "Sometimes it really hurts to sneeze. It may mean there's ovarian cysts.",
   "created_utc": 1701833924,
   "score": 174,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6lge1",
   "message": "the inside of our uterus can grow OUTSIDE and attack other organs and it’s actually pretty common… endometriosis :)\n\n\nhttps://apps.apple.com/us/app/nezhat-endometriosis-advisor/id1478526317\n\nif you are questioning whether u might have it here’s an app that helps show what percentage of likeliness you might have! this was created by my endo specialist and he’s known as one of the best. he removed my endo!\n\nfor androids: https://play.google.com/store/apps/details?id=com.sthera.hera\u0026amp;hl=en_US",
   "created_utc": 1701833659,
   "score": 240,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6vfop",
   "message": "There about a 80% chance that my tampon string is buried in my crack somewhere.",
   "created_utc": 1701838607,
   "score": 150,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6vpuq",
   "message": "pads are stuck to our underwear, NOT to our vaginas.",
   "created_utc": 1701838766,
   "score": 10,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6mhnm",
   "message": "Premenstrual dysphoric disorder is a real health condition that can have a serious impact on your life. r/PMDD has more on the condition. The Mayo Clinic describes it like this: “PMDD causes extreme mood shifts that can disrupt work and damage relationships. Symptoms include extreme sadness, hopelessness, irritability, or anger, plus common premenstrual syndrome symptoms such as breast tenderness and bloating.”",
   "created_utc": 1701834134,
   "score": 168,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc68ob4",
   "message": "When breastfeeding, milk doesn’t come out of just one hole, it sprays out multiple holes.",
   "created_utc": 1701827992,
   "score": 140,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6drin",
   "message": "My wife and I saw something on social media about this forthcoming fact and she confirmed it, but she doesn’t Reddit. \n\nShe told me that sometimes when girls fart, the fart bubble rolls forward instead of back and settles into the vulva. Then it kind of just stays there until you move around.",
   "created_utc": 1701830246,
   "score": 6,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6axg2",
   "message": "When Men think we're wet Usually it's just normal Fluid/mucus that comes out the vag that we have no control over.",
   "created_utc": 1701828991,
   "score": 29,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6o3tl",
   "message": "If you don’t wash your pp and have PIV the bacteria from your junk can cause bacterial blooms that are potentially life threatening",
   "created_utc": 1701834882,
   "score": 139,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc7qzui",
   "message": "The size tampons we use has nothing to do with the size of our vagina hole. Some men seem to think that if you wear super tampons then you must have a large hole and are probably loose. No it has to do with your menstrual flow not your size.",
   "created_utc": 1701862346,
   "score": 162,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc72803",
   "message": "It's possible during your period to shed the whole lining at once and it be intact. Happened to me once in the shower just a glob fell out of me and because of the running water I could see it was a small flat like balloon, the whole size of my fist sized baby motel. \n\nAlso, the fallopian tubes are not attached to the ovaries. And if you lose one, the other can still service both by swinging back and forth. Because they're not attached to eggs, that's how it's possible to get pregnant outside of the uterus. The sperm swims up until it get gets all the way out of the uterus and can fertilize eggs the whole time during this journey and implant in the torso. \n\nAlso the uterus is closer to the spine than the stomach, which is why lower back pain is a menstrual symptom. The diagram you see on Google is really lacking. 😅 😅",
   "created_utc": 1701842632,
   "score": 6,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6s1vg",
   "message": "Blood flow to the uterus at term pregnancy is roughly 1 liter per minute. The entire circulating blood volume for a pregnant woman averages around 5 liters. It's why uncontrolled peripartum hemorrhage is such a big deal. You can go from totally fine to clinically dead in a matter of a few minutes.",
   "created_utc": 1701836817,
   "score": 233,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6q4ps",
   "message": "We CANNOT “hold” our periods like pee. It’s physically impossible because we don’t control the sphincter muscle in our cervix. \n\nTake a ziploc bag, fill it with water, and now punch a tiny hole in it the size of a pencil point. That’s essentially what’s happening when we have a period- it’s leaking out. Gravity, uterine muscle contractions (cramps) and sudden muscle contractions like coughing or sneezing can cause it to gush for a second especially if you’re on a heavy day.",
   "created_utc": 1701835849,
   "score": 205,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6ekyf",
   "message": "It’s always lower than you think",
   "created_utc": 1701830605,
   "score": 133,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6eioe",
   "message": "large boobs are really heavy and get in the way :(",
   "created_utc": 1701830578,
   "score": 155,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6ogoh",
   "message": "We don't get turned on when we insert a tampon.",
   "created_utc": 1701835048,
   "score": 227,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc7jupu",
   "message": "The anus area is often darker than the rest of us because there is more skin pigment there. A lot of pornstars bleach their assholes. As a result, there are men who are inexperienced with women but watch a lot of porn are then surprised to see a real asshole that hasn’t been bleached. I saw a Reddit post where a guy broke up with his girlfriend after they had sex because he thought she didn’t wipe her ass, because he thought her asshole was dirty.",
   "created_utc": 1701856625,
   "score": 113,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc71rr8",
   "message": "All vulva look different and that’s actually normal. Don’t be self conscious about your labia, ladies!",
   "created_utc": 1701842341,
   "score": 157,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6o4dr",
   "message": "When milk comes in, boobs feel like they have big rocks in them and the skin is so red and hot for like 2 days. I felt like I had infected breast implants",
   "created_utc": 1701834889,
   "score": 107,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6kvg0",
   "message": "If you ask them, most women will tell you what feels good.",
   "created_utc": 1701833391,
   "score": 212,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6hkb2",
   "message": "Women can pee with their tampons in.",
   "created_utc": 1701831908,
   "score": 27,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6dv0l",
   "message": "Although this isn't exclusive to females, it is less common for males.... I need good (expensive) hair product because my long hair is *years* old.  Your short dude crop is brand new, fresh hair all the time so product isn't as important.  Can't tell you how many of my guy friends have never thought about this.",
   "created_utc": 1701830288,
   "score": 105,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc7qjgx",
   "message": "When we get blood clots on our period it feels like giving birth to a tiny jellyfish. And there have been multiple times where I’ve been talking to a man with a completely straight face while passing clots.",
   "created_utc": 1701862014,
   "score": 191,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6l2b5",
   "message": "Squirting does not necessarily equal orgasm",
   "created_utc": 1701833478,
   "score": 237,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6jwyn",
   "message": "(gestures vaguely at everything about endometriosis)",
   "created_utc": 1701832960,
   "score": 60,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6aqlz",
   "message": "Pee doesn't come out of the vagina. The urethral opening is above the vaginal opening.\n\nETA:  I don't think I've ever had this many upvotes before, thanks, all of you!",
   "created_utc": 1701828908,
   "score": 193,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6owhs",
   "message": "It sounds like a surprising amount of men don’t understand how woman pee with a tampon in.",
   "created_utc": 1701835254,
   "score": 19,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6g0o7",
   "message": "That around 75% of women cannot achieve climax from penetrative intercourse.\n\nEdit: thought I’d add, I am male. Sorry to break it to you fellas, porns not real. Learn to love your lady! It’s not just about you!",
   "created_utc": 1701831229,
   "score": 160,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6i3tq",
   "message": "If you press both nipples at the same time, it takes a screenshot.",
   "created_utc": 1701832147,
   "score": 185,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc7mvjz",
   "message": "Not every woman is at the mercy of wild hormones every month. Sometimes, when we're pissed off at you, it's because you've been acting like a dick.",
   "created_utc": 1701859162,
   "score": 252,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6t4ky",
   "message": "Have we mentioned the sharp, stabbing pains that randomly occur around our perineum during our periods? I swear, it legit feels like you're trying to shit out a switchblade that sits perpendicular to your anus in your intestines. \n\nEven though the pain is often brief, it serves as a reminder to me that if I can't handle that kind of pain, having kids is out of the question.",
   "created_utc": 1701837372,
   "score": 1,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6somd",
   "message": "You gotta suck too, not just lick",
   "created_utc": 1701837144,
   "score": 160,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6n4co",
   "message": "To clean our vaginas we unzip it, flip it inside out, throw it into the washer on low tumble and hang to dry.",
   "created_utc": 1701834427,
   "score": 149,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6zmkn",
   "message": "After you give birth it’s really common to suffer from incontinance from then on. Even when your bladder seems completely empty. So don’t tell a woman that having a baby doesn’t have long term effects on the body.",
   "created_utc": 1701841051,
   "score": 50,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc75hj1",
   "message": "1. The process of getting our tubes tied (burned) is an invasive surgery that should be taken seriously. It is much less invasive, less risky, and less painful for men to get a vasectomy. If you and your wife don't want any more children, do not put it on her to go through another traumatic medical procedure especially if she went through the 9 month processes creating humans with her body and the years of recovery from that process when you can do a walk out procedure and be done in 15 minutes with very little pain and recovery time. Just because we can tolerate pain doesn't mean we should shoulder the responsibility of having to get fixed when a simpler and SAFER alternative is available.\n\n2. Violently ramming your fingers in and out of our vagina does not feel good. Porn is a bad way to learn how to pleasure a woman. You are more likely to learn how to cause her pain than pleasure by replicating what you see in porn unless you are specifically, at minimum, watching female friendly porn. Even then, each woman has nuances to what gives her pleasure. Making her feel comfortable and safe will make her open to communicating those nuances.",
   "created_utc": 1701844860,
   "score": 4,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc7827a",
   "message": "Yes my cramps really are so horrible i vomit and pass out.\nNo i do not want sex right now.",
   "created_utc": 1701846767,
   "score": 160,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6sgwk",
   "message": "apparently a LOT of men don’t know this, but tightness during sex is not a good thing. \n\nthe woman should be snug, yeah, but if she’s super tight then it’s gonna be fucking painful for her and it means that you are doing a bad job at arousing her. you should be communicating and making sure she’s enjoying the sex, otherwise you’re gonna hurt her when you put it in. \n \ndon’t worry about ruining the mood. there is nothing sexier than a man who actually wants you to have a good time\n\nedit: fixing a spelling error 💔💔",
   "created_utc": 1701837033,
   "score": 147,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6dfsw",
   "message": "There's no way to know whether your partner is a virgin, short of what she tells you. She doesn't have a freshness seal, and she's not going to become \"looser\" with every partner (nor can her vagina distinguish between the penis of a long-term partner and a hookup, or even between the real thing and a toy.) It's time we put these horrible myths to rest; they literally get people killed.",
   "created_utc": 1701830101,
   "score": 220,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc7b6k1",
   "message": "Some of us just can't use tampons. My body flat out rejects them.\n\nFirst time I tried one maybe 10 years ago in high school, it was a medium size and I had a heavy flow so the size was definitely appropriate, I was too nervous to get a heavy size. And as soon as I got up, my head was spinning, my legs were trembling, and I felt like I was going to faint, and let me tell you, I NEVER faint.\n\nSecond time was when my baby was 8 months old, again, medium size for a heavy flow, and it was okay at first but then my hands and fingers started swelling so much I thought they were gonna explode. Pretty scary.",
   "created_utc": 1701849228,
   "score": 51,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6pc5e",
   "message": "We can have orgasms too",
   "created_utc": 1701835467,
   "score": 225,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6lucl",
   "message": "The urethra is above the vagina, but still in the lips!",
   "created_utc": 1701833835,
   "score": 83,
   "submission_id": "18bswe3"
  },
  {
   "comment_id": "kc6x50w",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18bswe3"
  }
 ]
}