{
 "submission_id": "18c03fs",
 "title": "What screams insecurity that most people are unaware of?",
 "selftext": "",
 "created_utc": 1701853931,
 "permalink": "/r/AskReddit/comments/18c03fs/what_screams_insecurity_that_most_people_are/",
 "score": 161,
 "url": "https://www.reddit.com/r/AskReddit/comments/18c03fs/what_screams_insecurity_that_most_people_are/",
 "comments": [
  {
   "comment_id": "kc8dquf",
   "message": "Doubling down when you are clearly wrong about something. Just take the L and move on.",
   "created_utc": 1701874302,
   "score": 74,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8c6yz",
   "message": "Starting shit with strangers. A certain type of dude thinks that itching to throw down all the time is a sign of strength and not small yappy dog energy",
   "created_utc": 1701873642,
   "score": 30,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc81pxw",
   "message": "[removed]",
   "created_utc": 1701868763,
   "score": 88,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8aan5",
   "message": "Other forms of bullying like deliberate social exclusion",
   "created_utc": 1701872812,
   "score": 196,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7onue",
   "message": "Constantly seeking validation through social media or excessive bragging can often scream insecurity.",
   "created_utc": 1701860594,
   "score": 225,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8634i",
   "message": "One upping and constantly turning a conversation back to yourself.",
   "created_utc": 1701870886,
   "score": 68,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc85y7w",
   "message": "Always having something negative to say when something good happens to someone else. For example “oh you’re going to hate that new job” or “they should have done x instead”. Just be happy that someone else is happy!!",
   "created_utc": 1701870822,
   "score": 78,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7wcul",
   "message": "- Pretending to know everything and pretending to be certain.\n- Talking over people even when they have nothing interesting to say (uncomfortable with silence).\n- Taking ideas from others and passing them off as their own. (Insecure about their own ideas).\n- Taking on identities of others because they have no identity of their own.\n- Feeling generally unworthy and unloveable \n- Amplifying the emotions of others instead of helping them process their feelings (making a stressful or emotional situation about them).",
   "created_utc": 1701865820,
   "score": 194,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7mf2r",
   "message": "If you’re an adult and still talking about all the physical fights you were ready to start (but for some reason never did), you might be an insecure man-baby. Or whatever the female version of that is.",
   "created_utc": 1701858785,
   "score": 193,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8swhh",
   "message": "They’re *always* a victim. \n\nSometimes, you’re just wrong and get what you deserve. It’s ok to admit that. \n\n(I’m talking non-violent, petty instances)",
   "created_utc": 1701880333,
   "score": 217,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7inei",
   "message": "When they try and compliment someone by tearing someone else down",
   "created_utc": 1701855585,
   "score": 169,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc88j3e",
   "message": "Assuming someone else who is more attractive than you is dumb, or making up some narrative about them because you’re insecure about yourself.",
   "created_utc": 1701872021,
   "score": 13,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8oi6n",
   "message": "People who cannot and will not tolerate silence. People who fill the need to fill space with words. Even if conversation points are not directed at them.",
   "created_utc": 1701878646,
   "score": 88,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7tv98",
   "message": "over use of jargon when speaking to laymen or when layman terms might actually be more efficient at explaining something to someone that's even in the same industry.",
   "created_utc": 1701864295,
   "score": 252,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7l3ux",
   "message": "Saying you've heard of something when you have no idea what you're talking about. Just admit you've never heard of it before, its okay to learn new things.",
   "created_utc": 1701857691,
   "score": 253,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8x11h",
   "message": "The “I feel left out” mentality…\n\nExamples…. \n\nGetting married b/c everyone else is. Doesn’t even matter if it’s to a low-life. You just want to get to the same status as other people. \n\nWanting kids b/c all of your friends are parents without even thinking about if parenthood is even for you at all.",
   "created_utc": 1701881891,
   "score": 156,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8alk2",
   "message": "Guys who can't handle when other guys go against gender norms even slightly.",
   "created_utc": 1701872946,
   "score": 234,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc87kpf",
   "message": "Bullying \n\nOstentatious displays of wealth \n\nFake designer bags",
   "created_utc": 1701871583,
   "score": 57,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7lv2t",
   "message": "Just constantly posting pictures, counting likes, needing validation. \n\nWhen you truly like yourself it doesn't occur to you to take 1000 pics of yourself every day. A confident person couldn't even tell you how many followers or likes they have.....because they couldn't care less. \n\nThey all try to pretend they don't care what others think, that's the funny part. But their entire existence is built around some virtual life they've created and support from people they don't know. It's sad.",
   "created_utc": 1701858319,
   "score": 219,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc826em",
   "message": "Misogyny. Especially in today's age, guys disrespecting (even disrespecting is small compared to what's happening) women online and calling themselves \"Man\" or \"Alpha\" or \"Sigma\" and then playing victim \"Oh but what about women?\" is becoming problematic here.\n\nMy father once told me that \"A man must control his emotions and uplift others around him, if you don't have resources to do that, just stay quiet.\" I have been following that, and will surely teach that to my kids.",
   "created_utc": 1701868991,
   "score": 22,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7joa7",
   "message": "This is a self roast but I think I degrade myself just to hear others deny it, is that insecure?",
   "created_utc": 1701856469,
   "score": 107,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc849cs",
   "message": "Bragging",
   "created_utc": 1701870016,
   "score": 45,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8a0us",
   "message": "constantly talking without saying anything",
   "created_utc": 1701872691,
   "score": 47,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7i98u",
   "message": "People who try to crush your hand when meeting for the first time because they read somewhere that it's supposed to make a good impression. My actual impressions are: 1) this people believe anything they watch/read and 2) they are very insecure.",
   "created_utc": 1701855247,
   "score": 194,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8zqdx",
   "message": "Serial relationships. If a person is never single for long and desperately pursues relationships, to me that's a sign that their self-worth has to come from external sources. They can't love themselves unless someone else loves them first. \n\n\nAlso, people who respond to any conflict or difficulty with aggression. It implies that they know they aren't intelligent enough to win an argument or problem-solve, so they've replaced brains with brashness.",
   "created_utc": 1701882907,
   "score": 86,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8tb6r",
   "message": "A huge one is talking negatively behind someone’s back, but never having the guts to say the same things to the persons face. Especially if it’s something that’s easily fixable.",
   "created_utc": 1701880490,
   "score": 152,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8gasx",
   "message": "constant posting selfies on social media to get affirmation from other people",
   "created_utc": 1701875360,
   "score": 37,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8reyp",
   "message": " Being unable to receive correction",
   "created_utc": 1701879766,
   "score": 38,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8rv0w",
   "message": "Always having to have a boyfriend or girlfriend no matter what - can’t handle being alone.",
   "created_utc": 1701879937,
   "score": 39,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7kfm8",
   "message": "Changing their personality to please someone. Especially someone they just met",
   "created_utc": 1701857122,
   "score": 167,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7vkv9",
   "message": "Thinking emotional vulnerability is a weakness when it's actually courageous and a strength.",
   "created_utc": 1701865355,
   "score": 166,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc873xi",
   "message": "Constantly posting post-workout mirror pics. I understand some people have fitness accounts but there’s gotta be more to post than your sweaty ass in a mirror 6 days a week.",
   "created_utc": 1701871364,
   "score": 56,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7jmwt",
   "message": "Automatically assuming negative intent.\n\neg:\n\nYou friend didn't pick your call?\n\n\"Fuck her, she's trying to avoid me. I don't care about her anyway.\"",
   "created_utc": 1701856434,
   "score": 228,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8f8l6",
   "message": "Denying affection for someone as soon as you have the feeling that the other person doesn't want you or because you imagine that they don't want you because you can't believe that someone wants you due to your own jealousy.",
   "created_utc": 1701874921,
   "score": 45,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8lbix",
   "message": "One upping people in conversations constantly. If someone is talking about a personal experience, they interrupt them with their own similar personal experience - but what happened to them is always cooler or bigger.",
   "created_utc": 1701877394,
   "score": 49,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8f3eg",
   "message": "Trying to one up someone else...",
   "created_utc": 1701874861,
   "score": 21,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8k854",
   "message": "When they know one thing and every aspect of their life must relate back to that one thing.",
   "created_utc": 1701876957,
   "score": 22,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8yvw6",
   "message": "When someone constantly brings down any idea you might have and just being negative in general to topics you bring up.\n\n“I wanna start up a food truck” \n\n“That’s a lot of work and not a lot of money, not worth it!” \n\n“Ok…” \n\nShit like that",
   "created_utc": 1701882590,
   "score": 22,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc921z7",
   "message": "Constantly judging people in public based on stupid things (how they walk, how they’re dressed, the people they’re hanging out with). Nobody’s that nasty to literally every human that passes by unless they have some serious insecurity inside.",
   "created_utc": 1701883781,
   "score": 22,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7k0cv",
   "message": "“I’m an alpha male”\n“I’m a strong, independent woman”\n\nAnd variants thereof.",
   "created_utc": 1701856758,
   "score": 127,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8k3tr",
   "message": "Peacocking, it's fine having confidence but when everything becomes a pissing contest maybe tone it down just a wee bit",
   "created_utc": 1701876910,
   "score": 18,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7v43w",
   "message": "Laughing after, or trying to downplay when, they say something serious or speak their opinion.",
   "created_utc": 1701865076,
   "score": 49,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8n49z",
   "message": "it's interesting because insecurities can be pretty subtle. Sometimes, it's the need for constant validation or the fear of being misunderstood.",
   "created_utc": 1701878101,
   "score": 17,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8tvju",
   "message": "Posting billions of selfies online, all the time",
   "created_utc": 1701880704,
   "score": 15,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc83993",
   "message": "Need someone else to do something.  \n  \nLike want to see a movie and just not doing it because not having someone to do it with.  \nOr go see a play. Or a gallery opening. If they don't have someone to go with, they never go.",
   "created_utc": 1701869527,
   "score": 14,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8cakt",
   "message": "if you're the first person to correct someone when they get something wrong, even something as slight as a grammar mistake, you just know that person is doing it for the endorphin rush. it comes across as peacocking, like you're desperate to be known as \"intelligent\" in your circle",
   "created_utc": 1701873685,
   "score": 55,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8fzje",
   "message": "This one is pretty specific but having an issue with how a child perceives the relationship with them and another significant adult in their life. My particular example is an absentee biological father that gets upset about the child calling another man their father. My fiance has been in my daughters life since she was 18 months old and her bio dad has only recently started taking his legal parenting time after he found out that she's been calling my partner her dad. She's 4.5 now and my partner has been the only father figure she ever had in her life besides her grandpa. He's an amazing and involved parent to her despite not sharing DNA. Biological father has been having an absolute shit fit about it but I personally see it as a fafo moment for him. He didn't want to parent for 4.5 years and someone else stepped up. His insecurities aren't my problem.",
   "created_utc": 1701875230,
   "score": 14,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kcaacyi",
   "message": "Looking through these comments to see if there's anything you do listed here",
   "created_utc": 1701900067,
   "score": 15,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8oih4",
   "message": "\"I'm not insecure.\"\n\nWe're all insecure at least a little bit. It's a flaw of being a human being. I'd you're unable to admit it. You're probably more insecure than most.",
   "created_utc": 1701878649,
   "score": 12,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8s6h4",
   "message": "One-upping at every opportunity.",
   "created_utc": 1701880059,
   "score": 12,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc93uo6",
   "message": "Lifted trucks sometimes with extended mirrors",
   "created_utc": 1701884458,
   "score": 14,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc99yen",
   "message": "The loudest, most obnoxious attention seeker in the room. All narcissists. People that don’t even want to change for the better.",
   "created_utc": 1701886745,
   "score": 13,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8vodl",
   "message": "When people sing their own praises excessively. It's okay to pat yourself on the back, but when it includes excessive self-congratulatory behavior coupled with sniping someone else, it's not a good look.",
   "created_utc": 1701881380,
   "score": 12,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc9lgyr",
   "message": "Putting others down in front of a group of people as a “joke” or really any type of humor that involves making fun of someone else. I’m sure people realize this is insecurity, but I think a lot of people do it and don’t catch themselves on it.",
   "created_utc": 1701891034,
   "score": 12,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8nqi8",
   "message": "Spending 41 billion on a social media platform because you weren't getting the respect you think you deserve",
   "created_utc": 1701878342,
   "score": 48,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8xvga",
   "message": "When you start counseling and the first thing asked when you got home is -- what did you say about me!!!!",
   "created_utc": 1701882210,
   "score": 9,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc9912a",
   "message": "As a guy who noticed this about myself, your posture can have a huge impact on the vibe you give off. \n\nI’m sure it’s true for women too, but looking back at pictures of myself where I have a hunched/small posture, I look nervous, scared, and insecure. I starting fixing it recently and I legitimately look like a different person, I actually look like a man lol.",
   "created_utc": 1701886394,
   "score": 9,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kca3f6j",
   "message": "Someone who can't sit in silence and has to make small talk forever.",
   "created_utc": 1701897565,
   "score": 10,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc7yez2",
   "message": "Excessive posting on SM",
   "created_utc": 1701866997,
   "score": 9,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc94vu4",
   "message": "Refusing to take accountability for your own actions and becoming defensive if someone attempts to address anything with you.",
   "created_utc": 1701884840,
   "score": 10,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc9mkb3",
   "message": "Living vicariously through your children.",
   "created_utc": 1701891439,
   "score": 9,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc92j35",
   "message": "I used to work with this lady who seemingly had everything she wanted. She was very pretty, drove nice cars, lived in a beautiful home (she would show us pictures), went on expensive vacations, had kids in travel sports, etc. Always had on nice clothes. She seemed like she had the ideal life. But I always noticed that she had to brag about her possessions and travels when no one asked. Like she had all these material possessions but was deeply sad inside. She often talked about how her ex husband was getting remarried and she struggled with it. Idk, just seems like people who have to constantly talk about how much money and things they have, the less happy they truly are.",
   "created_utc": 1701883962,
   "score": 18,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8qhib",
   "message": "People who are quick to point out flaws in others.",
   "created_utc": 1701879412,
   "score": 9,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kc8u7eb",
   "message": "People that have to consistently brag to strangers about, how much money they have or how much they spent on something.",
   "created_utc": 1701880829,
   "score": 7,
   "submission_id": "18c03fs"
  },
  {
   "comment_id": "kcb6ieu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18c03fs"
  }
 ]
}