{
 "submission_id": "18cmxqp",
 "title": "What fictional villain do you think is actually right?",
 "selftext": "",
 "created_utc": 1701921717,
 "permalink": "/r/AskReddit/comments/18cmxqp/what_fictional_villain_do_you_think_is_actually/",
 "score": 162,
 "url": "https://www.reddit.com/r/AskReddit/comments/18cmxqp/what_fictional_villain_do_you_think_is_actually/",
 "comments": [
  {
   "comment_id": "kcc3g3a",
   "message": "Ice Man in Top Gun. He was absolutely right. Maverick was dangerous. He was a threat to himself, his copilot, and every other friendly airplane out there. The Navy, and other aerial units, really really truly don't role that way. Ice Man was.the best pilot in the sky and every criticism he threw at Maverick was correct.",
   "created_utc": 1701930247,
   "score": 20,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc5gy6",
   "message": "[removed]",
   "created_utc": 1701931691,
   "score": 173,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcccd4t",
   "message": "When people age, they start to realize that Squidward just wanted to live a quiet life, go home and play the clarinet in Bikini Bottom.",
   "created_utc": 1701937029,
   "score": 205,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc8dxq",
   "message": "Mr. Lahey from Trailer Park Boys\n\nDealing with the people in Sunnyvale would be exhausting and in reality they would be seen as the bad guys.",
   "created_utc": 1701933856,
   "score": 59,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccetcd",
   "message": "Captain Hook both from Disney's Peter Pan and Hook: he's not necessarily right but, Peter Pan isn't exactly a saint, either.",
   "created_utc": 1701939118,
   "score": 19,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc0qog",
   "message": "The shark from Jaws was just being a shark",
   "created_utc": 1701928412,
   "score": 107,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccdfbu",
   "message": "Mewtwo",
   "created_utc": 1701937915,
   "score": 148,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc49pd",
   "message": "Mr. Freeze. Just wanted to save his wife.",
   "created_utc": 1701930827,
   "score": 212,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcca02n",
   "message": "Malware from Ben 10: Omniverse\n\nI mean dude was honestly right and I felt bad for him. Sure he became an evil maniac later on, but all he wanted at first was affection from his own creator. He was corrupted with a life code that caused him to go insane and become deformed and wanted to be cured of it, but his creator literally did NOTHING to cure him to get rid of his insanity which led him to become a villain and a problem for Ben to deal with. What\u0026amp;#039;s even worse is that his creator only saw him as a failed experiment and not a living being in need of help. It\u0026amp;#039;s like a kid not getting the help and care from their parent.",
   "created_utc": 1701935129,
   "score": 66,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccetpk",
   "message": "Gorr, the gods slayer from Thor Love and Thunder.  He was right.  The gods were selfish jerks pleasing themselves and for the most part ignoring the needs of their followers.",
   "created_utc": 1701939126,
   "score": 196,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc7cs8",
   "message": "The older I get the more I relate more to Principal Vernon in The Breakfast Club. Most of those kids, especially Bender, were disrespectful jerks.",
   "created_utc": 1701933081,
   "score": 21,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcbui4m",
   "message": "Medusa",
   "created_utc": 1701924675,
   "score": 140,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccdklz",
   "message": "The wicked witch of the west. Dorothy inadvertently killed her sister, and then stole her shoes. The witch had every right to hate her.",
   "created_utc": 1701938042,
   "score": 67,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccynr4",
   "message": "Wreck it Ralph. Why didn't Felix just build him his own home? They forced him to live in a dump and sleep on a pile of bricks. At the end of the movie, Felix builds multiple homes for other video game characters in the blink of an eye. You're telling me Felix is the hero, but never once thought to ask Ralph if he wanted something other than a pile of bricks to sleep on?",
   "created_utc": 1701953871,
   "score": 53,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc682s",
   "message": "Ultron.\n\nDude was connected to the internet for half a second and said \"Yeah, I'm killing them all.\"",
   "created_utc": 1701932242,
   "score": 230,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcbz1mg",
   "message": "Tai Lung *\"You knew that I was the Dragon Warrior! You always knew\"* \n\nhttps://youtu.be/U3lFtv2SIl0?si=BtxbCyk9F1oksyVr",
   "created_utc": 1701927340,
   "score": 184,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccdy61",
   "message": "Tom. From Tom \u0026amp; Jerry",
   "created_utc": 1701938362,
   "score": 158,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccvkzj",
   "message": "The Kramps were grown adults that decided not to participate in a religious holiday they didn't believe in and were ostracized, bullied and turned on by their community for it.\n\nThey even donated money to charity as always.  What annoys me the most if how their community immediately flipped back to friendly the second they gave into their peer pressure.  What kind of cult mentality is this shit.  I'm currently reading Jimmy Carter's biography and this is verbatim how segregationists treated anyone that didn't vocally join and help their efforts.",
   "created_utc": 1701952099,
   "score": 57,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc5ir6",
   "message": "General Hummel from The Rock",
   "created_utc": 1701931727,
   "score": 136,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcbrsp7",
   "message": "The Grinch.",
   "created_utc": 1701923204,
   "score": 19,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccfjvb",
   "message": "The traitor from the Matrix. \"If it looks like steak, smells like steak and tastes like steak then that's good enough for me.\". Given the choice of fake 1990s or real post-apocalypse wasteland I'll take the 90s thanks.",
   "created_utc": 1701939763,
   "score": 194,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc4518",
   "message": "The exterminator guy from The Ant Bully, dude was just trying to do his job to stop an insect infestation and yet gets attacked by an army of wasps and ants.",
   "created_utc": 1701930737,
   "score": 185,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcbpl2r",
   "message": "Magneto",
   "created_utc": 1701922042,
   "score": 0,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcck3yy",
   "message": "Zemo from Captain America: Civil War. His family and thousands(?) of others were killed in Sokovia. Ultron wasn’t some random alien villain who showed up hellbent on destruction or whatever, he was created by Tony Stark and consequently he is solely responsible for the deaths of the Sokovian citizens.\n\nZemo shouldn’t have killed Black Panthers dad though :((",
   "created_utc": 1701943703,
   "score": 93,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccgncr",
   "message": "Wile E Coyote.... Roadrunner was a right cunt.",
   "created_utc": 1701940727,
   "score": 33,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcd66th",
   "message": "Pierce Brosnans character in Ms. Doubtfire.\n\nHe was a pretty nice dude and really cared for the new family.",
   "created_utc": 1701957684,
   "score": 96,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccalvq",
   "message": "Carrie.",
   "created_utc": 1701935610,
   "score": 47,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcd9dgf",
   "message": "The psychiatrist on What About Bob. He just wanted to be on a nice, summer vacation with his family…AND HE HAD EVEY RIGHT TO BUY THAT HOUSE!!!",
   "created_utc": 1701959144,
   "score": 40,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcbty40",
   "message": "Most of the ones that challenge the status quo and are totally correct, but also are the bad guys because they're super violent about getting their message across.",
   "created_utc": 1701924364,
   "score": 68,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc8ilc",
   "message": "Powerpuff Girls - Sedusa\n\nIn the episode *Mommy Fearest*, Sedusa weasels her way into Professor's good graces and moves in, becoming the girls' stepmother.\n\nShe saddles the girls with home chores and forbids them to use their powers. She also grounds them, forbidding them to leave the house at night, despite Townsville being \"under attack.\"\n\nMayor keeps calling the girls, but they tell him they can't leave the house.\n\nIn all this, of course Sedusa has ulterior motives, but she's still RIGHT!!\n\nWHY TF does Townsville's Mayor feel he can call all hours of the night and demand three KINDERGARTEN CHILDREN come defend his city? These girls need to sleep so they can take their butts to school in the morning! He's calling at 3A like a needy, drunk-ass boyfriend.\n\nTownsville has cops, by the by. Put their fat, dopey asses to work!\n\nThe entire episode is a tug-of-war between Sedusa keeping the girls home and the Mayor needing them to solve a burglary. It wasn't even Mojo! Just a wee bit of grand larceny at Mayor's mansion - his...jewels. ADT and a Rottweiler could've handled that, but no, let's drag three five-year-olds outta bed.\n\nSedusa is made out to be evil here. When she's defeated, everyone claps and the girls go back to protecting the city at all hours of the day and night—unpaid, mind you, but happy to be of service!\n\nWhat a way to say: Fuck dem kids! Child labor laws? Who needs 'em? If Sedusa wasn't such a greedy, gold-diggin' hoe, she could've been an awesome, protecting mom.",
   "created_utc": 1701933956,
   "score": 175,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccjbzh",
   "message": "Terry Benedict in the Ocean’s Trilogy. He never actually becomes a villainous character. The titular Eleven steal a crapton of money from him, and the worst thing he does in retaliation is “blows up a car”. Then they seek him out in Ocean’s Thirteen, ask him for help, he helps them… abd they steal ANOTHER 70+ million from him, for no reason!",
   "created_utc": 1701943037,
   "score": 210,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcbyksf",
   "message": "Look, I love Wrex and I want to help, but mass producing Krogan *will* be a problem.  Just saying.",
   "created_utc": 1701927055,
   "score": 64,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc2fpr",
   "message": "Captain Nemo from 20,000 leagues Under the Sea. The man was definitely ahead of his time...",
   "created_utc": 1701929552,
   "score": 16,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccc5ax",
   "message": "The principal from ferris bulers day off. He thought Ferris was up to no good and he was correct lol\n\nEdit: guys I said he was right not that he was a food guy lol",
   "created_utc": 1701936850,
   "score": 219,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccad8h",
   "message": "Dr doofensmirch",
   "created_utc": 1701935420,
   "score": 238,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcd1v0j",
   "message": "Barbosa in Pirates of the Caribbean. My man just wanted to get his life back together, maybe eat an apple, maybe get a hook up. He's treated like a villain for being a...pirate?",
   "created_utc": 1701955566,
   "score": 244,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc30jm",
   "message": "Ras Al Ghul is my favourite villain \n\nI think it works because I agree with his goal (Save the world from environmental disaster) but not his method (Kill a third or more of the worlds population)\n\nThe movie version where it’s to end crime is similar too\n\nWhat I can’t properly enunciate is why the movie version of Thanos doesn’t appeal to me despite being similar\n\nMaybe because with his resources there were easier more available ends to his goal?\n\nBut then the same could kind of be said of Ras?\n\nThe comic version of Thanos where he kills because he’s trying to court Death makes more sense to me but that’s more or less gone these days",
   "created_utc": 1701929948,
   "score": 108,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc80qn",
   "message": "Megamind",
   "created_utc": 1701933581,
   "score": 18,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcbud4m",
   "message": "Gerald Butler's character in Law Abiding Citizen.",
   "created_utc": 1701924598,
   "score": 62,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc8o3y",
   "message": "Poison Ivy (when written coherently) is totally right. Corporations are a blight upon humanity and earth itself, and our species is absolute dog shit as sustainable living. We don’t behave like a ~~natural~~ balanced part of our environment, we behave like a parasite, and until we learn to stop she’s totally right to feel that a blend of sabotaging industrial complexes and culling their executive staffs are the only succesful means of curtailing the damage were continuously doing.\n\n**EDIT:** Edited for clarity. When I said natural what I meant was naturally balanced. \n\nPrey populations are controlled by predators, predator populations are controlled by accessibility to prey and presence of other predators.  We’ve reached a point where there’s no natural checks and balances for us, at least not until we consume all our resources.",
   "created_utc": 1701934078,
   "score": 45,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kcc56e2",
   "message": "Soup Nazi",
   "created_utc": 1701931481,
   "score": 199,
   "submission_id": "18cmxqp"
  },
  {
   "comment_id": "kccb9pq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18cmxqp"
  }
 ]
}