{
 "submission_id": "18deqwu",
 "title": "What is a little bombshell your therapist dropped in one of your sessions that completely changed your outlook?",
 "selftext": "",
 "created_utc": 1702010058,
 "permalink": "/r/AskReddit/comments/18deqwu/what_is_a_little_bombshell_your_therapist_dropped/",
 "score": 32,
 "url": "https://www.reddit.com/r/AskReddit/comments/18deqwu/what_is_a_little_bombshell_your_therapist_dropped/",
 "comments": [
  {
   "comment_id": "kcgzw4n",
   "message": "\"stop trying to get everyone to agree - when you need everyone to agree the least agreeable person has all the power\"\n\nReally changed my outlook on planning family events.",
   "created_utc": 1702017818,
   "score": 242,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch0y3n",
   "message": "“How was anger expressed in your household growing up? Were you allowed to show anger?” At which point I realized I wasn’t allowed to show any negative emotions whatsoever, especially not in reaction to negative emotions from my parents.",
   "created_utc": 1702018561,
   "score": 177,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgwqud",
   "message": "“I don’t want to take meds because I don’t want to rely on drugs to feel ok.”   \n“Don’t you already do that?”\n\nMy therapist in the session before I finally saw a psychiatrist and got officially diagnosed with bipolar 2. I was heavily self medicating at the time but of course didn’t see it that way because it wasn’t a prescription.",
   "created_utc": 1702015671,
   "score": 223,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch3hk0",
   "message": "\"Your mom is never going to be the parent you want or need, so stop expecting her to be and being mad that she isn't.\"\n\nAlso:\n\n\"People who are addicts tend to get frozen at the time they started abusing drugs or alcohol, because their focus is their addiction and not developing as a person. So a person who started drinking heavily at 13 and quit at 30 would behave a lot like a 13-year old.\"",
   "created_utc": 1702020443,
   "score": 187,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2de9",
   "message": "“Don’t think of the relationship as over. Think of it as complete.” \n\nFundamentally changed how I was processing a tough breakup. So helpful.",
   "created_utc": 1702019605,
   "score": 103,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgztfh",
   "message": "My counselor said to imagine myself as an orange. Then, consider that not all people like oranges. That doesn't mean that the orange is flawed in any way, not rotten, just that everyone has preferences. That helped ease my insecurities and need for people pleasing dramatically.",
   "created_utc": 1702017765,
   "score": 107,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2hth",
   "message": "We judge ourselves by our intentions, and everyone else by their actions.",
   "created_utc": 1702019695,
   "score": 235,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgzq8q",
   "message": "Emotions are not bad, even the unpleasant ones. They all have an appropriate place.",
   "created_utc": 1702017702,
   "score": 202,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgyoc6",
   "message": "“Your mother was an absentee mother, so why would you think she would be anything other than an absentee grandmother to your child?”\n\nIt made me lower expectations of the type of relationship my child would have with my mom. So now she’s the fun grandma on FaceTime that sends presents but never shows up, and I’m perfectly okay with that.",
   "created_utc": 1702016972,
   "score": 62,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch3maa",
   "message": "\"You are not special\"\n\nI was having some very strong anxiety at the time, specially in regards to other people,  I felt like I was judged everywhere, like, I couldn't go to the store, take the bus or even go to a walk because I felt people were judging my every move, how I dressed, how was my hair, how I talked, even how I walked. \n\nEvery stranger was thinking bad of me. It was scary as hell.\n\nI was telling her about this, and how I started avoiding going out, which was a problem because I had to go to college soon. And she looked me straight in the eyes and told me \"(name), I'm telling you this with all the care of the world, but you are not special, there is nothing that would make me think twice if we crossed in the street\"\n\nIs harsh, and is exactly what I needed, all the anxiety didn’t let me see that until she said it, ofc she helped me some other ways but this really really changed my life when she said it, I could go to college and be out because of it.",
   "created_utc": 1702020543,
   "score": 219,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgy2ik",
   "message": "At the time I was into getting tarot card readings and seeing psychics. My therapist told me he has psychic clients who come to him ashamed about the excessive amount of lying they do every day. Haven’t been to a psychic or tarot card reader since.",
   "created_utc": 1702016550,
   "score": 73,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgymqg",
   "message": "**“Is it your anxiety, or hers?”** 🎤 drop!\n\nBackground: I have an overbearing mother who needs to know as much as she can about what I’m doing on my own time to sleep well at night (according to her). She basically treats me like a rebellious kid in a teen movie from the 90s, when I’m an independent, grown ass woman approaching my mid-30s. \n\nAt the time my therapist said this, I was 28ish and panicking about an upcoming business trip. Not the trip itself, but her reaction to me leaving the state for a few days. As I was going down the list of texts I knew she’d bombard me with, my therapist dropped this 💎 .\n\nShe gave me permission to opt-out of managing her fears like I had been doing for years. \n\nEnd result: I went on the trip without telling her a thing and have established a few more sanity-preserving boundaries since : )",
   "created_utc": 1702016940,
   "score": 82,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgq5c1",
   "message": "\"they literally do not give a shit about you, so why do you care about them\".\n\n\nLetting me know it was time to move forward from some hurt that I held onto for a long time. And understand vindication and atonement doesn't always come.",
   "created_utc": 1702011680,
   "score": 66,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch0ffn",
   "message": "“There’s nothing wrong with you, you are just picking the wrong people to be friends  with” I got some new friends and my life changed pretty dramatically after that.",
   "created_utc": 1702018195,
   "score": 148,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch1cda",
   "message": "First session, going over history, talking about how sad I am and how it affects my marriage and after describing our relationship the counselor said \"wow, you're really going through a lot of mental and emotional abuse.\"\n\nw a t ???\n\nHonestly I didn't know it was a thing. She was right. It took me a few years but I was able to get out.",
   "created_utc": 1702018846,
   "score": 12,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2yt9",
   "message": "It was so simple, yet something I hadn't heard before.\n\n\"You didn't deserve that.\"",
   "created_utc": 1702020050,
   "score": 160,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch14lw",
   "message": "Also, “Your partner should enhance what you like most about yourself”.\n\nIt made dating so much easier! No need to settle for less than that.",
   "created_utc": 1702018691,
   "score": 168,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2jqh",
   "message": "You are not responsible for your parents' emotional wellbeing. They are independent adults who have been on this earth for many more years than you.",
   "created_utc": 1702019734,
   "score": 31,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch0p36",
   "message": "“Will worrying about it change the outcome? If the answer is yes, go ahead and worry about it.” I suddenly realized that I couldn’t think of a situation where the answer to that question was ever yes. Really short circuited the worry cycle for me.",
   "created_utc": 1702018384,
   "score": 8,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4btn",
   "message": "When you use the words “I should…”, you’re silently finishing the sentence with “…in order to be worthy of love and respect.”\n\n“Should” is a much smaller part of my vocabulary now.",
   "created_utc": 1702021085,
   "score": 122,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch46lo",
   "message": "“Why do you make people more comfortable when you are uncomfortable”\n\nWhen talking about people pleasing and fawning",
   "created_utc": 1702020975,
   "score": 113,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4mrl",
   "message": "My therapist traced me on a big piece of paper, so I could see how big/small I was. I thought him and I were about the same size. I got him to lay on top of the paper, and “I” disappeared. \nSeeing my size that way made my brain begin to think differently. It helped me realize I was not fat. At 5’2 and 110 pds…I needed to realize that! Years of bullying fucks with ones brain!",
   "created_utc": 1702021323,
   "score": 115,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2641",
   "message": "I used to say a lot of things I wanted to do and then follow up with \"but it's hard.\" My therapist asked me one time how it would feel to say what I wanted to do and then say, \"And it's hard.\" I can't believe I hadn't considered that myself in four decades, but man, did it change my mindset on certain things.",
   "created_utc": 1702019453,
   "score": 219,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgwolq",
   "message": "“Anxiety lives really well in the past and in the future. But has no place in the present. Bring yourself back to the present.”",
   "created_utc": 1702015630,
   "score": 217,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgy3j4",
   "message": "Mine was about my relationship with my mother. He kept asking questions until I remember saying \"well I just stopped telling her anything\" about trusting her. My shoulders were instantly lighter.",
   "created_utc": 1702016570,
   "score": 89,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch10y4",
   "message": "I wanted to reach out to my ex. My therapist said, “you’re feeling a loss of security because your family is moving away from your city. Don’t reach out!” Soooooo insightful, I didn’t reach out and I’m better for it",
   "created_utc": 1702018617,
   "score": 152,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch25o5",
   "message": "That I’m emotionally closed off to almost everyone in my life with the exception of my children and sister. But, why wouldn’t I be, considering how I was raised. How ever, what used to be protective has become maladaptive. Blew my mind and opened new doors.",
   "created_utc": 1702019445,
   "score": 77,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2p12",
   "message": "“You may just be graduating highschool and you’re going to be a legal ‘adult’, but you’re just a kid. It’s not your responsibility to take care of everyone. It was never your responsibility. Because at the end of the day, you were just a kid wondering why you had to be the marriage councillor and shielding your brother from everything.” \n\nI didn’t know how much I needed to be reminded how I was a kid until that moment. It made sense though on why I often feel like time went by too fast and i didn’t get to enjoy being a teen in highschool, because I was too busy being an adult when it was never my responsibility.",
   "created_utc": 1702019844,
   "score": 78,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch0cci",
   "message": "Anger is the brain reacting to fear. If you’re feeling anger, take a quick pause to ask what you’re afraid of.",
   "created_utc": 1702018135,
   "score": 126,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgnu41",
   "message": "That the feeling I have 24/7 is anxiety, Not Spidey sense 😕",
   "created_utc": 1702010440,
   "score": 105,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch3geg",
   "message": "That my wants and needs were just as important as everyone else’s.",
   "created_utc": 1702020419,
   "score": 53,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgpb96",
   "message": "Once in college, I was talking about a friend of mine, and the therapist asked me if I thought he would live to adulthood. It completely took me aback. ^^^He ^^^did ^^^not.",
   "created_utc": 1702011225,
   "score": 141,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch0wjv",
   "message": "He helped me understand grief in others better. That it was my own anxiety that made me want to fix and improve things for them. Instead I should just follow them on that ride and listen.",
   "created_utc": 1702018530,
   "score": 100,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch38lz",
   "message": "That being selfish is ok, but being self centered isn't. Being selfish is recognizing your needs and taking care of yourself, but being self centered is ignoring everyone else.\n\nOh another one that a commenter reminded me about. Moat men only know two emotions happy and angry because we're told that's all we can feel.  That sometimes your body and mind are reacting with anger, but that's not what you're feeling. In those moments you need to take a break and ask what emotion you're feeling. I still struggle with this one.",
   "created_utc": 1702020256,
   "score": 133,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2iio",
   "message": "“Wow your mother was/is really a terrible person”\nMy younger siblings have come to this conclusion a loooong time ago without therapy but for some reason with me being the oldest, I can’t hate her although I have valid reasons to. She neglected my sister and I and basically forced me to raise 2 small children starting at age 8 because she wasn’t physically or emotionally available to do so. She is now a full blown narcissist alcoholic and I look back and see how she was emotionally manipulative and abusive so my therapist is right in her conclusion. I just never could see her that way because she was my mom at the end of the day.",
   "created_utc": 1702019709,
   "score": 46,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgneqr",
   "message": "I'll go first. My therapist suggested being an outsider in my family was a good thing... Because they're all narcissists... So I'm NORMAL. \nSo why do I care what they think if they're so broken?!",
   "created_utc": 1702010220,
   "score": 223,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch43o7",
   "message": "You can’t have true emotional vulnerability with others until you can learn to have emotional vulnerability with yourself. \n\nI’m having some issues connecting with people in my life, but really it’s because I deny and shove down my own emotions so effectively that I don’t even know myself.",
   "created_utc": 1702020914,
   "score": 39,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2bk0",
   "message": "It’s okay to not be okay all the time. Sometimes you will have a bad day and that’s okay. Tomorrow can still be a good day even if today sucks",
   "created_utc": 1702019565,
   "score": 58,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4ldh",
   "message": "That my job/career is just a way to make money, it's not my life or identity. Took a lot of pressure off me.",
   "created_utc": 1702021292,
   "score": 30,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4ns3",
   "message": "“You can’t control your emotions, but you can control what you do with them.” \n\nAt the time, I was a young adult who had learned 0 healthy emotional regulation skills (only suppression and shaming) growing up, so this blew my mind.",
   "created_utc": 1702021345,
   "score": 28,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch5317",
   "message": "That negative self talk is just a part of you trying to help that needs some translation first. \n\nLike if I'm sitting there watching my 5th hour of tv and I keep hearing thoughts in my head about how I'm such a lazy piece of shit, then I need to translate that into the intention which is that it is probably a good idea to stop and do something else now. Now I can think about the negative self talk as being on the same team and wanting the best for me. Whereas before I spent a lot of time first trying to ignore negative intrusive thoughts, then tried radical acceptance, then tried mindfulness techniques to quiet them, but nothing really worked and I continued to find them distressing. But now I can just stop and think, what is this negative thought really about and what is it really trying to tell me? So I end up reflecting more than average and once I 'translate' the thought I understand it and find it less troubling.",
   "created_utc": 1702021675,
   "score": 24,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch58vy",
   "message": "\"You don't feel your feelings, you intellectualize them.\"\n\nI now try to feel stuff in real time which makes me much lighter.",
   "created_utc": 1702021800,
   "score": 25,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgv14s",
   "message": "That I had PTSD from how shitty my stepfather treated me.",
   "created_utc": 1702014576,
   "score": 49,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4va9",
   "message": "“You have the most profound history of trauma I’ve worked with in my entire career.”\n\nmy lifelong feelings of self doubt, being dramatic or overreacting or misremembering and downplaying abuse just melted. My brain attempted to comprehend the severity of my ptsd for the first time rather than just making another joke about it. I was called out on a level of denial that was so deeply a part of me I didn’t know who I was without it.",
   "created_utc": 1702021508,
   "score": 52,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch395t",
   "message": "Crying is not a sign of weakness and it’s alright to let people help you.",
   "created_utc": 1702020267,
   "score": 47,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch42qw",
   "message": "“If you had achieved all the things you wish you had, you would be dead by now.” \n\nIt made me cold stop and really think about my own limitations vs the unreasonable expectations upon me. \n\nMost people in my family have Masters or double bachelors degrees. \n\nIt also validated and made me appreciate all the things that I had pushed through to. At this point I was heavily suicidal, but after that and several months to process. I’m completely off antidepressants and don’t need them anymore.",
   "created_utc": 1702020894,
   "score": 23,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch45wc",
   "message": "“You don’t have to care what others say about you or other peoples opinions”. This stopped me reacting to everything little thing that annoyed me",
   "created_utc": 1702020960,
   "score": 24,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4jxg",
   "message": "After a 3-year battle with Alzheimer’s, and having weird meth smoker move into her garage to “help” her, and my disabled sister, while I was in and out of hospitals with my 4yo daughter having multiple brain surgeries, burying my mom, closing her estate while having to then move my 3kids and 2cats to another city and sell my old home, and buy a new home, and I though jesus fucking Christ will this absolute madness ever end… and I was so stressed, trauma-brain, so sad at how my mom was being abused by my sister and the meth AH, and I was barely holding on to my sanity…. \n\nI sat w my therapist telling her all this crazy bullshit sandwich I had to eat while trying to be fully there for my daughter, and how I lived 50 miles away from my mom but visited weekly to make sure she was ok, I said I’m so filled with so much bitterness I can’t even leave my house, I feel Stuck in this place, it was a whole year in my new town, my new house, and I was stuck in the past.  \n\nShe said, bitterness is sadness plus anger.  Break those down, and it’s easier to forgive yourself for all that you’re angry about, and allow yourself to grieve.  \n\nThat helped me So much, and EMDR therapy.",
   "created_utc": 1702021262,
   "score": 23,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4xwp",
   "message": "You're a perfectionist, and no one is perfect. It's unreasonable for you and others to expect perfect from you.\n\nCompletely disagreed in session and spent the remaining time arguing how I literally didn't care about things. That I basically lived a don't try, can't fail attitude. \n\nBus journey home, a bit of reflection, mind blown!",
   "created_utc": 1702021565,
   "score": 19,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch51yo",
   "message": "I was at a high-stress time and I asked her how people live like this. She replied “often times they have cardiac events.” She said it as an urging to care for myself as much as possible.",
   "created_utc": 1702021653,
   "score": 24,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4utz",
   "message": "‘You can’t expect everyone to get it when you have been doing it for 25 years and they have been doing it for a month. Expect less from them’\n\nIt’s so obvious but for me I just could not see it",
   "created_utc": 1702021498,
   "score": 19,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcguw5k",
   "message": "It's not my fault",
   "created_utc": 1702014491,
   "score": 82,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch3j0q",
   "message": "“It is tough to deal with [my situation], isn’t it?”.\n\nMade me acknowledge that PTSD was a challenge and to move forward with addressing it rather than ignoring it and self medicating.",
   "created_utc": 1702020474,
   "score": 17,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch570j",
   "message": "I was having nonstop panic attacks and derealization that lasted a month. It was like my brain was stuck in panic mode. \n\nI decided to find a therapist. In our first session she said “You know you don’t HAVE to suffer, right?” Meaning I should schedule an appointment with a psychiatrist and get on medication. I scheduled one ASAP and it truly saved my life. I don’t know what I had been waiting for or delaying.",
   "created_utc": 1702021761,
   "score": 17,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch61m8",
   "message": "“If you don’t have these problems with any other person in your life, why do you think you’re the problematic person in this one?”",
   "created_utc": 1702022417,
   "score": 16,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch6irs",
   "message": "When they mentioned that they felt I was a clear example of CPTSD. I instantly felt ashamed, because \"that's what people get after going to war! No way I could have that.\"\n\n\"You experienced battles everyday of your life, and you have seen extreme violence on the regular. It may not be a country wide war, but you experienced your own wars\"\n\nI was like, well... got damn.\n\nIt keeps me going, knowing I don't deal with those wars anymore.",
   "created_utc": 1702022791,
   "score": 18,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch7p03",
   "message": "That just because I didn't kick or punch or scream or come away bruised and battered, doesn't mean it wasn't rape.",
   "created_utc": 1702023731,
   "score": 18,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgzrdn",
   "message": "My long Covid caused so much trauma that it revealed an autism diagnosis which led to more diagnosiso for these conditions I have definitely had my entire life but was highly masking and had no idea I was different or that other kids felt or operated differently. This person’s been hiding in plain sight for over 30 years.",
   "created_utc": 1702017724,
   "score": 85,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch54qo",
   "message": "Am I the only one Lurking in the comments for free therapy ?? 💀",
   "created_utc": 1702021712,
   "score": 48,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4jso",
   "message": "\"Wow.\"\n\nI was talking about my mother's behaviour through my life and my upbringing in general. I often use it as a joke that I made my therapist say this. However she followed it up by telling me that, considering all that had happened and the stuff I had been through, I was doing really well in life. I shouldn't be so hard on myself and needed to focus more on my positive achievements rather than letting my remaining flaws hold my focus. It's a moment I keep coming back to.\n\nIt was also very cathartic to have a professional pretty much agree that my past life was nuts.",
   "created_utc": 1702021259,
   "score": 15,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch7yw0",
   "message": "I don't work as a therapist. I'm an ESL (English as a Second Language) teacher in Japan. But my classes are one-on-one, so I do spend a lot of time on consultation and personal conversations. Something I said to a client once seemed to really change his outlook.\n\nA lot of my company's clients are focused on learning English for international business, and this man, as many of them are, was concerned about making mistakes and looking like a fool. I asked him if the English-speakers he works with sometimes try to speak Japanese, and he said that they do. I asked him if they ever make mistakes, and he said that they do. I asked him to name one, and he couldn't. And I told him that his mistakes will be forgotten, too.",
   "created_utc": 1702023956,
   "score": 15,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch6z1c",
   "message": "I've never really had friends. I've had colleagues and classmates and housemates and people who have hung out with me, but I never really felt close to any of them. And I did that thing you see on here sometimes - I stopped reaching out to see if I would be reached out to, and I wasn't, which I took as confirmation that they didn't really want me around, or at the very least, that they wouldn't mind my absence. \n\nI was talking to my therapist about people I'd been close to in college, and she told me to pick one and talk about him. So I did. And after I shared some basic stuff like his name and his major etc., and a couple anecdotes, she asked me what else I knew about him. And I couldn't answer. It wasn't really a broadly-applicable bombshell, but she said \"what else\" and I started crying because I realized that for as simple as the question was, my inability to answer spoke volumes.\n\nI've never had good friends because I've never been a good friend. I'm withdrawn and reserved and I always made others do the work to drag me out, without ever extending my own friendship in a meaningful way in return. If I wanted to have meaningful relationships with other people, I would have to build them.\n\nI'm still working on this, but I'm trying to make more offers and extend more friendliness to others in my daily life.",
   "created_utc": 1702023151,
   "score": 14,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch559d",
   "message": "Were you ever allowed to feel your feelings? \n\nNope. Turns out my mom is a master gaslighter. \n\n“Mom I’m sad” \n\n“NO YOU’RE NOT YOU’RE JUST TIRED”\n\n“Mom this makes me really happy!”\n\n“NO IT DOESN’T. YOU ARE JUST OVERSTIMULATED”\n\n“Mom I feel bad when you treat me like this”\n\n“NO YOU DONT YOU JUST HAVE BEEN MANIPULATED BY YOUR FRIENDS TO REBEL”\n\nI was never allowed to express/understand/feel my feelings without my mom telling me “what I really felt” and why. \n\nAs an adult I had to understand-learn all her programming and re-learn how to identify my feelings after my psychiatrist pointed out my lack of understanding.",
   "created_utc": 1702021723,
   "score": 30,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4iri",
   "message": "That maybe, I am not the only one in my family who is dealing with mental illness. They might be dealing with it too…\n\nThe whole time I felt I was the odd one out… the only one who had problems like that and that had to take meds…",
   "created_utc": 1702021237,
   "score": 12,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch6i2x",
   "message": "“Just because the stress you’re feeling isn’t as bad as the stress you had in childhood doesn’t mean it’s not stress”\n\nI was/am seeing a therapist to talk about how I have depression despite not facing any major challenges and “not being stressed about anything.” I couldn’t figure out why I never had the energy to get out of bed. Turns out it’s because I was unable to identify and process stress.",
   "created_utc": 1702022777,
   "score": 13,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch22tc",
   "message": "That there was nothing wrong with me and I didn't need fixing. Turns out being asexual is a perfectly legit choice. Considering I have supported and voted in favour of LGBTQ laws for protecting their rights my whole life, I was still surprised that I was actually part of that cohort. \nTook 32 years and a year of therapy for it to occur to me.",
   "created_utc": 1702019384,
   "score": 41,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch31vl",
   "message": "Dealing with imposter syndrome and general anxiety - life coach rather than therapist “Where is the evidence?”\n\nI’ve started asking myself this every now and again when the self doubt creeps in and it’s really helped!",
   "created_utc": 1702020112,
   "score": 34,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch64kh",
   "message": "I don’t have anything to add besides- this is an excellent topic and thank you all for sharing. I gained a little bit of secondhand wisdom from y’all and I needed it today.",
   "created_utc": 1702022482,
   "score": 11,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch3ov3",
   "message": "How my dad did his best against adversity (I used to be angry at him for not doing certain things, but I really didn’t take the time to see it from his perspective.",
   "created_utc": 1702020598,
   "score": 23,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgz80a",
   "message": "When I started to realize I was transgender, I was really afraid of taking hormones. A lot of people had tried to scare me into not medically transitioning, claiming it was \"dangerous\" or would \"ruin my body.\" My therapist asked me to make a pros and cons list about taking hormones, and also do the pros and cons of not taking hormones \"because not medically transitioning is also a choice that will affect you.\" It helped me realize that all the things I was afraid of were fear mongering and not actual side effects. I started HRT a few months later and it literally saved my life.",
   "created_utc": 1702017349,
   "score": 147,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch5hlv",
   "message": "\"Your urge to self harm is perhaps a desire to tell those around you something that you don't know how to articulate.\"",
   "created_utc": 1702021984,
   "score": 11,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch60h3",
   "message": "I told my therapist I didn't feel like I could talk to him, anymore, and he spent 45 minutes berating me. He mocked me twice.",
   "created_utc": 1702022392,
   "score": 10,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch6dki",
   "message": "After I beat up my middle school bully, my therapist congratulated me for standing up for myself. I thought she would chastise me like every other adult in my life, but she was encouraging. Obviously, she told me that violence like that wasn't the best way to handle it, but that making a stand was important either way. No one had ever told me that it was okay. I always got a lecture about not acknowledging bullies and telling the teacher instead, but we all know that never works. Having an adult validate me, even if I wasn't entirely right, was a huge boost.",
   "created_utc": 1702022678,
   "score": 12,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch7z1g",
   "message": "“You always talk about not wanting to do to your daughters what your mom did to you. You worry about it so much in every interaction you have ever had with them. But your children are 19 and 21 now. They are happy and healthy and they trust you because you’ve never abused them in any way. So I just want to validate for you that you really have broken that cycle of violence. You did that. And you should be proud of it. I’m proud of you for it.”",
   "created_utc": 1702023960,
   "score": 11,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch3lx3",
   "message": "Your mind already knows the answer. It’s your heart that needs to be convinced.",
   "created_utc": 1702020536,
   "score": 36,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kcgxdz7",
   "message": "Couple therapy \nI can’t do anything else for you \n\nGood luck",
   "created_utc": 1702016092,
   "score": 22,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4f0n",
   "message": "This post makes me envy of people with good therapists",
   "created_utc": 1702021155,
   "score": 23,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch5shw",
   "message": "“He was a good dad but a bad husband, but he wasn’t *your* husband. It wasn’t your job to fix that marriage”\n\nParents hated each other. Broke up. Always besties with my dad but was mostly raised by mum due to financial difficulties (love mum too, so was pulled between em). Spent my entire childhood hearing how shit he was, when to me he was always open and loving with my issues without judgement. \n\nMy counsellor said this to me and it changed my whole world view. It wasn’t, and never will be, my job to have fixed that shit show of a marriage. He was a good dad and that’s all that mattered.",
   "created_utc": 1702022219,
   "score": 17,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch2zwy",
   "message": "That my Mum (whom I idolised my entire life) also wasn't the saint that I always thought she was.",
   "created_utc": 1702020072,
   "score": 10,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4pki",
   "message": "No one owes you belonging, you have to create it for yourself.",
   "created_utc": 1702021384,
   "score": 9,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch6jn6",
   "message": "\"Is it really your shame to carry?\" \n\nI take on others feelings too much, being a people pleaser, so that is a question I still ask myself sometimes when I feel shame.",
   "created_utc": 1702022810,
   "score": 10,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch5719",
   "message": "Therapist calmly asked me, “do you trust yourself?”",
   "created_utc": 1702021761,
   "score": 6,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch5wd4",
   "message": "\"Umm okay I just asked you a pretty easy question and you went on a tangent trying to find your way to the answer. Next time let's try to focus on just answering directly so I can follow up.\"\n\nChanged my outlook on her role as my therapist. That was the last time I talked to her.",
   "created_utc": 1702022303,
   "score": 7,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch7j6h",
   "message": "I was constantly bringing up how I felt like a completely different person after my mom died...like there was a a marked difference between before and after her death. But once, she was asking about my hobbies, I got really into describing all the things I loved to do or at least used to do before I got into a deep depression.\n\nShe was like \"Wow, you seem very passionate\". And I just sat there like, well I mean I can't change what I like to do, they're still fun to do. And its like she knew when to take a step back, cause it was like, wow, I may be super depressed about my mom passing, but I'm still me. I'm still my passions and those don't go away. \n\nIDK, maybe it only makes sense to be, but it really started getting me back on track.",
   "created_utc": 1702023600,
   "score": 7,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch7v3f",
   "message": "This is a thread that I'd like to come back and read every comment again",
   "created_utc": 1702023870,
   "score": 7,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch9fhh",
   "message": "For context I had a major TBI, seizures, strokes, and all around not a fun brain time when I was 28.\n\n\"you have to grieve the loss of yourself\"\n\nMost people wanted me to go back to how I was.  The fucked up truth is that part of my brain is dead.  The person everyone (including myself) knew died.  I needed to grieve the loss of myself.",
   "created_utc": 1702025176,
   "score": 1,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch9wh4",
   "message": "That I can tell someone to fuck off",
   "created_utc": 1702025575,
   "score": 1,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4klo",
   "message": "You are a normal human being",
   "created_utc": 1702021276,
   "score": 6,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch6xq8",
   "message": "\"Why do you think you're lazy?\"      \nThen she listed off all the things she knows I'm doing for my family, my job, and my life.      \n\nIt kind of blew my mind when I struggled to come up with an example.      \n\nShe also described family dysfunction as water. Some families are messed up in a way that everyone can see the huge waves across the surface.      \nOthers are better at hiding it, but there's still a riptide that you can't see unless you're also in the water.     \n\nMade me realize that trying to keep the surface from ever rippling doesn't erase what is happening underneath.",
   "created_utc": 1702023122,
   "score": 6,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch7ecl",
   "message": "He said, “Claim the right to your space in the world.”\n\nMy self-esteem and self-worth was nonexistent. I didn’t believe I deserved the oxygen I was breathing. He was saying that being a person, being born, gives you the right to exist. You don’t have to earn it. You’re here; claim your space.",
   "created_utc": 1702023494,
   "score": 6,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch7iu0",
   "message": "he put down his pencil in the middle of one of my stories and exhaled. he said “that is a lot.” i’d told the same story a few times matter of factly, and never considered how bad it was.",
   "created_utc": 1702023592,
   "score": 6,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch9ya4",
   "message": "\"You did the best you could, using the tools you'd learned\" about me using alcohol as a way to cope after growing up with an alcoholic mother\n\nAnd \"you've always needed a reason to dislike someone, that's why it hurts when someone dislikes you, but not everyone else has a reason\"",
   "created_utc": 1702025619,
   "score": 1,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kch4gt4",
   "message": "My therapist kept talking about her life.  She was married, had three kids and four cats.  She was often seen with cat hair on clothes.  She responded with, \"Cat hair is like glitter for lonely people\"\n\nI switched therapists.",
   "created_utc": 1702021193,
   "score": 18,
   "submission_id": "18deqwu"
  },
  {
   "comment_id": "kchacjn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18deqwu"
  }
 ]
}