{
 "submission_id": "18dh2o4",
 "title": "What is your worst experience with work?",
 "selftext": "",
 "created_utc": 1702018546,
 "permalink": "/r/AskReddit/comments/18dh2o4/what_is_your_worst_experience_with_work/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/18dh2o4/what_is_your_worst_experience_with_work/",
 "comments": [
  {
   "comment_id": "kch14lc",
   "message": "i was working for the House of Ruth battered woman's shelter and had come out of court with my client. When we got to the parking lot her abusive husband came up and put a gun in my face and said if he could not see his kids he didn't want to live anymore and i didn't need to either.",
   "created_utc": 1702018690,
   "score": 8,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kch1z4z",
   "message": "Working for a nationwide used car lot company, doing collections. I had some of the highest numbers in my district of 5+ states (like 20+ locations), was told straight to my face by my boss that I wasn't doing enough and that I was a push over. Constantly having calls directed to me (even from other locations) because they only wanted to talk to me, and had one of my coworkers tell me after I left that my location went to shit cause they weren't meeting collection goals.\nKeep in mind, my location was the only location with only one collector (even though it should have had two). I was handling almost 400 accounts when other collectors only had 100-200.\n\nBefore that job I also was always the one who handled with escalated situations working in food service. It takes a toll on you.",
   "created_utc": 1702019307,
   "score": 3,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kch2on3",
   "message": "Working McDonald's drive thru late at night",
   "created_utc": 1702019836,
   "score": 3,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kch3ij7",
   "message": "Boss threatened me with an umbrella and didn't even apologise when he realised he was wrong.",
   "created_utc": 1702020463,
   "score": 3,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kch5ji5",
   "message": "I worked at a dry cleaners, to make the story short the owner and her sister were ripping people off. They were charging for dry cleaning and then not dry cleaning it at all, I got in trouble for not wanting to do it. This place was expensive, apparently this old fantastic couple use to own it and these sisters got it from them for like nothing. All of the long time customers still went there, if I put dry cleaning in the bin for dry cleaning the owner would scream at me “THIS DOESNT NEED TO BE DRY CLEANED!” I’d say that’s what they want and what they paid for! Didn’t matter, there is more shit that went on but I quit because I refused to screw people over. After I quit the lady who owned it said she was going to sue me for my last paycheck. She tried to say if you quit we get your last paycheck back, I was like bullshit that’s illegal! I also told her if she does I am going to report her for stealing from customers and forcing me on my lunch to do her errands. I never heard from her again but I did leave a review saying they rip people off and reported the company to the BBB. Their review score is pretty low online 😂",
   "created_utc": 1702022026,
   "score": 3,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kch5vgb",
   "message": "Had to wake up for work at 6 am after a 12 am shift due to “special” visitors coming in. I had to work overtime without additional pay the same day…",
   "created_utc": 1702022284,
   "score": 2,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kch89ho",
   "message": "At my old job, I got sexually assaulted by a customer and my boss didn't do jack shit, he simply said \"well it's your word against the customer's\"\nLike BRO\nThe woman who was working with me heard it and actually stood up for me against the guy, and my supervisor let me sit in her office all day and help her out with some of her work.",
   "created_utc": 1702024201,
   "score": 2,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kch96cq",
   "message": "Worked at a grocery store for a year and a half, in the bakery. The first boss was a nice old lady but the baker lady was a jerk to put it lightly. The first boss had a stroke and was forced to retire so Baker lady takes over as manager. Now some days she was actually nice to me but other days she was a pain in the ass! She would verbally abuse me and accuse me of not doing the work I was doing every day! She yelled at me multiple times and I yelled back stuff like \"You didnt sweep the freezer!\" and \"you need to clean the door better!\" like its literally impossible to have a door THAT Clean dipshit! I was about to transfer to another store when I got in an accident and was not able to walk for the longest time. So I stopped working there and I never saw her again. I heard she transferred to another store six months after me. If I ever see her again I am gonna give her a piece of my mind.",
   "created_utc": 1702024961,
   "score": 1,
   "submission_id": "18dh2o4"
  },
  {
   "comment_id": "kchad3e",
   "message": "Being sexually assaulted by a client would probably be it..",
   "created_utc": 1702025968,
   "score": 1,
   "submission_id": "18dh2o4"
  }
 ]
}