{
 "submission_id": "18gmg3z",
 "title": "What cheap/terrible holiday “bonuses” are people starting to receive from work this year?",
 "selftext": "",
 "created_utc": 1702389446,
 "permalink": "/r/AskReddit/comments/18gmg3z/what_cheapterrible_holiday_bonuses_are_people/",
 "score": 164,
 "url": "https://www.reddit.com/r/AskReddit/comments/18gmg3z/what_cheapterrible_holiday_bonuses_are_people/",
 "comments": [
  {
   "comment_id": "kd2h90j",
   "message": "Work in sales (top performing team). Entire team got the same book on how to be a better at sales. We are supposed to read this book on our downtime (whenever that is) and then management wants to go over the book chapter by chapter in our weekly team meetings. \n\nThis “gift” was not well received on the team. There’s been talk about sending management a book on effective leadership or “management for dummies.”",
   "created_utc": 1702405265,
   "score": 77,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2k3bq",
   "message": "We got told we were getting nothing.  And the management excuse was \"Well, not everyone celebrates Christmas, so it wouldn't be fair\"\n\nMy colleague hit the nail on the head \"I've never heard diversity weaponised until I heard that\"",
   "created_utc": 1702406306,
   "score": 66,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2v1a2",
   "message": "I used to work at the Cheesecake factory and one year they gave everyone a cheesecake. From Costco.",
   "created_utc": 1702410322,
   "score": 97,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd24n7k",
   "message": "We get a mandatory work party which will cost each of us 25 dollars",
   "created_utc": 1702400639,
   "score": 157,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd23pcy",
   "message": "Boss sent out a $10 Starbucks gift card the day he laid off 10% of our staff. “It’s not a layoff, it’s a coffee break” is now a banned phrase on teams/slack.",
   "created_utc": 1702400289,
   "score": 1,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1zp9d",
   "message": "We got a digital cake. As in a clip inserted into an email as a thank you. There's a grocery store across the street.",
   "created_utc": 1702398820,
   "score": 209,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd25x0x",
   "message": "I was handed a stack of holiday cards and told to sign all of them.  Once I was done I was told I was the last one to sign so I could choose mine.. really felt the thoughtfulness of 20 people rapidly signing cards.",
   "created_utc": 1702401110,
   "score": 204,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd291dc",
   "message": "I don't work there anymore, but they gave us a cup of hot chocolate at Tesla last year.",
   "created_utc": 1702402249,
   "score": 156,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd25ecy",
   "message": "At a place I used to work, we had quarterly bonuses based on individual performance, but an additional company performance bonus (usually an additional $1k-$5k bonus check) for Christmas. \n\nOne year, we had exploded with growth and our sales had literally doubled from the previous year. My owner was super excited to hand me a fat padded envelope with my bonus in it before he and his wife left for the month to head to Aruba. \n\nI opened it in my car before I headed home, and inside was a Shun Folding Steak Knife. Apparently, it was so I could carry my own steak knife to all the fancy restaurant dinners I was going to be having.",
   "created_utc": 1702400918,
   "score": 89,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2nad6",
   "message": "Nothing. Same as last year. Of course, 200 of us did get notice that our jobs end on 12/31…. Even better-  IT thought it would be good to do a phishing email test that looked like the company gave everyone a $50 Amazon card. To say people were pissed is an understatement",
   "created_utc": 1702407468,
   "score": 114,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd222y3",
   "message": "getting laid off",
   "created_utc": 1702399700,
   "score": 139,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1d8bc",
   "message": "Don't get an official bonus, but might get a tangerine from the boss",
   "created_utc": 1702389684,
   "score": 187,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1xwee",
   "message": "One year work bought everyone a ham.  Didn't matter if you couldn't eat ham.  They were delivered to your desk mid-day.  There was not enough room in our fridge to store them all.  It was weird.  Every year prior to that we got cash.",
   "created_utc": 1702398138,
   "score": 2,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1dtsr",
   "message": "People are getting bonuses?",
   "created_utc": 1702389958,
   "score": 200,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd22q24",
   "message": "I used to work at a retail store that gave everyone who worked on Black Friday a free, uncooked thanksgiving turkey.\n\nYes, they gave us a turkey to cook for thanksgiving the day *after* Thanksgiving.",
   "created_utc": 1702399934,
   "score": 191,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd24qr2",
   "message": "I got a house plant. Correction I got seeds and planter so I can grow my own plant",
   "created_utc": 1702400676,
   "score": 217,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd28yw7",
   "message": "I used to work at a pool supply company right after highschool. One year the CEO kept going on and on about how great of a gift the employees would be getting from him. He wouldn't let up on how awesome it was going to be. \n\nFor context, I had recently gotten my yearly evaluation. My district manager explained that he was not allowed to mark more than one category as 'above average' for any one person and 'excellent' could only be given to one person for one category per district. I was promised a .25$ raise. When I got the paperwork, the .25$ was scratched out with pen and a .19$ was written in its place.\n\nI figured, hey, this guy *will not shut up* about how great this gift is and how we're more profitable than ever. Maybe they tried lightening the yearly raise so we would get two smaller raises that would be \u0026gt;= the original.\n\nWe got one day off. It has to be pre-approved three weeks in advance, it couldn't be between dec. 20th and jan. 10th, it couldnt be on a Friday or weekend, and we would be required to come in if asked. \n\nThe CEO took a vacation for all of December and January.",
   "created_utc": 1702402225,
   "score": 212,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd21x3c",
   "message": "Got one tall boy of bud light. Just watched the ceo leave in a new Porsche while typing this. Had to hold back my feelings of throwing the can at him.",
   "created_utc": 1702399640,
   "score": 107,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2pju0",
   "message": "Years ago, I worked for a company that gave everyone turkeys. Like, big dang turkeys. Mgmt, in their infinite wisdom,  made the mistake of giving them to people at the beginning of the shift and there def. wasnt enough freezer space for them. However, it WAS snowing so ppl just stashed their birds outside in the snow... and some people forgot about them or forgot where they'd stashed the the thing. \n\nFFWD to after the holidays and the snow starts to melt... frikkin turkeys EVERYWHERE. Maybe not \"the best/worst\" but DEFINITELY the most entertaining Xmas bonus EVER. The mental image of all those pathetic turkeys still gives me the giggles, over 20 years later.",
   "created_utc": 1702408303,
   "score": 203,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd27lrd",
   "message": "We get to keep our jobs and not be laid off. Real statement from upper management",
   "created_utc": 1702401727,
   "score": 208,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1kjo5",
   "message": "Office is shutdown from Christmas through New Years (and nobody is expected to work or check email at all, aside from Finance that has a quick payroll to run).  Honestly pretty solid as nobody has to take PTO.\n\nTerrible perks I've received in the past though... I can think of a pizza party that was basically mandatory, while people were attempting to travel right before Christmas.  The company wanted us to socialize at the worst time.",
   "created_utc": 1702392860,
   "score": 223,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2c963",
   "message": "Our office tradition is that each supervisor gives us $20 gift cards. Then the employees group together and buy each supervisor a $100 gift card. It's ridiculous. But this year is special. This year one supervisor has decided they don't want to participate because they \"can't afford it\" after taking their $100 gift card from the staff already.",
   "created_utc": 1702403430,
   "score": 144,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd20jr7",
   "message": "Company's own merchandise we got all year for free. Now we can order them in our internal shop. Very nice by them to let us do advertisement for the company and call it Christmas gifts. Oh, and there are also a lot of layoffs shortly before Christmas. I feel blessed to work here in case my boss reads that.",
   "created_utc": 1702399134,
   "score": 230,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd25rg6",
   "message": "2023: No Appreciation \n2022: No appreciation \n2021: mandatory “drive in a circle around the parking lot and management will toss your gift in your open car window.” Gift was three pieces of candy whose wrappers were entirely in Spanish (we’re close to Canada), two company-branded pens, and our holiday calendar for 2022.\n2020: No Appreciation \n2019 and before: full catered lunch buffet with an entire course of desserts.",
   "created_utc": 1702401055,
   "score": 56,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2p7ie",
   "message": "Family owned company. We give our employees a bonus (money) each year. 16 employees. Everyone is valued and a part of the team. We are successful, and they should share in that.",
   "created_utc": 1702408178,
   "score": 124,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2b5vr",
   "message": "I get paid monthly, (quite common here).\n\n\nAs a 'bonus' we are getting paid on the 15th rather than the 30th.\n\n\nBasically... January payday is 45 days away.",
   "created_utc": 1702403028,
   "score": 246,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2b8e2",
   "message": "Instead of getting 4 weeks of PTO next year, I get 2!",
   "created_utc": 1702403054,
   "score": 114,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd29caj",
   "message": "I got a 3 week layoff and the potential to win a $25 Amazon gift card in a raffle. The period of the layoff makes me ineligible for any company bonus. 2 weeks ago, we had a company wide meeting where the owner said it was the most profitable year they have ever had and there would be no layoffs.",
   "created_utc": 1702402360,
   "score": 219,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd29ehw",
   "message": "I work for a company worth almost $2 billion. We each get a $20 gift card. It used to be $15, so things are looking up!",
   "created_utc": 1702402383,
   "score": 53,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd22tq9",
   "message": "I might be given permission to leave a couple hours earlier before the Christmas holiday. Yeah, at least I've got that going for me.",
   "created_utc": 1702399971,
   "score": 108,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2bluc",
   "message": "Not quite the same thing but a friend worked for a Taiwanese company many years ago and at the Christmas party one of the managers handed out envelopes to a few people. They thought it was a bonus or promotion but it was a termination letter!",
   "created_utc": 1702403192,
   "score": 104,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1tk4f",
   "message": "One year bonuses were almost cancelled because of another award. Basically, there was a competition in spring for four hours of PTO if certain goals were met. The goals were met, 200-odd employees got a free half day off from work. \n\nEnds of year comes around and district says hold tf up, what do you mean you want to give bonuses? You spent your bonus money on that PTO. See, turns out that the rules changed from that time off being a non-cash award to it actually having value and no one told the peons on the front line. \n\nLuckily the management were able to force the hand and everyone got their bonuses as well, but that PTO thing has not been used since. Which sucks because it was a better-than-most motivator. I mean, who tf cares about pizza when you can take half a day off?",
   "created_utc": 1702396473,
   "score": 206,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1utyq",
   "message": "I got a $30 Door Dash voucher! Bought almost all of my lunch for 1 day. We only pulled in like $500 million in revenue last year, times are really tough.\n\nEdit: when I say revenue, I meant profit.",
   "created_utc": 1702396964,
   "score": 112,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2i6rw",
   "message": "My husband got fired. So being that he was the sole income provider for our family of four. I would say that's pretty terrible.",
   "created_utc": 1702405609,
   "score": 99,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2aech",
   "message": "I’ll get fresh baked cookies the boss’ wife made for Christmas. They’ll sit on my desk while I’m on vacation from 12/23 until 1/2. They’ll be hard as a rock and I’ll throw them away when I get in on 1/3.",
   "created_utc": 1702402747,
   "score": 13,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd223ca",
   "message": "I got told my position was obsolete and will no longer have a job come January. \n\nAlso a card!",
   "created_utc": 1702399704,
   "score": 78,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd27hqx",
   "message": "We’re getting a pie from a local pie shop, we pick our own pie, and a Christmas happy hour where food and drinks are on the company. Open bar and plenty of food to go around. All we have to do is sit through a one hour meeting before to discuss end of year numbers and then we’re off! We also get a free polo in our choice of color from the company store.",
   "created_utc": 1702401687,
   "score": 64,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1udxb",
   "message": "Company sent one box of candy/snacks for our 14 person team.",
   "created_utc": 1702396792,
   "score": 52,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2bgpc",
   "message": "Got a giftcard in an email. Turned out it was IT testing our spam detection knowledge… so nothing .",
   "created_utc": 1702403139,
   "score": 81,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2330m",
   "message": "T-shirt with company logo. Notebook with company logo. Cookies with no company logo",
   "created_utc": 1702400064,
   "score": 162,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1u5jt",
   "message": "I get a candy cane",
   "created_utc": 1702396702,
   "score": 27,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd29yuf",
   "message": "\"A donation has been made in your name to the New York City ballet\"",
   "created_utc": 1702402591,
   "score": 151,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2mcd3",
   "message": "My wife got a flyer with a QR code so she can pick her own gift from a list of five company-branded items (sweatshirt, speaker, water bottle, etc.).\n\nOnly the checkout link is broken, so she can't actually order anything.",
   "created_utc": 1702407127,
   "score": 75,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd25lo5",
   "message": "Christmas party that no one wants to go to",
   "created_utc": 1702400994,
   "score": 115,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd260hp",
   "message": "None bonus, left beef.",
   "created_utc": 1702401146,
   "score": 139,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1iba1",
   "message": "Jelly of the Month Club....I guess I'll never be able to get my family that in-ground pool.",
   "created_utc": 1702391925,
   "score": 97,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd273yn",
   "message": "We are getting a piñata at the holiday party. So we can crawl around on the ground for candy while the boss watches. Fun.",
   "created_utc": 1702401547,
   "score": 223,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2gdd6",
   "message": "How the hell can I afford to give my employee $500 for the holidays but these big corps are givimg you guys oranges and digital cakes.",
   "created_utc": 1702404941,
   "score": 221,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd29ps7",
   "message": "200+ employees where i work. We each got a generic, unsigned, non-personalized boxed Christmas card on a blank envelope with a $10 fast food gift card.\n\nExcept some of the gift cards were the reloadable type and had no money put on them. So basically some us were given a small handful of garbage.",
   "created_utc": 1702402498,
   "score": 0,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2apvn",
   "message": "I used to work for an old woman, her nickname around the shop was “Little Mussolini”, who would buy the discounted turkeys after thanksgiving and keep them frozen to pass out as Christmas bonuses. I’m talking 30 turkeys!",
   "created_utc": 1702402864,
   "score": 53,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2oe0d",
   "message": "A workplace branded umbrella and a \"covid kit\" consisting of sketchy hand sanitizer, some masks and a covid test\n\n\nWe work in a hospital so this feels some kind of way",
   "created_utc": 1702407876,
   "score": 51,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd26h53",
   "message": "Got an $100 Amazon card! At least it’s something I can use that I can buy stuff I need lol",
   "created_utc": 1702401315,
   "score": 42,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1uiq0",
   "message": "Ill probably get a box of chocolates, a bottle of wine, and a company fleece this year. I look forward to it every year and I appreciate the gift.",
   "created_utc": 1702396843,
   "score": 20,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1vgn9",
   "message": "We got a $25 dollar bonus for Thanksgiving. But it is on a check separate from our pay checks. Since I have extra taxes taken from each check I get, it all went to taxes.",
   "created_utc": 1702397207,
   "score": 187,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2m0p5",
   "message": "My boyfriend got a $50 gift card to his company store to buy a required uniform.",
   "created_utc": 1702407010,
   "score": 50,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1xryw",
   "message": "My work switched from yearly bonuses to biannual bonuses for this year. We got our first bonus in September and we have heard nothing about the 2nd.  I don't know why I expected anything else to happen.",
   "created_utc": 1702398091,
   "score": 90,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2auxz",
   "message": "Two years ago I got gourmet pretzels and a $20 gift card to the local Italian restaurant. Two weeks later the owner of the restaurant got caught with cp and they closed up",
   "created_utc": 1702402915,
   "score": 84,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2bxjy",
   "message": "We haven’t gotten anything for the last recent years. Except a veiled threat that we should be grateful we are employed. Uhh that’s not a real threat. If we didn’t work here, you’d have no one (experienced) to do the work.* *Niche market with high profile customers.",
   "created_utc": 1702403312,
   "score": 78,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1s919",
   "message": "Discontinued merchandise  my company  makes.    Merchandise that I neither need or want",
   "created_utc": 1702395965,
   "score": 36,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1z3lz",
   "message": "I got a $25 Butterball check",
   "created_utc": 1702398590,
   "score": 38,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2bf6m",
   "message": "A ham and Starbucks gift card 🙃 the rest of the managers receive cash bonuses. But because I work in HR, we are not eligible for cash bonuses, as we do not contribute to sales goals…. Meanwhile, we hire all the staff they need to meet sales goals. Retail is fun.",
   "created_utc": 1702403124,
   "score": 34,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd253n0",
   "message": "I got 10% of my salary so I'm fairly happy with that",
   "created_utc": 1702400807,
   "score": 160,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1e4t3",
   "message": "my friend got socks, bc all the bonus budget was spent on a company holiday party",
   "created_utc": 1702390097,
   "score": 127,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd23d6m",
   "message": "Lol we just get asked to contribute our own money to buy the customer service team gift cards",
   "created_utc": 1702400167,
   "score": 128,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2mo63",
   "message": "I got $8400.  Gonna ride the gravy train at this company until it reaches the station.",
   "created_utc": 1702407245,
   "score": 120,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd1imrp",
   "message": "If you get anything, like Jelly of The Month Club, it's more than I will get.",
   "created_utc": 1702392060,
   "score": 61,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2hvhr",
   "message": "I got a full months salary as december bonus",
   "created_utc": 1702405493,
   "score": 197,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2amn0",
   "message": "I got 220 corporate \"points\" which I can exchange for a $50 amazon gift card or a variety of shitty products.",
   "created_utc": 1702402831,
   "score": 62,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd21xpu",
   "message": "My sister got robbed of her $24,000 bonus. Her best year to date with the company in 20 years. Employers suck balls.",
   "created_utc": 1702399647,
   "score": 161,
   "submission_id": "18gmg3z"
  },
  {
   "comment_id": "kd2a2ar",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18gmg3z"
  }
 ]
}