{
 "submission_id": "18gpojn",
 "title": "What's a job or profession that seems easy, but is incredibly challenging?",
 "selftext": "",
 "created_utc": 1702398085,
 "permalink": "/r/AskReddit/comments/18gpojn/whats_a_job_or_profession_that_seems_easy_but_is/",
 "score": 175,
 "url": "https://www.reddit.com/r/AskReddit/comments/18gpojn/whats_a_job_or_profession_that_seems_easy_but_is/",
 "comments": [
  {
   "comment_id": "kd2ftna",
   "message": "Anything customer facing, the public is dumb and horrendous.",
   "created_utc": 1702404739,
   "score": 98,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3j55i",
   "message": "A pharmacist. \n\n1. You face the public.\n2. Your mistake can literally kill someone.",
   "created_utc": 1702419162,
   "score": 104,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2b34y",
   "message": "Pharmacist. So many people think their job is essentially the same as any other kind of retail worker and they just prepare prescriptions written by a doctor without having to know anything about them. They are very highly trained in, well, pharmacology; and it's not uncommon for a pharmacist to notice things like potentially dangerous drug interactions that the doctor hadn't.",
   "created_utc": 1702402999,
   "score": 125,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd1z6ef",
   "message": "[removed]",
   "created_utc": 1702398619,
   "score": 242,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2k35u",
   "message": "Teaching, especially special education.",
   "created_utc": 1702406304,
   "score": 249,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd24pw2",
   "message": "Some creative professions, such as designers, are often perceived as 'easy' due to their creative nature. However, they may face the constant need to find inspiration, deal with criticism, and meet deadlines",
   "created_utc": 1702400667,
   "score": 156,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd1zgae",
   "message": "Anything directly customer facing.",
   "created_utc": 1702398725,
   "score": 181,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd1z262",
   "message": "I can’t think of any job that isn’t extremely challenging in some way.",
   "created_utc": 1702398574,
   "score": 82,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd32w4h",
   "message": "Retail. People are dirty, rude, narcissistic assholes.",
   "created_utc": 1702413227,
   "score": 18,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd1ypim",
   "message": "Customer service",
   "created_utc": 1702398441,
   "score": 193,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3qamd",
   "message": "Care work.\n\nI wish it could be taken for granted that no one thinks it's easy. But unfortunately many people still see it as an unskilled job and have no idea of the many emotional complexities, or of how much empathy, all the time, is needed to form the sorts of relationships with service users that they really need.",
   "created_utc": 1702421915,
   "score": 61,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd1zm3c",
   "message": "I suspect everything fits this. Consider that someone whose job is stacking boxes in a warehouse has to know how to lift boxes, how many can be stacked, know if certain ones must be easily accessible, know how to use any equipment that is used to move boxes around, and so on.",
   "created_utc": 1702398787,
   "score": 238,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd20ki8",
   "message": "I’m going to say most types of unskilled labor and that’s cause there’s such little reward and such a huge amount of bullshit. I’ve done customer service, barista, sales, serving, etc; it was all much harder than my cushy desk job that actually can be considered life or death.",
   "created_utc": 1702399142,
   "score": 189,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd1xwx0",
   "message": "Being a chef.",
   "created_utc": 1702398144,
   "score": 243,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd37ly1",
   "message": "I don't know if I'd call it incredibly challenging, but being one of those old school taxi drivers who knows the city like the back of his hand and can literally just drive wherever being told nothing but an address are pretty impressively skilled. Not sure if it's still like this, but British cabbies used to be legendary for this. I'm 40 and I don't think most young people appreciate how much the quality of cab service has gone down since the advent of things like Uber. Nowadays it's just kind of expected that a rideshare/cab driver doesn't know exactly where you're trying to get and has to rely on GPS directions that they often fuck up. Back when I was in college cabbies were complete experts on their city. More even than knowing how to get somewhere they could also give you advice. Like you could just generally describe a type of bar/club/business you're looking for and they'll take you right to one that was spot on. Especially in really big cities like NYC.",
   "created_utc": 1702414947,
   "score": 95,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd39pin",
   "message": "Anything that involves a lot of people skills and socializing. I thought these positions were just the bs of sitting in meetings all day and not a lot of work happening, but having to be the one leading those meetings and doing public speaking is taxing in a way I didn’t realize.",
   "created_utc": 1702415720,
   "score": 25,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2it5x",
   "message": "Veterinary Technician. \n\nDo the job of an RN, anesthesiology tech, dental hygienist, radiology tech, phlebotomist, lab tech, and CNA, but probably don’t make a living wage and have people undervalue your career because you “play with puppies and kittens all day”.",
   "created_utc": 1702405835,
   "score": 204,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd32kuv",
   "message": "Sometimes, when my brain is fried from thinking and my ego is shot from not fixing the problem, I want to be a garbage man...not a ton of thinking, just put the trash in the truck, hec of them have trucks that do it for you!\n\nBut the robot either doesn't work or you don't have one on your truck, it smells really bad, the pay isn't what it used to be, you might find a dead body and certainly find dead animal carcasses...and people are idiots, overfilling their bags, just to have them fall apart before you get to the truck, not putting their trash out and then blaming you, making you come back out,your body probably is sore everyday, and you have to take 2 baths before you can kiss your wife...ehh maybe things are not so bad where i am.",
   "created_utc": 1702413112,
   "score": 40,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2lwmj",
   "message": "Psychotherapist.",
   "created_utc": 1702406970,
   "score": 66,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd352vd",
   "message": "For the most part, my job is really easy (marketing tech). But having to constantly stay on top of new platforms, new tech, updates, etc etc is exhausting and overwhelming and I really hate it. Also the constant responsibility to locate and execute opportunities to optimize things and increase value for higher ups. Nobody in corporate roles can ever just reach a point of “good enough”. More and better is always required.\n\nJust some of the big reasons I’m considering a career change.",
   "created_utc": 1702414033,
   "score": 36,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd25oof",
   "message": "Culinary, what you see on TV is just some wild dream reallity is, you are 50% grey by the age of 30, your legs feel like you are 80 years old, your hands dont even work they are just stuck in an infinity loop of cutting and chopping thats all they are good for and ofc slaping some nasty slaps that hurt like truck. Your nerves have given up and its matter of time when will you chop some guest for talking nonsense, you dont know what weeked is, your monday is day for sleep, your night out is drinking in some pit. Its none of the glamour you see on TV, sometimes i cut more animals than my brain can handle, ive lost an appetite for many things long ago. But its fun.",
   "created_utc": 1702401027,
   "score": 58,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3agqn",
   "message": "Performing arts and other types of art- people think it’s a cakewalk or “not a real job” not realizing the literal lifetime of training, rejection, and perseverance that it takes to reach a professional level and how insanely competitive those spaces are",
   "created_utc": 1702415998,
   "score": 48,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd328qq",
   "message": "Preschool teacher. I get a lot of \"oh you just get to play with kids all day!\" But in fact we do lesson planning just like teachers of higher grades and these kids aren't even emotionally mature yet. Aside from teaching them academics we also need to teach them social and self help skills. And in my state our ratio is 10 kids per 1 teacher so I have a class of 18 between me and my TA. Not to mention having to deal with crazy parents who think their kid is the only one we need to focus on. And we don't get paid nearly as much as the other teachers either plus we don't have unions or benefits or PTO/vacation time which teachers of higher grades are guaranteed.",
   "created_utc": 1702412985,
   "score": 78,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2s2v7",
   "message": "Based on all the posts I see on reddit - IT.\n\nSure basic troubleshooting is easy - something anyone really can do, but actually understanding why problems are happening seems incredibly rare in this day and age.",
   "created_utc": 1702409240,
   "score": 82,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3buo2",
   "message": "USPS. Everyone thinks this is a cake job that pays well and has great benefits. Being a rural carrier is the hardest job I've had, and carriers are treated like absolute shit from customers and management.\n\nI worked in the utility industry for ten years prior, and was a conductor for a class 1 RR for three years after that... Those jobs, even with the travel, were a walk in the park compared to being a carrier.",
   "created_utc": 1702416502,
   "score": 29,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3xyja",
   "message": "Honestly, as dumb as it sounds, receptionist at an office where things are extremely busy. You wear a zillion hats and everyone needs a million things that aren’t related to each other all at once. It’s not “hard” it’s just a lot to juggle while keeping a smile on your face and making everyone happy.",
   "created_utc": 1702425035,
   "score": 36,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd482on",
   "message": "Teaching.  Underpaid, undervalued, and you don't get to sign off when the school bell rings at the end of the day.  Plus, brats.  Entitled brats.  With entitled parents.  The thing that sometimes makes up for it is when you get through to that one kid, and a lightbulb goes off in their head, and they recognize it and you know you've made a difference.",
   "created_utc": 1702429324,
   "score": 24,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3i4yf",
   "message": "Mechanic. Try doing a timing chain where you have to remove the transmission to get to it.\n\nOr when every bolt breaks because you live in an area where they salt the roads, and you have to spend several hurs drilling out a bunch of bolts, only for the drill bit to break off inside the bolt you are drilling.",
   "created_utc": 1702418782,
   "score": 11,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2xdc9",
   "message": "[deleted]",
   "created_utc": 1702411176,
   "score": 37,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd35mou",
   "message": "In my early 20s I had a job as an envelope licker. I know it sounds weird, but back then there was a certain company (ends with “Clearing House”) that had a policy that all envelopes must be sealed via licking instead of a using a sponge, etc. \n\nAnyway I spent two years of my youth licking envelopes. At first it was easy and took very little effort. But then the industry went to thicker envelopes and tackier glues. That resulted in months of paper cuts on my tongue and chronic dry mouth. \n\nAll this to say anyone wanting to get into the envelope licking industry just needs to be prepared for what they are getting into. It’s harder than it looks.",
   "created_utc": 1702414230,
   "score": 77,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2483j",
   "message": "Delivery driver. No way am I driving a huge truck through narrow city streets and tiny alleys",
   "created_utc": 1702400482,
   "score": 30,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2m233",
   "message": "In my own experience, cleaning, specifically contracted janitorial work, getting everything done properly under a time limit is extremely exhausting.\n\nCompany I worked at went through so many people in the short time I was there (1 1/2 years is all it took for me to become the most senior employee)",
   "created_utc": 1702407024,
   "score": 22,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd4fkbv",
   "message": "Certified Nursing Assistant",
   "created_utc": 1702432546,
   "score": 9,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3yciz",
   "message": "Social Worker hands down!",
   "created_utc": 1702425196,
   "score": 13,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd24lbm",
   "message": "trust me... retail",
   "created_utc": 1702400619,
   "score": 56,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd37438",
   "message": "Firefighter/Paramedic. \n\nThere’s a perception that we sit in recliners all day and sleep 8 hours at night. While there may be days that we are not busy with 911 calls or training, those days are few and far between. This has been especially true in a post-COVID world. \n\nIn my personal experience at 32 years old, I feel like I’ve finally felt true exhaustion coming home after running all night long on little to no sleep to solo care for my toddler.",
   "created_utc": 1702414766,
   "score": 7,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3rl6k",
   "message": "Wedding/family Photography. So much goes into reading people, knowing your camera and constantly changing settings, directing people, making people comfortable when they hate it. Then editing is a whole other beast that is much more complicated than people think. People assume you push a button on a fancy camera then apply a filter and you're done. It's so much more.",
   "created_utc": 1702422434,
   "score": 7,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd5chgz",
   "message": "Pharmacist. We deal with drug addicts constantly. Robberies are more common than you think because pharmacies have both drugs and money. We also are that gets to tell people their insurance will not pay for their new drug.\n\nWorking conditions are also horrible. Imagine being expected to stand for 12-14 hours with no stool. Most pharmacists do not get a lunch break. A lot of pharmacists end up with urinary tract infections from not being able to use the bathroom.",
   "created_utc": 1702448157,
   "score": 7,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3e5ae",
   "message": "Postman. The usual thoughts on being a postie are 'it's just delivering letters.' It is not often understood that the postie walks 8-12 miles daily over 5 hours with up to 14kg bag over their shoulders in extreme weather. I'm always amazed at how we drive ourselves through this 5/6 days a week. The First three hours of the day we just sort thousands of letters and parcels under the watchful eyes of our managers. If you want proof you can get blood from a stone look no further than Royal Mail.",
   "created_utc": 1702417337,
   "score": 13,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd40c7v",
   "message": "Teaching. Everyone thinks they know how to teach because they went to school as a student. In reality, teaching is challenging in itself because you have to know how the brain works and how new information is acquired, practiced, and committed to memory. Add all the challenges with the American public school system, and you’ve got a recipe for the impossible. Yet, everyone has an opinion on teaching and teachers.",
   "created_utc": 1702426029,
   "score": 12,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2anxp",
   "message": " office jobs ..\ni work an office job. people think i'm just sitting around drinking coffe all day. ...it's not like in the movies...",
   "created_utc": 1702402844,
   "score": 44,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd27q5l",
   "message": "Construction and home improvement. Since they pay is so low and handymen are everywhere, everyone thinks it's easy. I dunno how many times people say demeaning shit to me when I talk about my job, \"oh I can do that it looks easy. I saw it on HGTV.\"",
   "created_utc": 1702401772,
   "score": 11,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2i3ii",
   "message": "taxi driver / transports in general. I would flip my shit in the first traffic jam I encounter.",
   "created_utc": 1702405575,
   "score": 7,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3y23r",
   "message": "Any job that faces the public",
   "created_utc": 1702425077,
   "score": 6,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3yoma",
   "message": "Nursing.",
   "created_utc": 1702425336,
   "score": 5,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3eyqq",
   "message": "The trades.. a lot of people treat it as a last resort; but it takes years to learn the skills of a good tradesman and very tough skin to make it to that point",
   "created_utc": 1702417633,
   "score": 12,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2ok7u",
   "message": "Librarian",
   "created_utc": 1702407939,
   "score": 14,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd27knu",
   "message": "Fitness Trainer some people think they’re instantly Hercules and try lifting more than they think they’re capable of doing and me as trainer have to tell them no as well have to be one to grab the heavy weights. I tell people because it’s too heavy they might tear a muscle and don’t over exert themselves",
   "created_utc": 1702401716,
   "score": 10,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd2ns0m",
   "message": "Occupational therapist.",
   "created_utc": 1702407649,
   "score": 9,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3use1",
   "message": "Massage therapist 🙋🏼‍♀️ Until you touch the skin of a stranger you have no idea. Worst story for me was getting to the feet of a girl who had kitty litter stuck to her foot. KITTY LITTER!!",
   "created_utc": 1702423734,
   "score": 9,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd40bh9",
   "message": "Dentist.",
   "created_utc": 1702426021,
   "score": 10,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd396lw",
   "message": "I know a lot of technical people, that were excellent at their jobs so got promoted to cushy management positions, and absolutely couldn't handle the simplest of tasks they had to do as managers.",
   "created_utc": 1702415528,
   "score": 5,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3m7p8",
   "message": "Graphic design.\nYou really need a stable self-esteem. Some clients can be cruel and you end up questioning your decisions all the time. Everything is for yesterday. Long hours in front of a computer. Everyone thinks their cousin coul've done better than you for less money.\n\nYou are aware that if the world as we know it  ends, there's no way you could trade or put your abilities to use. \n\nAdobe is fucking expensive. You have to know other things too, like video editing, copywriting...\n\n:( I wish I had studied medicine.",
   "created_utc": 1702420329,
   "score": 6,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd3maes",
   "message": "\nI'm a cook nowadays, I cooked food for our former president of France François Hollande, just an example, we do buffet it's not a restaurant but I worked in restaurants too, it can be extremely stressful and I lost some muscle mass and my face is thinner I hate that tbh but it's anxiogenic.",
   "created_utc": 1702420358,
   "score": 6,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd4l6n1",
   "message": "Managing a fast food restaurant.\nThe hardest job I've ever had, and the most looked down upon I've ever been.",
   "created_utc": 1702434901,
   "score": 5,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd42tgg",
   "message": "Cna",
   "created_utc": 1702427077,
   "score": 9,
   "submission_id": "18gpojn"
  },
  {
   "comment_id": "kd22sq6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18gpojn"
  }
 ]
}