{
 "submission_id": "18gvrq7",
 "title": "What activist group is the biggest joke when it comes to convincing people to join their cause?",
 "selftext": "",
 "created_utc": 1702413553,
 "permalink": "/r/AskReddit/comments/18gvrq7/what_activist_group_is_the_biggest_joke_when_it/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/18gvrq7/what_activist_group_is_the_biggest_joke_when_it/",
 "comments": [
  {
   "comment_id": "kd4417c",
   "message": "Susan G Komen Foundation. \n\nTakes Billion$ in donations. Makes people AWARE of cancer, does nothing to fight cancer",
   "created_utc": 1702427599,
   "score": 37,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd492m0",
   "message": "Some US activist group in Burlington VT was asking for donations. The guy on the street told me that they help the 48 million kids that have Autism. Since this was a \"US organization\" I was confused and asked if they help kids with Autism all over the world. \n\n\"Just in the US,\" he said. \n\nI tried to clarify again, \"But you help 48 million kids?\" \n\n\"Yes!\" he said proudly.\n\n\"You think there's 48 million kids with Autism in the US?\"\n\n\"There are, unfortunately.\" He said.\n\nFlabbergasted, I said, \"Dude, I don't know if there even ARE 48 million kids in the US!\" \n\nThere are, as I learned later, approximately 73 million kids under 18 in the US. But still that would be over 50% of kids with Autism!! My dude, do some BASIC research for the cause you are raising funds for.\n\nEdit: It's possible this group was Autism Speaks, as people have suggested. I don't remember the name of the group, so can't say for sure. But looking up the org Autism Speaks, it seems that could have been a very good answer to OP's question. [See this website.](https://autisticadvocacy.org/wp-content/uploads/2017/04/AutismSpeaksFlyer2020.pdf)",
   "created_utc": 1702429757,
   "score": 153,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd415ho",
   "message": "The mod from r/antiwork that did the interview on Fox destroyed the entire sub.\n\n\u0026amp;#x200B;\n\nedit:  [sauce](https://www.theguardian.com/global/2022/jan/31/fox-news-jesse-watters-antiwork-subreddit-interview)",
   "created_utc": 1702426375,
   "score": 173,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4buoh",
   "message": "Autism Speaks. I can't think of a group more reviled by the people they claim to represent.",
   "created_utc": 1702430956,
   "score": 157,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd34evv",
   "message": "The flat earth society",
   "created_utc": 1702413789,
   "score": 182,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4b05g",
   "message": "Jehovah's Witnesses.  \n\nMan, if you aren't already one of the 144,000 people written in the Book of Names, you aren't getting in.  Why spend all that time going door-to-door spreading the \"good news\", when you already know they don't qualify to be in the club?",
   "created_utc": 1702430588,
   "score": 131,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3g0t4",
   "message": "Any of the ones that act as if insulting uninvolved people will make them like the very group that loudly calls them names.",
   "created_utc": 1702418012,
   "score": 20,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd40nzw",
   "message": "Westboro Baptist",
   "created_utc": 1702426168,
   "score": 92,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3n8w5",
   "message": "Flat earther social skills aren't just low level, they also come with a massive dosage of ego and Oppositional Defiance Syndrome I'm pretty sure and is my short argument for why them. \n\nMaybe not activists but sure we're just having fun right. RIGHT?",
   "created_utc": 1702420727,
   "score": 252,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3kihq",
   "message": "The People's Front of Judea.",
   "created_utc": 1702419677,
   "score": 100,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3dpf4",
   "message": "I think PETA are probably the worst group, there f\\*ckups are well documented and so is there smugness.",
   "created_utc": 1702417175,
   "score": 200,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4dhka",
   "message": "r/antiwork is a mess\n\n40% are legitimate concerns like bosses stealing wages and tips and all sorts of shenanigans. \n\nThe rest makes you scratch your head and go “have these posters ever had a job before?” \n\n“I got fired for doing nothing.  Is this legal?!”\n\n“I didn’t get a job I applied for internally. Is this legal?”\n\nAt least half of the comments are “call an employment lawyer!”",
   "created_utc": 1702431652,
   "score": 69,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd48npu",
   "message": "The last USDA inspected Horse Slaughterhouse was in DeKalb, IL. Most of it was exported although some place a Harvard was also a big buyer. Anyway PETA types convinced an IL Congressman to pull the USDA funding. Slaughterhouse shut down. As many pointed out, what did these people think happened to the horses? Either hauled out to the back Forty \u0026amp; shot or shipped to a Canadian Slaughterhouse. In the end they didn’t save a single horse.",
   "created_utc": 1702429576,
   "score": 86,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3ivqy",
   "message": "Just stop Oil in the UK.... They rarely protest at places that make sense.... Instead, they go and slow walk a random side street or throw paint/dust over stuff and then scream if anyone touches them.\n\nGot to a point where a lot of people here think they're stooges for the oil companies to try and turn public attention away from where it's needed.",
   "created_utc": 1702419063,
   "score": 242,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4apse",
   "message": "Autism Speaks",
   "created_utc": 1702430465,
   "score": 55,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3be9j",
   "message": "PETA",
   "created_utc": 1702416336,
   "score": 11,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4l9uy",
   "message": "Just stop oil. They just stop ordinary people from getting to work, school, the hospital etc",
   "created_utc": 1702434937,
   "score": 246,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3r5ml",
   "message": "My conspiracy theory is that oil companies false flag some of the particularly annoying \u0026amp; less effective climate protests so they can ride that backlash",
   "created_utc": 1702422260,
   "score": 163,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3rf0p",
   "message": "Those \"Stop Oil\" types that glue themselves to the street or art museums.",
   "created_utc": 1702422365,
   "score": 220,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3uphg",
   "message": "Climate activists targeting art. It has nothing to  do with the cause, it angers people and overall it seems so counterproductive that it may as well be some oil company pretending to be climate activists to put the in a bad light.",
   "created_utc": 1702423700,
   "score": 240,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd42113",
   "message": "NAMBLA",
   "created_utc": 1702426746,
   "score": 67,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4jfaf",
   "message": "Black hebrews",
   "created_utc": 1702434189,
   "score": 82,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3kgab",
   "message": "The Birds Aren't Real group have been actively trying to recruit me to no avail.",
   "created_utc": 1702419654,
   "score": 176,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd47ujc",
   "message": "Jehovah's Witnesses",
   "created_utc": 1702429225,
   "score": 40,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4gkoj",
   "message": "Stop Oil. \n\nGluing your hand to a racetrack for a race specifically for electric cars was one of the dumbest things I've ever seen. Nevermind throwing paint on works of art.",
   "created_utc": 1702432983,
   "score": 84,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd497tp",
   "message": "Mom's for Liberty. Supposed to be to protect children but their leader is a convicted priest that raped a 14 year old boy.",
   "created_utc": 1702429820,
   "score": 14,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd41neu",
   "message": "\"Defund the police\" is so much more contentious and easily debated than \"Though law enforcement is necessary in any given society, our criminal justice system is in need of a massive restructuring. Large portions of the police budget should be reallocated to mental health, community, and preventative services,\" but it's also easier to fit on a sign",
   "created_utc": 1702426588,
   "score": 159,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3kfiv",
   "message": "He Gets Us",
   "created_utc": 1702419646,
   "score": 152,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd3fnmc",
   "message": "The people who are still convinced they're going to get rich off of Gamestop stock.\n\nAll the rational people have left the \"movement\" and they've sort of created a financial Q-Anon situation where they think they're going to topple the US Financial system and destroy the stock market because the CEO is sending them coded messages via a line of children's picture books.\n\nIt's kind of a hard sell to new recruits.\n\nEdit:\n\nLong story long, they believe that the only reason Gamestop's stock didn't just....I don't know. Keep going up in price forever? Is because thousands of people over hundreds of brokerages, governmental offices, banks and hedge funds have colluded for years to make fake Gamestop shares to suppress the price of the stock.\n\n  \nThey think thousands of times more stock has been sold than exist, but that they hold \\*real\\* shares and, once the ruse is revealed, will lead to the destruction of the American economy. They believe that they will be able to sell their shares, one at a time, for millions of dollars and in exchange for political favors like the arrest of their enemies. They believe that the eeeevil hedge funds that are doing this will be wiped out, followed by ALL investments, to the point that the US Treasury will have to reimburse them directly.\n\n  \nThey know this because their CEO, a rich dude who invested early in the GME runup, is sending them clues. They use gematria to 'decode' his message and believe the numbers 741 have special significant meaning. He's including easter eggs in his children's book line to dodge the SEC. The time or content of his tweets, when he tweets, the items on screen during an interview - these are all taken as proof that he's secretly fighting for them.\n\n  \nThere's lots of theories about what the catalyst for this opportunity to earn \"wife changing money\" (their term, not mine) is that Gamestop is going to merge, voltron-style with one or more of the following companies:\n\n  \n\\- Bed Bath and Beyond  \n\\- Buy Buy Baby  \n\\- Blockbuster  \n\\- Toy's R Us  \n\\- Party City  \n\\- 5 Guys Burgers  \n\\- Sears  \n\\- Lego\n\n  \nThese beliefs also, of course, stem from 'clues' given via the above methods.\n\n  \nThey aren't even the worst ones. The people who used to hold Bed Bath and Beyond stock believe literally all that too, about their stock. I say 'used to' because the company went bankrupt, liquidated, and cancelled it's shares this fall. But it doesn't matter, they'll be rich any day now, despite no longer owning stock because there is no longer anything to own shares of. They ALSO say that they know this because the CEO of Gamestop is sending them those exact same coded messages.\n\n  \nThis is especially funny because the only reason they are invested in the company in the first place is because they followed that guy into the investment after he made a name for himself managing to time his entry in to the Gamestop stock. He bought, they followed. Htweeted positively about the stock, they bought more and the price pumped, and then he sold, pocketing something in the range of $60-70 million of their dollars. The SEC is suing him, currently, for doing this, and they're FURIOUS. They would get money if he loses, but they're raging over the idea that he scammed them and want the charges dropped.\n\n  \nI can't even really scratch the surface of those guys. Where to start. The time they thought Titanic's rerelease had been timed to announce that they were all rich? The time one of their most influential members got in a physical altercation because he kept going to the building of their former CFO, who committed suicide, insisting the doormen tell him where he was secretly hiding? The belief that the war in Ukraine was initiated to distract from the financial apocalypse they had initiated? The day they were sure that a Times Square billboard had a secret hidden message for them, but then one of them went there and it turned out to be the reflection of the liquor ad across the street? The time a man called a gynecologist trying to determine when the baby in [this](https://twitter.com/ryancohen/status/1510818828695052289) ultrasound would be born? The fact that they've donated almost $90,000 to their most prominent influencer in the last two months?\n\n  \nAnd, as others have pointed out, they aren't alone. AMC, Party City, Rite Aid, and a handful of others all have these little mini cults as well. Hell, Sears went bankrupt in 2018 and there are still people who will happily tell you about how their shares are coming back and they'll be gorillianires any day now.\n\n  \nIt's weird. It sounds really dramatic to say but they've basically formed these little apocalypse cults where it's the end of the economy they want instead of the end of the world.",
   "created_utc": 1702417880,
   "score": 57,
   "submission_id": "18gvrq7"
  },
  {
   "comment_id": "kd4d6eh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18gvrq7"
  }
 ]
}