{
 "submission_id": "18hldjz",
 "title": "What's something that you've experienced that not a lot of people have?",
 "selftext": "",
 "created_utc": 1702486765,
 "permalink": "/r/AskReddit/comments/18hldjz/whats_something_that_youve_experienced_that_not_a/",
 "score": 9,
 "url": "https://www.reddit.com/r/AskReddit/comments/18hldjz/whats_something_that_youve_experienced_that_not_a/",
 "comments": [
  {
   "comment_id": "kd78wcz",
   "message": "Having a youtube video go viral.  It was a fun fling.  Video went on TV a handful of times.  Got to talk to the exec producer of War of the Worlds on the phone - he was the one who got my vid on tv.",
   "created_utc": 1702486905,
   "score": 9,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd78qqg",
   "message": "Once, I had the top film on a packet of bacon peel right off in one piece.",
   "created_utc": 1702486847,
   "score": 6,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7900s",
   "message": "I’ve performed at Carnegie Hall.",
   "created_utc": 1702486944,
   "score": 5,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7ee2x",
   "message": "Found a whole patch of 4 and 5 leaf clovers",
   "created_utc": 1702488922,
   "score": 6,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd797vk",
   "message": "People crossing the street to avoid you, very disheartening!",
   "created_utc": 1702487026,
   "score": 3,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd79ao3",
   "message": "I was in a coma for 6 days.",
   "created_utc": 1702487054,
   "score": 4,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd79w0n",
   "message": "Wife and I got married in a private chapel in Vatican City.",
   "created_utc": 1702487273,
   "score": 3,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7fs3x",
   "message": "Cold case murder in my family",
   "created_utc": 1702489427,
   "score": 5,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7imcg",
   "message": "Pet a giant Nassau grouper like a dog while scuba diving a shipwreck. \n\nWent on a dive trip at 22 years old with my dad and while diving a shipwreck, I noticed there was a giant grouper circling. I swam up to it and it didn’t move. Reached out my hand and it didn’t move. Started to scratch its chin and still nothing. It then proceeded to swim closer to me and nibble on my shoulder/rash guard and we just kind of hung out like that for 5 minutes until my instructor signaled to me to knock it off lol 🫶🏼",
   "created_utc": 1702490457,
   "score": 5,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd79dgb",
   "message": "Finally understanding the purpose of life.",
   "created_utc": 1702487082,
   "score": 3,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd79m9o",
   "message": "Combat",
   "created_utc": 1702487173,
   "score": 3,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd79wmb",
   "message": "I graduated from Marine Corps bootcamp and School of Infantry… in the 80s.",
   "created_utc": 1702487279,
   "score": 3,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7crh7",
   "message": "I've lived for months in a tent volunteering at a wolf sanctuary.",
   "created_utc": 1702488331,
   "score": 3,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd796st",
   "message": "Having a gun pointed in my face by someone I knew and trusted in my early 20s.",
   "created_utc": 1702487014,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7afc2",
   "message": "So, this happened to me on this solo hike I took a while back. It started off as this perfect day, clear skies, just me and the great outdoors. I was feeling pretty pumped, you know, just exploring and enjoying the peace and quiet.\n\nBut, out of nowhere, this crazy storm rolls in. I mean, it was intense – dark clouds, crazy winds, the works. I found this spot under some trees to wait it out, thinking it would pass quickly. Boy, was I wrong.\n\nThen, get this, a bolt of lightning strikes super close to me, like one of those 'you could feel the electricity in the air' close. And just when I thought it couldn't get any scarier, this massive tree next to me gets hit and starts falling right towards me. I'm not kidding, it was like a scene from a movie.\n\nI literally had to dive out of the way. It was nuts! The tree crashed down right where I was a second ago. I was just lying there on the ground, heart pounding, thinking, \"Did that just happen?\"\n\nAfter that, I was pretty shaken up, but thankfully, I wasn't hurt. Once the storm cleared, I booked it out of there. That whole experience was insane, and it really made me appreciate, you know, being alive and all that. Nature's no joke, guys. I've got a whole new respect for it after that day.",
   "created_utc": 1702487471,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7b1ef",
   "message": "November 6th 2009 it was a Friday after school I was 7 and my best friend was around my house. About 4pm ish my dad walks through the door and surprises me and my friend with a new Xbox 360 game. Lo and behold it is MW2 which wouldn’t release for another 4 days. This sounds far fetched but even to this day my best friend constantly reminds me of it and how jealous he was. I remember playing the campaign with him and we got to the cliffhanger mission and his mum arrived to take him home as he played the final part where you drive the snow mobile down the mountain and finish the mission. \n\nI honestly have no idea how my dad got the game early, I distinctly remember my friend saying “ how have you got this , it’s not even out yet “ and I didn’t even ask any questions I just wanted to play it. \n\nSo yeah I guess I’ve experienced the first couple missions of MW2 before anyone else ?",
   "created_utc": 1702487697,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7bayd",
   "message": "A kidnapping",
   "created_utc": 1702487797,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7bicf",
   "message": "Catching a full grown snapping turtle",
   "created_utc": 1702487872,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7c7rq",
   "message": "Idk about you but I haven't experienced anything special. Just the usual stuff like getting stuck in traffic or burning my toast, ya know? But hey, maybe someone out there has a more interesting life than me. Who knows?",
   "created_utc": 1702488130,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7e7sk",
   "message": "Accidentally rolling down naked in a Navy ship during large waves.",
   "created_utc": 1702488859,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7eb8m",
   "message": "When I was about 5 years old, I died from asphyxiation due to tonsillitis. Fortunately it was in a hospital and there were people trained to give me CPR and what usually happens when this is applied correctly happened: my ribs were broken.\r  \n\r  \nBut while I was \"absent\" I had a vision that began with the ringing of some bells, then passing through a tunnel, reaching a large space, full of light where they ordered me to return.",
   "created_utc": 1702488894,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7edxb",
   "message": "Saving someone’s life and helping someone die peacefully. Working with a team to restart someone’s heart. Watching people die.",
   "created_utc": 1702488920,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7k6ud",
   "message": "Supraventricular tachycardia",
   "created_utc": 1702491030,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7lyli",
   "message": "Being held hostage in my own house by a dude who was suicidal. He wanted to die, so, I got a big butcher knife and went after him. Not trying to really do anything to him. \nHe was a wrestler and I didn't have any skills. He got the knife from me. \nDude fought like hell too.",
   "created_utc": 1702491677,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7mc9u",
   "message": "A formal exorcism",
   "created_utc": 1702491815,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7xnlx",
   "message": "2-day Jeopardy champion",
   "created_utc": 1702495949,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7ye9b",
   "message": "I've been skydiving twice.",
   "created_utc": 1702496232,
   "score": 2,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7hohc",
   "message": "A massive DVT at 19, pulmonary embolism at 30, and a heart attack at 32.",
   "created_utc": 1702490116,
   "score": 1,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7jh9z",
   "message": "losing a bestfriend",
   "created_utc": 1702490771,
   "score": 1,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd7z82m",
   "message": "Literally standing on top of a mountain and having clouds pass through you you are so high up.",
   "created_utc": 1702496566,
   "score": 1,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd80lpy",
   "message": "Having an unexpected lunch with the CEO, CAO and CFO  of a laboratory company in La Jolla because everyone happens to talk about me even though I was only working in the maintainance department of the company. Perhaps it was the fact that I was the only woman in a sea of 100 men in the department, but I know my popularity became known not only in this company but the whole block of labs under different corporations. I thought that was super cool and a one time experience, they even gave me an award after helping out on of our top scientists after a huge feud she had with the director of my department and I somehow convinced her to stay with our company instead of going back to Germany. She signed on for 3 years and I heard she's signed on again for another 7 years with the company.",
   "created_utc": 1702497152,
   "score": 1,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd82tsk",
   "message": "Not super uncommon, but I've stayed in the Presidential Suites of most of the major casino hotels. My boss was a very good customer.",
   "created_utc": 1702498163,
   "score": 1,
   "submission_id": "18hldjz"
  },
  {
   "comment_id": "kd8a5i6",
   "message": "i guess being born as an emotional replacement of your mom's mom (who killed herself) is something i'd call unusual?",
   "created_utc": 1702501116,
   "score": 1,
   "submission_id": "18hldjz"
  }
 ]
}