{
 "submission_id": "18hmee9",
 "title": "What's the most unbelievable 'small world' encounter you've ever had?",
 "selftext": "",
 "created_utc": 1702489297,
 "permalink": "/r/AskReddit/comments/18hmee9/whats_the_most_unbelievable_small_world_encounter/",
 "score": 15,
 "url": "https://www.reddit.com/r/AskReddit/comments/18hmee9/whats_the_most_unbelievable_small_world_encounter/",
 "comments": [
  {
   "comment_id": "kd7fxws",
   "message": "When I started dating my gf there was another guy that liked her as well. She chose me. \n\nFast forward 5 years, I'm a groomsman at my friend's wedding and I'm walking down the aisle with one of the bridesmaids. Turns out it's that guy's new girlfriend.\n\nSo in one evening he saw me walk down the aisle with his current gf, and dance and laugh and have fun with his ex crush. Pretty sure there's a villain origin story in there somewhere.",
   "created_utc": 1702489487,
   "score": 18,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7i4kf",
   "message": "i met a guy in a bus station, chatted for a bit while waiting for our buses, we never said where we were going just talked about life and how we were both bored of the same old. Fast forward 2 days i’m in salou spain, on holiday and guess who i see across the hallway from me. From a small village in scotland to the same holiday hotel.",
   "created_utc": 1702490279,
   "score": 11,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7h90p",
   "message": "I bumped into my ex at Heathrow Airport\n\nWe’re both British, but at that point I lived abroad and she lived in Manchester. It wasn’t the local airport for either of us and it’s the single busiest airport in Europe",
   "created_utc": 1702489962,
   "score": 6,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7ifgs",
   "message": "Moved to the US at 7yo. This was January 1996 and my parents not knowing much about the area or culture just put me in the same school as my cousin to finish out 1st grade (this was a small private Catholic school). I, barely knowing English at the time and seeing snow for the first time, made a snowball and threw it at the request of a fellow classmate and I got in trouble during recess. At the end of that school year, we moved and settled elsewhere and I finished out my school years in public schools in a completely different school district. My senior year of HS, I start dating some guy from our rival high school and lo and behold, his best friend and I eventually realize he was that kid that made me throw a snowball all those years before",
   "created_utc": 1702490388,
   "score": 7,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7h2lq",
   "message": "I dated a girl back in college. \n\nShe was coming to Chicago to visit me over the summer. She posted a bunch of the photos on Facebook later, including one from the airplane where she was sitting next to my cousin.\n\nJust a random seat assignment from United.",
   "created_utc": 1702489897,
   "score": 5,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7hacw",
   "message": "After high school, went to a small, religious college about 1000 miles away from home. Stumbling back from the communal dorm bathroom one morning, I hear someone saying my name. It's a girl I graduated public high school with, who was going to an entirely different university a little ways away. She was visiting my school with a friend for the weekend (I think her friend had a friend who attended).\n\nOh, wait, I have a better one.\n\nThis Thanksgiving, at my US town in the Mountain West, there were 20+ people at my brother's house. My cousin's son brought his longtime girlfriend, who I absolutely loathe. They've been together for like three years, so I just grit my teeth when I see her two or three times a year. My brother teaches a single evening class for college students, and he always invites his international students over to see what an American Thanksgiving looks like. \n\nTwo of his students chose to come. One of them walked in the door and said, \"Oh, shit.\" She and Girlfriend are from the same town in Belarus. And not only do they know each other, they *hate* each other. So they just agreed to sit at opposite ends of the table. \n\nI don't know what went down between them, but I bet it was Girlfriend's fault. Ugh, that woman.",
   "created_utc": 1702489976,
   "score": 5,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7j3m7",
   "message": "I've had quite a few, but my favorite is also part of a (rather passive) life quest. \n\nI was hitching a ride from college campus into town. (quite a normal practice there). The guy who picked me up was just visiting. He had a tattoo on his arm, and when I asked, he explained that he and his 2 siblings have the same tattoo, just slightly altered for each. \n\nA few years later, I move to another city in another state and move in with someone completely random and a stranger from craigslist. Like zero friends in common, he's a decade older than me, etc. \n\nWe start talking about tattoos and I'm halfway through talking about my hitchhiker guy and my roomie's eyes go wide. We figured out that his boss is one of the siblings (like it's a unique tattoo concept). \n\nI feel like if I meet that 3rd sibling I should buy a lotto ticket or fear my life quest is over. It's just wild!",
   "created_utc": 1702490632,
   "score": 5,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7lcwb",
   "message": "Traveled from my home in the Netherlands to Rome Italy by bike in 4 weeks time. Week 2 I met a man in his way to Rome too. Cycled with him for a day or two and after that he took the easier route to Rome whilst I went through Tuscany etc. Arranged to meet up after we both finished in Rome about 2 weeks later. \n\nOn my last day I stopped about it 20km at the point where all roads leading to Rome (no pun intended) hook up. You then follow a bike path straight along the Tiber to Vatican Square. Called GF to let her know  my ETA.\n\nStopped there for 5 minutes tops. I look around to see where I am at and see someone on a bike heading my way. As is common among long distance bikers, I decided to wait for a small chat or something. Turns out, it was the same dude. \n\n2,5 weeks, 1500 km later, totally different route through Austria and Italy and no plans to meet up before finish in Rome, we were just 5 minutes apart on the final day. Mind you, the different day stages are totally different, I had a rest day in between, time of day you start your stage differs everyday etc. I was amazed that that happened. Nice to ride the last few km to Rome together.",
   "created_utc": 1702491458,
   "score": 3,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7uwvx",
   "message": "About a year after starting to date my now husband, his best friend started dating a girl (who he is also now married to. Turns out her parents were really good friends with my parents in university but had parted ways after graduation when my parents left the country. \n\nOur parents have now reconnected because of us, lol",
   "created_utc": 1702494949,
   "score": 5,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7nzqd",
   "message": "I got one for this!\n\nWhen i was 21 I was in the US Army and deployed to Iraq. Instead of going home when my 2 week leave arrived, I decided to stop off in germany and go on a 2 week backpacking trip. \n\nOne night, in Rome,  I left a bar i was in to come outside and get some fresh air and a cig.  I come outside, and ask the first person i see if i can bum a smoke. He turns around and its a guy i graduated highschool with.  He had been there studying abroad. as far as i know the bar i was in was not special or popular. i was only there because it was a part of a pub crawl. Pretty crazy odds. \n\nsmall world!",
   "created_utc": 1702492415,
   "score": 3,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7u63w",
   "message": "I was working in a call center in Arizona. My customer was from Washington. After a few minutes of talking, she mentions she buys antiques and such from Asia and has a bunch in her house. I mention my SIL’s dad owns a huge antique store in Burma. Not only does she know of the store, she has purchased many items and knew her dad by name. \n\nSmall world.",
   "created_utc": 1702494674,
   "score": 2,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7x7cp",
   "message": "Bought a camera at a pawn shop in Anchorage, AK. I came loaded with a bunch of photos. Wanter to get the pics back to the owner, lots of baby pics, so posted an ad on Craigslist.  Guy from Hawaii messages me that he knows the owner. She turns out to be my sister in laws best friend from high school.",
   "created_utc": 1702495785,
   "score": 2,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7y1no",
   "message": "When I was in middle school, I was involved in a huge incident where basically there was a drive-by at my middle school. No one was shot luckily, but I recognized the shooter and when the police arrived, I gave them all the info I could. Well I got attacked later by friends of the shooter for being a \"snitch\" and ended up having to transfer schools. Fast forward 2 decades and of course I have a career now and we are in a meeting talking with some bankers. They ask me if I was local, what high school I went to, basic get to know you things and I mention that I went to 2 middle schools and was supposed to go to another high school. One of the bankers tilts his head looking curious and mentions that he went to my original middle school and asked what years and that he had heard about an incident where a student had to switch schools because of a drive by....to which I was immediately like, \"Yeah! That was me!!!\" Small world.",
   "created_utc": 1702496095,
   "score": 2,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7getc",
   "message": "Meeting someone in New Hampshire that was also born in my small town town in California, Oroville which nobody even knows lol I met this stranger over 10 years ago and I’ll never forget him for that reason",
   "created_utc": 1702489657,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd8ao84",
   "message": "Went to the British Virgin Islands over the summer. 16M, with some friends. We sat at a bar not expecting any drinks. A local Dude next to me strikes up a conversation with the bartender and later found out that he ordered a round for everyone, including us, I explained to him that we are underaged and he said “Oh no, Drink anyway. No Waste” what a chilla",
   "created_utc": 1702501312,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7h0zt",
   "message": "I used a made up name for my social. But oneday I had a roommate with the same name surname.",
   "created_utc": 1702489880,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7maid",
   "message": "Meeting a guy I knew from preschool after moving to another country. I have no clue how he recognised me",
   "created_utc": 1702491798,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7nx1a",
   "message": "I ran into a girl I had a crush on in freshman year of high school, about six years later in a rural village in Asia.  I talked to her, and it was definitely the same person - same name, school, home town, etc. - but she didn't remember me.\n\nEdit:  Another one:  My wife and I were sitting in a bar/restaurant place in Northern Italy, and it turned out the people at the next table were from the same town in the US as us.",
   "created_utc": 1702492388,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7o3ud",
   "message": "Ran to a guy in Oklahoma that was best friends with a guy I was in rehab with in texas",
   "created_utc": 1702492457,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7rpv8",
   "message": "Found out my best friend had dated my cousin and he was her first love. We had been friends for years and she always talked about him. Then one day her mom shares a picture of them at prom and tags his step mom. Crazy thing is, my cousin lived about 1.5 hours from my house. My best friend lived 20 minutes from me. So it’s not like we all lived close to each other. She died before I could ever find anything else out about how they even met. And I haven’t seen that side of my family in years.",
   "created_utc": 1702493779,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7rsf6",
   "message": "I was in Dallas for work and heard my name called out while walking down the street to get some lunch. It was a girl I had gone to church with maybe 15 years earlier. It was pretty wild and we had a good time catching up. She was in town on work, too. \n\nI used to go to Disney World a lot when my kids were little and there are several times I ran into people I knew. My brother and his family (they flew in from 3 states away), the guy that replaced my A/C, even my neighbor, and none of us had any idea the other was on vacation there.",
   "created_utc": 1702493805,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7rwa5",
   "message": "I had a friend in elementary (I wanna say 1st grade) school who moved away and we lost touch. I didn’t even know where she moved. It was the early 90’s so that was pretty typical. Fast forward to freshman year of high school and I make friends with a girl who’s from another state (we were in Southern CA, she was from Idaho.) she had to move back to Idaho after freshman year. About 3-4 years after graduating high school, I comment on my high school friend’s MySpace and then later that day I get a friend request from the long lost girl I went to elementary school with, she grew up with my high school friend in Idaho and saw my comment on the MySpace post and recognized my name!",
   "created_utc": 1702493843,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7sd25",
   "message": "Went through boot camp with a guy I had gone to elementary school with.  Same drill instructor and everything.",
   "created_utc": 1702494012,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7uli5",
   "message": "I knew a guy for an entire year of college before finding out we were cousins. Didn't realize until we were both at a family member's funeral.",
   "created_utc": 1702494832,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7xcgw",
   "message": "Had an online friend for a while in the wrestling community. She lives on the opposite side of the USA from me. I grew up in a small town. I was friends with this girl in middle school who had a little sister. The little sister and wrestling friend ended meeting at the same college across the country. Got a text from my wrestling friend that said “Hey, I heard you know (so and so)! Did you guys grow up together, for real?”",
   "created_utc": 1702495835,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7xt99",
   "message": "My wife (at the time gf) had a small group of women she used to cycle with in our small-ish town \\~65 mi. east of LA. One of the people in the group moved away to Boulder, CO.\n\nCut to a few years later, my wife and I are married with two kids and my brother who lives in the LA area has divorced and remarried, and has a kid on the way. My brother's new brother-in-law, from CO, shows up to their baby shower with his new fiancée in-tow, my wife's former riding buddy.",
   "created_utc": 1702496006,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd7zloq",
   "message": "We met this family on vacation in punta Cana. (We’re from the US and they were from England). The father’s name is Bob and he had this gift to comfortably carry on a conversation despite just meeting us. Over our 10 day trip we became great friends with the family and friended each other on Facebook. About a year later he reached out to us saying our names came up in conversation. Apparently he was on public transport and befriended the woman next to him who happened to go to high school with our group in the USA. What are the chances that my name was brought up thousands of miles from home?",
   "created_utc": 1702496722,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd80gca",
   "message": "My parents were at barbecue at the friends place in Toronto, Canada. My dad, who is super social, hears Irish accents and finds out they are coming from two young women (late teens early 20s). These girls are staying the summer at the house of a neighbour of the host. My mom's sister married a guy from Northern Ireland, so my mom starts talking to them and it turns out these girls are neighbours to one of my uncle's brothers in a tiny town in Northern Ireland. \n\nThe other one is when the dad of a good friend of mine was in the San Francisco airport and went up to a guy because he looked a lot like my dad and it was my uncle. They both flew in for the same education conference.",
   "created_utc": 1702497086,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd84i6o",
   "message": "I met mark labett at a take that musical",
   "created_utc": 1702498948,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd85djj",
   "message": "I met my very first friend in kingergarten, and he was someone I knew for all of a year. Completely lost contact after I had to move schools, and I was 16 when I ran into him again. I had forgotten who he was at that point. We only realized the connection when we flipped through our kingergarten yearbooks. \n\nFast forward through college, where contact with him stopped once again because we had our own lives going on. When I came back home, we quickly became close friends. Now we are celebrating our 4 year anniversary this week ❤️",
   "created_utc": 1702499330,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd865uw",
   "message": "A few years back, I showed my grandmother my report card and she recognized the surname of one of my teachers, as she had a neighbor with the same surname. A few days after that my parents and I went to a meeting in the school and we saw said teacher, we asked him about my grandmother's neighbor and it turns out said neighbor was his uncle",
   "created_utc": 1702499641,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd875dx",
   "message": "Train in NYC opened and I knew the person getting out. Blew my mind since I was just visiting, there are millions of people, and I randomly stopped at that spot. The other person didn't think it was that unusual",
   "created_utc": 1702500010,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd88219",
   "message": "Somehow 3 of my exes ended up going to the same college as me 😃 and even better, we were all in the same classes except for one 😃😃",
   "created_utc": 1702500343,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd886f5",
   "message": "Moved to a new town about 100 miles from where I grew up and quickly befriended a guy who lived a few doors down.  I noticed that his dad had a sticker on his car from a holiday resort in Spain that my family had stayed at a couple of times.  Turns out our families had holidayed there together in 1992 and they had photo of their kids by the pool with my sister clearly visible in the background.",
   "created_utc": 1702500389,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd898o5",
   "message": "Stumbled across a girl from my primary school while on vacation halfway across the world. I come from a village of 2000 people and that class can't have had more than 15 kids in it.",
   "created_utc": 1702500778,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd89dhs",
   "message": "I grew up in Grand Rapids, MI and now live in Wisconsin.  I went on vacation once to Kona, Hawaii and went to a botanical garden there.  I started talking to this couple who was much older than me (I was in my 20's, they were probably in their 70's).  I mentioned I was from Grand Rapids and he asked where I went to school.  I told him and come to find out, he was the principal of my high school long before I attended.",
   "created_utc": 1702500828,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd89jso",
   "message": "My daughter attended a large public university In California. In her junior year she met and became the girlfriend of a fellow student who lived in the same apartment building. Her boyfriend had a brother who lived in another city 200 miles away. The brother’s girlfriend was best friends with the daughter of my first cousin. What are the odds?",
   "created_utc": 1702500892,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd89tfx",
   "message": "Last year of college in 2011 when I was doing my thesis, there was a guy that I really didn't get along with. He came across as very high and mighty and \"I know more than you\". He didn't really care for me either, so we went out of our way to not talk to each other.\n\nI moved to DC, and in the summer of 2012, decided to go see the July 4 fireworks by the National Mall with some friends. Afterwards, it seemed like half the world was crowding towards the nearest subway station. I'm talking easily 100,000+ people. Anyway, so I'm navigating the shoulder-to-shoulder crowd, look to my left, and somehow he's right next to me. Hadn't seen him in over a year.",
   "created_utc": 1702500992,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd8b66h",
   "message": "Sat next to this old lady on a train going to New York. She needed help with her charger. I helped her and we started talking. Shee then strikes up the topic of college. And lo and behold, her son, and my dad went to the same college, graduated same year, and lived in the same dorm.",
   "created_utc": 1702501502,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd8dh8x",
   "message": "While I'm not originally from Mayo due to being born in the UK, my family live in Mayo. Went on a bender in London, barman in a pub on Liverpool street was from Castlebar. 10% off our drinks while we were there. Class.",
   "created_utc": 1702502360,
   "score": 1,
   "submission_id": "18hmee9"
  },
  {
   "comment_id": "kd8dma6",
   "message": "I had this acquaintance I met in college. We had the same major so we had a lot of classes together. We graduated and for a few years, I never saw her. I apply for a job and come to find out, she already works there. After a few years, she quits. A few more years later, I quit that job. My husband and I decide to move 3 hours away. We’re at a Walmart in our new city when I look up and that acquaintance is walking towards me. We’re both looking at each other in shock. She was living in the same random area we were.",
   "created_utc": 1702502410,
   "score": 1,
   "submission_id": "18hmee9"
  }
 ]
}