{
 "submission_id": "18hn951",
 "title": "How did you discover porn?",
 "selftext": "",
 "created_utc": 1702491437,
 "permalink": "/r/AskReddit/comments/18hn951/how_did_you_discover_porn/",
 "score": 23,
 "url": "https://www.reddit.com/r/AskReddit/comments/18hn951/how_did_you_discover_porn/",
 "comments": [
  {
   "comment_id": "kd7ubfp",
   "message": "\\- 13(M)\n\n\\- Dial internet \n\n\\- google \"naked girls\"\n\n\\- get caught because internet history is a thing.",
   "created_utc": 1702494730,
   "score": 101,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7lqhc",
   "message": "Porn discovered me",
   "created_utc": 1702491596,
   "score": 75,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7rqsf",
   "message": "Some of the kids in school were talking about it",
   "created_utc": 1702493788,
   "score": 32,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7rcnb",
   "message": "[deleted]",
   "created_utc": 1702493644,
   "score": 25,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7og1e",
   "message": "HBO and Cinemax when the signal was scrambled, but the audio came through just fine and occasionally the scenes would be clear enough to let your imagination fill in the blanks",
   "created_utc": 1702492581,
   "score": 20,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7r2pn",
   "message": "I used to watch strip teases on YouTube and graduated to porn",
   "created_utc": 1702493543,
   "score": 18,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7owp7",
   "message": "I went to a sleepover. Friend fell asleep at like 5 am but I insisted on pulling an all nighter. Opened her iPod touch cuz she had one and I didn’t and she always let me use it whenever I came over. It was really cool. \n\nAnyway, I open the iPod touch and bam. There’s porn. I guess that explained her last trip to the bathroom. \n\nThat pretty much it. \n\nI think what I proceeded to do was too NSFW to mention here. But you get the idea.",
   "created_utc": 1702492750,
   "score": 12,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7lkll",
   "message": "Searching for a new route to India, China, Japan and the Spice Islands",
   "created_utc": 1702491536,
   "score": 31,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7m9lt",
   "message": "Playboy's in my dad's top drawer when I was.....far too young.",
   "created_utc": 1702491788,
   "score": 9,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ns7c",
   "message": "I spelt a website wrong 😂 (genuinely)",
   "created_utc": 1702492339,
   "score": 8,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7v173",
   "message": "Holy shit this reminds me when i was like 11-12 I used to masterbate over the underwear section in woman's clothes catalogues 😆",
   "created_utc": 1702494994,
   "score": 8,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7logs",
   "message": "It sounds cliche and made up, but and friend and I actually found a Hustler in the woods near the high school.",
   "created_utc": 1702491575,
   "score": 15,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7u6bc",
   "message": "My Mormon friend showed me. No joke",
   "created_utc": 1702494676,
   "score": 6,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7rdpj",
   "message": "there was an ariana grande parody that had ‘redtube’ in it 12yr old me didn’t know what that was. thought i might be a cooler youtube. it was not.",
   "created_utc": 1702493654,
   "score": 5,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7vynl",
   "message": "Newgrounds and Wetpussygames.com 👍",
   "created_utc": 1702495335,
   "score": 6,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7y2pw",
   "message": "Honestly accidentally.\n\nI was 13 and for some reason I was curious why cartoons marked alcohol as \"xxx\" and of course I didn't specify alcohol, I only typed xxx in google and... the rest is self explanatory",
   "created_utc": 1702496106,
   "score": 5,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd839kh",
   "message": "It's a funny story actually. When I was in 3rd grade my friend would point out anything that looked like a butt or penis and we would laugh hysterically. One day I was sitting at the table with 4 people (3 boys 1 girl) for a group assignment. My friend drew a penis on his assignment and we laughed, the girl looked kind of disgusted but laughed as well. Later that day it just dawned on me how'd she know what penis looked like? It also made me wonder if I knew that a vagina looked like. I mean...I knew it was called a vagina so I had to know what it looked like right? But the more I tried to visualize it, the more my mind drew a blank. So finally I made the decision to just Google it. Let me tell you the results horrified me, Google showed me the whitest prostitutes with the reddest vaginas that I have still ever seen to this day, might I add none of them had lips either. I genuinely thought I was gay after seeing those images. Despite my horror I was really curious as to how women could do anything with that wound in between their legs so I went to back to the web and clicked on the one of the links that took me to my first porn website where I would very quickly learn that I was in fact not gay, and that those images were in we're not at all a accurate representation of the average vagina. So yea that's how I discovered porn for the first time.",
   "created_utc": 1702498367,
   "score": 6,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7rabt",
   "message": "I had a friend in preschool that introduced me to it, my first one was a parody of snowwhite and the seven dwarfs don’t ask me why I remember, this was almost 13 years ago",
   "created_utc": 1702493621,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7rn7s",
   "message": "In the 80's it was fairly common to come across a stash of magazines in the woods or some kind of abandoned building or shed.  Decorum dictated that you may browse the selection of periodicals at your leisure but you left them there for the next person to enjoy.",
   "created_utc": 1702493752,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd829kg",
   "message": "Im so old we got porn the old fashioned way when I was in grade school. From dumpsters where the wives had thrown their husband’s stash.",
   "created_utc": 1702497902,
   "score": 4,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7mmgx",
   "message": "impossible to avoid hearing about it while growing up, tbh.",
   "created_utc": 1702491918,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7w4w2",
   "message": "A friend dared me to Google boobs in middle school",
   "created_utc": 1702495397,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7y4tk",
   "message": "The really weird train obsessed kid in 7th grade was renting out his dads VHS porn collection. Catholic school in ‘98 lol",
   "created_utc": 1702496129,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ytv6",
   "message": "Ahhh Mann… I was the biggest wwe fan as a kid. I remember it vividly, it was wrestlemania 22 ppv night! I was in 3rd grade at the time and I didn’t know that I was paying to watch honestly. Needless to say, when wrestlemania finished, I discovered what ppv was really for. Let’s just say I paid for about 300 dollars worth of ppv porn after I discovered what it was. curiosity killed the cat and got me a major ass whopping when my mom found out. Ps. porn titles were as ridiculous back then as they are now.",
   "created_utc": 1702496405,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7z8u0",
   "message": "Girls Gone Wild commercial on Adult Swim and Playboy magazines being sold in gas stations when I was a kid. This then lead to the \"discovery\" of realizing you can Google anything.\n\nLate early 2000s was an interesting time.",
   "created_utc": 1702496574,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd83rzd",
   "message": "summer school after 5th grade, a kid 1-2 years younger than me told me about a hentai website and recommended and talked about a specific video as if it were normal entertainment. I had never even watched anime before that point but that got me into porn.",
   "created_utc": 1702498607,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7miie",
   "message": "Just like how I like my eggs,\n\nscrambled.",
   "created_utc": 1702491879,
   "score": 6,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7nu5n",
   "message": "What's porn?",
   "created_utc": 1702492361,
   "score": 3,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7p8dz",
   "message": "13 year old me found the sports illustrated swimsuit magazine sent to my dad by mistake, and for some reason I was really interested in it. The rest is history.",
   "created_utc": 1702492869,
   "score": 2,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7pq96",
   "message": "When I was about 8 or 9, my friend and I were on her computer, and I think we were on some website trying to find flash games. Well, on the sidebar, there was a nude woman, and we wanted to see what on Earth that led to. So we clicked on it, ended up on youporn. And my life would never be the same.",
   "created_utc": 1702493050,
   "score": 2,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7thmh",
   "message": "I don’t even remember. I think I had some delinquent, skater friends introduce me when I was like 9 or 10. I didn’t have a father figure to learn from either so I think it really tarnished how I built relationships with girls in the following years.",
   "created_utc": 1702494425,
   "score": 2,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7uidb",
   "message": "When my dad got cable installed in 1992 or 1993, the adult channels were scrambled until 10pm. 8 year old me snuck downstairs to watch TV on volume 1 at like 2am one day and was surfing through the channels and came across T\u0026amp;A and was mesmerized. A pretty typical way to discover porn for my generation.",
   "created_utc": 1702494800,
   "score": 2,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd863f7",
   "message": "Late night tv when my parents were asleep.",
   "created_utc": 1702499615,
   "score": 2,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7uw9l",
   "message": "Molested as a child and introduced..",
   "created_utc": 1702494943,
   "score": 2,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7z8z3",
   "message": "I looked up your mother's name on the internet.",
   "created_utc": 1702496576,
   "score": 2,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7uumo",
   "message": "I grew up fundamentalist Christian. At the age of 12 I was trying to google a theory I had heard at church about how the structure of hands and feet disproved evolution (really dumb, I know). I searched “evolution hands feet not true” and one of the search results was a video on pornhub. So in my quest to be a good little Christian I ended up watching porn for the first time haha",
   "created_utc": 1702494926,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7vpko",
   "message": "Many years ago someone shows me and instantly I become an addict 🫤",
   "created_utc": 1702495243,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7paaz",
   "message": "[deleted]",
   "created_utc": 1702492888,
   "score": 255,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7lg8v",
   "message": "Google was invented",
   "created_utc": 1702491493,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ms7c",
   "message": "Ads 😝",
   "created_utc": 1702491975,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7mxhb",
   "message": "When I first discovered how to wank",
   "created_utc": 1702492029,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7nglf",
   "message": "desibaba.com was popular back then in school. checked it out. Got entangled in the web of pornography.",
   "created_utc": 1702492223,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ovbb",
   "message": "I just typed some stuff on Google when I was younger",
   "created_utc": 1702492736,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7qjdw",
   "message": "Buddy came back from a European vacation with a double-length VHS. The whole crew of 11 year old boys spent all summer passing that thing around",
   "created_utc": 1702493346,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7r6n7",
   "message": "Google images",
   "created_utc": 1702493583,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7rmtf",
   "message": "Newgrounds",
   "created_utc": 1702493748,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7tc3f",
   "message": "By reading this post",
   "created_utc": 1702494369,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7tjs0",
   "message": "Searched boobs in google",
   "created_utc": 1702494447,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7tonk",
   "message": "Magazine named after my name",
   "created_utc": 1702494497,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7tupm",
   "message": "Hustler magazines. Good times…*goooood* times….!",
   "created_utc": 1702494559,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7tvmm",
   "message": "By just being curious about pussy ig?",
   "created_utc": 1702494568,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7tz8h",
   "message": "There were tv channels that would broadcast some random stuff or literally nothing during the day, and usually around 11pm they would start broadcasting porn. My first was some kind of sex toy review made by some French porn actors. 😄",
   "created_utc": 1702494605,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7u8r8",
   "message": "Unsupervised 5yr old me on my very unresponsible dad's phone",
   "created_utc": 1702494701,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ubdf",
   "message": "I heard the word “porn” and asked what it meant, so it got defined for me",
   "created_utc": 1702494729,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ubjp",
   "message": "Typed in biggest boobs while home from school.\n\nEnded up finding Mason Moore and finding out what squirting was.\n\nHaven't been the same since.",
   "created_utc": 1702494731,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ue8r",
   "message": "11 year old me was curious and searched it up to see what it was lol",
   "created_utc": 1702494757,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7uz0z",
   "message": "3rd grade, my friend slept over and we made big plans to check out some stuff on the old home computer when everyone went to bed, because he knew a site. So we waited everyone out but renting Little Nicky TWICE on pay-per-view (I got a talking to about that). \n\nWhen all had settled down, we got on to the site he knew about. It was mostly stuff like sex on/near sports bikes, cool cars, and just pictures of naked women. We were having a great time when the computer froze on big picture of some really big boobs. We panicked for a second, until I realized I could just hard-restart the computer and it should be gone, so I turned off the monitor and we gave ourselves a pat on the back for dodging a bullet. \n\nThe next morning, the friend, got up and kept saying he was sick, he needed to go home. His mom got to our house JUST as my mom turned her monitor on and figured out when we had been doing. So I got my ass busted and my friend got to go home, Scot-free! I’m no rat, so I just took it on the chin and then didn’t really pursue it again until, like, junior year of high school. \n\nSo yeah, it went great.",
   "created_utc": 1702494971,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7v27y",
   "message": "before we had internet, brother had few cds hidden in his clothing pile - some italian tropical something lol",
   "created_utc": 1702495005,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7v69f",
   "message": "A classmate in high school science class sold playboys for $15. Internet porn on auto shop class computer.",
   "created_utc": 1702495046,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7v8pw",
   "message": "Woods porn",
   "created_utc": 1702495071,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7vdnc",
   "message": "I sometimes walked home from school (just over a mile down an A road)\n\nNear a layby, I decided to nip in some bushes for a piss and found what must have been a lorry drivers stash. \n\nI was late home from school that day. 😂",
   "created_utc": 1702495122,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7vk9g",
   "message": "sex.com",
   "created_utc": 1702495190,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7vxjm",
   "message": "GTA 5",
   "created_utc": 1702495324,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7wd8y",
   "message": "When I was in 5th grade, my teacher had us do an assignment on historical cities. We were supposed to research information on them and present our research. I was given Pompei as my city, and when I looked it up in the library, it was the biggest blackest tits I ever saw. I immediately closed it out and tried again, same thing. I told my teacher, and this fucking cunt got me suspended for looking at porn at school.\n\nI don't know why, but I had to see it again, so when my mom was at work, I jumped on the computer and spent all day looking at the pictures and learning the porn slang. Then I started combining words, and there was stuff for it. \"Petite Asians with big tits\", \"Jewish girl giving head for chanukah\", anything at all I put, there was something for it.\n\nMy mom never learned how to block websites, so she decided to take me to work with her from then on. Too late, the damage was done. My mind was fucked from then on.",
   "created_utc": 1702495482,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7wgte",
   "message": "Kid next door showed me his dad's Playboy collection, but I was in grade 2 (he was in 3) so it wasn't very effective. I read the articles instead and discovered that Bowie and Jagger were bisexual, my first exposure to such things.",
   "created_utc": 1702495518,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7wikk",
   "message": "Looking for a ball that got kicked into the woods...got kicked into the woods pretty good...",
   "created_utc": 1702495534,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7woms",
   "message": "Found my dads porn stash when I was 8",
   "created_utc": 1702495595,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7wq7i",
   "message": "When I was about 11-12 I typed in naked women on my mom’s computer and surprise surprise photos came up",
   "created_utc": 1702495611,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ws9x",
   "message": "My brother left his search terms in the Kazaa search history.",
   "created_utc": 1702495632,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7wyrt",
   "message": "I was 7 or 8 and I googled \"how to draw Goku.\" the first website definitely had Goku, but did NOT show me how to draw.",
   "created_utc": 1702495698,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7wz5k",
   "message": "I was actually Google searching for dragon ball z when I was younger and to my surprise that’s not what I found",
   "created_utc": 1702495702,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7x9qx",
   "message": "tourpic7.jpg",
   "created_utc": 1702495808,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7xff6",
   "message": "My dad conveniently left a video tape with 3 hours worth of girl-on-girl action out. He even drew attention to it be explicitly telling me not to watch it",
   "created_utc": 1702495866,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7xfrc",
   "message": "Life uhhhh...found a way",
   "created_utc": 1702495869,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7xjsu",
   "message": "some of the boys in my class would joke about watching horse porn and so on. I knew they were talking about sex but I wasnt sure on how it worked so out of curiously I googled it on my grandpa’s laptop and began watching it everyday after school.",
   "created_utc": 1702495911,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7xkad",
   "message": "Looked behind the book shelf to find my dad's stash. Black cock in white hole. Back door betties, and a whole lot of bondage magazines.",
   "created_utc": 1702495916,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7xr0p",
   "message": "Googled “Naked Girls”\n\nFirst link was Damplips .com",
   "created_utc": 1702495983,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7xs3q",
   "message": "I meant to look up Julius and friends because I loved Paul Franks monkey character…but wrote another name by accident and it was a porn site.",
   "created_utc": 1702495994,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7y4xk",
   "message": "Vietnam flashbacks...",
   "created_utc": 1702496130,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7y6kq",
   "message": "When I was in my pre-teens I was looking around in our \"tack room\" (read: room where we keep a bunch of horse tack and other stuff), and found an old issue of Penthouse.\n\nThat sucker inspired a lot of .... uhhh dexterity exercises.",
   "created_utc": 1702496147,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7y7g1",
   "message": "I friend told me about it when I was in 6th grade.",
   "created_utc": 1702496157,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ybkq",
   "message": "Found my dads stash of playboy magazines when i was 11",
   "created_utc": 1702496203,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ybpg",
   "message": "My father had a VHS collection in the basement.",
   "created_utc": 1702496204,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7ycg3",
   "message": "My friends sister showed me one night at a sleepover. My friend was fast asleep in the same room and she loaded up a pretty intense anal scene and we watched together for a while. Not even in a sexual way which made it weirder.",
   "created_utc": 1702496212,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7yfr5",
   "message": "Brother’s bedroom, looking back I’m a bit disappointed in my mom’s judgment. My brother was 17 or so at the time and he had a stack of porno’s just sitting on his DVD shelf out in the open. My mom never had an issue with it for whatever reason so naturally one day I had some alone time when he was gone, I put one of those DVD’s in and I fell in love immediately. I was like 7 or 8 at the time… way too young to have access to something like that. I was only curious about it because of the DVD’s being out in the open like that.",
   "created_utc": 1702496249,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7yix8",
   "message": "My cousin, who was being molested and groomed by his much older teen cousins who introduced him to porn and toys. He literally got the magazines and videos he showed me from them.",
   "created_utc": 1702496283,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7yrcb",
   "message": "It was a YouTube ad",
   "created_utc": 1702496376,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7yrmh",
   "message": "Thought it would be funny to look up \"buttcheeks.com\" it's been like 12 years u have no idea what that site is now",
   "created_utc": 1702496380,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7yudu",
   "message": "Reading the Guinness Book of World Records and the record for number one word searched on Yahoo was \"sex\".",
   "created_utc": 1702496411,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7yvx1",
   "message": "Late night adult movies on TV.",
   "created_utc": 1702496429,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7z9kz",
   "message": "Accident. My aunts ex was a movie bootlegger so i was use to picking up blank vhs tapes and finding 3 or 4 feature length movies on it. They would always be in a crate or a cardboard box. Pagemaster, Land Before Time, Never Ending Story, etc. One day i was playing hide and seek with siblings and cousins, and i hid in my mothera closet. There was a small box of VHS tapes. I didnt take any of them at the time i just took a mental note they were there. One day later probably a year or so, i remembered them, got curious, porn.",
   "created_utc": 1702496583,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7zeif",
   "message": "In the early 80s, VHSs were just beginning, and the most available form of porn by far were magazines. One day me and some other neighborhood kids were walking down some dirt road, and one of the other kids spotted a stuffed envelope thrown into the bush (pun intended?). Turns out it was the motherlode (ok that's enough!), about 10 to 12 hardcore mags. A true treasure trove.",
   "created_utc": 1702496637,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7zlan",
   "message": "Gone to mini theatre to watch random movies but fortunately projector controller played a glance of it.",
   "created_utc": 1702496718,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7zltw",
   "message": "Dad's penthouse mags under the towels in the bathroom.",
   "created_utc": 1702496724,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7zp8g",
   "message": "I don't remember when I first saw gay porn, but when I first saw straight porn was when the son of my moms boyfriend showed me where his dad stored his porn. I don't think we watched it, but the conver was interesting lol\n\nI remember when I first watched porn was with a cousin as we were house sitting for my uncle. Nothing happened, we just sat there and watched it until it was done and didn't say anything about it to each other.",
   "created_utc": 1702496764,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7zphn",
   "message": "My friend when I was like 10 was into cars and he got told from an older kid to look up a 'mercedes ambrus' . Then that kid chuckled when he hit enter",
   "created_utc": 1702496767,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd7zzp5",
   "message": "A random box of VHS tapes on the top shelf of a cabinet in the laundry room.",
   "created_utc": 1702496887,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd80bw7",
   "message": "age of 10 (14 years ago)\n\ni had pc and my cousin (15) wanted to play Generals (RPG game) but i didnt want him to play so he had a deal with me \n\nhe showed a porn in a old mobile (sony ericsson) to me and said \"go to bathroom and by watching this play with your penis\" and you know the rest",
   "created_utc": 1702497031,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd80ew4",
   "message": "Typed in 'boobs' in Google after a friend told me that the penthouse magazine I found at the bus stop was nothing and porn was better. I asked him how to get porn and he told me I could search horny words in a search engine called Google.\n\nThat happened yesterday.\n\nJoke, I was 13.",
   "created_utc": 1702497068,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd80lih",
   "message": "I searched “xxx”",
   "created_utc": 1702497149,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd8188x",
   "message": "I discovered it in 2nd grade when a friend started talking about his brother's playboy (this was around 2002). Went home and googled playboy and it went from there. Also how I realized I was gay.",
   "created_utc": 1702497432,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd820g4",
   "message": "Funnyjunk.com in the early 2000's, lol. Took forever to load, wasn't supposed to be there anyway.",
   "created_utc": 1702497785,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd82mdj",
   "message": "Scrambled playboy channel",
   "created_utc": 1702498066,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd83joe",
   "message": "Oddly enough started with fetish porn, I was searching up \"women in opera gloves\" and after enough scrolling got (almost) naked women and BDSM",
   "created_utc": 1702498497,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd842mv",
   "message": "7 male\nA really fucked up friend decided to share some of his fucked upness with me nough said",
   "created_utc": 1702498748,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd84xx8",
   "message": "I remember in the second grade, I would Google pictures of naked women, and it eventually led to links to porn sites",
   "created_utc": 1702499149,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd852vi",
   "message": "When I was 9 I was like “ha! Boobies!” And looked it up and was like “what the frick is this?”",
   "created_utc": 1702499207,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85aok",
   "message": "‘how to have sex on a plane’ (i think it was called that) on youtube then i looked it up on google and found porn",
   "created_utc": 1702499298,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85day",
   "message": "At age 6 I stumbled on it on my uncle's computer, it lead terrible consequences.",
   "created_utc": 1702499327,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85f15",
   "message": "Like everyone else with my uncle in his basement",
   "created_utc": 1702499347,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85gaf",
   "message": "Unrestricted internet access and sonic the hedgehog",
   "created_utc": 1702499361,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85hk6",
   "message": "2nd grade, we had a cable hot box. The unscrambled ppv channels played the playboy channel from midnight to 6 am. I was an exceptionally early riser went to the movie channel saw a Bonnie and Clyde themed porn. Been a big fan of boobs ever since",
   "created_utc": 1702499375,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85ljk",
   "message": "Depends on your definition of porn.\nI was a child in the pre-internet era.\nIf it’s just Playboy type stuff then I found a couple Playboys of my dad’s hidden away when I was 8 or 9.  Awesome seeing women’s nekkid bodies.\n\nHardcore porn?  I was 13 I think. I slept overnight at my friend’s house. While his parents were out for 3 or 4 hours he popped one of their VHS porn tapes into the VCR. Looking back, it may have starred the late Savannah, but not sure",
   "created_utc": 1702499419,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85nyo",
   "message": "Browsing the internet and saw an add for it.",
   "created_utc": 1702499445,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85ozh",
   "message": "discord. i joined a discord server with a +18 chat and said i was +18 lol i wasn't.",
   "created_utc": 1702499456,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85p9v",
   "message": "Pre-internet when I was young so it was the old fashion way. We had boxes of junk in the basement filled with things like screws and old books and all sorts of random stuff. I needed a part so I was digging thru the boxes. Found my dad's magazines at the bottom of one.",
   "created_utc": 1702499459,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85s75",
   "message": "When I was a kid, we used to have those A/B switches for cable tv. I was looking for HBO, but I came across [this movie (semi-NSFW)](https://www.youtube.com/watch?v=2BB55ac7dUo) instead. I thought I was watching some hollywood movie release I never heard of and boy was I in for a surprise.",
   "created_utc": 1702499491,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85shm",
   "message": "HBO after dark",
   "created_utc": 1702499495,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd85xf9",
   "message": "Friends. I thank them so much",
   "created_utc": 1702499549,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd861x0",
   "message": "Was looking for my Iron Maiden album in my big brother's room. Found something else.",
   "created_utc": 1702499599,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd864ve",
   "message": "When I was 12, my friend brought one of his older brothers porno mags over. We stashed it at my house under the boards under my mattress. Him and I wanked off all summer to that book. Great memories!!!",
   "created_utc": 1702499631,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd867j0",
   "message": "i (male) discovered it really late when i was 14 on a vacation trip just with the boys and one of them was showing me some gifs from a discord server. i actually knew about pornhub before but i never tried before shortly after that trip.",
   "created_utc": 1702499659,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86asp",
   "message": "Discarded VHS tapes under a bridge",
   "created_utc": 1702499693,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86fb3",
   "message": "8mm films and projector my dad tried to hide",
   "created_utc": 1702499740,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86k8l",
   "message": "Saw porn or nude women in a movie I watched. Got more invested from there",
   "created_utc": 1702499790,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86mgu",
   "message": "Under a fucking bush in the park like a normal person",
   "created_utc": 1702499813,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86prg",
   "message": "8 years old. Hanging out at a friend's house. Flipping channels. One was fuzzy and had weird sounds. Buddy says, \"it's the playboy channel. It comes in clear in my parents' room.\" So we went to his parents' room to watch. His parents were downstairs, oblivious. He also had stolen his father's collection of hustler magazines.",
   "created_utc": 1702499847,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86pxc",
   "message": "I discovered it from pirate websites, like free movie sites and my friend told me about it 😔",
   "created_utc": 1702499849,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86q8q",
   "message": "It was badly hidden in some bushes.",
   "created_utc": 1702499852,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86s4x",
   "message": "on my wii browser",
   "created_utc": 1702499872,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86uwm",
   "message": "Playboy magazine under the couch as a kid",
   "created_utc": 1702499902,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86whu",
   "message": "Scoutmaster passed it around.",
   "created_utc": 1702499918,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86yea",
   "message": "Overwatch",
   "created_utc": 1702499938,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd86zuq",
   "message": "I once got a VHS with porn on it. Wasn't able to ever find this porn on the internet afterwards.",
   "created_utc": 1702499953,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd872zn",
   "message": "If any of you kids want to know how hard it was to see porn pre-internet, here are a few memories:\n\n-Me and a friend find a giant tupperware full of playboys under his dad's bed, we grab one, take it into the crawl space and check them out, at age 7 it's compelling but confusing. I distinctly remember a standing nude man with a nude woman backing her ass up into his crotch area, and I think he was holding a cooking pot for some reason.\n\n-In 7th grade we got a VHS porn tape from my friend's older brother, it labelled \"Jurassic Park.\" It was scenes from the 70s-80s and I cant tell you how many people passed that thing around, it was like gold. I remember people taking turns whacking in my friend's basement when his parents were at work. \n\n-First experience with internet \"porn\" was not long after, it took like 2 days to download 10 pictures of Jenny McCarthy.",
   "created_utc": 1702499985,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd8743x",
   "message": "Through my crazy friends who sent pictures of the porn sites on discord for some reason",
   "created_utc": 1702499997,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd874ew",
   "message": "I was 11 or 12.... back of the school bus. A friend a grade higher than me slipped me a dvd with anime porn on it. I was curious so i took it home and watched like 5 mins. I remember being pretty grossed out by it. Gave it back the next day and said it was \"ok\"",
   "created_utc": 1702500000,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd874hp",
   "message": " \\* opens google\n\ntypes boobs\n\nand there we have it",
   "created_utc": 1702500001,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd875nz",
   "message": "I don’t remember my exact age, but I was young. Maybe 10? \n\nI had a group of friends on the Xbox 360 to play Gears of War with. If I had to guess, they were maybe 15-17 years old? They might’ve been a little younger, but they were definitely older than me. \n\nOne day, one of the guys asked me if I’ve heard of “YouTube” and I said of course. He then asked me if I’ve heard of “RedTube”. I obviously said no, and he told me to look it up next time I get a chance. \n\nI had a pretty strong indication it was Porn, but I had to confirm and I did.",
   "created_utc": 1702500013,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87cwh",
   "message": "Through my mother’s phone,I just picked her phone to check up some pictures in here gallery and suddenly saw something Iike a nude and couldn’t believe what I saw but she caught me and told me not to touch her phone again,but I was amazed by it",
   "created_utc": 1702500086,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87hpu",
   "message": "In the bushes, like everyone else I knew.",
   "created_utc": 1702500136,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87lzi",
   "message": "some kid at church camp lmao",
   "created_utc": 1702500180,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87nx3",
   "message": "I'm gonna attempt to do this in green text because why not\n\n\u0026gt;\u0026gt;Be me\n\n\u0026gt;\u0026gt;5\n\n\u0026gt;\u0026gt;Play Roblox\n\n\u0026gt;\u0026gt;Join a game\n\n\u0026gt;\u0026gt;The skybox is henti\n\n\u0026gt;\u0026gt;I wanted to look at it but I was playing with my sister",
   "created_utc": 1702500199,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87o40",
   "message": "This is one kid, Ryan you legend, show all of my friends and I a website called pinkworld in like 5th grade.  I think his older brother showed him. More fun tho was learning how to jack off to Pants Off Dance Off!",
   "created_utc": 1702500201,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87rhd",
   "message": "I read about it on the news and got curious",
   "created_utc": 1702500236,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87rz6",
   "message": "Parents left it on the cable channel at night and in the morning I was not watching my usual cartoons",
   "created_utc": 1702500241,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87t1a",
   "message": "Think the first time was an empty cardboard box for so vhs tape in my parent's closet. There was also the time I found hentai in the browser history of the family computer.",
   "created_utc": 1702500252,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87uzb",
   "message": "i must have been 12 or 13 when opie and anthony were a thing and had did WOW Wednesdays. \n\ni had my own computer in my room and i looked up their wedsite and girls would send in pictures of their boobs and people would vote. I did not know i was going to find pictures of randoms girls boobs on their wedsite but i thought to my self what else is on the internet and holy hell did i find out haha",
   "created_utc": 1702500272,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87vh3",
   "message": "i must have been 12 or 13 when opie and anthony were a thing and had did WOW Wednesdays. \n\ni had my own computer in my room and i looked up their wedsite and girls would send in pictures of their boobs and people would vote. I did not know i was going to find pictures of randoms girls boobs on their wedsite but i thought to my self what else is on the internet and holy hell did i find out haha",
   "created_utc": 1702500277,
   "score": 1,
   "submission_id": "18hn951"
  },
  {
   "comment_id": "kd87z62",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18hn951"
  }
 ]
}