{
 "submission_id": "18hoi55",
 "title": "What’s your worst drug experience?",
 "selftext": "",
 "created_utc": 1702494638,
 "permalink": "/r/AskReddit/comments/18hoi55/whats_your_worst_drug_experience/",
 "score": 14,
 "url": "https://www.reddit.com/r/AskReddit/comments/18hoi55/whats_your_worst_drug_experience/",
 "comments": [
  {
   "comment_id": "kd7uh87",
   "message": "Dmt. Never again. I watched as the mountains on the horizon begun to shift in one direction and the land underneath shifted into another dimension. The trees became taller and thinner until they were strings and I had to swap to manual breathing mode while trying to focus on just surviving",
   "created_utc": 1702494788,
   "score": 9,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7wds9",
   "message": "OD'd on opiates. Could feel myself slipping away and my body going numb. Forced myself to sit up and projectile vomited everywhere \n\nAlso passed out outside on two separate occasions while being high on opiates and chain smoking like 5+ cigarettes. The first time I scraped my chin, second time I fucked up my hip.\n\nOh, and I've disassociated every time I've smoked weed. Very disturbing and uncomfortable.",
   "created_utc": 1702495487,
   "score": 4,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7v76s",
   "message": "I was at a house party once, and some dude tricked me into taking ketamine. He told me it was cocaine.  \n\nThe 7/8 hours that followed were really, really unpleasant. I puked in regular 5 minute intervals for a while, until I had nothing left to puke. After that, I continued to dry heave/gag still.",
   "created_utc": 1702495055,
   "score": 5,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7wa24",
   "message": "Salvia. Nothing made sense and it felt like an eternity",
   "created_utc": 1702495449,
   "score": 3,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7wq9k",
   "message": "Dabs. Fuck that! That’s way too much! Never again.",
   "created_utc": 1702495611,
   "score": 4,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7ub67",
   "message": "Projectile vomiting, paranoia, and optical hallucinations caused by morphine after a botched arthroscopy",
   "created_utc": 1702494727,
   "score": 2,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd88d4w",
   "message": "Weirdly, weed. In my late 20s - after a good 10 years of smoking - I had a full blown psychotic episode. Scariest thing that ever happened to me.\n\nMy dumbass thought it was a bad batch so I switched to a more reputable dealer and tried again. This triggered another episode and I ended up in a psych ward for two months. Thankfully I can't remember much of it.\n\nMoral of the story is - don't smoke if you have a family history of psychosis or schizophrenia. Doesn't matter if you have a few good experiences or years' worth of them, that shit can sneak up on you. I was very VERY lucky to make a full recovery and haven't touched the stuff since.",
   "created_utc": 1702500459,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd8a7yu",
   "message": "When I didn’t have any..",
   "created_utc": 1702501141,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7xar3",
   "message": "Weed. It causes me extreme anxiety and paranoia, except in microdoses. That’s not even worth it.",
   "created_utc": 1702495818,
   "score": 3,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd8294y",
   "message": "I used to be really into experimentation in my late teens. I'd take anything I could, took some crazy doses, mixed stuff etc. \n\nI loved taking Magic Mushrooms, nothing but great experiences, I even took around 6 or 7 grams in a single evening at one point.  \n\nOne day me and my buddy wanted to take a trip, took us hours to find someone with stuff. It was a \"my buddy knows a guy who knows a guy who knows a guy\" situation. We took 2 grams each of the weirdest looking shrooms I have seen. \n\nThe start of the night was great, everything was magical. The took our jobs episode of South Park was on. We were dying laughing, bouncing off each others energy and just steadily getting higher and higher. \n\nThen my buddy had to leave, he had work in the morning. For the next hour or so things were great, but the intensity of my high just kept growing. The vibrancy of colour started to radiate through the objects they belonged to. They borders of everything started to bind together, twisting and distorted. The world before me became this rough patchwork quilt of strung together objects. Depth of perception completely disappeared, everything was right in front of me whether something was across my bedroom or a foot away it all was immediately inches away from my eyes. \n\nSensory overload with no escape is torture. It felt like reality was being presented to me through a constant barrage of grenades. When I closed my eyes things just amplified. I put myself under my covers and tucked myself into the corner of my bed. It felt like the blanket saran wrapped over me and bound me in place. \n\nSuddenly, and this part was kind funny these spinning technicolor gifs of $ signs and weed leaf's began to appear, looking like one of those tacky old selfmade Angel Fire sites from the early 2000s. Drop it like it's hot started to play (This was late 2004 and that song was fucking HUGE when it came out). Snoop dog scrolled down from the top of my vision doing the dance from the video, he told me not to worry and that it's just the \"Shromizzle Dizzles\" and I said to myself \"Thanks snoop dog\". He flew off and everything just faded out, the sound of my T.V became distant. The vibrant closed eye visuals slowly dissolved into black. My tactile sensation of the blanket pulling down on me disintegrated. \n\nAt this point I experienced what can only describe as ego death. There was nothing, I was nothing. I was no longer some kid trying to muscle his way through a bad trip, I was just an empty vessel. I was a glass of water tipped over with its contents poured out. My face turned in an eroding cliff front on the shores of an empty endless lake. I walked out of my eye down to a boat and rowed out into the infinity. Eventually I lost vision of the shore. I was incapsulated by a pale blue cloudless sky that seemed to merge on the horizon with the tranquil calm waters. I just sat there existing for the longest time, I didn't even remember I was on shrooms. In reality I was just some kid balled up on his bed with a comforter over his head, but I had absolutely no connection to that person. \n\nEverything went dark again, I began to float. In a blink the endless black void glittered with all the stars in the universe. At it's center this great vibrant shimmering Octopus. It would gently roll out it's tentacles grasping galaxies at a time, gently reel them in and let them float away anew. \n\nSuddenly I understood everything. I had what to this day feels like the most profound thought I have ever had, despite it being completely nonsensical horseshit.\n\n\"We are all just pie cooling on a window sill\" I don't know what the fuck that means. But it somehow gave me overwhelming catharsis. I shot up in my bed, it had been several hours, I am assuming I slept for a bit. Everything was still strange and alien but I had come to accept it as my current reality. \n\nFamily guy was on the T.V, I remember standing feet away from it trying to watch. My T.V screen had turned into one of those jumble puzzles with one open square that you have to move the pieces around to create an image. I was having a blast doing this, I'd move the pieces with my mind and after a few short seconds of clarity, the grid would scramble again. Next thing I know it's 10 am and I had fallen asleep on my bathroom floor. My buddy sent me a bunch of msgs on MSN, he had an equally terrible time.\n\nEver since then I haven't been able to do drugs without getting massive flashbacks. As much as the experience fucked me up, I don't regret having it, it taught me how completely false and a fragile perception really is.\n\nTLDR: Got really fucking high and saw snoop dog.",
   "created_utc": 1702497896,
   "score": 3,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd82rsn",
   "message": "Alcohol and it's not even close.  I don't mean one time getting drunk either.",
   "created_utc": 1702498137,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7ww4o",
   "message": "methamphetamine. \n\nkind of tweaked when i took too much for 4 days straight, felt like i was floating and thought i was having a stroke. Went to reddit to read experiences from people then leading to articles about stroke. Didnt notice the time and i was reading about stroke for 6 hours. Had somatic symptoms, went to the ER and got admitted in their psych ward.",
   "created_utc": 1702495672,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7xlyy",
   "message": "K2 honestly. Smoked some cheap stuff before I went to a job, the world turned bright yellow. Had to curl up in a ball with my hands jammed into my eyes, and just wait for everything to go back to normal.",
   "created_utc": 1702495933,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd7yf44",
   "message": "I smoked PCP laced weed once. \n\nDidn't know until much later that was what is was. But it left me huddled in the corner of my kitchen, covered in sweat and I drank 10 diet Cokes.",
   "created_utc": 1702496241,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd85x67",
   "message": "Took acid in 1983 and went to a bullfight in Acapulco.",
   "created_utc": 1702499546,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd87s6j",
   "message": "Took shrooms, it went bad way, took many mirtazapines since it SHOULD work as tripkiller but I think it interacted badly and gave me seizure-like symptoms. I googled what I experienced and it seemed to be severe serotonin syndrome. Now I have tinnitus and god knows what kinda brain damage..\n\nShrooms are physically safe in themselves, DON'T FUCKING TAKE THEM WITH ANY OTHER MEDS OR DRUGS AND HAVE A SEVERE INTERACTION.",
   "created_utc": 1702500243,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd87tzj",
   "message": "Running out of cocaine.\n\n\n\nBut in all seriousness. Salvia",
   "created_utc": 1702500261,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd87xzy",
   "message": "not so much the drugs but the experiences. I was on two tabs of acid at a music festival and a mass shooting + evacuation happened (Beyond Wonderland 2023). despite what you might think, the acid made it alright.\n\nwent to another week-long festival a couple weeks later thinking I'd have a better time. I ended up getting flagged down by friends to watch over an acquaintance who was having a bad acid trip (they were on mdma and couldn't really handle it). I was on acid and mdma. I left briefly to track down more friends and when I came by this person (a former marine) had tripped and hit his head and went into a violent acid rage. Lots of blood. \n\nwhen I drop acid now I worry more about others losing their shit and freaking out.",
   "created_utc": 1702500303,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd89pds",
   "message": "I am a lightweight, I will admit it. But I was prescribed some medicine with codeine in it when I wasn’t feeling well. Learned I have a Linda Blairesque vomiting reaction to it. It did not help me feel better.",
   "created_utc": 1702500950,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd8crsf",
   "message": "One time I took melatonin -- yes, melatonin -- and I had a full-blown paranoid, hallucination-filled episode, seeing taunting words on the walls and I was deadass convinced someone was looking at me through the slats in my blinds, even though nobody was there. Called my boyfriend crying and all. \n\nThis was after 3 months of endless insomnia. Like nonstop, sleepless nights disrupted by 2 nights of shitty sleep per week. I think my brain kinda tipped over the edge when I took the melatonin and still couldn't sleep. \n\nI've tried a bunch of actual recreational drugs and never had a bad time, so I find it a little funny.",
   "created_utc": 1702502100,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd8d5go",
   "message": "Opium. Short version. Smoked opium and weed at the same time. Mind and body were going in two diffrent directions. Walked home to find my mother and upstairs neighbor day drinking. My mom was  supposed to have left town that day to visit her BF which was the only reason I tried something like opium i was supposed to  have the house to myself. The neighbors daughter went to the same HS she tagged along with her mom cause she felt bad didn't want me to have to manage her as well. She got stuck with me in the kitchen basically being mute I didn't trust my self to talk. When our parents got drunk together they for some reason always got the bright Idea we should date and make cute babies. She'd had the same BF since the 6th grade. I ended up making chicken parmesan the sound of me chopping herbs and pounding the chicken started making my mind grab Vietnam movie clips like flashbacks. Saw dolphins in the boiling water, at that point things get foggy. I woke the next morning alone with a not on the fridge my mom left to visit her BF and thanked me for dinner. Checked in with my friend. She said I finished cooking then just took a shower. She thought I was just really pissed off about having the drunks in the house and didn't know I was high.",
   "created_utc": 1702502239,
   "score": 1,
   "submission_id": "18hoi55"
  },
  {
   "comment_id": "kd8fswb",
   "message": "Spice/K2 aka synthetic \"marijuana\". I now know that it's just dried plant material that's been sprayed with come type of chemical compound. \nI was a silly broke boy in college and this was readily available at your nearby shady gas station. \n\nIntense paranoia, sweats and auditory hallucinations. Never again.",
   "created_utc": 1702503221,
   "score": 1,
   "submission_id": "18hoi55"
  }
 ]
}