{
 "submission_id": "18i9ar7",
 "title": "Taxi drivers, whats the most fucked up thing you've experienced customers do in your car?",
 "selftext": "",
 "created_utc": 1702562589,
 "permalink": "/r/AskReddit/comments/18i9ar7/taxi_drivers_whats_the_most_fucked_up_thing_youve/",
 "score": 127,
 "url": "https://www.reddit.com/r/AskReddit/comments/18i9ar7/taxi_drivers_whats_the_most_fucked_up_thing_youve/",
 "comments": [
  {
   "comment_id": "kdd581f",
   "message": "I was the passenger in this instance.  We had an office party, and one of the **managers** got absolutely shitfaced drunk.  A few of us happened to share a cab ride with him and his wife, and he proceeded to puke all over the front seat, and then puked several times more.  The taxi driver was understandably furious and threatened to call the police.  We all gave £50 each to pay for the mess and cleanup (so £150 total plus the cost of the ride), and essentially bribe the taxi driver.  His wife was crying from embarrassment but promised he'd pay us back.  He never did, but word got around to our boss who reimbursed us and he was never invited to any other office function.  Only reason he kept his job was he brought in a lot of sales.",
   "created_utc": 1702584012,
   "score": 241,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbtsl7",
   "message": "Can I go the opposite with this?  I was in a cab while visiting San Francisco that hit a lady who crossing the street.  That was interesting",
   "created_utc": 1702566530,
   "score": 148,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdct8d8",
   "message": "Female cab driver here. Not uber or lyft, actual cab lol. I woman giving her man head in the back and asking me to join after work lol",
   "created_utc": 1702579604,
   "score": 207,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdcupqj",
   "message": "Was an Uber driver instead of a taxi driver and it Didn’t happen IN my car, but I accidentally was a getaway driver for a dude who broke into his house. I picked him up at the front of a neighborhood, which I thought was weird. When he gets in he said “I will pay you $50 cash if you take me to my house real quick before we go to the airport”. It was right down the block so I told him that he didn’t need to pay me but he insisted which made me a little cautious\n\nI drove to the house and he got out, walked up to the house, and then went around to the BACK of it which I definitely thought was weird. About 5 minutes later he came sprinting out with a backpack\n\nTurns out he was going through a nasty divorce and the wife kicked him out of their house last minute with threats so that her new man could move in. The guy had to break in to his own house to get an overnight pack with some clothes because he was flying across the country to stay with a friend. \n\nThen the ride after that I accidentally almost picked up a meth-ed up hooker so I tapped out for the night.",
   "created_utc": 1702580143,
   "score": 112,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbn93u",
   "message": "obligatory not a taxi driver but a girl I partied with gave birth in a taxi in Philly.",
   "created_utc": 1702563800,
   "score": 163,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdcpc54",
   "message": "This thread makes me not want to be a taxi driver",
   "created_utc": 1702578200,
   "score": 75,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbnu7d",
   "message": "I knew a girl who drunkenly shit on a guy while on top of him in the back of a taxi\n\nI wonder if Juhi is still known as Poohi in some circles to this day….",
   "created_utc": 1702564055,
   "score": 218,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdcqgbq",
   "message": "This is tangential, sorry. But one time my husband and I took a romantic gondola ride. We joked about how we felt inappropriate to just kiss in front of the guy. \n\nAnd he goes: \"Oh don't worry, I've seen a lot more than that. 😜\" Like he was encouraging us, lol. It was weird.\n\nETA: People aren't understanding this, so I'll spell it out: from the way he said it, the dude was basically encouraging us to have sex on his gondola.",
   "created_utc": 1702578600,
   "score": 28,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdcvzaq",
   "message": "My dad is a taxi driver and one time he drove a drunk guy home. Instead of the guy just stepping out the car he just fell out of it face forward on the concrete. The guy later died in the hospital.",
   "created_utc": 1702580603,
   "score": 145,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbnxz5",
   "message": "There's going to be a whole lot of stories about people taking shits in taxis.",
   "created_utc": 1702564100,
   "score": 156,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddhgh5",
   "message": "I know a Brazilian girl that had sex with a German dude in the backseat of a cab in Vancouver around 2009. During a ride.",
   "created_utc": 1702588563,
   "score": 32,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdc0aqf",
   "message": "why is everyone shitting in a taxi",
   "created_utc": 1702569017,
   "score": 112,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbpag9",
   "message": "My mother shat herself in a NYC taxi because she drank too much (freshly squeezed) orange juice.",
   "created_utc": 1702564679,
   "score": 79,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddkrah",
   "message": "Driving Uber, picked up in deep east side, drop off Deep South west suburb. I guess her date sucked. She lost her husband and was actively trying to find someone. Well, we got to her exit and she started asking about my genitals. I was honest and it kind of came out of left field. I was married and making some extra money on a Friday night. So not interested, she did live in a very nice neighborhood and was pretty attractive. But, I’m just not into it. Green light for sure, but I’m not that guy.\n\nBetween that, the constant rapist talks and questions, and whenever anyone so much as said the word tip (the universal sign they weren’t tipping)",
   "created_utc": 1702589800,
   "score": 20,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdd0yan",
   "message": "Yeah, my uber driver sped up through a huge puddle that threw a water park sized wave at a lady.. The yelp \u0026amp; upset sound she made was unmistakable \u0026amp; even I felt guilty. \nWhen I looked to the driver \u0026amp; said \"ohhh uhhh\", he hadn't even noticed. I said nothing.",
   "created_utc": 1702582435,
   "score": 57,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddo0vg",
   "message": "I'm not a cab driver, but I've asked this question of them before.  And one told me that what they don't tell you when you start the job is that it's only a matter of time before someone dies in the back of your car.  That nice quiet old lady who fell asleep during her ride home?  Yeah.",
   "created_utc": 1702591022,
   "score": 18,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddzvzg",
   "message": "New Years Eve. Picked up a couple, she was very, very drunk. We stop at a gas station so he can get more beer. She stays in my cab, blacked out, her head tipped way back. I then hear the gentle gurgling of slow-motion vomit accumulating in her mouth. I leaped out, whipped her door open, and resituated her so she could puke downward onto the pavement. He returned a minute later after she finished but was still very much unconscious. If I wasn't listening for trouble, she could easily have drowned.",
   "created_utc": 1702595677,
   "score": 15,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbq3bt",
   "message": "Probably far from fucked up, but having to pickup and dispose of a used jam rag that someone let fall out their bag and left it under the seat!",
   "created_utc": 1702565015,
   "score": 14,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddqp7t",
   "message": "I had a guy shit into his own hand and then eat it.",
   "created_utc": 1702592038,
   "score": 12,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbskld",
   "message": "A ghetto gynecologist implanted an IUD in my fares cervix about 3\nMonths ago and she expelled this yellow and green liquid all over my backseat that made the whole cab smell like hot buttered movie popcorn",
   "created_utc": 1702566034,
   "score": 55,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddhoys",
   "message": "My ex father-in-law was born in the back of a cab lol, bet that driver had some stories to tell lol.",
   "created_utc": 1702588652,
   "score": 10,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdceurk",
   "message": "Was in the taxi but a friend lowered the window and tried to spit a snot out of the window, however he was so hammered that the snot landed on the dash in front of the driver, and it was a fist large alcohol infused snot.",
   "created_utc": 1702574403,
   "score": 33,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddxos5",
   "message": "Grabbing customers on a Saturday night downtown, so a lot of tipsy people. I picked up a lone lady, her destination was pretty far. She obviously didn’t feel too well, about 20 minuted in I hear her heaving and retching in the backseat. I ask if she needs me to pull over and she mumbles “No.” She makes more gross noises the rest of the trip.\nAfter I let her out, about 45 mins later, I pull away. I then smell a little whiff of weirdness, so I pull over and check the back seat.  \nThis nasty bitch had barfed all over the seat and then SLURPED it up to avoid a cleaning charge. There was a huge wet spot and little chunks all over 🤢",
   "created_utc": 1702594771,
   "score": 20,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddaivx",
   "message": "Passenger (drunkbro) pulled my beard. Slapped his hand, curbed the car, and told him and his friends to get the fuck out. Sounds kind of tame compared to some of these other stories but I'd have broken his jaw for him if he did anything but exit the cab when ordered to. I was fuckin' HOT!",
   "created_utc": 1702585987,
   "score": 38,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddealo",
   "message": "I drove in a small city. There are a few ...\n\n\u0026amp;#x200B;\n\nThis guy called the dispatcher and arranged it. I drove the guy out to the boonies, maybe 40 miles, and then waited in the driveway for a few hours. The curtains were drawn, but every now and then you could see shadows of people going back and forth. He came out and wanted to go back home. As we got into town, he rolled down the window and threw up. Nice.\n\n\\---\n\nThe dispatcher gives me an address to pick up. It's the city police. I pull up outside the cop shop, and there's an officer holding a very flexible man whom he pours into the back seat of the car, and hands me a note with the address of the guy's sister. I get to the sister's apartment building.  The guy pays, just handing over bills, telling me what they are, though they're not. There is a step or two to get to the door of the building, and it takes two hands to open the door, so I let go of the guy, get the door open, turn to grab the guy, and he's all four legs in the air, head down the steps. His sister came along and took over then.\n\n\\---\n\nA couple of us are sitting in the stand, one driver is reading a book in the first car in line. Now, the layout here is that were was a kind of tunnel though the building that exited onto the main street. And in the tunnel was the back door to a bar. We got a lot of trips from those drunks. Anyway, there we are and we hear the back door of the bar open (the band gets louder) and then a woman and a couple of men yakking away. Then we hear \"ooooh!\" and what sounds like a bongo drum. One tap. We all winced. The three head to the first car in line, and he calls in that he's going to the hospital emergency. Turns out she fell. But not just fell, she stepped back on the stairs out the back door of the bar and fell. Backwards. And the bongo drum was her head hitting the asphalt. And her head bounced about a foot. And then she wanted to bootleg a case of beer, but her friends convinced her to go to the hospital.\n\n\\--\n\nThere was the regular. We'd pick him up several times a week, and it was always normal. Then one night he called very late, like 2 or 3 AM. I'm up, so I go to his apartment building. He was always out right away, and this time he wasn't. I wait a bit, I beep the horn, but no show. So I grab the mike: \"Car 18m, he's a no.....oh... there he is...she is .... never mind\". Our guy comes out. Dressed in a lovely green evening gown. He gets in the back, and this was a guy who always sat in the front (that was ok back in the 1970s) and gives an address. He pays, then asks me to wait, he'll be right out. He's inside for a few minutes, comes out and wants to go home. And he pays again. I tell the dispatcher and the other driver, who tell me that I'm buying coffee! As I come out of Timmies, I hear the other driver \"uh... and there'll be a return on this\", meaning that the customer is going someplace, then coming back. The other driver comes in, looks at me and tells me \"I thought you were kidding!\"\n\n\\--\n\nAll this happend over about three or four months.",
   "created_utc": 1702587372,
   "score": 18,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kde079q",
   "message": "Not a taxi driver but I use to drive for Lyft on the weekends during pharmacy school. I usually hung out near the bars. One night I pick up this dude and his girlfriend. Dude is fine but the chick is completely fucked up. She's slurring her speech, can hardly walk, etc. They get in my car and she says she wants to go back to the bar. Dude tells her they're going home. I confirm the address and start driving. She keeps saying \"Go back. Go back\" but dude says they're going home. Then she says she doesn't feel good. I tell her if she's going to throw up, let me know and I'll pull over. She says pull over, so I do. They both get out and then all the sudden she starts screaming at me and cussing and starts kicking my door. Dude is trying to restrain her and tells me to go so I just drove off. At the time I thought she was just a drunken asshole but after thinking about it.... I wonder if he did something to her and if he did, could I have stopped it?",
   "created_utc": 1702595806,
   "score": 4,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdebp3p",
   "message": "Taxi drivers here in Vegas are the most insane, dangerous, selfish, idiotic drivers I've ever encountered.  They have it coming.",
   "created_utc": 1702600638,
   "score": 1,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kde45e0",
   "message": "My taxi driver handed me his gun once. Also had a taxi driver threaten to ram the base gates \n\nSorry for not answering your question",
   "created_utc": 1702597446,
   "score": 2,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kde3fgj",
   "message": "As a passenger, it was the driver that shocked us. In Vegas he was telling us about a time he agreed to go home with a hooker at the end of his shift for $50. He paid the $50 then found out the hooker was actually a guy. We asked what he did when he found out and his response was “I already paid the $50, what was I to do?” So he had sex with the hooker. We were shocked yet laughed so hard. His name was Alex, it’s embedded in my memory and that was 15 years ago.",
   "created_utc": 1702597147,
   "score": 1,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kde7ixm",
   "message": "Idk I'ma start tomorrow!",
   "created_utc": 1702598875,
   "score": 1,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdeaxqk",
   "message": "I vomited in the back of a cab once. Would not recommend.",
   "created_utc": 1702600316,
   "score": 1,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kddsmtf",
   "message": "Not a driver, but friends were.\n\nWomen would often give bjs because they couldn’t pay the fare.",
   "created_utc": 1702592781,
   "score": 1,
   "submission_id": "18i9ar7"
  },
  {
   "comment_id": "kdbp8w6",
   "message": "[deleted]",
   "created_utc": 1702564660,
   "score": 235,
   "submission_id": "18i9ar7"
  }
 ]
}