{
 "submission_id": "18iixxu",
 "title": "[Serious] Depressed people of Reddit, what were first signs of your depression?",
 "selftext": "",
 "created_utc": 1702588639,
 "permalink": "/r/AskReddit/comments/18iixxu/serious_depressed_people_of_reddit_what_were/",
 "score": 8,
 "url": "https://www.reddit.com/r/AskReddit/comments/18iixxu/serious_depressed_people_of_reddit_what_were/",
 "comments": [
  {
   "comment_id": "kddhnrl",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1702588639,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddhxom",
   "message": "Not going out, staying in bed for most of the day,  having a pessimistic opinion about every single thing you can think of and thinking about cutting off everyone and deleting everything to vanish forever.",
   "created_utc": 1702588744,
   "score": 8,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddi33t",
   "message": "withdrawing from people, lack of interest in things",
   "created_utc": 1702588799,
   "score": 6,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddiiuf",
   "message": "Trash on the floor everywhere… if I stop collecting my trash and clothes from the floor I know it’s worse again.",
   "created_utc": 1702588962,
   "score": 5,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddil2k",
   "message": "Losing motivation to do the things I like.",
   "created_utc": 1702588985,
   "score": 4,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddip63",
   "message": "Loss of interest in things I used to find fun.",
   "created_utc": 1702589027,
   "score": 2,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kdduvd2",
   "message": "The silence. Being completely unwilling and nearly unable to talk, to think or to feel. Just a huge void in my head as I would do my daily routine without truly being aware of what was happening around me. Being completly empty and apathetic to everything and everyone. At first it would be short phases sparsely placed across the year, but over time they got longer and more frequent until the silence was the new status quo.",
   "created_utc": 1702593649,
   "score": 2,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddjen8",
   "message": "I don't really remember, it's been about 14 years now.\n\nProbably isolating myself I think",
   "created_utc": 1702589292,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddjgkw",
   "message": "Isolation and feeling like nobody truly wants anything to do with me",
   "created_utc": 1702589312,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddjo01",
   "message": "Not caring about my grades in school.",
   "created_utc": 1702589390,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddkclv",
   "message": "I think it was feeling unmotivated and dull, but idk, to far gone (7 years ago)",
   "created_utc": 1702589648,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddkds8",
   "message": "Self neglect",
   "created_utc": 1702589660,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddlep1",
   "message": "When the old reliable nut doesn't give any dopamine",
   "created_utc": 1702590045,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddlrog",
   "message": "Having to keep YouTube constantly going in the background so that my brain wouldn't start going in dark places.\nUnable to have a full night of sleep.\nI can't enjoy the things that I used to love.\nAnd the list goes on.",
   "created_utc": 1702590180,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddme9j",
   "message": "I started sleeping a lot more than usual.",
   "created_utc": 1702590416,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddod3b",
   "message": "Sitting in the shower",
   "created_utc": 1702591148,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddowsr",
   "message": "feelings of hopelessness",
   "created_utc": 1702591352,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddtgd9",
   "message": "Not being hungry\n\nMy depression, anxiety and eating disorder started since I was 6, when my mom finally left my abusive father. We lived in shitty rented rooms with my grandma and we were pretty poor, but not poor enough to go completely hungry. Both me and my mom were too young to understand our feelings and traumas (my mom was only 26 at the time), and my grandma was too old fashioned to understand them either\n\nFor some reason or another, no one understood why at the time, I stopped eating. I wasn't starving myself on purpose, I was simply not hungry, I didn't have the willpower to eat. I was only eating about 2 slices of bread a day and that was because of my grandmother's efforts. I should have known, my mom too, but we didn't",
   "created_utc": 1702593098,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddwjkd",
   "message": "A vicious circle. You don't want to do anything, but you blame yourself for it, spending the last of your strength hating yourself, which makes you do nothing even more and just keep sleeping, and hating yourself for not doing anything.",
   "created_utc": 1702594310,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddzg3u",
   "message": "For me, getting angry. I am generally a cool, calm, and collected type of person. When I start isolating, getting angry at everything and everyone around me I know something is wrong. It’s like my patience goes out the window.",
   "created_utc": 1702595494,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kddzo3j",
   "message": "Being inexplicably angry all the time",
   "created_utc": 1702595587,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kde45q1",
   "message": "A major misconception about depression is you feel sad all the time. That is just not the case.\n\nThe two signs I have learned to watch for, is if it feels really good to stay in bed listening to audiobooks or podcasts, dozing in and out for days. When that feels really great, I'm getting sick again. Because I have no motivation or energy to do anything. When I'm not depressed, I would get incredibly bored doing that. But if its day 3 and I still just want to stay in bed and am at peace doing that, because I'm still just so tired and I need a bit more sleep. Even though I'm in a state of abject bliss and peace, Im in a very unhealthy place and I need to start worrying and try to crawl out of that place.\n\nThe second is if my guitar starts to gather dust, I'm in danger. When the things youre passionate about and love to do in life stop being fun, or you just slowly lose interest and just lounge around, floating through life and unbothered about anything,, that's depression. It doesn't make you sad all the time, it zaps your energy and motivation to do anything. Even the things that you love to do the most. It doesn't infect you with misery, or prevent you from be able to laugh and have happy moments, it leeches your energy, motivation, and passion until all that's left is just... meh. Misery requires you to care about something. Depression is the absence of caring, about anything. You don't feel sad, or happy, you feel nothing. You just stop caring about everything. Nothing is important or urgent, the consequences that will happen from checking out like that in the near future don't worry you, because everything loses its meaning. Nothing matters. Who cares.\n\n\u0026amp;#x200B;\n\nIn a word, Apathy. I don't look for signs like prolonged gloomy periods, or burn out, or need for change. Life has its seasons and cycles, and thats normal. That means you still \\*care\\* about something. You still feel emotion. It's the total consumption of apathy and indifference to everything that is the major sign, at least for me.",
   "created_utc": 1702597450,
   "score": 1,
   "submission_id": "18iixxu"
  },
  {
   "comment_id": "kdedtyw",
   "message": "Bed rotting",
   "created_utc": 1702601544,
   "score": 1,
   "submission_id": "18iixxu"
  }
 ]
}