{
 "submission_id": "18jknei",
 "title": "What has been your biggest “I really thought I knew this person” moment?",
 "selftext": "",
 "created_utc": 1702706264,
 "permalink": "/r/AskReddit/comments/18jknei/what_has_been_your_biggest_i_really_thought_i/",
 "score": 74,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jknei/what_has_been_your_biggest_i_really_thought_i/",
 "comments": [
  {
   "comment_id": "kdm2hh7",
   "message": "A guy I was kinda irregularly working with for 2-3 years as a student (we'd meet once a week in a café to talk through some project related issues) was one day wanted by Interpol. Turned out he invited a random language teacher to his flat and decapitated her.\n\nHe might have been an asshole, but there's a difference between an asshole and a murderer.",
   "created_utc": 1702735532,
   "score": 188,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlsbyk",
   "message": "I had a friend of 18 years overdose on heroin. None of us knew he did drugs. He didn't even smoke cigarettes. It was beyond shocking.",
   "created_utc": 1702730636,
   "score": 102,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm4at7",
   "message": "I was with my partner for 15 years. We were highschool sweethearts. \n\nOne day out of nowhere he started this fight with me. A fight big enough to make him suggest to stay at a friends house for a night to cool off. The fight was over me buying a male coworker gummy bears.\n\nThe night turned into a week. \nHe blocked my phone and I was unable to reach him. \n\nHe came back in the middle of the night to grab things and told me he wanted to break up. \n\nI was so confused and felt blindsided. \n\nI ended up finding out he was in a 10 year relationship with a girl he met on like a role play discord server. he was living a double life. When I would go to sleep at night he would be on the phone with her. \n\nHe flew out to get engaged to her the week he blocked me. \n\nThe kicker is she was married when they got engaged. this was a year ago. she is still married and my ex is still in a relationship with her.\n\nEdited to add: \n* I did speak to the husband over the phone (he lives in Texas and I’m in Pennsylvania). He asked me to send proof. I sent him texts and screenshots. Six months after I talked to him he caught my ex in his house via cameras in his garage when he was out of town. This was July and he is still living with her and married. \n\n*they originally met on gaia online and then their relationship moved to discord.",
   "created_utc": 1702736321,
   "score": 210,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm087n",
   "message": "I tweaked the reporting system for a large payroll system to improve its run time from 8 hrs to only two. Submitted the changes to the head programmer  with all my testing results. She took all the credit, used my expertise and told management I had nothing to do with the improvements after I called her out on her BS. Worked along side of her for 5 years prior and thought we were friends.",
   "created_utc": 1702734526,
   "score": 180,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdku4eg",
   "message": "Dude I went to high school with and hung out with in our little “clique” …\n\nHe was arrested driving down to Daytona to meet an underage girl with tape and knives in his trunk",
   "created_utc": 1702707136,
   "score": 204,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlroqz",
   "message": "A girl I worked with a few years ago ended up being one of those creepy catfishers. She initiated and continued an online relationship with one of her best friends, even made up other ancillary accounts for all the other made-up friends and family. \nShe was such a lovely girl too, really witty and fun to work with.",
   "created_utc": 1702730286,
   "score": 160,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm1bug",
   "message": "Turned up at a party. A buddy of mine was there. Body builder. (He was taking steroids at the time) Door security at a rough Liverpool club. Hard bloke that you would not want to get the wrong side of.\n\nHe was wearing a charming dress, impeccable make up \u0026amp; drinking a cocktail.",
   "created_utc": 1702735019,
   "score": 69,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlsiuv",
   "message": "When my wife cheated on me. Sounds really stereotypical but she was the last person on earth I would have thought would do something like that.",
   "created_utc": 1702730740,
   "score": 43,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlvuty",
   "message": "Good friend of mine, known eachother since we were very young, etc. On the phone one day and he sends me a screenshot of a reddit post he thought was funny. I joke about how now I'm going to go stalk his account (user visible in a comment) and he gets freaked out and hangs up.\n\nThought it was strange so checked out his account. He was active in some very disturbing subs talking about how he's successfully seduced a 10 year old girl and if there was anything actually legally wrong with doing things with her since he was also underage (17) \n\nMe and best mate at the time reported him but nothing came of it since they couldn't prove he had nefarious intent.",
   "created_utc": 1702732475,
   "score": 146,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm6fmw",
   "message": "Minor compared to all of you, but I dated a guy who bragged about how smart and successful he was and made me feel like an idiot for sticking with one job for 5+ years. He said I was too financially conservative and not enough of a risk taker. He talked big about his salary and how important he was. \n\nIt turns out that he was continually job hopping due to performance issues, bad decisions and boredom.",
   "created_utc": 1702737232,
   "score": 53,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm8t4i",
   "message": "When my parents divorced, my dad introduced his girlfriend to my sister and me, A DAY LATER. \nIT obviously meant he was cheating on my mom. I never forgave him for it",
   "created_utc": 1702738272,
   "score": 118,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdkwfev",
   "message": "I had a friend in high school who was so nice to me and everyone I knew. He was a transfer from another school. Everyone liked him. We all would hang out with him in and outside of school. Go yo parties with him, etc. We came into school one Monday and he wasn’t there. Then he didn’t show up for a few days. No one knew what had happened to him. Then we all learned on the news that he had murdered someone during a gang initiation via a drive by. He shot and killed a random man who was coming out of a Walmart with bags full of baby supplies. It took a couple of days but him and the driver were both caught. He has life in prison if I remember correctly. One of our teachers who he was a TA for visited him for years after. She would bring him books to read. She may still be in contact with him, i’m not sure.",
   "created_utc": 1702708650,
   "score": 185,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmgipp",
   "message": "I met a guy in college. We were both dating other people at the time, so we would hang out together instead of going out to parties and getting wasted. He was my safe buddy, always a gentlemen. We stayed friends for 7 years, but were always dating other people. Finally, we were both single at the same time! We talked every day and decided that I would take a week off work and fly cross country to see him. My flight ended up being diverted to DC instead of Philly. He told me to take the train up and he'd pay me back for the train ride. So I've now spent $600+ for flight, $120 for a train, and I'm losing about $1000 taking off a week from work. I get to 30th street station.... and he doesn't pick up his phone.... and he didn't pick up his phone for 5 days!!! He left me stranded at the train station, even though we had been texting all day! I cried, I panicked, I called a girlfriend from college who was able to pick me up/house me for the week. When I finally reached him, I laid into him. What kind of person does that?! All he said was, \"idk what to tell you, people suck, lesson learned.\" WTF??!? After 7 years! Guess I didn't know him after all.... Fuck you Sean!!",
   "created_utc": 1702741405,
   "score": 35,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm5u4f",
   "message": "This is a funny \"how did I not know this about you\" moment.\n\nSeveral years ago, I was flipping around on the television and came across something or other about the band Disturbed. Just like that, out of nowhere, my husband started basically giving me a biography of every member of the band, as though it was all common knowledge.\n\nWe had been together about ten years at this point, and I had no idea he even liked Disturbed, much less knew so much about them. He'd literally never talked about it before! Surprised the heck out of me!",
   "created_utc": 1702736977,
   "score": 7,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdljhqw",
   "message": "I dated a guy for a year (we'd been good friends some years prior) who was very smart and studied rocket science (I studied material engineering). We wrote a 100 paper together on new rocket models for a research contest and did aprox 50/50 of the work together. He lived in a big city and I lived further away, so I asked him to go hand in the printed copy to the university that organized the contest.\n\nSome weeks later, he told me he'd been to the uni to ask about our paoer's status and told me we hadn't been selected for the contest so I trusted him and we went out on a \"compensation dinner\". A few weeks later, I saw that little bitch on the university's instagram doing a speech on our work. He presented OUR work with only his name and erased my credits. We'd actually been selected and he got a diploma and a price for our work, and I was only mentioned in the \"agreements\" page alongside his family for providing \"emotional support\"\n\nEdit to add: he broke up with me and kinda ghosted me a few days before the speech\n\nEdit 2 since I thought it was obvious: I'm doing stuff to take him to court if the university doesn't solve it but it's a slow process",
   "created_utc": 1702725306,
   "score": 235,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlr1jw",
   "message": "I thought I knew my parents until I had my own kids.\n\nNow I feel like they're just people who were in the house while I was growing up a lot of the time.",
   "created_utc": 1702729936,
   "score": 106,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmdeg3",
   "message": "Dated the son of my favorite teachers in hs. Everyone absolutely loved them, they were always involved in school events and class trips. \n\nOne day I noticed these horrible scars on his back. These parents beat the shit out of him.",
   "created_utc": 1702740171,
   "score": 28,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm3uo9",
   "message": "In 8th grade, I went to school with a kid who was walking to his buddy's house to watch the superbowl. He came across one of his neighbors, she was  8 or 9 years old, he brutally murdered her put the mangled body in a trash bag, threw here in a dumpster and then continued to his friends house and watched the game as if nothing happened.",
   "created_utc": 1702736130,
   "score": 167,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmflfc",
   "message": "Worked with a dude for a few years, he got arrested for child porn and keeping his children locked in kennel cages. You think you know some one.",
   "created_utc": 1702741041,
   "score": 127,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmaxe7",
   "message": "My ex's best friend stopped talking to her on a dime. I thought it was strange, but the best friend wasn't the most stable person.\n\nTwo happy years of our relationship later, I found out why - she got drunk with the bff and admitted that her endometriosis, the illness around which we organized our lives, was just... made up. Fictitious. Done for attention. We went to fundraisers and awareness events. She was pretty well known as a vocal activist. She'd had exploratory surgery to find adhesions; perhaps unsurprisingly, nothing was found.\n\nSuddenly a lot of little things clicked into place. I corroborated a few things, contacted some people about this and that, and every suspected lie was backed up by the testimony of something. Took me a couple of days, but I worked up the gumption to toss her ass. No asking questions, no hearing her side, just tossed her aside.\n\nZero fucking regrets.",
   "created_utc": 1702739168,
   "score": 233,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlffsq",
   "message": "One of my very closest friends, we did everything together.  I referred to this girl as my sister.  She had some severe mental health problems, and some people had warned me to keep my distance, but I loved her, and thought she’d never want to hurt me.\n\nThen one day, when she was drunk, she told me that if she ever committed suicide, she’d arrange it so I was the one to find her body.  She trusted that I’d know what to do.\n\nShe expected me to be *flattered*.\n\nCouple of years later, she tried to do exactly that, then was furious with me when I called 911.\n\nYeah.",
   "created_utc": 1702722510,
   "score": 113,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm6e13",
   "message": "My best friend from childhood. Every year, his dad would have a huge get-together on his property up in cottage country. Everyone would set up trailers and tents, and we'd spend the week fishing, boating, off-roading shooting, drinking and doing drugs, and altogether have a great time.\n\nAnyway, one year, my friend says he doesn't want to go up because he has no money. Now, our families have been friends for years, so I'm welcome to go with or without him, but he's my best friend and it wouldn't be as fun if he didn't come, so I offered to cover his costs.\n\nI bought the train tickets for there and back. I bought all of our food and alcohol for the week. Then I gave him $200 cash for general spending money. \n\nI was very clear about what I expected, \"I'll cover all of the expenses, don't worry about any of it. But pay me back the $200 cash when you have it.\"\n\nHe spends it all pretty quickly and asks me for more. I give him another $200 and repeat it. \"Pay me back the cash I give you. You owe me $400\". He says it's not a problem, a reletive of his had passed recently, and he was going to get around $8k from her will.\n\nWe had a great time, and a few weeks went by. I had been pretty busy with college and hadn't spoken to him much in that time, but I knew he had gotten his inheritance.\n\nAnyways I pop by his place to hang out, and his room is decked out with all this great new stuff. Brand new top of the line gaming computer, desk, chair, mouse, keyboard, gigantic monitor. He's got a bunch of new brand name clothing, a new Playstation, a new TV, etc. \n\nHe's showing me all this awesome new stuff. It's great. Eventually, I asked him if he had the $400 that I loaned him, and he starts acting all cagey.\n\n\"It was my understanding you were covering all of the costs.\"\n\n\"Except for the cash. I told you to pay me back the cash I gave you. \"\n\n\"I recall differently.\"\n\nSo, I repeated our whole first conversation when I offered to help him.\n\n\"I recall differently.\"\n\nI repeat our conversation when he asked for more and told me about his inheritance coming in.\n\n\"I recall differently.\"\n\nThis went back and forth, and he had nothing more to say other than he remembered differently than I did. Eventually, I just said whatever, regardless of what he remembered, I spent a lot of money covering costs for both of us for that week. Can he pay me back some of that money, especially now that he recently received $8k.\n\n\"I don't have any left, I spent it all,\"\n\nI had never spent a single penny on him from that moment since. Never paid for a pizza, never gave him a dollar for bus fare, never let him bum a cigarette or a beer. That was the beginning of the end of our friendship. It lasted a couple of years longer, but it was a long downhill ride.",
   "created_utc": 1702737211,
   "score": 100,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm08jv",
   "message": "My sister has always been selfish. She was spoiled terribly by my parents. It seemed as if things were better as she grew up and had her own family. She called me upset because her son’s Cub Scout pack was accusing her of stealing money. She claimed they were terrible at keeping accurate spending records and she could prove that and that she in fact helped them get the books straight. \n\nShe lied. She stole 10K from children because she thought no one would notice. She’s a terrible human and  I went no contact eventually.",
   "created_utc": 1702734531,
   "score": 209,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdld7t7",
   "message": "[deleted]",
   "created_utc": 1702720966,
   "score": 66,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlgv71",
   "message": "Bestfriend 15yrs ago, paid for us to move to Colorado together, literally paid for everything, soon as we were settled into a place he tells me he's always hated me and knew I had resources he could take advantage of. Colorado was his idea, but he sold it so well... Also, we had countless times hanging out, laughs, having each others backs, there was never a reason to question this being my bestfriend. We never fought either. That was a tough one.",
   "created_utc": 1702723499,
   "score": 57,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm5wlz",
   "message": "A friend I met at uni in first year while studying psychology... Friends for 6 years and far along in our journey of study (very long pathway to become a registered psychologist here).. we're both mums to young kids doing the study / parent juggle.. in regular contact supporting each other with the study load.. she had a breakdown and quickly spiralled in to alcohol and meth addiction.. from a very affluent family, supportive husband.. walked away from her life.. child protection involvement.. saw her earlier this year at her birthday party thrown by her family and she is a shell of her former self.. tweaking and twitching, paranoid, disorganized thinking and speech, completely psychotic. I'm grieving the loss of my friend. I'm so sad and I miss her so much. She's too far gone. I don't think she'll ever recover. I graduated, got qualified, just about to get my clinical endorsement and it's bittersweet because she's not beside me.",
   "created_utc": 1702737008,
   "score": 187,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm7546",
   "message": "I called my husbands best friend pleading for help for his opioid addiction that I thought just started about a year before. This friend lives on the opposite side of the country and grew up with him. I tell him about the situation and he goes “oh shit he’s into that again” \n\nAGAIN? \n\nI had no idea. I thought I knew this man through and through. We were best friends for 8 years before we even started dating. We are now divorced. Safe to say I have some trust issues. 🙃",
   "created_utc": 1702737541,
   "score": 143,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm0zi1",
   "message": "Ex wife now, married for 14 years when she acts suspicious.  Note:  wife paid all our bills because she “was better than me at that stuff”.   I know it’s not an affair (no missing time) but can’t figure it out.  3 months later I confront her, she denies acting differently.  She won’t let me answer the home phone and we get 5-7 “wrong numbers a night”  can’t check the mail because she runs to the curbside box.   I take a vacation day from work and she calls in sick so I’m never alone at home. \n\nFinally I arrange a vacation day and don’t tell her.   I pretended to go to work, she went to work then  I came home.   Oh BOY!    All the “wrong number calls”?  Bill collectors for credit cards I didn’t have.  Same with the mail.   My ex took FIVE credit cards out in my name without my knowledge.  Total debt of $60K in my name.  My personal bank account was wiped out as was her 401K.   Couldn’t jail her because we had an adoptive daughter who was glued to her hip and therapist recommended against separating the two.   At bankruptcy I discovered she also had $80k in unpaid student loans.   In the end, she took cash advances to pay the lawyer who defended her child rapist son.  A crime we both knew he was guilty of and agreed not to pay his bail or lawyer.   Yea, he was convicted and our family destroyed.   Now I don’t call her my ex but my Y.  She’s my Y wife as in why did I marry that trash?",
   "created_utc": 1702734872,
   "score": 98,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm6dxd",
   "message": "A friend from middle school was killed in a home invasion. He was the burglar.",
   "created_utc": 1702737210,
   "score": 96,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmv9dj",
   "message": "This happened back in June. I went to Europe with my family for two weeks. A friend of mine told me she’d watch my dogs and cat. I get home and find out that she hadn’t been there in days. They had no water, no food and one of my pups has severe allergies and she hadn’t given her her medications. She had literally eaten herself raw. She was missing tuffs of hair and had sores everywhere. \n\nSuffice to say, we’re not friends anymore. Oh! Forgot about the best part. I payed her $400 to take care of them and instead, she spent that money on alcohol, weed, everything but my dogs. \n\nI’ve never hated someone so much.",
   "created_utc": 1702746809,
   "score": 250,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm6uza",
   "message": "My husband rolled over and went back to sleep after I got a call saying my Dad was dead in the hospital. Had to drive myself. Always thought he'd step up when I needed him in the ways I stepped up for him. Turns out 'I should have asked.' 🙃",
   "created_utc": 1702737419,
   "score": 33,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm8yyh",
   "message": "Youngest brother died out of nowhere. On the surface he was a functioning adult with a good job. Turns out he had been a drug addict with a lot of debt for years \u0026amp; somehow managed to hold a job \u0026amp; seem fine infront of our family.",
   "created_utc": 1702738344,
   "score": 120,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlxrcg",
   "message": "I loved the hell out of my husband and thought we had a great golden lab/black cat relationship. He was caught cheating online and having 10+ different social media accounts and he tried to blame it on Covid brain. When I pointed out it was before that he just shrugged and said it is what it is. Still reeling.",
   "created_utc": 1702733383,
   "score": 211,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlp0y5",
   "message": "My mum. I thought she loved me, I thought she had basic empathy for people. Recently she caused something extremely traumatic to happen to me and my sister to gain back some of the control she lost when my sister decided to date someone out of our culture. And she has no remorse at all. All that matters to her is gaining control.\n\nEveryone told me that my mum controls us because she loves and worries for us but it's clear now she is deeply mentally ill and does not feel empathy for people. Understanding this, I look back at the past 19 years of interactions I've had with her. There are many moments she had pretended to be vulnerable, understanding and loving as one of the many tactics she used to gain what she wants and I bought it. She would allow me to trust her and confide in her and later weaponize that information, idk why it took me so long to realize.\n\nI don't know this person. She is a brilliant actress who stops at nothing to get what she wants. I don't love her anymore and I wouldn't feel a thing if I was to attend her funeral tomorrow.",
   "created_utc": 1702728791,
   "score": 55,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm62e4",
   "message": "Ex-girlfriend revealed she was dragging a guy through court, framing him for rape, she said this when we were ten months into dating. I recorded a conversation about it, broke up with her, and gave it to the police.\n\nThankfully I never had to worry about her trying to frame me because I'm on a police report ratting her out.",
   "created_utc": 1702737077,
   "score": 91,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmbcfw",
   "message": "In college, I was close friends (I thought) with a girl for a couple of years.  We were supposed to go see Schindler's List together, but she went with her boyfriend instead.  I was hurt, but asked her how it was.  She was like, \"It was okay, except that it tried to make the Holocaust look like it was a bad thing.\"  I was like, \"?!?!?!?\"   Turns out not only did she hate Jews, she also thought Black people were inferior to whites.  I had no idea!",
   "created_utc": 1702739338,
   "score": 130,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm22xn",
   "message": "Ex husband decided that if he wasn’t a “husband” any longer, he wasn’t going to be a “father” either. He hasn’t tried to see his kids in 2 years. Hasn’t paid one dime of child support. Never saw it coming. He was my best friend and even through we were separating, I never in a million years would have thought he wouldn’t see his kids anymore.",
   "created_utc": 1702735355,
   "score": 66,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmezbz",
   "message": "My ex had called me to talk about the new woman he was seeing. He says “She cooks and cleans but she’s really not that pretty. She’s kinda stupid too. She can’t have intelligent conversations like we used to.”  All of a sudden it clicked. He’s talked shit about every single person he knows then turns around and smiles in their faces. That two faced wretch….",
   "created_utc": 1702740802,
   "score": 206,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm2swm",
   "message": "My ' friend' who I'd lived with, travelled with, and gave support to over many years turned her back on me when my 6yr old daughter died. Didn't return my calls or attend the funeral. She rang to wish me a happy birthday 6 months later, leaving an answer phone message. I didn't reply.",
   "created_utc": 1702735674,
   "score": 193,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlgd0n",
   "message": "Been friends with this person for almost 10 years. They're going to school to go into social work + mental health. \n\nThe same person who tried to tell me earlier this year that they basically have the right to beat the crap out of their kid, as long as they don't leave marks. Their child with a sexual abuse history who was threatened with violence if she didn't comply with her sexual abuser. I very firmly told them if they go to hit their kid in front of me, I will stop them. That if I found out it happened afterwards? I'm calling Child Protective Services on them. \n\nI honestly thought I knew them. I thought I knew them to be more of a kind hearted and progressive person. I've been depressed as hell ever since. I didn't just loose my respect for them. I lost a really good friend that day.",
   "created_utc": 1702723150,
   "score": 51,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmrty6",
   "message": "I was friends with these 2 women at my old job, i was about 25 and they were late 30s and mid 40s, we got on pretty well and hung out after work too so I thought we were cool. Gets to the week of my birthday that's on the friday and every day they are doing a full on countdown, hyping it up, telling everyone that comes into the kitchen about it. Bearing in mind I never brought it up, I don't really do office birthdays but they'd found out off facebook and decided it was a big deal. I didn't expect much tbf like I wasn't hoping for presents but it seemed obvious they must have something planned. NOPE! Not even a card, not even a happy birthday, came in on the friday and they wouldn't even look at me, just kept glancing over and giggling to each other. Then end of the day comes and as I walk out they've got a crowd around their desks, still no happy birthday or even a goodbye, turns out they'd invited our entire team out to the pub on my birthday and not invited me. Obviously very upsetting but also completely baffling, like where did this come from? On the monday they were asking how my birthday was and acting like my best friends again, but I just couldn't bring myself to bother with them anymore.",
   "created_utc": 1702745606,
   "score": 98,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmaja6",
   "message": "Close friends with a man for almost 10 years. He wanted more, I didn't. He is now incarcerated as a serial killer.",
   "created_utc": 1702739004,
   "score": 149,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdme2li",
   "message": "My ex-husband cheated on me (F) - with men he met on Craigslist.\n\nBroke up, found out I was pregnant with his kid, tried to work it out but realized he’s a pathological liar and will lie about anything. He is remarried to another woman now with 4 other kids. I feel like I never even knew who he really was.",
   "created_utc": 1702740441,
   "score": 171,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdludf0",
   "message": "My childhood bestfriend. First time we met was the day after I was born. Years went by until I was like 16 and I realized she has been spreading rumors about me, using me as the ugly friend and in general using me to get what she wanted from life. Ngl was very sad when I realized how narcissistic she acctually is.",
   "created_utc": 1702731724,
   "score": 161,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmhg87",
   "message": "Knew a guy for about six months. Both of us are truck drivers.\n\nWe talked about a lot of stuff; our kids, trucking, social issues, politics and the economy, you name it. Two drivers stuck in their trucks with not a lot of anyone else to BS with, we're gonna talk.\n\nMet up one day to hang out and we are sitting outside one of our trucks just hanging out when one of our new drivers came by to chat.\n\nTalked for a bit, I laughed at something the newer driver said before he had to grab a trailer to go get another load of freight, when I noticed my original friend wasn't around.\n\nI found him and asked him what happened. He told me, \"I can't believe you find those 'racist word's funny or even worth your time\".\n\nWhen I asked him to elaborate, found out hat he's a member of the KKK and staunchly against any race succeeding other than white.",
   "created_utc": 1702741771,
   "score": 82,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm1dfd",
   "message": "This one isn’t too bad but it was surprising to me. \n\nGuy I worked with (different department but sat in an adjacent office) and I would shoot the shit at work frequently. We’re from the same state, same sports loyalties, had a lot in common, made each other laugh, etc. Normal, personable guy. \n\nFound out he’d posted for a new position with the company in a different location. I was bummed he was leaving but happy for him and his family, it was a nice promotion. So I asked him about the job and his general future career plans and it was like a switch flipped and I was talking to Patrick Bateman. He was OBSESSED with getting up that ladder and kept talking about the higher-ups’ perception of him and how he needed the PERFECT position so that he could appear to be an exec-quality manager. It was weird.",
   "created_utc": 1702735041,
   "score": 210,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm9eq1",
   "message": "When I got a collect call from Rikers from a friend whom I couldn’t get a hold of for 2 weeks. I hung up and searched the internet for his case, since he couldn’t talk about it on the tapped phone. \n\nHe’s now doing 75 to life for holding his children’s mother hostage, raping her, beating her, and terrorizing her for 3 days. This is a guy I’d know since he was 13.",
   "created_utc": 1702738529,
   "score": 33,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm30ur",
   "message": "Well a couple of weeks ago my boss called me into her office and told me it was clear I thought she was a monster. It wasn’t completely out of the blue in terms of weird interactions leading up to it, but that statement absolutely floored me. \n\nI don’t think she’s okay and I’m just trying to be very nice to her and applying for jobs.",
   "created_utc": 1702735769,
   "score": 216,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm6jm6",
   "message": "My former best friend from high school. Her and her skeezy boyfriend turned husband went into my parents room while they were waiting for me to finish up in the shower and stole all of their gold jewelry. I had loved this girl like a sister for years and in return she stole from my fucking parents for drug money. Last I heard her life sounded awful and I struggle with guilt because I don’t feel bad for her one little bit.",
   "created_utc": 1702737279,
   "score": 219,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm2qr2",
   "message": "Someone who I considered one of my closest friends that I’d known since I was like 2 pretty much let me get sexually assaulted by a friend of her boyfriend, and then accused me of lying about it even though she saw it happen. Suffice it to say we are not friends anymore.",
   "created_utc": 1702735647,
   "score": 114,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlymp8",
   "message": "Realising that my ex had been emotionally abusing, financially exploiting, and potentially even sexually abusive, and only started dating me because he thought that I was easy to manipulate. Realising that I had fallen for his manipulation, believed his degradation of me even after he broke up with me and missed all of the obvious red flags.\n\nStill unravelling that shit. I wasted a year and a half of my life and I'm gonna have to keep wasting more time trying to build myself back up and grow from this so that it doesn't happen again. It was my first relationship and I was so blind.\n\nEdit: He broke up with me because he realised that his bullshit wasn't having the desired effect of turning me into his perfect domestic goddess girlfriend and was just making me super depressed instead and I guess he didn't want to clean up the mess he'd made. I only realised what he'd actually done to me a few months later. I got off relatively lightly compared to other people who've been abused, but I'm still scarred.",
   "created_utc": 1702733792,
   "score": 58,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlr5f9",
   "message": "When a coworker who I'd known for four years and thought was a close friend falsely accused me of sexually harassing her. Allegation was found to be false, she still works there and i ignore her now. Won't get in a lift or be on my own with her.",
   "created_utc": 1702729993,
   "score": 162,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlqhh8",
   "message": "[deleted]",
   "created_utc": 1702729624,
   "score": 250,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdma0yx",
   "message": "In 2014 my partner passed away. I was, of course, completely shattered and was not doing well for a long time after. We were best friends before we started dating and when we finally got together, all of our friends and families said “it’s about time!!” It was a fairytale romance for me. Everyone thought he worshipped the ground I walked on. \n\nA week after he passed his affair partner came to me with proof that he’d been cheating the whole time. She gave me a love letter he’d written her.\n\nEDIT: Please quit asking me why she did that. I don’t fucking know, because she’s horrible I guess. Why did she try to retrieve his personal items from the coroner instead of me or his mother? Why did she refuse to let him be buried in his favorite beanie that he wore every day because she wanted it? Why didn’t she take him home when he told her he didn’t want to be at the lake that he ended up drowning in? Why did she tell the paramedics that SHE was his partner?? That was a horrible part of my life and I’ve put her behind me. I couldn’t tell you why she did it and I don’t want to discuss it.",
   "created_utc": 1702738790,
   "score": 168,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmizc2",
   "message": "My ultra conservative mother is prostituting on the side….",
   "created_utc": 1702742356,
   "score": 132,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdktfp3",
   "message": "A friend of mine since high school, a dude I really trusted, came to live with me when he was down on his luck. This dickhead lived with me for three days before he stole a pistol from me and sold it for meth. Now he's sitting in prison and my gun is tied up in a federal case.",
   "created_utc": 1702706709,
   "score": 66,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmfdn4",
   "message": "My (now ex) partner refused to spend Christmas with me while I was actively miscarrying our second unsuccessful pregnancy. Then sent pictures of him playing with his 1yo nephew. My period still terrifies me.",
   "created_utc": 1702740957,
   "score": 174,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmkoj9",
   "message": "Long term ex years ago. \n\nWe’d been together ~4 years. Changed colleges and moved to the state she was in to be closer to her. We were both already in kinda a funk before but I’d been hit by a car on my bike and needed some outpatient surgery to fix my shoulder after a misdiagnosis and the severity of my trauma. \n\nDay of, she drops me off as expected. Wake up and after waiting for her to pick me up about 2 hours (post anesthesia), the nurses say I should just go wait in the waiting room so as to not rack up a larger bill. Took her another 2 hours to get there to grab me. \n\nI don’t remember the exact excuse, but it was something like she had to grab lunch with some friends and lost track of the time. I’d been calling her in my messed up state. It was then I realized a she didn’t actually care about me and I deserved better. I decided we needed to go on a break that week that lasted forever. Roughest time in my entire life.",
   "created_utc": 1702743005,
   "score": 60,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlpxbl",
   "message": "Almost every moment since my Ex-husband announced he was cheating on me and wanted a divorce has been an \"I really thought I knew this person.\" moment.\n\nIf I hadn't watched him go from what he was to what he is now over the last year, I wouldn't have believed it. His partner has changed him from what he's comfortable with to something he's so uncomfortable with (at least from my observations) that it's unreal because that's what his partner wants.\n\nEx says he wants to be friends and I feel like I HAVE tried to be his friend, but I recently told him I don't think I can be his friend as long as he's with his current partner, who I don't really care for because of the way they've treated Ex and used him as a cash cow.",
   "created_utc": 1702729302,
   "score": 79,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm0d3y",
   "message": "A fellow RN who stole out of my purse. Circumstances all pointed to her. I thought we were friends.",
   "created_utc": 1702734588,
   "score": 223,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm3wjx",
   "message": "My high school sweetheart. We were very on and off for most of our 20s. The man wouldn't commit to me and I stupidly stuck around. We basically were in a situationship, so asked him to please tell me if he ever met someone else and started to see them. Because I couldn't bear the humiliation of being the last to know. It was basically me saying, \"If you meet someone, fine. But tell me so that I can walk away immediately.\" \n\nGuess what. He met someone else and snuck around with her for two months before I found out from one of his friends. Objectively I am sure anyone would say duh, of course he did. But knowing him, I was shocked. I really didn't think he was a liar like that. Still hurt but showed me his true colors finally",
   "created_utc": 1702736154,
   "score": 179,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdl5vzy",
   "message": "My dad had an annulment with his first wife turns out I have a step-sister but technically speaking she's my cousin because my dad adopted me from his sister",
   "created_utc": 1702715455,
   "score": 181,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm3egh",
   "message": "My friend had a boyfriend he'd bring to various family events. Seemed like a decent enough guy, pretty innocuous, personable enough. There was nothing \"off\" or unseemly about him. They ended up breaking up and the boyfriend moved to California in the wake of the breakup. About six months later, we found out he was busted in a police sting for soliciting underaged boys for sex. To say I was shocked is an understatement. This guy had been around my kids, multiple times. Shudder.",
   "created_utc": 1702735936,
   "score": 177,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmm2rj",
   "message": "When my sister fucked my ex. I always considered us to be close and she was my best friend. Looking back after that happened , I realized I was the one always telling her stuff about my personal life and she rarely told me anything about hers. The betrayal cut so deep that I still rarely talk to her outside of family gatherings.",
   "created_utc": 1702743523,
   "score": 94,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm1kl7",
   "message": "When I found out he was trying to get with a 12 year old when he was almost 18. He made a new Facebook account and tried hiding it from me but I found it again. Pedophile. He tried justifying his actions as well.",
   "created_utc": 1702735130,
   "score": 236,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlp14n",
   "message": "I walked up to an old school friend at the train station and said, \"Hi\". It wasn't them.",
   "created_utc": 1702728794,
   "score": 185,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmdyft",
   "message": "Close friend in college. We helped each other through severe mental health struggles, talked about what I thought were our darkest secrets, and supported each other 3k miles away from our hometowns. \n\nHe disappears one day. Won’t answer calls or texts. Eventually, someone from school tells me he was arrested. He has people reach out to me saying he wants me to visit him or send letters so we can talk. I can’t find his charges ANYWHERE and no one will tell me. Eventually once he’s convicted, I find out he’s been charged with forcing a child to give him oral on multiple occasions. And, tragically, it was a kid he nannied for — a kid I knew. They had a strong bond that I never once clocked as over the line, and the kid seemed to really look up to him. \n\nNeedless to say, I haven’t talked to him since, even though someone reaches out to me every few months saying that he asked them to tell me he wants to talk. He got 16 years.",
   "created_utc": 1702740392,
   "score": 93,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlrp7n",
   "message": "In 8th grade I met a friend online gaming. Though he lived in another state which was an 8 hour drive away, we proceeded to be best friends for over 10 years. We talked on the phone every day and I was friends with his mother, too. As an adult I went on a business trip in his state so we met in person and had so much fun hanging out IRL. A couple years later he visits me and stays at my apartment. All of this happened over a decade of daily interaction and supporting each other and general best friendship. \n\nHe was a late bloomer and in his late 20s joined the Air Force. We wrote each other letters through basic training and the few and far between phone calls were to me. \n\nThen he went to the military university. There was an 18 year old girl he wanted to bang and a new group of friends to hang with, so he essentially ghosted me after I expressed feelings of being taken for granted and ignored after so many years of basically being family to each other. \n\nHaven’t spoken since. He learned I got engaged via his mom but didn’t contact me. He knows I’m turning 30 this year but I won’t get a call. Hurts to share your life with a friend for so long to learn they weren’t who you thought they were after all.",
   "created_utc": 1702730293,
   "score": 128,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmam94",
   "message": "when i got fired from a job where i thought i’d make my career. they accused me of falsifying my hours/scamming our clients (which i never did, but our instructions for logging hours included “count any time you spend even thinking about a project in your billables” so it was a clusterfuck anyway) and “taking unauthorized initiatives to collect employee opinions”…. as the HR deputy lol. i thought my bosses cared about me as a person. they knew my wife and kids. they fired me three days before my wife’s birthday when i thought i was going into a meeting to take over responsibilities for my boss who was going on leave for a month. it’s rocked me to my core that people i respected could treat me like that out of nowhere.",
   "created_utc": 1702739041,
   "score": 87,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmkv83",
   "message": "My husband,  when we first started dating, I explicitly asked if he had kids (life happens). Over the past 12 years, it was my understanding that no kids ever... Low and behold last year, a weird letter came in the mail. Imagine my surprise he has an adult son wanting to contact him. I asked why you lied. His response was that I didn't have a kid. I gave up full custody when he was born. So, due to me not wording the question properly, I was not given the truth. Oh sidenote his WHOLE fucking family knew and just kept me in the dark . Fun times.",
   "created_utc": 1702743074,
   "score": 150,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm784y",
   "message": "Police arrested a coworker for murdering a guy with a screwdriver.",
   "created_utc": 1702737576,
   "score": 37,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmgbfe",
   "message": "I helped her fix her car with the clear understanding that she repay me.  She didn't and I had to sue her and won. She acts like the victim 🙄",
   "created_utc": 1702741325,
   "score": 44,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmlhn9",
   "message": "About 11/12 years ago I met a friend (in his early 50's) via a shop I worked at. He was a customer who would come in and we'd spend ages talking about movies and music and general life issues. Over the 3 years I worked in that shop we became good friends and I always thought he was a lovely, intelligent and gentle man who made some stupid mistakes when he was younger due to booze and drugs. I didn't know the exact circumstances, but he was divorced and his son would rarely speak to him. He made it sound like because his wife couldn't cope with his addiction and he was an absent/rubbish father, which is why his son wouldn't talk to him. \nWe lost touch a bit after I left working at the shop, but we would catch up occasionally if we bumped into each other in town. I hadn't seen/heard from him in a while though, and I found out from another mutual friend of ours that I hadn't seen in ages that the reason our friend wasn't about anymore was because he'd recently gone to prison for groomig and raping a 2 year old boy he lived next door too.\n\nI remember my friend talking about the family and how he felt like this kids uncle and part of the family. She was a single mum who was so welcoming to him when he moved in next door. She would bring him round dinners or invite him over for dinner and he would help her to look after her kid when she was working. I was so happy for him because he'd done so well with recovering from his addictions and was making friends in his new neighbourhood. \n\nThis guy was the last person on earth I thought would be a paedo and it makes sick to my stomach still what he did. Made me wonder why his son really doesn't talk to him and why he was divorced. I hope he's still rotting in prison.",
   "created_utc": 1702743303,
   "score": 44,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdmmbcm",
   "message": "When my wife and partner of 12 years died unexpectedly at 49 yrs old, and going through her personal devices I discovered chats with other men... secret bf's. Most were emotional relationships, with sex chats and pictures exchanged. At least one relationship had been physically sexual and went back years before I met her; and this dude would be begging her for more hookups (he knew who I was, and stalked my social media).\n\nMy wife struggled with depression and esteem issues, and she rarely left the house. But she found ways to have men fawning all over her online. I trusted her completely, so I never even suspected. I even chatted with one of her online male friends, and he had no idea that she was married; said that the woman he knew claimed to be single, and was extremely flirty, especially when drunk.\n\nOnce we had moved in together 11 years ago, she cooled towards me significantly, and I never understood why. But now it makes sense--she was getting her emotional needs met through other men.",
   "created_utc": 1702743608,
   "score": 38,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdm2obv",
   "message": "I had a buddy that owned a  mortgage broker company. His business model was to target friends and family to help the secure or refinance their mortgages. Nearly his entire family (to include extended family) and most of his friends used him. Turns out he was siphoning off the equity in the mortgages he was refinancing.  To the tune of pulling in a 40k per month salary. He was caught, thrown in jail for three years but was let out early due to covid.",
   "created_utc": 1702735616,
   "score": 144,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdlljm0",
   "message": "My best friend of 8 years told me I was “too much” to deal with because of my mental illness. I had supported her through breakups and her own mental health issues. It was incredibly hurtful and I don’t know that I’ll ever recover from the rejection, almost a year later and it hurts.",
   "created_utc": 1702726646,
   "score": 113,
   "submission_id": "18jknei"
  },
  {
   "comment_id": "kdnjuro",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18jknei"
  }
 ]
}