{
 "submission_id": "18jm7pp",
 "title": "What do you think are the biggest mistakes being made in handling the Russian invasion of Ukraine, and what should be done differently?",
 "selftext": "",
 "created_utc": 1702712524,
 "permalink": "/r/AskReddit/comments/18jm7pp/what_do_you_think_are_the_biggest_mistakes_being/",
 "score": 9,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jm7pp/what_do_you_think_are_the_biggest_mistakes_being/",
 "comments": [
  {
   "comment_id": "kdl7vhk",
   "message": "The only critique I can think of right now is that President Biden and Chancellor Scholz did not issue clear assurance, at the Vilnius summit, guaranteeing Ukraine's accession to NATO. This ended up showing NATO's perceived inability to put forward strong strategic foresight which the Kremlin would probably find ways to take advantage of.  \n\nThe Vilnius summit should have been used as an opportunity to recognise and find ways to deter Russia's militarism but it did fail to do so. \n\nThis might not be the best example but it's the only one popping to my head at the moment.",
   "created_utc": 1702716968,
   "score": 12,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdlb4e6",
   "message": "Probably not a lot could have been done.\n\nIn a larger picture this is the end of the fossil fuel age and the beginning of the climate migration. These developments will continue to cause tensions.\n\nRussias power will disappear with gas and oil, so this is the last chance for them to do anything as a \"global\" power. I didn't expect them to sacrifice \u0026gt;300.000 people for this (and 2 million that left the country). This only accelerates the demographic and economical collapse.\n\nLong term Putin will go down as one of the most idiotic persons in Russian history (and that's a big competition) for failing to prepare for this change. Probably no one expected him to be this stupid.\n\nA stronger response in 2014 could have been better. But this also could have created an \"evil west\" image in Russia that would have made it easier for Putin to mobilize people.\n\nWorld powers just don't collapse without collateral damage :(",
   "created_utc": 1702719493,
   "score": 7,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdlf78z",
   "message": "America in particular has controlled the flow of weapons to a trickle rather than the flood it needed to be. It’s partly because of partisan politics, but I suspect it’s also partly because a slow war that bleeds Russian military capability is excellent for the US",
   "created_utc": 1702722339,
   "score": 6,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdlhhe3",
   "message": "Large fractions of the populations and politicians of Europe and the US are reacting as if it's some very distant and far away problem, which they're getting tired of and treating like it will probably just go away if they stop paying attention. Nobody appears to have heard the phrase \"a stitch in time saves nine\", where \"stitch\" here means \"standing up to protect a country from being destroyed by Russian tanks\". Do people actually want to live in a world where violent authoritarianism is successful and thus more widely adopted? Because this is how we get there.",
   "created_utc": 1702723913,
   "score": 6,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdl2b57",
   "message": "The Russian military should have been immediately stomped out by every army in the world who has an ounce of common sense.  Putin just proved that we're all a bunch of pussies.",
   "created_utc": 1702712791,
   "score": 5,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdlp38a",
   "message": "Quit letting Elon have control over companies that directly affect national security interests.\n\n\u0026amp;#x200B;\n\nRemember he decided to black out Ukraine to prevent them from coordinating against his master, Putler.",
   "created_utc": 1702728825,
   "score": 2,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdl2ene",
   "message": "The biggest mistake was invading Ukraine. Should have invaded Afghanistan.",
   "created_utc": 1702712861,
   "score": 2,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdld872",
   "message": "Most mistakes were made before the war.\n\nUkrainian president Zelensky until the very last moment was assuring everyone Russia won't attack, despite Biden saying openly and clearly that attack is imminent. That left Ukrainians not prepared as they could've been.\n\nEurope made the mistake of believing that Russia is domesticated and making money is more important for Russians than war. That allowed Russia to recover from Soviet Union collapse. They recovered enough to start thinking of vassalization of Europe.\n\nEurope made the mistake of disarming whole nations, because war is not a 21st century thing, right? \nNobody was ready. Simply no country.\n\nAfter war started the were further mistakes.\n\nMost of Europe didn't really want to help Ukraine militarily . That was mistake and showed Europe is definitely not ready for one European army, as goals of European countries don't align.\n\nUkraine made mistake in Bakhmut. That was unnecessary burden for political gains. Although Ukrainians massacred Russians there, those Russians that died were insignificant from russian point of view as those were mostly prisoners and peasants Russia didn't even want. Besides, Russia has one thing in abundance - people. But Bakhmut gave Russia enough time to prepare defences for later Ukrainian counter offensive that came too late. Zelensky used bakhmut for propaganda reasons to rally support, but paid way too big strategic price.\n\nUkrainian counter offensive happened too late, because many European countries didn't support Ukraine in timely manner. Some gave only warm words and encouragement.\n\nNATO made a mistake of assuming that modern wars will be .. well, modern. Precision strikes and precision rockets are nice, but NATO doesn't really have capacity to cost effective dealing with masses of garbage in the air and land. It is nice to have multi million dollar rockets, but it isn't wise to use them to shoot down smal drones, which comes by dozens at time.\n\nSame with land army - everyone laughed at old soviet tanks, but remember Ukrainians still had to deal with them and that wasn't easy.\n\nUkrainians did a lot of political mistakes that resulted in alienating some allies like Poland or Slovakia. Ukrainians rely on Germany now, but Germany has tendency to over promising.\n\nNATO isn't ready for land war in Europe. That's certain. \nEurope is currently defenceless and rely fully on USA, which is huge mistake.\n\nI'm not optimistic about future of Europe.",
   "created_utc": 1702720974,
   "score": 3,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdl21dz",
   "message": "We should use our giant satellite lasers, cut Russia out of the earth and plant in the middle of Antarctica where they can figure it out from there",
   "created_utc": 1702712593,
   "score": 1,
   "submission_id": "18jm7pp"
  },
  {
   "comment_id": "kdl3ftq",
   "message": "Giving a shit about it is a huge mistake",
   "created_utc": 1702713622,
   "score": 254,
   "submission_id": "18jm7pp"
  }
 ]
}