{
 "submission_id": "18jp0f8",
 "title": "What's your best or worst story involving car dealerships?",
 "selftext": "",
 "created_utc": 1702724761,
 "permalink": "/r/AskReddit/comments/18jp0f8/whats_your_best_or_worst_story_involving_car/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jp0f8/whats_your_best_or_worst_story_involving_car/",
 "comments": [
  {
   "comment_id": "kdlj61z",
   "message": "Favorite is the one that took 2 hours. Least favorite is the one that took 3 trips and 16 hours. Run your businesses better folks.",
   "created_utc": 1702725088,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdljctv",
   "message": "Worst. Only had my car a month. The belt snapped, causing the whole engine to go. Was under warranty. Dealership held my car like three months. As I was under warranty I was their last priority over paying customers. After a month I asked about a loaner car. They said that was not covered in my warranty",
   "created_utc": 1702725211,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdljgox",
   "message": "Drove the Peugeot 206 my dad bought me for 10 years straight. Was a great car! After it completelx broke down i wanted a good car and bought a Vw golf gt r-line. I always wanted a golf and i was really happy with it. After 4 months i had white smoke coming out my exhaust. Motor was damaged. I couldn't give it back nor was i getting any money back, because the dealer didn't sell it to me. He \"provided\" it to me, from a private seller. Even lawyer couldn't do anything. So i had to choice between repairing it for big money or sell it for little money. The car market at this time was HORRIBLE. So the son of my dads friend repaired it. While the car was in repair i lost my driving license. The repairing costed way more. Now my car stands in my garage.",
   "created_utc": 1702725287,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdljx45",
   "message": "My husband and I walked in to a used car dealership, there was a great deal on exactly the kind of car we wanted. We managed to scrape together enough money to pay for it outright. We sat down to fill out the paperwork, and the dealer, after giving his sales pitch, confidently asked what payment plan we needed. We told him cash. He did not seem too happy, there went his extra commissions (I think that’s how it works?) There was even a cash discount, which he all but grumbled at us. Off we went with our first non-hand-me-down car! Finally, a vehicle that didn’t require a blood sacrifice to run.",
   "created_utc": 1702725593,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdlk5g1",
   "message": "played gta and crashed into a couple dealerships, enough said",
   "created_utc": 1702725736,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdlke15",
   "message": "Went to buy an electric car four years ago. Salesman begrudgingly showed me to the car, got in, drove around town with me in the passenger seat. Said ‘ I fucking hate theses things’ gave me a price and said ‘let me know tomorrow’. Rang me the next day looking for an extra 1000. \nI over politely said no.",
   "created_utc": 1702725898,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdlkulg",
   "message": "Was trading in a vehicle that was all wheel drive. Sales manager was arguing with me it was not awd. He got his lead tech who agreed it was awd and still argued with me. I was in the business for 12 years at this point. Like I know if my car is 2 wheel drive or all wheel drive.\n\nNot the worst story ever but i was pissed guy was treating me like I was stupid.",
   "created_utc": 1702726199,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdloqom",
   "message": "1. The salesman left shortly after I bought the car, leaving me nobody with any incentive to help me.\n\n2. They completely ignored my request to transfer my plates from my previous car, so I still had to go to the DMV twice despite my paying then for this.\n\n3. Their \"warranty\" meant they would ship the car their centralized out-of-state garage, with no loaner car in the meantime.",
   "created_utc": 1702728624,
   "score": 1,
   "submission_id": "18jp0f8"
  },
  {
   "comment_id": "kdlvmh4",
   "message": "Worst- bought a used car they only had 1 key/fob. I thought, hey, I'll just get one made. Nope, after 4 trips to the dealer to get one programmed, they tell me they can't cut it. They order me one from the factory but it isn't programmed. Finally able to switch the cut blade(key) to the programmed remote and send back the uncut/unprogrammed unit back to get a full refund from 3rd party vendor.",
   "created_utc": 1702732351,
   "score": 1,
   "submission_id": "18jp0f8"
  }
 ]
}