{
 "submission_id": "18jqluv",
 "title": "What is your favorite example of a massive corporate failure?",
 "selftext": "",
 "created_utc": 1702731164,
 "permalink": "/r/AskReddit/comments/18jqluv/what_is_your_favorite_example_of_a_massive/",
 "score": 66,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jqluv/what_is_your_favorite_example_of_a_massive/",
 "comments": [
  {
   "comment_id": "kdm013f",
   "message": "Target's expansion to Canada was a disaster. \n\nThey spent billions purchasing existing Zellers (Canadian department store) locations from Hudsons Bay Company (HBC). Then they spent 100s of millions more renovating them. They leased more locations to open stores. 133 in total. Due to a variety of issues, mainly distribution problems  -they tanked, Target Canada declared bankruptcy and had to pay more millions to get out of leases and sell their owned real estate. This all happened in about 5 years.\n\nMy favourite part of the story is the HBC took some of the proceeds from the sale of Zellers and bought Saks Fifth Avenue with it. They're recently begun re-opening Zellers",
   "created_utc": 1702734436,
   "score": 177,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm7hwb",
   "message": "Sears was practically built on catalog sales and shipping items to customers. They had the infrastructure in place yet somehow missed out on internet shopping.",
   "created_utc": 1702737694,
   "score": 210,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm0qdo",
   "message": "I worked for Kodak (Qualex) and I will never forget the meeting we had talking about 35mm film. A person said he’s noticing an influx of people looking to print digital photos.\n\nThis was a senior Vice President of Kodak saying, and I quote “this whole digital think is just a fad, it will blow over soon”",
   "created_utc": 1702734749,
   "score": 131,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdlw383",
   "message": "Probably Blackberry, they're an interesting case study in a company being sniped off of what ten years ago had been an undisputed market-leading position by failing to account for changing technology.",
   "created_utc": 1702732592,
   "score": 91,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmhvit",
   "message": "Circuit City “cutting costs” by firing their most experienced salespeople.\n\nThe chain was bankrupt in less than two years.",
   "created_utc": 1702741935,
   "score": 11,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm858t",
   "message": "Southwest airlines last Christmas",
   "created_utc": 1702737976,
   "score": 80,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm25w3",
   "message": "The entire Penn Central disaster. The railroad was massive but terribly managed and lasted less than 3 years before becoming the biggest bankruptcy in US history at the time",
   "created_utc": 1702735390,
   "score": 106,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmffct",
   "message": "American car manufacturers in the 80s. I was buying my first family car and it was between a Ford Taurus wagon and a Toyota camry wagon.  The Ford sales guy said \"Yeah, the Japs have to learn they can't make cars that last 15 years!\" and then laughed. We got the Camry. No wonder the American car manufacturers all had to be bailed out.",
   "created_utc": 1702740975,
   "score": 164,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmdkcj",
   "message": "Lenovo shipping laptops loaded with the Superfish malware.\n\n[https://www.forbes.com/sites/thomasbrewster/2015/02/19/superfish-need-to-know/?sh=25a8a4133877](https://www.forbes.com/sites/thomasbrewster/2015/02/19/superfish-need-to-know/?sh=25a8a4133877)",
   "created_utc": 1702740241,
   "score": 87,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmdpa7",
   "message": "World War II was over.  Germany was a bombed-out smoking ruin.  The victors saw that communism was taking hold in countries with collapsed economies, so they wanted to resurrect the economies of Europe.  They were desperate to just get people working again.  They'd try anything that had a ghost of a chance at working.\n\nThe U.S. essentially told Ford that they'd give them the Volkswagenwerk, the factory that made VWs.  If Ford were to take over, just run this factory and make some cars, get people back to work, they could have it for free.\n\nHenry Ford II told his board of directors: \"Gentlemen, what we're being offered here isn't worth a damn.\"  And declined the offer.",
   "created_utc": 1702740294,
   "score": 51,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmjqc9",
   "message": "Toys R Us expansion into Sweden in the mid 90s. They refused to follow Swedish labour market practice by not signing a [collectiva bargainaing agreement (cba)](https://en.wikipedia.org/wiki/Collective_agreement) with the storeworkers union (Handels). \n\n\u0026amp;#x200B;\n\nThe union took its memebers out on strike while non-union members continued to work. Eventually more unions joined in sympathy strikes which stopped deliveries, cleaning, mail and finally even financial transactions for Toys R Us in Sweden. It is briefly described in this article: https://www.huffpost.com/archive/ca/entry/what-canada-can-learn-from-swedens-unionized-retail-workers\\_n\\_6888328\n\n\u0026amp;#x200B;\n\nIt's one of the most famous labour market actions in Sweden in modern time, where there are extremely few strikes otherwise. However the exact same scenario is happening right now with Tesla this time.\n\n\u0026amp;#x200B;\n\nI should also note that unions work very differently in Sweden compared to the U.S. In Sweden workplaces do not vote on \"unionization\", the union membership is personal and no one is forced to join a union. If a workplace is big enough and have enough union members the union, which is industry wide, will negotiate a standard industry wide cba with the company. The cba covers all workers even those not in a union. The cba only sets a floor with regards to wages, wage increases, insurances, pension pay etc. There are no fees to the union from non members or the company.",
   "created_utc": 1702742643,
   "score": 227,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm53p8",
   "message": "A few with different outcomes.\n\nKendall Jenner stopping riots with a can of Pepsi.\n\nTumblr banning Porn\n\nOnly fans [banning porn](https://time.com/6092947/onlyfans-sexual-content-ban/)\n\nBlockbuster not buying Netflix",
   "created_utc": 1702736665,
   "score": 202,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdms9xk",
   "message": "I don't know if this counts as failure, but Skype had a 10-15 year head start only for zoom to swipe in during the pandemic.",
   "created_utc": 1702745766,
   "score": 171,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm7ocl",
   "message": "Pepsi ran a lottery in the Philippines but when there were more winners than expected they refused to pay out the cash prizes. There were actual riots, a few people died.",
   "created_utc": 1702737773,
   "score": 111,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm9hks",
   "message": "NOKIA\n\nThey were not that big in the US but they dominated the mobile phone market in most of the rest of the world at one point. \n\nWhen the first iPhone came out they were very dismissive of it, we all know how that turned out.",
   "created_utc": 1702738562,
   "score": 138,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm1xcb",
   "message": "The Metaverse",
   "created_utc": 1702735284,
   "score": 154,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm7nrt",
   "message": "The Ford Pinto. Ford knew they had a problem, but they moved forward on the results of a cost-benefit analysis that showed it would cost more to fix the problem than to pay out lawsuits. The judgment in the first lawsuit blew their cost-benefit analysis out of the water because of the lowball number they used as the value of a human life.",
   "created_utc": 1702737767,
   "score": 205,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdlzve6",
   "message": "Yahoo was offered Google for a million dollars , three times and they turned them down.",
   "created_utc": 1702734367,
   "score": 155,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmkhvw",
   "message": "Universal’s Dark Universe. \n\nIn the rush to create a cinematic universe to rival Marvel, Universal was going to do a reboot of their classic monsters (Dracula, the Wolf Man, Frankenstein’s Monster, etc). \n\nAlex Kurtzman was going to be their Kevin Feige, overseeing the entire franchise. The first film was going to be The Mummy, starring Tom Cruise. They made the big announcement that Johnny Depp was going to be the Invisible Man, Javier Bardem was going to be Frankenstein’s Monster, and Russel Crowe was going to be Dr. Jeckyl. \n\nBut what happened? Cruise took over control of the Mummy, turning it into just another vehicle for himself. With fond memories of the Brendan Fraser Mummy films, audiences stayed away, and the Mummy flopped, taking the entire Dark Universe with it.",
   "created_utc": 1702742936,
   "score": 118,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm08un",
   "message": "One of my favorite examples of a massive corporate failure is the bankruptcy of Blockbuster, which failed to adapt to the digital revolution led by competitors like Netflix.",
   "created_utc": 1702734535,
   "score": 29,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdlvt6d",
   "message": "My favorite is when A\u0026amp;W promoted a 1/3lb burger to compete with the quarter pounder. It failed because most people thought 1/3lb was less meat than a quarter pounder",
   "created_utc": 1702732448,
   "score": 24,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdlyxr8",
   "message": "Kodak invented digital photography in 1975. Instead of capitalizing on it, they bought up small companies and focused on traditional film photography.",
   "created_utc": 1702733938,
   "score": 120,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmne1y",
   "message": "IBM. They let Microsoft retain the rights to the PC operating system they put on the IBM PC.",
   "created_utc": 1702744004,
   "score": 31,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdltgpe",
   "message": "X",
   "created_utc": 1702731247,
   "score": 73,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdlwgcg",
   "message": "Arthur Andersen scandel!",
   "created_utc": 1702732763,
   "score": 96,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmag2t",
   "message": "YELLOW F’N FREIGHT..! Darren Hawkins is an absolute POS.",
   "created_utc": 1702738965,
   "score": 26,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmed2q",
   "message": "I'm going to have to go with Union Carbide for that one time when they bought a dilapidated, crumbling pesticide plant in the middle of Bhopal, India, did ***absolutely nothing*** to fix it up before taking over production, then acted all surprised when a massive chemical spill killed every man, woman, and child within half a mile of the place. \n\nIf you include all the birth defects and cancers that popped up in the following decades that were probably linked to the exposure, the death toll is estimated in the 500,000 range.",
   "created_utc": 1702740556,
   "score": 26,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdlty17",
   "message": "New Coke.",
   "created_utc": 1702731501,
   "score": 113,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmbre4",
   "message": "The merge between Mattel and The Learning Company in 2000. Read up on it if you are unaware, this was over twenty years ago and people still study why it soured.",
   "created_utc": 1702739501,
   "score": 46,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmbc5y",
   "message": "It's my \"Favourite\" in that it's the worst one I can think of and an excellent example about how a profit motive unrestrained by safety regulations is a ticking time bomb: [The Bhopal Disaster](https://en.wikipedia.org/wiki/Bhopal_disaster).\n\nA pesticide plant in Bhopal, India owned by a subsidiary of Union Carbide Corporation, an American company, was expected to close in the near future due to anticipated unprofitability. To squeeze every last penny out of it possible, the company all but stopped training their employees and performing preventative maintenance, with the knowledge and approval of the American owners. On the night of 2 December 1984 the plant suffered a massive (preventable) gas leak, enveleoping the surrounding area with ethyl isocyanate, a highly toxic gas. The plant was situated in a highly populated urban area, leading to the immediate deaths of over 2000 people and the eventual deaths of nearly another 2000, and over 500,000 injuries which resulted in  tens of thousands of people being permanently disabled.\n\nThe company was forced to pay a fine to the Indian government.  Seven Indian employees who were at the plant and survived received two years in jail, but the owners, specifically The CEO at the time Warren Anderson despite it being documented that he was aware of the risk of a disaster and ordered the procedural changes, never faced punishment.",
   "created_utc": 1702739335,
   "score": 106,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmvp3f",
   "message": "General Electric. So many Jack Welsh acyolates destroying companies to make a quick buck for Wall Street. \n\nWe could call Bain Capital \"Thanos\" because half the companies it acquires die and the other half are maimed.",
   "created_utc": 1702746966,
   "score": 24,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm560h",
   "message": "The McDonald’s arch deluxe. They lost over $30M on it.",
   "created_utc": 1702736689,
   "score": 43,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmt28n",
   "message": ".... Why is Boeing not further up on this list?\n\nBought their biggest US competitor after they watched it torch itself with Jack Welch MBA cultists. Just ended up eating the MBA cancer too and now it's terminal.\n\n777 - last 100% old B aircraft. Smooth rollout to unanimous praise. The last Great Boeing plane.\n\n787 - amazing generational leap design, but some major problems with production and some typical teething problems with such a new \u0026amp; advanced design. MBA cultists start injecting their poison and production optimized to ~~crush their experienced union workforce~~ allow it to be \"assembled like Legos\" anywhere. All production moved to SC after 2021 despite continued production quality problems that won't go away at SC. Also fuck you WA taxpayers who gave B a huge tax break if 787 production stayed in WA, but holding B accountable would make B have a sad and politically hard and we can't have that now can we? MBA cultists are clearly now in control. Delays and problems cost B ~$6B as of Q1 23. Those extra costs mean less gas in the tank for new projects. Maybe.\n\n737 Max - Old B engineers completely pushed out of all strategic decision making and after Airbus spooked management with the NEO in the 10's, decided to go with a quick slapped together new engine option plus some updating version of the 737 and abandoning project Yellowstone. This is despite old guard B engineers feelings that 737 NG was supposed to be \"the last 737.\" Major hoops jumped through (including jumping through their own asshole) to keep on same 737 type rating at all costs. So much outsourcing. Avionics design flaw makes it through certification due to said outsourcing, corporate malfecense, and FAA regulatory capture and get their pee pee slammed in the car door. Yellowstone aircraft would have cost $10B. Max was supposed to cost $4-5B. Total costs for Max fuck up now north of $20B.\n\nBetween 787 and Max fuck ups, B now behind $25ish billion. Sure would be nice to have that money for the new aircraft they need to bring to market in the 2030's now wouldn't it? Don't forget closing down Long Acres campus in 2021. Old B is now dead.\n\nSLS - What a complete disaster of a program. Over budget, behind schedule, and very nearly a PR disaster with the Artemis 1 launch. Test vehicles still can't even do what they are supposed to do. The worst example of govt pork barrel/make work program and corporate ineptitude.\n\nBoeing is mostly staying afloat by virtue of being the sole large heavy aircraft production company left in USA and is \"too big to fail.\" I dream that Boeing Commercial Aircraft is spun off and they can get back to their roots of designing amazing commercial aircraft.",
   "created_utc": 1702746038,
   "score": 51,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdma5hc",
   "message": "Intel inviting the Japanese to inspect their DRAM facilities.",
   "created_utc": 1702738844,
   "score": 16,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmbsco",
   "message": "MSN messenger",
   "created_utc": 1702739513,
   "score": 17,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmhxcf",
   "message": "George Lucas offered to sell his computer animation company to Disney for $8 Million in the 1980s. Disney balked so he sold it to Steve Jobs instead and it became Pixar.",
   "created_utc": 1702741953,
   "score": 17,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm2gmv",
   "message": "Starbucks in Australia.",
   "created_utc": 1702735520,
   "score": 37,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm6efy",
   "message": "HTC diversifying from doing phones",
   "created_utc": 1702737216,
   "score": 23,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdm8uya",
   "message": "The Walmart expansion into Germany was a total disaster. They blindly tried to force their way onto an extremely competitive market with a completely different work and shopping culture. Most Germans don't even know that Walmart ever existed in Germany and they have since completely left the country at a massive financial loss.",
   "created_utc": 1702738292,
   "score": 27,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmdcw7",
   "message": "Sears.  Who had a store /delivery point in almost every town.  They could have been Amazon or berry but like many companies they ignored the wave of internet store and got pummelled.\n\nImagine a Sears with a website like Amazon and either pickup sites in every town or door to door delivery.\n\nI’m in Canada I kind of miss Sears.  I grew up in a very small town and my family bought most things from Sears.",
   "created_utc": 1702740154,
   "score": 25,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmhhcu",
   "message": "Trump ice,Trump college,Trump vodka,Trump steaks",
   "created_utc": 1702741783,
   "score": 76,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdn5w8l",
   "message": "M and M’s declining to be the candy of choice for E.T. I remember watching the movie in the theaters thinking, “Oh, Reece’s Pieces, that’s cute.” Huge mistake.",
   "created_utc": 1702750562,
   "score": 11,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdn6fr0",
   "message": "Tumblr!!!  \n- 2013 valued at $ 1.1b\n- 2018 bans porn\n- 2019 sells for $3m\n\nThat’s a spicy meatball. \n\nSource - https://junkee.com/tumblr-verizon-sale-porn-ban/217775",
   "created_utc": 1702750753,
   "score": 10,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdna1p0",
   "message": "As a houston resident it is Enron\n\nHad lots of friends who worked there. \n\nOne of them told me he used to enjoy the lavish breakfasts they laid on for their workers - until he realized he was actually eating up his retirement fund every morning",
   "created_utc": 1702751986,
   "score": 11,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdlwqc9",
   "message": "McDonald's 1984 Olympic promo comes to mind.",
   "created_utc": 1702732894,
   "score": 11,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmbdvh",
   "message": "Sears should have been Amazon before Amazon. They had the largest mail order/catalog business in the world, and it would have easily translated to the web, but they were morons who didn’t want to adapt.",
   "created_utc": 1702739353,
   "score": 18,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmpibv",
   "message": "Target trying to enter Canada.\n\nTarget opened and clsoed 133 stores in Canada in less than 2 years. Shelves were empty. Stores were ugly. Canadians hated it. \n\nOverall, it cost Target's U.S. parent company more than $4 billion USD.",
   "created_utc": 1702744773,
   "score": 18,
   "submission_id": "18jqluv"
  },
  {
   "comment_id": "kdmmrx4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18jqluv"
  }
 ]
}