{
 "submission_id": "18jqvle",
 "title": "People who are the best/fastest workers at your job, how do you feel having to do other people’s stuff since you finished your own? Is it just something you’re used to or does it bother you that others are slow and/or lazy?",
 "selftext": "",
 "created_utc": 1702732117,
 "permalink": "/r/AskReddit/comments/18jqvle/people_who_are_the_bestfastest_workers_at_your/",
 "score": 3,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jqvle/people_who_are_the_bestfastest_workers_at_your/",
 "comments": [
  {
   "comment_id": "kdlvslt",
   "message": "I don't do other people's work, I move on to the next thing I need to do.",
   "created_utc": 1702732439,
   "score": 1,
   "submission_id": "18jqvle"
  },
  {
   "comment_id": "kdlwgly",
   "message": "I worked in a very small unit with 5 other dudes that I got on famously with (and still pop down the pub for a fryup with) so when any of us were done with our immediate duties we'd immediately pivot to helping the others.\n\nWe were a real team, and while we all went our separate ways (shit company to work for but the job was cozy) we still keep in touch and talk about the fire i started one time, or one of us trying to chat up the waitress at the thai restaurant we were not NEARLY fancy enough to be eating at.",
   "created_utc": 1702732767,
   "score": 1,
   "submission_id": "18jqvle"
  },
  {
   "comment_id": "kdlv8gi",
   "message": "I used to get annoyed by it but not anymore . It’s that “fine, I’ll do it myself” view I have on it nowadays. Better me the right way than them fucking it up.",
   "created_utc": 1702732161,
   "score": 1,
   "submission_id": "18jqvle"
  },
  {
   "comment_id": "kdlwfi2",
   "message": "I quit and they closed not even a year later lmao",
   "created_utc": 1702732751,
   "score": 1,
   "submission_id": "18jqvle"
  },
  {
   "comment_id": "kdlwtt8",
   "message": "Aside from my regular clients, part of my job is to be a ‘gap filler’ which entails helping out at other sites to get the job done. Normally it’s just to help finish up caz we’re understaffed and the jobs are big ones but it genuinely shits me off when the reason for them being behind is caz someone was being slow or just plain lazy. At that point I’m not helping to finish I’m instead doing whole damn sections that should have been finished. Sadly if I’m on a site with certain people I’ve come to expect this kind of fuckery so I guess I’m used to it",
   "created_utc": 1702732937,
   "score": 1,
   "submission_id": "18jqvle"
  },
  {
   "comment_id": "kdlx2bs",
   "message": "I move at a steady pace,  not fast. If I'm faster than my co workers it's because they're lazy.",
   "created_utc": 1702733048,
   "score": 1,
   "submission_id": "18jqvle"
  },
  {
   "comment_id": "kdlxto6",
   "message": "At some point I realized that other people were not \"lazy\" or \"slow\".  I'm fast.  Changed my perspective a lot.  It bothers me a lot less now.",
   "created_utc": 1702733411,
   "score": 1,
   "submission_id": "18jqvle"
  }
 ]
}