{
 "submission_id": "18jscs5",
 "title": "What’s something that you consider a red flag that others might consider a green flag?",
 "selftext": "",
 "created_utc": 1702736913,
 "permalink": "/r/AskReddit/comments/18jscs5/whats_something_that_you_consider_a_red_flag_that/",
 "score": 219,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jscs5/whats_something_that_you_consider_a_red_flag_that/",
 "comments": [
  {
   "comment_id": "kdmuaa9",
   "message": "The Nigerian flag. I'm colorblind",
   "created_utc": 1702746458,
   "score": 137,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn7p04",
   "message": "Talking like a Tiktok psychotherapist: every single situation or interaction is about trauma and healing and setting boundaries and weirdly medicalised.\n\nBeing aware of your mental and emotional heath is definitely good, but when every moment or feeling is pathologised it definitely crosses into red flag territory.",
   "created_utc": 1702751179,
   "score": 126,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmejfs",
   "message": "People who ask about red flags and green flags. Seems like ai trying to be more human. This is my tinfoil hat and I wear it proudly.",
   "created_utc": 1702740630,
   "score": 112,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmymeb",
   "message": "Being very hard working and career-oriented. They tend to be distant once the early fun days are over and will pick work over life most the time. I'd rather have a fun loving partner and live less high on the hog than have a partner who spends 80% of their free time working or talking about work related things. Like works over now it's time to fuck around and talk about fun stuff",
   "created_utc": 1702748034,
   "score": 17,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmjptj",
   "message": "At Corporation Inc. we treat everyone like family. \n\nWhich really means they are going to call you at all hours of the day, expect you to work on your day off and give you cookies/pizza/coffee as a reward instead of actual pay raises.",
   "created_utc": 1702742637,
   "score": 86,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmv83o",
   "message": "Using a lot of therapy speak, Meyers-Briggs, dark triad, etc. \nIt's the modern equivalent of \"if everyone you run into is an asshole...\"",
   "created_utc": 1702746797,
   "score": 166,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdm7o8x",
   "message": "Jealousy. Some people apparently think it's cute, or that it \"shows that they really love me\". Nah. Get out of here with that shit.",
   "created_utc": 1702737772,
   "score": 45,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn402o",
   "message": "I really don't understand why people think it's healthy to have a staunch, even angry, opposition to talking about past relationships.",
   "created_utc": 1702749919,
   "score": 97,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmlq3s",
   "message": "Being religious. I’m not hardcore anti religion by any means, I just prefer my gf to also not be religious.",
   "created_utc": 1702743391,
   "score": 210,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdnkjt5",
   "message": "When someone describes themselves as \"career driven\" on a dating app. Nothing objectively wrong with being motivated, but here in Toronto, anybody I've met who described themselves that way, their work was their entire personality, their obsession, and they had no life of any kind underneath it.",
   "created_utc": 1702755587,
   "score": 37,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmplhd",
   "message": "What the fuck is reddit’s obsession with red and green flags? Just stop already.",
   "created_utc": 1702744806,
   "score": 240,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdm7pnm",
   "message": "*They're the same flag.*",
   "created_utc": 1702737787,
   "score": 71,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmqi1l",
   "message": "Possessiveness",
   "created_utc": 1702745128,
   "score": 46,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn062q",
   "message": "Talking about how much money they have or how many nice and expensive things they have. We all like money. How nice for you that you have plenty of money. If you gotta talk about it all the time, it's probably the best thing about you, which speaks volumes.",
   "created_utc": 1702748586,
   "score": 52,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdnngxg",
   "message": "Pranks, usually seen as having a sense of humour but just a plain red flag to me",
   "created_utc": 1702756592,
   "score": 28,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn7hm1",
   "message": "Being overly passive.  If I have to come up with all ideas and activities and you have nothing to offer,  why would I want to spend time with you?",
   "created_utc": 1702751110,
   "score": 50,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmw2yw",
   "message": "Being \"god-fearing\". Some people seek this quality out. I run away.",
   "created_utc": 1702747100,
   "score": 103,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdo27rr",
   "message": "Lying to someone to supposedly protect their feelings. This is NOT a positive trait, they are dishonest, regardless of the reason.",
   "created_utc": 1702761729,
   "score": 36,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmemh5",
   "message": "A lot of the time people love it when they meet someone who seems super helpful and generous. \n\nFor me, it puts me on the lookout for someone who has trouble with boundaries or who has low self-esteem.",
   "created_utc": 1702740661,
   "score": 115,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn566l",
   "message": "Crystals, energy, religious\n\nAstrology, but only if it’s like a core personality trait and not just a “it’s fun to believe” type thing.\n\nCalls more than 2-3 people narcissist \n\nPlaces fault on other people for everything negative in their life\n\nWhen their friends shit talk men often",
   "created_utc": 1702750320,
   "score": 42,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn953f",
   "message": "A green flag, when you're colourblind.",
   "created_utc": 1702751672,
   "score": 7,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn78fx",
   "message": "Anyone who gets super into pop psychology regarding relationships. Stuff like love languages. It's okay to utilize that kind of stuff to help express yourself, but anyone who sees that kind of stuff as the absolute truth is not good. \nEach relationship is different and changes throughout. There's not final, permanent category that fits always.",
   "created_utc": 1702751024,
   "score": 24,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmfq3s",
   "message": "\"We never fight/argue.\"\n\nWhen I hear this about a couple, I think it's possible they actually don't communicate well and/or one or both of them is conflict-averse, which is bad.\n\nConflict is not the same as abuse. It's inevitable in a healthy relationship and shouldn't be super scary.\n\nEDIT: I added \"argue\" with fight, because in this context it's the same. The idea is that they feel they have a conflict-free relationship and, as I say, this could ***possibly*** mean that they have issues communicating or tolerating healthy amounts of conflict.",
   "created_utc": 1702741092,
   "score": 120,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn02f5",
   "message": "Me talking to some friends: \"She was judging me for my Android phone giving her the green text bubbles, that was a big red flag.\"  \nFriend: \"I think your green text bubbles *are* a red flag.\"",
   "created_utc": 1702748549,
   "score": 27,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdm70v2",
   "message": "Brags that he's a \"Patriot\". It screams radical right to me.",
   "created_utc": 1702737489,
   "score": 105,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdnrj3l",
   "message": "Making your political views your entire personality, right or left you're both extremely annoying.",
   "created_utc": 1702757995,
   "score": 10,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdoou7p",
   "message": "A guy who'll get in someone's face if they insult me, and will \"defend my honor.\" No thanks.\n\nI've seen some people who seem to think it's romantic, even if the guy is literally starting fights, but all I see is a nasty temper I want nothing to do with.\n\nYou can stand up for someone while also knowing what battles are worth fighting.",
   "created_utc": 1702770224,
   "score": 6,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmvmge",
   "message": "Valuing partners based on financial/career success or social status. I'll bust my ass to provide with no expectation a woman ever has to work, even really around the house, but if she wouldn't be with me if I hadn't gotten a good lot in life and came from a decently stable family and ended up STEM-educated with a good career then... fuck that. I get money and social status are important for attraction in women but I just can't. You need to respect me for me or it won't work.\n\nAlso, as others noted, religion, puritanical ideology, friends with exes, maintaining \"backups\" during a committed relationship, etc.",
   "created_utc": 1702746939,
   "score": 13,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdov5yn",
   "message": "Super religious",
   "created_utc": 1702772826,
   "score": 4,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmydrd",
   "message": "Anti-vaxxer",
   "created_utc": 1702747948,
   "score": 25,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn6hjc",
   "message": "A green flag but that might be because I’m colorblind",
   "created_utc": 1702750770,
   "score": 7,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdng2gl",
   "message": "Disdain for my solitude \nI’m not lonely and I’m not cheating, I just enjoy not thinking about anyone else at all",
   "created_utc": 1702754041,
   "score": 7,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmaqj3",
   "message": "Friends with exes especially if its a bunch of exes\n\n\nEither you make a habit of sleeping with “platonic” friends or you have a lot of difficulty letting people go. Neither appeals to me.\n\n\nDoesnt help that most people i know that cheated did so with exes or “friends”",
   "created_utc": 1702739089,
   "score": 59,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdnro2t",
   "message": "killing bugs",
   "created_utc": 1702758045,
   "score": 3,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn11co",
   "message": "Smoking",
   "created_utc": 1702748902,
   "score": 9,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmaxcu",
   "message": "I wish this question was reversed",
   "created_utc": 1702739167,
   "score": 9,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdmgr98",
   "message": "Not liking cats.\n\nCats have strict boundaries that need to be respected or theyll attack you in self defence. Dogs will jump on youjust for existing, whereas cats require you to EARN their trust before giving love and affection\n\nAnyone who says they hate cats because the cat attacked: RUN! That person disregarded the very clear warning signs of the cat meaning they'll likely ignore your boundaries too.\n\nA cat swishes its tail, tilts ears back, stiffs its fur and curls its claws as a warning. Often over the course of a few seconds. You cant just run up to them and pat them. Cats make it VERY clear they arent happy before they swipe",
   "created_utc": 1702741496,
   "score": 38,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn1xjs",
   "message": "Having a very close relationship with their parents/siblings. I’m not talking about a regular respectful, healthy relationship. I’m talking about people who are being called/texted by their family on a daily basis, constantly being asked to help out with kids/holidays/etc, going to family functions every weekend. A lot of people desire this close-knit family dynamic, but it’s not how I want to interact with my family, and it doesn’t work for me. Too exhausting.",
   "created_utc": 1702749206,
   "score": 9,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdn8iai",
   "message": "Their kids or dogs behave badly.",
   "created_utc": 1702751453,
   "score": 6,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdnyoem",
   "message": "Eating oatmeal",
   "created_utc": 1702760540,
   "score": 2,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdo656h",
   "message": "Someone who’s really family-oriented. They’ll choose their mama over you every time. They’ll pressure you for kids. Their families will pressure you for kids.",
   "created_utc": 1702763079,
   "score": 2,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdo8u53",
   "message": "When someone of adult age is too bubbly and cute",
   "created_utc": 1702764043,
   "score": 2,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdogqxg",
   "message": "People who are overly friendly or charming. It can sometimes be a smoke screen for narcissism, but not always. I stay back and observe them and the people around them first before deciding.",
   "created_utc": 1702766983,
   "score": 2,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdogu7i",
   "message": "Non-stop talking",
   "created_utc": 1702767019,
   "score": 2,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdoic6v",
   "message": "Brags about how much they earn",
   "created_utc": 1702767594,
   "score": 2,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdoyap3",
   "message": "Showering them with gifts",
   "created_utc": 1702774130,
   "score": 1,
   "submission_id": "18jscs5"
  },
  {
   "comment_id": "kdnjwuz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18jscs5"
  }
 ]
}