{
 "submission_id": "18js7qk",
 "title": "What helped you stop comparing yourself to others?",
 "selftext": "",
 "created_utc": 1702736471,
 "permalink": "/r/AskReddit/comments/18js7qk/what_helped_you_stop_comparing_yourself_to_others/",
 "score": 13,
 "url": "https://www.reddit.com/r/AskReddit/comments/18js7qk/what_helped_you_stop_comparing_yourself_to_others/",
 "comments": [
  {
   "comment_id": "kdm4twb",
   "message": "Getting older and losing the ability to give a fuck what others thought of me.",
   "created_utc": 1702736550,
   "score": 25,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm75nj",
   "message": "1. Realizing you only compare the features you are insecure about, and that everyone else does the same thing with you. Ex. My best friend is an average sized woman while I am very skinny. I compare my body to her bc I wish I wasn't as skinny and she compares herself to me because she wishes she was skinnier. In the end you realize it's just not productive.\n\n2. More for comparing your life / accomplishments instead of physique: realizing you really have 0 idea what's going on in someone else's life. Maybe someone I know has a way better job than me but his family is toxic while mine is amazing. Maybe someone is better than me at my favourite hobbie but they're infertile and that makes them feel horribly. You just never know and you can never actually know if you'd rather be in their shoes than your own.",
   "created_utc": 1702737548,
   "score": 4,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm5hgk",
   "message": "If you only spend time comparing yourself with others, you'll never give yourself time to grow yourself.",
   "created_utc": 1702736831,
   "score": 3,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm5hqa",
   "message": "I like to see other people do better, as the more good people in the world, the better the world will be. Also I have an internal sense of self, so I couldn’t care less what others think.",
   "created_utc": 1702736834,
   "score": 3,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmfbnz",
   "message": "Deleting instagram account",
   "created_utc": 1702740936,
   "score": 3,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmkj9x",
   "message": "Getting older and realizing no one is perfect.",
   "created_utc": 1702742949,
   "score": 3,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdniv72",
   "message": "Relearning to give zero fucks.  Nobody has been through what I have,  and vice-versa.  When we compare ourselves to only our former self, that is the accurate comparison.  I b also realized this life is far too short to care too much.",
   "created_utc": 1702755004,
   "score": 3,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm4u5n",
   "message": "Once I hit 30 I really did not care that much anymore",
   "created_utc": 1702736553,
   "score": 2,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm53mi",
   "message": "This is hard for me to do 😔😔😔😔😔😞😞😞😞😞",
   "created_utc": 1702736664,
   "score": 2,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm86hp",
   "message": "I got old. I now don’t give a flying fart what people think of me.",
   "created_utc": 1702737990,
   "score": 2,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm8cxy",
   "message": "I learned to appreciate my own uniqueness. Comparing oneself to others is a lose-lose mental game. Find a win-win mental game to play instead, like appreciating that we are each a unique individual experiencing life differently. None of us is better or worse.",
   "created_utc": 1702738071,
   "score": 2,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm8wq4",
   "message": "[removed]",
   "created_utc": 1702738315,
   "score": 2,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmaxr9",
   "message": "Have so much shit on my plate that I couldn't give a fuck what you have going on.",
   "created_utc": 1702739171,
   "score": 2,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm5yc9",
   "message": "Psilocybin. Ask your doctor if psilocybin is right for you.",
   "created_utc": 1702737030,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm5y23",
   "message": "My big 🍆",
   "created_utc": 1702737026,
   "score": 0,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm5pp4",
   "message": "My ignorance",
   "created_utc": 1702736926,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm6g3z",
   "message": "I just accepted the fact that there is always someone better than you.",
   "created_utc": 1702737238,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm7tyr",
   "message": "Deleting social media. It was sapping my attention span and I was constantly comparing myself to everyone else. \n\nAfter deleting all social media from my phone I had severe withdrawal for a week or two but after that I've never been happier or more content in myself.",
   "created_utc": 1702737840,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdm8tel",
   "message": "In order to feel better, and so that my inner dialogue can be kept positive, I feel best if I don't care about what others think of me. Or comparing myself.\n\nLife becomes more fun if I feel that inner liberating joy.",
   "created_utc": 1702738275,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdma3mq",
   "message": "Having big dick energy even if my real dick is small",
   "created_utc": 1702738823,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmb0ms",
   "message": "their own thing, like bro why should i compare to someone who not follow the same thing as i?",
   "created_utc": 1702739202,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmbv65",
   "message": "Practice and age.",
   "created_utc": 1702739544,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmfpxs",
   "message": "Cause I seldom like other people. And I really myself.",
   "created_utc": 1702741090,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmfs5m",
   "message": "realizing there are too many differences between people-its like comparing apples and oranges",
   "created_utc": 1702741117,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmglrt",
   "message": "Therapy. Lol. Found out I had an inner child trauma because my mum compared me to others my whole life since I was really young.",
   "created_utc": 1702741439,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmh2gr",
   "message": "Age. Your mind fine tunes itself on focusing at things that really matter. Keeping up with the Jones' is not one of them.",
   "created_utc": 1702741624,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmhz2g",
   "message": "When I was a teenager, I took LSD a few times. One of the epiphany's that I had was that if I was born into your family, with your biology, your strengths and weaknesses, etc. that you would be me and vice versa. So I try to treat everyone as myself but living a different life.",
   "created_utc": 1702741971,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmqsuo",
   "message": "I just stopped giving a shit",
   "created_utc": 1702745238,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmrdg6",
   "message": "being egotistical is the only answer, honestly how is “believing in my uniqueness” work cus no tf you don’t. when you stop comparing yourself to others you think to yourself that ur actually so much more and somehow you get self centered. it can be a good thing or bad, depends on how ur gonna use ur egotistical ass most of the times its bad.",
   "created_utc": 1702745444,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmsioh",
   "message": "When I realised it was unfair to the others. They're trying their best.",
   "created_utc": 1702745849,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmtqyt",
   "message": "Tbh I never really compared myself to others, I am Amazing to myself and nobody is Worthy enough for me to compare myself to them! Another person’s beauty is not the absence of your own and another persons success is not the absence of your own either.",
   "created_utc": 1702746277,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmtugh",
   "message": "Honestly...Karma. \n\nOlder sister bullied me for years and made me go in and out of depression. \n\nNow she's currently going through a divorce, is relying on our parents for some money to help her out and is probably going to go through a very difficult time. \n\nI actually kinda feel sorry for her, despite what she put me through. But I'm not gonna open arms either.",
   "created_utc": 1702746309,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmux2f",
   "message": "Getting rid of Facebook. Massive improvement in my life. I was feeling like crap comparing myself to peoples lives I don’t even want.",
   "created_utc": 1702746690,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdmxnuo",
   "message": "Succeeding by my own standards.",
   "created_utc": 1702747685,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdn1kjf",
   "message": "When I realized that they probably don't go home thinking about you anyway, and it's not worth giving that much energy into trying to impress someone else when you could just impress yourself.",
   "created_utc": 1702749082,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdn21t6",
   "message": "It was an intentional decision to take back my power. If you're the type to compare yourself to others then you're at risk of being treated badly by people who will compare you to others (parent, toxic SO, etc...). \n\nWhat helped was faking it until it became normal. Repeating daily \"I am not better than anyone and nobody is better than me\". This includes everyone. Celebrities, royalty, etc. The world wants to place you in a hierarchy but they can't if you're not the type to compare yourself. I don't exist to be compared to people.",
   "created_utc": 1702749248,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdn58om",
   "message": "Depression, i don't need to compare myself to others when I know they're always better",
   "created_utc": 1702750343,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdn5lrn",
   "message": "I started valuing the unique qualities I have. People can either choose to value them too, or move on, it makes no difference to me.",
   "created_utc": 1702750463,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdnb8yd",
   "message": "The day I experienced that when people speak, they only speak about themselves, their worries, their ego, their life, even if they speak about you or other people. I understand it a long time ago, but only in theory, and I made big progress when I experienced it during a conversation with a friend.\nIt helped me a lot to understand this, that people are self centered, and that when they criticise you, it's more about the expression of their feelings, their frustrations, theirs ideas, theirs insecurities, their desires, than you.\nAlso : we only do what we can. \nBut to understand in theory to stop comparing yourself to others and to experience it, it's a huge way. Hard way.",
   "created_utc": 1702752395,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdnltuq",
   "message": "I'm busy dissociating",
   "created_utc": 1702756030,
   "score": 1,
   "submission_id": "18js7qk"
  },
  {
   "comment_id": "kdo1a56",
   "message": " Others being such shitty people.",
   "created_utc": 1702761416,
   "score": 1,
   "submission_id": "18js7qk"
  }
 ]
}