{
 "submission_id": "18jvv2w",
 "title": "People who saw someone die, how did you feel at that moment?",
 "selftext": "",
 "created_utc": 1702747183,
 "permalink": "/r/AskReddit/comments/18jvv2w/people_who_saw_someone_die_how_did_you_feel_at/",
 "score": 74,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jvv2w/people_who_saw_someone_die_how_did_you_feel_at/",
 "comments": [
  {
   "comment_id": "kdmx8jw",
   "message": "It was a slow and painful death. When the person in question took their final breath I was sad that I had lost them but also relieved that they were no longer suffering. The true feeling of loss didn’t really hit me till the funeral.",
   "created_utc": 1702747531,
   "score": 180,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn4pio",
   "message": "My mother died in my arms, will never forget the feeling of compleat shock and devastation.",
   "created_utc": 1702750159,
   "score": 10,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnsoy8",
   "message": "I was 13. The person who died was my dad, 34. 12-12-1999 Dropped dead of a heart attack right in front of me on a Sunday evening. Initially I was scared, confused and upset. After a few days I felt all alone with nobody to look out for me. I’m 37 now and I remember it like it was yesterday.",
   "created_utc": 1702758423,
   "score": 163,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdmycuv",
   "message": "Sick, tried to save him, he bled out, saw life leave him, literally, afterwards he was jist like a doll.\n\nWas a man, around 6,2 tall, fell, hit his head on the sidewalk, cracked like a watermelon and the noise was something i won't forget easily. There was that feeling of \" is this really happening?\" mixed with adrenaline and impotence, as soon as i saw him i knew he would die, still tried to save him. His wife screams echoed like i imagine a banshee would sound like, gave me chills",
   "created_utc": 1702747939,
   "score": 140,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn5n5m",
   "message": "Extremely confused. I was staring at my my grandmas face when she was in a coma. She had tears rolling down the side of her face when she flatlined. I walked away and told my dad, then left the hospital with my mum like nothing happened.\n\nI don't know why but I didn't cry when she died. Not even at the funeral. I think I was too young to know what was happening.",
   "created_utc": 1702750477,
   "score": 113,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoat0x",
   "message": "I watched my Sister in law die from cancer. She came around the house pretty often before she got sick. We would play TTRPG's, Video Games, Go out to eat, talk alot. She was my Wife's best friend. \n\nOne day, She called to tell us she was in the hospital. She was bleeding alot, and needed a blood transfusion. They gave her one, and got her blood count back to a point that could be considered \"normal\". They discharged her and she went home. She ended up in the hospital the next day, still bleeding. We knew something was up, but not sure what. Doctors said it was because she had PCOS and she was overweight. They did the same thing, got her blood count back up and shipped her home. \n\nThis was rinse and repeat for months until her and her dad decided to move a few hours north to a different part of the state. She didn't even want to initally go up because she was afraid she was going to bleed out in the car before she could get to the new house, but eventually she made the trip up on a good day and started the process of unpacking. Got a few boxes opened up and set up her Xbox before she ended up in the hospital again. \n\nCancer. Uterine, Stage 4. We didn't know how far along it was at this point though. We thought there was hope, Get rid of the Uterus, Chemo, Radiation, whatever needed to be done to get her better. She stayed in the hospital for a month this time. They were trying to do everything they could to stop the bleeding first, so they could then operate and remove her Uterus. And they eventually were able to get the bleeding to stop. It wasn't getting any better though. My Wife and I would drive 4 hours 2-3 times a week to see her. Just to spend some time together like we always did. \n\nThen one day, she had to be intubated.  She couldn't talk anymore with the tube in her mouth. But she needed it to breath for the time being, so we still came by as often as we could, because there was moments where we could catch her awake, and we wrote to each other on slips of paper and napkins, just letting her know we are here and trying to occupy her mind while shes stuck in the bed unable to move or talk. She then got a trach tube put in and we thought \"She might be able to sit up and sorta talk again, with some effort, but its progress!\" Her doctors said she was doing well enough to start Chemo. And They did the first session, and she wasn't feeling great but that was expected after the chemo. She was on a feeding tube, and still in the hospital, but she could text and communicate with us again, she was lucid, and she could make jokes. We felt like we were one step closer to having her back. \n\nWith her doing so well, my Wife decided that we should stay home this weekend, it's valentines day weekend after all, and we can go up next week to see her. Let us spend some time together for the holiday that is for couples. And we did. and We texted her, and made sure she knew that we would see her next weekend like we normally would. \n\nWe woke up to a phone call from their dad. \"You gotta come up here now. She's coding, and we don't know how much longer we have with her. She's in a bad way.\" We rushed to get ready, jumped in the car, filled it with gas and raced up to the hospital, 4 hours away. We get there and it was an absolute horror show. He eyes bulged from her face like the pressure was going to make them pop out at any minute. She was gasping for air, even though she hadn't been breathing through her mouth for months now. It was so painful to witness, but this was it for her. She was alive at this point, but within 30 minutes of getting to the hospital, she had another heart attack, and was gone. We all stood around her in her last moments. Letting her know exactly how much she ment to us. I  don't know if she heard what we said, or if she was even aware of what was happening when we got there, but part of me felt like she knew we were coming, and held out for as long as she could have to say goodbye. It was just so crushing, all the work she had put in just to go out like that. In the end, it was sepsis, Caused by an infection she developed after her first chemo treatment that took her out. \n\nI've had to watch my wife and father-in-law cope with the loss of a best friend, daugher, sister, caregiver, and confidant. I've had to stay stoic and strong for them, but it's been so hard. Right now, My Wife and Father-in-Law are visiting the place where we spread her ashes earlier this year, Black Rock Mountain in Georgia. It was her personal request to be spread with her mom, at the top of that mountain. I wish that it didn't play out the way it did, We miss you Nicole.",
   "created_utc": 1702764737,
   "score": 31,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn5we9",
   "message": "A worker got crushed by a small pile of I-beams wich fell from a crane. It smashed him into pieces and his head and one arm was only sticking out. I was puzzled at first. Came in to check out. Solid dead. I felt sorry for the guy. I attended his funeral ( i knew wich one because it is a small town so a death message was something new, the name was also in the local newspaper. If it was not him then i was on a random guy's funeral). Later on i did not think much about it",
   "created_utc": 1702750564,
   "score": 80,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn2eyq",
   "message": "Like I got to witness something that came as close to a holy moment as could be. Granted, as a mortician I am used to dead people, and the death came after a long illness, so he finally looked peaceful.",
   "created_utc": 1702749378,
   "score": 101,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn7sic",
   "message": "I was in a sit-in dispersion. It was extremely violent over 100 dead. I was just running with my head down, seeing blood and hearing bullets. I literally had zero thoughts except something telling me that I'm a coward for not helping those who couldn't run.",
   "created_utc": 1702751212,
   "score": 60,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnvi98",
   "message": "I had more important things to do. Yeah. Right... Here's the story, excerpted from a much longer post, [The Third of July](https://www.reddit.com/r/MilitaryStories/comments/k8jfk2/the_third_of_july_repost/), set in 1968, Vietnam. Decades later, I still couldn't write it up. Then this...\n\nReddit poked at me when I wasn’t ready - some random post on AskReddit - \"For those who have had someone die in their arms, what were your final words to them and what were their last ones?\"\n\nThe first thing that came to mind was: “Is Newingham okay?”\n\nThose were the last words I heard from Sergeant Clark.\n\n\u0026gt;Dial the timeline backward a couple of months: I was having a tough time keeping a recon sergeant. Nothing serious, just bad luck. One got a small piece of shrapnel. The battery sent out another one, and he got some kind of bad fever. The next one had volunteered because the battery was boring. He lasted a week. Then he sprained his ankle hopping out of a helicopter, and rode that medivac all the way back to the battery where he decided it wasn’t as boring as he thought.  \n\u0026gt;  \n\u0026gt;This was 1968, I Corps, Vietnam, north of Huế, south of the DMZ. I was an artillery Forward Observer working with the ARVN 1st Division as they try to become airmobile jungle fighters. I was a 2nd LT, about 20 years old. I was supposed to have a Recon Sergeant and a radio operator in my Forward Observer Team, and I had neither of those things.  \n\u0026gt;  \n\u0026gt;Early June, my ARVNs were taking a break, so I headed up to my battery at Quang Tri. Word had gotten around about me. My OCS buddy, Killer Joe , who had taken to living in the Fire Direction Control bunker, told me that just the rumor of my approach had sent sergeant E5s scrambling for invisibility. I was bad luck.  \n\u0026gt;  \n\u0026gt;I didn’t care. I could carry my own radio. Wasn’t sure what a Recon Sergeant even does - never had one long enough to find out. I was looking for mail, shower and chow, in that order.  \n\u0026gt;  \n\u0026gt;But no. I was haled to battery HQ by a runner. In the HQ tent I found the battery commander, an overweight National Guard Captain, yelling at a buck sergeant. “You will go on this assignment or you will face a court martial!” The Sergeant was leaning against a tent pole. “I’ll think about it,” he said. Then he turned and walked out.  \n\u0026gt;  \n\u0026gt;My turn. The Captain said to me, “Lieutenant, I want you to straighten that young man out.”  \n\u0026gt;  \n\u0026gt;Uh, right. “How old is he, Sir?”  \n\u0026gt;  \n\u0026gt;The Captain riffled through some papers. “He’s twenty-five. Is that a problem?” Well yuh. But I didn’t say anything. “This is his second tour, and he’s got a serious attitude problem! I want you to take him in hand. He is your new Recon Sergeant.”  \n\u0026gt;  \n\u0026gt;Yeah, I’m twenty, boss. I’ve been in country barely four months. Don’t think this is a good fit.  \n\u0026gt;  \n\u0026gt;I didn’t say that. I said, “Yes Sir.” Then I saluted and made a beeline for my jeep. Maybe I could get out of here before anyone noticed. Screw the shower and chow. I already got my mail.  \n\u0026gt;  \n\u0026gt;Too late. A tall, lanky, blond sergeant plopped himself in my passenger side. It was the Captain’s problem child. Rats. “I guess I’m with you,” he said. He had packed a ruck. Huh. “What’s your name? I’m Chuck.”  \n\u0026gt;  \n\u0026gt;“I’m Lieutenant AnathemaMaranatha.”  \n\u0026gt;  \n\u0026gt;“Naw man. What’s your *name*?”  \n\u0026gt;  \n\u0026gt;“My parents call me Rick. You can call me Sir or Lieutenant or El Tee or Two-eight \\[my radio call-sign\\].”  \n\u0026gt;  \n\u0026gt;“Fuck. Really? Okay then. You can call me Sergeant or Sergeant Clark.”  \n\u0026gt;  \n\u0026gt;I was good with that. I decided I wanted that shower after all.  \n\u0026gt;  \n\u0026gt;And then off we went. We spent a good deal of time together in the deep bush. You can’t maintain the officer/enlisted separation under those conditions, but Clark seemed to like the idea of it. I don’t know how to account for the turnabout, but he decided he wanted to be a part of the team, and I found out what a Recon Sergeant was for. Clark knew some artillery, and he picked up on the art of fire adjustment with little effort. We were a good team, and he covered my back when I needed it.  \n\u0026gt;  \n\u0026gt;It’s hard to explain how these things work. You can get to a point of complete trust without even liking each other. I couldn’t tell you today if I liked Clark. But he could have my last pair of dry socks, no questions asked. I don’t think there is a higher level of trust between soldiers. Maybe you had to be there.  \n\u0026gt;  \n\u0026gt;Weeks later, we were suddenly sent a radio operator, Private Newingham. He was also a tall, skinny kid, but had no attitude at all that I can remember. I still crack up from overhearing Clark instruct him in the niceties: “That’s the Lieutenant. His first name is Rick. You don’t *ever* call him that. He is Lieutenant, or El Tee, or Two-eight. I’m Clark. You will call me Sergeant Clark or Sergeant or Sarge. Got it?”  \n\u0026gt;  \n\u0026gt;Damn. Say what?  \n\u0026gt;  \n\u0026gt;Newingham was only with us for one operation. On the second one - this one - he had to be lifted out off the PZ due to a high fever. Clark had been kind of mother-henning our FNG - Newingham wasn't used to the jungle. Clark had been teaching him. Clark worked pretty hard at it. Was impressive. Both of them were becoming better soldiers.  \n\u0026gt;  \n\u0026gt;Clark carried the radio, and I carried a lot of his stuff. When we found out we weren’t getting a ride back to basecamp on the second day, we rode shank’s mare back towards home. We kept going downhill until we emerged from the mountain jungle into the foothills covered with thick bamboo outside of Huế. Then we bumped into about a company of North Vietnamese Army.  \n\u0026gt;  \n\u0026gt;It happened fast. First thing I knew there was firing, then a shout of “***Súng côi!***” \\[Mortars!\\], and then mortar incoming started walking toward our position. I had my rifle apart for some reason. I sort of threw all the pieces in the air, and slammed it all together. I rolled over backward into a shallow crater and landed right on top of Clark. The mortar explosions were getting closer, so I told him to hunker down ferchristsakes, and he told me my boot was on his ear.  \n\u0026gt;  \n\u0026gt;Then mortars. They came through, and then they were gone. I got up to get to our radio so I could call in artillery fire, and Clark said, “Lieutenant, I’m hit.”  \n\u0026gt;  \n\u0026gt;I said, “No way you’re hit. I was on top of you.”  \n\u0026gt;  \n\u0026gt;But he was hit. In the head and neck. Bleeding in bursts. A couple of ARVN medics came over. I was trying to make the bleeding stop, but there was too much of it. Clark looked at me and said, “Is Newingham okay?” I said, “Yes, he’s fine. He’s back at base by now.”  \n\u0026gt;  \n\u0026gt;Those were the last words he said. I think he died before the medevac came in. I don’t know. I had to shoot artillery. They were yelling at me while I was trying to help him.  \n\u0026gt;  \n\u0026gt;The *Thiêu tá*, the Battalion Commander, was moving out to the point of contact. He was the one who dispatched his medics and two MACV guys to tend to Clark. A couple of ARVN officers pulled me to my feet, wiped me off and had me clean my hands with dirt and canteen water. I geared up, they grabbed our artillery radio ruck, and we moved off toward the noise of battle.  \n\u0026gt;  \n\u0026gt;This was hard to write. I don’t even know why I wrote this for some random reddit question. I had to fire the artillery. By the time I got back to the LZ they cut in the bamboo, Clark was gone, and the MACV team was finishing up evacuation of the ARVN wounded.  \n\u0026gt;  \n\u0026gt;So there it is. I lost a man I was duty-bound to keep alive. I lost a man who trusted me, who protected me and expected me to protect him. I did not break faith with him. He would not think that, if he could still think about things. I know that.  \n\u0026gt;  \n\u0026gt;But there was a massive failure that belongs to no one else but me. Some shrapnel-god used his boarding-house-reach to put his elbow in my eye while snatching the life of a man who was my responsibility - as if duty, honor, country, faithfulness, command, trust mattered not a whit, meant nothing. Not a whit. Got that, soldier?  \n\u0026gt;  \n\u0026gt;I’m sitting here staring at the keyboard. Still pretty mad. Nothing left to say.",
   "created_utc": 1702759422,
   "score": 101,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdmwkzy",
   "message": "Not fully realizing what happened (One guy fell on the subway track).  \nTook some time to process it, right before going to bed.",
   "created_utc": 1702747285,
   "score": 36,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnizdl",
   "message": "Numb. \n\nCar crashes happen fast. Human bodies are very very fragile.",
   "created_utc": 1702755042,
   "score": 49,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnkgzi",
   "message": "I used to volunteer at VA hospitals and a lot of end of life people wanted company. Some of them convulsed for hours while dying.\n\nI've also seen too many people die during my deployments. In the moment, seeing an enemy get killed there's excitement, but you can never feel too good about someone dying. Seeing a friendly die is a real punch in the gut.",
   "created_utc": 1702755561,
   "score": 44,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnse7v",
   "message": "Gasping for breath, skin almost grey. Watched the life leave his body in what felt like slow motion. I whispered in his ear “I love you, I’m here, you can go now.” One last breath in and out and his chest never moved again. I held his hand until I felt like his soul was gone.",
   "created_utc": 1702758311,
   "score": 29,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnonpp",
   "message": "Saw a middle aged guy getting CPR from police yesterday at the local shopping mall. He looked pretty dead. Second time I have seen a similar thing and it is of course very unsettling. All I could think was he was probably out Christmas shopping and now unexpectedly ended his days on the floor of a shopping centre. Feel for his family at this time of year.",
   "created_utc": 1702757004,
   "score": 27,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnux75",
   "message": "My mom and grandmother, separately. We held my mom's hands and watched her slowly go. It was comforting knowing she wasn't in pain any longer but you'll never forget the sound of the last breaths, aka the death rattle.",
   "created_utc": 1702759225,
   "score": 26,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnvr8w",
   "message": "I was with my father when he passed away from cancer, he was only 53, I was 29 at the time. \n\nI’d stayed by his bedside in the hospital all week but because of the cancer in his brain my actual last words in conversation with him was 6 days prior to his passing (previous Saturday evening). \n\nI’d told him that he should scare us like that and that I love him and to give us a call if he needed anything. He’d been unwell and had been in hospital and not said anything, he only told us the cancer was really bad and he’d had a bad spell. \n\nMonday morning. I got a call that he’d been taken to hospital and couldn’t really communicate and that his cancer had spread to his brain. \n\nI hope he knew I was there as the cancer had taken his ability to communicate or essentially be fully conscious from the Monday morning. \n\nOn the Friday night, As he lay there and I realised he had already taken what was to be his last breath I lost it, I never screamed at someone to breathe, come back, not go and leave us. It was the most gut wrenching feeling knowing he was going and nothing I could do would bring him back.",
   "created_utc": 1702759508,
   "score": 9,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn4wvm",
   "message": "I watched some ppl beat other guy on my own eyes 10m away. Next day tv and newspaper were talking about it, guy died while beating up. I was kid back then, i felt really scary, out of world, remember it 10years later till now, same 1:1 view",
   "created_utc": 1702750232,
   "score": 20,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo8p2f",
   "message": "Former cop here.\n\nGuy was a train engineer from across the state. They all stay in the same hotel near the depot here. He didn't show up for his return trip so I went to check on him at the hotel. Cut the bar lock on the door to get in. He overdosed on his pain meds, left a note written on the desk. He had fallen back on the desk chair, nose bloody and unconscious.\n\nWhen I called for the ambulance he started gurgling and stopped breathing. Chest compressions for 15 minutes (felt like an hour), brought him back and was taken to the ER, still unconscious. He died 2 hours later. I called his wife to inform her and she was completely indifferent that her husband had just killed himself. \n\nI just felt numb and sad and defeated. I wanted to save him. It's something that I will never forget. Depression is a real thing and it can take anyone. If you or someone you know shows signs of suicidal thoughts, do something... say something.",
   "created_utc": 1702763990,
   "score": 21,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnnen2",
   "message": "Sad, because they were gone and I'd never see them again except in family photos. Happy, that they died knowing that I loved them greatly. Priviledged, because they gave me all kinds of knowledge and advice that I use to this day. Grateful, that they weren't suffering anymore. Worried, about how I was going to tell the kids.",
   "created_utc": 1702756572,
   "score": 10,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo2838",
   "message": "Blessed relief. Fuck cancer. And also, if you or a loved one is experiencing pain, please don't shrug it off. You won't be making a fuss, you won't be a bother. Get it checked. Those who love you would prefer a thousand false alarms than to lose you x",
   "created_utc": 1702761732,
   "score": 9,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnv47c",
   "message": "In the middle of the adreline rush you don't feel sad/depressed. It was an older man, around his 60s-70s and he threw himself off the roof of the building next door. He probably planned on hitting the ground behind my house which is way lower, but he ended up falling on the roof of the wooden barn in the patio, and then on top of some vases in the patio floor.\n\nAt the time my (now ex) gf was a nurse, we both got there at the same time, we were 19. He was in pretty bad shape and taking very shallow breaths. She instantly froze, i had to almost yell 3 times for her to 'wake up', i kept saying 'we have to do something'. She told me we shouldn't try to move him because he fell from a very tall building and probably broke his neck, so we tried to remove most of the vases around him to clear up space for the medics. Last thing i remember vividly was telling him help was on the way.\n\nFirst came firefighters and then EMT, they tried chest compressions for a good while but every time the machine checked if his heart rhythm was shockable it always said no, to keep doing chest compressions. I assisted them in every way i could, offered to switch to do chest compressions as they were getting tired (they didn't let me), while at the same time trying to keep my family away, telling them to go see if the police were on the way, to go inside as it was cold. I managed to keep pretty much everyone away so they wouldn't be so traumatized.\n\nFinally after around 30min of chest compressions and no shockable rhythm, bringing out a LUCAS and it still not working, they called it. I asked if they could try to push some more adrenaline into him but they said it wouldn't matter at that time. Called some kind of responsible place to be able to call TOD and started removing all the medical equipment.\n\nPolice came soon after, crime scene investigation too (to determine if it was actually a suicide), he died at about 5pm and they only removed the body around 1am. For a couple of months i could vividly see the images in my head involuntarily, after a while it started to fade, i did have some crisis where i had to call a psychology hotline (given to me by emts) because i broke down a couple of times thinking i could've saved him if i started chest compressions right away.",
   "created_utc": 1702759292,
   "score": 15,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnqbar",
   "message": "Confused, panicked, it felt like I was dreaming. When I realized he was dead i felt a gut wrenching pain rip through my entire body. It felt like someone was squeezing all of my insides. It felt like my heart was going to fucking explode. I felt nauseous. I puked multiple times.",
   "created_utc": 1702757578,
   "score": 5,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo4wxz",
   "message": "I saw few people die. Ones I remember vividly is my grandpa(dad's) and my grandma(mom's).\n\nGrandpa, I was just so sad and cried my eyeballs out. I have a lot of good memories with him and I didn't want him to leave.\n\nMy grandma, she screamed in fear saying \"They're here to take me! Don't let them take me!\" as I held her hand. I told her that I won't let them and assured her. She looked at me, said \"Okay\" and lied down. Then she was gone.",
   "created_utc": 1702762651,
   "score": 7,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdog0er",
   "message": "I think I'm different from most of the other commentators here because I am a palliative nurse.  I have seen probably between 100-200 people die (that's my best estimate.  I wish I'd counted but it's way too late to start now) but it's always been a very controlled situation.  We all knew it was coming, most of them were older, their families had already gone through a lot of different stages of grief, and I've had a certain amount of emotional distance from the situation (as in, it's not MY loved one I'm saying goodbye to).\n\nIt's always surprising to think about how many emotions that one person can feel.  Sometimes I am absolutely devastated.  Sometimes it's very clinical.  Sometimes I feel peaceful.  Sometimes I just feel absolutely wiped.  Sometimes I get all philosophical, sometimes even exhilarated. \n\nI've had a lot of people say some variation of \"oh, that must be so hard, I don't know how you do it.\"  But I don't really see it that way.  To me death is a very beautiful thing.  It is a very vulnerable moment and it's such an honour that so many families trust me to be included in it.",
   "created_utc": 1702766703,
   "score": 6,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnvpba",
   "message": "Both my FIL  and my mum died with me holding their hand, with me telling them it was time to go. My thought at those two monents was 'is that their last breath?', then relief for them first and sadness for me and family next. It's bringing tears to my eyes thinking about it. It may be a cliche, but it genuinely is part of life's rich tapestry.",
   "created_utc": 1702759489,
   "score": 9,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnhfsg",
   "message": "How did i feel? First time it grounded me, we are not gods and you cant save everyone, even with best doctors and nurses and equipment and best possible response time and proper interventions, people still die. It made me humble tbh...but when you save somebody else then its all worth it.",
   "created_utc": 1702754511,
   "score": 12,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnoq1q",
   "message": "Relieved that it was them and not me. To clarify, they were trying to kill me.",
   "created_utc": 1702757026,
   "score": 5,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnxbad",
   "message": "I think I mostly just wasn’t sure if it actually happened. My grandmother’s breaths were getting further apart and, honestly..I just remember thinking..”is she going to take another breath?” “That’s it??” I was confused and unprepared.",
   "created_utc": 1702760053,
   "score": 6,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo28w7",
   "message": "Had to tell my mom she had two days to live. Breast cancer for two years. On day two she went into a phase where her body was breathing but there was no more soul. Then it stopped. It was sad to watch the body stop breathing but the hardest part was telling her she only had two days to live. She was never in pain and we all got to say our goodbyes. That was 11 years ago. Still think about that day all the time.",
   "created_utc": 1702761740,
   "score": 5,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo30xj",
   "message": "I freaked out, it was a very out of body experience. Two christmases ago I was coming home from shopping and a kid had decided to commit suicide in his car outside our apartment. He shot himself in the head but had locked the car so me and the other woman that saw couldn’t get into the car. We banged on it and he was stilll responsive to sound while his brains fell from his head, there was so much blood and it was so chunky, I didn’t realize it was brain matter at first bc I was in shock. I hyperventilated in the grass on the phone w 911 and my husband took my phone from me to explain the situation, I pulled my myself together bc others wouldn’t go to the car bc they didn’t want to see but I kept trying to get into the car to him. He died, they had to cut the car apart to get to him.\n\nIt was an out of body experience where every breath feels slow and not your own. That every second matters and the choices you now make matter more than they ever have, so there’s a lot of pressure. Scary, you fear for your own life, you don’t understand what happened",
   "created_utc": 1702761998,
   "score": 5,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo71ob",
   "message": "Grateful that I had the chance to love him and that he loved me.",
   "created_utc": 1702763400,
   "score": 4,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoa2xk",
   "message": "We have to keep calm and focused. It's still not nice. The adrenaline is pumping. \n\nA patient. He slumped over after sitting down quite aggressively in front of me for surgical work up. \n\nI moved him to the floor and began CPR until ICU arrived but I knew he was gone. The lights in his eyes were gone. \n\nThey revived him twice in my clinic, but each time he'd flat line again - it was baffling. Cardiology turn up with an ultrasound and the right side of his heart was full of blood clots. They must have dislodged from his pelvis when he sat down.\n\nThat was the end. So sad. May he RIP. I felt terrible for the family, for him \u0026amp; doctors who tried so hard over 2 hours to save him.",
   "created_utc": 1702764481,
   "score": 6,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnma8o",
   "message": "It’s pretty overwhelming, humbling, relieving in my case. It was a deathbed scenario. We knew it was coming. I was the only one in the room. Even being prepared, it was a slap in the face of a million emotions, and at the same time, being reduced to some kind of singularity. I talked to her the entire time. I don’t know if she could hear me. I just wanted to let her know it’s okay…for her and the ones being left behind. It’s a significant moment probably despite the circumstances. It’s hard to describe it. A rare situation without much of a reference point to put it in to words.",
   "created_utc": 1702756188,
   "score": 4,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo3oz2",
   "message": "Relieved. I watched my mom struggle for every breath as she was consumed by brain cancer.  Two months of misery gasps and agony cries were finally silent.",
   "created_utc": 1702762232,
   "score": 4,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo4jwl",
   "message": "Grandfather had a brain aneurysm, he was unconscious in the ICU by the time I got there that evening. The next day the doctor said there is no way he will wake up as he's practically brain dead. We decided to pull the plug. \n\nIt took awhile to setup everything and way less time to physically see the pulse stop on his neck and hands. It was pretty traumatic. Everybody didnt know what to say, my wife and I were just crying with grandma. \n\nHe lived a long and happy life, died 90 something. But damn it was tough to watch.",
   "created_utc": 1702762527,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdodcvb",
   "message": "Guy was took away by the river. Without my glasses couldn't see shit. So I started thinking, everything is gonna be alright while other friends jump to the water to get him.\nI was already in shock trying to protect myself. I was already seeing everything like in a movie.\n\nHe drowned. \n\nI couldn't move from my rock in the river. Finally the search team decide to come and take me and shout at me like it was our fault his dead. When I get to the shore and find my glasses I broke and started crying.",
   "created_utc": 1702765691,
   "score": 4,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdohupu",
   "message": "I felt my dad die. My sister and I were on either side of him holding him in bed. We could feel his breaths slowing down and then they just stopped. I felt grateful to hold him in his last moments, the same way he held me through my life.",
   "created_utc": 1702767404,
   "score": 4,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoo2q4",
   "message": "Seeing once person existing one moment then ceasing to exist just moment later is something you will not forget. Everything they did, everyone they knew, just gone. It’s a very morbid reality that we all end up facing inevitably.",
   "created_utc": 1702769905,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdngvvg",
   "message": "My best friends wife called me when I was out that he collapsed. I was maybe about 5-10 minutes away. Weirdest drive ever, I was preparing myself to know that he died. I get to his house which is about 5 houses away from mine. Ambulance, Police, Firetrucks there. I park, run in, see a bunch of people working on him. I sat on the stairs hearing the defibulator.",
   "created_utc": 1702754322,
   "score": 11,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnhgfb",
   "message": "The first time I’ve seen someone dying is by a video on twitter. I wasn’t sure which war was it, I just had some vague memory about other information. I saw like 5 or 6 children die due to a car crash. They got hit by the car. I saw no blood, but when a man (I assumed he was his father, cuz he was crying and screaming) picked up the child, his body is like a noodle, it seemed like all the bones on his body are… And his head had a really weird shape too. To be honest, it’s really scary and disturbing, I cannot forget that. I deleted twitter immediacy after that and I’ll never download it again. It’s really traumatized me.",
   "created_utc": 1702754517,
   "score": 8,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnms2u",
   "message": "Highschool friend of mine killed himself with a shotgun during a sleepover. I remember feeling panic when he put the gun to his chin, but mostly the shock of it left me numb.",
   "created_utc": 1702756358,
   "score": 8,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnnsbv",
   "message": "Lady tried to run across the road to keep up with her group of friends and didn’t make it. I was a kid and just thought to myself “Oof”.",
   "created_utc": 1702756702,
   "score": 13,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnvenn",
   "message": "My best friend died in front of me. It was so strange because even though he was unconscious prior to passing, one moment I was looking at my friend and the next moment I was looking at a body. It was a mixture of disbelief, deep despair,  and numbness. I would alternate between a quiet shock and completely loosing control of my emotions. At times it felt like I was watching my self have a breakdown from the outside. \n\nI try not to think about it now and instead focus on the good times I had with him.",
   "created_utc": 1702759390,
   "score": 6,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnmjvu",
   "message": "Helpless, vulnerable,  sad , scared , self reflective, questioning...\nWorst day of my life ... \nBe grateful everyone , it's a gift this thing we call life , it's also not guaranteed",
   "created_utc": 1702756279,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnu8of",
   "message": "Heartbroken",
   "created_utc": 1702758986,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo26k2",
   "message": "not me, but my mom. when she was just a kid she said she watched her brothers best friend get hit my HIS friends car, really gruesome for a car crash she said, she went over to check his pulse and he was dead.",
   "created_utc": 1702761716,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo3r03",
   "message": "Depends. Seeing someone die after a slow, painful, prolonged disease is sad, but also strangely peaceful. At least the pain ended.\n\nWith sudden deaths, I felt nothing during that. I block out all emotions in stressful situations, and try to not fuck up too much (and doing everything in my power to keep them alive) until qualified help arrives. The guilt, anger, sadness all came afterwards.",
   "created_utc": 1702762251,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo45ig",
   "message": "Watched my mom die a peaceful death in the hospital… and it felt peaceful… felt like angels were in the room…",
   "created_utc": 1702762388,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo5dm2",
   "message": "When I was in 4th grade, I watched my friend get hit on the road in front of my house.  Car was doing. 55+.  He did a somersault in the air before being hit again and dragged.  It scared me at the time, but, once I realized what happened, I kinda went numb to death after that.  Im 45 now, and I don't view it as any different than any of the other faded memories I have.  Strange how that works, I suppose..",
   "created_utc": 1702762813,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo71ds",
   "message": "Weird. I was very young \"7 or 8\" I was at the beach in summer in Hungary. It was around 30° so very hot, this old gentleman decided to jump into the freezing lake after being out in the sun for a while. He's body went into shock and he's heart stoped. Since I was very little I though I would get told us for watching the paramedics give him CPR so I just continued minding my own business but after I few minutes I went back and all I saw was him in a body bag. 11 years later I can still remember it very clear.",
   "created_utc": 1702763397,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo92ud",
   "message": "Sad and relieved. My father was at my house suffering from complications from throat cancer. Laid in a hospital bed for 2 weeks in my living room. It was a horrible slow death for him. No food no water.",
   "created_utc": 1702764128,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo9mgs",
   "message": "Grew up as an airforce cadet. We had to go and work an experimental aircraft airshow every summer. (You can probably see where this is going)   And this one year some small team of engineers were trying to pitch a gyrocopter that could be purchased and assembled at home. Think like a kit-car but a gyrocopter. And on one of the demo-flights the pilot take it up to about 100ft and the thing just disintegrates in the air. This sleek little flying wall-e recliner chair instantly turns into a whirling hell of blades and shattered fibreglass and chunks of meat and bones. It proceeds to plummet into the earth and the fuel combusts into a red plume. \n\nThe PA yells for medic crews to the unpaved airfield but *everyone* looked at eachother and we all knew what we all were thinking by our faces. Everyone was like: “that guy is fuckin’ DEAD. There is *NO* surviving what just happened.” \n\nApparently they banned VTOL aircraft after that year.\n\nEdit: also that year (97?) is the year I learned that the term “written in blood” comes from a law or rule that is made in reaction to someone getting killed.",
   "created_utc": 1702764324,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdob0z6",
   "message": "My father in law when I was in my early 20s. \nJust watched him waste away from colon cancer, and I watched my wife become the rock we all needed while she talked him into the next life. \n\nJust sad, confused, and heartbroken. \nDeath is cruel and beautiful.",
   "created_utc": 1702764816,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdob4ix",
   "message": "Nothing, it was weird but i felt nothing at the same time, i can't feel anything anymore for real",
   "created_utc": 1702764850,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdobnqe",
   "message": "My brother died a week ago today. I saw him go. We were all standing around the bed and I looked at him. At that moment I saw his head fall to the side, not dramatically but just slightly. I reached to feel for a pulse , told my SIL to get the hospice nurse. At that moment I felt like fainting but I didn’t.",
   "created_utc": 1702765044,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdocdvs",
   "message": "I know I was crying but I don’t even know what I was feeling emotionally. We were huddled around my dad holding him while the nurse took him off life support.",
   "created_utc": 1702765317,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdod6v2",
   "message": "9 years ago in Dallas, Texas, I held my mother's hand and watched her take her last breath. It's hard to describe the feelings that hit me, relief she was no longer suffering, excruciating sense of loss and glad she no longer had to deal with the seriously lacking care in the ICU.",
   "created_utc": 1702765630,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdogwec",
   "message": "I felt numb, sick and paralyzed at the same time. It was a homeless man on a subway at 3:29 am in NY city when I was 16 years old. \n\nIt was less than year after my uncle shot himself, committing suicide in the room next to me. \nI was in shock.",
   "created_utc": 1702767041,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoifod",
   "message": "I was with my fiancée. I was glad I was there, I held her  hand and she went in her sleep. It was gentle. There was no way on Earth I would have been anywhere else.\nI was also with my dad. He was out of it for days beforehand and there was a lot less dignity involved. He didn't know that but I got to see it. I'm glad that I was there because I'd feel guilty if I wasn't. It didn't benefit him me being there, and I had to see him in ways that I didn't want to see him or remember him.",
   "created_utc": 1702767635,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdokuul",
   "message": "Industrial accident - took one look at the body 15 seconds after it happened and all the colour drained from my face and my only thought was \"Oh shit\".\n\nEverything happened within a 30 second time frame; it was an real eye opener to see how fast a human life could end by making a small error in judgement.",
   "created_utc": 1702768578,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdom96g",
   "message": "Watched my mom die when I was 20, after a 3 year battle with cancer.  It felt surreal; a weird mixture of relief and the worst non-physical pain I’ve ever felt.",
   "created_utc": 1702769148,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdooa3l",
   "message": "My six day old son passed in my arms. He was premature and simply too tiny and not ready for this world. I can’t describe the pain I felt as he took his last breaths.",
   "created_utc": 1702769991,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdophe5",
   "message": "For my dad, I was the only one in the room at the time. We were waiting for him to die.  He was in Hospice. I heard him gasp and grabbed his hand as he let out his last breath.  At the moment, I felt relieved he finally was at peace.  \n\nFor my husband, who was healthy and fit at 57, he collapsed in front of my and died of an aortic aneurysm. I was all emotions at once, a flood of panic and shock. Had no idea what was going on. It’s been just about 2 years and I have nightmares about it all the time.",
   "created_utc": 1702770493,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdotmv1",
   "message": "I crawled in to a truck that flipped over after the driver had a seizure. I was attempting to cut him out of his seat belt which was holding him upside down as he heavily bled from biting his tongue off. No one would help me and he passed as I laid there trying to change the angle of his head so that he might breath easier... I had been talking to him all of the time I was with him and at the end, he blinked once, shuddered/vibrated/sorta and his breathing stopped. I could do little without help because of the small space due to the roof being smashed in from the rolls. Humans suck, in general.  I felt helpless, sad, and angry in the same moment. His death could have been prevented if anyone had chosen to help me.  This still haunts me.\n\nEdit: layed to laid.",
   "created_utc": 1702772206,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp43if",
   "message": "Pure shock, one minute he was chatting with us in the pub, the next he just keeled over from a massive heart attack. You could hear a pin drop for the rest of the noght",
   "created_utc": 1702776748,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn7lkg",
   "message": "mainly a feeling of not being so immortal i know it sounds weird but on day to day life in modern society we dont see ourselves dying when we are young\n\n  \nseeing someone die in front of your eyes for me atleast gave me a newfound appreciation of life of how easy one can die and not have accomplished anything",
   "created_utc": 1702751146,
   "score": 5,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo64zs",
   "message": "My three month old daughter died. She went into surgery to repair a heart defect. It was too severe. The surgeon did what he could but ended up putting her on ECMO for eight days. She went into multiple organ failure and seizures that lead to a brain hemorrhage. Watching your child turn black while still alive is something that a parent will never forget. I just remember feeling incredibly anxious, praying to god, bargaining, needing her to wake up so I could give her a bath. But she never did.",
   "created_utc": 1702763078,
   "score": 5,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnucj2",
   "message": "Work at a trauma center in the E.R. After about a year, you just learn to turn it off and take your lunch when you can.",
   "created_utc": 1702759027,
   "score": 9,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn8m6t",
   "message": "Saw someone get hit on motorcycle and die. I was going the other way and it happened right beside me. Just shocking to see. I didn't think he died but saw it on the news later.",
   "created_utc": 1702751490,
   "score": 3,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn9bcs",
   "message": "I worked at a hospital and it was always sad. Knowing you have everything at your disposal but there's nothing you can do.",
   "created_utc": 1702751732,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnhl41",
   "message": "Numb and confused. I was about 6 at the time.",
   "created_utc": 1702754563,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnmgvy",
   "message": "I didn't really feel anything, I just kinda went into action and called 9-1-1 to get an ambulance dispatched. Did think a lot more about death afterwards.",
   "created_utc": 1702756250,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnr09b",
   "message": "bad",
   "created_utc": 1702757816,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnsl4n",
   "message": "Bad",
   "created_utc": 1702758383,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdntbhp",
   "message": "It was so surreal, I felt totally helpless and like it was a nightmare. I have since learned to properly swim so it never happens again.",
   "created_utc": 1702758654,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnzt0k",
   "message": "I was working on an ambulance as a driver/emt-b. Too much adrenaline at the time. Afterwards, sadness for the family and the senseless preventable loss of life.",
   "created_utc": 1702760918,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo23f4",
   "message": "When my grandpa is looking very low everyone trying their best to help him and nobody knows when it's over but they know there's possibility to prevent it, and that moment is the hardest for us all.\nBut after i saw him so ready to greet angels i just think he wanted that so i just trust him and let go.\n\nIt was the first time i feel at peace in the middle of chaos.",
   "created_utc": 1702761687,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo28m8",
   "message": "Sick to my stomach. Almost like the feeling you get in the pit of your stomach when you're heartbroken.",
   "created_utc": 1702761737,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo32pv",
   "message": "like I was dreaming",
   "created_utc": 1702762017,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo3bnw",
   "message": "idk nothing much but wondering how it feels like",
   "created_utc": 1702762103,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo4cda",
   "message": "Heartbroken for the family. \u0026amp; Helpless.",
   "created_utc": 1702762455,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo7u2y",
   "message": "I volunteered in an ER, saw a few people go.. it’s oddly peaceful? At least the ones who were knocked out.",
   "created_utc": 1702763681,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoc3bz",
   "message": "I watched my dad die in front of me when I was in my early 20s. That was almost 11 years ago and I still feel like a little bit of me died with him that day.",
   "created_utc": 1702765208,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdofcgs",
   "message": "Saw moment of death twice. Both times terminally ill person. Both cases it was a mercy they passed and escaped more pain.",
   "created_utc": 1702766449,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdofgm1",
   "message": "An acquaintance of a roommate overdosed himself with heroin. I called the ambulance and tried to wake him up somehow but it didn't work. I felt nothing in that moment. In such moments I'm always the only one who keeps calm and acts reasonable. The emotions come much later when there is no threat anymore.",
   "created_utc": 1702766489,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdogrei",
   "message": "I saw my father die.\n\nIt haunts me years later.\n\nDead terrifies me now, more than most.",
   "created_utc": 1702766989,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoh4k9",
   "message": "I saw my stepfather die of cancer with my own eyes for 8 years. Back then I was very bad at recognising and managing my own feelings. I was quite snappy and moody for several of those years",
   "created_utc": 1702767127,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoh7vm",
   "message": "Ironically, what really changed was I stopped seeing Living people the same way. We're all just meat.",
   "created_utc": 1702767160,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdohkos",
   "message": "Watched my father die, struggling to breathe from late stage lung cancer amongst a myriad of other self-inflicted neglect related problems.  The rest of my family was too emotional to make the call to end the oxygen, but I looked at my dad and asked him quietly if that's what he wanted, a slow but deliberate nod was all the response I got.  I watched a man who had been a complete bastard, violent abuser, unfaithful spouse and my beloved father die not 3 ft from me, and it's probably about the closest my emotionally stunted ass has ever gotten to feeling panicked, I killed my father because I loved him.",
   "created_utc": 1702767300,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoj9bj",
   "message": "I used to work in ISR and Counter-Terrorism, MQ-1s and MQ-9s. The first man I watched die, I had a hand in killing.\n\nMy job was essentially to confirm the target, make sure we were following the right guy. We had all sorts of means, from visual identification and tracking patterns/habits to an obsessive level, to signals intelligence I'm still not allowed to go into detail on. I was also responsible for ensuring that we did not incur collateral damage when we struck targets, which involved a lot of pre-planning before we released weapons.\n\nHe was running guns for the Taliban, in his early 20s. We struck him right outside his house. We'd been following him for a while already and were essentially just waiting for an opportune moment to hit him. A single Hellfire aimed right between his feet.\n\nHe was scattered across the field in front of his house. Neighbors quickly came outside to see what had happened, and within minutes they had brought a wheelbarrow and tarps and began to pick up the pieces and cart them away.\n\nWe stayed on the body, watching as it was prepared immediately for burial. The pieces were arranged roughly back into shape and wrapped in a white sheet. The body was then lifted by six men and carried on their shoulders, as the entire village followed in procession to the nearby graveyard atop a hill. The funeral was brief. A round of prayer, the body was laid inside the grave, and then everyone left. \n\nExcept one woman, who just stood there in front of the still open grave. I have no way of knowing for sure, but deep down I know that was his mother, mourning her son alone on a hill.\n\nThere's no sound on our feed. But I could tell from the way she fell to her knees, her arms raised to the sky, the raw anguish that woman felt. She was still kneeling by the grave when we pulled eyes up and moved on to our next assignment.\n\nThroughout all of this, I maintained my calm. A brief spike of anxiety upon weapons release, but otherwise I maintained my composure the entire time. Just kept doing my job, like how we trained.\n\nI finished up the mountain of paperwork incurred by releasing weapons, cut the video of the event for the after-action report, then went into a briefing room and promptly had a massive panic attack. Bad enough that one of my crewmates brought me to the clinic to be checked out.",
   "created_utc": 1702767947,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdokfo7",
   "message": "The death rattle is Real, and it *will* haunt your existence for the rest of your days. \nI didn't take \"the deathbed vigil\" lightly, but have seen many that have and suffered for it.\n \nI felt devastated loss. \nIt was time for him to leave, and I miss him all the time. RIP Larry, the dad I never expected or even wanted when mom got remarried; but was the person I so sorely *needed* at that time.",
   "created_utc": 1702768411,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdol9mw",
   "message": "I'm a nurse. I've seen multiple people die. I don't work in ER or trauma, I work med-surg: they tend to know they are dying, it's a bit more calm than some of the stories being shared here.\n\nI usually feel a sense of loss, but also peace. I'm thankful when it is a peaceful death. I clean them up and whatever needs doing, and then I move on with my night.\n\nFeels... somber. Sobering. Like even if the shift is busy and I'm doing a hundred things, I tend to catch my breath and pause.",
   "created_utc": 1702768745,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoln3u",
   "message": "I'm disturbed to this day....I held my father's hand as he passed....I was the only one there. Was a weird feeling as there was a rush if warmth from him for a few seconds then he went cold....it haunts me but I'm glad I was there so he didn't pass alone....",
   "created_utc": 1702768898,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdomeeu",
   "message": "Numb honestly. I think I was just in shock. To watch the life leave someone’s eyes was … idk tbh",
   "created_utc": 1702769208,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdomwh5",
   "message": "Like my soul had been ripped in two, and I was no longer a complete person.",
   "created_utc": 1702769427,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdono47",
   "message": "I've seen two people die in both for random coincidences. One was on a busy Street and a guy was pushing this girl out of his truck and she eventually fell while they were going like 40 miles an hour and got hit by a car. And the other was a shooting downtown I've also had even scarier situations with someone with a near death experience I watch this dude push yet another girl out of a car and she held on and he kept driving back and forth and running over her legs maybe once or twice until she let go she eventually saw me after he sped off had read to me and asked to use my phone which I did not have one I eventually came out and talked to her and gave her a first aid kit she had stabbed marks in her backpack and all her tweaker gear had spilled all over the ground and her kneecap was scraped to  Oblivion she had refused an ambulance because she had warrants so we called her friends and they came and picked her up and she left with the med kit. I think this experience was a lot worse than seeing the previous ones I've mentioned mainly for the fact that I was involved afterwards. It's terrifying watching someone die. And knowing they had a family and people that cared about them. Especially to lose their life because someone else's selfishness. It's traumatizing, something that's manageable but sticks with you for the rest of your life.",
   "created_utc": 1702769737,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdopr9j",
   "message": "Never more sorry for someone in my life. This kid had been stabbed in the heart outside of a concert. We all watched him turn blue and bleed out and lay there unable to move while nearly everyone around was saying \"he's definitely not gonna make it\" \"oh he's dead\" A human was laying there dying while hearing all of that in his final moments, I just felt so bad for the kid.",
   "created_utc": 1702770607,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoqumz",
   "message": "My 6 year old daughter and I watched someone take 3 slugs to the chest when I lived in Tijuana, Mexico. Saw the guy hit the floor and his wife shrieked \"lo mataron\" several times. I never ran so fast in my life.... RIP to the man that always sold us fresh veggies on Saturday mornings.. It was literally a block from the house we lived in",
   "created_utc": 1702771057,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdororj",
   "message": "I work in an operating room and I was assisting the surgical team during a trauma with a pediatric patient. She never had a chance but they were doing their best to save her. I remember when they called it she lost the color in her body so quickly.",
   "created_utc": 1702771408,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdosw0c",
   "message": "Angry, shocked, first time I'd seen someone I knew die. I thought we were invincible, the ignorance of youth.\n\nHe got shot in the throat, took most of neck off. It was the look in his eyes I wont forget. Some pointless village outside of Sangin. What a waste it all was.",
   "created_utc": 1702771902,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdot12e",
   "message": "I didn't watch them die but close enough. It was a 7 month old baby. I was 8. Our neighbour came bashing like a lunatic calling for my mum (she was like the mum of the community) screaming for help cause she could wake up her baby. Mum took the baby onto the lounge floor and started giving it mouth to mouth while waiting for the ambulance which the lady had already called. I was crying hysterically while my older brother tried to cover my eyes. I dunno how I felt in that moment other than scared and sad. I can still vividly remember watching a tiny blue coffin getting lowered into the ground while the mother of the boy wailed. I've never heard a sound like it and hope I never do again",
   "created_utc": 1702771961,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdot4hc",
   "message": "I witnessed an altercation that turned really violent real quick, bonfire night over 15 years ago. It didn’t seem real at the time, there was so much blood. He just, I don’t know, you could just tell he was no longer there. \n\nI tell you what, I was a welterweight champion boxer in my teens, I thought I was fucking indestructible. Seeing that really made me rethink getting into another fight in a club or something over some stupid shit.\n\nYou young lads with your egos, check that shit and stay safe out there.",
   "created_utc": 1702771999,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdotny8",
   "message": "My great-grandmother wasn't doing well the last week of her life. She was unresponsive and non-verbal by the end. She kinda just laid there motionless, expressionless, and not speaking. We, my family, visited her the last 3 days of her life, which wasn't fun. Me being the dreading person I am, I always was anticipating her last moments. On day 3, she passed. I saw her choke up her last breath, and her body shook a little bit, passing the last breath. I remember I sat there just repeating the same 3 words. \"She isn't breathing.\" I'm kinda scared when seeing someone struggle for breath now. I felt awful and kinda fell asleep in shock, and the next morning was when it hit me – we wouldn't be visiting great-grandma anymore.",
   "created_utc": 1702772218,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdotx4c",
   "message": "My infant cousin died of SIDS while my parents were taking care of them while my Aunt and Uncle were away at a wedding. They thought us kids were asleep when the shit hit the fan, but I was always a light sleeper so I knew there was a disturbance. 10 year old me peered through the crack of the door at my father performing cpr on a tiny little body on the counter. Even at that age, I knew there should be lights and sirens but it seemed like they took forever to arrive. I remember the baby being so small and, at the end, so still. At the time, I didn't feel much but small and helpless and voiceless. For many many years afterwards I could summon years to my eyes by channelling that night and writing this I feel it fresh anew. I barely knew them but I still think of them.",
   "created_utc": 1702772320,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdou28b",
   "message": "It was my mother. She passed from metastatic cancer and early onset dementia. I held her hand as her breathing stopped. It was a release for her. I couldn't grieve, as I felt she was gone weeks before.\n\nIt will be 20 years ago in February.",
   "created_utc": 1702772376,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdou70s",
   "message": "Bummed knowing he was too far gone to save, but relieved knowing his suffering was over and his wife was waiting (doctor here).",
   "created_utc": 1702772430,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoubfj",
   "message": "It was different each time, although it felt less and less... important. First time was hard, couldn't stop thinking about it. And the last time, well, another day at work. \n\nJust like with everything. You get used to it, if you're exposed to it often enough.",
   "created_utc": 1702772479,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoxhmu",
   "message": "Very conflicted, I’m autistic (was undiagnosed at the time and was an adult) and my entire family around me were in tears and devastated when my grandfather passed after a short battle with cancer but I didn’t really feel much, I was definitely sad as he was like a father to me but I very quickly accepted he was gone, what was harder was when the more routine parts of him being in my life were gone and those moments hurt far more than seeing him slip away.",
   "created_utc": 1702773779,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoy154",
   "message": "I was with my grandmother and watched her take her last breaths in the hospital room. \nIt was oddly comforting to know that she wasn’t in pain anymore afterwards. It was a fast attacking  cancer that deteriorated and killed her in a matter of months. Lots of time to process what was happening/inevitably going to happen, and also come to the reality that it was the only option for her to not be in pain anymore. \n\nKind of a fascinating experience of the circle of life.  To see consciousness there one moment, and gone the next. At least in my experience, no exclamations, or signs of god, or anything the movies try and portray. Just quiet and stillness.",
   "created_utc": 1702774010,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoyq3a",
   "message": "I was travelling in Australia and witnessed someone getting hit by a car at high speed. Poor soul flew over the top of the car. The driver stopped, got out and realised he’d hit someone. The drivers screams still haunt me. \n\nI found out the next day that the victim passed away at hospital. I think of him often and now always cross the roads at the green man, even if it looks safe to cross beforehand.",
   "created_utc": 1702774320,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdoyxtp",
   "message": "My uncle has a brain aneurysm in front of me in a hotel room in Philly when I was 8. He took me and his new gf and her son to Sesame Place. I was alone in another state. I had just woken up to him dropping to the floor staring at me with his eyes open and making this sound while he was breathing. I didn't know what to do. I couldn't do anything.\n\nI've taken my kids there recently and I felt him with me. It was healing for me.",
   "created_utc": 1702774419,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp1lwu",
   "message": "Well I shot him. So…",
   "created_utc": 1702775639,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp2273",
   "message": "The first time, interested in the process. I mean, it was horrible and all, because in witnessing my father's death I was in a way witnessing the way I will likely die - I have all the illnesses that led to his demise from vascular dementia at 89. It's a good innings I suppose. His decline was rapid in the last year. He'd just mostly been forgetful up till then, but he went off a cliff edge in terms of symptoms, was taken into a care home where we couldn't visit him for a year \u0026amp; then suddenly there he was in hospital, dying. He was jaundiced and his arms covered in purpurea, his body emaciated having forgotten how to eat or drink. In these cases they just withdraw sustenance as IV feeding just prolongs their suffering. He was breathing when we got there. I held his skeletal hand, and stroked his head but he was non compos mentis, no sign of lucid thought, just laboured breathing fading out. When he died he became rapidly cold and pale. Breathing stopped, pupils became non-reactive. It was obvious he had died. I probably cried more about his demise before it happened than since. I'm much angrier about my mother's death - she had a fall \u0026amp; contracted COVID in hospital while waiting to have a boot fitted for her lisfranc injury. We were allowed in with her to witness her passing. She was slumped forward, on a massive amount of oxygen. Her lungs had packed in. I had been trying to reach her for a week. As a deaf person she had no ability to use a telephone but the Kindle she had with her was perfect for email - it just needed signing in to the hospital's WiFi. Every day I phoned and asked for someone to do this, while she was conscious and lucid and able to write. The day we were allowed in to see her, the day she died, I hooked up her Kindle \u0026amp; all her undelivered mail came through to my phone, and all mine came through to her. All the things we had wanted to say, went unsaid because nobody could be bothered to help her. Again, though the difference was night \u0026amp; day. I wept over her death because she had been a GREAT person - a devoted mum to me \u0026amp; my sis, but also a teacher who made sure her pupils' voices mattered in class. Someone for whom lessons provided sanctuary to her kids. She had such intellect and so much more to give \u0026amp; that she wanted to do. Dad had kinda already left the building so to speak, but Mum didn't have to die then, but for blunders and stupidity \u0026amp; a lack of care for patients.",
   "created_utc": 1702775845,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp26k6",
   "message": "Actually some relief.  \n\nMy wife and I were with my brother-in-law the moment that he passed away.  \n\nHe died of cancer at the age of 25 and had spent his final year-plus in terrible pain.  \n\nI have only shared this with my wife (his sister) and she saw it too - a final breath out that he took when a wisp of something seemed to exit out the window, just a small almost imperceptible streak.  Doesn't make me a true believer, but Chuck was as good as they come so if his soul ascended to heaven, I suppose that I may have witnessed it.\n\nShe told me that she saw it too, but I think that it may be wishful thinking on her part.",
   "created_utc": 1702775900,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp2crv",
   "message": "I had just turned 16, so 18 years ago, I can still remember most of the details of that day, I was in the front seat of a family friends car, He was like a stand in grandfather helping me through a hard time in my life. The prior weeks he had started talking about what he would leave his adult sons when he passed away, which was unusual. \n\nHe mentioned that he had a headache so our day out would be cut short, we stopped by a shop to pick up some snacks for his wife and was on a back country road, we were approaching a steep turn that I noticed too late he wasn’t turning the vehicle and he had stopped talking. We ended up in a steep hedge with my door being completely blocked off. \n\nI may have blacked out for a few seconds as when I came to my senses I started dialling 999 however after calling I hung up as there was already someone on the phone running over to me. A volunteer paramedic/firefighter I forget which. A lot of cars had stopped. I had to crawl over my friend to open the door, I had to hold him up while the nice men tried to save him, he was going grey and blue. \n\nAfter 10 minutes the nice people managed to get me out while they continued trying to save him, I called my mother in tears but didn’t even tell her I was fine, she got his wife and son in the car to get to us in the middle of nowhere. \n\nThey covered him with a blanket he had in the car, and  I knew he had been gone a while, heart attack, he was gone before we hit the hedge. I was questioned by police in a daze and my mother, his wife and son found me and I was given free orange juice from a local pub. Drove back home with me profusely apologising to his family like it was my fault. \n\nSo dazed, confused and traumatised. Managed to recover eventually but I could never get behind the wheel of a car.",
   "created_utc": 1702775978,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp39tj",
   "message": "Good, because the individual had shot at us first and then came down from his roof ambush perch, lit a cigarette and tried to come over and pretend all was well.",
   "created_utc": 1702776384,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp3g94",
   "message": "Yeah, my mum not 100% sure what took her in the end but she had scar tissue from a surgery to remove her lung because she had cancer there was just too much for her body to take. It bought us an extra 4 years which we were thankful for.\n\nThe crazy thing is, it wasn't like she was unhappy or in hospital daily. Hell I remember about 2 days before she passed, I was playing rock band 4 and she was in the kitchen dancing to me playing Black Betty by ram jam.\n\nOn her last day, I was heading to a house party a fair distance away. I had to take a few buses to get there and after saying my goodbyes the last thing she said to me was \"oh don't forget your sandwiches\" I said \"don't worry I'll have them tomorrow\" (My mum made me sandwiches because she thought I was in work that day, they were the tastiest sandwiches ever)\n\nAnyway as I'm on the final bus home, I'm literally about to pull up to my stop and my dad rings me. I answer and say \"Hi yeah I'm just around the corner I won't be a minute\" and then my heart sank \"She's stopped breathed I had to perform CPR, she's getting moved into an ambulance now\" I said I'll be there soon and closed the call.\n\nWhen I went to that house party, I brought a load of board games. My bag must have weighted 20kg and I ran the rest of the way home, it's just one long road connected with smaller roads maybe about 500m I ran and I felt like my chest would explode, I took two quick breathes, kept running and made it before the ambulance had to set off, they had given her adrenaline and restarted her heart but the doctors said that basically when that ran out there wasn't anything more they could do.\n\nTo save a bit of time and answer the question, my mum was basically unresponsive and my dad held her hand the entire time. I found myself writing a poem on her deathbed, I'm not a particularly poetic person but I needed something to distract from this, it took a while 8-10 hours I think.\n\nThey never tell you in that state, how much the body twitches and moves. The eyes fluttering, the finger twitching and the many, many shuddering breaths as they basically struggle to breathe, you've probably heard of a death rattle.\n\nI can only relate it to like when you have that little jerk when you're about to fall asleep and you're body wakes you up. Except in this case, your body is trying and failing to get the reaction it wants.\n\nI finished typing the poem and looked up from my phone as she breathed her last. There was a moment of silence and I stood up \"Is-\" I couldn't even get the full sentence out before my dad said \"She's gone....I felt her heart stop\" my dad still clutching her hand.\n\nMe, my brother and my dad all stood up and hugged each other. I remember looking at my mum her skin going a sickly yellow from the lack of blood flow.\n\nI got a cab home, but changed destination to stop by my nans (her mum) to let her know. My aunt and uncle who were also at my mums side had beat me to her and she already knew, I give her some hugs and kisses and went home.\n\nAnd that's how I became a half-orphan at 23.",
   "created_utc": 1702776463,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp4ljh",
   "message": "My grandmother laid in the hospital bed for 3 days. Everyone else was there and they said their goodbyes. I couldn't bring myself to go. I couldn't stand to see her.... Like that. Cancer has worn her away and then her age caught up to her. I didn't want to put the image of her then over the image I loved. Another day went by and she was still there just... Existing but not living. My mom said she believes she was waiting for me as I was basically another daughter and not a grand daughter. I finally gave in and had my mom pick me up and drive me the two hours because I wouldn't have gone. I was too weak.\n\nI got there and everyone was in the room, whispering, watching the TV at a really low volume. My nanny (grandmother) was in the bed... A withered small, frail creature. I couldn't stand it. I started crying quietly. Everyone left the room, even my mom. It took me 5 minutes just to walk the shirt distance to her bed. I touched her  and said my usual greeting to her. She opened her eyes and I just wanted to fall apart. She tried to speak but she had a mask on and her voice failed her anyways. I rubbed her hand, said some things that I can't even remember now because it was all just... Just a horrible nightmare.\n\nI sat down and everyone else came in. 5 minutes later my grandmother was gone. I got home that night and burst into tears. Had she really been waiting for me? Was it just coincidence? Was I the reason she suffered for that many extra days? And now I have that withered terrible image of her stuck in my head. I miss her so much. It's only been a year and I still can't stop crying, breaking down at the smallest thing.... Though.... It's also partially because my best friend died suddenly last year as well and my 2nd father and my MIL going fucking nuts and I had to admit her to the hospital after months of handling her crazy. Last year was terrible and I think I still need counseling for it that I can't afford",
   "created_utc": 1702776970,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdp79ll",
   "message": "I stayed at my friend's house after a night out celebrating another friend's birthday, and woke up when he crashed through a glass table. He was barely conscious and bleeding and stuff, wouldn't tell me what he took, told me he planned this for a few days and was sorry I was there for it, and then basically gave me the numbers of how long he likely had left so please don't call an ambulance because there's no way they're making it there in time (he was right).\n\nIt was a really surreal feeling. I'd been to his house so often I knew it by memory, drunk, on acid, ketamine, you name it, but walking up those stairs to tell his mom what happened I swear the house was rearranging itself. I remember standing in the kitchen literally not remembering how to get to the hallway, and looking down at the bedroom doors felt like that scene from the movie Poltergeist. All I really remember after that was sitting there with his mom, waiting for an ambulance to come get him, feeling really numb.",
   "created_utc": 1702778175,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdpnycn",
   "message": "Mom died of cancer surrounded by me and other family. The event itself was not as painful to me as the day she was diagnosed as terminal or the funeral. The thing that stuck with me from it was me holding her forearm as she passed and feeling the coldness progress down her arm and across my palm that was touching her.",
   "created_utc": 1702786053,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdpnzcz",
   "message": "Helpless.",
   "created_utc": 1702786067,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdpoblt",
   "message": "its messy and brutal.\n\nThere's no like \"we all cry n he died peacefully\"\nits. not.\n\nI was with someone who got hit by a car. He screamed, shouted, and occasionally breathe heavy. after 3 hours in, he slowed down, I thought he was getting better, yeah turns out no. He died.\n\nI cried for 3 days. Wasn't mentally good, until now actually.",
   "created_utc": 1702786237,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdppryt",
   "message": "You'd think you're prepared to see someone die after two straight months of being in a hospital wing where literally everyone is dying. And it was still not easy. My two cents, if your loved one is dying the least you can do for them is get them back home before it happens.",
   "created_utc": 1702786983,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdpq92r",
   "message": "One of the first times I worked on an ambulance. We were transporting a hospice patient from the facility to their home on Valentine’s Day. Their SO had just visited them earlier that day. I was sitting in the back of the truck with the patient when their eyes rolled back in their head, and their breathing became gasping. Then they stopped breathing and we checked for a pulse. There was nothing, and then 30 seconds later the patient started agonal breathing again for a few more seconds, then dead for good. Literally watched this person see the light and then die. I remember feeling shocked but not sad, because this person was already on their death bed and it was time. I do remember being surprised at how quickly their body got cold.",
   "created_utc": 1702787235,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo1w4t",
   "message": "Wife died from cancer, she went into coma on a friday. Saturday friends \u0026amp; family came to tell her bye and then I watched her last breath as her father, who lived 8hrs away, got there and whispered in her left ear that he loves her and it was ok she can go now.\n\nA couple years later saw a wreck happen where a box truck blew a tire on the highway crossed into on coming traffic and ripped the side off of a minivan. Minivan had 1 adult \u0026amp; 6 teens heading to a church youth convention. My father and I crossed 5 lanes of highway to get over to the van and it was a bloodbath. Only 2 from minivan survived, no one in box truck injured.",
   "created_utc": 1702761618,
   "score": 4,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdo60z9",
   "message": "As a paramedic I see people die a lot. Honestly I don’t remember most of them, but the first one I ever witnessed was so gross. I was doing CPR and there was so much blood coming out of her mouth (we suctioned and did what we could but she was D E A D dead.) I felt helpless. Now I feel differently. I know I’m doing everything I can to give them a fighting chance at survival.",
   "created_utc": 1702763041,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn2i5y",
   "message": "unreal",
   "created_utc": 1702749410,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdnyvkb",
   "message": "A young woman with an open skull fracture died while I tried to save her. It was a freak accident, just like that. It was a special day for her and just minutes before she stood smiling next to me on a sunny day with blue skies. Then that accident happened. There was pandemonium all around us, people crying, sirens blaring in the distance but in the moments when her heart stopped beating and life left her it was as if we were alone. I thought of her mom and that if this was my daughter I didn't want her to die alone. So I tried to be that person for her in that moment. And for this tiny moment despite the gruesome scene it was - and it might sound cheesy as hell- as if the sunlight was golden around us and the sky was so blue and for a moment it was peaceful and I did say a silent prayer for her. I don't think I even got to finish it as someone started screaming next to me but when I think back I think my role was not to save her but just to be there at this moment with her so she didn´t have to go alone.   \nIt took three days till I was no longer numb from shock and finally broke down about all this. I went over the situation often to figure out if I could have done anything differently that might have saved her. It took time to accept sometimes we are just powerless.",
   "created_utc": 1702760604,
   "score": 2,
   "submission_id": "18jvv2w"
  },
  {
   "comment_id": "kdn7id6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18jvv2w"
  }
 ]
}