{
 "submission_id": "18jzij1",
 "title": "What's a subtle sign someone's not doing well mentally?",
 "selftext": "",
 "created_utc": 1702757503,
 "permalink": "/r/AskReddit/comments/18jzij1/whats_a_subtle_sign_someones_not_doing_well/",
 "score": 131,
 "url": "https://www.reddit.com/r/AskReddit/comments/18jzij1/whats_a_subtle_sign_someones_not_doing_well/",
 "comments": [
  {
   "comment_id": "kdo1p8v",
   "message": "They sleep all the time and keep canceling plans.",
   "created_utc": 1702761556,
   "score": 82,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdod7ck",
   "message": "Getting anxious from reading these comments.",
   "created_utc": 1702765635,
   "score": 90,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo4j36",
   "message": "A change in their sense of humor\n\nTheir facial expressions aren’t the same\n\nA change in ambition\n\nPassivity\n\nShort responses in conversation\n\nChange in social habits\n\nHypersomnolence \n\nNo discernible reaction to new adversity because they were expecting something to go wrong",
   "created_utc": 1702762519,
   "score": 134,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo4sw9",
   "message": "They isolate. They never get excited.",
   "created_utc": 1702762612,
   "score": 240,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo0t3q",
   "message": "They stop bathing and grooming themselves.",
   "created_utc": 1702761256,
   "score": 59,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo8bgx",
   "message": "They aren't ever hungry. People don't realize that loss of appetite can be a symptom of deppression.",
   "created_utc": 1702763855,
   "score": 179,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo5rhi",
   "message": "Dodging the question when asked \"How are you?\"",
   "created_utc": 1702762951,
   "score": 53,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdom0uj",
   "message": "They change their social habits.  Usually I respond pretty quickly to texts. But at my low points I've gone weeks without responding to a simple text.  I say I've been busy but the truth is I don’t have the energy to engage with others.   Hygiene is another one. Not bathing /brushing teeth regularly.  Same close for a few days.  I also stop my hobbies.  Books stay unread, I stop crocheting.",
   "created_utc": 1702769053,
   "score": 172,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo1ft7",
   "message": "As someone who personally feels they are struggling, I can agree with a lot of these things. Insomnia for who knows why. Fluctuating weight. Trying to be social or eat healthy but feeling like a burden or a failure when you slip. A social circle that imploded after covid and just hasnt recovered because I dont drink, and its hard to find people or groups when you dont feel like your burdening them by being lonely.  Trying to date or knowing when anyone is interested in me feels like a nightmare because I honestly ask, \"why would anyone want to involve themselves with my bs?\".  Its been tough to crawl out of this hole, but I havent given up. I can just see all of the factors where people get trapped again and again with either being treated badly and sticking in bad/unsupportive friend groups, versus dealing with loneliness while figuring out who you are and what you want as a person. It is so easy to spiral and just keep going downward when you have no goals or things to look forward to in life. Thats why its so easy to cut people out or just stop talking to them when the hurt you.",
   "created_utc": 1702761469,
   "score": 245,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdntrc0",
   "message": "They sleep less or more.\n\nTheir eating habits have changed drastically. \n\nLoss or gain of weight\n\nShortness of temper, where there used to be a longer fuse.\n\nDifficulty remembering appointments and dates and agreements\n\nGetting jumpy at loud sounds\n\nGetting botheres by light, sound or in general too much input\n\nActing self centered but not selfish when they're usually not\n\nThinking others are talking behind their back when theyre not\n\nirritability\n\nquick to tears",
   "created_utc": 1702758812,
   "score": 3,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnrgr9",
   "message": "Joking or talking flippantly about suicide",
   "created_utc": 1702757973,
   "score": 142,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnyhvl",
   "message": "Anhedonia as evidenced by no longer seeking pleasant experiences. If they just let things happen, especially distressing things, and seemingly do not respond, be *very* concerned.\n\nETA: if you empathize with this, you have a mental health emergency. If it’s been this way a while, consider IFS therapy, which is remarkable for working on otherwise difficult to treat conditions, as well as getting genetic testing for psychiatric medication done. It can cut through decades of trial and error to discover precisely what has the highest likelihood of treating your mental health issues.",
   "created_utc": 1702760474,
   "score": 252,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnsiv7",
   "message": "Consistent lack of interest in things they used to enjoy",
   "created_utc": 1702758361,
   "score": 93,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo7jd7",
   "message": "Self care goes out the window. Might stop brushing their teeth regularly, take less showers, eat shitty foods, let (body)hair grow out etc...",
   "created_utc": 1702763574,
   "score": 187,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdouxax",
   "message": "\"I'm just tired.\"",
   "created_utc": 1702772725,
   "score": 92,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdns5cm",
   "message": "if they have very low reactions to things that normally would elicit a reaction ... a total lack of any reaction to anything ... \n\nthat is a VERY bad sign",
   "created_utc": 1702758218,
   "score": 5,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo97qw",
   "message": "i was told by a friend i lived with that i stop listening to music when im sad.\n\nsaying things they typically wouldn’t say that may be harsh/inappropriate (this is from a bipolar perspective, anyway)\n\nlack of sleep or sleeping too much\n\nrandom new intense obsessions\n\nquick to anger/sadness over small things that may seem unreasonable or out of character\n\ntalking or fidgeting more than usual (typically an ongoing thing, not just a one off) or the opposite, shutting down and being sedentary\n\nless of a reaction to things that would typically bring a lot of joy\n\nreckless behavior out of nowhere",
   "created_utc": 1702764176,
   "score": 63,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoa1bf",
   "message": "If they're having trouble with their teeth. Especially if it is noticeable.",
   "created_utc": 1702764465,
   "score": 61,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdovwvl",
   "message": "I'm going to throw out the exact opposite of what everyone else is saying. For me and a lot of my health care colleagues, we are more chatty and almost overcompensate for how terribly we're doing mentally. Almost like filling the silence will stop us from thinking so it helps for a short while. Unfortunately this just adds to the burn out which can really limit the amount of energy left for anything else.",
   "created_utc": 1702773132,
   "score": 59,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnw4ar",
   "message": "ITT: A lot of people not knowing what \"subtle\" means",
   "created_utc": 1702759638,
   "score": 107,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnw8k8",
   "message": "You can see it in their eyes. 100% of the time it's in or around the eyes. A light goes out, bags under, lines, creases, dark circles, redness... The list goes on.",
   "created_utc": 1702759678,
   "score": 178,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdovt4j",
   "message": "If you know a silent, strong minded person : sudden happiness - it might mean they've found out that suicide is an option. I have CPTSD from child abuse, and am quiet, closed off, and half the time I look like a grim a-hole. When I realised that this is all totally optional, and that I didn't have to spend my life this way, it was tied with no spending my life at all. It's such a freeing realization that you can drop it all, and say \"fuck this shit\" to the pain. \n\nStatistically, suicide was formerly common to the elderly, who had lost most of their family and might be living day after day in pain. Now it's more common in middle aged men, teens, and people who just don't see much of a reason to keep up the charade of hoping things will be better - because some of the time they won't.",
   "created_utc": 1702773088,
   "score": 54,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnyibc",
   "message": "Withdrawing from participating in life.",
   "created_utc": 1702760479,
   "score": 145,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdofkvw",
   "message": "Eyes. They say everything",
   "created_utc": 1702766538,
   "score": 43,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnuedd",
   "message": "Becoming quiet, withdrawaing from social interactions, may be losing weight, may be gaining weight, stop caring about their appearance but it can also be excact opposite and everything seems perfectly fine on the outside. Sometimes nobody knows until it's too late.",
   "created_utc": 1702759045,
   "score": 88,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo55l1",
   "message": "These are mine:\n\nI am typically social so if I start to stop talking as much, don't reach out to friends, start to shut myself off, that's a sign I am not okay.\n\nMood swings, agitated, not really showing emotions...not laughing as much, not smiling, way less outgoing than normal.\n\nRestless, can't sit still. The depression gets so bad that I want to be dead, I fixate on how and where and when and to distract myself, I stir a lot. I walk in circles, I can't sit still, I can't sleep, I can't do anything more than a few minutes at a time before switching tasks.",
   "created_utc": 1702762735,
   "score": 79,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo6uhl",
   "message": "Sleeping too much or unable to sleep, loss of appetite, increased use of alcohol, withdrawing, so someone who usually keeps in contact regularly stops doing this, personal hygiene lapses, loss of interest in previously enjoyed activities or interests, saying strange things that don't make sense, always talking negatively, seeing no hope in the future.",
   "created_utc": 1702763332,
   "score": 37,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoyict",
   "message": "Sudden trend of extreme generosity like giving away money or prized possessions. They might be preparing for death.",
   "created_utc": 1702774225,
   "score": 30,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdohitj",
   "message": "If they really get into a hobby, or something that passes the time.\n\nLike if someone starts nonstop playing video games, watching Netflix, or even reading. Delving into something and putting aside basic necessities for it can be a form of dissociation and depression.",
   "created_utc": 1702767280,
   "score": 64,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdokudn",
   "message": "The week before my godparent's son committed suicide he got very happy for no apparent reason.  He would visit the kids in the neighborhood and play with them, constantly reach out to friends and family sending well wishes, and who commit acts of service to people he knew.  He even wanted to see me.  We were never close but we would talk at school during the classes we shared.  When I visited him a few days before he left this world he told me that he had been asking people to write him a poem.  I agreed to write it even though I've never been good with words.  It has been over 6 years or something close to that since he died and I still haven't written the poem.  I guess it hurts too much to think about doing it but I still remember the exact specifics of the poem he wanted.  \"Two trans cowgirls (not literally cowgirls) having an intimate rendezvous under the stars with the moon watching and later joining them in their passions.\" Someday I'll write it and read it to him where he is buried and give the poem to his parents.\n\nAnybody can go at anytime.  It is good to remind them how much you care about them while they are with us.",
   "created_utc": 1702768573,
   "score": 64,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdokmnv",
   "message": "the \"escape fantasy\" is a giveaway. if anyone mentions moving to somewhere nice and starting anew, even light heartedly, somethings wrong. From my own experience of it(ok now) it's getting close to breaking point.",
   "created_utc": 1702768488,
   "score": 106,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoie5r",
   "message": "Isolating themselves",
   "created_utc": 1702767617,
   "score": 25,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdokrol",
   "message": "For me, it’s when I stop putting in as much effort at work and letting things fall through the cracks. Not sure if that’s the same for everyone else though",
   "created_utc": 1702768546,
   "score": 27,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoksc5",
   "message": "When they keep insisting they are fine but proceed to self isolate from the group",
   "created_utc": 1702768553,
   "score": 30,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdont9y",
   "message": "Low sex drive, little interest in favourite hobbies, poor conversation.",
   "created_utc": 1702769796,
   "score": 24,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnv6q6",
   "message": "not always- but drastic sudden weight loss or weight gain",
   "created_utc": 1702759317,
   "score": 75,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdod1n6",
   "message": "They laugh a lot more than others even at the smallest jokes\n- In order to cover the bigger misery they are going through inside them",
   "created_utc": 1702765572,
   "score": 20,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdokp7o",
   "message": "A filthy bedroom. Not just messy, but FILTHY.",
   "created_utc": 1702768518,
   "score": 20,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdopbip",
   "message": "Their house is a mess",
   "created_utc": 1702770425,
   "score": 23,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdocq39",
   "message": "distant/isolation (personal input)",
   "created_utc": 1702765450,
   "score": 19,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnvv8i",
   "message": "Slowed speech or movements",
   "created_utc": 1702759549,
   "score": 38,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdox3ea",
   "message": "Dark humour\n\nBad hygiene\n\nBad diet\n\nNo ambition\n\nNo evidence of a social life\n\nNo partner\n\nImpersonal\n\nInaccessible",
   "created_utc": 1702773616,
   "score": 43,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnz01q",
   "message": "They're conscious.",
   "created_utc": 1702760648,
   "score": 67,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdokp49",
   "message": "They stop talking almost entirely except to communicate \"work related tasks\". It was me, I was not doing well mentally.",
   "created_utc": 1702768517,
   "score": 20,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdns3np",
   "message": "The person trying to be the happiest and very clingy and begging for your love. Me basically.",
   "created_utc": 1702758201,
   "score": 54,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdol6td",
   "message": "Outburst out of nowhere and cries easily",
   "created_utc": 1702768714,
   "score": 17,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdp6jlu",
   "message": "You making this post. R u ok? :3",
   "created_utc": 1702777847,
   "score": 17,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdpa7o3",
   "message": "A while ago I saw aTumblr post where a person's roommate realized she was out of deep depression when she started singing/humming randomly again. For the entirety of her depression she spoke only when necessary. Sometimes the way to tell something's off is when the little things start to fall to the wayside in favor of silence and inaction.",
   "created_utc": 1702779526,
   "score": 17,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdorb6m",
   "message": "Chronic fatigue/always being tired or sleepy. Always sleeping!!!",
   "created_utc": 1702771249,
   "score": 17,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdotwh5",
   "message": "When they feel numb. They no longer feel sadness or happiness. They feel empty and disconnected from everything.  Their expression of emotions feel hollow...like an insincere laugh or empty expression of depression.",
   "created_utc": 1702772313,
   "score": 13,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdom4ax",
   "message": "People suddenly begin to give away things that would never be given away in normal times. More often than not, people planning their suicide have a point: finish everything here.",
   "created_utc": 1702769093,
   "score": 13,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdome3h",
   "message": "Pretending to look at your phone so people dont notice you are staring blankly into nothingness.",
   "created_utc": 1702769204,
   "score": 15,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoteo2",
   "message": "They're on Reddit.",
   "created_utc": 1702772113,
   "score": 13,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoirfc",
   "message": "Crying frequently.  Absolutely nothing wrong with crying but I mean when the slightest thing brings a person to tears, including in social settings such as work.",
   "created_utc": 1702767754,
   "score": 12,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdombcq",
   "message": "Not bathing.",
   "created_utc": 1702769172,
   "score": 9,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdot17q",
   "message": "I recently discovered a friend wasn’t doing well when I saw the condition of her apartment. She stopped cleaning and tidying up completely",
   "created_utc": 1702771962,
   "score": 11,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdplhax",
   "message": "Not shaving\n\nOvereating (eating a lot of fast food)/undereating\n\nOversleeping/undersleeping\n\nShort fuse\n\nNot cleaning \n\nNot bathing\n\nNot brushing teeth\n\nNot exercising \n\nNot socializing \n\nSaying everything is fine",
   "created_utc": 1702784840,
   "score": 11,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdorww0",
   "message": "They’re in a high-stress profession and they start fucking up, a lot. \n\nI’ve had be involved in “Old Yeller-ing” some surgical colleagues who were showing clear signs of mental illness or age-related decline and were no longer safe to treat patients. I’ve seen two suicides involving surgeons who weren’t helped enough by their peers, or just didn’t take the help offered.\n\nFirst clues include a drastic drop-off in their ability in the OR, and with patients in general, and being increasingly shitty to their partners, the nurses, and other employees.",
   "created_utc": 1702771501,
   "score": 8,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoyabl",
   "message": "Drinking increases or they stay home",
   "created_utc": 1702774125,
   "score": 10,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo1elg",
   "message": "Constant reddit comments/posts about how hard life is... Fuck that's me!",
   "created_utc": 1702761458,
   "score": 31,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoegwo",
   "message": "Insomnia. Turn off TV in irritation less than 2 minutes after switching it on. Drinking caffeine and smoking. Locked away in house on own. No interest in anything at all. Not looking forward to anything.",
   "created_utc": 1702766117,
   "score": 18,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdos679",
   "message": "So, for me, I know I'm in the absolute shitter cause I've stopped doing all my normal things that make me happy.\n\nWalks, painting, books, TV, movies, podcasts, animating, drawing, sailing, yoga. All of it stops.\n\nOnly fanfiction. All fanfiction all the time. It's the only thing that let's me FEEL. \n\nGuess what hole I'm in right now?\n\nFanfiction.",
   "created_utc": 1702771606,
   "score": 18,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdowjtz",
   "message": "Getting awkward when you ask them if they are not okay with something. It’s clear that they are not they stumble over saying it.",
   "created_utc": 1702773393,
   "score": 9,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdp4iqi",
   "message": "this is a really hard thing to answer because for example with me, I don't even realize my subtle hints of not doing well, it's already ingrained in me as normal. a lot of those closest to me will be in disbelief even when I say I'm having a panic attack or going through an episode because masking has become second nature.",
   "created_utc": 1702776936,
   "score": 8,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdnt74v",
   "message": "Look at their overall posture. If they are slumping over from the shoulders up they probably have something going on.",
   "created_utc": 1702758605,
   "score": 23,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdomy9n",
   "message": "A lot more sleep",
   "created_utc": 1702769446,
   "score": 7,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdot4om",
   "message": "Speaking from experience, If someone is extremely happy and positive all the time, they might actually not feel so well. They say comedians are the most depressed people.",
   "created_utc": 1702772001,
   "score": 7,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdounoz",
   "message": "Change in how they take of themselves.",
   "created_utc": 1702772615,
   "score": 7,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoykn6",
   "message": "Alot of great ones have been said so I'm gonna add these\n\nThey seem real lethargic.\n\nEmotions seem forced and faked\n\nNot wanting to do things they used to enjoy\n\nQuiet and distant\n\nVery emotionally sensitive\n\nExtreme emotions.  Highs are extremely high, but lows are also extremely low",
   "created_utc": 1702774253,
   "score": 6,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdoz0b0",
   "message": "Change in personal hygiene. Cluttered living spaces. Quietness. Rejecting invitations.",
   "created_utc": 1702774452,
   "score": 7,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdp24r6",
   "message": "It’s that you haven’t heard from them in six months",
   "created_utc": 1702775877,
   "score": 7,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdp5y4l",
   "message": "I dunno about anybody else, but I sleep the days away. I can sleep for 16+ hours easily.",
   "created_utc": 1702777579,
   "score": 6,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdojesc",
   "message": "Very intense social media interaction, especially on groups. It's manic posting/commenting (?) I can almost smell the flame out about to happen, usually three/four weeks later.",
   "created_utc": 1702768005,
   "score": 6,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdorret",
   "message": "They stare into space a lot.",
   "created_utc": 1702771439,
   "score": 6,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdpacll",
   "message": "Telling everyone how great their life is going but it’s really falling apart.",
   "created_utc": 1702779588,
   "score": 6,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdo6tgc",
   "message": "Giving stuff away. Can mean they're not planning on sticking around to need it anymore.",
   "created_utc": 1702763321,
   "score": 11,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdomcwu",
   "message": "Sighing more often, especially when there's a lull in noises like conversation or TV. Usually it's not followed up by anything, just a quiet little sigh and then back to whatever.",
   "created_utc": 1702769190,
   "score": 12,
   "submission_id": "18jzij1"
  },
  {
   "comment_id": "kdofpzb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18jzij1"
  }
 ]
}