{
 "submission_id": "18k1768",
 "title": "What are some problems exclusive to rich people?",
 "selftext": "",
 "created_utc": 1702762361,
 "permalink": "/r/AskReddit/comments/18k1768/what_are_some_problems_exclusive_to_rich_people/",
 "score": 70,
 "url": "https://www.reddit.com/r/AskReddit/comments/18k1768/what_are_some_problems_exclusive_to_rich_people/",
 "comments": [
  {
   "comment_id": "kdobsta",
   "message": "Never being able to be certain if someone likes you for being you, or if they're just around you for your money.",
   "created_utc": 1702765096,
   "score": 117,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo86k9",
   "message": "The limit on federally insured bank accounts",
   "created_utc": 1702763806,
   "score": 116,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdobf0w",
   "message": "As an estate manager, one of my biggest tasks every season is figuring out what we do with all the spare fruits and vegetables from their private orchard / food gardens. They produce more than what they can consume… and most of the best produce we grow happens in summer when they are traveling.",
   "created_utc": 1702764955,
   "score": 68,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4p0q",
   "message": "Lawsuits. The more money you’ve got, the more people will try to get some of it.",
   "created_utc": 1702762576,
   "score": 148,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo9al4",
   "message": "It’s hard to buy Christmas presents for them since already have everything.",
   "created_utc": 1702764202,
   "score": 27,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo5kce",
   "message": "Random people -- family and/or friends -- who feel entitled to your money because, in their mind, notwithstanding you may have worked hard for your success, they've also worked hard but been nowhere-near as successful, and it's simply not fair. It could've, just as easily, have gone the other way, where they'd be rich and you'd be struggling and, of course, in that case, they'd be giving you free money. So, that's what you should be doing. Right? Right?",
   "created_utc": 1702762879,
   "score": 124,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoxnzs",
   "message": "Last night I was watching a video here on reddit of Kanye West going on a ten minute rant about... I don't know. It was rambling and disconnected, didn't make amy sense at all. Classic Kanye, at this point. \n\nWhat struck me the most was that he was delivering this bizarre sermon apparently at at party, to a huge room packed full of people, all sitting at rept attention, even cheering him on. And how, in that whole crowd of adoring \"fans\" there is likely nobody in his life who actually cares about him enough to actually speak up and tell him he needs help. In a giant room of people, Kanye was all alone. I think that's what too much money gets you.",
   "created_utc": 1702773857,
   "score": 23,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdodex9",
   "message": "Not being a rich person, though I am currently comfortable, I don't know exactly. But I would say that being targeted (romantically, economically, professionally, etc) for their money on a constant basis is probably exclusive to people who actually have resources to target.\n\nI also think that people who were born into or had tons of money and lost it for whatever reason experience an intense level of difficulty adapting to change that normal people just...don't. They may not have the life skills necessary to even survive living paycheck to paycheck and their problems will compound in ways they couldn't even possibly imagine. Rich kids had opportunities I never ever had, but I could write a book about the life skills they didn't ever learn that little trailer park kids like me totally took for granted.\n\nEdit: Typo",
   "created_utc": 1702765716,
   "score": 19,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdobo1m",
   "message": "Trust in who is truly your friend. Are they your friend because of compatibility and like mindedness? Or are they your friend simply because of your wealth status and would drop you in a heartbeat if you suddenly had no monetary value?",
   "created_utc": 1702765048,
   "score": 52,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo8rpv",
   "message": "Recently this doctor was murdered in AU because of the fancy car he was driving made him a target of home invasion",
   "created_utc": 1702764017,
   "score": 35,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdok12d",
   "message": "I had a friend in college who was extremely wealthy. He was often frustrated because he would (say) want to invite friends on the extremely expensive vacations he was going on, or have people join him at expensive restaurants, and of course they could not afford it, and then he'd happily offer to pay, and they'd have too much pride to accept, and he could not understand. Or one of his friend would be having an issue that money would fix, and he'd want to pay for it, and he'd get really frustrated when they refused. So he'd end up either not doing really cool stuff he wanted to do, which was a bummer, or doing it alone, which was also a bummer. It made me understand better why rich people often only have rich friends. \n\nDating women was difficult for him too, because the women who wanted to date him were either 1., after his money, or 2., so paranoid he (or other people) would _think_ they were after his money, they were constantly having to prove it wasn't about that and freaking out if he so much as bought him a candy bar.",
   "created_utc": 1702768250,
   "score": 35,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo91mv",
   "message": "I don't want my kids marrying into some povo family.",
   "created_utc": 1702764115,
   "score": 16,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoaeek",
   "message": "Two words: kidnapping insurance.",
   "created_utc": 1702764592,
   "score": 17,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdohymt",
   "message": "Not knowing whether your accountant, lawyer, financial advisor, etc. are embezzling money.",
   "created_utc": 1702767448,
   "score": 12,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoe70a",
   "message": "Friends and family feeling entitled to your money. It’s only $20K, that’s like $20 for you. If I had your kind of money, I would give it to you in a heart beat. \n\nPerson A needs $5k for medical expenses, Person B needs $3k because they are short for their kids college fees etc etc the list keeps getting bigger and bigger. And God forbid, you will be worse than the biggest criminal if you ask for that money back because you don’t need it, you’re already so blessed.",
   "created_utc": 1702766014,
   "score": 21,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdohn38",
   "message": "Redditors hate you but want to be rich themselves because they believe they are different.",
   "created_utc": 1702767328,
   "score": 64,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdomzq3",
   "message": "Any house problems. All your shit is super expensive of custom made, so replacing anything can take much longer and be much, MUCH more expensive. Oh your lamp shade broke? Too bad it’s custom made from someone in Italy, that’ll take 4 months to replace. Oh your kitchen light won’t turn on? Too bad it’s custom track lighting that is recessed into the ceiling so you’ll need basically a whole team to replace it. \n\nNote: I do home IT for ridiculously rich people in LA.",
   "created_utc": 1702769462,
   "score": 15,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo49es",
   "message": "They get Mo problems.",
   "created_utc": 1702762426,
   "score": 14,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4t6g",
   "message": "Yacht engine issues.",
   "created_utc": 1702762615,
   "score": 6,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoomrl",
   "message": "[deleted]",
   "created_utc": 1702770137,
   "score": 6,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo5i9m",
   "message": "Gold Diggers!   Especially if they are super attractive!    :)",
   "created_utc": 1702762860,
   "score": 21,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4kzw",
   "message": "You've bought and paid for the government, but the people are uncooperative.",
   "created_utc": 1702762537,
   "score": 22,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo5fj2",
   "message": "maintaining their wealth",
   "created_utc": 1702762833,
   "score": 10,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoq715",
   "message": "Sense of purpose. Most people have to work to live, but if you’re rich enough you have to be motivated by something else.",
   "created_utc": 1702770788,
   "score": 9,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo5v5h",
   "message": "Inheritance tax",
   "created_utc": 1702762984,
   "score": 9,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdosyvb",
   "message": "How rich?",
   "created_utc": 1702771935,
   "score": 4,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdow7g2",
   "message": "I know a bunch of guys who sold their companies for tens of millions each.\n\nOne of them complained to me that he put half of his money in some managed stock fund or something, and his 10-year-old son's index fund is outperforming it!\n\nThe guy only netted +4% growth on average in the past 10 years. On a 20 million investment.\n\nSo that portfolio grew to 30 million in 10 years time.\n\nHe made 10 million doing absolutely nothing.\n\nHis 10 y/o son? Well, they started that index fund when he was born and added 1 million to it. It grew faster with an average of +6% per year. That kid made 800 thousand in ten years of his life by doing absolutely nothing.\n\nAnd that's not all, he has 3 kids with each a similar investment.\n\nThey still live in the same home that they lived in when they weren't millionaires, he still drives the same car, and he's now an \"angel investor\" trying out one failing business idea after the other.\n\nI mean, he's got a million per year to play with, and investments like that through his main company are probably very tax-deductible or something, it's probably why these people do it in the first place: it's cheaper than spending the money directly...",
   "created_utc": 1702773254,
   "score": 4,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoqkex",
   "message": "You're a target.\n\nBlackmail, kidnapping, theft, extortion, embezzlement...\n\nThe security aspect can't be ignored. Some billionaires can never be more than a few metres away from their security, and because they are constant targets of criminals and/or people wanting to pay them back for a real or perceived action, that security is scrutinised intensely.\n\nImagine going to sleep at night, hoping the guy in charge isn't goofing off—or worse, paid off—because if that is the case you're just a few hours away from potentially being mailed a body part of your kid or finding yourself in the trunk of a car on the way to the desert.\n\nIf it seems far-fetched, well, paranoia in the wealthy isn't uncommon. \n\nBut think of it this way; imagine you're a taxi driver, and you're giving a ride to an old man. He's older than you, smaller than you, and generally in not great health. Cost of living is hard on you and you have a family to provide for. He's carrying a backpack full of gold bars worth more than you'll see in ten lifetimes. The sort of wealth that will secure your family for generations, and when you notice it, the guy says he's got thousands more bars at houses around the city, he's just moving a few between houses.\n\nYou can change the lives of every member of your family by robbing this guy who already has more wealth than he can ever spend. Maybe you get caught, maybe not, but by the time the cops get to you, you may have been able to distribute the gold amongst people you know. He can afford it, and it'll mean that you and your children don't have to struggle any more, they can have the life that you always wanted to provide for them. Besides, this old guy inherited most of it anyway. Plus, you heard he's an absolute bastard.\n\nSo, you can just do your job that you're paid for, or you can change the lives of everyone you love with just one little harmless criminal act. Well, unless he fights back, then you may have to hurt him, maybe even badly.\n\nSome people, knowing they're within reaching distance of life-altering wealth will choose to take their chances at being caught for the life they dream of. That's the modern sword of Damocles hanging above the super-rich.",
   "created_utc": 1702770939,
   "score": 7,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdohkmx",
   "message": "Embarrassing if you go to a private bank and they ask you how much money you have and you say 30 million and they say sorry, you'll need at least 80 million to be a customer here, but don't worry, there are other private banks that will cater to you.",
   "created_utc": 1702767300,
   "score": 6,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoukd1",
   "message": "People will generally hate and demonize you.",
   "created_utc": 1702772579,
   "score": 6,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdp1wgw",
   "message": "Proletariat uprising.",
   "created_utc": 1702775773,
   "score": 6,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdp3c3h",
   "message": "Keeping the peasants just happy enough to not revolt.",
   "created_utc": 1702776412,
   "score": 6,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdocjv1",
   "message": "Everyone expects them to be able to solve world hunger when, in reality, only like the top five richest people in the world could do that.",
   "created_utc": 1702765380,
   "score": 8,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo5jiz",
   "message": "They don’t know installments exist",
   "created_utc": 1702762871,
   "score": 4,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdorweh",
   "message": "Just looking after yourself becomes a full time job.\n\nYou need security everywhere, including your kids at their international school.  You need people to maintain your home(s).  You need an accountant to maintain your money.  You do nothing for yourself, because you have a \"team\" or \"office\" to handle that.  You need insurance against kidnapping.\n\nIt's like running a small business and that business is you.",
   "created_utc": 1702771495,
   "score": 5,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdosoep",
   "message": "Workers organizing for their collective interests.",
   "created_utc": 1702771814,
   "score": 6,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo77wo",
   "message": "Trying to determine how much kidnap insurance they need",
   "created_utc": 1702763462,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo8grl",
   "message": "High expectations from society",
   "created_utc": 1702763907,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoi4dc",
   "message": "Being late to your own private jet take off.",
   "created_utc": 1702767509,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoieff",
   "message": "News reporters constantly following them around and harrassing them",
   "created_utc": 1702767621,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdom2gb",
   "message": "Not knowing what to do with all your money",
   "created_utc": 1702769070,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoo3hr",
   "message": "I wouldn't know.",
   "created_utc": 1702769914,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdp1sjt",
   "message": "Becoming poor",
   "created_utc": 1702775724,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdp3zwy",
   "message": "I live on Social Security, how would I know what problems the rich have?",
   "created_utc": 1702776703,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdowq6g",
   "message": "When they're shopping for a new President it's hard to know which one to buy",
   "created_utc": 1702773466,
   "score": 4,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo78ne",
   "message": "Realistically if you're rich you don't have real problems, just inconveniences",
   "created_utc": 1702763468,
   "score": 4,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4bd0",
   "message": "Poor people",
   "created_utc": 1702762445,
   "score": 3,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4oot",
   "message": "The amount of taxes they pay",
   "created_utc": 1702762573,
   "score": 3,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4e9y",
   "message": "property tax",
   "created_utc": 1702762472,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo6786",
   "message": "Taking over daddys multi- million $ company vs traveling/ finding myself.",
   "created_utc": 1702763100,
   "score": 2,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdodb9g",
   "message": "It's SO hard to find good help.",
   "created_utc": 1702765673,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdodol8",
   "message": "Buying the wrong type of caviar.",
   "created_utc": 1702765820,
   "score": 0,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo682t",
   "message": "Poor people getting upset at them for getting another government bailout.",
   "created_utc": 1702763109,
   "score": 0,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpx8yv",
   "message": "Mainstream emotional issues.\n\n\"There I was sitting in a $10M mansion in San Diego worried how I was going to pay rent when I got back home, while their worry was moving out of their beach front property in Del Mar before the ocean level rose.\"\n\nIt was then the difference in reality and perception of Americans hit me. Not a good feeling.",
   "created_utc": 1702791098,
   "score": 0,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4jen",
   "message": "Not knowing which direction the wall is when they are blindfolded",
   "created_utc": 1702762522,
   "score": 254,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4atm",
   "message": "Comparing two yatches and choosing the one that suits",
   "created_utc": 1702762440,
   "score": 255,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo75pe",
   "message": "They might face dilemmas like choosing which private plane to use for a dinner in another country. or am I watching too many movies? lol",
   "created_utc": 1702763442,
   "score": 255,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdodzou",
   "message": "It’s hard to find good help.",
   "created_utc": 1702765936,
   "score": 255,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdocy2u",
   "message": "Are you serious?",
   "created_utc": 1702765537,
   "score": 251,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo4dr4",
   "message": "I think passive income they dont know where to come money",
   "created_utc": 1702762468,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdo5dcx",
   "message": "Problems that seem simple but require difficult decisions.\r  \n\r  \nThis afternoon I have a game at the polo club and I don't know whether to go with the Porsche Carrera or the two-seater Mercedes.🤭",
   "created_utc": 1702762811,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoddzp",
   "message": "Where to park the Bugatti",
   "created_utc": 1702765704,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdods3z",
   "message": "Gold bar storage",
   "created_utc": 1702765857,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoe03b",
   "message": "Your money belt is so heavy it can give you a hernia if you pick it up wrong.",
   "created_utc": 1702765940,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdofop2",
   "message": "Critiquing the help for incorrectly dusting down the faberge eggs",
   "created_utc": 1702766576,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoh9gk",
   "message": "trying to figure out what to do with money",
   "created_utc": 1702767178,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoi7yn",
   "message": "Where do you hide your superyacht so the government can't find it?",
   "created_utc": 1702767548,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoiybb",
   "message": "Apparently taxes 🤣",
   "created_utc": 1702767832,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdokkn6",
   "message": "Vanity plastic surgery fails",
   "created_utc": 1702768466,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdokvcd",
   "message": "My ermine stole always gets caught in the door of my ferrari",
   "created_utc": 1702768583,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdomki2",
   "message": "its really hard to get ocelot piss out of the Persian rugs.",
   "created_utc": 1702769282,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdomofb",
   "message": "Proper storing of your furs.",
   "created_utc": 1702769330,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdonhhm",
   "message": "Managing staff.",
   "created_utc": 1702769663,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdotkst",
   "message": "How would I know? I’m broke AF",
   "created_utc": 1702772184,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdotwcm",
   "message": "Which car to drive",
   "created_utc": 1702772311,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdouk0t",
   "message": "Being disciplined to know you can't solve all the world's problems with money on its own. Having large amounts of money doesn't always equate to easy solutions.",
   "created_utc": 1702772575,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdouvn9",
   "message": "trying to decide on what color roles Royce they would want. oh well may as well get two different color roles.",
   "created_utc": 1702772706,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdovmds",
   "message": "Getting a refund from Space X.",
   "created_utc": 1702773012,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdow1qh",
   "message": "Hiding all my money so the government can’t get it",
   "created_utc": 1702773186,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdoy1co",
   "message": "When their lazy butlers wash their sock garters and they're still covered in shmutz",
   "created_utc": 1702774013,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdp0d9p",
   "message": "You are what you can provide for others. \n\nGenuine friendships are tough to come by.",
   "created_utc": 1702775072,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdp1zh4",
   "message": "Wife: You know bumpkins that pool boy hasn't been doing a very good job lately. I think it is time to get a new one. Husband: that reminds me about the sloppy maid we have.....",
   "created_utc": 1702775810,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdp3e04",
   "message": "Dying in submarines and private jets.",
   "created_utc": 1702776436,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpbcyw",
   "message": "If you're a rich popular rapper nobody in your entourage will tell you to get your bipolar disorder treated.",
   "created_utc": 1702780062,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpbk8t",
   "message": "The relaxation and serenity of anonymity. \n\nI run the largest company in a small town and I have very little of that. \n\nNot a problem I ever thought I would have.",
   "created_utc": 1702780156,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpbn0b",
   "message": "too many choices. I couldn't stand 'em.",
   "created_utc": 1702780192,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpc0vo",
   "message": "When your personal chef calls in and you have to eat cereal like a pleb.",
   "created_utc": 1702780374,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpd1qm",
   "message": "Kidnapping insurance\n\nTax minimisation",
   "created_utc": 1702780850,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpdt30",
   "message": "Chronic luxury fatigue",
   "created_utc": 1702781211,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpeh9y",
   "message": "This is a trick question. There are no exclusive problems for rich people. There's just a lot fewer of them.",
   "created_utc": 1702781534,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpfvxs",
   "message": "Being broke and not realizing it until you are 10 million in the hole.",
   "created_utc": 1702782203,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpgb9z",
   "message": "Why is the chauffeur late?",
   "created_utc": 1702782402,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpjtis",
   "message": "Try as you might, your children are almost certainly growing up to be spoiled assholes.",
   "created_utc": 1702784042,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdplftp",
   "message": "Having to hire private security to go around with you because deep down you know you would fucking deserve it if someone were to...",
   "created_utc": 1702784820,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpmdds",
   "message": "Very complicated taxes.  With different income sources, various investments, corporations, and trusts, taxes end up being quite difficult.",
   "created_utc": 1702785277,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpnkn5",
   "message": "Estate tax most people simply don't have enough money for it to be in thing\n\nActually a lot of tax things are exclusive to the rich because people want to keep throwing them under the bus despite the fact that everyone knows the economic forces do not work that way (back when the tax rate was really high The majority of the tax code was finding ways for them to get out of it)",
   "created_utc": 1702785866,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpnli0",
   "message": "Estate tax most people simply don't have enough money for it to be in thing\n\nActually a lot of tax things are exclusive to the rich because people want to keep throwing them under the bus despite the fact that everyone knows the economic forces do not work that way (back when the tax rate was really high The majority of the tax code was finding ways for them to get out of it)",
   "created_utc": 1702785878,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpnw3w",
   "message": "Who fucking cares.",
   "created_utc": 1702786023,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpo22s",
   "message": "Taxes.",
   "created_utc": 1702786105,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpokna",
   "message": "The help is too slow refilling the drinks.",
   "created_utc": 1702786364,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdptmhs",
   "message": "It's not easy managing that amount of money and all its implications. Of course they have trusts and portfolio managers, but it further pulls them away from reality of how things are. Esp. if they did not make the money themselves. \n\nThe help surely resents you I imagine, even if you are self-made, even if you are generous and kind and pay them well. At some point, money begins to make money and the gap between the haves and have-nots widens beyond repair. To a homeless person, someone living in a modest house looks rich too.",
   "created_utc": 1702789031,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpu0d0",
   "message": "Where to keep all your money",
   "created_utc": 1702789249,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpvyl4",
   "message": "Lawyer/accountant/therapist on retainer",
   "created_utc": 1702790366,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpxb7l",
   "message": "Estate taxes, death taxes, gift taxes. They're all the same thing in the U.S. and they only apply to you if your estate is worth over $11 million. $22 million if you're married.",
   "created_utc": 1702791135,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpxbkf",
   "message": "Too many Teslas for one garage :p",
   "created_utc": 1702791141,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdpzyd0",
   "message": "Company related shits",
   "created_utc": 1702792725,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdq387w",
   "message": "A few are living so high on the hog, that they don't recognize the full blown grunt express *as* the whole hog.",
   "created_utc": 1702794763,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdq45d7",
   "message": "HOAs, Zoning Officers, Karens.",
   "created_utc": 1702795374,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdq5ncx",
   "message": "I'd say its probably hard to tell if your friends are hanging out with you because they like you or because you're rich.",
   "created_utc": 1702796407,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdq5smn",
   "message": "The sense of insecurity and trust to those who approach them for whatever reasons - not knowing whether it is genuine or not.",
   "created_utc": 1702796512,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdq6yaw",
   "message": "Lawsuits. The more money you’ve got, the more people will try to get some of it.",
   "created_utc": 1702797359,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdqb4tg",
   "message": "The limit on federally insured bank accounts",
   "created_utc": 1702800565,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdqb5b7",
   "message": "It’s hard to buy Christmas presents for them since already have everything.",
   "created_utc": 1702800575,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdqbi1b",
   "message": "The limit on federally insured bank accounts",
   "created_utc": 1702800856,
   "score": 1,
   "submission_id": "18k1768"
  },
  {
   "comment_id": "kdqdph2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18k1768"
  }
 ]
}