{
 "submission_id": "18kcd6f",
 "title": "What is the best second language to learn that isn't English?",
 "selftext": "",
 "created_utc": 1702799838,
 "permalink": "/r/AskReddit/comments/18kcd6f/what_is_the_best_second_language_to_learn_that/",
 "score": 23,
 "url": "https://www.reddit.com/r/AskReddit/comments/18kcd6f/what_is_the_best_second_language_to_learn_that/",
 "comments": [
  {
   "comment_id": "kdqahjb",
   "message": "Here in the US it's definitely Spanish",
   "created_utc": 1702800068,
   "score": 89,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqd3j4",
   "message": "Lots of research, and it really depends on what you mean by \"best\". There are plenty of good podcasts exploring it, including a few by Freakonomics.\n\nEconomically, English is the most valuable as a language of business power, with Mandarin second and German third. For versatility, if you were randomly teleported to an unknown country then Spanish as it is common globally, and Arabic as well if you are looking by nation counts. If you knew English, Mandarin, and Spanish then when you are randomly teleported you have a high probability of finding someone who can talk with you. \n\nIf you are near a border or want to travel, then the languages of the places of interest will have high utility.",
   "created_utc": 1702802125,
   "score": 28,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqay54",
   "message": "Spanish, also the easiest.",
   "created_utc": 1702800420,
   "score": 23,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqmecs",
   "message": "The best second language is the one you’re personally most interested in! \n\nWhich language could you use in your neighborhood/job/hobbies? What cultures genuinely interest you? How much of a challenge are you looking for? Do you want to learn to use a new writing system, etc.?\n\nMost people don’t get very far into the process of learning a language before they quit. If you pick one you’re actually interested in, then the odds are way higher that you’ll learn it properly. For example, don’t just decide to learn Mandarin because it’s “useful” if you don’t have any real interest in the language and culture and if you don’t work in a field where that would be actually all that useful.",
   "created_utc": 1702809799,
   "score": 7,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqac06",
   "message": "Spanish or Mandarin\n\nEither one of those two are very useful if you get those down fairly well, then you should be able to learn the other languages that are related to one another.",
   "created_utc": 1702799948,
   "score": 27,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqd1sp",
   "message": "Depends on the reason to learn it",
   "created_utc": 1702802088,
   "score": 5,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqajh8",
   "message": "German",
   "created_utc": 1702800109,
   "score": 21,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqcbsg",
   "message": "Spanish, Arabic or Mandarin. \n\nThese are the most widely spoken languages of the world beside English. \n\nI personally would learn arabic.",
   "created_utc": 1702801505,
   "score": 9,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqmcvx",
   "message": "I'm learning Portuguese in college bc the Spanish Dept. sucks here. I would definitely say Spanish, but gotta protect my GPA. A cool thing about Portuguese is that knowing it well can make it easier to learn Spanish. And Portuguese speakers can understand written and spoken Spanish better than in reverse.",
   "created_utc": 1702809767,
   "score": 5,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqsi5c",
   "message": "Whichever language you like.\n\nNo, I mean it. After you've learned English to a decent level, the entire world is open to you. Language won't be a hindrance to most jobs you'd want to apply to, you will find at least some people in any corner of the world that you can communicate with, you will find plenty of interesting stuff to read and interesting movies to watch. Pretty much everything you need to learn a specific foreign language for, that language is going to be English. Of course exceptions may apply, but if they apply to you, you're not going to ask what language is best to learn because you'd already know.\n\nSo once you're done with English and want to learn another language, choose the one you're most likely to stick with. Are you interested in a country's culture? Choose that country's language. Do you have a significant other from another country? Choose their language. Do you want to move to another country? Choose that country's language. You simply love the way a language sounds? Learn that.",
   "created_utc": 1702814613,
   "score": 4,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqh19h",
   "message": "Latin. I want to know what the scientific names for the animals really are. For all I know they named a frog jumpy. I have no way of really knowing if I don't learn Latin.",
   "created_utc": 1702805311,
   "score": 7,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqaun7",
   "message": "Depends on what you want to do with it. Mandarin or Spanish has the most usage mainly mandarin for business",
   "created_utc": 1702800347,
   "score": 3,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqa8mq",
   "message": "Spanish probably",
   "created_utc": 1702799874,
   "score": 5,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqa9z8",
   "message": "Español, that's a whole different continent unlocked",
   "created_utc": 1702799905,
   "score": 6,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqhuuu",
   "message": "German.\n\nBonus because you can say it in all caps like FLAMMENWERFER!!! PANZERFAUST!!\n\n**SHIẞENHAUSEN!!!**\n\nAnd it looks mildly intimidating...",
   "created_utc": 1702805997,
   "score": 5,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqc8o3",
   "message": "I’m well on my way to learning Spanish after working in the culinary industry for a long time.  Coworkers generally try and help teach you if you show you’re putting the effort in to learn and try and make conversation.",
   "created_utc": 1702801436,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqce5o",
   "message": "English Spanish and French",
   "created_utc": 1702801557,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqcgn5",
   "message": "Spanish cause for some reason I find it easy since some of our words in the Philippines I didn't know that's it's actually a Spanish words.",
   "created_utc": 1702801614,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqdd77",
   "message": "spanish or mandarin for talking to the most people world wide. \n\nrussian or german for getting out of situations",
   "created_utc": 1702802339,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqdq8e",
   "message": "Spanish",
   "created_utc": 1702802632,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqdz26",
   "message": "Spanish \nGerman\nChinese \nArabic",
   "created_utc": 1702802831,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqe9tq",
   "message": "Spanish then French will be easy",
   "created_utc": 1702803073,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqfx0j",
   "message": "Spanish",
   "created_utc": 1702804408,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqpey8",
   "message": "Spanish",
   "created_utc": 1702812235,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqpoq8",
   "message": "Arabic, I wish I knew this language!",
   "created_utc": 1702812452,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqrwvo",
   "message": "Python",
   "created_utc": 1702814176,
   "score": 3,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqabef",
   "message": "Mandarin or Spanish",
   "created_utc": 1702799935,
   "score": 4,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqassa",
   "message": "Spanish. It's easy for people who came from a country which the Spaniards colonized because the Spanish has a big impact in their culture. Like for example, the Philippines. It's easy for Filipino people to learn Spanish due to the fact that some of the words they use are from the Spanish.",
   "created_utc": 1702800307,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqbun1",
   "message": "Spanish, German, French, Russian.  That's the most popular languages in the world",
   "created_utc": 1702801130,
   "score": 3,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqazww",
   "message": "Mandarin Chinese, Russian or Spanish, I think, to be ready for the action when the BRICS economies are running the show. I'd go for Chinese cos I'd love to live their one day, but Spanish would open up a lot of the world too",
   "created_utc": 1702800458,
   "score": 2,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqhtsf",
   "message": "Chinese of course, China is gonna be number 1 soon enough and if you want to deal with 1.3 billion Chinese people, you better learn the language.",
   "created_utc": 1702805972,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqmid2",
   "message": "Bulgarian obviously duh",
   "created_utc": 1702809893,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqfhes",
   "message": "Dutch of course, why ? ASML we rule the world already only the general public isn't aware yet.",
   "created_utc": 1702804056,
   "score": 0,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqlhd7",
   "message": "From a business \u0026amp; technology perspective, I think it is Chinese",
   "created_utc": 1702809037,
   "score": 0,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqbmzj",
   "message": "I'd say Mandarin, but it's not as widespread as French or Spanish.",
   "created_utc": 1702800963,
   "score": 252,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqazzo",
   "message": "I'd definitely say mandarin if you are up for it. Extremely difficult but the most spoken language in the world, and opens job opportunities!",
   "created_utc": 1702800459,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqe2ry",
   "message": "Whatever is spoken most in your area that's not English.",
   "created_utc": 1702802916,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqem3q",
   "message": "German if you want some headache",
   "created_utc": 1702803351,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqfoyl",
   "message": "The language which is spoken by your target audience/stage the most",
   "created_utc": 1702804227,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqgxo1",
   "message": "You should consider the learning curve. It's really hard for an native English speaker to become fluent in Mandarin. Some say it takes 4000 hours. On the other hand, Roman languages such as French, Spanish or Italian require more or less 1000 hours.\n\nAs much as I rate the importance of Mandarin (and China in general), I doubt it's worth thousands of hours for average USA citizens.",
   "created_utc": 1702805229,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqj9fq",
   "message": "Latvian",
   "created_utc": 1702807178,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqjl4e",
   "message": "Probably French or some language like that one.",
   "created_utc": 1702807450,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqkcyh",
   "message": "Uzbek",
   "created_utc": 1702808100,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqkjh1",
   "message": "Depends, in west eu and africa french. In us spanish. In east eu russian. If you wanna make lots of money as an engineer Chinese.",
   "created_utc": 1702808250,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqkyqa",
   "message": "French",
   "created_utc": 1702808601,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqlbp4",
   "message": "Know what’s really cool in a political climate where everyone’s trying to say “no x are the REAL nazis, look at this video of a guy telling me what to think about a movie about Nazi germany!”?\n\nHaving taken 6 years of German and being able to just sit and watch original interviews, speeches, read documents from the Nazi gov at the time (it’s like people forget that film was around then, it wasn’t all made afterwards- we literally have direct interviews with goering and such), and seeing that no- absolutely 100% only one side currently definitely correlates to their ideals and methods. It’s not even close. In fact the media campaigns to paint that reality differently, also directly correlates. \n\nAlso understanding certain movies is fun. \n\nOther than that, I don’t ever use any foreign language in my day to day. Never once have I been found wanting to know Spanish because of something in front of me or affecting me. But apparently German is supposed to be very useful for the auto industry and manufacturing.",
   "created_utc": 1702808905,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqmc4v",
   "message": "Depending on where you live",
   "created_utc": 1702809749,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqn36d",
   "message": "And roman language, and after that, any slavic one. You'll be surprised how many doors it'll open for you!",
   "created_utc": 1702810363,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqol3y",
   "message": "Mandarin, Spanish or Arabic.",
   "created_utc": 1702811579,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqown6",
   "message": "Polish. It is so easy and beautiful. W szczebrzeszynie chrząszcz brzmi w czcinie.",
   "created_utc": 1702811835,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqpojf",
   "message": "Depends where you live and want to travel to. All the Americans are saying Spanish, but I've literally met  only 2 Spanish speakers in my life (and one was in the US). In Australia the most useful foreign langs would have to be Indonesian, Mandarin or Hindi.",
   "created_utc": 1702812448,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqpuua",
   "message": "If you're in business, probably Mandarin.",
   "created_utc": 1702812588,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqr59d",
   "message": "Depends what you want to do.  If you want to terrorize your ignorant friends, Arabic is your best choice.",
   "created_utc": 1702813591,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqrabm",
   "message": "It depends on what you want to achieve by learning the language.\n\nIf you want to annoy people, then probably Klingon.",
   "created_utc": 1702813700,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqv3in",
   "message": "Spanish or japanese",
   "created_utc": 1702816460,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqwhgi",
   "message": "Spanish for two reasons.  First it's extremely widely spoken in the Americas.  As a bonus it's also easier to make yourself understood in Portuguese and Italian if you really have to, since some words are going to be almost the same.  Second, it's great for the SAT language section, since there seems to be a strong leaning towards the Latin side of English in their word comparison.  Even if you don't need to take the SAT, you can use it to understand a lot of words you might not know the meaning of.",
   "created_utc": 1702817364,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqx4r5",
   "message": "French or spanish",
   "created_utc": 1702817766,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqx7q1",
   "message": "Spanish for those who live in the US",
   "created_utc": 1702817817,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqx9jc",
   "message": "Wait, no one’s going to say a programming language?",
   "created_utc": 1702817849,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqxvat",
   "message": "Statistically speaking, Spanish or mandarin. Practically speaking it largely depends on your region",
   "created_utc": 1702818229,
   "score": 1,
   "submission_id": "18kcd6f"
  },
  {
   "comment_id": "kdqzihb",
   "message": "For what? If you live in China - Mandarin.",
   "created_utc": 1702819210,
   "score": 1,
   "submission_id": "18kcd6f"
  }
 ]
}