{
 "submission_id": "18kgwlh",
 "title": "What was the strangest thing a doctor has ever said to you?",
 "selftext": "",
 "created_utc": 1702818169,
 "permalink": "/r/AskReddit/comments/18kgwlh/what_was_the_strangest_thing_a_doctor_has_ever/",
 "score": 87,
 "url": "https://www.reddit.com/r/AskReddit/comments/18kgwlh/what_was_the_strangest_thing_a_doctor_has_ever/",
 "comments": [
  {
   "comment_id": "kdrjc9b",
   "message": "I had a female doctor bend me over and stick her finger up my butt to check my prostate. When she was done she said “Your prostate is absolutely wonderful! No enlargement  at all. It’s absolutely fantastic! GOOD FOR YOU!”\n\nShe did this with the same voice and look on her face that one would give to someone who just performed a symphonic masterpiece. I felt so accomplished. \n\nI’m sorry she left the practice.",
   "created_utc": 1702828670,
   "score": 111,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrrasl",
   "message": "I asked my doctor, who had just performed brain surgery on me, how he got inside my head. He literally giggled, rubbed his hands together and said, “Power tools.”",
   "created_utc": 1702831827,
   "score": 242,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdri3wy",
   "message": "I had an MRI of my knee. Doc said two things that were unusual. \n\n“I’ve never seen them use the word macerated to describe someone’s knee before.”\n\nAnd \n\n“How did you break your leg?” (I was not aware that I had broken my leg)",
   "created_utc": 1702828162,
   "score": 247,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdramgl",
   "message": "I asked him what a long acronym \"FUE\" the ocular oncologist wrote meant, he tried to pronounce it, shrugged, and said \"We'll just call it Fucked Up Eye\".  It's been called that ever since.\n\nDuring the same weird cancer episode, a neurologist said my brain was \"unremarkable\".  I mean, he's right in so many ways, but I was delighted to hear it.",
   "created_utc": 1702824886,
   "score": 191,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdra8c0",
   "message": "Proctologist inserting camera: let me know when this feels good",
   "created_utc": 1702824706,
   "score": 163,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrz9f4",
   "message": "In the ER about 2am, he didn't speak English very well. Starts telling me about my CAT scan and the results of it. Me being half asleep, I stop him and him if they took me out of the bed and put me in a machine. He says yes. I said I'm 99% sure that wasn't me. He says \"are you (name)?\" I said no. He flips over the next page of his note pad, \"Are you Skittlecar1?\" I said yes. Ok good. You're having a heart attack. \n\n\nEnded up with 5 stents and I'm all good now after some therapy.",
   "created_utc": 1702834798,
   "score": 163,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdriqq5",
   "message": "We got your blood work back and it turns out that you’re a Type 1 Diabetic! \n\nI responded with “yes, for the last 15 years, thank goodness I came to see a specialist”",
   "created_utc": 1702828423,
   "score": 54,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrhy1e",
   "message": "I broke my arm in 3 places in 4th grade. The doctor asked me if I wanted to have any pain meds before they set my arm and immediately warned me that it’d be through a huge needle that would hurt as much as setting my arm. So I passed on the pain meds and then passed out from the pain when they yanked on my arm to straighten it out. \n\n\nDoctors in the 70s acted like pain meds were made out of gold",
   "created_utc": 1702828095,
   "score": 196,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrkmjn",
   "message": "Dr: Are you related to Dr _____ that works here?\n\nMe: Yes, he’s my uncle\n\nDr: Do you like him?\n\nMe: No he’s an absolute dick\n\nDr: opens door rushes down hallway and I can overhear him say “told you! Even his own family hates him” to the other docs in the office",
   "created_utc": 1702829188,
   "score": 163,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrluua",
   "message": "“How the hell is there sand in here?”\n\nGot really hurt at the beach and had busted an eardrum. Went to the ER was told my ear was fine. Got back in my home state and went to an ENT doctor, had about 7 pieces of sand embedded in the membrane of my eardrum.",
   "created_utc": 1702829684,
   "score": 215,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrb48f",
   "message": "My gynecologist said I had a “textbook cervix” and I’m still riding that high",
   "created_utc": 1702825113,
   "score": 202,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrl6oq",
   "message": "\"Stay here. I have to contact the state health department.\"\n\nTurns out I had Zica",
   "created_utc": 1702829413,
   "score": 0,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdreb64",
   "message": "I told my doctor that I was concerned about my drinking. He asked why. I said I drank alone. He said \"well so do I, that's pretty normal\", then I went on to explain how I did it quite often and always to the point of getting drunk, to which he replied \"well whats the point of drinking if you're not going to get drunk?\". I was in my early 20s and left there relieved thinking that my habits were fine and carried on. Almost 10 years later I really wish he'd taken me seriously.",
   "created_utc": 1702826554,
   "score": 143,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrl6hv",
   "message": "\"we think you might have lymphoma, but that's the cancer you want, either we'll cure it or it will just kill you, no hanging around\"",
   "created_utc": 1702829411,
   "score": 106,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kds4dzj",
   "message": "A male doctor declared that I was about to receive the best pelvic exam in my life. He then proceeded to chatter about how horrible they are for women so he asked his wife to help instruct him on making them as painless and comfortable as possible. He did not lie, it was indeed the best pelvic exam I’ve had in my life. Weird as fuck to start out that way, but bless him for caring so much.",
   "created_utc": 1702836710,
   "score": 229,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrdsro",
   "message": "I saw a specialist following a serious arm injury. He looked me up and down, glancing at my pink and blonde hair, and muttered with an eyebrow raised, \"Huh. That's an... interesting color.\"\n\nThis wouldn't be at all strange if his own hair wasn't BRIGHT BLUE.",
   "created_utc": 1702826330,
   "score": 234,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr1y9h",
   "message": "An older doctor was examining my breasts because they were lumpy and it concerned me. The doctor said ‘wow! Your breasts are just like my wifes … er I mean you both have fibrocystic breasts.’ He blushed and I just laughed.",
   "created_utc": 1702820566,
   "score": 1,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrj7lh",
   "message": "Doctor giving me an exam: \"You do realize Mr.  HoneyBadger that your left testicle hangs lower than the right?\"\n\nMe concerned as fuck: \"Uhhhh yes....is that something bad?!!\"\n\nDoctor: \"No not at all. Very common and normal.  You can put your pants back on.\"",
   "created_utc": 1702828616,
   "score": 127,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrn37s",
   "message": "I got a vasectomy and the female doctor said, \"you've got really nice anatomy,\" and I couldn't believe what she had just said to me.  She followed it up with \"I just mean your skin (on your scrotum) is really thin...\"\n\nTalk about a rollercoaster of emotions.",
   "created_utc": 1702830176,
   "score": 46,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdreh1z",
   "message": "I hurt my knee recently and my doctor went from telling me that \"Yeah everyone's climbed into thier yard waste bin and it's tipped over. Been there myself\" then he figured out I was on blood thinners and did a complete 180 to \"You definitely shouldn't be doing that!.....\" and then started detailing why.",
   "created_utc": 1702826623,
   "score": 61,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr6how",
   "message": "“your guess is as good as mine”",
   "created_utc": 1702822923,
   "score": 132,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrqx2l",
   "message": "“You have by far the largest tonsils I’ve ever seen in all my years as a dcotor, I mean my god they are huge” then proceeded to show two other doctors, literally pulled them out of a room to show them. I wasn’t even sick they are just naturally huge.",
   "created_utc": 1702831681,
   "score": 58,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrirhv",
   "message": "I had a cough I couldn't shake for a couple of months. Not a nagging cough but a once an hour light cough thing. Just enough to be annoying. \n\nSince it wasn't that frequent the doc asked why I wanted to get rid of it. \n\nwtf? First and last time I went to that guy.",
   "created_utc": 1702828431,
   "score": 31,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrancm",
   "message": "She said I was a healthy person with lots of medical problems",
   "created_utc": 1702824897,
   "score": 23,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrhgpb",
   "message": "Told me my vertebra looked like someone put a saltine cracker on the floor and stepped on it. \n\nHe was right, but that’s not exactly something I wanted to hear in that moment.",
   "created_utc": 1702827892,
   "score": 21,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr6w1w",
   "message": "I'm split between (both were female doctors):\n\n\"Could you move them (my balls) out of the way?\"\n\nor\n\n\"Sorry to lay on you, but I have a better access in this position\".",
   "created_utc": 1702823123,
   "score": 230,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdro9q1",
   "message": "To repeatedly hit my wrist with a Bible to get rid of some fluid buildup (a Ganglion)\n\nAnd it worked, too. (Any heavy book or hard object could work, he just advised a Bible)",
   "created_utc": 1702830647,
   "score": 21,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrho1l",
   "message": "Doctor: Are you gay?\n\nMe: No.\n\nDoctor: Oh, I thought you were.",
   "created_utc": 1702827977,
   "score": 232,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr813w",
   "message": "“Get back on that horse” (after I miscarried).",
   "created_utc": 1702823674,
   "score": 222,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrakut",
   "message": "Several years ago I saw a therapist and when I mentioned suicidal thoughts to him he pulled his phone out and opened up his Facebook to show me some inspirational memes he recently shared because idk, I guess he thought they were so profound they would cure me lol",
   "created_utc": 1702824865,
   "score": 133,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrdkgq",
   "message": "-To stockpile my unused prescription meds instead of disposing of them because one day I might need to trade them for food or ammo. \n\n-Eat more Wonder Bread.",
   "created_utc": 1702826228,
   "score": 30,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdqxyid",
   "message": "\"Sometimes when I eat eggs they give me diarrhea\"",
   "created_utc": 1702818284,
   "score": 27,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrq5fi",
   "message": "You’re just having normal cramps. After going to another Dr I found out I had three tumors and internal bleeding that was turning into gangrene. If I hadn’t changed Drs I’d be dead. Had to have a complete hysterectomy at 21 because of a Dr not listening to me.",
   "created_utc": 1702831383,
   "score": 184,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr63qu",
   "message": "“Do you think super heroes are circumcised? Superman? Plastic man?”\n\nAs I was getting circumcised. Made me think hard about it though.",
   "created_utc": 1702822730,
   "score": 227,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrnjx2",
   "message": "'Your problem is that you think too much.' - said by the doctor prescribing me fluoxetine for my OCD.",
   "created_utc": 1702830362,
   "score": 201,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrexcg",
   "message": "\"If you want we can saw off your pinky finger.\"\n\nI was 8, and my bone fractured finger is still working fine, although a bit deformed. Swedish doctors are something else..",
   "created_utc": 1702826821,
   "score": 152,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kds2ekd",
   "message": "Went to urgent care because I was having stabbing pains in my lower right abdomen and I had always heard that was a sign of appendicitis.\n\nThe doctor examined me, pressed on my abdomen and I winced in pain because it hurt. They ran X-rays and I waited in the exam room for a few minutes while they examined them.\n\nWhen the doctor came in her first words to me were \"You're full of shit!\"\n\nI was about to protest that I wasn't faking my pain, but she quickly followed up with... You're severely constipated.\n\nTold me to go to CVS and buy an over the counter liquid laxative. A few hours, and several trips to the bathroom later, I was feeling much better.",
   "created_utc": 1702835973,
   "score": 155,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrfvse",
   "message": "Was getting a pap smear, doc was all up in my bits and exclaimed \"you have a beautiful cervix\"\n\n..thank you?",
   "created_utc": 1702827231,
   "score": 145,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrx70c",
   "message": "Dr #1: The red bump on your penis looks like herpes. Let me get a second opinion.\n\n::brings in dr with student doing clinicals... Now have a gathering at the shrine of my dick::\n\nDr#2: No idea. Doesnt look good though.\n\nMe- ::wtf kind of answer is that::\n\n\nHad 3 whole days thinking about how my life was going to be different now with an std. Guilt. Shame. Then an ingrown hair came out. \n\nFuck you doc.",
   "created_utc": 1702834022,
   "score": 2,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrobm0",
   "message": "\"If God wanted us to take pills He would have put a little hole in our stomachs,\" pokes me in the belly.  \n\nThis from an endocrinologist who wanted me to stop taking **all** medications for at least a month before she would even think about listening to my concerns or having blood work done.  After leaving me waiting in the exam room for nearly two hours.",
   "created_utc": 1702830668,
   "score": 245,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrtev7",
   "message": "A horse threw me into the side of the barn (not really her fault) and broke my coccyx. ER took xrays of my pelvis. The ER doctor came in to tell me their findings with the biggest grin on his face and said, \"Contrary to public opinion, I can't put your ass in a sling.\" He obviously had been waiting his entire career to deliver that line.",
   "created_utc": 1702832621,
   "score": 237,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdry8n5",
   "message": "A tie: \n\nThis one is weird with a high dose of creepy: I got run over by a car when i was 18. The paramedics had to cut my jeans off of me in the ambulance cause of the swelling in my legs. The ER doctor came in to see me pretty quickly and goes “well this is my favorite! When a beautiful woman comes in with her pants already cut off!” \n\nThis one just weird - my first ever appointment with a gynecologist when I was fifteen, she lifts up the cover to look at my vagina and goes “well hello my little friend!”",
   "created_utc": 1702834413,
   "score": 81,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrocc5",
   "message": "Went to my family doctor for a pap and right after shoving his fingers inside of me, said: “so how’s your dad doing?” 💀",
   "created_utc": 1702830676,
   "score": 102,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdren95",
   "message": "I once said as a teenager to my pediatrician that my tailbone hurt. The doctor recommended that it might need to be surgically removed and I was so scared I never brought it up again.",
   "created_utc": 1702826699,
   "score": 201,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrkiu0",
   "message": "“Wow.”\n“Shit.”\n“Okay you’re a girl.”\n\n3 separate things doctors have said while looking at my normal, regular, vagina. Although I did have shingles on my vulva during the first one (ouch).",
   "created_utc": 1702829146,
   "score": 200,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kds5qr6",
   "message": "An old doctor gave me a hearing exam, and said I “have the ears of a German shepherd.”\n\nThen he paused and said “your hearing is pretty good too.”\n\nDoctor dad jokes…",
   "created_utc": 1702837202,
   "score": 199,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdriwsj",
   "message": "I was getting a Pap smear. I’d told my doctor prior to this visit that I’ve been asexual/celibate over 15 years. \n\nWhen she slid the speculum in, she looked up and said, *“How long has it been?”* I told her again. \n\nWith a straight face she said, *“Oh, I thought I’d need a smaller speculum but this one just slid right in.”* I could have died. Just died. \n\n**That was over 5 years ago and I can’t forget it.** 🤦‍♀️",
   "created_utc": 1702828491,
   "score": 121,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrf4ax",
   "message": "If human bodies were cars then you were built like a KIA.",
   "created_utc": 1702826905,
   "score": 82,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr9fke",
   "message": "Not to me but years ago I drove my Dad to the doctors and we went in the room.\n\nDoctor: What can I do for you Mr X\nDad. I just haven't been feeling myself lately.\nDoctor. I'm glad it's a filthy habit.\n\nI almost choked laughing.",
   "created_utc": 1702824338,
   "score": 84,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrjjer",
   "message": "Him - Sir you have no ACL I have no idea how you’re walking, or wrestling, or playing basketball… doesn’t it hurt?\n\nMe - mama didn’t raise no bitch\n\nHim - no.. it’s seems not.. but she did raise a smurf\n\n\nDamnnn I’m not that short",
   "created_utc": 1702828750,
   "score": 21,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrwych",
   "message": "\"Wow, you've had a lot of miscarriages!\"\n\nFuck you too, buddy",
   "created_utc": 1702833932,
   "score": 78,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrkb33",
   "message": "Doctor (slams something on table) “what is it now!?” After returning because the problem didn’t go away.\n\nAlso doctor “why don’t you come to your annual exam?, it’s best to find problems early!” \n\nCan’t wait until I never have to deal with this mind fuck of an existence again…",
   "created_utc": 1702829061,
   "score": 68,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr23l8",
   "message": "\"You need to occasionally have your period, otherwise your insides won't get cleaned out and everything will start to go off and decay.\"\n\nA general practitioner when I updated him about my meds and starting a gestagen based birth control, which works by thinning out the endometrium so the egg can't attach to it. (This is very simplified and most likely badly translated.)\n\nAt that point, I was working the gyn ward, and he didn't even know that there would BE no endometrium to liquefy and be \"cleaned out\", nor that the pill I was taking was MEANT to be taken through.\n\nI later got the mirena. I wonder if he'd think I need to take my IUD out every month so my insides can get cleaned out.",
   "created_utc": 1702820646,
   "score": 254,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrdqys",
   "message": "“It’s just a shame to see pretty girls with all those tattoos!” when I went in to urgent care for a potentially infected cut that happened to be on one of my arms, which are sleeved. Sir, do I need antibiotic ointment or not? My tattoos have nothing to do with this interaction.",
   "created_utc": 1702826308,
   "score": 52,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdri0vi",
   "message": "“Have you considered that you’re making this up?” when I was literally throwing up daily and in pain. \n\nThat was a private doctor that I paid good money for.\n\nIt took a kind public doctor to tell me gently that I must be extremely stressed and it had started to affect my body. \n\nI was very young so I hadn’t found my voice to state my boundaries and assert myself. \n\nThat incident taught me to be just as kind as that public doctor was.",
   "created_utc": 1702828127,
   "score": 55,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrbvr2",
   "message": "“What kinda meds do you want?”\nI mean… why bother to see a doctor if I know the answer",
   "created_utc": 1702825467,
   "score": 201,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrf9ui",
   "message": "I was in an ER having an anxiety attack. Doc asked what happened, and I explained about my wife being arrested, held for 5 days, for needing medical help.  He suggested I \"get over it.\"",
   "created_utc": 1702826971,
   "score": 67,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kds2mcr",
   "message": "I was doing ketamine infusion for depression.  He came  in and said I handled it better than any patient he’s ever had.  Then he said he was going to use double the normal dose.  As he put the needle he said  “At this point I’m just experimenting on you.”\n\nAnd then things got intense.",
   "created_utc": 1702836055,
   "score": 65,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr76sy",
   "message": "I was getting an eye exam in my early 20s when the doctor said I have cataracts, but not to worry until I was like 60. 🙃",
   "created_utc": 1702823268,
   "score": 62,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrfk2u",
   "message": "I have chronic colorectal pain. Girlfriend and I are sitting in the room and the Dr. says \" you know your partner can massage it with her tongue or fingers whatever you kids like\". I've never had a more WTF on my face lol. The man was a quack but looked excited about it.",
   "created_utc": 1702827091,
   "score": 57,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdsavnh",
   "message": "In HS I came down with epidydimitis (fluid in my testes) and my Dr turned the lights off in the exam room, got out his pen flashlight, had me drop my pants and he shone the light through my scrotum.  As he was doing so he said “I’ll bet you’ve never had anyone do this before……or, maybe you have, I don’t know.”\n   I cracked up and by doing so it lowered my anxiety tons.  He was a great Dr.!",
   "created_utc": 1702838997,
   "score": 56,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrj4nw",
   "message": "I was getting the ole “turn your head and cough” he looked at my calves and said, “Wow! You have large calves, good for standing.” Um…ok.",
   "created_utc": 1702828582,
   "score": 198,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrfvvr",
   "message": "Yeah, it's probably a spider bite.  At least we know it's not from a poisonous one, because if it was you would be dead by now.",
   "created_utc": 1702827232,
   "score": 52,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrjs7x",
   "message": "\"You only have a severe pain in your testicle cause you think you do.\" Guy was a damn urologist and basically said its in my head. I've been to the ER cause of this \"imaginary\" pain.",
   "created_utc": 1702828849,
   "score": 54,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrozxy",
   "message": "I’m 43F now, but..\n\n24F me at the gyno trying to get sterilized because there’s no way I want to have kids ever and am sick of being on birth control: “I’d like to get my tubes tied”\n\nMale doctor (not that it matters because women doctors have said the same): “you’ll regret it in a few years”\n\nMe: “that will be my problem. Can we please move forward with sterilization because the birth control is messing me up and I don’t want to have kids ever”\n\nDoctor: “what happens when you meet a man one day and he wants you to have his kids..?”\n\nMe, dumbfounded that I don’t get a say in who knocks me up: “then we wouldn’t be together..”\n\nDoctor: “that would be foolish of you to not give a man the children HE WANTS YOU TO GIVE HIM”\n\nMe, nopes the fuck right on out of there. \n\nHere I am, 20yrs later, still not sterilized because every other doctor pulls this shit, and still not wanting kids (or had any)..",
   "created_utc": 1702830933,
   "score": 32,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr8746",
   "message": "“I love Fonzie.”",
   "created_utc": 1702823753,
   "score": 99,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrywgf",
   "message": "At a recent appointment, my new doctor told me, \"I don't know why people wore masks during COVID. They obviously don't work.\"\n\nThen, he recommended that I abstain from any future vaccinations or shots.  (To clarify, not just COVID vaccinations, but ANY vaccinations to include flu shots.)  He encouraged me to advise my wife to also abstain from getting shots, and told me I shouldn't have my kids vaccinated either.  He said that he doesn't vaccinate his kids as he would \"rather treat their illness if they get sick than take the chance on whatever is in the shots.\"\n\nI was like \"doc, you AND your wife are MDs, I don't have the luxury or ability to treat a potentially serious illness that could be easily prevented.\"\n\nKicker is this guy is a doctor at the Veterans Affairs Clinic, and I wonder how many Vets that were on the fence about masking and vaccines were swayed by his opinions are no longer alive.",
   "created_utc": 1702834661,
   "score": 133,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr3n3e",
   "message": "“Are you a fucking idiot?”",
   "created_utc": 1702821458,
   "score": 83,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrjot0",
   "message": "I had pinch my sciatic nerve pushing carts at work. Dude went on about how it’s common during kinky sex and I shouldn’t be ashamed of it. I didn’t need to lie to him. Bro I hurt it pushing carts. \n\nGave me OxyContin and told me if I needed more to just hit him up. Awful experience",
   "created_utc": 1702828811,
   "score": 88,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdr51ch",
   "message": "“Do you play with any other men besides your husband?” With a smirk",
   "created_utc": 1702822187,
   "score": 117,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrrtux",
   "message": "During the genital exam for one of my high school physical exams, the doctor asked my mom who was sitting in during the exam, “why haven’t you had him circumcised? It’s cleaner.” My mom thankfully took my side and said “it looks clean to me.” I didn’t really think much of it then, but now I’m thinking how weird it was for the doctor to complain about my mom’s decision.\n\nEdit: just remembered another one more recently. I was a model for a physical therapy workshop, and the therapists broke out into small groups of 4. I was surrounded by 4 women, and when I had to remove my drape, they all just stopped talking before one of them asked me “do you bike?”. I said no, and thought it was such a random question before another women chimed in and said your thighs are huge.",
   "created_utc": 1702832024,
   "score": 123,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrrmho",
   "message": "When I was like 19-20 I pulled my groin playing football. I could hardly walk. Went to ER, and the Dr, who barely looked older than me, said he thought it was a good idea to do a prostate exam. I told him, I saw no need, since I knew how I got injured. We argued, for a few mins, before I asked for another Dr. Even the next guy was like \"Huh?\" \"What's he wanna do that for?\" I'm like I don't know, I'm just here to get a note for work to get light duty. Needless to say, I really feel I barely avoided  being violated unnecessarily.",
   "created_utc": 1702831949,
   "score": 41,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrtg5y",
   "message": "After getting my tubes tied. “We removed the IUD while you were in surgery “. \n7 years later after going in for X-rays and curious about what my body looks like inside…. there it was, the IUD she said she removed.",
   "created_utc": 1702832634,
   "score": 33,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdtn0mk",
   "message": "Right after I gave birth, my husband and I were chatting with my OB as she patched me up. She mentioned that her husband was a dentist and said \"yeah, between the two of us we've got all the holes covered.\" Hilarious.",
   "created_utc": 1702857137,
   "score": 31,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kdrmvv3",
   "message": "Nurse after having a baby: you have Japanese looking nipples! \n\nHuh?",
   "created_utc": 1702830096,
   "score": 71,
   "submission_id": "18kgwlh"
  },
  {
   "comment_id": "kds9wmo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18kgwlh"
  }
 ]
}