{
 "submission_id": "18kh8xb",
 "title": "What claims are just not backed by the historical facts?",
 "selftext": "",
 "created_utc": 1702819350,
 "permalink": "/r/AskReddit/comments/18kh8xb/what_claims_are_just_not_backed_by_the_historical/",
 "score": 195,
 "url": "https://www.reddit.com/r/AskReddit/comments/18kh8xb/what_claims_are_just_not_backed_by_the_historical/",
 "comments": [
  {
   "comment_id": "kdqzuml",
   "message": "The pyramids being built by aliens",
   "created_utc": 1702819401,
   "score": 1,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr03cs",
   "message": "Jesus did not think he was the son of his god; he thought was going to be the king of the Messianic Kingdom which is the law he broke that got him killed.  The son of god thing is a later church idea that only gains traction in Christian scripture the further away from his death that they are written.",
   "created_utc": 1702819539,
   "score": 1,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr08mi",
   "message": "That ancient humans were dumb",
   "created_utc": 1702819621,
   "score": 132,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr0t5a",
   "message": "That there was massive fraud in the 2020 election. When you lose 60 times in a row in federal court and fail to produce any evidence, it's time to hang it up.",
   "created_utc": 1702819942,
   "score": 1,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdqzyhf",
   "message": "The earth has only exists for a few thousand years.",
   "created_utc": 1702819462,
   "score": 1,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdqzyyh",
   "message": "Pilgrims \"breaking bread\" with Native Americans",
   "created_utc": 1702819469,
   "score": 1,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr0tal",
   "message": "Edison invented the lightbulb",
   "created_utc": 1702819944,
   "score": 11,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr12jk",
   "message": "That ancient people thought the Earth was flat.\n\nWe have records from around 430BC where Greek philosophers spoke of the Earth being a sphere. In 240BC the Greek astronomer Eratosthenes calculated the circumference of the Earth and was only about 2% out.",
   "created_utc": 1702820086,
   "score": 196,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdravtb",
   "message": "I'm sick of curriculum materials teaching my fourth graders that the Spanish discovered Florida when they were looking for the Fountain of Youth. That lie was developed in the 1920s as a tourist gimmick. There's literally nothing in the historical record that supports it.",
   "created_utc": 1702825004,
   "score": 196,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr52os",
   "message": "There has never been a viking helmet found that had a horn attached to it.",
   "created_utc": 1702822206,
   "score": 71,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr5350",
   "message": "Marilyn Monroe never said \"...if you can't handle me at my worst, you don't deserve me at my best\"\n\nThere is literally no documented proof she ever said that.",
   "created_utc": 1702822212,
   "score": 33,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr4602",
   "message": "That binary numbers were first used by Leibniz. Most computer histories make this claim.\n\nBut there's an existing [manuscript page](https://i.imgur.com/bKw3LOc.jpeg) by the English mathematician Thomas Harriot that includes binary numbers and binary multiplication that was written around 1605, forty years before Leibniz was born.\n\nEdit: spelling",
   "created_utc": 1702821733,
   "score": 246,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdragw2",
   "message": "Corsets were not typically tight laced. They were only tight laced by the highly fashionable women, and usually only for particular events or portraits. Corsets were designed to be comfortable. Women wore a cotton layer underneath the corset, so it didn't rub against the skin. The corset was more like a bra, bit instead of using the shoulders to support it used the whole torso. Some people claim they are much more comfortable than modern bras. The intense proportions of the past were achieved with Corsets AND padding. Tight lacing was uncommon, but layers of petticoats or hoops or bum rolls or whatever else at the time was very common to give women the trendy body shape at the time.",
   "created_utc": 1702824815,
   "score": 64,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrhn2d",
   "message": "The White Star Line saying the Titanic was unsinkable. It was actually a shipping magazine that first called the Olympic class unsinkable. \n\nIn a similar note the RMS Britannic being called Gigantic. The name only Gigantic only appears once on an order for an anchor. Every other piece of documentation refers to the Britannic as the Britannic.",
   "created_utc": 1702827966,
   "score": 228,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr9u6l",
   "message": "[removed]",
   "created_utc": 1702824529,
   "score": 224,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrg75f",
   "message": "Einstein being a low-level student (his grades were average to top tier of the class, and he was pretty damn good academically)",
   "created_utc": 1702827362,
   "score": 238,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr4mv8",
   "message": "[deleted]",
   "created_utc": 1702821980,
   "score": 125,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrvbq4",
   "message": "Executioners/hangman didn't wear hoods. People knew who they were. There are even several instances where the job gets passed from father to son like a family business.\nThey were paid okay but also made side money from selling stuff used for the execution like bits of rope and fabric and stuff.\n\nEdit: There's a book called Lord High Executioner by Howard Engel that goes into the history of it and it's fascinating.",
   "created_utc": 1702833335,
   "score": 235,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdre58n",
   "message": "Vomitoria were passages designed to accommodate large crowds, not rooms for actual vomiting (“vomit” comes from Latin for “spew forth”).",
   "created_utc": 1702826482,
   "score": 0,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr2cvb",
   "message": "[deleted]",
   "created_utc": 1702820782,
   "score": 15,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr5w2e",
   "message": "The idea that medieval/early modern people (especially peasants) were filthy/had poor hygiene and never left their villages. Medieval people cleaned themselves and their clothes fairly regularly. They even cleaned their teeth by chewing split twigs. Also, it was fairly common even for peasants to travel to pilgrimage sites on holy days/periods.",
   "created_utc": 1702822624,
   "score": 164,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr4lgp",
   "message": "Well, for starters, the claim that Napoleon was short is just not backed by historical facts. The guy was average height for his time. It's like saying your 5'8\" friend is a giant because he hangs out with a bunch of kindergartners.",
   "created_utc": 1702821960,
   "score": 253,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrfbaw",
   "message": "Catherine the Great did not do that with a horse.",
   "created_utc": 1702826988,
   "score": 155,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr3xt1",
   "message": "Abner Doubleday inventing baseball in Cooperstown, NY.",
   "created_utc": 1702821613,
   "score": 139,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kds5qwr",
   "message": "No so much a single historical fact, but people tend to fall for fallacies of nature, and imply that we should go back to the way we did things “naturally”\n\nBut often times, this idea is extremely historically inaccurate.  Many times, the way we did things “naturally” resulted in a lot of, you know. Death.\n\nFor example, “giving birth naturally.”   Some people seem to think that before modern obstetrics, that we were all just a bunch of natural goddesses giving birth in the forest.  But the reality was a lot more grotesque than that.  If everyone gave birth the way we did in 1900, we would be seeing a lot more childbirth related death.  We would also see a lot more women dealing with fistulas, and being ostracized \n\nSame with vaccines.  Letting “nature” take its course, killed us, sometimes at alarming rates (like with smallpox).  Oh sure, they had natural immunity to a lot of things, just like we develop natural immunity to a lot of things - except some immunities are a lot safer to get naturally.  You don’t just develop natural immunity to polio, you have to get polio and suffer the permanent *natural* consequences.  But people have this idea that everyone used to walk around with better immune systems and they would drink elderberry",
   "created_utc": 1702837204,
   "score": 184,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr5can",
   "message": "Never did Marie Antoinette say, \"Let them eat cake\" To be honest, history has demonized that poor child. She was married to a moron, she was in a foreign country, and she had no idea what she was doing.",
   "created_utc": 1702822342,
   "score": 34,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr72to",
   "message": "That the Pyramids were built by Jewish slaves. The Egyptians were good at record keeping and none of their records say anything about slaves being used for the construction of the Pyramids.",
   "created_utc": 1702823214,
   "score": 199,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrg9k8",
   "message": "Young Earth Creationism is NOT the historically believed position of the Early Christian Church or the Ancient Church. It's a fairly recent theological position initially proported by 7th Day Adventist, but quickly became popular with Fundamentalists due to backlash over evolution becoming mainstream.\n\nBefore that, most people saw the Creation narrative in Genesis as a narrative myth and was not meant to be read as scientific fact.",
   "created_utc": 1702827391,
   "score": 34,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kds5cyp",
   "message": "That MSG is bad for you. When I was a kid back in the early 90s, I remember that was a big thing my parents and friends' parents would talk about.",
   "created_utc": 1702837061,
   "score": 69,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr5q0w",
   "message": "[deleted]",
   "created_utc": 1702822539,
   "score": 55,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrce8y",
   "message": "General Omar Bradley was stopped by MP during the Battle of the Bulge in WW2 due to them thinking he was a Nazi infiltrator. The irony was that he was stopped because he correctly identified the capital of Illinois as Springfield when the officer thought it was Chicago.",
   "created_utc": 1702825703,
   "score": 15,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrzbee",
   "message": "The claim Mormons make that the Book of Mormon is a historical record of a group of ancient white Hebrew people who lived on the pre-Colombian American continent and were cursed with brown skin for disobeying God and those are the people who became the Native Americans. Yeah right…",
   "created_utc": 1702834819,
   "score": 104,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdriauo",
   "message": "That every women in the Middle ages  married at 12 or 13 and started having babies immediately. And they did not love  and mourn  their children as much as we do. \n\nThat people in the Middle ages thought the earth was flat",
   "created_utc": 1702828241,
   "score": 200,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrrrzs",
   "message": "The \"Protocols of the Elders of Zion\" is a fraudulent document claiming to outline a Jewish conspiracy for world domination. Published in the early 20th century in Russia, it has been thoroughly discredited as a forgery. Investigations, including one by The Times in 1921, confirmed its falseness. The document is widely condemned as antisemitic propaganda, lacking any historical or factual basis.",
   "created_utc": 1702832004,
   "score": 25,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrguqo",
   "message": "Witch burning were daily occurances in the middle age, I blame da Vinci code",
   "created_utc": 1702827635,
   "score": 76,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdrb0pg",
   "message": "“The holocaust never happened.” I am baffled how people can believe this.",
   "created_utc": 1702825068,
   "score": 9,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr2wc9",
   "message": "The people in Medieval times would empty pots of shit and piss right out their window. If you stop and think about it for like two seconds this idea is so fucking bizarre that it is surprising it became such a popular myth. I remember clearly being told this as fact by my 4th grade history teacher.",
   "created_utc": 1702821067,
   "score": 94,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kds49b3",
   "message": "The Armenian Genocide \\*did\\* happen, no matter how much the Turks desperately claim that it absolutely did not, the Kurds were responsible, and the Armenians deserved it anyway.\n\n\u0026amp;#x200B;\n\nI wish I had something funny to go along with this. I don't.",
   "created_utc": 1702836661,
   "score": 112,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kds79ye",
   "message": "I heard recently that the reason Columbus had trouble finding funding for his voyages had nothing to do with the powers that be believing the earth was flat.  In fact, it was pretty well accepted by that point that it was spherical.  However, they believed it was much bigger than Columbus believed it was and that there would be nothing but ocean for thousands of miles.  They thought the journey would cost much more than he was trying to say.  He was wrong, and the fact that he ran into the Americas was just luck for him.",
   "created_utc": 1702837729,
   "score": 23,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdr6947",
   "message": "Calling the American Civil War \"the war of Northern Aggression\"\n\nBitch you literally shot first.\n\nEdit: \"I'm from the south and I've never heard this\" the fuck you haven't!",
   "created_utc": 1702822805,
   "score": 37,
   "submission_id": "18kh8xb"
  },
  {
   "comment_id": "kdsbqdm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18kh8xb"
  }
 ]
}