{
 "submission_id": "18kpshh",
 "title": "What does getting a car at MSRP mean?",
 "selftext": "",
 "created_utc": 1702843308,
 "permalink": "/r/AskReddit/comments/18kpshh/what_does_getting_a_car_at_msrp_mean/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/18kpshh/what_does_getting_a_car_at_msrp_mean/",
 "comments": [
  {
   "comment_id": "kdsn3s2",
   "message": "manufacturer's suggested retail price, in other words the \"official\" price\n\nA manufacturer may suggest to sell it for like 50k, whereas you can find dealerships selling it for less or more",
   "created_utc": 1702843431,
   "score": 5,
   "submission_id": "18kpshh"
  },
  {
   "comment_id": "kdsu2h5",
   "message": "Uh, it means you payin' the full price for that car. Like duh.",
   "created_utc": 1702845964,
   "score": 1,
   "submission_id": "18kpshh"
  },
  {
   "comment_id": "kdsmyy3",
   "message": "From google:\n\nMSRP is what automakers think consumers “should” pay to purchase a car from a dealership. The invoice price is what the dealer pays to buy the car from the automaker. If you manage to buy a car for its invoice price, you're buying it for essentially the same amount that the dealer paid",
   "created_utc": 1702843382,
   "score": 2,
   "submission_id": "18kpshh"
  },
  {
   "comment_id": "kdsvazv",
   "message": "Sticker price; the price on the large printout on the back window. However, the dealer can replace those stickers and change the price on you, so shop after getting a printout from a bank or auto broker before going shopping, so you know what the car should cost. Then, offer perhaps 5 to 10 % less and haggle with the dealer from there. However; popular cars or special editions will often command not only MSRP, but any additional fee the dealership can get out of you; it's not unusual for a special edition to command as much as 50% more than the sticker price. Special, limited editions can really cost a LOT more than sticker prices, if you can even find one for sale.",
   "created_utc": 1702846408,
   "score": 1,
   "submission_id": "18kpshh"
  },
  {
   "comment_id": "kdswhh1",
   "message": "It means Missing Sense of Real Pricing.",
   "created_utc": 1702846844,
   "score": 1,
   "submission_id": "18kpshh"
  },
  {
   "comment_id": "kdszt1d",
   "message": "Maximum Stupid Retail Penis.",
   "created_utc": 1702848076,
   "score": 1,
   "submission_id": "18kpshh"
  }
 ]
}