{
 "submission_id": "18kqf2r",
 "title": "Think back to your first kiss - how old were you then and how old are you now - what happened - do you still talk to this person?",
 "selftext": "",
 "created_utc": 1702844926,
 "permalink": "/r/AskReddit/comments/18kqf2r/think_back_to_your_first_kiss_how_old_were_you/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/18kqf2r/think_back_to_your_first_kiss_how_old_were_you/",
 "comments": [
  {
   "comment_id": "kdssnkc",
   "message": "I was 13 (21 now), and I was in a pediatric oncology ward. Me and this boy were both there for cancer treatment, for a similar type of cancer. We had met a bunch of times and both really liked each other in that awkward 13 year old way. He had gotten a very pessimistic updated prognosis and was understandably very upset. He mentioned that he'd never kissed a girl, so I kissed him. The next time he saw me he gave me a rose and asked me if I wanted to go on a date with him once we both started feeling a little better, and I said yes. We never got to go on the date, he died shortly after of a seizure related to his tumor.",
   "created_utc": 1702845451,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsrnk3",
   "message": "My first kiss was at age 16 with a British girl in a disco in an Austrian skiing resort. Never saw that girl again.",
   "created_utc": 1702845093,
   "score": 2,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsrtz9",
   "message": "It was a red color hair boy, he had a girfriend 🫣 i was 12.. then he left her for me but i didnt like him that way… i dont talk to that person anymore.",
   "created_utc": 1702845156,
   "score": 2,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdssudd",
   "message": "I’m 31, I’ve never kissed anyone intimately, I don’t think I even know how.",
   "created_utc": 1702845518,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdst5t3",
   "message": "It was a French girl I met on a school trip to France when I was 13. That was 23 years ago and I never saw her again.",
   "created_utc": 1702845632,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdst8kd",
   "message": "yup, 55 yrs ago, 13 yrs old, basically a quick mash. Was fb friends, then he evaporated, turns out he was busted for SA of a minor. WTF happens to people?",
   "created_utc": 1702845660,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdstijv",
   "message": "I was 14, happened on New Year’s Eve with the girl I was dating at the time. I’m 29 now. And no we haven’t talked in like 11/12 years",
   "created_utc": 1702845762,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsu093",
   "message": "Sister *\"sweet home alabama\" is playing",
   "created_utc": 1702845942,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsuss4",
   "message": "You wanna know the odd truth. I'm almost 30 and I've never kissed. I've fucked, but I haven't kissed. Ain't that some fucking shit.",
   "created_utc": 1702846226,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsrho3",
   "message": "I was 13 at a seventh grade birthday party. 28 years ago. \n\nI don't talk to her, but she is still a Facebook friend.",
   "created_utc": 1702845034,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdss1ja",
   "message": "I honestly don't remember, sometime before I was 10 (which I only know because it was when I was in my first primary school, which I moved away from when I was 10) and I'm 30 now. I remember the girl though, her name was Samantha. No, I'm not still in contact with her, I'm only actually still in (intermittent) contact with one person from that school.",
   "created_utc": 1702845234,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdss27o",
   "message": "too old, 4 years ago. she betrayed me and i've never talked to her again (also ghosted, so even if i wanted i cannot).",
   "created_utc": 1702845241,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsu2zh",
   "message": "I was 16 and in computer class, I'm 30 now and we don't talk anymore, last I saw him he was in BAD shape, drugs and alcohol seemed to ruin his life, it's sad really",
   "created_utc": 1702845970,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsu9ay",
   "message": "I was 16. It was in a movie theatre where we went to watch ‘John Carter’. I sucked at it.\n\nShe’s apparently asexual now.",
   "created_utc": 1702846032,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsuevw",
   "message": "Funny story actually. \n\nI was 13, guy was 14 and it was near my house on a snowy day. He was quite good actually.\n\nThe most recent contact i had from him was about maybe 6 months ago, he sent me a picture of him in an assassins creed cosplay. \n\nexchange goes as such: \n\nME: “mate what the fuck is that”\n\nhim: “that hurts coming off the birth child of Metallica and my chemical romance, go back to fakin simps”\n\ntbh he had a point.",
   "created_utc": 1702846089,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsuo7j",
   "message": "Am 25, my first kiss was with an escort in 2019. My first kiss with someone who was not an escort was in the fall of 2021. She was a colleauge that i thought was a friend as well, but turned out we were just work friends, so i havent talked to her much after i quit",
   "created_utc": 1702846180,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsvgwh",
   "message": "I was 16. Happened on the night of my marriage. He passed away earlier this year",
   "created_utc": 1702846468,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdswdx6",
   "message": "I was 20, and it was with my boss who was 33 at the time while he gave me a ride home one day. I was younger compared to him, I know, but I had a little crush on him. Definitely felt a little pressured into it because I was so nervous but it wasn’t bad and he was kind. I was working in the US for a few months when this happened and left but eventually went back for the same work the following year and we reconnected. Had a little bit of a relationship but I broke it off early on. We still message to this day.",
   "created_utc": 1702846808,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsx91w",
   "message": "I was 15-16. Girl I met at a house party, and no I don't still talk to her. Haven't seen her since that night.",
   "created_utc": 1702847127,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsyno0",
   "message": "It's weird, everything kind of happened all at once for me. one day I'd never even held hands with a girl, the next id had my first kiss, lost my virginity, a long with most other sexual acts. I was eighteen.",
   "created_utc": 1702847649,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdsztzy",
   "message": "It was in kindergarten and he told me I had to kiss him or he would make something up to tell on me for and get me in trouble. I was 5, so I kissed him. I don't still talk to him.",
   "created_utc": 1702848086,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdt0w0s",
   "message": "bro, i cant even remember my first kiss. it was back when dinosaurs still roamed the earth and i was like 5 years old or somethin. all i know is it happened on the playground during recess and now im ancient af but idk what that person is up to these days, probably married with a gaggle of kids by now hahaha",
   "created_utc": 1702848475,
   "score": 1,
   "submission_id": "18kqf2r"
  },
  {
   "comment_id": "kdt140n",
   "message": "I was 15, I'm 25 now, I watched a movie with a girl for the first time and worked up the courage to kiss her, and no.",
   "created_utc": 1702848557,
   "score": 1,
   "submission_id": "18kqf2r"
  }
 ]
}