{
 "submission_id": "18kzeni",
 "title": "Single people, what is like being in the dating scene now a days?",
 "selftext": "",
 "created_utc": 1702871184,
 "permalink": "/r/AskReddit/comments/18kzeni/single_people_what_is_like_being_in_the_dating/",
 "score": 162,
 "url": "https://www.reddit.com/r/AskReddit/comments/18kzeni/single_people_what_is_like_being_in_the_dating/",
 "comments": [
  {
   "comment_id": "kduqeqd",
   "message": "People are flaky as fuck. They aren't trying or putting effort in. Not willing to have honest conversations.",
   "created_utc": 1702874910,
   "score": 185,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdukq4g",
   "message": "I stay on the sidelines and wait for a miracle...I'll probably be single until I die...",
   "created_utc": 1702872052,
   "score": 141,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdupe4n",
   "message": "Everyone is always looking for something better, no one seems to be able to hold a conversation, and my God it's nearly impossible to get someone to meet you in person.",
   "created_utc": 1702874363,
   "score": 194,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduot74",
   "message": "It's like a waste land of wannabe influencers. I just want a nice person who I enjoy spending time with doing the simple things. Then if things go well we can do more \"exciting and expensive\" things.",
   "created_utc": 1702874063,
   "score": 94,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdus23u",
   "message": "Absolutely horrible. It’s almost impossible to get more than two dates anymore. All my peers, men and women agree.",
   "created_utc": 1702875813,
   "score": 202,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv6jvk",
   "message": "Dude, this is making me so fucking depressed",
   "created_utc": 1702885462,
   "score": 200,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdurwdk",
   "message": "Over the years, I’ve noticed that superficiality is becoming more of the norm. And I’ve also noticed that people tend to be more uptight and scared to open up and be themselves. A little as 10 years ago it wasn’t like that at all, at least in my experience when I dated then compared to the present times. I’m trying to settle down but it’s getting harder to find someone and build a connection with.",
   "created_utc": 1702875724,
   "score": 102,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdup2fy",
   "message": "It's awful, not fun at all. Online dating makes the whole thing feel like the job application process. \n\n\nI dunno what college is like now, but I miss going to new classes or moving into new dorm rooms and being surrounded by new classmates and new neighbors. Or on weekends when everyone was trying to have a good time. It was so much easier to meet people of a similar age on a regular basis. Doing the whole dance of getting to know someone was also fun, like trying to figure out who to talk to at a party that was close enough with a girl to introduce me rather than have to awkwardly approach her myself, or finally getting someone's number so you could take the conversation beyond class and text back and forth into the wee hours of the night.\n\n\nNow though? It reminds of me filling out my resume but being asked to upload it anyway only to never get an interview or do an interview that results in nothing because they just did it as a formality to make it look like they were trying to find someone rather than just give the job to the boss's nephew. \n\n\nAnd meeting people in person is a massive effort that rarely amounts to anything. They say you should join clubs or go to classes, any setting where you're gonna be social and going on a regular basis. Yeah, go do that. But don't be surprised when it's all dudes with the same idea or older married couples trying to find something to do with their new empty nest. \n\n\nJust seems like the odds aren't in your favor as soon as you graduate college.",
   "created_utc": 1702874195,
   "score": 100,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduyurw",
   "message": "Someone pissed in the dating pool",
   "created_utc": 1702879954,
   "score": 141,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdupko5",
   "message": "Something I saw on Reddit that I laughed and agreed with was that online dating for women is like trying to find fresh water in a swamp, and for men it's like trying to find fresh water in a desert.",
   "created_utc": 1702874460,
   "score": 194,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduj2n2",
   "message": "You either catch a great white shark or you get eaten by one",
   "created_utc": 1702871273,
   "score": 245,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdujgvw",
   "message": "It feels like I’ll never get married.",
   "created_utc": 1702871456,
   "score": 213,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdusrjb",
   "message": "It sucks. The closest thing I even had to a boyfriend, was almost 6 months ago, and I was dumped by him, and the dude was hiding a whole ass wife, the whole two years we were together. I see my friends jump into relationships without being healed first, and they are so bossy and aggressive and insecure, yet they’re able to get past the talking stage and I seem to not. And whenever I show interest in a guy who is interested first, they seem to fall off the face of the earth; I’m not a clingy person, but what the fuck? It’s ghetto here.",
   "created_utc": 1702876216,
   "score": 240,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv21af",
   "message": "It's pretty bad honestly.\n\n* Online dating convenience has flooded the dating pool with competition, socially inept or borderline undateable people. This means more horrible conversations, more issues with safety/rejection/abuse, more bad dates etc. The people who weren't able to enter the dating market previously now have a way to via dating apps.\n* Ghosting has become the norm as a result of the above.\n* On the flipside if you manage to get into a relationship, people are more likely than ever to call it quits at the first minor inconvenience. Lots of things are \"red flags\" when in reality it's a pretty easy thing to compromise or ask the person to figure out with you. It's like nobody's willing to put in any work and they stopped believing in compromise. I get that our parents and grandparents had to deal with a lot of shit and some may have stayed together way past their time, but we've swung in the complete opposite direction.\n* This extends outside dating, but social media and the internet has conditioned people to constantly seek new stimulation which leads to people not wanting to \"settle down\" or at least having super high standards in order to. I'd argue social media has also skewed our standards on physical beauty. Sure we've had supermodels and celebrities for ages, but I think the notion that these weren't ordinary people was far more ingrained than now where influencers are a dime a dozen so everyone has deluded themselves to think that beauty standard is super common and therefore they're entitled to date someone who looks like that.\n\nAll this means that more than ever dating is a numbers game and people get burned out emotionally, mentally and sometimes literally physically/financially as they try and navigate the numbers.",
   "created_utc": 1702882139,
   "score": 207,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduj78z",
   "message": "A nightmare. People seem so disconnected and unenthusiastic that its frankly disheartening. \n\nNot to mention the people showing up looking nothing like their pictures, or having some insane sob story about why their life is so hard.",
   "created_utc": 1702871333,
   "score": 92,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdur7oh",
   "message": "Months and months of online dating where you're spending money, going on first dates, trying your best, and nothing is happening. Then you start to consider maybe it's you or you have so much dating fatigue that you need a break. But then you meet someone and hit it off super quickly right before you delete the app or take a break from dating.\n\nBut things are moving so quickly that it's suspicious so you fuck it up or get ghosted or they fuck it up.",
   "created_utc": 1702875342,
   "score": 17,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduo92l",
   "message": "I’m not single anymore, but when I was I used to say it was like looking for a piece of hay in a needle stack. Lots of pricks.",
   "created_utc": 1702873779,
   "score": 130,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdusrmd",
   "message": "Dating is the worst part of being single, which makes finding a partner that much harder. Its a terrible time to be dating 😃",
   "created_utc": 1702876217,
   "score": 80,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduurwo",
   "message": "As a heterosexual single guy in their early 30s, dating apps feel like applying for a job instead of looking for someone compatible. It's weird.",
   "created_utc": 1702877392,
   "score": 210,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdutypv",
   "message": "It’s like an underwhelming treasure hunt in a dumpster.",
   "created_utc": 1702876905,
   "score": 138,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduov4o",
   "message": "It’s really hard to trust people in monogamous relationships today, that’s the big thing in my opinion. Everyone’s in three different talking phases at any given moment",
   "created_utc": 1702874091,
   "score": 25,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduoy5t",
   "message": "lol I don’t even bother. Not worth it. Can’t trust anyone",
   "created_utc": 1702874133,
   "score": 162,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdutncq",
   "message": "It’s fucking complete trash. And it’s because people are trash. And people probably think I’m trash. It’s just a big ol’ circle of trash!",
   "created_utc": 1702876723,
   "score": 207,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv5xvo",
   "message": "It's like a herd of elephants stomping on your confidence.",
   "created_utc": 1702884998,
   "score": 56,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduma3m",
   "message": "Like being at the bottom of the Mariana Trench",
   "created_utc": 1702872808,
   "score": 173,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdup0ub",
   "message": "Terrible, I've basically given up. Forever alone club, lol...",
   "created_utc": 1702874172,
   "score": 206,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdujse1",
   "message": "To be honest, it’s quite boring 🤷🏾‍♂️ it’s become like fast moving fashion where what’s “trending” is more important than who you’re with🤦🏾‍♂️💁🏾‍♂️",
   "created_utc": 1702871604,
   "score": 11,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvdd5m",
   "message": "I’ve been single for like a year now. I gotta say.. it’s working out. Like I think I’m the one ❤️",
   "created_utc": 1702890863,
   "score": 128,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduphzr",
   "message": "I went on like 60 first dates in the last 2 years. I’m a really fit guy that takes good pics so getting matches and dates is easy for me but man, I am so burned out. \n\nWhen I schedule a date I’m not excited for it at all. I’ve had the same convos over and over again. And I just can’t get myself to care or pretend to care. I’m gonna take a long break.",
   "created_utc": 1702874421,
   "score": 149,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdurcc9",
   "message": "Recently divorced, but it's a cesspool and I feel like not having a degree limits my options. Women are just as picky now as they were when I was 20  but now everyone has more baggage including me.",
   "created_utc": 1702875414,
   "score": 147,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdured5",
   "message": "I’m a 38 year old woman. I’ll probably just stay single. I tried online dating a couple years ago and it was too intense. So many dick pics and weird sexual messages. \n\nI just want to know someone before I date them. I get asked out occasionally and I think I’ll go for that. Can’t hurt to have a coffee with someone to see if there’s chemistry. But no more online dating!\n\nOnline dating makes it seem like there is this weird pool of angry penises swimming around you at all times. It’s unsettling. I like to connect with real people instead.",
   "created_utc": 1702875445,
   "score": 227,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdujffk",
   "message": "many of us, including myself, aren't even in the dating scene to begin with",
   "created_utc": 1702871436,
   "score": 220,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduz23k",
   "message": "I won’t be dating in 2024. I am prioritizing therapy, mindfulness and chasing the bag + my dreams. That’s what it’s been like.",
   "created_utc": 1702880094,
   "score": 100,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv2cww",
   "message": "Went to a couple of events to meet people because I cant stand online interactions, it feels just shitty not talking to a person face to face.\n\nKept a level headed approach, lowered my standards a bit. Matched with 3 people, 1 ghosted me right away, another one ghosted me after going for drinks and the third one, we went out three times and then she confessed she actually has a family... I thought I could let it go but I just felt too betrayed and angry with her. I am probably being immature about this.\n\nSince I am not a big advocate of putting up a facade to fake something you are not there is a limit to how much I will improve my looks to attract someone, also the fun part should be people wanting to spend time with you for your personality... so I guess may be I am just not good date material? it sounds harsh but not everyone is meant to find a couple, its less painful the sooner you come to terms with that :)\n\n I am starting to consider just using a japanese approach, dissect a relationship and buy it for parts. Hanging out more with friends, getting a pet to love and finding a local escort to provide with some intimacy services on semi regular basis so I can cuddle and feel warmth of someone from time to time.   \n\n\nWelcome to the dystopian future.",
   "created_utc": 1702882362,
   "score": 55,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdut1p0",
   "message": "It is a fucking dumpster fire",
   "created_utc": 1702876377,
   "score": 27,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduuxbe",
   "message": "Not in hometown = cool and fun\nBack home = sad as hell",
   "created_utc": 1702877483,
   "score": 27,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv6thb",
   "message": "I hate it. Everyone expects me to eat ass and spend money and and go out and do things and the worst part is how commodities and capitalized dating is. You don't meet organically anymore, you meet on a dating app, that you have to pay for, that is overloaded and hyper populated with scammers and bot accounts and I mean, wasn't that soda thing and all those regulations supposed to make the internet better?",
   "created_utc": 1702885666,
   "score": 27,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvsarw",
   "message": "Everyone's hobby is: I go home, watch videos of some sort, smoke weed/vape, and sleep.\n\nNot to mention the number of people who know they have some sort of mental health issue but just refuse to get help or even start the process. But don't worry, they are 'working on it', then their issues come up a couple months into dating, and they wonder why relationships don't work for them.\n\nI know everyone has their baggage but my god the laziness is unparalleled.",
   "created_utc": 1702901951,
   "score": 29,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdur7wc",
   "message": "Full of desperate people with no standards. People who don’t even ask for dates, they want you to come over, or worse, invite themselves over",
   "created_utc": 1702875346,
   "score": 130,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduq46z",
   "message": "It sucks.\n\nI've tried traditional means, dating apps, dating websites, and even attempted at an office fling.\n\nNothing. It feels like it is impossible to find any partners in this day and age.",
   "created_utc": 1702874750,
   "score": 49,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdux6ln",
   "message": "Not a lot of fun, I guess it depends what you are looking for though, if you can stand hookup culture and have reasonable to low standards it's probably fine.\n\nIt feels like the only way to date is with apps and if you're average, you're either matching with no one or 2/10s which is disheartening \u0026amp; makes you feel utterly worthless.\n\nThe divide between men's experience dating and women's experience dating (online or not) is so incredibly vast it's almost impossible for the other to comprehend. \n\nAn average women experiences harassment and filthbags online, they are inundated by so many options and have to wade through the garbage.\n\nAn average man will get little to no attention and must do everything to stand out; you are met with little to no conversational effort, you must make all the moves and be engaging, confident and chivalrous.\n\nApproaching someone in public that you do not know is terrifying, even if that might be the solution, a lot of my generation (millennials) and the one following it have very poor social skills and a huge aversion to rejection. In huge part to our video game / internet addictions. \n\nAnother factor I think is people want to aim high, maybe higher then they can reasonably achieve.\n\nIf I struggle to meet new people or socialise with someone I find attractive and hardly socialise with people I don't find attractive where does that leave me? Single forever lol.\n\nI think social anxiety is a huge contributor to the \"loneliness epidemic\" and to me the solution isn't so clear.\n\nUnfortunately it's easier to just check out.",
   "created_utc": 1702878877,
   "score": 64,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdulpcv",
   "message": "IMO - Bad if you just rely on online dating.",
   "created_utc": 1702872521,
   "score": 134,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdusuw4",
   "message": "As someone with below average looks and a not very engaging personality; it's a fucking nightmare. As a man, online dating is basically useless if you're not an 8/10, I tried speed dating but that's just speed-getting-rejected for me. I still do singles events, because that's mostly because I quite like the events themselves rather than the hope of actually meeting anyone.",
   "created_utc": 1702876269,
   "score": 78,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdurg2a",
   "message": "What dating scene?",
   "created_utc": 1702875471,
   "score": 45,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduql89",
   "message": "Everyone tells me I should end my 10 year relationship because I deserve better but then I read threads like this and realize my options are stay with who I’m already with as long as possible, or just start being alone forever now. It’s terrifying.",
   "created_utc": 1702875007,
   "score": 153,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvaa2e",
   "message": "I’m a woman. I am trying so hard to meet people irl but I just don’t know how. I’ve taken an initiative to join more activities AKA I joined an astronomy club and I’m going to start volunteering at the animal shelter. But my god no one wants to talk to each other irl. No one does stuff alone and no one is interested in meeting strangers. It’s hard to make new friends let alone find a partner.",
   "created_utc": 1702888351,
   "score": 19,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvcf4d",
   "message": "I tell dating stories to married friends so they stay with their spouse.",
   "created_utc": 1702890093,
   "score": 24,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdupby7",
   "message": "It depends on what you want.\n\nIt has never been easier to get laid; it has never been harder to have a meaningful relationship",
   "created_utc": 1702874332,
   "score": 250,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv3q9j",
   "message": "0/10. do not recommend.",
   "created_utc": 1702883355,
   "score": 18,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdw1fwi",
   "message": "I’m a guy. Latino but American born. Women seem extremely jaded majority of the time. Like extremely. I’m paying for every other guys sin straight out the gate and in many cases it isn’t even things they experienced first hand lol, someone online or a friend will experience something at the hands of some random guy and all of a sudden i’m being crucified for it. Alot of my matches have zero personality \u0026amp; sense of self. All they do is parrot twitter/podcast talking points. All they know is “fine dining and traveling” which really is mid tier poor choice splurging on food and being a tourist at another countries beach and not really absorbing local culture (not debatable, going to another country just to buy overpriced liquor, sit at a resort and do the typical run of the mill things does not make you well traveled or well cultured)\n\n Alot of women my age also seem to bank on whirlwind romance and jumping into bed. They don’t seem to have a grasp on what actually creates a genuine connection and what is required to have a successful relationship \u0026amp; compatibility, instead they seem to be chasing a never ending idealization of what they feel they should have. And even before covid I felt like many people are just stuck in arrested development, which i could speak about for hours but let me not go off on a tangent here.\n\nTo sum it up, people are very very very very poorly socialized in the US. It is a shit show here. I’m resigning from the idea of getting married and having kids.",
   "created_utc": 1702906905,
   "score": 19,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv4o8d",
   "message": "Roses are red, violets are blue. My bottle of whiskey and fleshlight costs less than dinner for two…",
   "created_utc": 1702884053,
   "score": 51,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdujf5b",
   "message": "lot's of single moms",
   "created_utc": 1702871433,
   "score": 221,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv0j4v",
   "message": "Really location dependent, from my experience. When I lived in Monterey CA, it could be years w/o any dates. In NYC I'm constantly being invited to parties or events with tons of very attractive, intelligent, and interesting people. I typically go on 1-2 dates a week and they have usually been good experiences. \n\nIt really helps when you live in a city with 9 million people vs 30K people, and there's just more stuff to do.",
   "created_utc": 1702881088,
   "score": 15,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv3lih",
   "message": "I’m not in it because it’s pointless and I hate myself and think I am ugly.  Don’t even have a reason or motivation to leave the house.  I don’t even care that much about dying alone anymore it’s the fact that I’m going to die alone hating myself.  I also don’t know why or when this started or how to fix it.\n\nThe whole thing about being a guy is confidence and being useful and able to fix shit.  I am none of that.",
   "created_utc": 1702883258,
   "score": 17,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv68mg",
   "message": "It sucks. Maybe it's just a problem with me though. I get tons of likes from guys, but no one has anything in common with me. I tried dating one guy who had a lot in common with me, but he was trying to get back with his ex while claiming that we were exclusive. Then he told me I just wasn't as good as his exes.\n\nI just don't feel like trying anymore. Most guys are only looking for hookups and you can't trust anyone. Trying to date just makes me feel worthless.",
   "created_utc": 1702885224,
   "score": 17,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduva9g",
   "message": "Pretty terrible and like a dumpster fire. I wish I could have an arranged marriage just so I didn't have to go on another pointless date and play the 20 questions game. The more I try the more I have to sit myself down and realize dying alone with 20 cats may be my best option 🤣",
   "created_utc": 1702877699,
   "score": 15,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduxznt",
   "message": "If you're an average looking young male and didn't go into higher education you are playing on nightmare difficulty.",
   "created_utc": 1702879395,
   "score": 96,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduu4t7",
   "message": "I’m convinced Covid lockdown made people think that being unhealthy, unkept, and out of shape was ok while also feeling entitled to a partner who is none of these things.",
   "created_utc": 1702877004,
   "score": 132,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv0h5q",
   "message": "As a 28 year old male\n\nIt's about how much you can bring to the table but rarely about what they can. If you have standards, you're judgemental, but if you're not in the top 1% of looks and money you're beneath them and not worth the time. \n\nYou're nothing like their ex, until they are mad at you, then you're just like their ex.\n\nThey're super into you one moment, and the next they don't reach out or respond for days and expect you to know what it means. \n\nEveryone seems to be in a rush to get married before 30, or to stay single as long as possible and have as much dates and sex as possible. \n\nThey're likely using you to get over someone else, but if you have any doubts about their intentions, you'll be lied to and subject to gaslighting.\n\nThey have every right to know where you are and what you're doing, guilty until proven innocent.  But if you ask what they're up to it's creepy and stalkerish.\n\nIf they think you have a lot of sexual experience, you're a fuckboy and can't be trusted. If they think you have little sexual experience then there must be something wrong with you and therefore you are undesirable. \n\nThat's been my experience",
   "created_utc": 1702881049,
   "score": 112,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdutbcf",
   "message": "As a man that recently turned 27. It's pretty annoying. Girls this age either have issues committing, communicating, or love bombing. On the other end, the girls that do seem more mature are typically women who aren't a match for me. They expect me to bankroll their lives and be stay at home moms, they are already moms or have a very strong list of requirements of men that seem unrealistic. I'm not even sure I want kids to be honest. \n\nThere's more but I don't want to drag on. \n\nI'm not listing this to generalize women, this is just my perspective from what I've dealt with so far. I'm sure and have seen the list of issue women deal with and it is just as rough. Just wanted to paint my side.",
   "created_utc": 1702876531,
   "score": 66,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvr312",
   "message": "Male here.\n\nWhen my GF of 7 years and I broke up a while ago, I joined Tinder/Hinge to see how it'd go. Especially because I can be kind of shy in my approach to girls. Those apps are fucking awful. Some notable experiences:\n\n-Girls never replying, ever. (Why did you even match with me)\n\n-Going on 1-2 dates a week became super expensive just to have them go nowhere\n\n-Dates showing up late\n\n-Super weird interactions #1: girl finds out I'm a nice/kind person. Proceeds to be mean to me trying to get me to be mean to her. This actually happened a couple times.\n\n-Super Weird interactions #2: Go on a date, seemed great. Continuously texting. She sends me cute selfies. I ask to meet up again and she immediately breaks it off. \n\nSo I got off the apps. Decided to focus on myself. Dress good feel good, go to yoga/HIIT classes, hang with friends more. Within a couple months I had a couple girls asking ME out and one of them is my current GF. \n\nMoral of the story. Make yourself happy and opportunities can come. Even if they don't, you're still happier than before.",
   "created_utc": 1702901186,
   "score": 14,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv6lkz",
   "message": "Although I always saw myself as finding a partner and having children- Cat lady is becoming a very real possibility.... 🤷🏼‍♀️😂",
   "created_utc": 1702885499,
   "score": 30,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv6z2c",
   "message": "I’m recently single and I’m doing the same thing I did the last two times I was single, go back to dance classes. I’ve barely tried dating apps as I’m meeting plenty of new people whilst dancing. I’m not thinking about a new relationship anytime soon so I can just enjoy the moment. \n\nDancing lessons are fun and provide an icebreaker as well as learning a good skill and the ones I go to have 30-50 women (with new women joining each week). After the main lesson, we get 1.5-2 hours to dance freestyle together and within that conversations can occur. Most of the time a large group will go to the local bar or pub after too, so that gives even more opportunity to meet people too or continue the conversation. \n\nI’ve met my past two long term relationships at dance lessons. \n\nThey’re cheap too, I pay £10-12 for an hour of lessons and 1.5-2.5 hours of free style. Twice a year I go to a big weekend event with around 2000 people with lessons all day then partying in the evening until 6am.\n\nI originally went to meet new people and to potentially find someone, I’ve found people as well joining a great community. I’m also sorted for dancing whenever I go out and at any weddings.\n\nI’ll get back on the apps soon as you shouldn’t put all your eggs in one basket.",
   "created_utc": 1702885783,
   "score": 32,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv9utt",
   "message": "As a guy, using dating apps. I feel like any girl I try to talk to never puts any effort in. They usually just fish for compliments and end up ghosting you once you get it. I think it’s better to meet people in person but I’m too lazy.",
   "created_utc": 1702888009,
   "score": 29,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv9xpr",
   "message": "Finally a question that applies for everyone on reddit",
   "created_utc": 1702888072,
   "score": 13,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvfrnj",
   "message": "Stage 1 is feeling lonely and craving partnership Stage 2 is redownloading a dating app against your better judgment Stage 3 is an act of exploration of your problems vs the problems the people you meet on the app which proceeds to Stage 4 where you remember you were better off alone anyways",
   "created_utc": 1702892814,
   "score": 14,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvjf8f",
   "message": "Let's say it got to the point i am okay with arranged marriage...",
   "created_utc": 1702895723,
   "score": 12,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdur9w1",
   "message": "I haven't had any trouble getting dates. But I'm tired of the expectation that I have to put in 90% effort just to get 10% back. The ones that do put in effort turn bat shit crazy after 3 weeks.",
   "created_utc": 1702875376,
   "score": 82,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvbsif",
   "message": "It's difficult to find authenticity. Had quite a few experiences where people show their true colors after a few dates, and not in a good way. There is a lot of pressure to show that you are a good catch - rich, young, hot, smart. These are all great qualities obviously, but I'm a romantic goof. I just want to dance, laugh and connect with someone. Maybe get some scramble egg toast in the morning and just talk nonsense. Maybe it will happen, I mean you gotta hope. I think we are all a bit lost lately.",
   "created_utc": 1702889576,
   "score": 13,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvt0rh",
   "message": "I get the mass exodus from churches, but man, ya'll missing out on one of the best places to meet normal people.",
   "created_utc": 1702902387,
   "score": 12,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvywq7",
   "message": "I’m a lesbian. Everyone is fucking poly.",
   "created_utc": 1702905648,
   "score": 11,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv6d06",
   "message": "Its a joke at best. I'm not even really interested in trying to find a guy anymore. I've mostly just given up, because it's not even worth it anymore.\n\nAt its most fundamental level, in order for dating to work, you need (1) Someone who's a good quality person, and (2) Someone you have chemistry with. It's rarely, if ever, both at the same time. And that's a best case scenario. \n\nWhen you add everything else that has contaminated the dating pool, swimming just sounds terrible:\n\n- Nobody wants emotional intimacy anymore. They just want a friend with benefits, a one-night stand, or a hookup. If that's something that both people wholly consent to after a lengthy, thorough, and explicit discussion about what that entails, then sure, that's fine. But that rarely ever happens, and its still not a guarantee that one person won't develop feelings...and ultimately get hurt.  \n- People are superficial. Most people are not flawless models, and most of us come with physical and emotional scars. Every woman is not going to be a bikini model with Instagram curves, and every man is not going to be a 6'3 rich doctor with a bodybuilder physique and a chiseled jaw. . Inner beauty doesn't seem to matter anymore. You are allowed to find someone physically attractive or physically unattractive. We all have preferences, and that's okay. But the quality of a person matters, too.  \n- People play mind games. Ghosting, love bombing, breadcrumbing, narcissism, exploiting people's trauma, etc. Whatever happened to tactful honesty from the beginning?\n- We all have pain, but too many people think their pain has to be everyone else's pain, too. Instead of dealing with that pain in a healthy, constructive way, too many people are addicted, abusive, use people, etc.  \n- A lot of people are selfish. They want what they want, when they want it, and they will stop at nothing to get it...at the expense of other people. They don't care how many souls they destroy, or how many lives they ruin. They don't care. They want what they want.  \n\nThis is honestly not everything, but to answer your question, nobody really wants any part of the dating pool anymore, because *clearly* somebody peed in it!",
   "created_utc": 1702885317,
   "score": 52,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdumitn",
   "message": "Gonna vary from person to person, but for me, a little frustrating. Tried some online dating, and while to an extent it's been more successful than I'd expected in that I've matched with a number of people greater than zero, nothing substantial has come of it.\n\nExcept for one two month relationship which I then realised just wasn't what I was after.",
   "created_utc": 1702872928,
   "score": 25,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduv927",
   "message": "feels like i’m going to die alone",
   "created_utc": 1702877680,
   "score": 26,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdvanri",
   "message": "Honestly, It's ridiculous. Even people my age (30) have adopted this stupid hookup culture garbage and just want a fling. I now turn them away. I want a relationship not just a root",
   "created_utc": 1702888655,
   "score": 11,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdved9f",
   "message": "If I had known it would be this hard at age 29 as a healthy, stable and fairly attractive man, I would have prioritised relationships earlier in life. Juggling full-time work and all the perks of being an introvert mean it's quite difficult to find time to meet new people. I've tried dating apps, but they are really dismal. For someone who has always built relationships with genuine contact, trying to sell myself in such an artificial way is rough.",
   "created_utc": 1702891677,
   "score": 10,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdw6hy7",
   "message": "39M here, tall and pretty good looking. Online dating is awful, yet seems the only avenue a lot of the time. Never found a successful relationship online. You swipe a bunch of women, you get a match occasionally. They never message first. So you message, but most don't reply. The ones that do reply usually have no idea how to hold a conversation. Then you find one that does, and you go on a date. Most of them look nothing like their pictures, or you just don't find a connection with them. Eventually you find one that you do see a connection with, go on a couple dates, everything seems great! Then you just get ghosted with no explanation.   \n   \nThe ghosting is pretty real when you meet someone offline too, but everything else is so much better, and it doesn't feel like a job application. Dating is a sad state of affairs these days. I mostly don't bother trying, and wait for someone to actually show interest in me first. Everyone's so fucking flaky and fake.  \nMost of the time, I'm quite content just being single, but having a partner in life would be nice.",
   "created_utc": 1702909273,
   "score": 11,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kduqx93",
   "message": "In my 20's, anxiety-filled fun but no idea what I was doing.  \nNow in my late 30's, it's \"Yo are we doing this I gotta teach in the morning so I need time to both get to know you and also create lesson plans. And if there's a possibility of banging I need to schedule that in too\". More hyperfocused, more present, more meaningful when there is time to date, and I'm way better at sex that it becomes a joyous activity rather than a chore.",
   "created_utc": 1702875185,
   "score": 56,
   "submission_id": "18kzeni"
  },
  {
   "comment_id": "kdv6qm0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18kzeni"
  }
 ]
}