{
 "submission_id": "18l5az5",
 "title": "What happend to the girl that got pregnant in your high school?",
 "selftext": "",
 "created_utc": 1702894106,
 "permalink": "/r/AskReddit/comments/18l5az5/what_happend_to_the_girl_that_got_pregnant_in/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/18l5az5/what_happend_to_the_girl_that_got_pregnant_in/",
 "comments": [
  {
   "comment_id": "kdvngew",
   "message": "Their parents made them get married. It didn’t last a year past graduation. I heard she’s on her fourth husband now.",
   "created_utc": 1702898742,
   "score": 90,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvzqhg",
   "message": "She's my sister, her baby daddy was in jail most of the pregnancy and just got out this year, the kid is three now, she's very toxic",
   "created_utc": 1702906066,
   "score": 221,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvlt3l",
   "message": "She married the kids’ father but he passed away in his early 30s. She’d be 47 now with 31 and 29 year old kids.",
   "created_utc": 1702897553,
   "score": 155,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvnb1q",
   "message": "She gave birth in her basement, killed her newborn, and hung herself. The note she left was insane evidently and led to several fights amongst the seniors.",
   "created_utc": 1702898637,
   "score": 4,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvs0md",
   "message": "She got stabbed in the stomach by her baby daddy’s girlfriend. Yup. \n\nEveryone lived (except the fetus), stabby girl went to jail. No idea what happened after that.",
   "created_utc": 1702901775,
   "score": 56,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvwl3j",
   "message": "Girl I knew had family issues - lots of fighting among her parents led to divorce and years of ongoing conflict after. Don't want to say \"classic case of 'seeks any affection possible from all the wrong people',\" but... yeah. We were \"friends,\" in the sense that I stood up for her when others made fun of her, and we kept in touch after, but never anything physical between the two of us - could be that's why we remained friends. I always just thought of her as someone I knew and talked to sometimes; she told me years later that I was one of her only friends in school. Damn, I felt like an ass for not realizing how much a little kindness meant to her at the time.\n\nShe was smart intellectually but emotionally stunted and slept with dozens of people. Despite using birth control, she got pregnant from one of them. She got an abortion. It served as a wake-up call for her, she doubled-down on studies after, graduated half a semester early, got away from her lousy family, went to a good college and joined the military. Her experiences in Afghanistan messed her up even more, but last time we spoke she had left the service and had been travelling the world and ended up getting married to someone she met on her travels. We haven't spoken in the last few years, but I hope she found peace.",
   "created_utc": 1702904427,
   "score": 25,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvygp3",
   "message": "She was my ex. My best friend at the time was the one that knocked her up at 16.\n\n15 years ish later they're still together. They've got 4 kids now I think and last I heard the now husband just graduated law school. All in all I'm really happy for them it seems like everything worked out.",
   "created_utc": 1702905420,
   "score": 221,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvj2ve",
   "message": "She had been actively TRYING to get pregnant. And she was sleeping with multiple guys willing to help her. After she got pregnant her 12 year old sister decided to go that same route(and was also successful in that).  Their family didn’t believe in abortion so even the 12 year old gave birth. Anyway, the older girl dropped out of high school to stay home taking care of the baby, I believe her parents were paying most of it.\n\nI ran into her like four years later. She was bad mouthing the guy who got her pregnant telling me how he wasn’t paying enough child support. And how when he was 15 and slept with her that he knew she was trying to get pregnant so he should have expected to be paying until the child was 18.  I am not implying she did not deserve child support. But I do want to imply both were too immature to make a choice to bring a baby into the world. He ended up also dropping out of school so he could work full time. But he was working minimum wage trying to come up with child support. Whole situation was very sad to have seen. I do not know what happened with her little sister. My sister and the little sister had been close friends, but once getting pregnant my Uber religious family forbid my sister from talking to her. Otherwise I might have heard over the years.",
   "created_utc": 1702895453,
   "score": 179,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvhk3s",
   "message": "She successfully completed her studies, but her husband went to prison :(",
   "created_utc": 1702894241,
   "score": 5,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvl82n",
   "message": "Her mom had her at 16 and she was pregnant at the same age. With hindsight I think that gave her an advantage. Her youngest is 15 and she's been with the same guy ever since. They live happily in California. He's a Navy lifer and she works at the post office",
   "created_utc": 1702897113,
   "score": 49,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvtcy1",
   "message": "I went to a catholic school, so the girl that got pregnant shot herself in the head.",
   "created_utc": 1702902592,
   "score": 148,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvjjfw",
   "message": "A girl I went to school with got pregnant at 13, and gave birth after she turned 14. Basically her parents raised her child, as she was a kid herself. She got married later and had more kids. She was a bullied a lot in HS.",
   "created_utc": 1702895811,
   "score": 29,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvwc76",
   "message": "She had an abortion and went on to graduate college, married the guy, had four kids, and a successful career",
   "created_utc": 1702904295,
   "score": 96,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvtc9k",
   "message": "She's doing just fine and is a grandmother now (almost 30 years later).",
   "created_utc": 1702902580,
   "score": 139,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvr4gv",
   "message": "She had a miscarriage and didn’t tell her boyfriend or her family about any of it",
   "created_utc": 1702901212,
   "score": 162,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvtmv1",
   "message": "There were at least 4 pregnant hs chicks including my best friend at the time. She Did not do well at life at all, got into heavy drugs. Had 2 more kids, they live with their dad. I think she's in jail now. She was a clepto and a total degen which I didn't mind when we were kids lol but at some point you gotta grow up and be responsible not go on a downward spiral. Haven't spoken to her in years cuz she's not even remotely the same, we have zero in common anymore and meth heads gross me out.\n\nTwo of the other girls had 5 kids each. Same dads for all of them, but the guys are total deadbeats who would literally get out of jail, impregnate and then go back in. Like they had no relationship with their kids at all. The one chick was my friend's stepsister, the baby daddy died from a heroin overdose a couple years ago. He actually was really charming and cute when we were kids, but yeah he was a loser. That chick has been in and out of jail numerous times as well for check fraud and possession. The other girl who had 5 boys, she became a school bus driver. It's really sad though her oldest died in an accident with his friends recently and he was only 18. \n\nThe 4th girl was pregnant senior year and looked ready to pop at prom lol, she had one more son. She owns a pest control business and collects plants.",
   "created_utc": 1702902758,
   "score": 230,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvq53h",
   "message": "Nothing. She’s doing fine now, I think she went into engineering. She was in grade seven and it was just kids messing around as far as I know. Her parents made her get an abortion. This was rural India, children out of wedlock is so so extremely taboo. There was no question of having the child. I absolutely cannot imagine a teenager here having a child, you do not get to choose to keep it.",
   "created_utc": 1702900576,
   "score": 41,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvv7ku",
   "message": "She eventually went to college on a scholarship for women’s soccer and became a lawyer.",
   "created_utc": 1702903671,
   "score": 156,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvwanm",
   "message": "Christian school so they made her have the baby. Ruined her life, she would have been a serious college athlete. Her boyfriend was a total fuck boi who immediately knocked up another girl at a different school.",
   "created_utc": 1702904271,
   "score": 189,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvlgyb",
   "message": "I married her brother and her son is my nephew and I love him to death",
   "created_utc": 1702897302,
   "score": 207,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw1gy1",
   "message": "I like how this question implies there was only one",
   "created_utc": 1702906919,
   "score": 225,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwmarf",
   "message": "That girl was actually my best friend, she ended up coming back to graduate and went on to raise a very good little girl named Anastasia. Unfortunately when her daughter was 3 the committed suicide due to deep depression and mania from untreated bipolar. She was a good mom, an incredible best friend, and I wish every day we could have her back.",
   "created_utc": 1702915664,
   "score": 146,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvz580",
   "message": "I became a nurse and cared for the elderly for 20 years. My daughter is grown, lives with her boyfriend and studies at the university♥️",
   "created_utc": 1702905768,
   "score": 30,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwfk6r",
   "message": "My high school: She went to court and got an abortion. (At that time it was parental or court’s permission.).     \n       \nMy neighborhood: She buried the baby in a park near the train tracks.",
   "created_utc": 1702913071,
   "score": 114,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwmj1n",
   "message": "Girl?  Singular?  We had two in middle school, and this was small-town Indiana.\n\nThe most memorable one from high school got married, and they walked across the stage at graduation  as \"Mr. and Mrs. XXXX\" to wild applause.  Sadly, a few months later they were both killed when a tree fell on their car during a thunderstorm.",
   "created_utc": 1702915753,
   "score": 117,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvzd2s",
   "message": "I dropped out and moved 2000 miles to be with the father, we married and had 2 more children. I stayed married to him for 10 years despite the abuse. We were both unhealed ppl but he was a horrid father. After I left him he did to our children what his parents did to him and abandoned them. I’ve been raising them without his help, aside from a tiny amount of cs, for the last 9 years. Our oldest is now a legal adult which is crazy to think about, she’s older than I was when I got pregnant with her. My kids are doing great. I have a nice job and I work hard but financially I am stable. My job has nothing to do with my college degrees lol. I am single and probably will remain so due to my own childhood trauma which probably contributed to my teen pregnancy. Lots of therapy and self work later I’m happy as a clam. I’m a mold breaker, a breaker of chains, generational trauma stopper… but I feel horrible as someone who hates my own last name that I ended up having 3 kids who also hate their own last name. Shitty parents suck! Funny how those things play out. I educate my kids on many issues and try to help them make better choices, so far, so good. \n\nOther teen moms are doing pretty well too, two sets of highschool sweethearts who are still together. One teen mom who ended up on drugs and lost her kids. We live in a good area and are fortunate to have resources available to us. Someday I’d like to get involved in programs to help other less fortunate single moms as I know it’s getting harder. I volunteer when I can and donate what I can. It’s been a wild ride.",
   "created_utc": 1702905878,
   "score": 204,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwemex",
   "message": "My mom was the one who got pregnant in high school, she put my sister up for adoption. She eventually went to college, graduated and eventually met my dad and had me. She’s doing very well for herself now.",
   "created_utc": 1702912698,
   "score": 93,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw41xh",
   "message": "She's still my sister.  And she was a grandmother at age 35.  And she's been married for (to the father) for over 45 years now.",
   "created_utc": 1702908151,
   "score": 111,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdxe6xu",
   "message": "I am the bf/dad in that situation. My hs girlfriend and I were…active, and became parents at 16. Her folks were pretty religiousy (and weird), and kicked her out when they found out (there was a *bunch* of other stuff in that story, too). Anyway, she lived with my family until she qualified for public housing our senior year of high school.\n\nWe stayed together until we went to college. She really didn’t know how to handle the freedom. We really diverged there, she got into partying and developed a drug problem. \n\nOne day, when our son was about 4, she just….left. A FWB of hers (who had been a good friend of mine) was at her apartment, she ran an errand and left our kid with the friend. Several hours later, the friend called my parents and said he didn’t think she was coming back. \n\nA few weeks later a letter showed up in the mail, she relinquished all of her parental rights and just walked away. Suddenly, I was a 20-year old single parent of a 4 year old (with LOTS of help from my parents). Lots of court proceedings later (she didn’t show), it was a done deal. I had to pay myself child support for many years, but I had sole custody. Funny story- I *did* actually have to pay myself. It was a nominal amount, $15/wk, but I had to write myself a check and deposit it every week to establish the paper trail. Once a year, I’d have to turn it in to show that I was receiving it from myself, then I could get my tax refund. Anyway, I digress. \n\nMy mom insisted that I finished college (I did), and by then I’d met a wonderful woman who would eventually become my wife. My HS girlfriend popped out a few more kids with a few more guys, and bounced from dead end job to dead end job for a few years. She finally got clean in our early 30’s, and reconnected with our daughter. \n\nKid’s 29 now, and has her own place. Her mom (my ex) moved in with her last year, as her tenant. Apparently, she (my ex) works some clerical job somewhere, and keeps up on her rent. I talk to my daughter pretty regularly, she knows how not to get drawn into any of her mom’s drama. It’s sad that she’s good at keeping that distance, but also she’s pretty well practiced at it. \n\nMy daughter went to college and has all sorts of her own hobbies (music, art, etc), a good group of friends, and a stable romantic relationship. She’s built a pretty good life for herself. \n\nIt was a tough road for a while, but we’re all doing well these days. I’ve really got to give a shoutout to my mom for keeping it all together for those couple of years that made such a huge difference.",
   "created_utc": 1702925777,
   "score": 80,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw47bs",
   "message": "She ended up marrying the baby daddy’s brother. Then cheated on him with the baby daddy.",
   "created_utc": 1702908222,
   "score": 95,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvxde3",
   "message": "She had another one two years later and now has 2 children under 4 before the age of 20. She’s determined that her current boyfriend (and father to both) will be the love of her life. I wish her well.",
   "created_utc": 1702904849,
   "score": 82,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvhty3",
   "message": "Her nesting area was disturbed and she sadly ate all the babies as a stress response",
   "created_utc": 1702894459,
   "score": 59,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvtr3s",
   "message": "She got married with a guy she got pregnant with. They are together for 22 years, happy (?), at least she says so and quite rich. This guy has some trade company and she is helping him. She also has multiple plastic surgeries and is very very slim.",
   "created_utc": 1702902827,
   "score": 0,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvwu1d",
   "message": "I had my son, went back to school and finished year 12, got two diplomas and a bachelors degree and work in hearing support for students in primary and high school. My son is now almost a teenager and consent has been a big topic of conversation all his life.",
   "created_utc": 1702904561,
   "score": 199,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw8j5f",
   "message": "Not much.\n\nShe kept getting pregnant, lives off the government.  Multiple different baby daddies, apartment in the slums. Her kids will likely do the same.",
   "created_utc": 1702910172,
   "score": 40,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw9eti",
   "message": "She got pregnant junior and senior year. She had one or two more by the time she was 20. She seemed happy and I believe she went into nursing. Her kids have probably moved out and/or gone to college by now. Meanwhile we’re the same age and I’m about to go untangle my 2 year old from the Christmas tree 😂",
   "created_utc": 1702910552,
   "score": 52,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwkz7o",
   "message": "Her wealthy Catholic boyfriend insisted on sex without birth control then refused to pay for an abortion. She begged for money for the procedure from his poor friend who did help her. Btw the boyfriend is now some kind of Catholic activist who became even wealthier. She’s a secretary who never left her hometown.",
   "created_utc": 1702915165,
   "score": 64,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwr3ys",
   "message": "1977 girl got pregnant by a popular jock. The girl was frowned upon but the jock was not. Typical",
   "created_utc": 1702917471,
   "score": 48,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwwxtg",
   "message": "She had a bipolar mother who was severely abusive to her and her siblings. She got pregnant freshman year and had her baby when she was 15. She stayed in school and graduated with a cosmetology certificate. At age 19 she got into a relationship with an addict and eventually started doing heroin and meth. She got arrested for manufacturing methamphetamine in her house while her kid was also there. She was in prison for 5 years. She’s been sober now for 8 years and she is an addiction counselor. Her son, unfortunately, was not as lucky. He’s currently in prison for armed robbery. The poor kid never had a chance.",
   "created_utc": 1702919596,
   "score": 40,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvhq0t",
   "message": "I actually graduated and had a nice time in college because my parents helped me a lot. Also now I have what I consider a good job and have the prettiest baby ever",
   "created_utc": 1702894371,
   "score": 189,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw42dc",
   "message": "She was a sophomore, he was a senior. Had the baby, stayed together and got married. Had three more kids and the baby just graduated from college. They run a successful business together in my hometown.",
   "created_utc": 1702908157,
   "score": 69,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvltal",
   "message": "She died in the slums",
   "created_utc": 1702897557,
   "score": 83,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvyixf",
   "message": "We didn’t have that issue at my high school, but I do know someone who got pregnant sophomore year of college. She dropped out at the end of the semester, had the baby, took care of it for a few months until she could re-enroll, finished the degree, and is now doing very well working for a lab and co-parenting with the father.  Her daughter’s about 4-5 now and they do fun outdoorsy things like camping, hiking, and paddle boarding all the time. Anyone would be lucky to have her as a parent",
   "created_utc": 1702905452,
   "score": 133,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw14t7",
   "message": "A few weeks after HS graduation, she married the guy (her bf) who got her pregnant.  A few weeks afterwards, he joined the Army and they together embarked on the most amazing adventure.  Over the years, they've bounced from Alaska, Germany, Japan and a few posts in the US.  They raised an amazing young man as their son.  Today, her hubby has retired from the Army after 25 years of service to his country, they've retired to Alaska and they're traveling the US and Canada.",
   "created_utc": 1702906753,
   "score": 155,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvqtje",
   "message": "She went to prison for stealing money from the bank she worked at",
   "created_utc": 1702901021,
   "score": 25,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvyc86",
   "message": "The football coach has to pay child support and she gets to drive his car",
   "created_utc": 1702905356,
   "score": 45,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwygl2",
   "message": "She ended up resenting the baby. Dated a bunch of losers. She lost temporary custody of her son after one of her shitty boyfriends badly beat him. A few months after she got custody back (when he was in kindergarten) she made him walk to school by himself, and he got hit by a car. Messed his leg up really bad. \n\nHe grew up very angry, very misbehaved, and now he's basically a drain on society. I have always blamed his mother for this.",
   "created_utc": 1702920142,
   "score": 38,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdxcqhh",
   "message": "I am the girl. It was a rough road but I'm now living my best life. Took me till my 40's but now, with WAY grown children, I still have some youth left to experience some cool shit. \n\nI was the girl with a fucked up abusive family. Seeking attention anywhere I could find it. I wish I could go back and hug her. She deserved love then way more than I do now. She was just a kid. 😞",
   "created_utc": 1702925260,
   "score": 60,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwfj3a",
   "message": "She’s a grandmother now. \n\n\nShe’s 38",
   "created_utc": 1702913058,
   "score": 24,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwm7d8",
   "message": "My biological mom had me when she was 16. She gave me up for adoption. A whole 18 years passed and I finally got to meet her. She went back and finished high-school. Worked as an accountant and recently left her job to go look after her dying aunt. \n\nShe never got married and never had any kids after me. She is an amazing women and I think she made the right decision giving me up for adoption. I do feel bad for her as I think she never really lived a full life, I think it killed a little bit of her. But she seems happy and moving along so I am rooting for her.",
   "created_utc": 1702915628,
   "score": 94,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwijgw",
   "message": "Welp. I had a child at 17 (Senior) graduated with honors. Went to college, graduated with a degree. \n\nKiddo grew up with adopted family. Found me when she was about 19 and we’re pretty close at this time.",
   "created_utc": 1702914239,
   "score": 70,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw8l84",
   "message": "My experience was from 6th grade so not high school. She was 10 when she got pregnant and 11 when she gave birth. Her mom basically raised the baby because what 11 year old is capable of raising a child. By the time she was 23 she had six kids by five different guys. I have no clue why her mom didn’t put her on birth control after the first baby because she had two more in high school. She also became a grandma at 26.",
   "created_utc": 1702910197,
   "score": 15,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwu9q8",
   "message": "She became a Congresswoman from Colorado. And jerked off a guy in a crowded theater.",
   "created_utc": 1702918627,
   "score": 31,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw1ilk",
   "message": "She had an abortion, went on to graduate from college and is currently married with three kids",
   "created_utc": 1702906941,
   "score": 39,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwck2d",
   "message": "The girl? It was most of them dawg, bottom 10 school in my state.",
   "created_utc": 1702911861,
   "score": 49,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvv9g3",
   "message": "I got custody and she moved to another province.",
   "created_utc": 1702903701,
   "score": 19,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwa4ba",
   "message": "That was me. I moved into the projects at 17 and worked while putting myself through undergrad. Graduated, moved, went to graduate school and finally moved into our forever home in 2018. My daughter is almost 18 and is planning for med school. It was a rough journey.",
   "created_utc": 1702910853,
   "score": 26,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvwmja",
   "message": "She has 5 children now, and is pretending to be single to claim benefits. On the bright side her boyfriend/baby daddy was just released from prison!",
   "created_utc": 1702904449,
   "score": 33,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwrfkg",
   "message": "Haha. I was that girl. \n\nBarely graduated high school, but still did. \n\nI went on to purchase a house, have more children and just decided to go to college. I was .08 shy of the presidential list this semester.",
   "created_utc": 1702917590,
   "score": 70,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvstdj",
   "message": "Which one? There were a lot of them. https://abcnews.go.com/amp/GMA/AmericanFamily/story?id=1834191\u0026amp;page=1",
   "created_utc": 1702902264,
   "score": 25,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw0xb8",
   "message": "There was one specific gal that got pregnant in my HS (there were several) maybe during sophomore yr, not sure of the age. I remember seeing that baby at many HS functions (football games, concerts, etc) until she graduated I think. We were in different grades but I remember that child was like a full on toddler the last time I saw her. This was a gal I wasn't friends with and didn't really know but the little girl appeared to be well cared for and loved. I'm assuming they're doing well, at least I hope so. \n\nI knew of other girls who had abortions and one that gave her baby up for adoption. I think about them from time to time.",
   "created_utc": 1702906651,
   "score": 19,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwf5vq",
   "message": "She died in childbirth. Her boyfriend changed schools I think and raised their son on his own.",
   "created_utc": 1702912913,
   "score": 26,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw05wa",
   "message": "She's weak as fuck. I arm wrestled her and her kid and they both lost. Checkmate",
   "created_utc": 1702906277,
   "score": 27,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw6oc1",
   "message": "She was a major party girl and had issues with her baby's father. Fast forward ~5 years: her and the father have worked things out and he's involved in the child's life, they have a house out of state together, and despite all of the challenges—she pursued her dream to become a nurse, and is absolutely thriving in life. We don't talk much anymore, but I'm so, so proud of her, and have always silently rooted for her.",
   "created_utc": 1702909351,
   "score": 47,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwml95",
   "message": "Haha. I married her 20 years later. Best wife and step daughter ever.",
   "created_utc": 1702915776,
   "score": 37,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvn6fn",
   "message": "She's a local politician.",
   "created_utc": 1702898545,
   "score": 15,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdw6w06",
   "message": "Had her baby, never saw her in the school again but two months later she was on the news for leaving her baby in a wendys bathroom. Caught on camera and everything.",
   "created_utc": 1702909446,
   "score": 16,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwf5c4",
   "message": "She married the guy and then they got divorced. He’s doing well and she’s a crack head. Go figure. She was beautiful and smart but I guess overcoming having a child your junior year was too much.",
   "created_utc": 1702912907,
   "score": 16,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdvwbjm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdx387r",
   "message": "She ended up pregnant at 14, had two more kids by her baby daddy like 1 year post graduation.\nThen like 6 years ago it was discovered he recorded a video of him forcing himself onto his eldest daughter. When she discovered the video she turned him in.\n\nHis parents were defending him way too hard.\nThey blamed THE BABY MAMA for the trauma her daughter was gonna go through because in their words \"If she didn't know about it, then she'll be fine.\"\n\nYea the gross mf is still in prison.",
   "created_utc": 1702921852,
   "score": 20,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwdpfj",
   "message": "Lmao this was like 50% of my hs to be honest so… it’s trippy seeing these people on fb with their ADULT children when I am home with toddlers.\n\nBut seriously. When I was in HS my school had the highest pregnancy rate in our state. SNL weekend update even made a joke about us haha",
   "created_utc": 1702912328,
   "score": 18,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwx2m1",
   "message": "I am that girl. \nHad my son aged 15. Married my partner at 18 and went on to have two more children. Our children are now aged 20, 16 \u0026amp; 12. We are still going strong. \nWould definitely not recommend starting so young but we made the best of a bad situation.",
   "created_utc": 1702919645,
   "score": 17,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwa0c1",
   "message": "Beautiful girl.  Honors student. Involved in activities.  Fell for and got pregnant by another friend of mine twice.  Two abortions senior year. Went to a good college next state over and stripped her way through. Went to a good law school.  Graduated. Working as a lawyer still. Got married to another lawyer and has two beautiful girls both in high school now.",
   "created_utc": 1702910806,
   "score": 15,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwdxbo",
   "message": "Over 20 years ago, my best friend got pregnant in high school. She was very poor, her mother had intense mental health issues, she lived in squalor in the worst part of an already crappy town.\n\nShe married the guy.\n\nThey're still together. They have two kids now. Both her kids just made Eagle Scout rank. I'm proud of her! She seems happy and like a very caring and involved mother.",
   "created_utc": 1702912417,
   "score": 40,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwm8aq",
   "message": "She had twins. They are now both in college. She is successful in her career. Her family was clearly super supportive. I bumped into her at the airport once. She was headed to Iceland.",
   "created_utc": 1702915638,
   "score": 15,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdwpfqc",
   "message": "One had the kid in 8th grade, came back to school, and graduated.  I hope her life is going well.  She had a very rough life and had a rough exterior but she was a really caring person.  \n\nAnother one got preggo at 16, went to alternative school, graduated, married the guy who knocked her up and became a super judgemental right-wing evangelical christian, hating on gays and girls who get pregnant before marriage (she had to be reminded that she was a teen mom too).  She was nice prior to all of that. Now I have nothing to do with her or her family.",
   "created_utc": 1702916849,
   "score": 15,
   "submission_id": "18l5az5"
  },
  {
   "comment_id": "kdxhkud",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18l5az5"
  }
 ]
}