{
 "submission_id": "18lgudu",
 "title": "Redditors, what happened to your bullies?",
 "selftext": "",
 "created_utc": 1702926861,
 "permalink": "/r/AskReddit/comments/18lgudu/redditors_what_happened_to_your_bullies/",
 "score": 220,
 "url": "https://www.reddit.com/r/AskReddit/comments/18lgudu/redditors_what_happened_to_your_bullies/",
 "comments": [
  {
   "comment_id": "kdxld3t",
   "message": "I stopped giving a damn about their existence so I really don’t know",
   "created_utc": 1702928319,
   "score": 189,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxnosw",
   "message": "My elementary school bully one day stopped my middle school bully and beat the snot out of him. Then apologized for what he did in elementary school. Pretty surreal actually. After middle school I don’t know what happened.",
   "created_utc": 1702929148,
   "score": 24,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxhjmu",
   "message": "Last I heard he went to prison for throwing a guy off a bridge.",
   "created_utc": 1702926970,
   "score": 169,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxhrb9",
   "message": "Mine went to prison for many years for murder.",
   "created_utc": 1702927046,
   "score": 107,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxjfgj",
   "message": "Great bully story from my high school.\n\nRemember the **ALS Ice Bucket Challenge**? Where people were dumping ice water on each other for charity, ten years ago or so?\n\nA group of bullies at my school tricked an autistic kid into doing the \"Ice bucket challenge,\" but instead of water, they filled the bucket with spit, feces, urine, and tobacco. And poured it onto him.\n\nI remember it being a huge deal locally at the time. The perpetrators were eventually identified and caught.\n\nAs for punishment...not sure about all of them, but at least the oldest one (I think he was 18 and possibly liable for a serious punishment) took a plea deal to avoid any jail time and get only probation...but a condition of the probation was that he would have to get a taste of his own medicine of what he put the autistic kid through. \n\nExcept...on a *dairy farm*.\n\n(Yes, apparently such \"unusual\" punishments do occur and there are tons of examples of them - I was curious and looked into it. The short legal story is that the defendants in such cases *could* easily get such sentences struck down if they appealed, but then they'd serve a \"normal\" jail sentence and they don't want that. There aren't too many limits to what judges can impose as probation conditions either).\n\n___________________\n\nWhen I heard about it I thought he was getting off way too easy. No prison time and a punishment that would last a couple minutes, tops?\n\nBut then someone got a video of his punishment somehow (they definitely weren't *supposed* to tape it) which circulated around the school for a bit, and...hoy *boy.* They used a manure tanker. That stuff poured/oozed onto him for a good 45 seconds straight and he was puking and gagging.\n\nQuite satisfying and fitting, I guess.\n\nThankfully the video's been taken down from YT/etc since then. Wouldn't want that to haunt him the rest of his life. He learned his lesson, I'll bet.",
   "created_utc": 1702927634,
   "score": 45,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxo6sl",
   "message": "My bully is rich and living a great life. We don't all get justice, i guess.",
   "created_utc": 1702929327,
   "score": 139,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxkzn7",
   "message": "Died of an overdose.",
   "created_utc": 1702928187,
   "score": 61,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxuqhz",
   "message": "She’s a high school guidance counselor lol.\n\nShe did reach out to me on Facebook a few years back and apologized. It seemed genuine. Regardless, I moved on long before I got the apology and I wish her well.",
   "created_utc": 1702931668,
   "score": 58,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxjlop",
   "message": "He's living with our grandparents while catfishing girls to send him nudes",
   "created_utc": 1702927695,
   "score": 53,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxm9wk",
   "message": "He's a drug addict and works at Waffle House",
   "created_utc": 1702928644,
   "score": 46,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxi6p8",
   "message": "No idea.  I moved on from them and their environment and have no reason to look back.",
   "created_utc": 1702927197,
   "score": 43,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxo3gv",
   "message": "Who cares",
   "created_utc": 1702929294,
   "score": 114,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxp6f1",
   "message": "Almost all of them died from a heroin overdose",
   "created_utc": 1702929681,
   "score": 30,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxvw03",
   "message": "He died of an overdose. It was my mother's second husband. I piss on his grave every so often.",
   "created_utc": 1702932077,
   "score": 46,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxnblo",
   "message": "Last I heard she got in trouble for drinking in middle school. Haven't bothered looking her up",
   "created_utc": 1702929017,
   "score": 22,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxqwfk",
   "message": "Made shit youtube vids of him singing i dislikes them all",
   "created_utc": 1702930298,
   "score": 20,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxupqb",
   "message": "He swan dived out a 5th story window. I was happy he was dead. I felt like the Jeremy Clarkson Meme where he says \"Oh, No! Anyway\"....The world is better off without people like him in it.",
   "created_utc": 1702931661,
   "score": 20,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxvtnm",
   "message": "It’s actually kinda sad. He was a bully in elementary/Jr high. Looking back now, pretty sure it was the stereotypical bad home life/probably had an asshole dad. In high school he was actually a good, fun guy, even slightly nerdy. I didn’t really keep in touch but would see through Facebook that he got married and had like 4 or 5 kids. Then he killed himself. He may have been a jerk as a kid but definitely didn’t deserve whatever pushed him to the point of suicide.",
   "created_utc": 1702932054,
   "score": 23,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxnpmd",
   "message": "His wife was diagnosed with cervical cancer and was made infertile. Their marriage has been pretty rocky sense. I wish it hadn't happened at all. He was a high school bully and I got over high school decades ago.",
   "created_utc": 1702929155,
   "score": 18,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxo8ii",
   "message": "Not long after I first hopped on Facebook (yeah, a billion years ago), I happened to join a group for people from my elementary school and saw quite a few people who I kept having issues with having fairly decent jobs and kids and stuff. Then they started apologizing to me. I was a bit surprised; I wasn’t exactly a great kid either and figured I invited much of the trouble myself. Anyway, kids suck and thanks for coming to my TED talk…",
   "created_utc": 1702929344,
   "score": 19,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxqd5y",
   "message": "She got pregnant after high school and got married with a douchebag who beats the shit out of her",
   "created_utc": 1702930106,
   "score": 17,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxqa78",
   "message": "In jail for strangling his girlfriend. Thankfully she survived.",
   "created_utc": 1702930077,
   "score": 14,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxtn08",
   "message": "No clue about the school bullies but one work bully (manager) got fired for being a bully.  Of course she’s mad at me for being one of the people who got her fired.  \n\nOne of my sisters school bullies got murdered.  Turns out she became a prostitute and got killed.  This was many years ago.",
   "created_utc": 1702931276,
   "score": 15,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrttl",
   "message": "I got divorced.",
   "created_utc": 1702930629,
   "score": 12,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxlcg6",
   "message": "Not sure. I don't keep up with them. Middle school was a long time ago, thankfully.",
   "created_utc": 1702928313,
   "score": 10,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxoja6",
   "message": "High paying finance job.",
   "created_utc": 1702929451,
   "score": 10,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrl0f",
   "message": "One went to jail for possession, he’s now out and has been clean for ten years. Another is a paraplegic due to a motorcycle accident about 15 years ago. And the last one died in a car accident a couple years ago.",
   "created_utc": 1702930541,
   "score": 8,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxuw5d",
   "message": "As far as I know they're living normal lives, but at the same time I don't want to have to look at their stupid faces again so I won't look them up.",
   "created_utc": 1702931724,
   "score": 8,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy8uyo",
   "message": "We fell in love with each other.",
   "created_utc": 1702936709,
   "score": 8,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxqba9",
   "message": "By most measures, they are far more successful than I am.  \n\nThe worst of them is now a teacher at our former high school, and features in a mural not too far from where I live now.  She successfully cast the people who didn't like her as racists rather than as her victims.  She was an equal-opportunity bully, but I remember sitting in the auditorium in junior high listening to her hold forth about how much she hates Mexicans, so I found that bit especially ironic.  \n\nThe others, many of whom I'm now on neutral-to-positive terms with, are mostly solidly middle class, happily married, decent members of society.  The Army knocked the bully out of a few people in between junior and senior year of high school (there was a program where you could enlist, get BMT out of the way, and then start active duty after graduation back then), so that was nice.  Others just matured.",
   "created_utc": 1702930088,
   "score": 7,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxqluc",
   "message": "Cycling in and out of prison. I go to my hometowns inmate roster every once in awhile. He's always on there. Looks like this latest one might cost him a few decades.",
   "created_utc": 1702930193,
   "score": 7,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxs2z2",
   "message": "Well it was my sister's bully and I got suspended from the school bus for beating her up after she slapped my sister. Bullies have tried with me, but it's short lived. 😈",
   "created_utc": 1702930720,
   "score": 8,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxskl1",
   "message": "Nothing. He has a cush job at his daddy's company. He married a girl who was like 19 when we were in our late 20s. He is the biggest fish in that shitty little pond. I don't really know though I don't live there anymore",
   "created_utc": 1702930894,
   "score": 7,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxt4qu",
   "message": "I only really had one bully growing up. Though there were others who definitely engaged in some bullying behaviors, she was the only one who really and truly directly and purposefully targeted me. It was mostly verbal and social, but it did get physical a few times. For the most part she made fun of my weight, my clothes, and my body odor. I was poor and going through early puberty and nothing combats that smell in the first few months. \n\nLast I heard she's a nurse now which just fucking figures lmao",
   "created_utc": 1702931094,
   "score": 6,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxwg6b",
   "message": "My elementary bully was one of those girls who insisted she was cute, popular, and the best at everything, so everyone else should go to hell. I mean, she would try to suck me into all these sorts of contests that were so pointless and meaningless because it would be me against her and her two best friends. Singing contest? Her friends vote for her. Beauty contest? Her friends vote for her. In other words, stupid stuff that people like me should never be subjected to. It was humiliating for me, especially since I didn’t want any part of it, and on top of that it hurt my feelings all the time because they had zero respect for me whatsoever.\r  \n\r  \nFast forward ten years.\r  \n\r  \nI received a call just a couple of months ago. I had no clue who she was (I still don’t quite remember her or all the atrocities she forced on me), but she knew me. She even introduced herself as the girl who bullied me constantly. Turns out, she has no friends, she dropped out of high school, and has no future to look forward to. She said she needed a friend because her friends had ditched her, and she was so ruthless to everyone else in school that no one wanted to even be around her. So, without even apologizing for anything she did as a child, she asked if we could get together sometime for coffee or lunch and we could chat and catch up. I told her I’d think about it, and hung up. I have not, and will not, call her back.\r  \n\r  \nI might be rude for doing so, but she really fucked things up as a kid. She’s learning now just what kind of hellish fury she unleashed on everyone, as what goes around comes back around.",
   "created_utc": 1702932276,
   "score": 7,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy2myv",
   "message": "Still the ugly fat c\\*nt he always was, only now he's a balding fat c\\*nt. \n\nIt's not all bad though, his hair isn't the first thing that has ran out on him. Just ask his dad...........if you can find him.",
   "created_utc": 1702934468,
   "score": 8,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxuv6z",
   "message": "You all just had one? I went to a redneck/hillbilly school and I assume they’re all doing redneck/hillbilly shit. I’m sure if I were on FB I’d know but for the most part I don’t care.",
   "created_utc": 1702931715,
   "score": 6,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy23eo",
   "message": "He joined the Marines before me. I joined a year later. We're now friends, he lives in Buffalo and I live in Rochester. The Marine Corps bonded us together. When I was probably 14, him and a bunch of other kids threw me in a dumpster and then locked it. I was stuck in there for about a half an hour. It was during the summer, it smelled absolutely disgusting, and I could hear them laughing knowing that I was suffering.",
   "created_utc": 1702934279,
   "score": 5,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy7cuw",
   "message": "Got brain cancer and died. Yes, really.",
   "created_utc": 1702936161,
   "score": 6,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxvisg",
   "message": "It's a long story, but the TL:DR version is a I slept with his GF. Kind of an Uno reverse card from what you see in porn I guess lol",
   "created_utc": 1702931947,
   "score": 10,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrq1u",
   "message": "Nothing. Don’t even know what became of them after high school.",
   "created_utc": 1702930592,
   "score": 5,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrzbd",
   "message": "2 died to drug overdoses before graduation, one of which being 2 weeks after a suspected arson.",
   "created_utc": 1702930685,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy2rao",
   "message": "Saw one last year at a somber occasion. Later in the day he walked up behind me, tapped me on the shoulder and told me his name. I told him I remembered his name and asked him how he had been. Used to see the sister and cousin of some of the other bullies occasionally. We would speak and keep it moving",
   "created_utc": 1702934511,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy7ty8",
   "message": "Both dead. One from an OD, the other put a gun to his head.",
   "created_utc": 1702936333,
   "score": 5,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxv1qj",
   "message": "He died",
   "created_utc": 1702931779,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxw8oe",
   "message": "One of my bullies actually got arrested, I almost didn’t believe haha. He and his wife were conning marriage couples: they would fake owning an event management company, take the couples cash and never show up at the day of the wedding. Made the local news and all. That was a nice day.",
   "created_utc": 1702932203,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxwyu0",
   "message": "Hopefully they're living under a bridge somewhere.",
   "created_utc": 1702932458,
   "score": 5,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy0bds",
   "message": "He failed high school",
   "created_utc": 1702933643,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy51uj",
   "message": "Scamming. Most recently been committing securities fraud with her slimeball partner. The SEC and the IRS are after them and hopefully will get them.",
   "created_utc": 1702935335,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy57vr",
   "message": "Running a crypto scam",
   "created_utc": 1702935393,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy5wn2",
   "message": "Years later I heard after high school, while at a party he was doing whippets, had a heart attack right then and there and couldn't be resuscitated.  \n\nDude was a total asshole but I still bad for his family.",
   "created_utc": 1702935639,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy6b53",
   "message": "I just looked up my old bully/best friend.\n\nShe has had a career doing tattoos (more than one it seems), dabbled in modelling, has an OF and has had so much plastic surgery, I wouldn't even recognize her if she came up to me to say hello.",
   "created_utc": 1702935784,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy7ztu",
   "message": "Drank himself to death while rushing a fraternity. Didn’t even make it back to his dorm, just passed out in the dirt on the way back and never woke up. \n\nA fitting end to a massive prick, burn in hell cunt.",
   "created_utc": 1702936391,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy9ko3",
   "message": "Still my mother, still refuses to acknowledge she was my bully, while insisting I was bullied at school by other kids (I wasn’t)",
   "created_utc": 1702936973,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdyagh0",
   "message": "Got hooked on drugs and alcohol, in and out of rehab, and just an all around mess. Eventually, he illegally crossed a busy road at like 4am and got hit by a car and died. He was only 27. I didn’t find out about it until years later as I had moved to a different part of the state. Even though he made my early years in high school an absolute nightmare, I still feel bad about what happened to him.",
   "created_utc": 1702937301,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxowv8",
   "message": "Last saw one of them working at a BBQ restaurant",
   "created_utc": 1702929587,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxsdqj",
   "message": "No idea 🤷‍♂️",
   "created_utc": 1702930827,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy4a9n",
   "message": "Mine ended up asking me out of a date years after we graduated. \nI said no. \nI’m not sure what he’s doing now.",
   "created_utc": 1702935058,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy6u8n",
   "message": "my mom is doing really well. my dad isn’t doing well.",
   "created_utc": 1702935975,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy6xfr",
   "message": "Died of an overdose",
   "created_utc": 1702936007,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy8a1m",
   "message": "Opiates, mostly.",
   "created_utc": 1702936497,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy8qmh",
   "message": "Redneck cop in Georgia.\n\nGo figure.",
   "created_utc": 1702936664,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy8zqg",
   "message": "I don't know, but they were all from rich families, so they're probably rich and healthy. I did try to find out a couple times, but they were mostly girls, so they've probably changed their names.",
   "created_utc": 1702936758,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy9fhu",
   "message": "She frequently appears in the paper for drugs, theft, drugs, fighting, drugs, failing to pay child support, drugs, missing court dates, and possibly drugs. \n\nMy life isn't all I want it to be, but I've never been arrested.",
   "created_utc": 1702936919,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdya3pf",
   "message": "Nothing, he never amounted to anything more than a decent living out in the boonies.",
   "created_utc": 1702937170,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdya5hj",
   "message": "She did prison time for embezzlement.",
   "created_utc": 1702937188,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdyb52y",
   "message": "By the time I graduated high school, she’d had five kids, two sets of twins and one solo, by three different guys. \n\nI remember how she would try to rub her brand new car in my face when I’d stand at the bus stop. Her mom got it for her as a little incentive to finish high school. That lasted a good three months until she got pregnant with the second set of twins. I think she only really completed one year total.\n\nI felt so smug and petty about it for years until I was about the age when one would have a preteen daughter. And it hit me that her parents probably totally fucking failed her long before she turned into my middle school bully. She was 13 and pregnant and I can’t help but think where tf were they? \n\nIdk. I’m not so sure she was totally to blame now. I’ve been feeling more empathy and pity for her, the older I get.",
   "created_utc": 1702937557,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdybv64",
   "message": "Mine died in a car crash. Senior year in HS. Along with 3 other students. Joy riding in the dark, hit a tree.",
   "created_utc": 1702937834,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdycfjv",
   "message": "In hindsight, I was the bully more often than not. Kids didn't like me 'cause I'm weird (turns out I'm autistic). Led to frustration and aggression when trying to make friends. The girls my mother made me think were mean actually had nothing wrong with them. The 'popular' kids just had friends and I didn't. Everyone I've found on social media turned out okay.",
   "created_utc": 1702938044,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxwmzq",
   "message": "I never felt the need to keep track of anyone I went to school with, let alone the bullies, but I did hear that one of them joined the local police force. Frankly, that tracks, given that the cops in my hometown are notoriously malicious and bigoted.\n\nBonus bully story; the cretin who orchestrated my getting fired from my job was promoted to manager, and later arrested for embezzlement.",
   "created_utc": 1702932343,
   "score": 4,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrd39",
   "message": "I've never yet had a bully, tho when one dude was mocking me around school I almost punched his lights out\n\nI screamed at him, dude ran away as a swuirrel",
   "created_utc": 1702930463,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxvl97",
   "message": "My mom moved back home",
   "created_utc": 1702931972,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxwj1d",
   "message": "They’re all mostly doing fine or very well for themselves. Popular, mean high school kids tend to be outgoing and social, and that seems to translate into real-world success.\n\nThis whole trope of bullies turning into losers never really tracks in my experience.",
   "created_utc": 1702932304,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy50i4",
   "message": "No idea. She’s probably living her best life.",
   "created_utc": 1702935321,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy96mf",
   "message": "Who the hell knows. Hope I never see them again",
   "created_utc": 1702936829,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdyah7o",
   "message": "The only person who tried ended up in hospital with a broken arm, I’d like to think he’s still there but probably not, it was over 25 years ago.",
   "created_utc": 1702937309,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdycgjz",
   "message": "She died. She didn’t turn into a very good person, but she didn’t deserve to die as she did. It was quite terrible really.\n\nHaving said that, if the same happened when we were both teenagers I would have spit on her grave. Now I just feel sad she will never get to be any more than 28 and will never get to grow into someone amazing. She had a lot of talents, but a lot more hate.",
   "created_utc": 1702938054,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdz1vne",
   "message": "Fortunately for them they all went onto to have extremely successful lives and families. While I’m still having to heal from the trauma and a recovering addict. (I’ve sober for right under 3 months)\n\nI don’t have any ill feelings towards them and I’m glad they’re all living successful lives but it does suck that victims always have to heal from it and deal with the trauma while the bullies can go on with no consequences for their actions.\n\nI hope we can all heal from the trauma that we didn’t deserve :))",
   "created_utc": 1702948271,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdz2qcu",
   "message": "He's sitting in my chair typing this comment. I've always been my bully. Never been good enough. No confidence, No friends, mediocre looks, average intelligence. Dont feel bad for me, I'm almost certain it's all self created problems.",
   "created_utc": 1702948618,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdz36nw",
   "message": "Shot and killed by the police. Shoulda put down the knife, Ray. On second thought, fuck you, Ray.",
   "created_utc": 1702948805,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy8umn",
   "message": "A lot of them got fat",
   "created_utc": 1702936705,
   "score": 2,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxtso1",
   "message": "They all became cops.",
   "created_utc": 1702931331,
   "score": 3,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy36mc",
   "message": "Smoked himself to death with crack.   Good riddance ernest",
   "created_utc": 1702934663,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdys5lu",
   "message": "One dropped out of high school and tried to make a band that went nowhere. Another was in and out of prison a bunch and daddy was a lawyer so he kept getting off until he assaulted his girlfriend. Third came out as lesbian (we all knew at 10 years old) and apparently had a botched transitional surgery.\n\nHere I am working in Healthcare getting my 2nd degree and saving to buy a house in a couple of years, so I feel all turned out as it should have.",
   "created_utc": 1702944252,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdysiow",
   "message": "Fuck 'em. Don't care if they grew and learned, I barely have time to keep up with people I care about, let alone ones I couldn't give less of a shit about.",
   "created_utc": 1702944401,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdytlfp",
   "message": "I honestly forgot about their existence, so I ended up taking a look at their FB pages. \n\nOne seems to have fallen off the grid. Last I recalled she had bought a house with her husband. The thing I always found odd about her is that she always talked about wanting to go into special education, but was such a bully. \n\nThe other seems to still be living in our hometown and I don't know what she's doing, but it's aged her like 15+ years.",
   "created_utc": 1702944846,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdyulsh",
   "message": "Almost universally (it was a big group of popular girls) they went into marketing/business admin type jobs, all got married late 20s in what seemed like the same two year span, their parents bought them houses in the same suburb we grew up in, all had their first kid around 30 and are now having more, and post a lot of Instagram pictures of them drinking wine together and becoming the next generation of rich suburban moms.\n\nOne girl who bullied me in middle school actually changed a lot in high school, we were two of the only 4 girls in our grade 12 computer science class and we became friends.\n\nMy class went through some real shit in high school though (a lot of student deaths) so I tend to give the people I went to school with the benefit of the doubt that they became better people.",
   "created_utc": 1702945265,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrbux",
   "message": "I'm the bully. \n\nAnd I'm doing great, thanks for asking.",
   "created_utc": 1702930450,
   "score": 254,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxlhoi",
   "message": "Not so much a bully as someone I fought (and beat) multiple times. Motherfucker was just obsessed that he could beat me and I would do things like kick him in the mouth AND HE WOULD COME BACK FOR MORE. He got smashed flat between two cars while working as a volunteer fireman and no one went to his funeral.",
   "created_utc": 1702928364,
   "score": 0,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxq1s1",
   "message": "No education and hes being a dumloser",
   "created_utc": 1702929994,
   "score": 0,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdy0ggh",
   "message": "He's dieing, but someone is bailing him out with a kidney transplant.",
   "created_utc": 1702933693,
   "score": 0,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdz2xiq",
   "message": "I was a bully lol. And my life is great.",
   "created_utc": 1702948700,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxpckz",
   "message": "There\\`re scary to get outta there homes LMAO",
   "created_utc": 1702929743,
   "score": 254,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxp08u",
   "message": "Nothing.  Yet...",
   "created_utc": 1702929620,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxpjo0",
   "message": "Last I saw she was posting pictures of the sky on Instagram.",
   "created_utc": 1702929813,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrq2o",
   "message": "My adult bullies are living excellent and prosperous lives.",
   "created_utc": 1702930592,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxrxl7",
   "message": "He’s a cop in my city, ran into him once with a bunch of old high school classmates. Couldn’t tell if he remembered us.",
   "created_utc": 1702930667,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxt97k",
   "message": "All his victims were no longer around after school ended, so he found a new one in the mirror.  This victim could never leave and wasn't very good at putting up a fight.  Good friends convinced him to stop treating himself like shit.  Living with people in social work made him realize he had treated others like shit.  Sorry Chris.",
   "created_utc": 1702931137,
   "score": 1,
   "submission_id": "18lgudu"
  },
  {
   "comment_id": "kdxx2mo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18lgudu"
  }
 ]
}