{
 "submission_id": "18lgid7",
 "title": "Why did you stop shopping at Walmart?",
 "selftext": "",
 "created_utc": 1702926067,
 "permalink": "/r/AskReddit/comments/18lgid7/why_did_you_stop_shopping_at_walmart/",
 "score": 254,
 "url": "https://www.reddit.com/r/AskReddit/comments/18lgid7/why_did_you_stop_shopping_at_walmart/",
 "comments": [
  {
   "comment_id": "kdxrtdz",
   "message": "I stopped shopping at Walmart because my \"quick grabs\" turned into accidental shopping sprees.",
   "created_utc": 1702930625,
   "score": 86,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxm1lz",
   "message": "the people man, honestly the people... the amount of crazy things you see there",
   "created_utc": 1702928561,
   "score": 28,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxgxut",
   "message": "They quit staying open 24 hours. The only reason to go to Walmart was because it was the only place open late at night. Now, I have to go to Walgreens instead.",
   "created_utc": 1702926755,
   "score": 87,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxge82",
   "message": "I moved closer to a target and the walmarts that are kinda near by me look rough and dirty.",
   "created_utc": 1702926558,
   "score": 52,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdximj0",
   "message": "I could afford to go elsewhere",
   "created_utc": 1702927351,
   "score": 37,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxtepv",
   "message": "\r  \nI stopped shopping at Walmart because my couch started giving me judgmental looks every time I brought home another 48-pack of toilet paper. Plus, my fridge filed a restraining order against any more bulk purchases of cheese.",
   "created_utc": 1702931192,
   "score": 80,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxkaru",
   "message": "Catch all answer is because it’s anxiety inducing. Kids are out of control, people don’t give a fuck, nothing is ever stocked and the lines are outrageous. \n\nReal answer is that their “fresh” food is hyper processed. The meat doesn’t move or cook like meat from smaller stores, things don’t rot at the proper rate, everything feels plastic. So we only go to Walmart for emergencies. \n\nI stopped shopping there in 2012ish. I just don’t support anything about that company.",
   "created_utc": 1702927940,
   "score": 115,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxv5zi",
   "message": "I am a pretty mellow guy. But everything about the Walmart experience puts me in a shitty mood so I stopped going there for my own well being. \n\nBecause I can't even drive into the lot without having to deal with some dumb ass who doesn't understand how lanes work, or has decided that the best way to drag himself and his family across a busy parking lot is by taking up the entire lane like they're playing Red Rover with oncoming traffic. \n\nBecause once I'm in the store it's a gauntlet of people who have chosen to just park their karts in the isle and stake a claim.\n\nBecause their produce is gross. \n\nBecause I've been sneezed on no less than 5 times in the past 8 years while in a Walmart.   \nWhich isn't a lot but higher than the 0 times it's happened everywhere else I go. \n\nBecause it's faster to have my electronics delivered than to try to hunt down an associate with a key.\n\nBecause the clothes I've bought there, while cheap, have all fallen apart within a year or two.\n\nBecause no matter which line I decide to go to, the person in front of me is always trying to cash a cheque, or is digging through their phone book worth of coupons, or is doing something other than paying for their shit.  \n\nThere are better places to do your banking and if you're going to use coupons the time to have that shit out and prepared for use was before you got in line.",
   "created_utc": 1702931820,
   "score": 34,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxfpew",
   "message": "Well, turns out I prefer my shopping experiences without the exclusive soundtrack of screaming children and rogue shopping carts at Walmart.",
   "created_utc": 1702926313,
   "score": 131,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxgx6l",
   "message": "Treat their employees like crap, devastate the local/small biz economy, hurt states by overwhelming the medicaid rolls with their employees, and most of their stuff is cheap Chinese garbage.\n\nFun fact- target is about the same as Walmart, except they wear red vests and have convinced us they're higher quality",
   "created_utc": 1702926748,
   "score": 247,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxtfq8",
   "message": "It's just too much. Overstimulating. Long lines, crowds, the smell, the people, the parking lot.",
   "created_utc": 1702931203,
   "score": 31,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxvzxe",
   "message": "I stopped going years ago when they pivoted from bragging about how many American jobs they’d saved to bragging about buying most of their inventory from China.",
   "created_utc": 1702932116,
   "score": 23,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxf64g",
   "message": "I feel like I need to get a hepatitis or tetanus shot after I visit there",
   "created_utc": 1702926121,
   "score": 56,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxru7o",
   "message": "I'd rather pay a higher price for the same item to shop at a cleaner more professionally ran store than the shithole most WalMarts have turned into.  Oh and the people.  Well, mostly the people.",
   "created_utc": 1702930633,
   "score": 21,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxh9s3",
   "message": "The layout of the store is very anxiety inducing.",
   "created_utc": 1702926874,
   "score": 54,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxfobg",
   "message": "Physically going there is like a live action Jerry Springer Show experience.  I live in a pretty nice area, yet Walmart somehow attracts every piece of trash in the area.\n\nOrdering online is exceedingly rare, since most places have the same prices and better deals.",
   "created_utc": 1702926302,
   "score": 77,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxla0o",
   "message": "Oh, why did I stop shopping at Walmart? Well, let's just say my wallet and I finally agreed on a truce. Every time I walked into Walmart, it was like entering a magical realm where I suddenly 'needed' things I never knew existed. A quick trip for milk would turn into an expedition for camping gear, a new blender, and three kinds of cheese I can't pronounce.",
   "created_utc": 1702928288,
   "score": 55,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxtb6c",
   "message": "Cause the owners are shitty people who won’t pay their employees a living wage",
   "created_utc": 1702931157,
   "score": 11,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxhpdh",
   "message": "Meijer is better",
   "created_utc": 1702927026,
   "score": 11,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxpqn8",
   "message": "The fucking self-checkout support employees are vicious. and aggressive. They will violate your personal space and demand you empty all your bags to prove you scanned everything. They are mean and make everyone stressed out and feel like shit. \n\nIf I have to get something from Walmart I order it to avoid their employees.",
   "created_utc": 1702929883,
   "score": 8,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxt9zt",
   "message": "The shitty customer service , lack of stocked shelves, not my job attitude of the workers the oppressive as hell atmosphere… Perhaps it’s just my local Walmart",
   "created_utc": 1702931145,
   "score": 12,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxz11y",
   "message": "I have never been to a prison commissary, but one day as I was leaving, I realized that's what I hated about Walmart the most: The atmosphere is oppressive because the customers are all treated like criminals. Everything more than $20 is under lock and key, there are always cops on guard out front, you can't get a shopping cart without a cash deposit.",
   "created_utc": 1702933185,
   "score": 9,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxo9h8",
   "message": "I realised that I could just use a mixture of door dash and amazon prime to save me needing to go anymore",
   "created_utc": 1702929354,
   "score": 36,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxuyw2",
   "message": "I feel soiled after leaving that place.",
   "created_utc": 1702931751,
   "score": 10,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxkq3l",
   "message": "Quality and availability of products is shit compared to Target. Also the employees are far better at Target.",
   "created_utc": 1702928092,
   "score": 17,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxgugw",
   "message": "The crazy people that shop there when I happen to go, and the employees having such an attitude, even though they are getting paid to stand there while I be my own cashier. And I do mean stand there because our local Walmart, there is only one cash register and that’s the register that sells tobacco. It’s just a giant sea of self check out machines. Oh yeah and they close at midnight now? I’ll take my business elsewhere.",
   "created_utc": 1702926720,
   "score": 9,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxkrmh",
   "message": "Unkempt displays, high and narrow isles. It feels like shooting down the death star.\n\nOut of date food. Improper price labels. Far too many people acting out. Self checkout is buggy.",
   "created_utc": 1702928107,
   "score": 8,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxpgj6",
   "message": "They stopped being open 24/7. The only time I liked to go was 2-3AM",
   "created_utc": 1702929782,
   "score": 6,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxuocy",
   "message": "It made me feel dirty, the actual store was always dirty, and the hassle shopping was not worth the savings.",
   "created_utc": 1702931647,
   "score": 7,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy75wn",
   "message": "Because they're horrible for everyone involved.\n\nThe American employees at the stores, the Chinese laborers who make the stuff and deal with the pollution, the other businesses that Walmart kills, and the people who get shitty products out of it.  I'm probably missing a few reasons.\n\nThey're only good for the billionaires at the top and perhaps the CCP officials that take their cut off the profits from the manufacturing.\n\nFuck Walmart.",
   "created_utc": 1702936091,
   "score": 9,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxhzts",
   "message": "Move to a country where they don’t have Walmart",
   "created_utc": 1702927130,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxk3qh",
   "message": "Small town here, I seemed to run into people from high school when I would go. Forced small talk with people I didn’t associate with is why I stopped going.",
   "created_utc": 1702927871,
   "score": 8,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxu7im",
   "message": "Because it's the devil's asshole.",
   "created_utc": 1702931478,
   "score": 8,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxwdel",
   "message": "The clientele. I got hit up for a buck (or more) before I go in the store, then in the aisles by a woman who didn't have enough for diapers, then on the way to the car. The entire time worried about purse snatching.\n\nAnd everything is locked up. I will go buy my overpriced Dawn Platinum and cat food at Costco or Krogers.",
   "created_utc": 1702932249,
   "score": 7,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy3n9m",
   "message": "We stopped shopping there because the whole store is a trainwreck. It was messy, nothing was where it was supposed to be, prices didn't always match the item at the register, and employees looked absolutely miserable there. If your employees aren't happy, the store goes to shit. Moral of the story is: always take care of your employees, and the rest will follow.",
   "created_utc": 1702934828,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxk68w",
   "message": "Too many stupid people around",
   "created_utc": 1702927896,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxrp6f",
   "message": "The closest one to me I believe is the most shoplifted walmart in the nation.  I literally do not feel safe even going into the parking lot with out a pistol on my person.  Cops killed a dude right in front of the entrance not too long ago.  I think I'd feel safer getting dropped off in the middle of Mogadishu wrapped in only an American flag.",
   "created_utc": 1702930583,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxynfc",
   "message": "Because I got tired of getting carded when I buy alcohol. I'm a 57 year old man with white hair. The \"rule of thumb\" or whatever you wish to call it, is 40 in Indiana. I haven't looked under 40 for 20 years. It's bad enough I have to check myself out. It's worse when I have to show my i.d. to the 70 year old self check out monitor. If anybody knows I'm 21, it's someone like that.",
   "created_utc": 1702933053,
   "score": 4,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy1h9i",
   "message": "I didn't like how it made me feel. Like shopping in a physical representation of all that is wrong with materialism and disproportionate wealth transfer.",
   "created_utc": 1702934058,
   "score": 6,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy813y",
   "message": "Because theyre a trash corp that has destroyed the middle class and mom and pop shops in this country. I have never shopped there.",
   "created_utc": 1702936404,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxpjwn",
   "message": "Because I live 9000km away from the nearest Walmart",
   "created_utc": 1702929816,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxsk7f",
   "message": "The people of Walmart. People just go crazy in there. It’s a phenomenon that should be studied. And too many blasts from the past. You’ll run into your 3rd grade principal who paddled you for talking. Or your old weed dealer who stole your Adderall. The mom of your psycho ex. Once they stopped being 24 hours it’s just too risky. I shouldn’t have to carry a knife to buy cotton balls.",
   "created_utc": 1702930890,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxtyn7",
   "message": "They don’t have enough check out line open or baggers.",
   "created_utc": 1702931390,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxzpsn",
   "message": "The closest Wal Mart to my house is like a third world country.  \n\nIf I do need anything I just order online.",
   "created_utc": 1702933430,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy3aug",
   "message": "Because I'm surrounded by cheap products and ridiculous people.  Honestly, Walmart has become a real life experiment in Poe's Law.  Is Walmart really full of such bizarre people?  Or do bizarre people flock to Walmart because that's where they think they belong?\n\nI have a Walmart 10 minutes from my house, but I'll gladly drive the extra 20 minutes down the highway to go to Target where at least I don't feel like I'm at the zoo.",
   "created_utc": 1702934705,
   "score": 4,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy3l1v",
   "message": "Where I'm at Walmart isn't any cheaper than the stores I do go to, and I heard a lot of bad stuff they don't want you to know from someone that worked there for a few years. \n\nPlus it's the biggest crime magnet in the area.",
   "created_utc": 1702934806,
   "score": 4,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy5l19",
   "message": "It’s the people. They tend to be loud, obnoxious, they smell terrible and they always have their kids with them.",
   "created_utc": 1702935524,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy94pl",
   "message": "Two registers open with fifty people waiting at self checkout.",
   "created_utc": 1702936809,
   "score": 4,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyi2x1",
   "message": "My son tried on a shoe and found a broken crack pipe inside of it. We told one of the workers, and the could not care less.",
   "created_utc": 1702940183,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxnu24",
   "message": "I'll never stop shopping at Walmart - it's my guilty pleasure :-",
   "created_utc": 1702929200,
   "score": 10,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxit1a",
   "message": "The sights and the smells.",
   "created_utc": 1702927414,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxox59",
   "message": "It's just the experience. I will gladly pay an extra $.75 for that pound of ground beef at my local supermarket, where aisles aren't clogged with overflowing pallets and littered with pallet wrap. I'll pay an extra 50 cents for that bottle of aspirin at the supermarket if it means I don't have that stupid high-security monitor beeping at me every time I walk past. I want to shop somewhere that doesn't feel so depressing and poorly maintained.",
   "created_utc": 1702929590,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxrjhw",
   "message": "I was afraid of being featured in a \"people of Walmart\" post.\n\nPlus their corporate welfare bs. I prefer to support employee-owned Winco and other companies that treat their employees well, like Costco.",
   "created_utc": 1702930527,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxzd2s",
   "message": "I got a Costco membership.",
   "created_utc": 1702933303,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy04gh",
   "message": "The usual stuff:\n\n• Unfair treatment of staff (with regards to fair hourly wages and PTO)\n\n• many of their products have been linked to slave-labor or far below minimum wage pay in third-world countries \n\n• They only sell censored music\n\n• The people who shop there are scary af",
   "created_utc": 1702933575,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy0qyy",
   "message": "Because it's gross and the employees don't give a damn.",
   "created_utc": 1702933798,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy0rj5",
   "message": "Walmart has shitty low quality products all around.",
   "created_utc": 1702933804,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy42e5",
   "message": "I haven't completely stopped but there are many reasons I avoid Wal Mart.\n\nThey stopped being open 24 hrs.\n\nThey stack pallets of merchandise in the center of the main throughfare isles so you cannot make a left turn.\n\nThe people who don't stay to the right of the lanes. Probably because of the goddamn pallets.\n\nThe amount of people in the checkout lanes that are understaffed.\n\nAlways waiting for a manager to scan my beer purchases because they have minors working the only 2 open checkout lanes.\n\nWorkers picking online orders are in the way everywhere now.\n\nDirty parking lot.\n\nShitty carts.\n\nSlow bottle return machines.\n\nThey don't carry Rotella 15W40 in quart bottles anymore and I can only get it at the Meijer gas station.",
   "created_utc": 1702934978,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy4wxp",
   "message": "The last time I was in a Walmart a middle aged man tried to start a fight with my 15 year old son and his friend.  These boys are 6'2\" and 6'5\".  It would not have ended well for the aggressor.  So, although I wasn't worried about the boys, I was quite disgusted.",
   "created_utc": 1702935287,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy5bgv",
   "message": "I've never shopped at Wal-mart.",
   "created_utc": 1702935429,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy5hyi",
   "message": "I never started shopping there, they don't exist in my country.",
   "created_utc": 1702935493,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyg7xe",
   "message": "Gross\nCheap and Chinese\nDon’t like their politics\nBye!",
   "created_utc": 1702939470,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyh4d8",
   "message": "Because they have one cashier, 10 self checkouts and a hour long wait to checkout. \n\nThe entire experience is gross and the products are cheap. We only go there to get my husbands work pants.",
   "created_utc": 1702939817,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyhkib",
   "message": "Because the Walton family are domineering, anticompetitive, small-business crushing bastards.",
   "created_utc": 1702939987,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyi7y6",
   "message": "I can't stand the smell of all that off-gassing plastic.",
   "created_utc": 1702940237,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyjbk6",
   "message": "Because they refused to sell Eminem albums after they ran every small record store out of business.\nThey treated their employees  terribly  and paid horrible.  Haven't been  in one since 2001",
   "created_utc": 1702940666,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyjwiu",
   "message": "It's been 10 years for me. I stopped for principal issues. I hate that all the small mom and pops are gone because Walmart moved in.",
   "created_utc": 1702940897,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyk2f7",
   "message": "Self checkout was the final straw for me. I’ve always hated that dump and only went when I “had” to. Now that I’ve quit going all together, I’ve realized that I never need to.",
   "created_utc": 1702940962,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyk5g2",
   "message": "Too many entitled, belligerent people.  No couth. It's a shit-hole.  I buy online almost exclusively.",
   "created_utc": 1702940996,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdykiap",
   "message": "It's just too sketchy. Sketchy parking lot, sketchy people inside, I just avoid it. Nothing but riff raff go to my local one.",
   "created_utc": 1702941140,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyl0qr",
   "message": "Too many shady people in my town go there, used to roll with a different group.",
   "created_utc": 1702941345,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyl7rw",
   "message": "I feel hopeless about the world when I leave.",
   "created_utc": 1702941424,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxhdxk",
   "message": "They don’t take Apple Pay in store",
   "created_utc": 1702926915,
   "score": 10,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxf6dv",
   "message": "because target is better",
   "created_utc": 1702926124,
   "score": 11,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxkhi6",
   "message": "Trying to avoid hitting carts in the parking lot while trying desperately to find a good parking spot. Then having to test 3 or 4 carts before finding one where all wheels turn. Then having to navigate my way down an aisle with a bunch of people in my way, including the employees picking the online orders. And let’s not forget the 20 min wait to checkout.",
   "created_utc": 1702928007,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxr6ex",
   "message": "Cause it's too hard to shoplift there these days, man",
   "created_utc": 1702930397,
   "score": 4,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxq3yp",
   "message": "It's nowhere near me and always require a 50 minute drive :\\\\ \n\nUsed to love shopping from them online but their website os bullshit right now. It takes so much looking to figure out which one is actually a ship-to-home\n\nGave up on them. Buy everything in store and I honestly love this life",
   "created_utc": 1702930016,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxq543",
   "message": "I just started shopping again as their food is cheaper and way more selection - especially the sugar free/keto low calories ingredients. I swore I’d never go back but I’ve seen more normies as of late",
   "created_utc": 1702930027,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxqp06",
   "message": "Because buying everything online is usually so much easier.",
   "created_utc": 1702930224,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxr4ff",
   "message": "The lines were always long. Not worth my time.",
   "created_utc": 1702930378,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxrsvb",
   "message": "Lot of tweakers there at 3am",
   "created_utc": 1702930619,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxsx4b",
   "message": "I still go occasionally if I'm looking for something cheap but Meijer, Kroger, and Aldi are cleaner and usually have better deals. I might spend a little more in the long run but the quality of the products and shopping experience are worth the switch.",
   "created_utc": 1702931017,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxtfhe",
   "message": "Cause amazon is easier. But just as bad if not worse of a company",
   "created_utc": 1702931200,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxu99w",
   "message": "The last one closed 2006 in Germany and in Switzerland Walmart never opened one…. 🫤 So I guess that’s the reason for not shopping there.",
   "created_utc": 1702931495,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxzby6",
   "message": "Everything locked up. Need to find an associate to unlock everything. Hell no",
   "created_utc": 1702933292,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy1qju",
   "message": "Because I was fired after reporting sexual assault on the clock because the store manager was sleeping with the guy. I had documented what was going on for years with the harassment and it boiled into him SAing me on the clock and the store manager told me that it was my fault. I submitted it to corp and the store manager got a slap on the wrist since it was her time being a store manager. Bullshit.",
   "created_utc": 1702934152,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy87hl",
   "message": "walmart isnt even in my country",
   "created_utc": 1702936470,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdybkqv",
   "message": "Because it feels dirty. The people are gross. Tweekers everywhere, people go to the parking lot to fight or sell meth most people don’t bother to even get dressed and go in PJs, items are always tossed around and disorganized as most the people there lack any respect for anything, kids are running loose everywhere as if it is a playground screaming and rough housing and it is crowded AF. \n\nLiterally the trashiest place in town.",
   "created_utc": 1702937721,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdycrzs",
   "message": "Too big.",
   "created_utc": 1702938172,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdydkkb",
   "message": "I feel so icky in there. The quality of everything is garbage. I feel like everyone is depressed and everyone knows that they are in there by necessity alone. It just makes me feel sad",
   "created_utc": 1702938469,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyqvd5",
   "message": "self check out and empty shelves",
   "created_utc": 1702943722,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxftpu",
   "message": "I would never stop",
   "created_utc": 1702926355,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy0y3k",
   "message": "Because, honestly, anybody working or shopping at a Walmart is something I’d rather not be associated with. \n\nNobody at Walmart is NOT gross. Everybody shopping or working looks like they gave up on life and hygiene years ago. Nobody in Walmart is making smart life decisions. Nobody. \n\nSo, I didn’t wanna be like that and now I’m not.",
   "created_utc": 1702933869,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxoy0k",
   "message": "I didn't. I do 100% of my grocery shopping at Walmart and Sam's Club because I know I'm getting the best value for my money. It's liberating to no longer pay attention to sales, coupons, discounts etc.",
   "created_utc": 1702929598,
   "score": 5,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxf9ma",
   "message": "i dont live with the karen i used to live with so i dont have to go there... plus its so far away",
   "created_utc": 1702926156,
   "score": 3,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxtmta",
   "message": "who stops shopping at Walmart?  if it ain’t at Wallyworld…you prolly don’t need it! 🤣",
   "created_utc": 1702931274,
   "score": 2,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy2nb8",
   "message": "I just started again. My Wal Mart is leaps better than the nearest Target. Target has no male clothes, the baby clothes are just the same carters everywhere, and the grocery section is overpriced and small.\n\nWal Mart rules.",
   "created_utc": 1702934472,
   "score": 1,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdy54px",
   "message": "They smell and the majority of the people who shop there also smell.",
   "created_utc": 1702935363,
   "score": 1,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxm561",
   "message": "They had too many labor violations",
   "created_utc": 1702928597,
   "score": 0,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdycytq",
   "message": "I was never a big Walmart shopper but I go there maybe once a year (if that). I don't like their low quality products. They tend to have messier aisles than say Target. I don't like the type of people Walmart tends to attract either. Also, hot take, I don't think Target is that much more expensive than Walmart. I save 5% and use Target Circle and shop their deals. When you do that, I think the amount you save by shopping at Walmart is negligible.",
   "created_utc": 1702938242,
   "score": 0,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyhv2w",
   "message": "I started making enough money that I could stop going to that god awful place and never looked back.",
   "created_utc": 1702940100,
   "score": 0,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxif91",
   "message": "Got too crowded.  \n\nPrivileged NIMBY's don't like Walmarts, so we get so few Walmarts.",
   "created_utc": 1702927280,
   "score": 1,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdxj45i",
   "message": "At ours they stopped carrying bags so you had to buy their stupid reusable one that you already have but happen to have forgot that doesn't really fit anything anyway. Everyone else sells a cheap bag to use.",
   "created_utc": 1702927525,
   "score": 1,
   "submission_id": "18lgid7"
  },
  {
   "comment_id": "kdyhwnz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18lgid7"
  }
 ]
}