{
 "submission_id": "18m2834",
 "title": "People in IT, what's the weirdest/worst condition you've seen somebody return a company issued laptop/device?",
 "selftext": "",
 "created_utc": 1702993494,
 "permalink": "/r/AskReddit/comments/18m2834/people_in_it_whats_the_weirdestworst_condition/",
 "score": 42,
 "url": "https://www.reddit.com/r/AskReddit/comments/18m2834/people_in_it_whats_the_weirdestworst_condition/",
 "comments": [
  {
   "comment_id": "ke1mnzg",
   "message": "Girl was in a port-a-potty when a huge gust of wind blew it over.  Everything was soaked in that blue liquid, including her company-issued phone.",
   "created_utc": 1702999204,
   "score": 19,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1cv18",
   "message": "Used to work IT for a major university. Had a professor check out a laptop for months at a time.  These laptops are for day use or for travel purposes but this guy always got away with keeping the laptop for a long time. We did yearly inventory so he had to bring it in once a year for us to eyeball or he would get charged for it. When he finally brings it in, it had missing keys and the power cable was frayed. It was scuffed up and had cookie crumbs in the keyboard. \n\nThe facility manager told the guy, \"You need to stop having your kids use the check out laptop.\" The professor swore up and down he didn't let his early elementary kids use it. I pop open the disc drive and find a DVD of a popular kids movie. They guy said nothing for a bit and promised to do better keeping the kids away from the laptop. (He didn't)\n\nWe still weren't able to ban the guy from checking out laptops. (I think he traveled a lot) We just made sure he got the same one each time to limit the physical abuse to one machine.\n\n(This was over fifteen years ago, so tablets weren't a thing and laptops were still a large ticket item)",
   "created_utc": 1702995116,
   "score": 222,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1dalk",
   "message": "My desk was next to the IT guy's at the school I used to work for. He was working on one when I heard him cuss. I looked up and he'd taken the back cover off the computer, and it was packed FULL of bedbugs. Dead ones, live ones... Everywhere. We all abandoned the office for a while so we didn't get them in our stuff. Also so we could barf in privacy.",
   "created_utc": 1702995311,
   "score": 151,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1b2aq",
   "message": "Got a ThinkPad back from the warehouse crew that we retired, saved, and dubbed \"The Blue Collar ThinkPad\"\n\nPeople managed to smoke \"on it\" somehow. I could have rolled a 2nd hand cigarette with all the tobacco that fell out of the keyboard.\n\nThe screen was dim beyond the lowest brightness setting, despite being on the highest, because it was covered in cigarette tar. The webcam made the person in front look like an abstract blur.\n\nBasically, the warehouse crew members used it to do Teams meetings with warehouse crew members at other locations. During the meetings, they'd roll up a cigarette, smoke, and exhale the smoke straight into the screen.\n\nIt smelled like \"heavy smoke.\" \"Light smoke\" is like a \"light twang\" of cig smell. IE: The interior of a car that belongs to someone who smokes. \"Heavy smoke\" is the tar pit stink. The interior of a car that belongs to someone who smokes with the windows up. The blue collar ThinkPad smelled like the latter.",
   "created_utc": 1702994298,
   "score": 182,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1cboy",
   "message": "So I work in electronics recycling and I pickup computers from a bunch of schools and businesses. Basically I pick them up after they get returned to the IT department, so I guess I'm in this category. School laptops are always dirty as hell, keys caked in dirt clearly, they've never heard of Windex. \n\nTeachers almost always its covered in coffee. One time they had those cheap plastic MacBook covers on and they must have just left it sitting in the coffee for weeks because it dried all over the outer case and I'm not talking like thin layer of coffee I'm talking THICK layer. Tablets and phones usually have expanded or exploded batteries to the point the screens popped off the case.\n\nAs for computer cases they rarely ever clean out the inside. Worst one was from a spice company we pickup from and it had dust and cinnamon (at least it smelled like cinnamon) caked up on the bottom higher than the size of my fist so about 5 inches high. Also had cases that looked like they just dropped it down a flight up steps, walked down picked it up, then walked back to the top to repeat the process 5 more time.",
   "created_utc": 1702994872,
   "score": 226,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1vzwh",
   "message": "surface pro 3, that almost the entire back cover was popped off from a swollen battery. \n\nI told this dude for like maybe 4 months that he had to bring it to us - but he was one the important executive people who got to work from home during covid. I was like \"Sir this has great potential to literally explode in your face\" he was unbothered, gave it to us when it wasn't working anymore and he couldnt imagine why",
   "created_utc": 1703002739,
   "score": 202,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1mpxg",
   "message": "First one. Got handed a phone in a ziplock baggie. It was clearly moist and they said that it had fallen out of their pocket in the snow. They handed it over like it was full of the plague.\n\nI pulled my hand back just before touching it and said \"It fell in the toilet, didn't it?\"\n\nThey looked embarrassed and then apologized profusely. I told them to throw it out.\n\nSecond one. Handed another phone and the user proudly said that they accidentally backed over it with their car. I heard later on that they repeatedly ran over it because they wanted an upgraded phone. When we heard that, they got the \"special phone\". A 1998 flip phone that didn't connect to anything.",
   "created_utc": 1702999224,
   "score": 234,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1p154",
   "message": "I’m not in IT, I’m the one who returned the laptop. I used to have stiletto acrylic nails and after using the laptop for about a year my nails removed all the letters on the keyboard. My boss told me the IT people were floored and took pics to share with other IT folks because it was like nothing they had ever seen before. No one was mad, they were just amazed at the damage. I was v embarrassed.",
   "created_utc": 1703000114,
   "score": 222,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1zcxa",
   "message": "1. The person who stole the SSHD and memory out of a laptop then urinated on the device figuring we'd just throw it away and not know.\n\n2. The laptop that came back double wrapped in trash bags and was just left in one of our remote offices by non-IT office staff.  Came in from a long weekend and the bags were all shredded from all of the cockroaches that had hatched and escaped.\n\n3. The laptop that came back single wrapped in a garbage bag and reeked of marijuana and was soaked with cat pee.\n\n4. The iPad someone checked out, then brought back later in the day.  \"I don't know what happened to it!  I swear!\"  Security showed us footage of them dropping it in the parking lot and running over it with their car.",
   "created_utc": 1703003981,
   "score": 149,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke19uuw",
   "message": "I'm not in IT, but I sit near our IT guy so I have seen some of the things he gets.\n\nSomeone went on a business trip to an industry convention, and came back with their laptop in 6 pieces. They claimed that it must have been the baggage handlers but like...no shot.",
   "created_utc": 1702993739,
   "score": 20,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke19k54",
   "message": "I'm very curious because I'm fully remote and finally met my coworkers IRL for a meetup and some of these laptops were in questionable condition.",
   "created_utc": 1702993598,
   "score": 120,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1jfar",
   "message": "Had a chap spill coke on a brand new laptop.\n\nHe then took it upon himself to take it to pieces, breaking the keyboard in the process.\n\nHe then asked me to fix it.",
   "created_utc": 1702997911,
   "score": 113,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1ri0u",
   "message": "I received a latop that was sticky all over with some unknown liquid, missing some keys, and a crack screen. They asked me to look at it because it was slow for some reason.",
   "created_utc": 1703001053,
   "score": 106,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1v7mc",
   "message": "A laptop bent. Imagine a closed laptop that was bent again by 90 degrees. \n\nEnded up happening from a car accident. Surprisingly the data was salvageable too.",
   "created_utc": 1703002447,
   "score": 104,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1w3tj",
   "message": "Off the top of my head:\n\n* When a laptop rejected to be received because it was molded/growing stuff. It was at least partially submerged in a creek for about a week. \n* We had several melted phones from welders. \n* One I just got a zipblock of glass/parts that wasn't recognizable as a phone from it playing Plinko down a tower. Like there wasn't a solid rectangle of parts left. Wear your hardhats and safety glasses people. \n* An upset employee that another employee borrowed their phone and water damaged it by submerging it in sweat in their pocket and it wouldn't turn on anymore.",
   "created_utc": 1703002778,
   "score": 103,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke24e2q",
   "message": "Worked help desk at a college. A professor dropped off a laptop that \"just wasn't working.\" We cracked it open and it was filled with scrambled egg. She said she had no clue how it got in there.\n\nFor a long time, I assumed that she was screwing with us for some reason. My stance now is that this was probably a \"prank\" by one of her students.\n\nAnyway, it was destroyed beyond recovery. I guess that's what happens when you put eggs inside of things that aren't supposed to have eggs inside of them.",
   "created_utc": 1703005806,
   "score": 82,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1ubnw",
   "message": "There was the toilet phone issues when working the geek squad. One lady brought in a phone and said she dropped it in a swamp. There are no swamps anywhere in this part of Texas. IT smelled like poo so I told her we would not be taking it and she would need to purchase another. \n\nThe other was a laptop some lady had us work on. She came back like a year later and claimed we screwed up her PC. It smelled HORRIBLY of astroglide. Yes I know what It smells like. I fuck. \n\nWe told her we couldnt accept it. She came back with her husband. I took one look at him and said. \"Well I know why it smells like it does now.\" He laughed. She was glaring at me and my manager was confused. I refused to tell him until after I quit working there.",
   "created_utc": 1703002117,
   "score": 153,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1uqzh",
   "message": "I had someone bring a laptop in that was literally growing moss. The thing still worked. I think it was an IBM Thinkpad come to think of it back in the early 2000s. I really didn't want any to work on it but had to because you know, I needed the money.",
   "created_utc": 1703002275,
   "score": 73,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke225uy",
   "message": "Used to be in support at a company with many full-time travel employees. They were all issued Surface Pro devices. Someone had an issue that after troubleshooting, required them to send the device in to us. They mailed it in a manilla envelope. Not a padded mailer, but a completely unpadded 12\" envelope like you might pass a birthday card around in at an office. I can only describe the condition it arrived in as \"the most broken screen I have ever seen\".",
   "created_utc": 1703004995,
   "score": 72,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke26gtd",
   "message": "We had a director who was basically a one man laptop wrecking ball.  We'd give him a shiny new laptop, and a few months later he'd come back with it totally destroyed.  I don't know if he was clumsy or just had a bad temper, or stored it on a rope dragging behind his car, or what.  All I know is, every 6 months we issued the guy a new laptop and the destroyed ones became parts machines or, occasionally I was able to fix it up enough to issue to someone else.  If he was anything lower than a director level employee he would have been told deal with it for 3 years until you're due for an upgrade.",
   "created_utc": 1703006550,
   "score": 63,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1mpoq",
   "message": "Little German roaches.  Straight into the e-waste pile with that one.",
   "created_utc": 1702999221,
   "score": 49,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1wxmd",
   "message": "Damn, I thought I was coming in pretty hot with \"run over with their own car with coffee spilled in it too\" but looking at these other comments it's clear I've been bested.",
   "created_utc": 1703003083,
   "score": 52,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke23e2x",
   "message": "I worked for a company that manufactures a shitload of household products, so it wasn't unheard of to have a laptop come back that had some chemical or another spilled into it.\n\nBest one was when a user put the laptop in the same bag of personal lubricant that wasn't sealed very well. It was covered in slime and the user dropped it twice trying to bring it to us, and two of our techs dropped it as well",
   "created_utc": 1703005442,
   "score": 53,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke24e2m",
   "message": "We had one come back smelling of cat piss cos his cat indeed pissed on it. It still worked fine he just wanted to trade it for another. \nA desktop we had come back cos it didn’t work and it smelt a bit off.  We opened up and promptly discovered the long long dead remains of a mouse inside. Like dead so long it basically turned to dust when moved. The engineer who opened it threw up. We had to clear half the floor whilst facilities tried to clear the smell.",
   "created_utc": 1703005806,
   "score": 48,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1yqow",
   "message": "Laptop overheating and went to diagnose. Found a cat's worth of cat hair under keyboard. Asked why. 'She sleeps on it'\n\nWhy do you let your cat sleep on a company laptop?",
   "created_utc": 1703003754,
   "score": 84,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1thl6",
   "message": "I used to work for a Native American Health clinic on a reservation as a low level help desk guy. We also worked on the computers for the Tribal administration offices this also includes the Tribal leadership. \n\nWell the Chairman of the tribe had us preorder an iPhone 6 so he can get it the day it released. He broke it within 48 hours and demanded a new one it couldn't be his old iphone 5 it had to be a new one. I called my boss and told him the situation and I could face the feel him facepalming. \n\nI called around and found the Apple store two hours away only had one phone available my boss told me not to worry about it and made the Tribal Administrator (the guy basically ran the government services) go get the new phone and my boss set it up. Of course the Chairman refused to used to use a case.",
   "created_utc": 1703001804,
   "score": 41,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1z0uo",
   "message": "I'm not IT but a good friend at my same company is.  There was a guy here that had a really bad skin condition that caused him to have really really bad dry skin that constantly flaked off.  He had to apply medicated lotion multiple times a day but it didn't really help the dead skin issue.\n\nAnyway, once he left, my IT friend came by to show me his laptop and the inside was literally FULL of dead dry skin.  He was surprised the laptop could even function.  He has been in IT for over 30 years and said that is the dirtiest device he's ever gotten back.",
   "created_utc": 1703003857,
   "score": 43,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke22x19",
   "message": "Used to work for a natural gas company, and let me tell ya those Dell Toughbooks are something else.\n\nThey would come in looking like they've been ran over by a bulldozer, and hell maybe they really were. Screen cracked, keyboard destroyed, but that's about it. They were often completely submerged in mud, fell off a moving truck, buried in the ground, who knows what else. The engineers used them at construction sites and sometimes mistakes were made and then they came to my desk.\n\nScreen and keyboard, that's what usually broke, and those are both very easy to replace.",
   "created_utc": 1703005269,
   "score": 41,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1snun",
   "message": "A few positions ago I was doing break/fix IT for a big government agency.  Being a government agency with wanton budget and spending issues, we had a literal warehouse of extra parts. This one dude who worked as a programmer/coder was a frequent visitor.  He was a slovenly obese man, who always wore stained clothing and was also apparently racist.  Nearly monthly - sometimes more - he'd stop by my office and tell me, \"the Chinesium keyboard broke again.\" His words, I'm just repeating the term here. \n\nSo I'd go over to his cube which was *a fucking crime scene*. His keyboard was basically filled with fuzz from the mold growing on all the drippings of food he'd spill into it.  It literally looked like that one \"battlestation\" photo from the 1990s.  You know the one I'm talking about. \n\nAnd yes, every month - sometimes more - I'd have to swap his keyboard for a fresh one.  After the first time I started wearing gloves. He'd just stand there and watch me swap it.  He probably got off on the power trip of making me have to do that.  Fucking scumbag.",
   "created_utc": 1703001492,
   "score": 143,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke25ng1",
   "message": "The ones that came back from an enamel shop were interesting. White powder EVERYWHERE.\n\nBut I think my favorite was the person who put their Surface tablet in a non-padded envelope and shipped it. When I got the package, I just gently shook it…before opening it over the garbage.",
   "created_utc": 1703006261,
   "score": 38,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke24hm6",
   "message": "A laptop waa over heating and would shut down a lot. They're not sure why. I take a look at the insides and find a used condom. Apparently, it's not the first time the guy returned a laptop like that. He got fired about a week later for telling someone he would be doing it again. That someone was the companies boss, which he didn't know. To be fair, I never met them before either so, you know, honest mistake.",
   "created_utc": 1703005842,
   "score": 31,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke298kw",
   "message": "I work with Chromebooks in a school. If it doesn't come back with a colony of ants living in it, we don't even blink an eye",
   "created_utc": 1703007540,
   "score": 31,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke21wml",
   "message": "A kid who'd hidden a Harry Potter book inside so his mom wouldn't find it. Creative, IMO.",
   "created_utc": 1703004903,
   "score": 28,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke29fiy",
   "message": "A couple months ago one of our users spilled an entire mug of coffee right on the keyboard. I removed the back and the motherboard was drowning in coffee. She asked me if it could be repaired. I said liquids and electrical components dont go together well.",
   "created_utc": 1703007608,
   "score": 26,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2hm07",
   "message": "I work with VoIP phones at a hospital, and health workers have a knack for accidentally damaging devices in ways you would never expect. Usually it's things like, \"Someone spilled juice on the keyboard,\" but sometimes it's \"A patient ripped the phone off the wall again, can we get a replacement?\"\n\nThe worst damage is done to the portable WIFI phones. Nurses like to clean them with sanitizing wipes, so we get a lot of phones with moisture damage. By far the craziest incident I ever heard of was the time someone decided to clean a phone in the autoclave (after taking the LiIon battery out, thank god). Autoclaves use pressurized steam to sterilize stuff and the phone did not survive.",
   "created_utc": 1703010521,
   "score": 27,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke21jn2",
   "message": "they had shot it with a bow and arrow",
   "created_utc": 1703004773,
   "score": 21,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke23or6",
   "message": "I used to work somewhere with a factory that used mobile scan guns. Each one worth thousands of pounds and pretty rugged.\n\nOne day we were handed one from a sheepish looking guy who just said \"Sorry, I ran over it with a forklift\". We stripped it down, the mainboard was bent like a banana.",
   "created_utc": 1703005550,
   "score": 23,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2aue1",
   "message": "Worked IT for a meat packing company managing a fleet of handheld devices. After vacation came back to a damp box on my desk that stunk to high heaven.  Handheld had been dropped in the blood pit and no longer worked, and was shipped back to me to fix. \nI put it in another box and shipped it off to Motorola. They opted to replace the whole unit.",
   "created_utc": 1703008110,
   "score": 20,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2bpq4",
   "message": "I worked for a company that had previously done leasing of servers, and had stopped, but there were still contracts finalizing.  In theory, the contract asked them to return the equipment, but now we told me to just junk them since we were no longer leasing equipment and would just junk it ourselves. For a few, that was not an option due to weird disposal policies, so fine.  Send them back to us, we'll junk them.\n\nOne customer sent back some rack servers, 1u HP DL320s, I think, which were \"greasy.\"  Like slippery and when we opened them up, the insides were oily. Long story short, the customer had sprayed WD40 in all the vents to \"eliminate the fan noise.\"  I am surprised any of them worked after that. We were forbidden to start them up due to fire concerns.",
   "created_utc": 1703008418,
   "score": 20,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2dlby",
   "message": "I test for security vulnerabilities in my company's IT environment. For one assignment, I had to test mobile devices connected to the company mobile device management network. I was given someone's employee iPhone, and was told the phone was free because said employee was terminated.\n\nWhen I unlocked the phone, it was still in the same state as when the employee turned it in. He was still signed into his personal Facebook, Twitter, ESPN apps, everything. He used that thing for personal use. I saw the last text message he sent said, \"WHY AM I BEING TERMINATED????\" with an abrupt end to the text thread.\n\nAlso during the security test I found tons of other employees had Kamasutra apps on their phones, among many other sexual health improvement apps on their work phones.",
   "created_utc": 1703009089,
   "score": 24,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2qd84",
   "message": "Back when I worked the helpdesk for a steel company, we would get calls about the company-provided cellphones. One day a steelworker calls and requests a replacement phone.   \n  \nMe: \"What is the condition of the old phone?\"  \nUser: \"Melted.\"  \nMe: \"Are you able to bring what's left of the phone into the office?\"  \nUser: \"Well no, it's at the bottom of a vat of molten steel.\"  \nMe: \"...well it's a good thing you didn't go in after it.\"",
   "created_utc": 1703013655,
   "score": 24,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2d7eg",
   "message": "[deleted]",
   "created_utc": 1703008949,
   "score": 19,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2f0bm",
   "message": "I've got a fun one. I motorcycled to work at the time, and my bag wasn't water proof. Got caught in a torrential downpour (my bag had a waterproof liner I had removed to clean, because it was gross).\n\nGot to work and literally poured water out of my laptop. Tech popped it open, dried it out, and it worked fine, go figure.\n\nSame laptop, it got frozen on my bike (it was cold), which ruptured the screen controller but nothing else. So they popped in a quick repair part and off it went.\n\nI think a few other things happened to that one, eventually the mobo scuzzed up for fairly obvious reasons, but 5 minutes of part swap and it was good.",
   "created_utc": 1703009599,
   "score": 20,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2mpgq",
   "message": "Oh man, which ones to go with...\n\n\nCollege help desk, dealing with neglectful professors...\nOne came in saying their PC wouldn't power on anymore. Crack it open, multiple roaches, mostly dead, one fried on the PCB, couple came crawling out. Imagine frying your laptop due to roaches....\n\n\n\nAnother, brought her laptop in due to overheating issue. Open it up, absolutely stuffed full of dog hair, cat hair, some kind of hair? Fan couldn't even move. Blow it out, swap fan, worked fine somehow after.\n\n\n\nSimilar story to the above, but reportedly a dead hard drive. Crack it open, nostrils immediately assaulted by highly concentrated perfume/coffee smell. Like the chassis contained it all until then. We just said fuck that, tossed it, and got a different one.\n\n\n\nThere's a trend here... Again, similar story as the above, this time, it was cat piss.... That laptop was immediately thrown out without a second thought. We weren't paid enough for that lol\n\n\n\nPlenty more of those and why, any time I'm given any device to work on, I always always ALWAYS clean it first.",
   "created_utc": 1703012335,
   "score": 19,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke252sr",
   "message": "I had a programmer get arrested for child porn.  Nobody wanted to touch his laptop.",
   "created_utc": 1703006054,
   "score": 17,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke29idj",
   "message": "I had a friend who worked at a high school’s help desk. Some kid handed in a laptop that was literally severed in half. Apparently, the kid was surprised when my friend said that he would not be able to fix it within the hour.",
   "created_utc": 1703007636,
   "score": 15,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2bwfi",
   "message": "I once had someone phone up say printer wasn't printing. It's a black and white printer, but I don't know if the black.or white ink has run out.\n\nOffice printers have to he the most neglected office equipment..have seen people slam the drawer, force the drawer when clearly paper jamming it from shutting.",
   "created_utc": 1703008484,
   "score": 14,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2hhhd",
   "message": "The weird:\n\nMy coworker opened one up to replace the screen, and then we saw that the person to whom it was currently assigned had drawn a bunch of dicks on the back of the screen panel in Sharpie marker. Like, they took the device apart, drew the dicks on the back of the panel, then put it back together.\n\nThe worst was one that was run over by a car. We've had them vomited on, a dog peed on one, they get smashed in bookbags, they get landed on in fights, thrown around, etc, but the one that got run over was the worst condition.",
   "created_utc": 1703010478,
   "score": 14,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2o8oq",
   "message": "I was working as a Lifecycle Tech/Tier 1.\nIssued someone a brand new, and I mean brand new, as in out of the box and imaged that morning. Two people had touched this laptop, her and I. \nShe left the office and two hours later she called me on Teams, saying that her camera was broken. It looked like she was in a room full of smoke.\nI asked her what the issue was aside from the camera.\nShe said that the camera was the issue, that she couldn't get the plastic protective wrap off the camera lens.\nIt took about 5 minutes for me to figure out that she thought that there would be that plastic stick-peel (like on a cell phone or presumably a tablet) that you have to peel off.\nShe thought that there was one of those on the camera lens.\nSo she used her nails. And scissors. and nail clippers(wtf?) and a needle, and finally the tip of a knife blade, trying to scrape it off.\nI told her that she would have to come in to get another new laptop, that there was no fix I could do for her.\nI informed one of the T2 techs what happened and they handled her. I'm pretty sure that a note was sent to her supervisor.",
   "created_utc": 1703012890,
   "score": 14,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2801m",
   "message": "We get laptops turned in from employees who left the organization that are just sticky all over.  Keyboard, display, everywhere. It’s like they use it as a napkin for their chicken wings. It’s disgusting and I’ve seen it so many times. People are just gross. \n\nMy laptops always look brand new when it’s time to upgrade. My current work laptop looks brand new, like what are they doing?",
   "created_utc": 1703007099,
   "score": 13,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1gyq7",
   "message": "When I was a PC tech at [Circuit City](https://en.wikipedia.org/wiki/Circuit_City) I had a lady bring in her computer and she had like 200 malware on it lol.",
   "created_utc": 1702996891,
   "score": 11,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1sb0e",
   "message": "All I have to say is \"Bedbugs\" yuck.\n\nA student returned a iPad to me that must have been used as body armor because I looked like it was shot to hell and back.",
   "created_utc": 1703001357,
   "score": 13,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2ke1j",
   "message": "User had a laptop for 2 years. Returned it completely unused. Had been working remotely and using their home pc for everything. Computer had 1 login by the user when deployed to them, never touched again. No files, no new software, Not a single update installed etc. Last boot time was the day it was deployed to the user.",
   "created_utc": 1703011512,
   "score": 11,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke285kl",
   "message": "I install wireless internet and I recently had a customer supply their own router. It wouldn't work. I started looking at it and flipped it over to see mold growing out of the cooling vent",
   "created_utc": 1703007155,
   "score": 11,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2h0ll",
   "message": "I know someone dropped a laptop in a sewage lagoon, fished it out, put it in a big ziplock bag and brought it back to IT.",
   "created_utc": 1703010311,
   "score": 12,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2ikqi",
   "message": "Employee I supervised was taking car to airport to catch a flight.  He placed laptop bag and tools behind car in driveway and went inside to get his bag that contained his clothes.  Puts bag with clothes in back seat, hops in car, and proceeds to back over laptop bag.  The laptop was folded in half.  He was son of CEO, who displayed the destroyed laptop in his office.",
   "created_utc": 1703010869,
   "score": 11,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2lcgz",
   "message": "Contractor who wanted a new PC poured an entire  ‘grande’ sized mug of coffee into his PC. Complained it didn’t work, and left it turned ON while he went to lunch. \n\nThankfully I was in a hurry (and he was a pain) so just switched it off at the wall, unplugged it and picked it up. Then got covered in cold coffee. \n\nHe got the most shit PC I had in the workshop as a replacement :)",
   "created_utc": 1703011852,
   "score": 10,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1ufg6",
   "message": "I do warranty repair work major oems onsite service. Listen we know.. like we know people of your lying. Full milkshakes, coffee grounds , the things you see. So had a call at DOJ. Seriously security right. I am talking to the it guys and taking back off laptop. When the backs come off they pop off when I did this a bunch of stuff came out as well and was airborne. We all hit the ground, why well it was the DOJ and normally stuff does not come out. Turns out after we look that it’s coffee grounds. Like what??? Fresh not brewed grounds all over the damn thing in everything. The head IT guy heard us yell and came out. Looks we realize we laugh, except him. He proceeds to go to an office slam the door shut and we hear yelling. I guess this user was on laptop 3 at this point and had also damaged the last 2 laptops in weird incidents. Had another guy tell me a bear stepped on it. Really people just tell your on-site tech the truth lol",
   "created_utc": 1703002157,
   "score": 35,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2m8u4",
   "message": "About 30 years ago, I had a VP return one of our corporate fleet of [Compaq Aero 4/33c's](https://oldcomputer.info/portables/compaq4/index.htm).  He had driven over it with his car and had a shattered screen, bent up, obviously didn't boot.  I was able to get it to boot up again and left it on his desk booted up and still mangled.  He was not pleased - wanted a new one.  I was able to install Linux from scratch on one of these back in the day.  They were fun little laptops.",
   "created_utc": 1703012173,
   "score": 10,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke31254",
   "message": "I work IT for a city government, including the Fire Department. A few years ago some firefighters brought in a broken tablet. This thing was totally delaminated. case totally seperate from main board, totally seperate from screen. The case had dusty tire tracks clearly visible from when it was run over with a fire truck.  \n\nI ask them what happened to it and they tell me \"we're not sure, it just kinda broke! It must have gotten too hot in the cab\".\n\nDang thing got so hot it spontaneously generated tire-tracks on the outside. Technology really is amazing.",
   "created_utc": 1703017504,
   "score": 10,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke28k27",
   "message": "I've seen a laptop that had been borrowed by the company to an employee.\n\nThe guy had free roaming rabbits in his apartment. And he always hat this laptop open on his living room table..\n\n\n.... And that's how I leaned that rabbits - like rats,  just piss where ever they happen to be at that moment....",
   "created_utc": 1703007299,
   "score": 18,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1ysts",
   "message": "A lot of the laptops I got back looked like they had been used to do garden work, or put up shelves, or used as cutting boards or whatever",
   "created_utc": 1703003776,
   "score": 10,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke27fnw",
   "message": "The WASD keys were worn down on an older macbook, wonder how much gaming he did on it lol.",
   "created_utc": 1703006895,
   "score": 9,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke27ulx",
   "message": "Gotta be the one that \"fell.\" It was absolutely thrown, from at least the mezzanine into the concrete floor of the plant. The screen was the only thing that wasn't damaged somehow.",
   "created_utc": 1703007045,
   "score": 9,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2hkcp",
   "message": "I recently sneezed on my laptop and it fried the motherboard. It's currently in the shop 3000 miles away.  They wouldn't sell me the mobo and it's impossible to source.",
   "created_utc": 1703010506,
   "score": 8,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2jp86",
   "message": "The day after Labor day one year, a user brings us his laptop with vomit in and all over it. He says his nephew was using his laptop and vomitted on it while jumping on the bed. Shame on you for blaming your innocent nephew and being an obvious liar. We trashed it.",
   "created_utc": 1703011267,
   "score": 8,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1rx4u",
   "message": "Not really IT, but I was attempting to repair a desktop in the office of a grainery.  I opened the tower and it was PACKED with corn dust.  Not sure how it had not started a fire.",
   "created_utc": 1703001211,
   "score": 13,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke20s1q",
   "message": "At a previous employer I purposely wipe the whole computer using an electromagnet that we had.  I had been requesting a new pc for awhile and they kept denying it.  So I basically destroyed it in a way they couldn’t fix it and had to order a new one.",
   "created_utc": 1703004499,
   "score": 23,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2r8ag",
   "message": "The first year I went to college they decided to mandate everyone having laptops, and because it was a pilot program, they decided to warranty any and all damage. Lady brought in her laptop covered in pee because she got drunk at a party and thought it would be funny to do. Problem 1. we could smell it, problem 2 half of our guys were at the party. Warranty coverage denied, and she had to buy a new laptop to continue classes. They were $1500 each at the time.\n\nAlso had a guy with severe dandruff that would come in. It would get in through the keyboard, clog up the motherboard/fans, and it would overheat. They helped him 4 times before telling him if he comes in again with dandruff damage they are cancelling his warranty outright.",
   "created_utc": 1703013961,
   "score": 7,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2vbzt",
   "message": "I know this isn't technically IT but similar.  Someone I knew worked for a GameStop that took in an Xbox 360. It tested fine so it was taken to the back to prep for resale.   Turns out it was full of roach eggs that hatched and caused an infestation.   Store was unusable for a month, while it was cleaned and cleared out.",
   "created_utc": 1703015439,
   "score": 8,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2iwia",
   "message": "Warehouse shop computer mouse stopped working.  Tried another mouse, still not working.  Took PC apart and it was full of mice nests, poop and piss.  The mice piss corroded the mouse port on the motherboard.   I did get to tell my boss he had a mice problem he said I know that is why we called you.\n\nWent to work at a super computer center after that and one lady left her laptop on top of her car...not once but 3 different times.  Broke 3 2k laptops being an idiot.",
   "created_utc": 1703010984,
   "score": 7,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2kjbd",
   "message": "the ones that always raised my eyebrows weren't the dirty or dented ones, it was the ones that went missing while traveling/left in a car. never really seemed keen on doing a police report in those circumstances which immediately made me think it was air quote 'lost'. this was in the days before pc support had the good lo-jack options they have now.",
   "created_utc": 1703011563,
   "score": 6,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2n93m",
   "message": "Cyber Security Analyst here! Had to revoke an employee’s laptop after they got monitored and caught watching furry and brony porn on their work laptop…I wish I could joke but I’m not.\n\nEDIT - They were 42 y/o",
   "created_utc": 1703012530,
   "score": 7,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke34l4t",
   "message": "Laptop went through a full washing machine cycle. User claimed it was an accident and they had no idea it was in there. Was full of suds when I opened it to see if I could salvage the data. The drive survived and I got it all somehow.",
   "created_utc": 1703018776,
   "score": 6,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke1a3dp",
   "message": "ectoplasm everywhere!",
   "created_utc": 1702993849,
   "score": 10,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2k8qd",
   "message": "Marine Corps. We loaned some gear to another unit for a MEU (deployment on a boat). They never actually gave it back to us. So before it was our turn to deploy we had to recover the laptops so we could make sure they were usable. About 60 Lenovo laptops have been sitting in a storage box for around 15 months and were never actually used. The boxes were heavily damaged and had stagnant salt water at the bottom.\n\nThe laptops looked like they’d been recovered from the bottom of a shipwreck. Absolutely orange frail metal and plastic all falling apart. Real nasty stuff.",
   "created_utc": 1703011460,
   "score": 5,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2bdx1",
   "message": "Someone handed me their phone and *then* told me it wasn’t working because they dropped it in the toilet.",
   "created_utc": 1703008303,
   "score": 3,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2mqs6",
   "message": "Pubic hair in crevices and sticky keys. 2 month old laptop had to be returned due to the keyboard not working.",
   "created_utc": 1703012348,
   "score": 4,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke2mrqb",
   "message": "Not me but my oldest kid. Bedbugs, they opened the laptop to do some repairs and it was infested with bedbugs. They called me freaking out, I told them to have their roommate bring them a complete change of clothes, bag everything they were wearing and go straight to a laundromat on the way home. They noped out and threw everything away. Luckily their boss reimbursed them. There was also one that had multiple generations of roaches and one memorable one with weed that had been sucked in by the fan.",
   "created_utc": 1703012357,
   "score": 4,
   "submission_id": "18m2834"
  },
  {
   "comment_id": "ke34j8x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18m2834"
  }
 ]
}