{
 "submission_id": "18m341w",
 "title": "How did you get over your worst heartbreak?",
 "selftext": "",
 "created_utc": 1702995994,
 "permalink": "/r/AskReddit/comments/18m341w/how_did_you_get_over_your_worst_heartbreak/",
 "score": 205,
 "url": "https://www.reddit.com/r/AskReddit/comments/18m341w/how_did_you_get_over_your_worst_heartbreak/",
 "comments": [
  {
   "comment_id": "ke1gpau",
   "message": "Time time time \u0026amp; doing something that makes you happy.",
   "created_utc": 1702996779,
   "score": 107,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1joow",
   "message": "With time memories fade and then you realise this is actually a good thing.",
   "created_utc": 1702998017,
   "score": 158,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1ilkj",
   "message": "Definitely not hook-ups as they felt empty and only make me miss the thing I had even more. \n\nWhat helped me is opening my mind to a new and different/better partner. \n\nAt the start I kept comparing new dates to her, but once I stopped comparing and started valuing the things that make someone unique it started becoming much better! \n\nThe one thing that got me truly over it is finding a partner with whom I even had a stronger connection, and even though I'm not with this new person now, it has made my mind open to the possibilities of new people without the comparison.",
   "created_utc": 1702997570,
   "score": 24,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1h6a0",
   "message": "You never really do. \n\nYou just... move on. The pain will always be there in some form.",
   "created_utc": 1702996979,
   "score": 117,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1oax2",
   "message": "The first heartbreak is so confusing. Seeing that much pain and anguish within your own mind is enough to make anyone's concept of the world shatter, and the experience of the first few moments alone hold the power to create one of several possible structures of your future self. I can only relate with my own experience, and no one person may have the true answer for this.\r  \n\r  \nI remember when she first told me we should stop seeing each other. Out of all of our incredible and loving encounters, this was the only confusing thing to me that had ever come out of her mouth.\r  \n\r  \nHeartbreak reveals a lot of things about yourself within its impossibly painful storm. I was able to see a few very important things.\r  \n\r  \nFirst, I instantly saw what my life was going to be like if I had continued to be with her. The hardship, the love, the pain, the struggle, the successes and failures. I mourned for the death of a life only glimpsed. I felt the pain and emptiness of loneliness creep up over the mountain as if to remind me that it had and will never go away.\r  \n\r  \nI learned that I value my life. I value my experience, and know that it is worth sharing. I realized my life was a dance and a party, and that I just wanted someone to party with. I realized that I'm not going to have fun on the universe's most amazing and exhilarating roller coaster if I don't get to look over and see anyone else sitting next to me. As much as I love myself completely and fully, there's something I recognize within myself that feels infinitely bigger when I have someone to share the world with, who can dive as deep as I can into this ocean.\r  \n\r  \nHow do you get over your first break up? Get up. Look at yourself in the mirror. What is happening right now? What had just happened? This existence is deeper and more meaningful than you could ever imagine. If you're feeling this indescribable amount of pain and hardship, stay in that space and look around it. It's hard to see, but that deeply real feeling exists in all possible states of the human mind.\r  \n\r  \nNow start to realize the possibilities that exist around you right now, in this very moment. You are not hindered by anything. You cannot be told what to do and where to lay. You've experience one huge complicated and beautiful experience in this impossibly gigantic universe, and you've opened your heart to the love that they represented. Know deep down that this love is INSIDE of you. If you choose to, you can extend this love to literally everything in your life. Know that this love is not dead. You can never kill it. It will always exist in your heart for this amazing person, whether you had to end things or they did, or whether you both agreed or neither of you agreed. Love is simple. It is there, and it is powerful.\r  \n\r  \nThe physical representation of the mirror of love that exists in this reality can crack and even break, but it cannot ever kill what is being shined onto it. Open up and feel this deep pain, as long as you need to feel it. When you're ready, the world will hand you something else.",
   "created_utc": 1702999834,
   "score": 169,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1qcek",
   "message": "Joined a fight cl…. Actually nvm",
   "created_utc": 1703000613,
   "score": 118,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1khkb",
   "message": "Hit rock bottom , started again and when I least expected it I met the love of my life",
   "created_utc": 1702998346,
   "score": 51,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1ibs6",
   "message": "just kept waking up everyday hoping it wasnt as bad as the last and hoping the next day isnt as bad as todays.  \nLiterally just plough on doing whatever I wanted to do to take my mind off it.",
   "created_utc": 1702997461,
   "score": 39,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1j73h",
   "message": "By running a ridiculous amount of miles",
   "created_utc": 1702997816,
   "score": 34,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1m4cx",
   "message": "Fall in love with someone else, but then that failed so I'm just left with a different heartbreak.",
   "created_utc": 1702998992,
   "score": 34,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1makp",
   "message": "Bold of you to assume I'm over it.",
   "created_utc": 1702999058,
   "score": 34,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1okhs",
   "message": "Learn c++",
   "created_utc": 1702999938,
   "score": 51,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1hfy5",
   "message": "I got her sister naked.",
   "created_utc": 1702997092,
   "score": 184,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1gdak",
   "message": "Finding an incredible woman that become my new best friend and later girlfriend",
   "created_utc": 1702996638,
   "score": 22,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1oa3r",
   "message": "Time will heal. I know it sounds cliché but it honestly does. It feels like someone died. You get over it but you wont forget them.",
   "created_utc": 1702999826,
   "score": 19,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1ljbv",
   "message": "You never get over it, never forget, but you learn to cope with the heartache.",
   "created_utc": 1702998765,
   "score": 18,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1goh4",
   "message": "[deleted]",
   "created_utc": 1702996770,
   "score": 32,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1gpa3",
   "message": "i didnt",
   "created_utc": 1702996779,
   "score": 24,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1k6ej",
   "message": "I drank myself into a stupor that lasted quite a while.",
   "created_utc": 1702998219,
   "score": 24,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1prqg",
   "message": "Losing someone meaningful in any capacity is like losing a limb.  \n\nHealthy coping isn't trying to replace the hand you lost.  It isn't re-growing the hand.\n\nHealthy coping is learning to live without the hand.  You are grateful for having had it, you're sorry it had to go; maybe it was metaphorically infected, maybe it was an accident, whatever.\n\nYou have a stump now, and the stump is perfectly fine because you have other limbs, each that are different but precious in their own way.  And sometimes you find a good prosthetic, and maybe metaphorically that prosthetic is even BETTER than the hand you lost.\n\nBut you find that only after you learn to love what's left, not miss what's gone.",
   "created_utc": 1703000396,
   "score": 12,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1mwsd",
   "message": "gym and attention from other women",
   "created_utc": 1702999298,
   "score": 20,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1h8sb",
   "message": "One day it just stopped hurting",
   "created_utc": 1702997009,
   "score": 9,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1mipu",
   "message": "Short term: date new people. As jay-z put it… on to the next one. \n\nLong term: Eventually you get a window of space in your head to have some clarity to see why that person didn’t work out. It becomes less of a personal insult and more of a rationale appraisal of the relationship dynamics. As Louis ck put it… no good marriage [or relationship of any sort] ends in divorce [or breakup of any sort].",
   "created_utc": 1702999147,
   "score": 10,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1p3s6",
   "message": "The gym and the weeknd",
   "created_utc": 1703000142,
   "score": 8,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1nnbe",
   "message": "Ate alot and gained weight. Then a friend of mine took me to the gym. I wanted her to regret everything.",
   "created_utc": 1702999583,
   "score": 6,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1rv5f",
   "message": "1. OD on a bunch of drugs\n2. Have a near death experience \n3. Battle psychosis demon for 1 year\n4. Avoid every relationship for the next 10 years \n5. ?\n6. Start over with a loving gf that help me love again \n7. Profit !",
   "created_utc": 1703001191,
   "score": 6,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1rz0o",
   "message": "I need this thread rn. Thank you for posting. 😌",
   "created_utc": 1703001231,
   "score": 7,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1eyjr",
   "message": "Time heals all wounds",
   "created_utc": 1702996035,
   "score": 34,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1oijz",
   "message": "I’ve suffered more heart break from being rejected than an actual break up and I just move on",
   "created_utc": 1702999917,
   "score": 7,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1kh4u",
   "message": "Out of sight out of mind :(",
   "created_utc": 1702998341,
   "score": 6,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1ot92",
   "message": "I didn’t but getting a cat helped get my mind off it",
   "created_utc": 1703000031,
   "score": 5,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1qkq2",
   "message": "I tried everything. Sleeping with very hot girls helped. Also, being alone, including solo holidays with random sexual experiences. Periods without alcohol being healthy and active. Self-care and self-development.",
   "created_utc": 1703000701,
   "score": 4,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1wyum",
   "message": "I have no clue. It's literally been years and randomly every now and again my brain will be like remember the only person you ever loved? And how were you not good enough? Ok cool carry on with your day then.",
   "created_utc": 1703003096,
   "score": 4,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1p2a3",
   "message": "Just wait it out. That's what I do.\n\nBiden has an incredible speech about this actually. He's been through incredible loss.\n\nHis advice is keep a calendar. Every day, jot down how bad the pain is. Some days will be okay, others will be a 10 on the pain scale. But, while 10s will still occur, you will see them happen less and less as time passes.\n\nEdit: I just realized, him being president, his older speeches are harder to find. Here it is: https://youtu.be/GwZ6UfXm410?si=zO6IAXvQANk6g5on",
   "created_utc": 1703000126,
   "score": 16,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1mjjd",
   "message": "Got drunk on grappa and listened to \"I will survive\" on repeat while sitting in my car. LOL.\n\nI was 22/m.",
   "created_utc": 1702999156,
   "score": 8,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1mwhc",
   "message": "Got super depressed for a year and got really fat and stopped caring about my health. Hit rock bottom then went to work on myself and finally I’m the best version of myself yet. Realized through the breakup that I was not happy with myself and now that I am I feel like the breakup was the best thing that happened to me",
   "created_utc": 1702999294,
   "score": 4,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1o4be",
   "message": "You don't.",
   "created_utc": 1702999765,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1oowt",
   "message": "I didn't!!! We don't",
   "created_utc": 1702999985,
   "score": 4,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1p6rj",
   "message": "Time and finding someone new.",
   "created_utc": 1703000174,
   "score": 5,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1p6wq",
   "message": "Time, realizing I was getting hit on a lot more than I suspected, and realizing the parental emotional neglect I experienced as a child made me place a high value on being accepted/desired by women",
   "created_utc": 1703000176,
   "score": 5,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1pkxv",
   "message": "Run a bunch. Wear my body out.",
   "created_utc": 1703000323,
   "score": 5,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1js9h",
   "message": "Time is the only healer. Everything else is just a temporary distraction (except maybe therapy)",
   "created_utc": 1702998058,
   "score": 7,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1mnf8",
   "message": "Time",
   "created_utc": 1702999197,
   "score": 7,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1kd1q",
   "message": "Handled it like a pro: Ate ice cream, binge-watched Netflix, and now I give relationship advice on the internet!🍦💔📺",
   "created_utc": 1702998295,
   "score": 16,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1kj18",
   "message": "Time and alcohol. It's \"there\" still to some extent but you learn to live with it.\n\nEdit: I don't recommend that coping mechanism but it was the truth. Thankfully in a much better place now.",
   "created_utc": 1702998362,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1mur7",
   "message": "I got over it. I made a decision and made my peace with it. Had some major trouble sleeping for a month or two until the poison got out of my system. One day i just woke up and it was over. I believe the decision and the faith in your decision is the key. And an unwavering stance. The thing is, i was the one who left her, not the other way around, but it was the hardest decision in my life. Between an evil bitch i loved and my sanity, i chose my sanity.",
   "created_utc": 1702999275,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1p5m2",
   "message": "this may be a very unpopular advice, find a reason to hate the person. But don’t act on your hate, that way u are just being toxic.",
   "created_utc": 1703000162,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1t80a",
   "message": "“The soil of a man's heart is stonier, Louis. A man grows what he can, and he tends it.”",
   "created_utc": 1703001703,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1usg8",
   "message": "Steroids \u0026amp; cocaine",
   "created_utc": 1703002290,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1ze15",
   "message": "I didn’t really, I just think about it less and less",
   "created_utc": 1703003992,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke28344",
   "message": "You dont :3",
   "created_utc": 1703007130,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke37izy",
   "message": "U never get over it but it becomes less painful with the time especially when u find new interests that doesn’t remind u of them",
   "created_utc": 1703019837,
   "score": 3,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1i714",
   "message": "Sluts",
   "created_utc": 1702997406,
   "score": 9,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1n8nd",
   "message": "Time",
   "created_utc": 1702999424,
   "score": 4,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1pyra",
   "message": "Slept with her sister and 3 of her best friends causing a social doom spiral that lasts to this day 24 years later.",
   "created_utc": 1703000469,
   "score": 6,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1j71u",
   "message": "Drugs",
   "created_utc": 1702997815,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1lszp",
   "message": "After 42 years, I still think about her and what may have been. Getting married 2 years after we broke up and having a family has taken the edge off the hurt. But it’s still there, the “time” adage applies here.",
   "created_utc": 1702998869,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1m9db",
   "message": "I didn't.",
   "created_utc": 1702999045,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1moag",
   "message": "I cried for 3-4 days and then I stopped. I thought I was better, but I think that deep inside it still there somewhere manifesting in ways I didnt know. \n\nIt was 13m relationship and I learned that I should respect myself first and tell the bitches to fuck off when its time.",
   "created_utc": 1702999207,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1pkb9",
   "message": "alcohol",
   "created_utc": 1703000317,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1pqov",
   "message": "Only way to get over an old partner is a new one. Hopefully I'm right because that's what I'm doing.",
   "created_utc": 1703000384,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1rpfj",
   "message": "I remember being absolutely gutted that after a mere month of dating (Yes a month....) she broke up because she couldn't handle the distance.\n\nWe were constantly messaging from the day we met until it ended, and i was there 4 days a week. All of a sudden, that was gone. It really felt like that was the one that got away. And it just looked like all the things we did had a bad flavor on it. \n\nNow 18 Months later i've got a girlfriend and i look back on that time with her with great pleasure. Going on 2 months, and although i'm very optimistic and enthousiastic and saying and hoping that it's not going to end. Because we both feel that way. And i'm also very proud that she's my girlfriend. She's more of a realist and says \"Stuff can always go wrong, you can hate me in the future, i can hate you in the future. You never know\" and that actually made me rethink my whole stance. I mean, yes.. I hope it's going to last forever, but if it's not then it's not. She says that i move too quickly at times, so i try to pace myself.\n\nThe only downside to this is that i'm not only losing my girlfriend (if it ever ends) but i also lose my best friend, because we went from being great friends 6+ years to a relationship.",
   "created_utc": 1703001131,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1t4v9",
   "message": "Threw a bunch of her stuff down a mineshaft. Pretty cathartic honestly to literally let go of memories of her.",
   "created_utc": 1703001670,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1u6nj",
   "message": "I never did. But I did become an alcoholic.",
   "created_utc": 1703002065,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1ueoj",
   "message": "Still working through it 4 years later, but the realization I never meant as much to her as she did to me, coupled with knowing that she was just awful toward everyone (horrifically racist \u0026amp; basically a female incel back then at least), and I was no exception- that gave me some comfort in a way. I wasn't missing much by things not working out. At this point, I just hope she's in a better state of mind and has found some sort of happiness in life.",
   "created_utc": 1703002149,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1uhdj",
   "message": "I never did. Got a new partner a few years back. Still think about her almost every day. It’s such a sucky feeling missing someone you’ll never be with again",
   "created_utc": 1703002177,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1xdbp",
   "message": "Hybrid Theory by Linkin Park. The cassette was in my Walkman for 2 years",
   "created_utc": 1703003246,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1xp8x",
   "message": "Such a cliche, but it's literally time. It takes however long it takes and then that feeling in your gut like a weighted ball feels less shitty. And every now and then you get that feeling that reminds you of that point of time, but it goes away. Time heals all wounds is true (I think)",
   "created_utc": 1703003368,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1ykow",
   "message": "Lying on the floor with my hands spread out, listening to music. Mostly Depeche Mode.",
   "created_utc": 1703003693,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke20yjl",
   "message": "Took me ten years but eventually I found someone who made me forget about everyone that came before him.",
   "created_utc": 1703004563,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke215b2",
   "message": "I realized she was wrong for me and she was using me as a backup. I'd been trying to get her to be with me for a couple years at that point and she kept dating me then saying her needed time to get over her ex. Whom she would proceed to get back with, then break up with him and start the process all over again. I eventually forced myself to say no when she tried to rebound with me again, and it helped me see how toxic the situation was. Now I'm happily married to the woman of my dreams and couldn't be happier!",
   "created_utc": 1703004630,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke221h4",
   "message": "I moved back in with my parents, got a different job, spent a LOT of time in the gym (ended up in the best shape of my life), and played The Last of Us on PS3 like 3 times back to back.   \n\n\nUltimately it was a great way to recover myself and my peace of mind.",
   "created_utc": 1703004952,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke2irvm",
   "message": "You don't. In time, the hearrbreak will ease but you'll never get over it completely",
   "created_utc": 1703010939,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke3ftuh",
   "message": "I still haven’t but I’m working on it and myself. One day at a time friends.",
   "created_utc": 1703022837,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4fie2",
   "message": "Logic lol like yeah my feelings were hurt but she made a decision and no amount of pleading my case that night made a difference, no sense in being hung up about it for too long",
   "created_utc": 1703037092,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4klie",
   "message": "Take some time away from dating. Like a couple years if needed. Then one day, WHEN YOURE READY, try again. And don’t rush it.",
   "created_utc": 1703039258,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4majc",
   "message": "One step at a time. Don’t call, don’t drive by. Just move on. It feels like something is dying inside but you really won’t die. Accept it, grieve it, then look forward and move on.",
   "created_utc": 1703039979,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4nlwh",
   "message": "I made up stuff in my head like she was just using me and that she never really loved me, and that she’s laughing with her friends about how much she played me. Snapped me out of it pretty quickly. Even though I was the one that broke things off 😭because I knew we wouldn’t last together.",
   "created_utc": 1703040549,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4o895",
   "message": "Found someone else to invest my heart in. It took almost a decade, but I barely think about her anymore.... But now I have to get over this cheating cunt who I still can't bring myself to cut off",
   "created_utc": 1703040813,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4rk50",
   "message": "Acceptance is the key, its so underrated",
   "created_utc": 1703042291,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4rkv4",
   "message": "Time",
   "created_utc": 1703042301,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4wa96",
   "message": "Lots and lots of fucking therapy.  Like years of emotional damage occurred in literally one night.  But now, all is good, I'm happy.  I'm drunk, but I'm happy.",
   "created_utc": 1703044459,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4x7k0",
   "message": "Time, thats it, and keeping busy",
   "created_utc": 1703044899,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke4xzq0",
   "message": "Remembering that if i have to get over it, it wasn't meant to be in the first place.",
   "created_utc": 1703045275,
   "score": 2,
   "submission_id": "18m341w"
  },
  {
   "comment_id": "ke1krvr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18m341w"
  }
 ]
}