{
 "submission_id": "18m88ii",
 "title": "Employers of Reddit, what can someone put on a resume that sends it straight to the shredder?",
 "selftext": "",
 "created_utc": 1703009186,
 "permalink": "/r/AskReddit/comments/18m88ii/employers_of_reddit_what_can_someone_put_on_a/",
 "score": 112,
 "url": "https://www.reddit.com/r/AskReddit/comments/18m88ii/employers_of_reddit_what_can_someone_put_on_a/",
 "comments": [
  {
   "comment_id": "ke2dv64",
   "message": "**Attention!** If you plan to give examples of a bad/inappropriate email address on a resume, **do not post an email address - even if it's obviously fake**, rather use something like \"[childish email here]\" or \"@example.com,\" otherwise your comment will not be seen.\n\nWe do not allow any type of personal information, even if it's supposed to be fake. See [Rule 4](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-) for more details, thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703009187,
   "score": 1,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3rsku",
   "message": "I had one where under Education he wrote \"suck my dick and get me a job\"\n\nI stared at the screen for a good 3 minutes when I read that.",
   "created_utc": 1703027344,
   "score": 101,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3jdj6",
   "message": "When I was in high school I worked in a shoe store at the mall. We got a resume once for a sales job that had, under the \"Other Interests\" section, \"Special relationship with the one they call Satan.\" Yes, really.\n\nI wanted to interview her, just to see what she'd actually say in person. My manager vetoed that, sadly.",
   "created_utc": 1703024095,
   "score": 47,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3ipev",
   "message": "This guy put a tinder bio at the head of his resume. All his likes and dislikes, with a headshot of him holding an axe while looking sweaty.\n\nI do IT work...",
   "created_utc": 1703023846,
   "score": 189,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3ls24",
   "message": "Well, guy made it through the resume but almost didn't make it through the onboarding paperwork. \n\nEntry level position, guy was 19 I think. Nice enough kid, low life experience but that's how it all starts right?\n\nEmergency Contact info\n\nName - Mom\n\nRelationship - Good\n\n\u0026amp;#x200B;\n\n...so like if we called your mom, and you were hurt, she'd care?",
   "created_utc": 1703025000,
   "score": 57,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3r297",
   "message": "Reading through this makes me feel VERY good about my own resume...",
   "created_utc": 1703027052,
   "score": 131,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke399pm",
   "message": "The only resume I have thrown right in the proverbial shredder was that of the wife of a friend of mine. I was attempting to get her a job at my employer. She had no degree or relevant experience, but we needed a receptionist, and people commonly move up from those jobs into other admin positions. Plus, it's government work, so good benefits, lots of paid holidays, etc. Bottom line, I was doing this underqualified, unemployed person a massive favor by giving her a reference and a chance. We didn't have any other applicants. The job was hers to lose. She didn't know that, so she brought her A game. Here are some excerpts from her cover letter:\n\n\"I may not have a degree, but I have what engineers don't have, 10 years of experience.\" \n\n\"Engineers aren't very organized people and I can keep them in line.\" \n\n\"I have better social skills than engineers do.\" \n\nI am not paraphrasing. Those are things she wrote when she sent me her resume and cover letter to look over before she submitted them online to apply. I was just like, \"You know I'm an engineer, right?\" She did. I continued, \"You know the job you'd be applying for is a receptionist position, not an engineer position, right?\" She seemed pretty sure she could move up and be an engineer in a year or so. That is not at all a thing in my field (it's one of those fields where everyone is required to be licensed and you have to have a degree in this just to be allowed to take the exam to get the license), but she was absolutely sure it was. \n\nI told her that if she was going to submit this, she wouldn't be hired because the entire panel was engineers. She didn't listen, and submitted it. She even listed me as a reference. I told my boss she was someone I was trying to help and she wouldn't help herself, which was accurate, but \"I've got what engineers don't have, 10 years of experience!\" became the office joke for years to come. Every time someone reached the 10 year mark of their career, we'd be like, \"You can't be an engineer anymore. The crazy lady said 10 years is the limit.\" lol",
   "created_utc": 1703020470,
   "score": 108,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3mcah",
   "message": "Military spouse (with rank no less)",
   "created_utc": 1703025214,
   "score": 204,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3qs12",
   "message": "\"Time Person of the Year 2006\"",
   "created_utc": 1703026938,
   "score": 137,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3q8co",
   "message": "I had someone once put “mom to child actor” and she listed that she homeschooled on set and managed their schedule and things of that nature\n\nI had someone else who put “babysitting Daniel” she made him eat his vegetables among other things. It was cute. \n\nMy absolute favourite was a guy who wrote his attributes landscape in italics on a piece of paper that had a background of a unicorn on a cliff with a sunset. He came and asked for it back when he wasn’t hired.",
   "created_utc": 1703026722,
   "score": 164,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3sgus",
   "message": "I'm sure a lot of us have made mistakes on our CVs. I once changed my email address but forgot to change .co.uk to .com and the interviewer asked me about it at the end of an interview for a job I did not get.\n\nThe worst I've seen is from a girl named Clairfe. What an interesting name, is it Irish? My colleague showed me the application form handed in alongside the CV, where CLAIRE had managed to spell her own name right.",
   "created_utc": 1703027613,
   "score": 178,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3hdll",
   "message": "Had an application for a management position at a public library. Job listing specified that an MLIS (Master's in Library and Information Science) degree is required. Got an application from one person who was attending community college, earing an Associate's degree in music. Their only \"Management\" experience was running a K-Pop fan club. \n\nAnother person spelled the library's name incorrectly.",
   "created_utc": 1703023383,
   "score": 151,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3tw78",
   "message": "Not a resume but occasionally someone will cold-message me on LinkedIn, and whenever I can I’ll reply if it’s a student looking for guidance in my filed and take a call and talk them through some shit they should know. Anyhow, one of those messages began “Dear Mr [name], I hope this message finds you *in the pink of your health.* I’m still not fully over that.",
   "created_utc": 1703028187,
   "score": 135,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke2ec57",
   "message": "Student at the school of Life",
   "created_utc": 1703009355,
   "score": 204,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3vfwb",
   "message": "I didn't make it past the name line on someone's resume one time. \n\nWe were hiring a CFO and on the first page of Google revealed an SEC complaint for a 9 figure fraud.  At the time, there wasn't a verdict on the books, but I wasn't gonna wait for one.  See you never.",
   "created_utc": 1703028817,
   "score": 125,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3u8up",
   "message": "I received a resume last week that had notes on it “insert relevant skills here” and “maybe change font” “fill this space with buzz words” this was on his LinkedIn profile as well. If you can’t pay attention to the resume you send out I can’t trust you’ll pay attention to anything else.",
   "created_utc": 1703028330,
   "score": 226,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3tog2",
   "message": "One resume I got while managing a head shop included how much he could bench and the characters he played in high school theater. He was in his late mid twenties.",
   "created_utc": 1703028101,
   "score": 103,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3tvil",
   "message": "Lawyer here.  Multiple pages kill me.  Academia can be different, but in practice, nothing you need a second page to say is worth the time.",
   "created_utc": 1703028179,
   "score": 94,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3wpv9",
   "message": "We do blind applications, no mention of age, gender, name, where you studied etc. allowed on the part that goes to people doing the evaluation.\n\nWe also attract a lot of applicants from prestigious universities, some of whom _really_ feel the need to find a way to mention the name of the institution in their competency answers as though it will help more than actually demonstrating that you are a good candidate for the job. Technically I could throw your application away, I usually won't unless you're especially obnoxious about it but it definitely does not help.\n\n...oh but one person did add \"MENSA IQ\" to their application in response to a question that had no relation to such information and that did get rapidly dropped because that's a huge 'I'm going to be insufferable to work with' red flag.",
   "created_utc": 1703029335,
   "score": 59,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3smyv",
   "message": "Atention too detail.",
   "created_utc": 1703027683,
   "score": 160,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3t79u",
   "message": "On more than one occasion, I got a resume (from the same person) for an entry-level position.  The first time I got it, the resume (entry level position) was 5 pages long and a laundry list of every job the dude has ever held from high school forward.\n\nWhat will forever stand out to me is his entry for when he worked at JC Penney.  He put the job description as \"helping customers find stuff\".   Yes that's technically the job, but \"assisting customers with locating merchandise\" sounds so much better on a resume.",
   "created_utc": 1703027911,
   "score": 156,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke2hqez",
   "message": "The amount of halfwits that put Brexit voter on their CVs is just weird. Straight in the bin.",
   "created_utc": 1703010565,
   "score": 164,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3ra1s",
   "message": "The phrase “attention to detail” makes me look for any type of mistake 10x more than I normally would. Because more often than not, there is some mistake which immediately contradicts the attention to detail.\n\nPro-tip: leave that phrase out, it never helps and can only make you look silly",
   "created_utc": 1703027139,
   "score": 68,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3pzeu",
   "message": "Applying for an entry level job at a small business and your desired salary is more than the owner even makes",
   "created_utc": 1703026625,
   "score": 134,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3uy1e",
   "message": "\"Life Coach\" and all their education is from sketchy seminars at the Radisson by the airport.\n\nThat's and hashtag bossbabe, CEO of their make up MLM.",
   "created_utc": 1703028614,
   "score": 41,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke2phm1",
   "message": "Grammatical and/or spelling issues are a major red flag.",
   "created_utc": 1703013342,
   "score": 220,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke2gou6",
   "message": "Poor spelling.",
   "created_utc": 1703010194,
   "score": 32,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3uy15",
   "message": "They didn’t list a single job. Their only experience was several years of jiu jitsu.",
   "created_utc": 1703028614,
   "score": 40,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3xezz",
   "message": "I was hiring for a lab technician job and this guy came highly recommended by someone in purchasing I think it was. So he got a shot at the interview. His resume wasn’t terrible, but there were gaps. He listed his high school graduation date and then his AA degree from the local CC was a good 10 years later. I mean, that’s ok, but there was no work experience listed for that time period either, soooo. \n\nThen came the interview with my lead technician and me. Walk the guy into a small meeting room and sit down. Before I can even introduce is, he pulls this laminated piece of paper out of his folio slams it down on the table and pushes it across the table and says, “So when do I start?”\n\nThe document was a letter of recommendation from his CC physics teacher. A glowing assessment of the candidate which greatly conflicted with my assessment based on his behavior. \n\nHe did not get the job.",
   "created_utc": 1703029623,
   "score": 34,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3vce4",
   "message": "His mother handed it to me with him just quietly standing beside her, looking like this wasn’t his idea.",
   "created_utc": 1703028778,
   "score": 35,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke40jsb",
   "message": "I used to work for a bar, a girl came in with an application saying she was 22 but then listeded she'd graduated high school that year. I fired off a few questions then slipped in what's your birthday. She was barely 17.",
   "created_utc": 1703030913,
   "score": 32,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke423f6",
   "message": "Had a dude turn in his application with black marker lines redacting all of his info. Only things left were his name, a phone number, and a note saying \"We can discuss these details during my interview.\"\n\nHe, in fact, did not get an interview.",
   "created_utc": 1703031550,
   "score": 34,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3yu5j",
   "message": "Had one guy put \"I'm a sex offender who fucked a child, but I'm working on it\" on his resume. I'm an attorney and promptly told HR to blacklist that individual for liability purposes. We work in tech with a daycare on site, no shot in hell.",
   "created_utc": 1703030206,
   "score": 58,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke2geif",
   "message": "Relevant Experience:  Leader of a raid guild in the popular MMO World of Warcraft.  I am responsible for coordinating the efforts of 25 individuals working toward a common goal, demonstrating leadership and problem solving skills.",
   "created_utc": 1703010094,
   "score": 237,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke2iip4",
   "message": "I interview programmers. I disregard those resumes that are like 75% just lists of technologies the person has used. I want to see what you did to solve a business need, not that you used AWS EC2 and AWS S3 and AWS RDS and AWS Lambda and AWS ELBs and AWS VPCs and AWS SQS and AWS Macie and AWS Cloudformation and Hashicorp Terraform and NodeJS and NPM and JavaScript and TypeScript and on and on and on, _especially_ because in my experience, nine out of ten times, if you choose a random technology from the list and ask them what exactly they did with it, it ends up being something like \"I evaluated it for the project and could learn it if required.\"",
   "created_utc": 1703010848,
   "score": 15,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3fgn9",
   "message": "Filling every gap between traditional corporate jobs with spurious claims to have been \"consulting\".",
   "created_utc": 1703022708,
   "score": 80,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3q7fx",
   "message": "I know some people think they're pretty slick but when I look through resumes I hate the overused \"business jargon\". Nothing turns me off more then a solid page of word salad that could be summed up in 2-3 sentences. It gives off a minimum word count essay vibe.",
   "created_utc": 1703026712,
   "score": 176,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3ui33",
   "message": "Height, weight, marital status, religion",
   "created_utc": 1703028433,
   "score": 26,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3visv",
   "message": "I’m not an employer but my youngest sister wanted me to check over her first resume and she had put \n\n“5’3\nBrown hair\nBrown eyes\nFunny, charismatic, loves to cook”\n\nI sat there laughing to myself pretty good and then let her know this isn’t a dating profile.",
   "created_utc": 1703028851,
   "score": 26,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke419o9",
   "message": "When I worked at a hotel, applicants would cut in front of customers, or not care that i was on the phone, to ask for an application.\n\nAt least 90% also asked for a pen.\n\nI'd always give them a pen, and not expect them to give it back (cheap hotel- branded ballponts), although it aggravated me that so many were unprepared. But if they were rude, I'd put a note on the application. Last thing any of us needed to deal with was complaints about rude employees. \n\nThey'd never get a call back if I made such a note. Just something for people to consider when they want to apply somewhere, especially when it's a customer service job. Be thoughtful and respectful to whomever may be your future coworker.",
   "created_utc": 1703031210,
   "score": 29,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3sxqk",
   "message": "\"Loves Hentai\"",
   "created_utc": 1703027804,
   "score": 20,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3ujkf",
   "message": "I once got a resume written in crayon.",
   "created_utc": 1703028451,
   "score": 22,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke40zlb",
   "message": "I’ve seen hundreds of CVs that are still templates with [insert job title here] still on them",
   "created_utc": 1703031093,
   "score": 22,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3x5o8",
   "message": "Any \"creative interpretations\" of common jobs such as delivery and service co ordinator instead of pizza delivery driver or Household CEO/CFO/Engineer instead of stay at home parent.\n\nIt makes resumes hard to read and comes off as bullshitty not charming or creative.",
   "created_utc": 1703029515,
   "score": 19,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke2gmdx",
   "message": "Work Experience:  Moderator on Reddit",
   "created_utc": 1703010170,
   "score": 89,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke40a0k",
   "message": "I once got a resume with the worst formatting and grammar.  It was clear the person was a non-native English speaker.   I don't usually do this, but I recreated her resume, re-organized it and corrected grammar/spelling mistakes and sent it back to her.  I hope she got a job.  She wasn't a good fit based on her resume, otherwise I would have given her the benefit of the doubt and at least interviewed her.",
   "created_utc": 1703030803,
   "score": 38,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3zq0g",
   "message": "Nudes. Like, any picture of yourself is probably going to get the resume thrown out because of potential lawsuits, but hearing that shriek of \"DEAR GOD WHY\" from the hotel manager's desk while they were going through resumes was hilarious. \n\nLike, bro, your butt was not that nice. Why did you attach it.",
   "created_utc": 1703030573,
   "score": 16,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3xoyk",
   "message": "Unformatted resumé. Block of text. Opening statement as folows:\n\n\"I want job.\"\n\nTo be fair, this was a job placement/school facility for those looking to grow their English skills and ability. The issue with this fella was that he refused help in building an appropriate North American resumé. \n\nIt's difficult to send a resumé like that to clients, many of whom were/are international, and requiring a certain command of the English language.",
   "created_utc": 1703029737,
   "score": 15,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3z131",
   "message": "Some resume templates include a bar graph feature which is supposed to highlight the person's skills. But when someone puts things like organisation 70%, communication 90%, customer service 85% - they might think they are impressing the employer, but the employer is thinking, why isn't customer service 100%? You are effectively saying this is the best I can do and there's nothing you can do about it. So just leave those bar graphs off.",
   "created_utc": 1703030285,
   "score": 14,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke42p6m",
   "message": "Someone spelled their name wrong.\n\nMentioned wanting to make a career at xyz company- person applied to abc company.",
   "created_utc": 1703031794,
   "score": 13,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3rj97",
   "message": "I’ve never thrown out a resume for something egregious but I will never forget my interview with an underdog candidate where when I asked him what got him interested in that particular role (a corporate IT gig) he shrugged his shoulders and said “I don’t know… it’s a job.” In the words of Tyra Banks, “I was rooting for you, we were all rooting for you!!”",
   "created_utc": 1703027241,
   "score": 57,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3u9bu",
   "message": "You should always throw half of the resumes in the shredder anyway. You don’t want unlucky people working for you.",
   "created_utc": 1703028335,
   "score": 62,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke421w9",
   "message": "“Attention to detail\nQuick learner\nMicrosoft office\nQuickBooks\nSage50\nPayroll\nAttention to detail”",
   "created_utc": 1703031532,
   "score": 12,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke42z89",
   "message": "I once received a resume in the mail that had no telephone number, address or email. He called a few days later to ask why he hadn't received any reply. I asked him to get a copy of his resume so we could review it together. I asked him to tell me the address we might have replied to; then the telephone number and finally the email. \n\nAfter a long pause, he said, \"Aww, fuck!\" and hung up.",
   "created_utc": 1703031907,
   "score": 10,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3s4d0",
   "message": " Bad grammar and spelling mistakes. If you screw up on the resume, I know you’re gonna screw up on the job.",
   "created_utc": 1703027474,
   "score": 20,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke44069",
   "message": "A couple we didn’t shred but definitely did not call and saved for future laughs:\n\n- “Can cook anything related to a potato” (followed by the longest list of potato dishes I have ever seen and this job did not involve food in any form)\n\n- In special memberships section: “Have a blockbuster card”",
   "created_utc": 1703032326,
   "score": 9,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke466nu",
   "message": "We had a young woman apply for an entry-level software engineering job a couple years ago that had a Linktree URL in her application and resume. One of my coworkers was doing resume evaluations for our boss and opened the Linktree, finding links to an R-rated Twitter account, a PG-13 Insta, her Onlyfans, and to her content on several other porn sites. My coworker and boss were not amused, and they were debating whether someone was trolling the company or if it was a bizarre spam attempt. Her resume was rejected, and she was sent an automated \"Thank you, good luck in your search, please try again in the future\" email. \n\nA few months later, we were advertising another open entry-level position when her resume came through again. My boss was doing the resume evals and recognized the name. He opened it a second time, while commenting to another of my coworkers about the inappropriate resume (he's not a perv, but was just surprised to see it again.) When my boss clicked the Linktree URL again to show the coworker, he was greeted with a perfectly normal collection of engineering links, including a link to her electronic resume, her LinkedIn, several projects she'd worked on, and a GitHub account. \n\nOur best guess is that the applicant had accidentally copypasted the wrong Linktree URL the first time. She was still rejected for the second position. At that point, several employees had seen *everything*, and my boss decided that moving her resume forward for interviews would be inappropriate. Bit of a shame too. Solid GPA from a well-respected CS program, interesting projects, and a demonstrated ability to take on some absolutely massive workloads (sorry, I'm weak and couldn't resist.) \n\nWhen applying for a job, please don't include links to your nudes. Aside from a handful of socially awkward software engineers, most of our people don't want to see them.",
   "created_utc": 1703033221,
   "score": 1,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3yn9h",
   "message": "My mother was on the Library Board of our small town public library.  They were looking for a librarian part time, three days  week.   One resume they received came in hand written on notebook paper that had been torn out of a spiral bound notebook.    Frayed edges, the whole nine yards.  Like a Jr. high school essay question.  For a job as a librarian.",
   "created_utc": 1703030127,
   "score": 7,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3ntzr",
   "message": "Resumes that have nothing to do with the advertised job, or with the field. I am a scientist and I get somewhere between dozens to close to 100 unsolicited resumes every year. 99% of them go immediately to the digital shredder because they have a skill set completely orthogonal or unrelated to what I do, even though they claim that their skill set would be a perfect fit???? I mean on what planet would someone hire an immunologist to run simulations of gamma rays from neutron star mergers?  This is almost as bad as what I routinely get.",
   "created_utc": 1703025791,
   "score": 41,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke3yida",
   "message": "Not a hiring manager but I’ve been told stupid emails are a red flag. Hellokitty6969@gmail and stonerbro420@hotmail.",
   "created_utc": 1703030071,
   "score": 14,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke461w8",
   "message": "I work in tech. Each tech resume is exactly the same. The ones that get immediate call backs are ones with diverse working experience or a ton of experience years. \n\nThat said. When I do call to book an interview, my first question is, “What makes you different from everyone else who applies?” \n\nThey always answer, “I’m a hard worker.”\n\nMe: “Everyone is a hard worker. What makes you different?”\n\nThe ones that get caught off guard or give me that deer in headlights stare are instantly passed over. \n\nThe ones who have some outside interests are worth an interview. \n\nThe funny ones… those ones are gold and will go to the top of my list. \n\nAnd the ones who answer anything that involves being a team player, those are the ones I want to get to know, and eventually take under my wing. \n\nIT attracts a lot of narcissists or abusive personalities on one end, or passive introverts on the other, and not too many in between. \n\nHard to build a functional team dealing with those types. \n\nSo I ask really non technical questions to find the ones who are balanced and care about others around them. I want the ones who have curiosity. And anyone who can make the team laugh, well they will always have a dear spot in my heart because those people are fearless.",
   "created_utc": 1703033168,
   "score": 1,
   "submission_id": "18m88ii"
  },
  {
   "comment_id": "ke4b6as",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18m88ii"
  }
 ]
}