{
 "submission_id": "18mb6ob",
 "title": "What fucked you up?",
 "selftext": "",
 "created_utc": 1703016584,
 "permalink": "/r/AskReddit/comments/18mb6ob/what_fucked_you_up/",
 "score": 70,
 "url": "https://www.reddit.com/r/AskReddit/comments/18mb6ob/what_fucked_you_up/",
 "comments": [
  {
   "comment_id": "ke3516b",
   "message": "Unlimited internet access at a young age.",
   "created_utc": 1703018939,
   "score": 238,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke30wk3",
   "message": "I stuck my foot in the front spokes of my bicycle. Going about 15-20 mph and no helmet.\n\nA paramedic picked me up out of the road. He wasn't on duty, but happened to see me.\n\nEdit: I knew I wasn't alone with this. Hello to all my fellow geniuses.",
   "created_utc": 1703017448,
   "score": 30,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke32ax1",
   "message": "Dressing my younger brother in his marine Corps unfirom after he shot himself in the head on christmas day\n\n\n(Edit) \nThank you all for the condolences, to put more context into it.\n1. We were both marines so I felt a bit of obligation to give him a proper send off.\n2. I am still trying to come to terms with it and have talked with some therapists but feel like I haven't found a good match yet. \n3. I wasn't alone. We have a brother in law enforcement that accompanied me to dress our younger brother. \n4. He used a .357 magnum so despite the morgue best efforts his face was still very much scarred and unrecognizable.\n5. The images of him still haunt me. Despite this being his third year anniversary since taking his life.",
   "created_utc": 1703017952,
   "score": 188,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2zfj2",
   "message": "1. A very messy divorce\n2. Betrayal by an entire family\n3. A missing child, still missing after 20 years.",
   "created_utc": 1703016919,
   "score": 53,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke348ex",
   "message": "Being cheated on. I went from being with the love of my life to never trusting anyone I’ve dated. My confidence was shook and I constantly look for lies.\n\nEdit; thanks for the well wishes. I didn’t expect so many people to message me or to share their experiences. We’ve gone through a particularly hard experience. Hopefully time and working on ourselves helps us get over it.",
   "created_utc": 1703018648,
   "score": 44,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2z21g",
   "message": "My mother",
   "created_utc": 1703016786,
   "score": 26,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke30sx0",
   "message": "Seeing my mum covered in blood, sitting on the floor holding a razor. My stepdad was out, I was about 17 or 18 I think.",
   "created_utc": 1703017412,
   "score": 232,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke39y7c",
   "message": "Being unemployed for 1,5 year. Some people say people who are long-time unemployed lack motivation. In my case, that might have been through, over time, but only because the job hunting took so long that it completely drained me of mental energy and hope. Every vacancy I looked at seemed impossible. I was desperately trying to find ways to raise my chances, but I saw only less and less chances through all the failure. The job market just didn't work for unexperienced, anxious me. Worst was that I was trying to vent my emotions in the hope of finding understanding, but nobody seemed to get it (or at least so I felt), so over time my complaining only annoyed them, making me feel very lonely and misunderstood. I got sad, angry and depressed. There was some hope when I finally found a job, but it turned out to be a job that only made things worse, because I hated it. And meanwhile I felt extremely worried about my future. Would I ever get a job? Would it even make me happy? Would I have to work until I died? Would I be able to buy a house and start a family?\n\nFinally, after a long time, it started to get better in small steps, although the anxiety and mental stress stayed with me for a few years. By now, I have a permanent contract and work 4 days in the week to spare myself a little. SO and me married, bought two doggies and a house and first baby is on the way. We're not rich, but at least I am a lot happier now.",
   "created_utc": 1703020716,
   "score": 164,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke312jw",
   "message": "OxyContin 2008. My life is still unstable because of the addictions I developed",
   "created_utc": 1703017508,
   "score": 78,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3cy9h",
   "message": "I know this sounds kind of pathetic? But being emotionally bullied and tormented throughout high school has left me scarred to this day and I am 64. What they like to do was become my friend, tell me, I was welcome, invite me over to hang out, and then, a few weeks into it, start excluding me and laughing about it at school. I still have trouble trusting people when they say they are my friends and still feel insecure and like a loser. Yes I have had much therapy.",
   "created_utc": 1703021799,
   "score": 195,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke33il0",
   "message": "Got cheated on. Tried to forgive. Cheated on a second time. Almost drank myself to death afterwards. That was at the start of 2020... Still working on myself.",
   "created_utc": 1703018389,
   "score": 91,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke301o6",
   "message": "Emotional abuse",
   "created_utc": 1703017141,
   "score": 179,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3hsz8",
   "message": "Losing two brothers to suicide.",
   "created_utc": 1703023516,
   "score": 101,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke36qg7",
   "message": "Limewire video downloads who's content did not mirror the file name.",
   "created_utc": 1703019550,
   "score": 34,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3hxdd",
   "message": "One of my best friends grew up in a conservative Jewish household. He ended up getting gastro-esophageal cancer at the age of 26 and he died in August of last year. He has a twin brother that is also one of my closest friends. I was basically the triplett and we were pretty inseperable for most of HS but had known each other since we were kids.\n\nI’m also Jewish but was raised reform so we’re way more relaxed on all the intricacies of keeping kosher and ritual stuff. So when he died there’s a specific ritual that someone outside of the family is supposed to partake in where you meet a specific group of men in the Jewish community who help you prepare the body for its final rest. The family asked me to be the one to do it, which to this day is one of the greatest honors I’ve ever experienced in my life. \n\nYou wash and wrap the body in this cloth. I had to sprinkle dirt from Israel over his eyes, heart and pubic area and then had to cover his eyes and mouth with broken pieces of pottery. Then I wrapped him in cloth and tied this knot in the shape of a Hebrew letter and lifted him into his coffin. \n\nI’ll never forget his face. It wasn’t the person I knew and loved. He was a fighter. Didn’t matter how many drugs he had to take, how bad he was constantly feeling, how tired he was he always was living his life to the fullest. Scuba diving, rock climbing, seeing his Boston sports teams play in person. And always, always making sure to make time for family and people like me and other close friends. But towards the end it got really rough on us all. And watching his body slowly shrivel into what it did broke me in a way that I’m unsure I’ll ever fully recover from.\n\nI say this because when I saw his face on that table as I was preparing him for his coffin, I felt a sense of relief. Because for the first time in what felt like an eternity I knew he wasn’t feeling miserable anymore. When you love someone like a brother you’d do everything possible to get as much time as you can but in that moment I was almost glad he didn’t have to be trapped in pain anymore. And those conflicting feelings made it all the more difficult.\n\nSorry for the long post, but the context is important. If you take one thing away from this, love your people.",
   "created_utc": 1703023560,
   "score": 142,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3svcs",
   "message": "The night my girlfriend and I were supposed to meet up but she never showed...because she died in a hit and run car accident earlier that same day.\n\nWe were both in our early 20's and she married a massive jerk but he wouldn't concede to divorcing. We were supposed to meet at a fancy restaurant and have a soft \"reset\"...We'd been kinda arguing for a couple of weeks as she had been dealing with a nasty divorce for two years but we were dating...I wanted things more serious and she wanted to keep things casual...she never showed. I waited and waited...getting more and more upset that she stood me up for no reason. I'd tried calling over and over but she didn't answer...finally some other friends showed up out of pure coincidence on a double date. They invited me to have some drinks, I explained my being there and then bounced out so I wouldn't be the literal 5th wheel.\n\nGot home and found a message waiting for me on my voicemail (home phone). Listened to it...it was her dad asking me to call him...I did, and he told me she had been in a fatal hit and run accident earlier that day.\n\nAnother car had sideswiped her in a bad way while coming onto the freeway...she lost control, flipped and rolled several times and was ejected about 40' from her car. She died shortly after.\n\nAn off duty nurse had been on the scene after it happened; she was with my girlfriend until she passed from BFT to the head. At least she wasn't alone when she died.\n\n\u0026amp;#x200B;\n\nFound out at the funeral that her mom and her had spoken that morning and she told her mom, who told me just before the funeral was about to begin, that she had planned to tell me that she wanted to give her and I a more serious chance and even talk about moving in together once the divorce was finalized and the dust had settled. And that she was pretty sure she had fallen in love with me.\n\n\u0026amp;#x200B;\n\nYeah...kinda messed me up. For a very long time.",
   "created_utc": 1703027777,
   "score": 157,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2zs6e",
   "message": "War.",
   "created_utc": 1703017045,
   "score": 116,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke38b8x",
   "message": "So, I was raised by a single mom with no support/contact from my dad. My dad's family is really wealthy. My dad died. I reach out to them with no response. I research his side of the family and I had heard they were rich but what I find blows my expectations out of the water. \n\nSome months later my family calls me and says to come over because I got mail that looks very important. They live over 100 miles away but they don't want to mail it to me. It turns into an event. I start to feel like they know something I don't.\n\nI spend a couple hours driving home. I'm getting amped thinking about the possibilities. Did I just get lottery winner money? Holy shit!\n\nI get there and they bring my mail to me with the important letter on top. Yeah, it looks pretty official but maybe a little too much. They look excited but are downplaying. I open it and it's just some sort of loan offer. I feel crushed. Then I have to drive another couple hours home feeling like shit. \n\nIt was already a sensitive area of my life. There was definitely some emotional scar that was reopened. But, man, there is now an almost constant frustration and depression that I now experience. It's been years. Almost 10 fucking years and it still impacts almost every day of my life.",
   "created_utc": 1703020120,
   "score": 127,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2z8bw",
   "message": "My parents.",
   "created_utc": 1703016848,
   "score": 205,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke359px",
   "message": "My dad’s suicide/ and his week in a coma bec of his attempt.",
   "created_utc": 1703019024,
   "score": 120,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3anys",
   "message": "When I was like 5 one of my friend found a porn mag and there was a picture of a girl riding a guy's face. She wanted to try it and we did. At the time it wasn't a sexual thing, the heat and pressure just made me feel safe. I asked my female cousin of the same age as me (5) to do it whenever I was over her house. I was just a kid, and didn't know what we were doing. I still think about it and feel fuckin disgusting, even worse I'm sure she remembers it cause I do. I'm so glad she's never brought it up, or looked at me different.",
   "created_utc": 1703020973,
   "score": 209,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke31gnd",
   "message": "Being molested as a kid.",
   "created_utc": 1703017649,
   "score": 175,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke33zx9",
   "message": "Improper lifting technique. Imploded a disc in my lower back, and haven’t been pain free for close to 20 years.",
   "created_utc": 1703018564,
   "score": 113,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3sn3k",
   "message": "Schizophrenia. Graduated with an engineering degree ready to start life and it sprung on me shortly after graduation. Homelessness, episodes, rinse and repeat.  I'm doing a lot better now, going on 2+ years episode free.",
   "created_utc": 1703027684,
   "score": 107,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2yu4o",
   "message": "Liquor",
   "created_utc": 1703016705,
   "score": 138,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke35jlm",
   "message": "My father had diabetes and his kidneys didn't work. My mother would go to work and I would be left with him and I had to take care of his condition. He would always fall into a coma because of his blood sugar levels and his inability to control it and I had to save his life all the time. Call for an ambulance and they wouldn't believe me because of my voice. If he was not in a coma, he would just me mumbling things which made no sense at all and would clap with hands and whatnot, I was trying to feed him with some sugar, honey, glucose and whatnot.\n\nSo yeah... I was 10-13 years old :)  I love both my parents but this left me fucked up and all the stress I went through when I was a kid is now showing up",
   "created_utc": 1703019123,
   "score": 208,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke38tcv",
   "message": "\\*pulls up a chair\\* \n\nHow much time you got?",
   "created_utc": 1703020304,
   "score": 171,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke36c15",
   "message": "Finding out my wife cheated on me with a guy she met through me….",
   "created_utc": 1703019405,
   "score": 13,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke36rzr",
   "message": "being neglected as a child, shown almost no attention because my brother was a problem child and they didnt have any time or energy left for me after dealing with him. say hello to a lifetime of abandonment issues and seeking constant validation and an addiction to self destruction cuz i also feel like i dont deserve to be taken care of or loved.",
   "created_utc": 1703019565,
   "score": 84,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke30r9n",
   "message": "I did. It's my fault I'm here.",
   "created_utc": 1703017395,
   "score": 89,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke36uut",
   "message": "dating someone who became addicted to drugs…",
   "created_utc": 1703019594,
   "score": 77,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke32y6n",
   "message": "Childhood trauma, loneliness, emotional abuse/neglect, fucking up my sleep schedule as a teen. Also birth control (the pill messed me up for years)",
   "created_utc": 1703018185,
   "score": 205,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke31sud",
   "message": "both my cancer and my mother",
   "created_utc": 1703017773,
   "score": 58,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke36bh6",
   "message": "My father. But in the end he's exactly who I didn't want to be and I now have a 6yr old daughter who i would destroy the world for.",
   "created_utc": 1703019400,
   "score": 100,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2zwsp",
   "message": "Tobogganing that shit fucking hurts when you bail",
   "created_utc": 1703017092,
   "score": 106,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke34h3j",
   "message": "When my mom died when I was six and dad abandoned me at 10 and grandparents put me on medication when I didn’t need it",
   "created_utc": 1703018736,
   "score": 107,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke36e29",
   "message": "Brothers I served with not coming home. And those who came home only to give in and give up.\n\nToo many funerals for good men.",
   "created_utc": 1703019426,
   "score": 107,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke378cj",
   "message": "The two years where my dad thought me, his 4 to 6 year old son, was sexier than my mom.\n\nEdit:  I can't believe people don't understand the statement.  My dad sexually molested me from the ages of 4 to 6.",
   "created_utc": 1703019730,
   "score": 54,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke35pfk",
   "message": "1. Being raped.\n\n2. Not having the most fulfilling or stable childhood / emotionally unavailable father. \n\n3. Being poor.\n\n4. My ex narcissist fiance who made me quit my favorite job and move for him. \n\n5. The loss of my favorite job. \n\n6. Being severely bullied and not having anyone to confide in / feel safe around.\n\n7. Undiagnosed ADD as a kid. Medication saved my life.",
   "created_utc": 1703019180,
   "score": 46,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke35wfd",
   "message": "Mormonism.",
   "created_utc": 1703019248,
   "score": 124,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke37dhn",
   "message": "A false allegation made by an ex student, it was hell going through an investigation absolute hell and even though I was innocent there’s the gossip that comes with it and people who make up their own story, then the return to work afterwards- people look at you differently. I’ll also never trust management again, they treated me like I was guilty and told me it was a confidential investigation yet, everyone seemed to know. I guess at least I can talk about it without crying now.",
   "created_utc": 1703019781,
   "score": 123,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke35yr4",
   "message": "When i was around 10 my mom was cheating on my dad and one night she was leaving to go meet the guy. I was sick with the flu and begged her not to leave me because i needed my mom. She went anyway, and got in a wreck intoxicated that night and lost her license. She almost died.",
   "created_utc": 1703019273,
   "score": 150,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke36yna",
   "message": "coming incredibly, taste-it-on-your-tongue close to achieving major entrepreneurial success only to miss by inches due to timing \u0026amp; circumstance. At least twice.\n\nI didn't realize just how much it affected me until I hit a certain age and realized that so much of my anxiety and obsessiveness and stress stem from feeling like I took my shot, I missed, and now there's not enough time left. I spent my youth trying to clear the road for my older self, and I failed.",
   "created_utc": 1703019631,
   "score": 119,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2z2z0",
   "message": "Whiskey.",
   "created_utc": 1703016795,
   "score": 82,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke34yp2",
   "message": "Social media has given me incurable recurring nightmares.",
   "created_utc": 1703018913,
   "score": 116,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3f245",
   "message": "Indian arranged marriage.",
   "created_utc": 1703022565,
   "score": 74,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3h9rh",
   "message": "All these comments makes me want to say: Be kind because you have no idea what the other guy is going through. No idea.",
   "created_utc": 1703023344,
   "score": 41,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3qh9l",
   "message": "Punished for having a panic attack after bad car sickness as a child, then being punished for being too quiet, then punished for focusing on my studies instead of socialising, then told I'm a moron for doing an apprenticeship and finally being left standing outside my house as my father/punisher sped off after calling me a queer on my 18th birthday after being told I wasn't welcome in his house. (Not a homophobic thing I don't think, given I'm heterosexual)\n\nFuck you dad, all my successes have been fueled by my need to spite you. 😘",
   "created_utc": 1703026819,
   "score": 36,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke33h2y",
   "message": "My own choices lol.",
   "created_utc": 1703018374,
   "score": 65,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3pct5",
   "message": "Seeing my mom go through a brain aneurysm, stroke and brain bleed. My boyfriend never got to meet my mom before hand and only knows her as disabled and depressed.\n\nShe is the best mother in the world and all my friends can attest to that. She still is the best mom. I will not give up on her.",
   "created_utc": 1703026381,
   "score": 31,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3jtbh",
   "message": "I couldn’t pinpoint one thing but if I had to guess the worst of it was probably my dad brutally murdering and partly dismembering my mom when I was 3. Hid her body in the closet for 3 days before my grandpa, his dad called the cops. I was lied to about it and was told my dad was a good guy that was in prison for not being a good caretaker to my Ill mom. I googled my dads name and found the articles about a week before Christmas when I was 11. \n\nOther than that my abusive ex that I was in a relationship my senior year of high school until I was 19. Literally had to be rescued and almost died (his mom held a gun to my head as I was escaping) trying to get out of. My now ex (we ended on good terms) came and moved me out of his moms trailer in the middle of the night.",
   "created_utc": 1703024261,
   "score": 62,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3cdw6",
   "message": "My brother losing his life in a car accident when I was 17 (he was 15). Our father followed him to the grave three years later. Our mother lived but was never the same and her health quickly declined. All this during my college years.\n\nTherapy really wasn't a thing back then and it took me a long time to work through it. Our parents weren't abusive but they were going through their own thing.\n\nStill my brother's death (a very stupid car accident where he was riding on the hood of a car) not only fucked us up but also our cousins. \n\nAll of us were super car careful... one cousin would freak if she knew her son drove my son into lower Manhattan one night when they were both underage. I was not a happy person when my son told me about that adventure when he was older but we both agreed to not tell my cousin as no good could come of that.",
   "created_utc": 1703021595,
   "score": 82,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2z9p7",
   "message": "Porn",
   "created_utc": 1703016862,
   "score": 178,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke33yiw",
   "message": "Being forced into physically hard child labor, abusive parents/brother, a big breakup",
   "created_utc": 1703018550,
   "score": 26,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke37ez4",
   "message": "i was raped by someone who i thought was my friend and his roommate in 2021 and i still haven’t healed …",
   "created_utc": 1703019796,
   "score": 26,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3ebuo",
   "message": "Gestures vaguely at everything...",
   "created_utc": 1703022295,
   "score": 87,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3815d",
   "message": "Chasing my dreams to work in Hollywood. I was mostly successful but it's worn me down to nothingness and taken the joy I once had for it as a child.",
   "created_utc": 1703020019,
   "score": 23,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3aato",
   "message": "I'd say my uncle but lately I'm realizing I was born into an incredibly fucked up family similar to a bad Lifetime movie.",
   "created_utc": 1703020841,
   "score": 20,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3dm2k",
   "message": "Just happened. \n\nRelationship of 7 years. We booked a big euro Christmas trip. 3 months out I get a custom engagement ring made for her to propose on the trip in Zurich. 3 nights out before the flight, she tells me she wants time to be alone out of the blue. We technically break up but on relatively good terms to preserve the holiday. I’ve already told my family and her mother about the proposal. So I leave the ring at home. I’m already broken. \n\nThen, 4 nights into the holiday I get a message request on Instagram from someone who happened to be the now ex-fiancée of a guy from my girlfriend’s work. They were having an affair and ruined her family’s life (small daughter). So now I’m literally still on this holiday with her. I need to deal with this when I get home.",
   "created_utc": 1703022036,
   "score": 22,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2zadu",
   "message": "I saw the unedited footage of the Christchurch Massacre. \n\nIt looked like a first person shooter. \n\nIt was heartbreaking and traumatic. \n\nI highly advise avoiding it.",
   "created_utc": 1703016869,
   "score": 87,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke327d3",
   "message": "Being 61 and only finding out a year ago I’m on the spectrum, plus dealing with anxiety and depression that is likely connected to that.",
   "created_utc": 1703017916,
   "score": 154,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke305ij",
   "message": "being a child who was trafficked",
   "created_utc": 1703017178,
   "score": 56,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3a9fj",
   "message": "1. The feeling that something bad (like sexual abuse) happened to me as a child (but no actual memories). \n2. Observing a very dysfunctional relationship between my parents.\n3. Overhearing my parents calling me weird for masturbating and being shy.",
   "created_utc": 1703020827,
   "score": 102,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke35pxy",
   "message": "Alien, saw it when I was 5 or 6... didn't sleep for weeks and still have a fear of things covering my face",
   "created_utc": 1703019185,
   "score": 18,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke37rht",
   "message": "Chronic Fatigue Syndrome",
   "created_utc": 1703019923,
   "score": 16,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3g2pj",
   "message": "I've always had this passion for writing. One time when I was a little I wrote this story. With a ton of super heroes I was so proud of it I spent hours typing on the computer. Finished I went to tell my dad he wa drinking and watching the Raider game. I dragged him over and was telling him how this and that and he was just saying yeah and looking back at the TV. I noticed he was paying no attention and I remember just saying that's it and let him go and ever since then I knew I was never gonna be able to do anything he would be interested in. I still enjoy writing I have a very active imagination but I don't write anymore like I wanted too.",
   "created_utc": 1703022925,
   "score": 16,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3hnvg",
   "message": "SA when I was a teenager",
   "created_utc": 1703023464,
   "score": 18,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3hv97",
   "message": "Being cheated on by the same person that told me they love me and were in love with me for the first time, just 6-8 days earlier.",
   "created_utc": 1703023539,
   "score": 17,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3hszn",
   "message": "Identifying my dead brothers body when I was 18 and my parents were on vacation.",
   "created_utc": 1703023516,
   "score": 34,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke34r38",
   "message": "Most recently: I saw a video of a homeless man sitting on the curb crying, begging, and pleading for a man to stop harassing him before the man dumped a whole smoothie on his head. The desperation and pain in his voice threw me for a loop for a while. \n\nIf we are talking for life then it was my cousins boyfriend who abused me relentlessly for three years while living with us as kids",
   "created_utc": 1703018837,
   "score": 46,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3e8vi",
   "message": "My own stories I tell myself about why I’m not good enough because of misinterpreting how my circumstances interact with me",
   "created_utc": 1703022265,
   "score": 16,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3mpis",
   "message": "Growing up with a drug addict parent. \n\nShe always was an alcoholic, but at some point she exchanged pills for cocaine and spent more than a decade using before going to jail. My life was always unpredictable and I was either neglected or in a dangerous situation.",
   "created_utc": 1703025355,
   "score": 16,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3e68x",
   "message": "Fell for a girl in highschool, lost her to my best friend and \"group\" leader feel out of the friend group.\n\nTen years later run into her by happenstance and tried it again, and lost her again to the same dude \n\nFuck trusting anyone.",
   "created_utc": 1703022239,
   "score": 15,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2z7rn",
   "message": "adult life",
   "created_utc": 1703016843,
   "score": 43,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3c7uu",
   "message": "My soon-to-be-ex-husband. He had a laundry list of issues:\n\n- Anger\n- Hoarding \n- Excessive drinking \n- Physically, emotionally, verbally, and psychologically abusive \n- Hoarding problem. Not just like pack-rat or collector of things. I'm talking like actual, legitimate hoarder. \n- Chronic unemployment \n- Financial irresponsibility \n\nFor a decade, I brought home all the bacon, and still handled 99% of household chores and responsibilities, while enduring his abuse and issues, while also simultaneously dealing with chemotherapy, monthly immunotherapy infusions, and annual surgeries for my autoimmune condition. I finally left him three months ago. \n\nHis hoarding problem had one of the most profound impacts on me. Even when \"we\" (read: I) sold the house, he barely lifted a finger to help declutter/clean, so the task of clearing out *his* 4,000+ sq ft of hoards fell on my shoulders. It was a complete and utter nightmare experience. I've since downsized to an ~1,100 sq ft condo, and own nothing but my bed, one barstool at my kitchen island, and the clothes in my closet. Two weeks ago, after three months of being in my new place, I finally felt comfortable enough to buy myself a sofa chair. In general, the thought of buying or owning ANYTHING beyond the true necessities in life gives me extreme anxiety. Like, hunched in a corner, rocking back and forth level of anxiety and panic. \n\nI'm in therapy twice a week to deal with the impacts of the past decade. The good news is that legally and financially, I'm fine. Long story short: I don't have to pay a dime in alimony, nor a penny out of my 401K, and I managed to negotiate for 70% of the equity from the sale of the house. Emotionally, I still feel like a human yo-yo. Therapy is helping, though.",
   "created_utc": 1703021534,
   "score": 14,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke3huoi",
   "message": "Being disowned by my parents then almost 20 years later having my alcoholic father try to convince me to move half way across the planet to live with him.",
   "created_utc": 1703023533,
   "score": 14,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke347i8",
   "message": "Combination of being raised in dysfunctional house due to parents divorce , being picked on school , being depressed for all three years of middle school and half high school due to said bullying, loneliness, and diagnosed with a mild autism( formerly Asperger’s)",
   "created_utc": 1703018639,
   "score": 41,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke33a2m",
   "message": "Losing two jobs at the start of COVID then losing my house to hurricane Laura a month later then living in complete isolation on property I had to work on to continue living there and earning no wages in the process then divorcing then relapsing into alcoholism",
   "created_utc": 1703018304,
   "score": 11,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke2zcn4",
   "message": "Getting cheated on",
   "created_utc": 1703016891,
   "score": 55,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke365ip",
   "message": "My grandad died of cancer when I was 6, and not being able to properly grieve.\nPlus unstable and emotionally abusive parents.\nWas diagnosed as depressed and put on antidepressants when I was only 8 😔",
   "created_utc": 1703019341,
   "score": 24,
   "submission_id": "18mb6ob"
  },
  {
   "comment_id": "ke5qegp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18mb6ob"
  }
 ]
}