{
 "submission_id": "18mdb2b",
 "title": "People who fixed a sexless relationship what did you do?",
 "selftext": "",
 "created_utc": 1703021952,
 "permalink": "/r/AskReddit/comments/18mdb2b/people_who_fixed_a_sexless_relationship_what_did/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/18mdb2b/people_who_fixed_a_sexless_relationship_what_did/",
 "comments": [
  {
   "comment_id": "ke3y4pj",
   "message": "Started working out and got my sex drive back",
   "created_utc": 1703029916,
   "score": 164,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke41uzb",
   "message": "She stopped taking birth control, and I got a vasectomy. Her hormones went NUTS when she stopped, and we were having sex constantly. My penis actually hurt. It was such a good pain because we were finally having good, passionate, frequent sessions again. Like how we did when we first got together. Eventually, her hormones leveled out, and now we do it about 2-3 times a week. I felt so unattractive when she didn't want to have sex. She said she did love me and she was still physically attracted to me, and she wished she had wanted to be more intimate. She was always dry and just never seemed to enjoy herself. She said it was the pill. It was the hormones. I didn't believe her. I was like, no way, can a hormonal pill do that to you. Yeah, I was wrong. I feel terrible now for all the shit she had to put up from me about sex. Sex is very important to both of us, but when she was on the pill, she felt like she was constantly on her period. When she's on her period, she says she feels zero sexual desire and doesn't even want me touching her. I couldn't believe the difference after she got off the pill. It made me feel so terrible to know that she basically didn't feel like herself for 5 years.\n\n\n\nI'm just gonna add this edit because I've gotten this question a lot. Her sex drive returned as soon as she finished her period, following her not taking the pill. It was about 2ish weeks? She's also had an endometrial ablation, so she doesn't really have periods anymore. Maybe a day or so. Originally, the pill was suggested to help her intense period pains. Like debilitating period pains where she was curled up in a ball crying. Just downing bottles of midol.",
   "created_utc": 1703031452,
   "score": 66,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3qbn9",
   "message": "My wife and I went over a year without. It was rough. Neither one of us were communicating what we needed, and ended up resenting the other. The key factor here was communication. Once we opened up and acknowledged what the other needed, things have been much better all around. It’s not easy to fix, but like most problems, talking to the other person is the only way.\n\nEdit: Since people keep asking, I kept this vague for a reason. What was discussed is no one’s business but mine and my wife’s.\n\nEdit 2: Since this comment ALSO keeps coming up: Nobody cheated and we didn’t open the relationship. No, I will not be responding further to what happens in my bedroom on Reddit, because I don’t answer to a bunch of strangers with nothing better to do than create drama.",
   "created_utc": 1703026757,
   "score": 227,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3tgj4",
   "message": "I got viagra. Long story short I spent two years not having sex with my wife. Hit my late 30s and things just weren’t working as well as they used to. My wife asked me point blank one day if I wanted to give viagra a try. I was initially offended but she offered me one on the spot. She had gotten it from her best friend whose husband also used them. We had amazing sex that night and I felt this sense of relief. We went at it like newly weds. Three times in 12 hours. I got a prescription and currently use Hims for delivery. We’ve had a great sex life for the last three years. At least twice a week. Many times more than that. Depends on the week.",
   "created_utc": 1703028015,
   "score": 148,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3spkg",
   "message": "Lost weight and started lifting, put my phone down, became helpful around the house, stopped porn, talked it through, and scheduled it 2-3 times a week.",
   "created_utc": 1703027713,
   "score": 64,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3ruxf",
   "message": "I'm still working on mine, but before you let Redditors tell you it can't be done or to end it, try to determine what the cause is:\n\n* Poor communication/trust\n* A medical issue (for women, endometriosis is a common cause but there are many possibilities for both partners)\n* An emotional/mental health issue for one or both partners\n* Stress, anxiety or other life factors (work, financial, family, etc)\n* Infertility\n* Past traumas\n* Physical attraction\n\nAll of these can be addressed to varying degrees, but you both have to be committed to it.",
   "created_utc": 1703027370,
   "score": 217,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3xplx",
   "message": "I had some part of my brain unlocked after doing magic mushrooms.",
   "created_utc": 1703029744,
   "score": 53,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3rtpj",
   "message": "Come on people, divorce isn’t the simple answer to every relationship problem. To start with, lots of sexual problems are caused by illness or side effects of medications. A sexless marriage could be fixed by a visit to the doctor or using a different type of antidepressant. Problems in the marriage can be fixed with therapy.",
   "created_utc": 1703027357,
   "score": 86,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke439h2",
   "message": "We weren't absolutely sexless, but it got further and further apart. Keep in mind, we got 2 kids and have been married 15 years now. It got to the point where I just didn't bother to initiate. She would always prioritize something else, and I had my own issues that made it hard to love me.\n\n\n\nWe talked. And continue to talk.\n\n\n\nI had [have] anger issues partly from my own ptsd, but we also live with her parents, and they are incapable of taking care of themselves, but insist they are (eg: terrible with money, have zero communication and only yell at eachother, refuse to contribute, etc.). A huge part of my \"unattractive traits\" were because I felt I was the only one making sure we treated her folks like adults, and they were responsible for their actions (no money cause they spent it on something stupid like a new speaker set instead of brakes for their car, I'm not lending them money). That's sounds reasonable, but my reaction was not (anger, yelling, being a miserable bastard). \n\n\n\nShe never thought about sex. It was always in the back of her mind. She just couldn't think about being touched or touchy after a day of work and then the kids demanding her attention. She couldn't separate the physical aspects of sex from the mental load her day took on her, and it became a task and more work to an already exhausting day. My love language is touch, so this was more impactful than she thought.\n\n\n\nI told her my issues, and she told me hers. We know what the other person needs and can work on fixing them. THE PROBLEMS ARE NOT FIXED. I need to emphasize that. What worked is that she is actively working on her issues, and I am too. We both see that we're trying, and it's enough. I see her struggles, and I can help her reduce the load. She does the same for me. We are both on the same page and talk about the help we need.\n\n\n\nNow, sex doesn't happen every day. Or every other day. Sometimes, it's a month or so apart. But it's not an issue because I know it's because she had a hard time. Or because I was emotionally unavailable. I know the attraction is there. We just have to keep trying. When we have sex, it's fucking amazing. And we keep trying.",
   "created_utc": 1703032023,
   "score": 124,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke435ge",
   "message": "I found a gyno who actually listened to me and ran a hormone panel. My libido was non-existent for a good long while, and it turned out that my traitorous perimenopausal body decided to stop producing the amount of testosterone it needed. Two weeks after starting a prescription of testosterone, everything righted itself.",
   "created_utc": 1703031978,
   "score": 80,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3x8yi",
   "message": "I lost about 50lbs and now go to gym regularly and now my wife wants to have sex with me almost every weekend now. Didn’t realize how overweight and unattractive I was when I was in my 30’s because I was just working like an idiot all the time. Now I’m in my 40’s and I work normal hours and our marriage is better.",
   "created_utc": 1703029553,
   "score": 54,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3sdrw",
   "message": "My wife and I communicated how we felt about sex in an open, judgment free way.  She told me what she needs, I told her what I need.  She reminded me what gets her going, and I did the same(it can change, believe me).  \n\nMost of these bleak, all hope is gone posts feel like they are from selfish people who cannot view themselves in an introspective way and are probably the reason the relationship ended.  Most of them, not all.  Sometimes, the other person changes and you cannot control that.  It is what it is.  \n\nIf your relationship has a healthy foundation, almost anything can be fixed, most problems avoided.  You need to COMMUNICATE and let them know you love them and care about their needs just as much if not more than your own.  Sex is at least a two person affair, it’s not just about you.",
   "created_utc": 1703027578,
   "score": 66,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3wxwe",
   "message": "Our marriage was never sexless, but we were doing it more than I wanted to and less than he did. We fixed it by addressing the root causes, mainly stress, lack of sleep, conflict, resentment. Nothing physically wrong with either of us. I made a comment a while ago about how I was sleeping better lately and he said “that’s cuz we’re having more sex.” I said “no, we’re having more sex because I’m getting more sleep.”",
   "created_utc": 1703029426,
   "score": 75,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3x02x",
   "message": "We had sex once in 6 months, I was so engrossed in my career that I didn't even realize how unhappy my wife was. The day after thanksgiving she admitted she was unhappy and was considering leaving. We had a long talk, I realized I couldn't convince her to stay, and didn't want to have to convince her, because I didn't want her to resent me later for convincing her to stay in an unhappy relationship. We filed for divorce this past tuesday, she's gotten herself an apartment and started moving this past weekend. Our divorce should be finalized before 12/31 (when nothing is contested it's REALLY quick in our state apparently). \n\nSince we agreed we should split, we've had more frequent, more varied, and (IMO) more fulfilling sex than we ever did while we were married. We know it's not going to help us move on, we know it may not be the healthiest thing in the world, but frankly the sex is amazing and we'd both been missing that for awhile.",
   "created_utc": 1703029451,
   "score": 140,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3tf9m",
   "message": "We broke up.\nSex was great and frequent again as exes.\n\nDesire, missing the other person, not seeing each other always, don't have to have sex, just want to.\n\nAll those are quite beneficial.",
   "created_utc": 1703028001,
   "score": 119,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3r976",
   "message": "We always thought scheduling sex was bad and took away the magic at first but our sex was so infrequent that we just never had it. \n\nBut then we decided that it’s better to have scheduled sex than no sex so we just schedule it every Wednesday and Saturday. Obviously there are exceptions but the expectation is we get freaky as per our schedule",
   "created_utc": 1703027130,
   "score": 33,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3o5yv",
   "message": "I fixed it for the wife but the husband didn’t have much luck",
   "created_utc": 1703025917,
   "score": 37,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke4ryhm",
   "message": "The thing no one talks about when sex stops is that the one person in the world that is supposed to desire you no longer does. It plays on your I securities in the worst way.",
   "created_utc": 1703042472,
   "score": 50,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3ob0k",
   "message": "Sex is the canary in the coal mine… \n\nMy canary died, we sought counselling, turned out to be so much wrong with us. We separated. I’m happily divorced in a long term full-of-sex relationship",
   "created_utc": 1703025971,
   "score": 157,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3znpa",
   "message": "In my upper 50’s started TRT treatment and it was a miracle! Sex , mood , energy major league improvement.highly recommended to any man any age",
   "created_utc": 1703030546,
   "score": 22,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke4idkf",
   "message": "We ended the relationship and I discovered that despite the relationship making sense in every other way, we lacked sexual compatibility.",
   "created_utc": 1703038301,
   "score": 10,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3qrrk",
   "message": "not sure if i’m qualified enough to be responding to this, but usually finding the root of the cause is helpful. it also depends on if the relationship was always ‘sexless’ or the situation is acute, yk? if it was always that way there’s kinda nothing you can do, but in acute situations is where there’s a possibility of something lacking in the relationship or even trauma. maybe something is lacking in the relationship. sometimes when your partners needs aren’t met (love languages!) then you’ll lose pieces of the relationship.\n\nor your partner developed some ick and doesn’t want to bang anymore. \n\nside note: the cheaters in here are mighty proud. ur gross and weird. 👀",
   "created_utc": 1703026935,
   "score": 91,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3zjxd",
   "message": "I started meditating. Slowly realized I didn't \"need\" it. Slowly stopped pressuring my wife for it and acting like a dick when I didn't get it. The less I pressed for it, the more she wanted it. Now the tables have almost completely turned and the dynamic is much more balanced and healthy. Coming to the realization that I didn't need sex was the most liberating thing that ever happened to me. We could help a lot of dudes by changing the social story that guys are horn dogs who want sex all the time.",
   "created_utc": 1703030502,
   "score": 83,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3nibs",
   "message": "My first husband stopped the sex immediately after we married. I was baffled and hurt, and kept trying to fix it—for three years—until I realized I couldn’t. The problem wasn’t mine to fix. \n\nThe day I decided to divorce him was one of the best days of my life.",
   "created_utc": 1703025665,
   "score": 196,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke4olzj",
   "message": "I'm in a sexless marriage right now. I've tried penciling it in, I've tried telling her it's an issue, I've tried being spontaneous, I've tried being romantic,  and I just finally gave up.  Even when we do have sex it's just having sex with a blow-up doll. There is no effort. So I've given up.  Everyone in my life save a select few of my buddies think I'm making a mistake, but I'm so unhappy I sat in my truck with my gun in my mouth for an hour. The only reason I didn't pull the trigger is because of my daughter. I'd love some advice if anyone on here has any.",
   "created_utc": 1703040979,
   "score": 42,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3w5rs",
   "message": "Changed partners",
   "created_utc": 1703029107,
   "score": 59,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke47i1x",
   "message": "Got a better man.\n\nIt was sexless because he helped with nothing. I had no time or energy to do anything. He was useless as a “partner” and I had a lot less work once I divorced him. \n\nThe next guy I was with was a true partner. Helped me with things around the house without being asked. Would make dinner without me having to tell him to, and would grab the kids (not even his!) from after school events when I was busy.\n\nI wanted to have sex all the time, then, because I could see him as a partner and not a 4th man-child I had to take care of.",
   "created_utc": 1703033760,
   "score": 64,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke53jfa",
   "message": "I have always heard of the 10-second kiss working well. Whenever you kiss goodbye or goodnight, do it for 10 seconds, uninterrupted, and quiet. It reminds you of why you are attracted to each other.",
   "created_utc": 1703048089,
   "score": 6,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke5hstp",
   "message": "I got a divorce. After 8 years. I had been telling her quarterly how miserable I was and how unsustainable it was for 5 years and still she was completely surprised when I said I wanted out. Any person who can only hear you when they have something to lose doesn't deserve to be with you.",
   "created_utc": 1703056895,
   "score": 5,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke63wc6",
   "message": "We broke up😂 she kept using sex as a punishment for me doing things she didn’t like, after about 3 months of going from 5-7 times a week to 1 time a month and her being bitchy to me all the time I left. We got back together a couple months later and I set clear boundaries saying I will never allow that or be in a relationship where sex is withheld to teach me a lesson or to punish me because my partner isn’t getting their way. Year and a half later we’re still going strong and very sexually active even after fighting etc. I guess communication is key and standing up for yourself even if it’s socially looked down upon. Fuck social norms if you’re not happy… referring to people saying girls don’t owe you sex and they aren’t just body’s. Well to me I’m constantly horny and I connect with my partner via sex, I only date people I’m extremely attracted to so withholding sex is like torturing me and it screws with my emotions big time. Just gotta tell people what you want and leave it up to them to decide",
   "created_utc": 1703073715,
   "score": 5,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke6xs11",
   "message": "I left her for a woman who would put out and it was the best thing I ever did.",
   "created_utc": 1703087463,
   "score": 6,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke3sfzj",
   "message": "TDLR, I left. \n\nLong story/trauma dump version is:\n\nI talked to him. Asked him why he was still into hentai but not into me for the last year. His response was that my birth control changed the way I smelled and I needed to get off it. Background story is I had removed my non-hormonal IUD at his request 2 years prior. We blatantly decided together to get pregnant and get married. At that point, I got pregnant, but he never married. I terminated as that child would not have a reliable father and I didn't want to be a single mother.\n\nGave him a second chance a year later and he fell right back into manipulation. Sometimes people just get depressed and lose their sex drive, and other times people straight up use it like a chess piece. Very gross. Used the purest hopes and dreams to manipulate me. He later told me he knew what he was doing and it was retaliation.\n\nI prefer being alone now :)",
   "created_utc": 1703027603,
   "score": 49,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke4q58o",
   "message": "My wife and I finally decided to see a sex therapist. Couldn’t recommend it more. We are learning how to communicate so much better with our therapists help. It’s been a huge change. Learning how we’ve both been affected by religious trauma/expectations and what our wants and needs are and where they stem from. The biggest barriers to entry are your own pride as well as cost of course.",
   "created_utc": 1703041651,
   "score": 11,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke4sc3i",
   "message": "Divorced. That was not the main reason by any stretch of the imagination, but I can’t imagine ever putting myself in a situation where intimacy from my girlfriend or wife is not as important to her as it is to me. The feeling of rejection and lack of it in a relationship is a real mind fucker.",
   "created_utc": 1703042642,
   "score": 5,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke54asp",
   "message": "I don’t have an answer - this thread is helping me just as much as you, OP. I just hope it works out for you. I really do.",
   "created_utc": 1703048499,
   "score": 4,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke5si72",
   "message": "I got the fuck out of there",
   "created_utc": 1703065269,
   "score": 5,
   "submission_id": "18mdb2b"
  },
  {
   "comment_id": "ke44dff",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18mdb2b"
  }
 ]
}