{
 "submission_id": "18midv3",
 "title": "What is a very bad statistic people should know?",
 "selftext": "",
 "created_utc": 1703035937,
 "permalink": "/r/AskReddit/comments/18midv3/what_is_a_very_bad_statistic_people_should_know/",
 "score": 177,
 "url": "https://www.reddit.com/r/AskReddit/comments/18midv3/what_is_a_very_bad_statistic_people_should_know/",
 "comments": [
  {
   "comment_id": "ke5o6hb",
   "message": "70% of former foster care youth are arrested at least once before age 26 :(",
   "created_utc": 1703061760,
   "score": 160,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke58kxq",
   "message": "If you go in cardiac arrest outside the hospital, even with first responders nearby, your chances of getting out of the hospital alive is less than 10%.",
   "created_utc": 1703050859,
   "score": 78,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5n854",
   "message": "Despite all the fearmongering about serial killers and unknown attackers coming out of the dark, if you were to become a murder victim it is very likely that you knew the murderer.",
   "created_utc": 1703061007,
   "score": 163,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5p8ij",
   "message": "Is something people who are bad with statistics should know acceptable too? \n\n% increase or decrease means *nothing* without the baseline. They don't add up either.   \nA 10% increase of a 4% chance to get cancer means it's now a 4.4% chance to get that cancer. Not 14. \n\nAn x-fold increase of something is useless without the baseline too. 3 times more likely to get a cancer that usually occurs in 4% of the population gets you to 12%, but a 3x increase of something that happens 0.4% of the time is 1.2%, not that spectacular an effect.\n\nFor the individual neither matters, if you get it, it sucks.",
   "created_utc": 1703062614,
   "score": 161,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4mpud",
   "message": "1 in 4 known pregnancies end in loss. That's 25% folks.",
   "created_utc": 1703040162,
   "score": 82,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5ssua",
   "message": "The Pine Ridge Indian Reservation has 80% unemployment, 50% living below the poverty line, a life expectancy of 50 years (shortest in the Western Hemisphere), infant mortality rate 5 times the national average, suicide rate 4 times the national average, 85% of families are affected by alcoholism, 25% of newborns are diagnosed with fetal alcohol syndrome, and school dropout rate is 70%. This is in the middle of the United States.",
   "created_utc": 1703065511,
   "score": 20,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4lkga",
   "message": "Approximately 42% of Americans are deficient in Vitamin D according the NIH. \n\nSick all the time? Vitamin D boosts immunity. Hair falling out? Vitamin D helps stimulate new hair follicles. Are you a woman nearing menopause? Your bones need calcium and your body absorbs it poorly if you're deficient in Vitamin D. \n\nBasically, we need the D.",
   "created_utc": 1703039674,
   "score": 61,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5hu90",
   "message": "Depressed people are much more accurate when it comes to self assessment. Which is depressing.",
   "created_utc": 1703056923,
   "score": 189,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4nr55",
   "message": "If a partner strangles you, the odds they will murder you within the next year increases by 750%. \n\nAlso, the leading cause of death for pregnant women is homicide.\n\nEdit to add: google is free if the statistics interest you. The main takeaway is: if someone strangles you, they don’t give a fuck if you breathe. Consider that and leave when possible.",
   "created_utc": 1703040611,
   "score": 188,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5h07n",
   "message": "27 000 people died every day during WWII on average",
   "created_utc": 1703056315,
   "score": 189,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5xxzi",
   "message": "The divorce rate in the US is not 50%. Divorce has been declining for decades and for first-time marriages the likelihood of divorce is way lower than second marriages or beyond (third, fourth, etc.)",
   "created_utc": 1703069549,
   "score": 15,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke6gidy",
   "message": "Working out in any capacity decreases your likelihood of death from cardiovascular disease, dementia, and cancer by 14%, on average. This compounds over time. \n\nReally insane when you think about how important physical activity is to human function.",
   "created_utc": 1703080391,
   "score": 110,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5f4sj",
   "message": "Every 10-centimeter increase (about 4 inches) in height was found to be associated with a 14% increased risk of developing colorectal cancer.\n\nThe average height in the U.S. for men is 5 feet, 9 inches, and for women it is 5 feet, 4 inches. This means men who are 6 feet, 1 inch and women who are 5 feet, 8 inches (4 inches/10 centimeters above the average U.S. height) or taller are at a 14% increased risk of colorectal cancer and a 6% increased risk of adenomas",
   "created_utc": 1703054996,
   "score": 75,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke6aw42",
   "message": "When someone gives you a percent, it means nothing without the absolute number. \n\n“There’s been a 100% increase in violent crime in X Town this year.”\n\nNot great, but not worrying when you find out here were 2 last year and still only 4 this year. \n\nThe media are terrible at this for sensationalism. \n\nThe flip side is sadly also used to confuse as well. \n\n“The cost of building this road/train station/hospital went up by £100 million” \n\nOnly to find out that the total cost is £17 Billion and that £100m is an acceptable error in the original quote. \n\nSo many people don’t understand how stats are manipulated, and this also goes for journalists who sometimes just parrot the headlines.",
   "created_utc": 1703077679,
   "score": 15,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4htv7",
   "message": "An estimated 9 million + tons of plastic waste end up in the ocean each year",
   "created_utc": 1703038066,
   "score": 209,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4ouq1",
   "message": "Daytraders tend to lose money. 90% of them do and I’m undervaluing that number. \n\nProceed with utmost caution when expirimenting with the stock market.",
   "created_utc": 1703041086,
   "score": 128,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4xkz1",
   "message": "The bottom 15% of IQ is considered too troublesome to be trained for any use by the military",
   "created_utc": 1703045079,
   "score": 41,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5z0cp",
   "message": "The richest 1% of the world's population own more than twice as much wealth as the remaining 99%.",
   "created_utc": 1703070358,
   "score": 136,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4foy8",
   "message": "Only 65% of people have access to internet",
   "created_utc": 1703037168,
   "score": 239,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5cvon",
   "message": "There’s 2,000 active serial killers in the world right now. Also, if you were to be murdered, there’s a 1 in 3 chance the case will never be solved and the killer will never be identified. Sweet dreams 😉",
   "created_utc": 1703053486,
   "score": 28,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4ldc3",
   "message": "If you have friends and smoke a pack of cigarettes a day you’ll live longer than a nonsmoker who has no friends",
   "created_utc": 1703039590,
   "score": 41,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5necj",
   "message": "Half of all children living in single parent families live in poverty.",
   "created_utc": 1703061144,
   "score": 245,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4nggk",
   "message": "If a woman becomes seriously ill, there is a 21 percent chance her husband will leave her. \n\nIf a man becomes seriously ill, there is a 3 percent chance his wife will leave him.",
   "created_utc": 1703040483,
   "score": 71,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke6euig",
   "message": "Suicide is one of the leading causes of death in men under 50\n\nMen suicide rates are higher while women suicide attempts are higher",
   "created_utc": 1703079622,
   "score": 40,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5pkjf",
   "message": "According to the RAINN, only about 5% of (the estimated number of) sexual assaults will actually lead to an arrest. And only about half of THOSE lead to incarceration of the suspect. So that’s like 2.5 percent of rape cases being punished with jail time.",
   "created_utc": 1703062889,
   "score": 221,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4dlx5",
   "message": "The USA incarcerates more of its own citizens both per capita and for total amounts. They jail over 400k more citizens than china, which has 4.5x the population and has zero freedom of speech and a pretty punishing government. For profit prisons is legalized slavery.",
   "created_utc": 1703036294,
   "score": 105,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4vfqf",
   "message": "The mortality rate for black women during pregnancy is higher. Black women are more likely to have preclampsia, placenta previa, and gestational diabetes during their pregnancy.",
   "created_utc": 1703044063,
   "score": 42,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5vc8p",
   "message": "Pollution from fossil fuels kills more people **Every Day** than nuclear power has killed in its entire history",
   "created_utc": 1703067537,
   "score": 46,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke68hhp",
   "message": "80% more likely doesn't mean 80% chance.",
   "created_utc": 1703076406,
   "score": 67,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5xdfj",
   "message": "Contrary to popular belief, the chances of being killed by a *T. rex* in the wild are exactly zero. They're pretty much harmless.",
   "created_utc": 1703069114,
   "score": 27,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5amxv",
   "message": "50% percent of statistics you see online are just made up bullshit 75% of the time.\n\nAnd the other 35% doesn't even add up right!",
   "created_utc": 1703052075,
   "score": 10,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5kh6y",
   "message": "The US Pentagon cannot account for 63% of its defense spending.",
   "created_utc": 1703058890,
   "score": 31,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4nokh",
   "message": "10% of Americans born in 1970 have died so far. [Find your birth year here!](https://www.chicagotribune.com/featured/sns-ws-people-alive-year-you-were-born-20210817-5i5nfctosrhzxnbxmbprx2kz4a-photogallery.html)",
   "created_utc": 1703040581,
   "score": 29,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke4f48h",
   "message": "100% of people who drink water in their lives will die.",
   "created_utc": 1703036927,
   "score": 20,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5sgqi",
   "message": "As a woman, my partner is statistically the most likely person to murder me. Also, when you're in a DV situation, the most dangerous time, the time men tend to kill their partners the most, is when they're leaving. \n\nI live in Australia and we have AT LEAST one DV death per WEEK. It's a scary statistic but I'm hoping it might save someone",
   "created_utc": 1703065235,
   "score": 215,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5hpa8",
   "message": "1 in 14 American adults believe chocolate milk is from brown cows\n\n1/10 UK mothers don’t know for certain their child’s dad",
   "created_utc": 1703056822,
   "score": 76,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke6haj5",
   "message": "60% of Americans will never read a book again after they graduate highschool. 40% for graduate students after they receive their masters/phd",
   "created_utc": 1703080748,
   "score": 36,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke5rij7",
   "message": "A single squirrel can produce 4 pints of milk in a single day",
   "created_utc": 1703064460,
   "score": 87,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke6s5jz",
   "message": "According to psychological studies, on average the late-40’s are the age when people are the least happy. Several factors contribute to this…you could be dealing with empty-nest syndrome for the first time as often at this age kids are old enough to leave home, you could be feeling the financial crunch of putting said kids through college, turning 50 soon could be weighing on your mind, there’s a likelihood you’ve lost at least one parent by this time, you could be burnt out on your career but still years away from retirement, and many women have begun going through menopause at this time.\n\nBut the good news is, people then to be much happier by the time they reach their mid-50’s, so if you’re in your late 40’s and are battling with some of these things, just hang in there.",
   "created_utc": 1703085315,
   "score": 19,
   "submission_id": "18midv3"
  },
  {
   "comment_id": "ke59uzo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18midv3"
  }
 ]
}