{
 "submission_id": "18mniz2",
 "title": "Which item priced under $50 has had the most significant impact on your life?",
 "selftext": "",
 "created_utc": 1703052051,
 "permalink": "/r/AskReddit/comments/18mniz2/which_item_priced_under_50_has_had_the_most/",
 "score": 213,
 "url": "https://www.reddit.com/r/AskReddit/comments/18mniz2/which_item_priced_under_50_has_had_the_most/",
 "comments": [
  {
   "comment_id": "ke5j91i",
   "message": "Sheet fasteners.  they're under 10 bucks.  my mattress topper, and mattress are just too tall for fitted sheets. even though i buy \"extra deep pocketed fitted sheets.\"  now my fitted sheet stops sliding off the bed and bunching up at night.  it's saved me endless irritation.",
   "created_utc": 1703057965,
   "score": 90,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke65ree",
   "message": "Boot dryer. \n\nPurchased while on sale at Amazon for me by a friend, and it has attachments to dry out both wet boots and gloves. I'm also an amputee, so I use it to dry out the liners I wear on my leg after washing them. I used to have to cringe while I dragged a cold liner on in the morning, and now I can just heat that sucker up in the morning too. \n\nGame changer.",
   "created_utc": 1703074846,
   "score": 234,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke65hws",
   "message": "Meat Thermometer (fast acting).\n\nI used to overcook meat all the time just making sure it was done.  When you can poke a thermometer in and get an almost-immediate reading of internal temperature, you end up with safe but juicy meat!\n\nIt turns out I use it for a lot of other things as well.  Steaming milk?  Perfect!",
   "created_utc": 1703074689,
   "score": 51,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5koyt",
   "message": "I bought a mushroom shaped lamp that has mirrors on it like a disco ball. Every morning when i wake up my room is covered with light sparkles, and every night the streetlight outside shines on it and covers my room with what looks like stars. It’s my favorite piece of art in my home",
   "created_utc": 1703059054,
   "score": 232,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6qkqz",
   "message": "My dog. Got him for $10.",
   "created_utc": 1703084690,
   "score": 161,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5bivo",
   "message": "My giant hydro flask. That is now 10 years old and covered in layers of stickers from my travels. I drink so much water because of that thing.",
   "created_utc": 1703052623,
   "score": 250,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke69iow",
   "message": "First martial arts lesson, which is always the hardest.  It's been very significant since. New friends, new skills, new lifestyle, new perspective, new purpose.",
   "created_utc": 1703076958,
   "score": 102,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6dfst",
   "message": "That bag of weed 17 years ago that caused us to throw caution to the wind.  Next year he's off to college.",
   "created_utc": 1703078952,
   "score": 194,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6a3k4",
   "message": "I got a really good sandwich at the grocery store down the street.  It was store roasted beef on a hard roll with horseradish cream, lettuce,  tomatoes, onion, and pickles. It cost me seven dollars. I ate it on a bench in the sunlight.  I also had an iced tea with it. I read part of a book on my phone at the time. It was really nice.",
   "created_utc": 1703077267,
   "score": 195,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke63gwb",
   "message": "The drinks I bought for my future wife and her friend when I introduced myself to them in line at a bar 10 years ago.",
   "created_utc": 1703073441,
   "score": 3,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6g73m",
   "message": "Switched to a double-edge safety razor recently, and it's probably the best switch I've ever made.\n\nSmoother shave, smoother skin, less irritation, and you feel like and old-school badass every morning. \n\nI landed on a Merkur-34C handle and Feather blades, for those interested, but opinions on those vary a ton.",
   "created_utc": 1703080250,
   "score": 106,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke70xrc",
   "message": "10 bucks worth of chia seeds.\n\nBecause of a muscular issue, I have a slight problem pooping.\n\nI was also gaining weight due to a snacking problem.\n\nAdd to that that my fiber intake was on the low end of normal for somebody without my problem\n\nAnd I was always mildly constipated, and it sucked.\n\nEventually I saw somebody on tictoc (I think it was the happy viking workout guy) say that chia seeds in the morning helped him with his fiber intake.\n\nSo one day when it was bad, I bought some.\n\nTurns out 2 tbsp of chia seeds in a mug of water (wait a half hour) makes for a mostly tasteless pudding with crunchy bits. It hits my snacking perfectly, and chia seeds have almost no calories.\n\nI spend about 15 bucks a month on seeds, I've lost 8 lbs and 2 inches off my belt size, and I'm  never constipated anymore.\n\nMassive QOL change",
   "created_utc": 1703088641,
   "score": 195,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5bdb1",
   "message": "apparently you can develop allergies to foods that you used to eat.\n\ni had not eaten carrots in some years, because i was never really a fan but my mom would make me eat them as a kid.\n\nso anyway, i had some carrots this year and almost straight up died, they nearly choked me to death by swelling up my throat and closing the air way.\n\nlater at the ER i was told that i had become deathly allergic, so now i must be super vigilant.\n\nso thats the story of how a 12 dollar bag of carrots had a huge impact on my life.",
   "created_utc": 1703052523,
   "score": 160,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5az3q",
   "message": "[deleted]",
   "created_utc": 1703052283,
   "score": 85,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6r3lt",
   "message": "Merino wool socks. My feet and shoes stopped stinking and I pack way less when going on trips.",
   "created_utc": 1703084899,
   "score": 168,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5rwzq",
   "message": "I have ADHD and am constantly found without my debit/credit cards, metrocard, cash or ID. \n\nSo I got a phone case with a bunch of card holder pockets in the back. It’s been a few months and it’s working out very well.",
   "created_utc": 1703064790,
   "score": 99,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6jbda",
   "message": "I bought a 64oz insulated water bottle for under $20, and I’ve lost weight from carrying that everywhere and not buying sugary drinks so much.",
   "created_utc": 1703081655,
   "score": 111,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6p4s5",
   "message": "Rice cooker, we always had one when I was growing up but it died after 30y of service so 6 years ago I bought a bigger rice cooker and I can't live without one, the rice is so good and you can press the keep warm button to keep your rice dishes warm !",
   "created_utc": 1703084106,
   "score": 53,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5v1dk",
   "message": "2m charger cable for phone, so I can use the phone in bed while charging\n\n\nAcrylic box for q-tips, so I don't have to endure the micro-aggravation of closing the flimsy cardboard box they come in\n\n\nCamelbak 0.7 liter waterbottle with magnetic flip top, a water bottle is a must, but the genius is the flip top that makes it easy to use but still prevents spills if you knock the bottle over\n\n\nUSB-hub so I don't have to keep un-plugging the least used charging cables between uses\n\n\nPlastic clips to easily close bags of chips etc\n\n\nA plastic box and metal measuring spoon for laundry detergent, the cardboard box it comes in isn't airtight and the detergent would clump \n\n\nBasically anything that removes small but frequent annoyances, the water bottle is the MVP though.",
   "created_utc": 1703067297,
   "score": 73,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6phg0",
   "message": "My turtle, his name is Verne. He cost me 20 bucks when I was 8 back in 2017. I was, and am going through a lot of things mentally and physically. He's turning 13 in March as I got him when he was 6.we all call him \"wide load Verne\" because he's the size of a watermelon. And because he likes watermelon, chicken, ham, pork chops, steak, hamburger, etc. Him and the dog share prices of chicken together. That turtle has a cult following in my hometown, he's been to school with me twice, been to the local park many times, and made friends. He helped me through some draining things in life. Thank you Verne boy! After this I better go feed him.",
   "created_utc": 1703084251,
   "score": 45,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6r4gg",
   "message": "[Measuring cup you can read from the top, not side.](https://i.imgur.com/L8ZpFkH.jpeg)",
   "created_utc": 1703084908,
   "score": 125,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5b8e7",
   "message": "We switched litters recently and it’s the best decision and $30 I’ve spent in a long time.",
   "created_utc": 1703052439,
   "score": 32,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5xu5q",
   "message": "Books, books, books, books and more books.",
   "created_utc": 1703069471,
   "score": 83,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6kzh7",
   "message": "Swiss Army Classic, stays in my coin pocket.\n\nToothpick is the most used tool but damn that little thing has come in clutch so many times it's not even funny.\n\nI own about 6 of them and my god they're great.\n\nKnife, nail file, toothpick, tweezers, flathead screwdriver, and scissors. \n\nAll in a package smaller and lighter than a pen or pencil.",
   "created_utc": 1703082373,
   "score": 87,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6dkno",
   "message": "A bidet, saves $200+/yr and keeps me clean.",
   "created_utc": 1703079019,
   "score": 38,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6m6ji",
   "message": "My rescued pup has brought my unconditional love and happiness",
   "created_utc": 1703082888,
   "score": 214,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke9c19i",
   "message": "I traded a $25 bag of weed for some dudes dog at a trap house when I was 19. I had always liked dogs but never sought one out. She was a collie about 2 years old at the time. I felt bad seeing her in such a small dirty kennel.…..She was clingy and very high energy. Because of her separation anxiety I stoped going out late at night. I quit drinking/partying. I started going on daily walks and thanks to her I slowly distanced myself from that group of friends. I had her 11 years , she died last Christmas. She was my baby \u0026amp; changed my life for the better.",
   "created_utc": 1703119725,
   "score": 143,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5dx1g",
   "message": "A set of socket wrenches and an oil filter wrench... Don't know how much money it really saves me but at least I don't have to worry about the local \"we lube it fast\" chain forgetting to tighten the oil plug.",
   "created_utc": 1703054170,
   "score": 83,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5qcb5",
   "message": "Toilet bidet",
   "created_utc": 1703063512,
   "score": 169,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5cgrt",
   "message": "Condoms",
   "created_utc": 1703053220,
   "score": 73,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7rh1i",
   "message": "Possibly the harmonica I bought for about $3.50 in the 1970's.  Still playing the blues harmonica almost 50 years later.",
   "created_utc": 1703098157,
   "score": 32,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6ejmv",
   "message": "boosted myself on Tinder and then almost immediately matched with my now wife",
   "created_utc": 1703079481,
   "score": 216,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6xnrr",
   "message": "Silicon ear plugs. Now I no longer have to listen to my partner snoring or television noises from other residents. I am a light sleeper and those foam earplugs never worked.\n\nGame changer",
   "created_utc": 1703087418,
   "score": 58,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5arze",
   "message": "A coffee maker",
   "created_utc": 1703052162,
   "score": 79,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6g088",
   "message": "A White Noise machine, for sleeping.",
   "created_utc": 1703080164,
   "score": 54,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5gro4",
   "message": "Wireless mouse and keyboard, makes your life easier.",
   "created_utc": 1703056143,
   "score": 118,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6nna2",
   "message": "Squatty Potty",
   "created_utc": 1703083503,
   "score": 75,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5fnw4",
   "message": "As an Arizonan, a built-in retractable car sunshade has been a great investment. I can have my sunshade up in a matter of a couple seconds so I can justify using it for even the shortest errands",
   "created_utc": 1703055359,
   "score": 104,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6nlhv",
   "message": "Menstrual cup",
   "created_utc": 1703083483,
   "score": 96,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5b7lm",
   "message": "Monthly calender. I check it everyday.",
   "created_utc": 1703052426,
   "score": 46,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6nbxu",
   "message": "airtag because now I don’t worry that my dog might get lost",
   "created_utc": 1703083371,
   "score": 44,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5m2bq",
   "message": "Humidifier or dehumidifier depending on where you’re living",
   "created_utc": 1703060105,
   "score": 21,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7h0ij",
   "message": "My Galileo thermometer. I was never able to buy pretty, decorative things to furnish my home while I was married. I wasn't able to do a lot of things. I had to leave everything behind and start over with nothing to save my life - a sacrifice I'd make a hundred times over. \n\nMy apartment had nothing when I moved in. It took a little bit, but I realized this was mine, and my money was mine and no one was going to yell at me. I have always wanted a Galileo thermometer and it had been sitting in my Amazon wish list for 5 years. $39.99 on a knick-knack and it felt amazing. Proof I was finally in control and this was my safe space. I know it's just a piece of decor, but it's my trophy for beating the odds so heavily stacked against me.",
   "created_utc": 1703094437,
   "score": 21,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5b9b6",
   "message": "Hair straightener and I’m being serious",
   "created_utc": 1703052454,
   "score": 57,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5aujk",
   "message": "Bought a bag of assorted mystery pills for $20. Took em all at once, saw god, and then went on a year long spiritual journey that ended with me finding inner peace",
   "created_utc": 1703052206,
   "score": 56,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7bq65",
   "message": "Hello Buzzfeed, nice to see you again",
   "created_utc": 1703092551,
   "score": 89,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke71wcf",
   "message": "A prism crystal thing. It's hanging in my kitchen and when the sunlight hits it, there are rainbows everywhere. Such a small thing but it brings me so much joy.",
   "created_utc": 1703088999,
   "score": 36,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7dzug",
   "message": "Sno-cone machine.  No joke.  $44.95 on Amazon.  I get to enjoy my favorite dessert without chasing the ice cream man down the street.",
   "created_utc": 1703093360,
   "score": 15,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6vmjd",
   "message": "No single item, bunches of them, we are an ADHD household, which means everyone picks stuff up, walks away with it, and its never where it should be... buying duplicates and bulk of regular use items we ALWAYS need but never can find has been massive.\n\n\u0026amp;#x200B;\n\nwe have a pair of scissors in every room, and like 3 in the kitchen, we have at least 5 pairs of finger nail clippers and tweezers throughout the room, we have phone chargers all over the place that make it so you never ever unplug an take one with, because you know there is another charger there. the weekly pill containers so you always know if you took your meds, extra entire set of silverware so if we don't run the dishwasher we still have utensils, a bunch of hampers so no matter where you are changing clothes, there is one RIGHT there, and trash cans right beside where we regularly eat...\n\n\u0026amp;#x200B;\n\nunderstanding what drives stress, anxiety, and then anger / frustration and just cheaply eliminating it has been massive",
   "created_utc": 1703086648,
   "score": 41,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6d61o",
   "message": "When I was a kid I had a teddy bear my mother gave me as a toddler. It was my \"security blanket\" through a pretty shitty childhood and i couldn'tbe seperated from it. I still had it when I was 16, right up until my boyfriend at the time got jealous of it and threw it away. I was devastated and never felt the same. \n\nOne day, a few years later, my mother and I were walking through a Kmart and I spotted a really sweet little teddy bear with a lambs outfit on. I don't know why but I bonded with it immediately, and my mother purchased it for me. $15 and 20 years later, I still have it, and it replaced my first bear as my \"security blanket\". 39 years old and can't sleep without it.",
   "created_utc": 1703078816,
   "score": 62,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6b2h0",
   "message": "[removed]",
   "created_utc": 1703077770,
   "score": 17,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7zffo",
   "message": "Someone needs last minute Christmas gift ideas",
   "created_utc": 1703101013,
   "score": 14,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5k06z",
   "message": "Ear plugs",
   "created_utc": 1703058537,
   "score": 33,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6i34t",
   "message": "My cast iron pan.",
   "created_utc": 1703081108,
   "score": 32,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7d01o",
   "message": "Back in 2012 a friend of mine found a little pit bull abandoned at the side of the road. He couldn't keep her, and after some other friends flaked out she wound up coming to live with me, where she cuddles me every night.\n\nDidn't pay a dime for her.",
   "created_utc": 1703093005,
   "score": 32,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7mp1n",
   "message": "My dog who was $35 at the humane society 🤣",
   "created_utc": 1703096456,
   "score": 12,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6vmm3",
   "message": "Glass Hario V60 pour over. I take so much more pride in the coffee that I make. Put time and care into my method for brewing, found quality coffee roasters, and have changed several people into black coffee drinkers (from former cream/sugar users). If I can help contribute to someone else’s morning by turning them on to better coffee, then it’s just the gift that keeps on giving.\n\nA little part of my soul lights up when I get a compliment over coffee. ☺️",
   "created_utc": 1703086648,
   "score": 12,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6kgrq",
   "message": "Houseplants to help with humidity. We've always struggled with damp and mould in winter. An appropriate plant on each windowsill things are much better",
   "created_utc": 1703082152,
   "score": 26,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke72hl7",
   "message": "I bought a hit of acid for a couple bucks at a Dead show in the 80s. Legit changed my life",
   "created_utc": 1703089219,
   "score": 26,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke72etm",
   "message": "For less than $10 I got a 3 foot wide mouse pad. I will never, ever again drag off the edge!",
   "created_utc": 1703089191,
   "score": 11,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6rp9w",
   "message": "Sertraline/Zoloft, with my insurance it's $3/month. My life is infinitely better on Sertraline!",
   "created_utc": 1703085137,
   "score": 47,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6s548",
   "message": "I bought a usb battery that's about the size of a pack of cards. It's functionally like having a portable outlet. I can get two full charges of my phone from 0% to 100%. When it's dead, I charge it over night and good to go.\n\nSo if there's an experience I want to have and the device is almost dead, don't have to pause it... like say a dead controller, or my phone almost dying or a dead remote... I just grab this brick and don't have to think about it.\n\nNot exactly significant... but we're talking only $50.",
   "created_utc": 1703085310,
   "score": 22,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7d9gh",
   "message": "I read an article about early onset dementia (EOD). A study involving more than 10,000 cases had indicated a strong correlation between EOD and lack of creative outlets, increased further if the person was in a technical or anaæytical field of work. I am a MSc in Business administration and computer science.\n\nYeah. I felt like having a bullseye on my forehead.\n\nI read the study. Activities that countered this heightened proclivity for EOD included sports, learning a new language, writing, playing an instrument, other crafts and creative outlets, and playing many different board games.\n\nSo I bought a cheap 45 USD guitar. I just wanted to see if it was for me and whether I had the dexterity to even play. Three months later I bought a nice guitar and I've played in the eight years since. Not professionally but for myself and it's really nice to just get into the flow, practice, getting better, and I really enjoy it.\n\nSo that first guitar was a great purchase.",
   "created_utc": 1703093097,
   "score": 9,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5apun",
   "message": "bible. it fell on my toe and broke it",
   "created_utc": 1703052125,
   "score": 66,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5jd3y",
   "message": "Infrared thermometer. Makes cooking less annoying easily knowing how hot pans are.",
   "created_utc": 1703058050,
   "score": 37,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6d423",
   "message": "They’re more expensive now, but back when I bought our Drinkmate carbonator in a Black Friday whim some ten years ago it was like 50$. Helped me kick my soda habit and not rack up the waste and cost of canned or bottled seltzer, and I stay way more hydrated! I love that damn thing.",
   "created_utc": 1703078788,
   "score": 8,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke5c3w2",
   "message": "Condoms",
   "created_utc": 1703052992,
   "score": 14,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke6n3uf",
   "message": "Mesh wash bags for washing delicate clothes in a regular washing machine cycle. Saves so much time not having to hand wash",
   "created_utc": 1703083277,
   "score": 14,
   "submission_id": "18mniz2"
  },
  {
   "comment_id": "ke7hq8v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18mniz2"
  }
 ]
}