{
 "submission_id": "18mq7ru",
 "title": "Which urban legend turned out to be true?",
 "selftext": "",
 "created_utc": 1703062700,
 "permalink": "/r/AskReddit/comments/18mq7ru/which_urban_legend_turned_out_to_be_true/",
 "score": 210,
 "url": "https://www.reddit.com/r/AskReddit/comments/18mq7ru/which_urban_legend_turned_out_to_be_true/",
 "comments": [
  {
   "comment_id": "ke6aqzn",
   "message": "In Pennsylvania, there was a local legend in a town about a \"green man\" who could be seen walking the roads at night. It turned out to be a severely disfigured man who'd walk at night to avoid scaring people. I always felt so bad for the guy.\n\nHere's the story:\n\nhttps://en.wikipedia.org/wiki/Raymond_Robinson_%28Green_Man%29?wprov=sfla1",
   "created_utc": 1703077606,
   "score": 217,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke79xwe",
   "message": "There was an urban legend in the UK about a guy called Purple Aki. The rumour was he was a giant bodybuilder who roams around Liverpool asking young men if he can squeeze their muscles and then asks if he can squat them. I heard it as a London teen years ago and thought it was a hilariously bizarre urban legend from those crazy kids in Liverpool.\n\n\nThen it came out a teenager died after running away from him and accidentally getting hit by a train while trying to get away and suddenly the real Purple Aki was all over the news.",
   "created_utc": 1703091911,
   "score": 216,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke797rv",
   "message": "Howard Hughes is the archetypal super-rich hermit.  One of the world’s richest men, in his later years he locked himself in a hotel penthouse, never trimmed his nails and kept his urine in jars.  All of these peculiarities were all rumored, but he had a well-paid PR team whose self-interest was to deny these rumors.  Mostly all true.",
   "created_utc": 1703091650,
   "score": 159,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7ks8w",
   "message": "There was a haunted house in West Hobart, Tasmania, Australia that would slowly send everyone living there crazy over a period, it turned out there was an overgrown water tank in the yard with a hidden Datura plant growing above it that would drop flowers onto the tank, the people living there were micro dosing a deliriant.",
   "created_utc": 1703095774,
   "score": 106,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7dztd",
   "message": "A contestant on The Newlywed Game answering the question \"Where's the weirdest place you've had the urge to make love?\" with \"In the ass\".  \n\nThe show's host, Bob Eubanks, had sworn for decades that the clip wasn't real and was a false memory, and he even offered a 10,000 dollar reward if anyone could ever find the clip. Since the host had denied it, and there were several similar rumoured incidents on game shows that had been proven false, people started assuming this one was also a false memory.\n\nTurns out the clip was real and a Game Show Bloopers special in 2002 ended up airing it.\n\n[Here's the clip](https://m.youtube.com/watch?v=ZiARvvemLlk\u0026amp;pp=ygUbbmV3bHl3ZWQgZ2FtZSBpbiB0aGUgYmVoaW5k)",
   "created_utc": 1703093359,
   "score": 251,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke791w7",
   "message": "I live in Lima Peru and I heard people talk about a clown that pops up at around 3am at an intersection. Sure enough, some nights at 3am there is a clown at the intersection that juggles balls and gives you balloons. Don't ask",
   "created_utc": 1703091593,
   "score": 40,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7hig4",
   "message": "\"Dingo ate my baby.\" A dingo really did. Poor woman.",
   "created_utc": 1703094614,
   "score": 12,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7vkqb",
   "message": "The rogue waves.\n\nFor centuries sailors talked about encountering sudden single waves that were described to reach 100ft high. Nobody believed them because everyone assumed these waves were just another one of the stories sailors on leave would make up to impress pub goers.\n\nAs the 20th century came along oceanographic research became more formalised and advanced. Yet no researcher was able to record hard data on these waves, apart from just writing down their own experience getting hit by one. An anecdote isn't really something you can publish.\n\nIn the 1980s the Draupner gas field was disovered on the North Sea and a new type of oil platform was set up there. The engineers outfitted it with an array of sensors including a wave height monitor, to assess the stability of the new design over time. It was only in 1995 that those sensors recorded a single 80ft wave hitting the platform, and rogue waves were finally accepted to be a real phenomenon.",
   "created_utc": 1703099618,
   "score": 75,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke5rjh5",
   "message": "The story about the couple renting a hotel room that stinks and eventually they find a dead body stuffed between the bed mattress and bed frame. Yeah that one actually happened. I think it was in the 60s? I can't remember the exact date.",
   "created_utc": 1703064482,
   "score": 87,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke5q8qs",
   "message": "My university campus has a local urban legend/ghost story about one of its oldest department heads. He was a chemistry professor who invented his own concrete. The story goes that when he died, he asked for his body to be encased in the concrete. There’s a concrete cube memorial that sits on the steps outside of a building on campus named after him, and his corpse is rumoured to be sitting in his wheelchair, forever preserved in the cube.\n\nAccording to a few different art history professors on campus that know a lot about our memorials, the corpse thing isn’t true, but they have said the wheelchair made it in to the cube.",
   "created_utc": 1703063433,
   "score": 53,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke79al3",
   "message": "Starlight Tours: \n\nThere was an urban legend in the Canadian Prairies about a man who would kidnap indigenous people, steal their winter clothes, and abandon them in the middle of nowhere to die in -30 temperatures. \n\nIf someone reported as having died of winter exposure, non-indigenous people might joke that the person was taken on a “Starlight Tour”.\n\nTurns out Starlight Tours were real and that it was the police who were doing it. The police in Saskatoon would grab indigenous people during the winter months and abandon them on the city outskirts to die. These suspicious deaths would then be documented and covered up by a variety of racist notions. \n\nThe indigenous communities would insist that it made no sense for someone to be able to walk that far out of the city without a jacket in -30, but the police wouldn’t investigate and just say “he must have been drunk” (as the police were the ones doing it). \n\nTo many indigenous people, it was never an urban legend but instead an open act of violence. \n\nTo many non-indigenous communities, people thought it was somewhere between an an urban legend or an exaggeration (though I’m sure\nmany knew the truth behind it). \n\nAt least in Saskatoon, this is confirmed to have started at least by the 1990s and went on until the 2000s, but the idea of it goes back to the 70s. I am sure there is more to this outside of Saskatoon, but I don’t know specifically. \n\nDespite there being convictions for related incidents in the police force, no one was ever actually convicted from the police for the Starlight Tours themselves. The same police stations also got in hot water for trying to delete Wikipedia articles about the incident. \n\nhttps://en.m.wikipedia.org/wiki/Saskatoon_freezing_deaths\n\nAs a white guy, I’ve always wondered how this urban legend came into the white-public consciousness. Was it indigenous people sharing this story outside of their communities that eventually led to it crossing over more generally into the regional consciousness; or was the urban legend/cultural-trauma instead being spread by the police officers jokingly sharing their murders with their loved ones",
   "created_utc": 1703091679,
   "score": 0,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke5v53y",
   "message": "E.T. Video games buried in the desert",
   "created_utc": 1703067380,
   "score": 120,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7auei",
   "message": "I grew up where there were some signs of Native Americans. I started believing that this one particularly beautiful spot had to be sacred, and probably was a burial ground. I’d convince my friends to hold hands in a circle and try to commune with the dead. After I got a bit older I was super embarrassed that I’d ever done such things.\r  \n\r  \nA few years later a Native American came but and told us how sacred the land was that we owned, and asked permission to hold peyote rituals with his tribe and others on our land. To this day they still come out and set up a teepee and drum all night, absolutely flying on hallucinogenics.\r  \n\r  \nTurns out I was right",
   "created_utc": 1703092235,
   "score": 130,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke694xq",
   "message": "Florida sewer crocs",
   "created_utc": 1703076754,
   "score": 212,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke79ihc",
   "message": "[The North Pond Hermit](https://en.m.wikipedia.org/wiki/Christopher_Thomas_Knight)",
   "created_utc": 1703091757,
   "score": 121,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7gjg1",
   "message": "Kevin Spacey being a handsy creep with a penchant for younger men was gossiped about like crazy in the circles I was around in 1998, turned out to be true enough based on what we know now.",
   "created_utc": 1703094271,
   "score": 250,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7isaa",
   "message": "Sewer gators are a real thing (especially in Florida)",
   "created_utc": 1703095061,
   "score": 50,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke75jre",
   "message": "Wasn’t a full formed urban legend and don’t know if you can count this as “true” but my cousin went to a high school that students vaguely always said was haunted/cursed. Mostly dumb stories about things moving or dubious claims that someone’s cousin’s brother who graduated 12 years ago swears he saw a ghost combined with catch all explanations for every time the football team lost or the ceiling sprang a leak. \n\nStudents used to say the school was built on a Native American burial ground and that was the curse. “Seminole curse”. \n\nA few years ago, they found out that it wasn’t a Native American burial ground but actually it turns out the school had been built over a cemetery for Black Americans - and unidentified bodies or those who couldn’t afford burials elsewhere. Apparently when the school was built, it was built around the cemetery grounds but over time, the cemetery was forgotten and the school expanded over where it was. (The historian who tracks the records to figure this all out disagrees it was “forgotten” which is probably pretty fair since the school was built in like the 50s not centuries ago). The school also notably, was a segregated school for white students only when it opened.",
   "created_utc": 1703090339,
   "score": 62,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7q597",
   "message": "The university I attended in TX had an urban legend about a student that got lost and died under the maintenance tunnels under the campus. I had always thought it was rumor because many ghost stories were tied ro it.  Until my senior year when I got a part time job  at the university. \n\nTurns out there was an extensive tunnel network under the school that fed steam to the buildings for heat. Anyone who goes into the tunnels is required to have someone with them to prevent another death.",
   "created_utc": 1703097684,
   "score": 131,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7wml7",
   "message": "In my hometown there is a house that was one time used as a safehouse for infamous mobster Al Capone.  The town is situated along the banks of a fairly large river, and some years after this mob safehouse was shut down, a tunnel was discovered underneath it that led to the river, presumably meant to be used as an escape route should the police discover the house while members of the mob were there and needed to get away.\n\nIt was speculated that there may be other tunnels in town, and many of the kids at my high school wondered if there could be tunnels under the school, with the entrances hidden within the building and exits hidden in places just off campus grounds.\n\nThis was summarily denied and dismissed by faculty and staff, and treated as a joke by almost everyone.\n\nUntil… one was found.\n\nThe entrance was discovered in the school auditorium, beneath the stage, behind one of the walls of the orchestra pit.  I went into it once, but took no more than a few steps.  Students who explored deeper into the tunnel said they had gone much, much further, likely as far as the opposite end of campus.  They said it looked like the tunnel went further but was blocked off and locked, and they were unable to see if there was an exit that led back above ground.\n\nEven after its discovery, the faculty continued to deny the existence of any other tunnels beneath the school.  But they could no longer deny that there was at least one.",
   "created_utc": 1703100003,
   "score": 40,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7odr5",
   "message": "Human finger in hamburger. It happened for real some 2 years ago in a fast food franchise called Hot in Santa Cruz, Bolivia.\n\nThe meat grinder operator inserted his fingers in the grinders and lost two of them. He was rushed to emergency care and the next shift arrived and carried on, not having been told about the accident, so one of the fingers made it all the way to a customers mouth. \n\nI didn’t believe it at first until the restaurant owners made their public apology:\n\nhttps://www.la-razon.com/ciudades/2021/09/15/el-dueno-de-hot-burger-pide-disculpas-tras-hallazgo-de-un-dedo-en-una-hamburguesa/",
   "created_utc": 1703097054,
   "score": 75,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke5pkmo",
   "message": "Turns out my house actually is built over a plantation",
   "created_utc": 1703062891,
   "score": 8,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7uu7l",
   "message": "A corpse found in the funhouse, that was being used as a set for the Six Million Dollar Man. Elmer McCurdu was a thief who was gunned down during a Train robbery in Oklahoma in 1911. His body was taken to the Coroners for autopsy, but no one paid for McCurdy’s burial. The body was preserved, so the Coroner started to charge people to see the Mummified remains of McCurdy. His body went on tour, and even showed up in a couple of films. I went missing for a few decades, until the 70s. Part of the crew, for the Six Million Dollar Man, were removing dummies from a California fun house. One of the arms of the dummies fell off, and the workers saw bone, and that was how McCurdy’s body was found. He’s now buried in Guthrie, Ok. They poured cement over his grave, so he can’t go on tour again.",
   "created_utc": 1703099351,
   "score": 72,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7ho4j",
   "message": "Richard III being under a car park.",
   "created_utc": 1703094669,
   "score": 134,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke5sn24",
   "message": "MK-Ultra",
   "created_utc": 1703065379,
   "score": 235,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke82t3k",
   "message": "When I was about 12 years old a friend and I were playing in the woods that were known for being “creepy”. While building a fort, a strange man snuck up behind us and yelled at us to get off his land and never come back yadda yadda. It really startled us as we knew the land was a public area and had never been threatened by an adult before. Several years later we found out he was an actual bank robber, wanted by the FBI for years. We were building our fort a few feet from his stash! Here’s the news article about it. Wiki page Carl Gugasian",
   "created_utc": 1703102213,
   "score": 11,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke84sns",
   "message": "In my town, there was rumours for several years about a serial “car rapist”. Allegedly, some dude would sneak onto people’s driveways in the middle of the night, and have sex with the car’s tailpipe.\n\nLast year, the police arrested a dude for “sexual misconduct involving a motor vehicle”",
   "created_utc": 1703102928,
   "score": 13,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7halv",
   "message": "Kinda backwards, I guess, in that a real incident inspired a much broader urban legend, but the Bunny Man in Virginia started with actual incidents.",
   "created_utc": 1703094536,
   "score": 28,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7l9nm",
   "message": "To preface this, in my country, there's this thing called \"padugo\". To keep things simple, it's basically a blood sacrifice. Slit some poor animal's throat, smear the blood on the foundations, boom, eternal protection.\n\nNow, the urban legend is people in my town used to say that my uncle did that with his hotel. I always chalked it up to \"people talk\", you know, small town gossip/urban legend. \n\nThen an earthquake hit my town a couple years back, my uncle's hotel barely sustained any damage compared to the other places in my town. In one of our conversations he mentioned the blood sacrifice he did when they started building the place and that's when I realized the urban legend was actually real. (He did it again after the place got retrofitted with some more earthquake proofing. I think this time it was a goat.)\n\nEDIT: Apparently, my dad also did a blood sacrifice with our house back in the 2000s. I think it was a chicken or a rabbit.",
   "created_utc": 1703095948,
   "score": 57,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7fcgs",
   "message": "Nixon flodded black neighborhoods with Crack.\nWas a conspiracy theory, then an urban legend, then actually confirmed.\n\nEdit: is was Reagen. Nixions thing was overpolicing ethic neighborhoods.",
   "created_utc": 1703093845,
   "score": 152,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7xl82",
   "message": "The Catholic church knew about the sexual abuses of 10's of thousands of children and covered it up.",
   "created_utc": 1703100349,
   "score": 29,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke79bko",
   "message": "Fisher. A legend that has been told by children in summer camps for 90-s. There was a legend that Fischer brutally murdered pioneers. In 1996, Sergei Golovkin, nicknamed Fischer, was shot for 11 murders with particular cruelty (the boys turned gray before death) and 1 attempted murder.",
   "created_utc": 1703091688,
   "score": 75,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7cxvj",
   "message": "Halifax glove guy.",
   "created_utc": 1703092983,
   "score": 20,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7voen",
   "message": "Wasn’t there a case a few years ago, where a young woman went missing from a hotel? Weeks later, and several guests complain about the taste of the hotel water so hotel staff checks the hotel cistern and finds the dead body decomposed in the hotels water supply.",
   "created_utc": 1703099656,
   "score": 16,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke7plse",
   "message": "Purple aki",
   "created_utc": 1703097493,
   "score": 12,
   "submission_id": "18mq7ru"
  },
  {
   "comment_id": "ke84zuy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18mq7ru"
  }
 ]
}