{
 "submission_id": "18my5o4",
 "title": "Women don’t want cleaning tools/supplies, what do men not want for Christmas?",
 "selftext": "",
 "created_utc": 1703088530,
 "permalink": "/r/AskReddit/comments/18my5o4/women_dont_want_cleaning_toolssupplies_what_do/",
 "score": 109,
 "url": "https://www.reddit.com/r/AskReddit/comments/18my5o4/women_dont_want_cleaning_toolssupplies_what_do/",
 "comments": [
  {
   "comment_id": "ke7a58y",
   "message": "Someone in my family got the (wrong) idea that I like wasabi flavored almonds and I've received the largest bag available the past few years. I keep telling anyone that will listen that I don't actually like them.",
   "created_utc": 1703091983,
   "score": 122,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7g7a5",
   "message": "Generic tool set. Hammer, screwdriver, wrench kind of thing. I could see if I was 23 and out on my own for the first time, sure. But I'm very particular with that stuff now, and I don't need much because I bought the good stuff decades ago.",
   "created_utc": 1703094150,
   "score": 157,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7q2j7",
   "message": "Ducks. I've shared this story on Reddit before, but it's worth sharing again...\n\nTL;DR: [Merry Ducking Christmas](https://i.imgur.com/7vQ6hV2.jpeg)\n\n\nI was shopping with my mom when I was 15. She saw some sort of duck decoration and asked me what I thought of it. I responded with what I thought was bored indifference, \"It's nice.\"\n\nTwo months later Christmas morning came around. I started opening gifts and every present was a duck.\n\nIt was weird at first and then got progressively more and more bizarre, like I was having a psychotic break, but no... My parents and extended family all got me ducks and only ducks that Christmas.\n\nDuck wind chimes, duck candles (including a realistic duck-shaped candle), duck wallpaper, duck figurines, a duck lamp, a duck tissue paper dispenser, duck soap, rubber ducks, a dried flower arrangement with ducks on, two duck cigar boxes, a wooden duck bucket, a few duck paintings, and more.\n\nWhen Christmas was over and I looked to my parents in bewilderment, my mom was honestly confused. In her mind, I'd told her I loved ducks during that shopping trip, and that I'd wanted to decorate the bathroom near my bedroom with a duck theme because ducks were a \"good strong masculine\" bird.\n\nWho says something like that? Not a 15 year old kid, that's who.\n\nAnyway, that was 30 years ago and the bathroom is still decorated in ducks. I tell the story in front of my mom, who is still confused and insists I love ducks.",
   "created_utc": 1703097657,
   "score": 175,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke771ms",
   "message": "I don’t want any silly “tactical” versions of anything.",
   "created_utc": 1703090877,
   "score": 78,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7aj1j",
   "message": "Stuff related to a hobby that's not my own.\n\nEdit: You're all assuming people wouldn't ask you what you need for your own hobby. Just tell people what you need, that's what I do for presents. It doesn't all have to be a surprise.",
   "created_utc": 1703092121,
   "score": 157,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7qn3f",
   "message": "I’m a musician/producer.  Don’t buy me music stuff.  You’ll buy the wrong thing.",
   "created_utc": 1703097861,
   "score": 2,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7pxd0",
   "message": "I'm outdoorsy (or used to be) and I always seem to get some dollar store level \"multi tool\" every couple of years that is borderline useless. I suppose I get it, I asked for a Leatherman Skeletool one year. What they don't seem to understand is that I still have it! It didn't expire or become outdated, and those little keychain sized Swiss Tech things are a waste of steel (and your money)",
   "created_utc": 1703097607,
   "score": 246,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke78445",
   "message": "Anything on those “Best Gifts for Men” lists. \n\n\n\n\nI don’t drink whiskey, I don’t play golf, I don’t own a barbecue, I already have comfortable slippers, I don’t need shaving supplies, I don’t need any tools…",
   "created_utc": 1703091255,
   "score": 166,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7r01v",
   "message": "Reminds me of my favorite gift I ever got someone. A guy friend made me promise not to get him a gift and I did. Normally I am someone that follows through on my promise. He told me it was because he has never gotten a gift that was useful and he was sick of getting useless junk. I was really happy he felt like he could be honest with me\n\nThat said wouldn't you know that year I happened to see the perfect gift for him. We were at the mall picking up Christmas gifts and I look over and there is a Maryland Terpins beer mug. I was like nope I promised. Walked by the firat time and didn't get it. Was walking back down the other side of the mall and noticed it again and was like no. Forgot something and walked by it a third time and was like fuck it and got the gift.\n\nSo at the Christmas party I handed him the gift and was like I am so sorry. I couldn't help myself I tried not to get you a gift. He was scowling while he opened it then got the biggest smile on his face and gave me a huge hug. He was like finally something I can actually use.",
   "created_utc": 1703097988,
   "score": 156,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7jyey",
   "message": "DO NOT BUY ME CLOTHES. I've told practically every woman in my life not to buy me clothes, they never listen. I don't wear anything I haven't tried on and really like. \n\nI have like 10 shirts in my closet that were bought for me as gifts I didn't ask for and I'll never wear them outside of some emergency.",
   "created_utc": 1703095478,
   "score": 28,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7f6h5",
   "message": "My favorite thing about every \"what not to buy\" thread is that you inevitably have a lot of people who would be pumped to receive whatever you think someone would hate. People are fickle one person's thoughtful gift is another person's one way ticket to a breakup.",
   "created_utc": 1703093785,
   "score": 198,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7zosp",
   "message": "Please don't get me two dice-shaped rocks I'm supposed to put in a glass with whisky.",
   "created_utc": 1703101105,
   "score": 72,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7k64y",
   "message": "My mother got me a fire blanket and a device to assist with the Heimlich. Nothing says “Merry Christmas” like visualizing your kid choking to death, or imagining wrapping your wife in a fire blanket as she burns to death. Put those on the list.\n\nOne year, she gave me stuff that was already mine from her house. I would have preferred more of that stuff this year.",
   "created_utc": 1703095554,
   "score": 162,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke74cb2",
   "message": "A generic collection of terrible hot sauces because “we know you like spicy food”.",
   "created_utc": 1703089903,
   "score": 133,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke86t49",
   "message": "Cheap stuff for the sake of having more presents. My parents are really bad with this and buy me like $100 worth of random crap from 5 Below or the end aisles of Kohl's. I don't need a cheaply made bottle opener with a compass or a magnetic fishing game you play while pooping (real gifts I've received and never used).",
   "created_utc": 1703103652,
   "score": 115,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7baf6",
   "message": "My wife has begged for this fancy Dyson stick vacuum for Christmas this year. She is an OCD cleaner and is seriously excited about it. It even has a laser to spot all the dust. She sees it wrapped in the corner by the tree and she's made a few comments how she \"knows what it is\" and can't wait to finally have dust free floors. \n\nWhat she truly hates for me to get is clothing and expensive jewelry because she's so picky. She'll often buy things and then thank me. A couple Christmases ago, just a few days before the 25th, she sent me a picture of a beautiful ring on her finger with the text \"Thank you! It's just what I wanted for Christmas. I love you!\"\n\nNow as for me, I don't believe I've ever gotten a gift I didn't like.",
   "created_utc": 1703092395,
   "score": 222,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7a5wd",
   "message": "I don't mind clothing, but it's the \"nice\" clothing that is *always* disappointing. Whenever I see someone get socks, or a shirt, or something that's meant to be dressy and nice looking... you know it's something that person doesn't actually want to wear and is only going to do it so the giver doesn't feel bad.",
   "created_utc": 1703091990,
   "score": 107,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7tkpq",
   "message": "Flowers. There’s an opinion floating around on Reddit that men (quietly) love receiving flowers. I’m not one of those men nor do I personally know any man who wishes for flowers.",
   "created_utc": 1703098895,
   "score": 11,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7o1ki",
   "message": "No tools, unless! they are straight off of my wish list otherwise, don't.\n\nTools means woodworking, automotive, cooking, grilling, yard, or any sort of tool I use.",
   "created_utc": 1703096933,
   "score": 51,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7nwgl",
   "message": "Some sort of generic kitsch that costs $3.99 that you got for free or bought because you \"had to\" get a gift. If you can't decide what exactly to buy, get a gift card. Or don't buy a gift - we're adults, we can handle it.\n\nExamples: candles, \"funny\" (or, actually branded with a cartoon character) printed T-shirts or socks, sauna scents (when you don't have a sauna), cosmetics (when you don't use them), alcoholic drinks that you don't drink.",
   "created_utc": 1703096882,
   "score": 50,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7o7uk",
   "message": "Please stop buying me porn dvds. It’s free online. My dvd player is in storage. You don’t know what I like. Just get me socks please.",
   "created_utc": 1703096995,
   "score": 156,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7x4qx",
   "message": "Beginner paraphernalia for my hobbies.\n\nI like woodworking. So yes, there are things I would love to get for woodworking. But I already have multiple drills, hammers, wrench sets, etc. \n\nI like homebrewing. If you buy me a homebrew kit, 90% of it is going into the trash. It would be like buying a professional baker some cheap plastic measuring cups and some slice \u0026amp; bake cookie dough.\n\nBuying for hobbies requires a pretty good knowledge of the hobby, AND the person you're buying for. I would love a dovetail pull saw. But no one would know that unless I spell it out. \n\nAlso, guys, have a list of things for your hobby that are always safe buys. Clamps. No woodworker on the planet has ever said \"I have too many clamps.\"",
   "created_utc": 1703100182,
   "score": 84,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7v9lp",
   "message": "I will add from my personal experience: no one likes tk be reduced to a single thing. So don’t get all football team themed gifts, all bacon gifts etc. people went to be seen as a whole person and not some quirk or hobby",
   "created_utc": 1703099507,
   "score": 44,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7ksos",
   "message": "Whatever you got me for my birthday earlier in the year. And last Christmas. \n\nLook. Socks are needed and great. But I now have gotten socks for every Christmas and birthday for the past 5 years from both sides of my partner's family. \n\nI get it, you don't really like me and don't want to actually put thought or effort into a gift. But I have more socks than a person reasonably needs and am running out of space in my dresser.",
   "created_utc": 1703095778,
   "score": 110,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7g23k",
   "message": "Yet another bottle of cologne. I'm still using the ones from I don't know how many Christmases ago.",
   "created_utc": 1703094098,
   "score": 125,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7rag5",
   "message": "i dunno man...i just wanna not have to be somewhere i don't wanna be for hours. I want to sleep. i'm so tired.",
   "created_utc": 1703098091,
   "score": 90,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7qp2a",
   "message": "Things for their hobby unless it's either disposable or you've been given specifics. \n\nFor me, hockey tape? Great. I use it all the time. A new set of shin pads? That's bad, not all pads fit the same. The exact stick I've specified? Amazing choice.\n\nI'd imagine the same idea is valid for woodworking, grilling, golf, fishing, baking, dog training, gardening, etc.",
   "created_utc": 1703097880,
   "score": 70,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7szq5",
   "message": "I don’t want anything for Christmas. But I do think it’s funny we’re all cool with Home Depot commercials for Father’s Day. \n\n“This Father’s Day, give your man a way to be away from the family alone for hours making a ton of noise so he can’t be bothered”.",
   "created_utc": 1703098690,
   "score": 31,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke79tca",
   "message": "Nothing that reminds me that my family has no clue who I am.",
   "created_utc": 1703091866,
   "score": 159,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7q4fi",
   "message": "Presents. Would rather know my family is happy than to have someone buy me something I may or may not like.",
   "created_utc": 1703097676,
   "score": 25,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7zvqt",
   "message": "Those gift packs of shower gel, shampoo/shave balm/etc  \n\n\nI'm sure it's very nice, but my skin allergy will hate me forever if I don't use the specific non-allergenic/sensitive skin stuff",
   "created_utc": 1703101175,
   "score": 26,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke80iru",
   "message": "Something embarrassing. Yes, I like Doctor Who. No, I don't need TARDIS print underwear and a framed picture of Matt Smith you printed off Google Images.",
   "created_utc": 1703101404,
   "score": 26,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke8firs",
   "message": "Pro tip for everyone in this thread: we named our kid after a decent whiskey and now all we get is different bottles of this whiskey brand. \n\nName your child after your favorite booze =\u0026gt; prosper!!",
   "created_utc": 1703106803,
   "score": 27,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7l4sq",
   "message": "I don’t want thoughtless crap. I have enough crap in my house. \n\nI got a one piece hooded sweatshirt pant combo one year… like huh?",
   "created_utc": 1703095899,
   "score": 64,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7spik",
   "message": "Just give me gift cards. I don't want you thinking too hard. Study long, study wrong.",
   "created_utc": 1703098589,
   "score": 18,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke73azz",
   "message": "Anything I have to buy myself to just be an adult.  Don't buy me socks or underwear, cleaning supplies, stuff like that.  I'll get that stuff.",
   "created_utc": 1703089521,
   "score": 79,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke85xa0",
   "message": "I don’t want ties or dress shirts anymore because I wore those at work in the before times.  Now the world has moved on and I want Tequila.",
   "created_utc": 1703103335,
   "score": 16,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke71jzv",
   "message": "cleaning supplies is a shit gift in general regardless of gender",
   "created_utc": 1703088871,
   "score": 189,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke8gvxp",
   "message": "Gifts, we don't want gifts. I'm the only one that knows the exact thing I want and if I wanted it, I've already purchased it for myself.\n\nBooze, beer and wine are the only acceptable gifts.",
   "created_utc": 1703107298,
   "score": 15,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7rd7g",
   "message": "This is more of a personal preference but do not get me something that I didn’t ask for. I appreciate the thought, but I just don’t want anything I didn’t ask for, or else I would’ve asked for it",
   "created_utc": 1703098118,
   "score": 12,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7amyj",
   "message": "Socks, shirt, belt, colonge",
   "created_utc": 1703092160,
   "score": 12,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke7prgo",
   "message": "My dad always gives me wool socks that are size too small. I’ve begged him to just go one size bigger but he always forgets. It’s endearing tbh.",
   "created_utc": 1703097549,
   "score": 9,
   "submission_id": "18my5o4"
  },
  {
   "comment_id": "ke8zuo1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18my5o4"
  }
 ]
}