{
 "submission_id": "18n3eb0",
 "title": "What is the current thing that future generations will say \"I can't believe they used to do that\"?",
 "selftext": "",
 "created_utc": 1703101630,
 "permalink": "/r/AskReddit/comments/18n3eb0/what_is_the_current_thing_that_future_generations/",
 "score": 55,
 "url": "https://www.reddit.com/r/AskReddit/comments/18n3eb0/what_is_the_current_thing_that_future_generations/",
 "comments": [
  {
   "comment_id": "ke9iqc8",
   "message": "\"They used to send people to prison for life for for having a little bit of weed?!\" Overheard from a Gen Z. It's already happening.",
   "created_utc": 1703122531,
   "score": 49,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke83i5b",
   "message": "The way we treat cancer, hopefully.",
   "created_utc": 1703102462,
   "score": 167,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke91flk",
   "message": "Pollute the shit out of our Oceans",
   "created_utc": 1703115241,
   "score": 5,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8fxhg",
   "message": "Dialysis. If you know the process, it’s gruesome and medieval.",
   "created_utc": 1703106951,
   "score": 135,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke81do4",
   "message": "This is wishful thinking but, post their entire fucking lives onto the Internet.",
   "created_utc": 1703101709,
   "score": 110,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke91m98",
   "message": "Science: \"This plastic stuff is really difficult and expensive to recycle, never truly goes away, and likely has horrible long-term effects on the bodies of all organic life on earth, humans included.\"\n\nPeople: Use plastic for everything, all the time, everywhere.",
   "created_utc": 1703115319,
   "score": 204,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke888q3",
   "message": "Overuse of antibiotics",
   "created_utc": 1703104168,
   "score": 229,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke89gep",
   "message": "Being in places with no cell/internet signal. I lived in a small town where there was almost no signal until recently but I'm seeing fewer and fewer places where that is the case.",
   "created_utc": 1703104609,
   "score": 173,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke84rab",
   "message": "Hopefully file your own taxes. It's needlessly complicated. (USA)\n\nEdit: Since this is getting some traction...\n\n1. Many countries do this successfully.\n\n2. Yes, this would be for most people. A small percent of the population would make adjustments. The IRS knows most of your itemized information anyway.\n\n3. I have probably prepared over a thousand 1040s. Mostly rich people with \"complicated\" taxes. \n\n4. Yes, you can file yours in 4 minutes. That doesn't mean everyone else can.",
   "created_utc": 1703102914,
   "score": 24,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke9e78d",
   "message": "the way the mental health system treats psych patients in hospitals and programs when you have severe symptoms. you’ll get drugged up and the whole experience is pretty traumatizing. it’s also quite surprising how little people in hospitals actually know about mental health. it’s not always specific people either, it’s just the system as a whole. getting sent home in the middle of a mental health crisis because your insurance cuts out. or losing a bed in a program because someone is “worse” than you. being in hospitals really makes you rate everyone’s symptoms and how “bad” they are. you’ll subconsciously start putting people in order from worst mental health to best. it’s a really toxic experience. once you get put into a long term program, it’s just so terrible. so much goes under the radar when it’s government run.",
   "created_utc": 1703120648,
   "score": 2,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke88xvy",
   "message": "Toilet paper. I can’t wait for the 3 shells",
   "created_utc": 1703104425,
   "score": 2,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8lmrw",
   "message": "The incessant inundation of marketing in our daily lives. Our technology gathers our data to tailor ads to sell us more useless trash. \n\nYour tv records you so people in an office somewhere can socially engineer ways to sell you another tv. \n\nWe see something like ~5000+ advertisements a day, they’re still trying to put big ads in the night sky, it’s far too much and the future will consider us barbaric for allowing it.",
   "created_utc": 1703109035,
   "score": 168,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke89v76",
   "message": "Buying bottled water from another continent.",
   "created_utc": 1703104757,
   "score": 240,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke9053w",
   "message": "Donating plasma just to buy groceries because your 40+ hours a week job barely pays your bills. (I hope this is something completely unheard of in the future.)",
   "created_utc": 1703114705,
   "score": 53,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8evx3",
   "message": "(For the USA) I’m really hoping they’ll be horrified that healthcare was for profit and many people paid for cancer treatments through popularity contests online…. Bc",
   "created_utc": 1703106572,
   "score": 115,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8jb3t",
   "message": "Hopefully things like school shootings will become something we only talk about in past tense. We’ll look at a graph over time, and this time period is just a weird uptick amidst a big downward trend.",
   "created_utc": 1703108182,
   "score": 62,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke85iid",
   "message": "The ass first pose (sorry don't know what it's called). Like, here's a pic of your grandmother at the Grand Canyon when she was young. Sorry her ass is so prominent in every picture but that was the style at the time. No I don't have any other poses of her.",
   "created_utc": 1703103187,
   "score": 26,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke9m0tt",
   "message": "Corporal punishment. \n\nEmotional neglect of children along gendered lines: girls being taught to put their needs last, boys being taught their emotions are gross.\n\nThe treatment of special needs children in the education system.",
   "created_utc": 1703123889,
   "score": 185,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke90seb",
   "message": "Working 5 days a week hopefully.",
   "created_utc": 1703114976,
   "score": 50,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke89xab",
   "message": "That we used to get most of our energy by burning the planet. Coal, natural gas, gasoline, oil, trees. Whatever. Any of that. We literally poisoned and killed ourselves slowly and knowingly for like 100+ years so far.\n\nJust like we can look back on the use of lead pipes and paint and asbestos insulation/flooring/whatever and be rather disgusted I sincerely hope we do so with oil. In my lifetime would be amazing and the sooner the better at the rate we're going.",
   "created_utc": 1703104777,
   "score": 254,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8fgrz",
   "message": "I really think a long time from now we’ll view how we treat animals pretty distastefully. Elephants bury their dead and can paint, dolphins have language and some are growing thumbs. They’re clearly more sentient then we give them credit for and we use our lack of understanding of consciousness to justify it.",
   "created_utc": 1703106783,
   "score": 240,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8fkov",
   "message": "I think having multiple monthly services for essentially the same thing.\n\nTheres people out there thatpay for Netflix, Amazon Prime, Disney+ and even some more AT THE SAME TIME!\n\nI think in the future we will either go back to having one central service or have at least learned to only.have one active and cancle the others in the meantime.",
   "created_utc": 1703106822,
   "score": 224,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8cjqi",
   "message": "Drive your own car, especially when drunk. Now, this is way, way in the future, but I can imagine a bunch of laughing drunk college students stumbling into their self-driving car and saying, \"OMG, how did they do it back in the old days? I can barely walk straight.\"\n\nThe correct answer would be, they died. That's how they did it in the old days, they died.",
   "created_utc": 1703105727,
   "score": 121,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8pbod",
   "message": "Hopefully the way people treat one another, both online or out in the real world.",
   "created_utc": 1703110429,
   "score": 209,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke846ud",
   "message": "People used that loser website 'reddit '",
   "created_utc": 1703102711,
   "score": 138,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8cdc5",
   "message": "Single use, disposable plastic wrap.",
   "created_utc": 1703105663,
   "score": 2,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke93x61",
   "message": "Hopefully it’ll be the fact that we work 40 hrs per week.",
   "created_utc": 1703116280,
   "score": 223,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8fsk0",
   "message": "Usernames and passwords",
   "created_utc": 1703106902,
   "score": 149,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "kecxmts",
   "message": "Going to war, hopefully",
   "created_utc": 1703184803,
   "score": 20,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8jj2h",
   "message": "NFTs.",
   "created_utc": 1703108262,
   "score": 186,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke81nky",
   "message": "Living without a cure for flu and cold",
   "created_utc": 1703101806,
   "score": 169,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8wg22",
   "message": "Being able to drink water from the tap and easy and clean access to water. We take it for granted in most developed countries and don’t treat it with respect. We misuse it and pollute it as if we will never run out.",
   "created_utc": 1703113199,
   "score": 213,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke86h00",
   "message": "I'm not even a vegetarian, but I think that our grandkids will be horrified by how we got our meat (this assumes that lab grown meat keeps advancing)",
   "created_utc": 1703103532,
   "score": 203,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke82cgv",
   "message": "Untangling cables and cords for our electronic devices. With advancements in wireless technology and charging solutions, they might find it amusing that we once spent so much time wrestling with cords, trying to keep everything plugged in and organised.",
   "created_utc": 1703102050,
   "score": 175,
   "submission_id": "18n3eb0"
  },
  {
   "comment_id": "ke8bkhk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18n3eb0"
  }
 ]
}