{
 "submission_id": "18n74r0",
 "title": "Whose death this year hit you the hardest?",
 "selftext": "",
 "created_utc": 1703111362,
 "permalink": "/r/AskReddit/comments/18n74r0/whose_death_this_year_hit_you_the_hardest/",
 "score": 116,
 "url": "https://www.reddit.com/r/AskReddit/comments/18n74r0/whose_death_this_year_hit_you_the_hardest/",
 "comments": [
  {
   "comment_id": "ke90hrd",
   "message": "Andre Braugher. Big fan of him in B99",
   "created_utc": 1703114852,
   "score": 36,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8xmgr",
   "message": "My mom’s. Pancreatic cancer. Ten weeks between diagnosis and euthanasia.",
   "created_utc": 1703113672,
   "score": 180,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8zzj1",
   "message": "My wife, this is the hardest christmas I've ever had.",
   "created_utc": 1703114640,
   "score": 44,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke938vq",
   "message": "My grandmother's.  She was 97 so not totally unexpected, but still hit me harder than a ton of bricks.   This time of year is tough without her.\n\nIt's a sad adulthood milestone when you lose your last grandparent.",
   "created_utc": 1703115999,
   "score": 63,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8zaox",
   "message": "My dog 14 years old, the goodest good boy. fuk cancer!",
   "created_utc": 1703114359,
   "score": 240,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8sckj",
   "message": "[deleted]",
   "created_utc": 1703111590,
   "score": 57,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8vxur",
   "message": "Lance Reddick was such a sad death because he seemed pretty healthy and from the sound of it there was no underlying chronic condition; he just had a massive blockage in his artery. An angiogram might have saved his life and kept him going another 20 years.\n\nGet your heart checked out as you age, everyone.",
   "created_utc": 1703112998,
   "score": 97,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8xf47",
   "message": "My dads",
   "created_utc": 1703113590,
   "score": 46,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8u4r1",
   "message": "Bray Wyatt. Been a lifelong Wrestling fan and he was one of my favorites. After already losing Brodie Lee way to soon at the end of 2020 this one hurt extra bad.",
   "created_utc": 1703112288,
   "score": 45,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke90r6f",
   "message": "Tina Turner. So great!",
   "created_utc": 1703114962,
   "score": 35,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke92w4d",
   "message": "A man who lived on the same floor as me. We'd chat all the time, see each other at the dog park, etc. He was the friendliest and nicest man. He had just retired this year, sold his company and he and his wife moved into our apartment building. He was excited to be retired. Suddenly his health declined, and within two weeks of my finding out, he passed. While he was in hospice, people were already trying to re-home his dog, whom he loved more than anyone could ever know. I was sad to see his dog with her new owner at the dog park with her name already changed. That made me sad. He didn't get to enjoy his retirement beyond 6 months.",
   "created_utc": 1703115851,
   "score": 33,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke94ugr",
   "message": "My younger sister.\n\nOnly 38.  Left behind husband, 2 sons, and 1 daughter.  The daughter being the youngest at only 10 years old.\n\nSo sudden.  A simple unexpected organ failure.",
   "created_utc": 1703116669,
   "score": 30,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8wb5l",
   "message": "My sister died from an OD and that was the worst.  Didn't work for 2 months but they were understanding enough to let me go back to work after that.",
   "created_utc": 1703113145,
   "score": 75,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke937q0",
   "message": "Suzanne Somers. I got fat as a teen. But bought her cook book and Thighmaster. And I lost the weight. My parents let me buy wine to cook with her chicken recipe. She inspired so many people to be more healthy and strong. And she was a delight. Brilliant on Shes the Sherrif and a joy on Step by Step. She was royally fd over on Three’s Company. Suzanne was a national treasure and helped so many people.",
   "created_utc": 1703115987,
   "score": 58,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke928xu",
   "message": "Andre Braugher",
   "created_utc": 1703115580,
   "score": 21,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke93emt",
   "message": "Guy I worked with for the last few years.\n\nTim was one of the \"OG\" people where I worked.  One of the people who'd been with the company since almost the beginning.  We were both going after the same promotion, and he got it over me.  I couldn't be mad...he did the time and put in the work.  Good for you, Tim.\n\nThen one day his neighbors found him.  He'd collapsed on the sidewalk of his apartment complex. They didn't know how long he'd been there.\n\nLater that day I heard that it wasn't looking good.  Then the next morning I got a text.  \"He didn't make it.\"\n\n\nFuck.  \n\n\nI went into the job I'm in now because of him.",
   "created_utc": 1703116066,
   "score": 23,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9313t",
   "message": "My friend. Parents found him dead in his dorm room.",
   "created_utc": 1703115909,
   "score": 17,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9c06t",
   "message": "The Kid that died in the Submersible implosion. He didnt wanna go in the first place. Some rich assholes cheapskating ways end another life too short.",
   "created_utc": 1703119713,
   "score": 69,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke91skx",
   "message": "My stepdad. He was a wonderful man.",
   "created_utc": 1703115391,
   "score": 18,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8x4xi",
   "message": "Roslyn Carter, because unfortunately it's signalling that Jimmy's departure is also nigh.  I really don't think he has much time left, he did not look like a well man at her funeral",
   "created_utc": 1703113476,
   "score": 36,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8tx4d",
   "message": "Our 11 year-old greyhound died a couple of months ago. We're looking for a rescue dog but he'll be hard to replace. RIP, Jack.",
   "created_utc": 1703112204,
   "score": 52,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9gwsk",
   "message": "My sister. We were 11 months and three weeks apart. She passed 1 day after her birthday and exactly 1 week before mine. We were the same age for one week every year. We were both 53 when she died. It's so hard not having her here this Christmas. My mom is having a really hard time too.",
   "created_utc": 1703121773,
   "score": 17,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke93zj2",
   "message": "My dog.   Had to put him down two weeks ago due to cancer after 14 years.  I’m still randomly crying",
   "created_utc": 1703116308,
   "score": 14,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9axhg",
   "message": "Surprisingly, Andre Braugher. Captain Holt was the first character I'd ever seen anywhere that the fact he was gay wasn't the most interesting thing about him. It was nice to be ordinary for once.",
   "created_utc": 1703119253,
   "score": 15,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8yyht",
   "message": "My childhood cat",
   "created_utc": 1703114219,
   "score": 13,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9f8ig",
   "message": "it was Jimmy Buffett up until we had to put my 14 year old dog down yesterday.  We have had him since he was 8 weeks old., and it was a very sudden illness.",
   "created_utc": 1703121077,
   "score": 14,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke94orl",
   "message": "My cat, Little.",
   "created_utc": 1703116603,
   "score": 12,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke96204",
   "message": "Sinead O'Connor and Mathew Perry",
   "created_utc": 1703117183,
   "score": 24,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke981b4",
   "message": "My mom. She had never taken a sip of alcohol in her first 40 years of life. Started drinking about a decade ago at night to calm her nerves. Night turned into all day every day. Organs failed. \n\nIt’s sad because at one time, she was such a beautiful person, then she became unrecognizable. She raised me to be good man and I’m forever grateful for that.\n\nFor those of you who are older parents and think when your kids get older, you don’t matter to them anymore, I hope you know how wrong you are. Just because you don’t see or talk to them every day doesn’t mean they don’t need you. They’ll always need you. The best version of you.",
   "created_utc": 1703118023,
   "score": 22,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke961wp",
   "message": "My 16 year old chihuahua. She was such as sweet dog.  :-(",
   "created_utc": 1703117182,
   "score": 11,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9h9ep",
   "message": "My 3 year old daughter. F*ck pompe disease.",
   "created_utc": 1703121919,
   "score": 12,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8ugiv",
   "message": "Matthew Perry",
   "created_utc": 1703112417,
   "score": 62,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98fel",
   "message": "My nephew in August, my dad in October and my FIL in November. 2023 has not been kind.",
   "created_utc": 1703118187,
   "score": 9,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke91qca",
   "message": "one of my old soldiers that passed away while I was away in Iraq of a blood clot to the brain.",
   "created_utc": 1703115366,
   "score": 8,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke97rkn",
   "message": "Shane McGowan",
   "created_utc": 1703117908,
   "score": 9,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke92h1s",
   "message": "My neighbor i grew up with she was my sister",
   "created_utc": 1703115676,
   "score": 9,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke94dga",
   "message": "My master’s thesis advisor died December 1st. He was such a kind, wise guy who went above and beyond for his TAs. Thanks for everything, Dr. Berger!",
   "created_utc": 1703116469,
   "score": 7,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98f3i",
   "message": "My kid brother.",
   "created_utc": 1703118183,
   "score": 9,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9eev9",
   "message": "My friend and former co-worker Gretchen. \n\nFor celebrity, Jimmy Buffett.",
   "created_utc": 1703120733,
   "score": 9,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9o6ss",
   "message": "My nephew. He drowned in a pool. He was only 4. I’ll never forget you Hayden ♥️",
   "created_utc": 1703124799,
   "score": 8,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9k5bq",
   "message": "Norm Macdonald. And it wasn't even this year. That's how hard it hit.",
   "created_utc": 1703123116,
   "score": 13,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8wz8e",
   "message": "David McCallum \u0026amp; Matthew Perry",
   "created_utc": 1703113411,
   "score": 6,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke92tdt",
   "message": "Sarah Rocco.  She just passed away a couple weeks ago - head on collision on a two lane road where the other driver crossed the line.  \n\nShe was such a bright light - one of the most motivational humans.  Everyone who met her was inspired to be better.  She was 39.  It is a loss for the world.",
   "created_utc": 1703115819,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke93ftq",
   "message": "Lucky, nobody close to me has passed away.\n\nFor me, it was Andre Braugher.\n\nLast year, it was our beloved border collie.\n\nIn 2021, it was Norm MacDonald.",
   "created_utc": 1703116080,
   "score": 6,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke94phw",
   "message": "My dog ☹️",
   "created_utc": 1703116611,
   "score": 7,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke980tp",
   "message": "My three friends who committed suicide… one right in front of me",
   "created_utc": 1703118017,
   "score": 7,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98fi3",
   "message": "My cousin.  I was at work when my mom called to tell me he had hung himself.\n\nBeing that I had declined to hang out with him a few times leading up to this, and he and I got really close when his father died of a heart attack at 37 (my cousin was ~8 at the time, I was 9) and our uncle hung himself a few months after, this was a huge deviation to our family.",
   "created_utc": 1703118188,
   "score": 7,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98fku",
   "message": "My sister. A week ago. I thought because we were estranged her death wouldn’t hit me so hard. I was wrong.",
   "created_utc": 1703118189,
   "score": 6,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98fx4",
   "message": "My 49 yo brother in law.  Went to the hospital with stomach pain. They discovered he was eat up with cancer and couldn’t help him. Two weeks later he was gone.  My sister and her kids are still devastated.",
   "created_utc": 1703118193,
   "score": 6,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9dva3",
   "message": "My childhood \u0026amp; lifelong best friend took his own life earlier this year. Best friends since 5th grade, went to bootcamp together, best man in each others wedding etc.",
   "created_utc": 1703120506,
   "score": 6,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9jtfp",
   "message": "Jimmy Buffett.  Glad I got to see him last year.",
   "created_utc": 1703122979,
   "score": 6,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9omle",
   "message": "My baby. I had a second trimester miscarriage. It was traumatic medically, mentally, emotionally and physically. I’ve never grieved like this.",
   "created_utc": 1703124986,
   "score": 6,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke953vj",
   "message": "Father-in-law. Short aggressive bladder cancer. This time last year he was healthy. April he got diagnosed, I was optimistic because it’s usually 75% chance to beat it. He just didn’t respond to treatment. After first round, he just spiraled a few weeks and just went into a free fall last month.",
   "created_utc": 1703116781,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke958vn",
   "message": "My grandma.\n\nShe was diagnosed with pancreas cancer back in October. Little by little, she started to feel worse every day. One day, she fell asleep and we couldn't wake her up (she was alive tho, her heart was still beating) She was like that for 2 weeks in the hospital, then on November 9th she passed away.",
   "created_utc": 1703116840,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke97tut",
   "message": "Andre Braugher’s death was shocking and very sad. I was saddened by Matthew Perry’s death, it was tragic but it wasn’t as surprising as Andre’s. It’s the surprising ones that hit hardest, I feel.",
   "created_utc": 1703117935,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9aguh",
   "message": "My grandma, 2 uncles, and 1 cousin died all within the last 365 days. 1 of my uncles died just 2 days ago. This is the first time I've mentioned it to anyone who doesn't know me personally, but I have just been devastated. My whole family is gone. Just me and my siblings and I'm only 26. Ive been stressed the fuck out man.",
   "created_utc": 1703119058,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9i2qc",
   "message": "James McCaffrey, one of the most iconic voices in gaming.",
   "created_utc": 1703122256,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9mev2",
   "message": "My Dad's. He was my hero and best friend. I couldnt of asked for a better man to be my father. I wish we got more time together.",
   "created_utc": 1703124050,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9oqc8",
   "message": "My older brother. Was about to turn 51\nnext Tuesday. Rebuilt his life after drug addiction and prison - reconnected with family and friends, got his license (he drove illegally for decades), and became a pillar of his community. He took his life a week-and-a-half ago, leaving many of us stunned. \n\nMental illness is no joke - please seek help instead of leaving your loved ones absolutely devastated, especially during the holidays.",
   "created_utc": 1703125031,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8yq4o",
   "message": "My uncle",
   "created_utc": 1703114124,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke96ijy",
   "message": "My BIL. He went for the self inflicted swinging kind.",
   "created_utc": 1703117377,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke97802",
   "message": "My HS friend Gina Marie. She had cancer and was a beautiful person through and through.",
   "created_utc": 1703117677,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke995q2",
   "message": "Bray Wyatt",
   "created_utc": 1703118498,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9ai6k",
   "message": "We lost our close neighbors this year. They were a staple in my life for 30 years and treated us like family. He died first and she went soon after.",
   "created_utc": 1703119073,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9bism",
   "message": "Dear, dear old friend lost her son to drugs in September.  Lifetime of struggling to help him - still devastating.  No one should bury a child.",
   "created_utc": 1703119506,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9ctvz",
   "message": "One of my best friends passed away last week. Can’t stop crying",
   "created_utc": 1703120065,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9d2mk",
   "message": "Craig Breen\n\nStarted watching World Rally Championship this year, Craig Breen was making quite a comeback with good results but during the sightings of Croatian Rally he crashed and killed himself. His codriver is alive and well, at least physically.\n\nThis was the first death I \"witnessed\" in motorsports since I started watching them",
   "created_utc": 1703120169,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9dmly",
   "message": "My father.",
   "created_utc": 1703120405,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9g461",
   "message": "My dad.",
   "created_utc": 1703121447,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9gh0p",
   "message": "My dog Brick. He wasn’t even 3. He died from something he was vaccinated against.\n\nIt was less than 10 days from when I said to my husband “there is something wrong with Brick “ to the day we had to put him down.\n\nHis death, was traumatizing to us all. \n\nHe was a wonderful dog. \n\nI miss that pain in the butt every single day.",
   "created_utc": 1703121596,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9hivc",
   "message": "Reading this post made me realize what a long shitty year it's been. One of my oldest friends was in a car crash, my neighbor shot himself but the absolute hardest was my grandmother, tho I am very lucky to have had her to almost my 40s",
   "created_utc": 1703122028,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9ie47",
   "message": "The rapper Takeoff. The way it went down was shocking.",
   "created_utc": 1703122391,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9jifr",
   "message": "My yiayia(gramma in Greek) \n\nThat woman raised me and I am a replica of her. She was 94 years old and had a stroke in her sleep and passed away about a week later. She didn’t speak any words after the stroke other than “I love you” to me when I was saying my goodbyes with my family. \n\nI took her death VERY badly. I lost 30lbs and myself physically mentally and emotionally. \n\nI got myself into therapy and am on the up now, but I’ll never forget how her death affected me. I still cry just not everyday, and am rapidly gaining the weight back along with my sanity. \n\nIt was hard to grieve around my family because they all just moved on and acted like I was some crazy person for taking her death so hard. Her name was Aphrodite and she was truly a Greek goddess. I see her in my daughter and my own face everyday and miss her dearly.",
   "created_utc": 1703122852,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9l36n",
   "message": "Mine if this inflation goes on any longer.",
   "created_utc": 1703123508,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9lva1",
   "message": "My friend since middle school took his own life….still makes me sad to think about",
   "created_utc": 1703123826,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9m02k",
   "message": "A security guard that I regularly work with passed away on Monday. I shook the man’s hand the day before.",
   "created_utc": 1703123880,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9m0go",
   "message": "My 21 year old cat ove had since I was a child",
   "created_utc": 1703123884,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9n7kv",
   "message": "10,000 Palestinian children and counting",
   "created_utc": 1703124387,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke8tuam",
   "message": "Mine.   \nCan't believe they provided Reddit access in heaven though, so that's ok.",
   "created_utc": 1703112174,
   "score": 12,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke96oi1",
   "message": "my dad’s.",
   "created_utc": 1703117447,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98tv6",
   "message": "No one close to me has died this year it’s unusual but i’m glad this years diff",
   "created_utc": 1703118357,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke995zz",
   "message": "My dad passed in October and my best friend’s mom passed on the same day.",
   "created_utc": 1703118501,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke99c1y",
   "message": "Ralph Cirilla. I didn't even like him but when I read he had died it was such a shock, felt like I had been kicked in the stomach.",
   "created_utc": 1703118572,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke99u83",
   "message": "Mitten Squad (I've been lucky) it just kinda doesn't feel real since his last community post.",
   "created_utc": 1703118790,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9bacg",
   "message": "My father in law’s. Yes, he got on my nerves at times, but damn I miss him.",
   "created_utc": 1703119405,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9bti8",
   "message": "My grandfather. Two weeks ago.",
   "created_utc": 1703119634,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9c8g3",
   "message": "A college friends. I’m 25 and never thought I’d have to see someone so close die so young.",
   "created_utc": 1703119813,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9cel3",
   "message": "My cousins. 😔",
   "created_utc": 1703119886,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9cntc",
   "message": "One of my best friends. 💔",
   "created_utc": 1703119993,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9e8ee",
   "message": "My nephew (30 yo), whom was like a son to me, had his and his friend (24 yo) life stolen from them in a senseless redrum.",
   "created_utc": 1703120661,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9eyg8",
   "message": "Not this year but Betty white was a slap in my face",
   "created_utc": 1703120959,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9fzcv",
   "message": "Ken Block. He was a friend, a mentor and icon of automotive culture. I’ve never seen such a large wake left behind from any other automotive personality in my lifetime. Since his passing I’ve had the chance to work closely with his family. His wife Lucy just raced up Pikes Peak with me earlier this year. \n\n [Lucy Block Pikes Peak documentary](https://youtu.be/_QT6UCv4FEQ?si=J7W8P_3wt980P4jW)",
   "created_utc": 1703121390,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9hfe7",
   "message": "My younger brothers wife passed away this last August after a 10 year ongoing ovarian cancer episode\n\nShe was only 44 and they had 2 girls 10 and 13",
   "created_utc": 1703121988,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9hg1o",
   "message": "Grandma’s on hospice. Could be any day now. So it might be hers.\n\nAlso #fuckcancer",
   "created_utc": 1703121995,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9i0dd",
   "message": "My patient. So unexpected \u0026amp; I balled out cried when he passed. I did everything I could to revive him.",
   "created_utc": 1703122230,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9i6uh",
   "message": "Andre Braugher was such a shock. It felt like it came out of nowhere.",
   "created_utc": 1703122304,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9k3wa",
   "message": "My 12 year old dog. I knew he was getting older, but he went from his typical self to over the rainbow bridge within a few days time. I miss him so much.",
   "created_utc": 1703123100,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9las2",
   "message": "David Lindley, one of my all-time favorite musicians.\n\nYou've probably never heard of him, but you've heard him play zillions of times.",
   "created_utc": 1703123594,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9lnm9",
   "message": "I guess Martti Ahtisaari, the 10th president of Finland.\n\nHe did great work for peace notably in Namibia and Kosovo, for which he was awarded the Nobel peace price. He was a humble man who always strived to settle things peacefully.\n\nTo be fair my view isn’t entirely objective as i’m Finnish myself, but his message was one that brings me and hopefully others hope for the future: peace is always a matter of will. And those who want it will always strive for it.\n\nOh and fun fact: Martti, a Finnish name is among the most popular male names in Namibia. Both as a result of him, and an another Finnish guy who was a missionary in the region in the 19th century.",
   "created_utc": 1703123739,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9lrky",
   "message": "One of my mentees. He had just graduated in May of this year and then turned 18. 3 months later he was murdered by one of his own friends and left on the side of the street. Just an all around devastating situation. Young men and women are being murdered for over senseless things. Hug your kids and loved ones. 😢",
   "created_utc": 1703123784,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9n6kp",
   "message": "The Jolly Mon.",
   "created_utc": 1703124375,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9oib1",
   "message": "Daniel Langlois, the creator of the Jurassic Parc dinosaures. He and his wife were shot by a neighbor from New Jersey over the use of a public road on the island of Dominica on december first.",
   "created_utc": 1703124936,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9py5b",
   "message": "Those submarine bitches",
   "created_utc": 1703125548,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9qcu2",
   "message": "Shane McGowan. The Pogues were huge when in school and the music/poetry with a whole punk/folk vibe was refreshing for me as an Irishman. Fairytale of NY is still my favorite Xmas song.",
   "created_utc": 1703125723,
   "score": 3,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9kaor",
   "message": "All the Palestinian children.",
   "created_utc": 1703123179,
   "score": 4,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9fgcj",
   "message": "The Palestinian's",
   "created_utc": 1703121166,
   "score": 5,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke97wia",
   "message": "A good friend, rock and roller, great singer and guitarist friend for 30 years…Freddie",
   "created_utc": 1703117966,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98avv",
   "message": "My dad :(",
   "created_utc": 1703118133,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98jfz",
   "message": "My cousin, who is the same age as me, was found dead in his bed. Incredibly sad. \n\nFamous people? Probably Matthew Perry or Tina Turner",
   "created_utc": 1703118235,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke98tgt",
   "message": "Husband’s grandma. We were fairly close with her. \n\nCelebrity wise, both Matthew Perry and Andre Braugher are tough ones. 💔",
   "created_utc": 1703118352,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke998ue",
   "message": "None, no one in my family died this year. That I know of...",
   "created_utc": 1703118534,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke99l8x",
   "message": "Andre Braugher",
   "created_utc": 1703118682,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke99wsu",
   "message": "Nate's on Six Feet Under.",
   "created_utc": 1703118821,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9af4p",
   "message": "Matthew perry",
   "created_utc": 1703119038,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9aye5",
   "message": "My step brother, my other step brother died 11 years ago.",
   "created_utc": 1703119264,
   "score": 2,
   "submission_id": "18n74r0"
  },
  {
   "comment_id": "ke9qxoy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18n74r0"
  }
 ]
}