{
 "submission_id": "18n9p5l",
 "title": "What's the weirdest thing you've seen someone do while they were sleepwalking?",
 "selftext": "",
 "created_utc": 1703118439,
 "permalink": "/r/AskReddit/comments/18n9p5l/whats_the_weirdest_thing_youve_seen_someone_do/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/18n9p5l/whats_the_weirdest_thing_youve_seen_someone_do/",
 "comments": [
  {
   "comment_id": "ke99eop",
   "message": "Lift the laundry hamper instead of the toilet lid and piss in it",
   "created_utc": 1703118604,
   "score": 2,
   "submission_id": "18n9p5l"
  },
  {
   "comment_id": "ke9aryp",
   "message": "My brother and i slept in bunk beds in a nice caravan during the summer vacation with my family. He was around 5 years old at this time.\n\nI slept on the top bed and he slept on the lower bed. I woke up in the middle of the night one day because he got up out of bed and started talking in his sleep. I could not make out what he was saying it sounded like he was mumbling.\n\nSo curious as im i sit up in bed and view what my brother was doing. Only to see him walk to the foldable sofa, pull his pants down and pee against the sofa.\n\nThe pissing noise woke my mother who jumpt out of her sleeping bag. My brother woke up when she got to him with his pants down and no idea what happened.",
   "created_utc": 1703119188,
   "score": 1,
   "submission_id": "18n9p5l"
  },
  {
   "comment_id": "ke9baq6",
   "message": "I was naked and sat in the front yard to moon bathe. A different time, my stepson was 2 at the time, walked to the kitchen, opened the fridge, poured himself a handful of parm, ate it, and went back to bed.",
   "created_utc": 1703119409,
   "score": 1,
   "submission_id": "18n9p5l"
  },
  {
   "comment_id": "ke9es1l",
   "message": "My son used to get up and stand in the doorway to the living room, holding his pp and shuffling back and forth, saying stuff nobody could understand. He did this a few times when he was 6, then it stopped.",
   "created_utc": 1703120885,
   "score": 1,
   "submission_id": "18n9p5l"
  }
 ]
}