{
 "submission_id": "18na5ph",
 "title": "What was the most awkward thought you had about your newborn baby?",
 "selftext": "",
 "created_utc": 1703119821,
 "permalink": "/r/AskReddit/comments/18na5ph/what_was_the_most_awkward_thought_you_had_about/",
 "score": 47,
 "url": "https://www.reddit.com/r/AskReddit/comments/18na5ph/what_was_the_most_awkward_thought_you_had_about/",
 "comments": [
  {
   "comment_id": "ke9e7a9",
   "message": "\"What the fuck am I supposed to do now?\"",
   "created_utc": 1703120648,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9fnzm",
   "message": "The father is Asian and my baby looked so Asian that exhausted me wondered, \"Is this my child?\"",
   "created_utc": 1703121255,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9d6ig",
   "message": "Don’t know if it’s awkward, but I was so sleep deprived that I hallucinated that her face morphed into a demon’s with sharp teeth while I was nursing her late at night.",
   "created_utc": 1703120215,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9erxd",
   "message": "With my son, I thought, “this baby doesn’t look like my husband. He looks like my brother in law (or his dad, as I would later discover).”\n\nWith my daughter, I thought, “Is my baby supposed to be blue and listless?”",
   "created_utc": 1703120883,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9e3ir",
   "message": "Given that we're not having children, the thoughts would be something like \"*what the fuck is this thing and how the fuck do I get rid of it*?\"",
   "created_utc": 1703120603,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9d57n",
   "message": "I think he has something special in his face? is that autism or something..... All the news about things today makes you super skeptical",
   "created_utc": 1703120199,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9g81w",
   "message": "She had a huge head and I was worried I'd had a ugly child lol.",
   "created_utc": 1703121492,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9gm9d",
   "message": "Am I ready to be a dad?",
   "created_utc": 1703121655,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9hewq",
   "message": "\"She looks like a squished up old man.\" She was adorable but she was not a \"pretty\" newborn baby lol. After she unsquished she was very pretty and now she's a gorgeous teenager - I may be a little bias but other people say it too so I believe it.",
   "created_utc": 1703121982,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9i0kj",
   "message": "I was convinced my newborn looked exactly like Rick Moranis, and my wife got annoyed constantly hearing that. It did eventually go away, though now Rick Moranis looks like a newborn to me",
   "created_utc": 1703122232,
   "score": 1,
   "submission_id": "18na5ph"
  },
  {
   "comment_id": "ke9idjm",
   "message": "First: when arriving home and he is in his car seat and I am staring at him and then the husband, frozen, and all “well? What now? What do we DO?”   \nSecond: feeding one time and thinking he was literally a hairless monkey lmao both the kids reminded me of hairless monkeys 🤣",
   "created_utc": 1703122384,
   "score": 1,
   "submission_id": "18na5ph"
  }
 ]
}