{
 "submission_id": "18nemqw",
 "title": "What’s the poorest you’ve ever been?",
 "selftext": "",
 "created_utc": 1703133959,
 "permalink": "/r/AskReddit/comments/18nemqw/whats_the_poorest_youve_ever_been/",
 "score": 9,
 "url": "https://www.reddit.com/r/AskReddit/comments/18nemqw/whats_the_poorest_youve_ever_been/",
 "comments": [
  {
   "comment_id": "kea8ma7",
   "message": "‘Use the porch as a fridge during cold weather because the ice box is broken’ poor.",
   "created_utc": 1703134161,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea8p5j",
   "message": "Now. I'm $300k deep in medical debt from getting cancer. I couldn't start making payments fast enough apparently cause my house got repossessed. And my car. And most of the money in my bank account. \n\nAmerica is the best country in the world 😃",
   "created_utc": 1703134202,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea8rgh",
   "message": "Had to put food and gas on a credit card.",
   "created_utc": 1703134236,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea8us1",
   "message": "Didnt have a place to stay, rented a small uhaul box truck and slept in the back in a parking lot for 2 weeks. Cheapest rent I ever paid",
   "created_utc": 1703134284,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea8si5",
   "message": "Myself: having sleep for dinner multiple times a week in my late teens and early 20s\n\nMy family: my mom taking us kids on walks to search for spare change so we could use the laundromat",
   "created_utc": 1703134252,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea8z72",
   "message": "2$",
   "created_utc": 1703134350,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea94sf",
   "message": "No money in bank accounts",
   "created_utc": 1703134433,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea9amm",
   "message": "I didn't quite understand the concept of saving money when I was younger. I had a decent paying job for my age with very few expenses, so I had a lot of spare cash. Because of that, I spent a lot of money. Eating out every other night. Trips to theme parks every other week. Buying expensive gadgets all the time. I never really checked my bank account, I just always had money in there (I wasn't rich, I just hovered at around $1K. Money would go in, then money would come out).\n\nOne day, I was putting fuel in my car and my card got rejected. I checked my bank, it was -$10.\n\nAs I said, I had no concept of saving money, so it's not like I had different accounts I could just transfer money from. I had literally negative money overall. My spending just got away from me, and I had nothing left until I got paid again.\n\nWorst still, I had a university course I had to pay for, which isn't cheap. For the next two months, I survived on about two hot dogs a day. One for breakfast, one for dinner. I didn't each lunch, nor did I snack. Literally just two frankfurters and two slices of bread a day.\n\nBudget frankfurters were dirt cheap, as was bread. The first month was to save money for my uni bill, the next month was to get my money back up. After that, I learned to save instead of spend.",
   "created_utc": 1703134520,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea9hn2",
   "message": "Sleeping under a plastic bag in the park",
   "created_utc": 1703134626,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea9k69",
   "message": "\"I dont have money for the sandwich, I still need gas.\", 19 year old me living out of my car.",
   "created_utc": 1703134665,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kea9w41",
   "message": "i had no money",
   "created_utc": 1703134844,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "keaakrp",
   "message": "I remember being mayonnaise sandwich poor when I first moved out of my parent’s house. \n\nCouldn’t afford to wash clothes in the complex’s laundromat, so I did laundry in the bathtub/shower.",
   "created_utc": 1703135222,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "keaasls",
   "message": "Barely finding enough change to buy a fountain drink. Had to use the dirtiest pennies from the depths of my car.",
   "created_utc": 1703135341,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "keabe8w",
   "message": "As a kid: Being taken aside by my 5th grade teacher who scolded me because my mom's $5 check for a required stupid plastic recorder had bounced.\r  \n\r  \nAs an adult: Counting nickels at the bottom of old purses to scrounge up enough for subway fare to get me to a job interview. I think the fare was $2 at the time. Fun times.\r  \n\r  \nI'm financially comfortable now, but don't think I'll ever forget how terrifying and exhausting being poor is.",
   "created_utc": 1703135681,
   "score": 1,
   "submission_id": "18nemqw"
  },
  {
   "comment_id": "kead1fi",
   "message": "Currently living in my poorest era of life lol",
   "created_utc": 1703136622,
   "score": 1,
   "submission_id": "18nemqw"
  }
 ]
}