{
 "submission_id": "18ne0ct",
 "title": "What is the biggest misunderstanding you have ever encountered?",
 "selftext": "",
 "created_utc": 1703131846,
 "permalink": "/r/AskReddit/comments/18ne0ct/what_is_the_biggest_misunderstanding_you_have/",
 "score": 211,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ne0ct/what_is_the_biggest_misunderstanding_you_have/",
 "comments": [
  {
   "comment_id": "keamtx9",
   "message": "I was a cashier and the customer I was ringing up started talking to the next person in line. The first customer mentions the Seahawks game that took place the day before, but the second customer says not to tell them who won because they hadn’t seen it yet. Also the day before, there was a huge storm with lots of wind, and the second customer starts talking about how intense it was. The first customer somehow didn’t hear the change in topic, so they think the other person is talking about the intensity of the football game, but they are talking about the storm: “lights were flickering, windows shaking, didn’t know what was going to happen, very worried, etc….” It was an intense game, so the first customer is agreeing with all this, but they are talking about totally different things.\nThe first person’s transaction is done, so he wraps up the conversation with “At least the Seahawks won,” and merrily goes on his way, and the second guy’s jaw drops and is baffled at what just happened.",
   "created_utc": 1703142753,
   "score": 99,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaowv0",
   "message": "All throughout middle school, I was close friends with a Muslim boy who went to my school. His dad was from the Middle East, while his mom was from the states, and their family was so beautiful and kind.\n\n  \nOccasionally we would talk about religion… Mostly because as a Christian I was curious about his beliefs and he was curious about mine, but never anything too crazy.\n\n  \nHowever, one day at lunch he came to sit with me at a bench. He only had a tiny bit of food on his lunch tray, and when I asked him why, he said, “since I'm Muslim I can't have sporks.”\n\n  \nI thought that was quite fascinating. I didn't know there was a religion that didn't allow their people to use plastic lunch sporks! So later that night I ran home to tell my parents.\n\n  \nAs soon as I told my dad, he squinted at me and looked down confused. “Are you sure that's what he said?” He asked me.\n\n  \n“Yeah dad, I trust my friend’s answer because he’s actually Muslim-unlike you.” I said matter-of-factly.\n\n  \n“Are you sure he didn't say pork?”\n\n  \nI sat quietly for a moment. “That makes a lot more sense now that I think about it.” I admitted.\n\n  \nThats probably the biggest misunderstanding I've had about a group of people.",
   "created_utc": 1703144270,
   "score": 33,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebmrnk",
   "message": "In college I hade a rad roommate named Mike. One evening I was in the back yard drinking wine with a date. Mike and his then girlfriend popped their heads in to say hi. I introduced them to my date “This is my roommate Mike, and Mike’s girlfriend Lisa”. My date awkwardly said hi, and they excused themselves and went up to our flat. \nMy date asked if that was weird. Confused, I said no. She thought it was odd that Mike’s girlfriend was hanging out with Mike in our flat, and regularly spent the night in his bed. I asked why that was weird and she just sort of looked at me like I was a weirdo. She kept insisting it was a messed up living situation. She seemed VERY perplexed. I was confused as to why this would be weird.\nFinally at the end of the night I invited her up, and she declined saying it felt really weird to stay over when my ex girlfriend is also there sleeping in my roommate’s bed.\nThen I realized what was happening….\nI was saying “Mike’s Girlfriend”\nShe was hearing “My Ex Girlfriend”\nThe entire conversation and her bizarre reactions suddenly made total sense.",
   "created_utc": 1703166880,
   "score": 164,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea4daq",
   "message": "I used to pick up things for others but they thought I wanted to take it,\r  \nThis misunderstanding makes me very sad",
   "created_utc": 1703131985,
   "score": 214,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaomar",
   "message": "There was a HUGE misunderstanding between my parents, they thought they were capable of raising a child.",
   "created_utc": 1703144056,
   "score": 42,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb4mba",
   "message": "Group project at university, which took an entire year. We had to build some software for a local company. We'd have regular meetings to discuss it, and nominated Jim to take the minutes at every meeting. He sat there scribbling away in a notepad every meeting.\n\nLate into the project, we needed to go back and re-visit some requirements we were unsure of. Luckily Jim had the minutes. So we asked him to read back the minutes of a few meetings around the time we thought we came up with it.\n\n\"Ok, so the meeting on Tuesday 11th took 14 minutes. The Thursday one took 21 minutes. Monday was 18 minutes...\"\n\nWe thought he was joking. Nope. That's literally what he thought \"minutes\" meant, and he never thought to ask \"Why would we ever need that?\"",
   "created_utc": 1703156425,
   "score": 76,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaaofp",
   "message": "That if you use the car insurance to fix your car after an accident, they’ll fuck you in the ass with the premium for a while. So what the hell do I pay for every 6 months?",
   "created_utc": 1703135278,
   "score": 23,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea5zji",
   "message": "\"If humans evolved from apes, how come there are still apes?\"",
   "created_utc": 1703132796,
   "score": 254,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea8q8g",
   "message": "That if you make more money, you'll get taxed more and actually lose money in the next tax bracket.\n\nMarginal tax brackets are not that complicated.",
   "created_utc": 1703134218,
   "score": 105,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kealjew",
   "message": "I’ve got autism so LOL\n\nBut one I can think of recently, is the trend of the bumper stickers that say “Honk if you x!”\n\nI thought you’d honk at “Honk if you like pizza” because you liked pizza and you wanted to say HI IM SILLY HELLO CAR! PIZZA IS GREAT!\n\nI am 28 and didn’t realize until this year it was implying that if anyone honked at them for any other reason, the driver could as a joke say, “I didn’t do anything wrong, it’s just because they like pizza!”",
   "created_utc": 1703141848,
   "score": 7,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keac5w9",
   "message": "I once met a girl who thought that if she was having sex and was on top she couldnt get pregnant,, because, well, gravity",
   "created_utc": 1703136115,
   "score": 95,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keam3y9",
   "message": "This is a tough one to explain but I'll give it a try. Cost me dating a girl that I really liked.\n\nThis was my post-College years (so Mid 20's) and back in the 90's so statute of limitations is over LOL.\n\nI had a female friend from all the way back in High School. Let's call her Mia. Mia and I were very close friends but never romantic at all. We remain friends to this day. In Mia's friends group was a girl that I \\*really liked\\* - for many years. Let's call her Hope. Hope was dating a mutual friend (Alan) so I never made a move.\n\nA few years after HS I got a call from Mia that Hope was house-sitting near where I lived and I should give her a call. Hope was single, I was single, so I gave her a call. She invited me over to the house, we hung out, and I ended up staying the night. Although Hope had some hang-ups around intercourse, we had a good time together that night and made plans to see each other the next night.\n\nMy friend Mia called me the next morning to ask \"how things went\". I didn't want to get into a gossip situation, so I basically just said \"*we had a really good time*\" and left it at that. Mia was a friend, I know she wanted details, but I also didn't want to get into it since Hope and I had a lot of mutual friends that knew Alan (the ex-boyfriend), and I didn't want word spreading around.\n\nWell, my friend Mia decided that \"*we had a really good time*\" meant that Hope and I had sex. While we did fool around a lot, we didn't actually have intercourse and I wasn't trying to lead on that we did. It took all of 30 minutes after I spoke with Mia for word to get back to Hope that I had told Mia we slept together. This caused a whole other issue as it turns out Hope had never had  sex with Alan. So now our entire friend group knew that Hope and I had 'hooked-up', but it also got back to Alan that we had sex the first night. Of course, this was a huge mess for a variety of reasons.\n\nSo that was that. Despite me trying to explain to Hope exactly what happened, that I never told Mia any details or suggested we had sex, and it was a misunderstanding based on Mia's assumptions - it was over. One great night, could have been a relationship, all over in less than 24 hours.\n\nHappy Ending: a few years later Mia introduced me to another of her friends who is now my Wife. We've been happily married for over 20 years.",
   "created_utc": 1703142244,
   "score": 169,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebdxkx",
   "message": "I was young and socially awkward, still am, But now I'm old and could give less fucks.\n\nAt a party with my girlfriend and I knew no one. Ambled around awkwardly and finally found a temporary friend. We shot the shit for a while, then I went to sit next to my girlfriend by the fire while we kept talking.\n\nI'm sitting there rubbing her leg/thigh, not sexual, but intimately. A minute later I turn to her to say something and realize it's not my girlfriend. It's just some random ass, terrified looking girl that I've apparently been groping, unbeknownst to me.\n\nI wanted to explain myself but I think I just said \"Guuuuughhh\" and went and hid until we left the party. Very fucking awkward.",
   "created_utc": 1703162447,
   "score": 42,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebonbe",
   "message": "My dad spent a year calling a guy Dirt. He thought it was a nickname or something. No, the guys name was Dirk.",
   "created_utc": 1703167725,
   "score": 40,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaqr36",
   "message": "At a party once my wife was telling someone how she thought it was sketchy that someone brought a guest, a stranger to the rest of us, who had two black eyes. One of our other friends was getting extremely upset at this statement and we were having a pretty hard time seeing how it was controversial that she thought it was a little uncomfortable that this stranger “Eddy” showed up with two black eyes.\n\nOur friend kept saying how he couldn’t believe we were the kind of people who would be put off by Eddy showing up with two black eyes and he was so disappointed in us, and wasn’t sure if we could continue to be friends. \n\nTurns out he thought my wife was saying “two black guys”…. Once we all figured it out hilarity ensued. Alcohol was a factor…",
   "created_utc": 1703145637,
   "score": 108,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebzmh3",
   "message": "My daughter was 5 years old when my Dad (her grandpa) died unexpectedly.\n\nShe was quite curious and asked “what happens to grandpa now since he died?”. \n\nI explained that his body will be buried in a few days, which she asked, “well what happens to his head?”\n\nCracked my shit up, as I know my Dad would have found that hilarious also.\n\nI miss your dark sense of humor, Dad. Love you and still miss you!",
   "created_utc": 1703172287,
   "score": 38,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaqkh9",
   "message": "I work with developmentally disabled adults, and a couple years ago one of them attacked me and beat the shit out of me. I ended up having to go to the ER to get stitches in my eyebrow and my boss drove me there. It didn't occur to either of us that he is an absolutely massive dude and the people in the ER didn't believe me at first until he whipped out the worker's comp forms and they realized where I worked and we kind of had a laugh about it.",
   "created_utc": 1703145499,
   "score": 71,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb5l4u",
   "message": "I had to take first aid training for work. When we were working with the child dummies I said to the stranger next to me (an older gentleman) that we were handling the dummies like Michael Jackson would. (stupid joke) it got really awkward and I realized he didn’t know I was referring to the incident where Michael dangled his kid from a balcony. I tried to explain myself but it just turned into a scene from curb your enthusiasm.",
   "created_utc": 1703157132,
   "score": 34,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea9eus",
   "message": "One time I told a girl I was dating that as a child I beat Down’s Syndrome. Like that I had it but they cured it, obviously joking it’s a theo vonn joke that I stole, and I assumed she was going with the bit when she was like “wow really??” \n\nFast forward months later and the subject of Down’s Syndrome came up, she said something about hoping they can cure the kid, I go “you can’t cure down’s syndrome my love lmfao”, and she goes “they literally cured yours as a kid you told me”\n\nShe spent a year romantically involved with a guy who she thought was an ex-Down’s, and thought nothing of it. Bless that girl, she was like a golden retriever in a woman’s body. All heart no brain",
   "created_utc": 1703134583,
   "score": 162,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kecahik",
   "message": "Worked at as an instructor at a science/engineering summer camp. Throughout the week we'd give the kids fake money for good behavior. At the end of each week, we'd host an entrepreneurship fair where the kids could spend their \"money\". Kids would bring toys from home and sell it for the \"money\". One week, a kid walks up to me and tells me the other kids won't sell him toys because an instructor told them not to as he was black. I was surprised at the blatant racism and decided to investigate.\nTurns out this kid had been buying the other kids' toys and reselling them for more \"money\". When the kids complained to my colleague she told them to not sell to him because he was blacklisted, not because he was black. \nAnyways that was a fun conversation with the parents. I do think that kid is going places though.",
   "created_utc": 1703176384,
   "score": 22,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb7pwy",
   "message": "I’m 71 years old and went to my doctor for an annual check up. During the examination she slipped in some questions testing for cognitive decline. \n\nQ: Diarrhea? A: No.\n\nQ: Constipation? A: No\n\nQ: President? A: What country?\n\nQ: What? A: What country?\n\nQ: Let’s do the USA, president? A: I know them all. What years? \n\nQ: Let’s try something else? What did you eat for dinner? A: What day?",
   "created_utc": 1703158621,
   "score": 58,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea7c9c",
   "message": "You need experience for work. You have to work to get the experience.",
   "created_utc": 1703133493,
   "score": 101,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaotnb",
   "message": "A friend of mine was engaged to a man from Bangalore. The two of them were walking in the city with his brother when they were stopped by police.\r  \n\r  \nAt the police station, they were separated. My friend with one policeman, her fiance and his brother with another policeman.\r  \n\r  \nThey thought she was being stalked and brought them in. But after speaking with them and realizing that they knew each other, the case flipped instead of being dropped.\r  \n\r  \nThey then were accusing her of being a sex worker.\r  \n\r  \nOf course it was all sorted out, but she says that those 3–4 hours were among the most stressful of her life.",
   "created_utc": 1703144203,
   "score": 39,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keauh4w",
   "message": "I have misunderstandings every time I interact with another human being.\n\nSlap on the metaphorical mask, put on my overly-sweet voice because my regular voice is the vocal equivalent of resting bitch face, try to make small talk, laugh awkwardly, get seen as either a psycho who needs to move into a ward at the hospital now or a really really dumb person, rinse and repeat.\n\nI really just want a friend. Or two. Or three. Or a million. I'm nice. I'm just socially awkward.",
   "created_utc": 1703148517,
   "score": 66,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebnwsu",
   "message": "My husband called someone Terry for five years. Their name was Sam. They never corrected him.",
   "created_utc": 1703167397,
   "score": 17,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebzcrp",
   "message": "I got an email about an employee from a company we work with needing help with her 2FA for a database we run. The system flagged it as a possible phishing attempt, so I called the employee and she said she didn’t request any help. I shot an email to my boss saying that this company (an elementary school) might have a security issue we should look into. Thinking my job was done for the moment, I left to use the bathroom. Came back to find my boss tearing his hair out. His kids went to that school and he had no idea what level of “security issue” I meant with that insanely cryptic message. He was about ready to drive over there and yank his kids out of school to save their lives.\n\nIt still haunts me.",
   "created_utc": 1703172182,
   "score": 16,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaabzo",
   "message": "Chrissy and Janet went overnight for a wedding shower. Jack, in their absence, threw a giant disco party. The party was a success, and even Mr. Roper was convinced to join in after he goes up to the apartment to complain about the noise, discovering the plentiful alcohol and flirtatious sirens.\n\nThe next morning, Chrissy and Janet arrived back and noticed Jack and another covered-up person in bed together - Roper. Jack was forced to convince Roper nothing scandalous happened last night, revealing he was never actually homosexual - but Roper doesn't believe him. Thankfully, the truth was eventually revealed - Jack and Roper just passed out from having too many drinks.",
   "created_utc": 1703135087,
   "score": 53,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea7454",
   "message": "That the moon is bigger than the Earth.",
   "created_utc": 1703133376,
   "score": 24,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keao5ug",
   "message": "For me, the most significant misunderstanding happened in my personal relationships. There was a time when I thought my best friend was avoiding me and not responding to my messages. I assumed that I had done something wrong and started feeling hurt and neglected. It turned out that my friend was going through a tough time and was dealing with personal issues. They hadn't intentionally ignored me, but I had jumped to conclusions without understanding the full picture. It taught me the importance of giving people the benefit of the doubt and communicating openly about our feelings.",
   "created_utc": 1703143713,
   "score": 18,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keccdzl",
   "message": "I said something once about my mom having bad depth perception. My brother died a few years prior and mom immediately started screaming \"WTF DO YOU MEAN I DON'T HAVE DEATH PERCEPTION?!?! MY SON DIED!!!!\"",
   "created_utc": 1703177083,
   "score": 9,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keabocq",
   "message": "Trickle-down economics.",
   "created_utc": 1703135839,
   "score": 37,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keci5fi",
   "message": "In 2007 I was in high school and I was trying to explain that the Susan G. Komen organization didn’t do as much good as their public image portrayed them to have and mentioned how most of the money that comes in goes to administration costs. But a girl in the class whose mother had survived breast cancer threw a fit as if I didn’t understand how serious breast cancer is. I tried to explain myself but it didn’t go well, then 4 years later that’s when all of the controversy started to become more known to the public.",
   "created_utc": 1703179176,
   "score": 8,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kec21rn",
   "message": "Went to a convention. Ended up sharing a room with a lot of different people. So five of us were talking about \"sand people\" when another one who was sharing the room showed up and started tearing us all new assholes for being racist.\n\nThen we told him we were talking about tusken raiders. Which Luke and Obi-Wan call \"sand people\" in Star Wars.\n\nWe all ended up laughing non-stop for a good ten minutes.",
   "created_utc": 1703173227,
   "score": 8,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kec4k4w",
   "message": "\nOh boy... this was 25 years ago.  In 9th grade, I had a new school and environment, and I (m) had a Spanish class during the first semester. The teacher was a lady who, to me, looked like she could be in her late 40s. She was blondish.\n\nAs the weeks went by, I saw this girl (a tall blonde, dance line member) in the hall and at the pep rallies, and I thought to myself \"she sure does look like Mrs Spanish(fake name).\".\n\nOne day, I was walking through the hall when I heard one teacher say to another, \"Did you see Mrs. Spanishs daughter at..\" and I didn't hear the rest as I was walking to class. Lightbulb moment, so I thought, I was right.. the blonde girl was her daughter. She looks so much like her.\n\nIn high school, I was socially awkward and would just say random things for attention. I was talking to this boy in my class when I said \"Mrs Spanishs daughter is pretty,\"and he freaked completely out, I so was confused. He said, \"Her daughter is 5!!\"..we talked, I told him about the tall blonde..and eventually he told me the girls name, and that she was a senior. \n\nI never told Mrs. Spanish, lol\n\nMrs. Spanishs daughters(she had 2, the other was like 7) now grown, actually have dark hair and look nothing like their mom. The dance line girl still looks so much like Mrs. Spanish.  Mrs. Spanish and the dance line girl are on my Facebook lol.\n\nIt was such a terrible embarrassing experience, but now I look back and laugh lol",
   "created_utc": 1703174169,
   "score": 6,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kecjl5j",
   "message": "I came home one day and saw that the curtains in our picture window were gone. I asked Mom where are the green curtains. She looked at me and said they're brown. Turns out I am color blind",
   "created_utc": 1703179694,
   "score": 7,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb5389",
   "message": "That the person I married four years ago cared about me enough to build and maintain a healthy relationship where we would support each other and communicate with honesty and empathy because we genuinely loved each other.",
   "created_utc": 1703156771,
   "score": 5,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kec83ia",
   "message": "I teach evolution. People really have a bad misunderstanding of evolution.",
   "created_utc": 1703175502,
   "score": 6,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kecgh4w",
   "message": "While lifeguarding one day a patron I often talk to said hi to me. I said hello back and asked where her friends were, (because usually she had a crew) she said they didn’t come because of the weather, but her sister Eileen was in the hot tub.\n\nMe wanting to make a joke said, “oh Eileen, does she walk like this?” Then tilted my upper body sideways and walked a few quick steps. The woman looked furious and said it wasn’t very funny.\n\nI awkwardly laughed and said yeah it was kind of a dumb pun. She swam off angrily… then I rotated to hot tub and saw Eileen and noticed she had a really skinny left leg that maybe didn’t develop properly that she had to drag it and take awkward steps… I ran over to the other patron and explained I think we had a misunderstanding and I was making a joke about her name “Eileen I’m leaning” I didn’t know the person attached to the name. She thought I was back peddling and has hated me ever since, but whatever.",
   "created_utc": 1703178568,
   "score": 7,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kecneyu",
   "message": "An old coworker grew up in a remote and isolated area. Somehow he thought that the Holocaust had led to the death of all Jewish people. He went away to college and met some Jewish people. By his own admission he blurted \"How did Hitler know to kill you you look just like us?!\"\n\nPoor poor guy.",
   "created_utc": 1703181074,
   "score": 6,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keave15",
   "message": "My first husband!!! He thought he was a God, I thought it was misspelled.",
   "created_utc": 1703149238,
   "score": 12,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebrb8o",
   "message": "I’ve had some huge misunderstandings of slogans. \n\n“Every kiss begins with Kay”\n\nNever realized the double pun. Kiss literally begins with K. But I always understood it as “Every kiss begins with getting some jewelry from Kay Jewelers”. Might as well have said “Every kiss begins with Jared’s”. \n\nAnother one\n\n“Doesn’t it feel good to PayLess”. The shoe store was called PayLess. It wasn’t until well in my 20s that I realized they were saying it feels good to actually pay less and not “Doesn’t it feel good to shop at this store”. \n\nThis is embarrassing now that I’ve typed it out.",
   "created_utc": 1703168887,
   "score": 4,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebdp18",
   "message": "I'm aspie, I have too many to count.",
   "created_utc": 1703162311,
   "score": 6,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kedgeks",
   "message": "I once wrote a scathing amazon review for a 6 pack of socks because my husband said\n \"Wow, only one pair?\"\n\nTurns out I had also done the grocery shopping that day, and he was disappointed at the singular PEAR I had bought.",
   "created_utc": 1703191739,
   "score": 3,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb0uw2",
   "message": "God I'm always embarassed telling this but one time in highschool we were doing an audition for french session theather, I'm kind of a person that stands tall and moves while listening to anything so i posed on the wall one leg back to the wall hands behind my back and i kept leaning back, my hands were making a gap and when i leaned back it made a big fart noise that everyone started bursting laughing and idk why it was so calm at that damn specific moment that it was so heard even the teacher laughed, i kept explaining it several times after that until i finally gave up and accepted it lol",
   "created_utc": 1703153593,
   "score": 2,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaopmf",
   "message": "Kid at school called me a mother fucker and I told my mom that some kid called me a bad word today. She asked which one and I said it as my dad came in the door. He Rick James' me and I hit the floor.",
   "created_utc": 1703144123,
   "score": 5,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea9p82",
   "message": "Redditor Moderators are unbiased",
   "created_utc": 1703134741,
   "score": 5,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb2wja",
   "message": "One time, folks thought I stole cookies, but it was my sneaky sibling. Biggest misunderstanding ever.",
   "created_utc": 1703155152,
   "score": 2,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kece5ib",
   "message": "I'm deaf. you can guess many misunderstandings from that. the one I never understood was 🙏 being thank you. I guess it's more common and easier to do than the actual thank you sign? and for some reason a whole lot of people ASSUME American Sign Language is international. uh... if there's other languages I'm sure Sign Language would be same lol. I had one that came from US being gobsmacked that there was different sign languages (he never had met a deaf person before) I told him why the hell would he expect that lol",
   "created_utc": 1703177725,
   "score": 2,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kea79g9",
   "message": "[deleted]",
   "created_utc": 1703133451,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keadtr9",
   "message": "When growing up and any time where a friend might have had a disagreement with another mutual friend and expected me to take sides, also insinuating to not take a side was disloyal.",
   "created_utc": 1703137079,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keaftm3",
   "message": "Republicans vs Democrats.",
   "created_utc": 1703138243,
   "score": 253,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb61md",
   "message": "They think I like them :))",
   "created_utc": 1703157463,
   "score": 0,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb7ve3",
   "message": "Telling my perspective",
   "created_utc": 1703158724,
   "score": 0,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keb6ilu",
   "message": "I was considered difficult from the first meeting",
   "created_utc": 1703157791,
   "score": 0,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebf07i",
   "message": "they just met me and they think I'm a difficult person",
   "created_utc": 1703163039,
   "score": 0,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kec77ek",
   "message": "Life but I suspect that is how they really want it.",
   "created_utc": 1703175166,
   "score": 0,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "ked9ox6",
   "message": "In school I was one of those girls that was always in the big stall with 20 others girls smoking, this girl with special needs named kass pulled out a vape in class when the teacher left, never in 1 million years would I have thought she would do that type of stuff, when the teacher came back everyone was done with their work. We had free time to talk so me and my friend in the back of the classroom were so shocked we ended up calling her over we were talking to her about it, and then she came up with a code so instead of saying “vape” we would say “running” (important detail for this story kass is on the bigger side) so I asked her how long have you been running for?\nMeaning, how long have you been vaping for?  She replied one week. So then I asked her where do you get your running shoes from meaning where did you get your vape from she told me her friend so I was like oh what friend trying to see if maybe she had the same plug as me or something before she could even answer, my teacher stands up, screams at me and sends me down to the office at this point I’m just mad confused,\nCause it’s not like we weren’t allowed to talk we had the rest of the class to ourselves, I go down to the office I’m sitting there for about 20 minutes before the principal calls me in she tells me my teacher said I was bullying kass and making fun of her for running, I was sitting in the principals office for about an hour, trying to plead my case without saying what we were actually talking to, they never ended up believing me that I wasn’t making fun of her and I was pissed",
   "created_utc": 1703189231,
   "score": 0,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keavrq1",
   "message": "Everything.",
   "created_utc": 1703149542,
   "score": 254,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebwb8k",
   "message": "Apparently in the UK, if you call your dentist for an emergency appointment, you can only have one if your assigned dentist is working....... Needless to say I went full menopausal, in pain, Karen on them..  Got an emergency appointment though 😉",
   "created_utc": 1703170975,
   "score": 254,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keamv2e",
   "message": "My older brother and a friend did edibles, the friend is a heavy weed user and my brother started vomiting alot in the middle of the night and still under the effects of the edibles, a drug expert I know said he'll be fine and it was just a thc overdose,\n\nKnowing he'd be fine, I was still incredibly angry, undersrandibly, and threatened to beat the abwolute shit out of her.\n\ncome a few days later and she told my brother about that, and they were both intimidated and wanted me to apologize, I did not want to, as I will destroy eveeything to defent whom I love.\n\nthe misunderstanding was, I had thought she brought them and in her presence, had pressured him to eat them. What happened was HE bought them and used them on his own, I feel bad for making her so scared but I still stand by what I said, we're cool now but I need to stop being blinded by what could be, and understand what is, when it comes to situations like that",
   "created_utc": 1703142775,
   "score": 241,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebjtan",
   "message": "The biggest misunderstanding I've ever encountered is that people think AI is here to replace them. AI is here to make our lives easier and help us learn more. It's here to help us achieve whatever our dreams may be, not to take them away.",
   "created_utc": 1703165493,
   "score": 249,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kebjywk",
   "message": "The big one I see constantly is men and women really not understanding each other. Women really don't understand male sexuality at all. Men are a bit better about this but not much. \n\nMen and women assume the other has the same preferences and motivations that they do and, in many cases, especially those around sexuality, they very much do not. \n\nLet's take dick pics as an example. A man would be over the moon happy if a strange women sent him a pic of her genitals. These ignorant men are assuming that women would also be made happy by getting a pic of their genitals. This disgusts women that confuses those men. \n\nOn the female side of the misunderstanding, we see women working hard to gain money and status. That's what they want in a mate and they just assume that it must also be what men want. They work hard to succeed and are then confused when the rich, high status men they want don't want them back. Men simply don't care about a woman's money or status. A CEO will date a hostess, if he likes her. A woman would never date down like that and can't seem to process that men do happily.",
   "created_utc": 1703165570,
   "score": 249,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kec3tue",
   "message": "# Peehole and fuckhole are not the same hole",
   "created_utc": 1703173898,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kecr6mp",
   "message": "I reported to my vice principal that my phone was stolen. Somehow, he interpreted this as I stole a phone and was admitting guilt so he took me to the school officer to report myself. I spent about an hour in his office trying to explain that MY phone was stolen and they just would not listen. I had to empty my pockets and they called the number I provided to see if it was on my person (wut). They then sent an email out to the school to see if anyone lost a phone so they could identify me. No one came forward and they sent me to class after a total of 2 hours and never did anything about my phone.",
   "created_utc": 1703182446,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "ked3u27",
   "message": "I once joked with my sister that her baby daughter would grow up to be a hoard( or a hoarder). She heard \"whore\". Yeah...",
   "created_utc": 1703187077,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "ked494b",
   "message": "My dad has a really funny story from his time as a consultant. One company that hired him invited him to a company outing at a county club. There was a black dude working there that really liked tennis, and he and my dad were heading to the courts to play a few rounds. The black dude bought a new light blue tennis outfit for the occasion. As they are approaching the court, they see a sign that says \"Whites only\" on the fence, but they write it off and go in anyway. An employee approaches my dad's friend and says, \"I'm sorry sir, but we only allow whites on the tennis courts.\" My dad's friend immediately screams, \"Say what? You mean to tell me in this day and age I can't play a round of tennis?\" The employee suddenly looks panicked and says, \"No, sir the clothes! We only allow white clothes!\" My dad said they both just bust out laughing at that point and apologized to the man.",
   "created_utc": 1703187232,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "ked93t1",
   "message": "I was detained at the Canadian border trying to head home from a trip and they told me I had a warrant for my arrest.\n\nMind you, I worked for a financial institution at the time  and I’ve always been straight edge squeaky clean. \n\nWhen I got to the border they asked me to step out of the vehicle and me being a good girl I just assumed they were doing a random check so I got out and was super chatty and friendly until they told me to turn around and put my hands behind my back. That’s when it clicked that I was being arrested.\n\nI was taken inside the facility and searched and they said they had to see if I was to be extradited which I didn’t even know what that meant. \n\nTurns out my registration had expired in the state I no longer lived in and there was 0 communication through the proper channels when I registered my vehicle in my new state. Despite the fact that I filed for a new address and all of that. \n\nSince it was all a misunderstanding and I had proof that I did everything properly before the registration even expired in the first place. It was washed away but in the moment, it was super scary for me lol.",
   "created_utc": 1703189015,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "keda4eu",
   "message": "The Menu",
   "created_utc": 1703189390,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kedluxe",
   "message": "Girl I dated thought sugar and salt were basically the same thing because \"you use it the same way. Sprinkling it on foods\"  \n\n\nThat relationship did not last long.",
   "created_utc": 1703193761,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kedrnhw",
   "message": " Ah, the innocence of childhood. It's always interesting to look back on these misunderstandings and laugh.",
   "created_utc": 1703195924,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kedtwzy",
   "message": "The one between the source and what the matrix tries to lie about",
   "created_utc": 1703196788,
   "score": 1,
   "submission_id": "18ne0ct"
  },
  {
   "comment_id": "kee7i3s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ne0ct"
  }
 ]
}