{
 "submission_id": "18ng177",
 "title": "What's a life hack that's so simple yet so effective, you're shocked more people don't know about it?",
 "selftext": "",
 "created_utc": 1703138708,
 "permalink": "/r/AskReddit/comments/18ng177/whats_a_life_hack_thats_so_simple_yet_so/",
 "score": 185,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ng177/whats_a_life_hack_thats_so_simple_yet_so/",
 "comments": [
  {
   "comment_id": "kebfh66",
   "message": "When looking at recipes online, click the print link. This cuts out the unnecessary backstory and random musings. You can also save the recipe as a PDF to your computer or even just the link to the printable version.",
   "created_utc": 1703163288,
   "score": 110,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb2fht",
   "message": "Create a routine for BEFORE exercise. I do the exact same things every time I go to the gym. When I'm not motivated, those little pre workout habits just trigger me into action.",
   "created_utc": 1703154800,
   "score": 145,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebdt6o",
   "message": "If you get something that comes with a unique charger/power cable, label it with what it’s for.",
   "created_utc": 1703162377,
   "score": 137,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebehl7",
   "message": "To increase your peace of mind don't waste your time arguing with random strangers on internet.",
   "created_utc": 1703162758,
   "score": 53,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb65il",
   "message": "Always write down momentarily good ideas. Don’t lean on your memory",
   "created_utc": 1703157542,
   "score": 44,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebc28p",
   "message": "Write shit down.",
   "created_utc": 1703161369,
   "score": 200,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kealcgf",
   "message": "[removed]",
   "created_utc": 1703141710,
   "score": 191,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebc3h3",
   "message": "If you're making coffee in an automatic drip coffee maker, especially a cheap one, leaving a little bit of water in the carafe (about an ounce ir so) will significantly improve the flavor. \n\nIt prevents the first bit of brewed coffee from becoming scorched from the hot plate and flavoring the entire pot.",
   "created_utc": 1703161388,
   "score": 219,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebeb3a",
   "message": "If ordering something online, since places can fake a good review, only read the negative reviews, a bunch of complaining about shipping/damaged items/trivial shit is good, where as multiple broke in the first week/won't charge/leaks means the product is shit.",
   "created_utc": 1703162657,
   "score": 51,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb6402",
   "message": "From working technical support for longer than I dare think about, most angry customers just want to be heard.  Let them have their rant, do active listening, and make notes about what they're saying.  They will eventually run out of steam.  Then, read back everything they talked about and go through it step by step.  Works almost every time, and often they are very thankful by the end of the call.",
   "created_utc": 1703157512,
   "score": 202,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb74n2",
   "message": "Store cans of baked beans upside down so you don't have to scrape them out the bottom when you open the can.",
   "created_utc": 1703158214,
   "score": 139,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb6n28",
   "message": "Library cards are worth their weight in gold.\n\nMy physical library comes with (mostly for free)\n\n* Tool rentals\n* laptop rentals\n* studio rental space (video cameras, audio equipment)\n* 3D printer usage in library\n* woodshop\n* sewing kits\n* free classes\n* This with the usual book rentals\n\nDigitally/web-wise, my library card comes with\n\n* Digital movie checkout\n* Hoopla\n* Libby\n* kanopy\n* Free subscription to skillshare \n* Free subscription to linkedin learning (lynda if you're old)\n* free ebook app\n* free online courses (very limited though)\n* Udemy\n* Language learning apps\n* Virtual Workshops\n\nAlong with other community events for people of all ages. Everyone should get a library card.  \n*Edit to add other prominent features mentioned*",
   "created_utc": 1703157875,
   "score": 91,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keazhbi",
   "message": "If you have an itchy mosquito bite, hear up a spoon under semi-hot water (like 45-50°C), dry it off and tap or press it on the bite. Just as short as you can tolerate it but also as long as possible.\n\nThe heat dissolves the protein that makes the mosquito bite itch.",
   "created_utc": 1703152495,
   "score": 196,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebbmjr",
   "message": "My grandmother always said that if you feel terrible, get out of bed, take a shower, do your hair and put on clothes, down to your shoes, and have a good meal.  Either this will fix it or you're dressed and fed and in a better place to deal with the problem. \n\nShe was right.",
   "created_utc": 1703161113,
   "score": 43,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebea7k",
   "message": "Hack 1: When you paint a room and remove the light switch plate, on the inside of the plate write down the color of the paint you used and the brand. Great for when you need to repaint a spot a couple of years later.\n\nHack 2: After you wash and dry a set of sheets, put the top sheet, bottom sheet and pillow case all inside of one of the pillow cases. Then you have the whole set together in one neat little package and don't have to look for matching sheets and pillow cases.",
   "created_utc": 1703162643,
   "score": 186,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keazcn7",
   "message": "If you're putting together furniture, leave all the screws a little loose.\n\nFinish the whole thing.\n\nPlace it where its going to be.\n\nWiggle it so it settles into place.\n\nTHEN tighten all the bolts.   No wobble!",
   "created_utc": 1703152391,
   "score": 226,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keawycl",
   "message": "If you want a comfortable pair of high heels, invest in a pair of dance heels. \n\nLots of beautiful designs and colors, designed to be flexible and comfortable. Worth every penny. \n\nJust make sure they’re not felt-soled if you plan on wearing them outdoors. A good quality pair from a company like Repetto are worth getting rubber-soled if they aren’t already. \n\nYour feet will thank you.\n\nETA: So glad some of you found this helpful. My mother has permanent foot deformation from wearing heels daily since 1977 and my discovery of wearing dance heels was born out of my desire to look elegant but avoid pain and disfigurement!",
   "created_utc": 1703150475,
   "score": 133,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb1ckl",
   "message": "I am extremely organized except where my keys were concerned. I lost them several times a week. Then I saw the comedian Jon Richardson saying that people with keys are \"putters\" or \"leavers\" I was a leaver, leaving my keys lying around so i decided to be a putter. As soon as I get in i PUT my keys straight into my bag. It seems so stupid but it totally works and has saved me a lot of stress!",
   "created_utc": 1703153976,
   "score": 38,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb76db",
   "message": "Future you  -  always do things throughout the day that will benefit future you.",
   "created_utc": 1703158246,
   "score": 92,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keaw232",
   "message": "Take the advice you find on the internet with a grain of salt.",
   "created_utc": 1703149768,
   "score": 156,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb27d8",
   "message": "Going to bed at a consistent time to get enough sleep (really prioritising it).\n\nIt literally makes life so much better and easier. Health improvements in every aspect. Both mental and physical. \n\nPeople live their lives chronically underslept and it causes all types of chaos in their lives.\n\nThey think it's freedom to stay up late or go to bed whenever they want (usually covering up a cycle of revenge bedtime procrastination), but they are unbeknownst to themselves in an underslept zombie prison of their own making.\n\nI got no sleep last night btw. Feel like crap!",
   "created_utc": 1703154628,
   "score": 87,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keagpz8",
   "message": "Percentages are reversible. Working out 4% of 50 will give you the same result as 50% of 4",
   "created_utc": 1703138781,
   "score": 178,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb6vri",
   "message": "The act of showing up, again and again and again.\n\nWe all want to do new stuff, or get better at things, or master something etc.\n\nSo we start, we try some, and then we quit because its not easy or the results are not showing up fast enough.\n\nMy take - if its something you really want — you just need to show up to it, whatever it is, again and again and again.\n\nYou WILL get better at it, and at some point, things will get easier and the returns will start to compound.\n\nShow up and do your best, agana dnagana and again, and if you flop around, fail at it for a time — good - that’s part of the process, the bump in the road you have to work aorund to get to where you want.   It’s life, forging you, molding you, into that you that you want to be.",
   "created_utc": 1703158043,
   "score": 71,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb3f50",
   "message": "If you work at a PC all day, turn the night light on constantly (I have it set to turn on at 4am and off at 3am. \n\nMakes a huge difference in eye strain. After you get used to it other screens feel like looking at the sun.\n\nI set up one of my colleagues PCs the same and a week later she told me she had stopped getting headaches every day at 1pm, which she had even been going to the opticians for.",
   "created_utc": 1703155539,
   "score": 208,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keazfyc",
   "message": "Never gossip no matter how much you dislike a person. It can be really helpful in particular at work when that person you dislike and you consider to be dumber to actually save your ass in certain situation rather than have him/her as your rival.\n\nI keep receiving gossips from various colleagues about others and always pretend to never know anything while I know lots of details and I agree with many of these sometimes.\n\nThis is really helpful in your career being neutral and have people not being against you.",
   "created_utc": 1703152465,
   "score": 129,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb6p9y",
   "message": "Spend an hour finding something in your house?  When you are done with it put it in the first place you looked.",
   "created_utc": 1703157917,
   "score": 235,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb5gvr",
   "message": "Buy a bunch of the same style and color socks and you never have to match socks again. I have a drawer with just socks, and every time I reach in and grab two...I have a pair of matching socks. Game changer.",
   "created_utc": 1703157044,
   "score": 205,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keahg52",
   "message": "Casseroles provide far more servings with far less cost and effort of many other dishes.",
   "created_utc": 1703139222,
   "score": 65,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keawc97",
   "message": "Sick of losing socks in the laundry? Wash them in one of those mesh garment bags. I never lose them and it’s so much easier to put them away when you’re only sorting through them out of the bag than across the whole pile of shirts and whatever else out of the dryer.",
   "created_utc": 1703149992,
   "score": 11,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keat20m",
   "message": "Put skewers through asparagus like a ladder when grilling, makes it easy to cook and flip evenly.",
   "created_utc": 1703147406,
   "score": 129,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb4m95",
   "message": "Hang dry your shirts inside out to avoid the little shoulder horns.",
   "created_utc": 1703156424,
   "score": 18,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keaudje",
   "message": "When driving for long periods. Turn off recirculating air. One of the reasons you get tired in the car is not from lack of sleep but from too much co2 in the car. You ever been so tired driving home and when you get home you’re no longer tired. It’s because of lack of oxygen in the car. Especially if you have passengers in the car.",
   "created_utc": 1703148438,
   "score": 138,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb9ynp",
   "message": "Windows key + V brings a clipboard of everything you’ve already copied. Far superior to Ctrl + V",
   "created_utc": 1703160090,
   "score": 40,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb2p46",
   "message": "To remove a burr from animal fur or hair, rub in cornstarch and it will slide out.",
   "created_utc": 1703154999,
   "score": 92,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebd9xz",
   "message": "Do you have children that have yet to lose their teeth? 1) decide what the tooth fairy will leave under their pillow (half dollar, $2 bill, etc.) 2) go to the bank and get at least 20. Your kiddos teeth will fall out at the most random/inconvenient times 😬…doing this will have you prepared.",
   "created_utc": 1703162074,
   "score": 15,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keauxa0",
   "message": "The 5 minute rule - If you have something that needs doing, and it can be accomplished in 5 minutes, or less, then why not do it immediately?",
   "created_utc": 1703148867,
   "score": 216,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebeo78",
   "message": "To the extent that its reasonable, buy items that will last forever.  Buy once, cry once.",
   "created_utc": 1703162859,
   "score": 188,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebcb5b",
   "message": "When running into and talking with someone, move away from the door and or middle of the aisle",
   "created_utc": 1703161513,
   "score": 83,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb7pwd",
   "message": "I’m going to give two tips. \n\n1- “no.” Is a full sentence and the only needed response to many requests or questions. Stop feeling the need explain yourself. Occasionally I reply with no thank you, and end the conversation. Also effective. \n\n2- I love a clean and tidy house but can be a procrastinator. When it’s time to get things done writhe house, I set my timer for one hour and clean the whole time. You’d be surprised how much you will get done in one single hour!",
   "created_utc": 1703158621,
   "score": 49,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keatksm",
   "message": "When you finish a bath or shower, before toweling off, rub your hands over your body like a windshield wiper in a car to get off excess water. You brush off a ton of water, meaning there's a lot less to towel off after and less dripping into the floor. Takes only a few seconds and keeps your bathroom from getting soaked while you dry yourself with a towel.",
   "created_utc": 1703147814,
   "score": 11,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebm7nu",
   "message": "Completely cut out 24 hour hyper partisan propaganda news and your stress and anxiety levels immediately like halve, turns out it’s all horseshit designed to make you angry and unhappy",
   "created_utc": 1703166627,
   "score": 23,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb7i4r",
   "message": "Journaling your work is the simplest of the methods to measure progress, It allows you to have the clarity to understand what happened when on a dispute with someone on this progress.",
   "created_utc": 1703158476,
   "score": 160,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebbpgg",
   "message": "PROOFREAD",
   "created_utc": 1703161162,
   "score": 142,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb8kjr",
   "message": "Using the “Read Aloud” function in Word / Google Docs to proofread when you don’t have anyone to help. It will mispronounce any errors with spelling or punctuation making them easier to catch with tired eyes.",
   "created_utc": 1703159193,
   "score": 149,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keaw1l7",
   "message": "Stainless steel can remove the smell of garlic from your hands. When you rub your hands on stainless steel, the sulfur compounds in garlic bind to the steel's surface, transferring the smell to the metal.",
   "created_utc": 1703149758,
   "score": 12,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb7xer",
   "message": "If your bed is tucked into a corner or against a wall, but there is still like a 2 inch gap where your remote, glasses, game controller, etc can fall down between the bed and the wall, buy a pool noddle and shove it down into that gap. It'll stop anything that tries to slide down into that PITA gap there.\n\nYou can also cut one to size and shove it between your driver's seat and the center console to stop your phone or keys from falling into That PITA gap.",
   "created_utc": 1703158762,
   "score": 48,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keauzrp",
   "message": "If you have a glass walled shower and a shower head on a hose, take a few seconds after you finish washing yourself to hose down the walls.\n\nIt stops the scum build up and means you only need to attack the shower manually maybe once every six months.\n\nSparkly clean glass for everyone!",
   "created_utc": 1703148921,
   "score": 94,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keaulvk",
   "message": "When walking head on towards somebody, to avoid the are we going to crash into each other dance, don't look at them to see where they are going,  fix your eyes over one of their shoulders and don't waiver - they will then move in the other direction.",
   "created_utc": 1703148620,
   "score": 199,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebabg5",
   "message": "That voice telling you bad stuff about yourself is not helpful. Someone put that voice there, and you can decide to disregard it and replace it with useful stuff.",
   "created_utc": 1703160313,
   "score": 40,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb6zqm",
   "message": "Flossing fixes bad breath.\n\nThe bacteria that cause bad breath live at the back of the tongue AND below the gumline. And they feed off protein.",
   "created_utc": 1703158119,
   "score": 160,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb0j67",
   "message": "Most dough can be rolled out between two pieces of baking paper . saves getting flour all over everything except most recipes will tell me to dust my counter with flour .",
   "created_utc": 1703153336,
   "score": 205,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keavs6x",
   "message": "If you have a hard time reading on a computer screen (either physically, or if you just don’t enjoy what you’re reading/have a hard time with that format), you can download an extension to your web browser that reads everything out loud to you. This is the only way I can digest long work emails or web articles. Saves me so much rereading! And giving your boss a cool accent makes their annoying requests more bearable!!",
   "created_utc": 1703149552,
   "score": 47,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebc83q",
   "message": "We're all sharing the road, it's fine to wait your turn. Here's my blinker so I don't suddenly turn without warning",
   "created_utc": 1703161463,
   "score": 119,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keatour",
   "message": "Buy a 4 inch box fan for your kitchen. Speeds cooling three fold, and if blowing across your cutting board prevents eye pain while chopping onions.",
   "created_utc": 1703147899,
   "score": 38,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keborw1",
   "message": "For more flavorful tasting ramen, put the seasoning packet in the water and mix it up BEFORE you add the noodles, not after you've added the noodles and they've softened.\n\nThe noodles soak up the water to become soft, so the difference is noodles that soaked up unflavored water vs noodles that soak up flavored water.\n\nThis makes each bite a burst of flavor!",
   "created_utc": 1703167782,
   "score": 209,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb3162",
   "message": "If you spin a waterbottle while pouring water out the water drains quicker (because making a vortex means the air isn't stopping the water from exiting thus making it go a bit quicker). Depending on how often you empty water bottles and how big they are you can save SECONDS of your life on this mundane task(!).",
   "created_utc": 1703155248,
   "score": 57,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keaxmgm",
   "message": "After making ramen that is presumably boiling hot, add frozen peas to cool it down and increase your veg count for the day.\n\nThis is also the perfect way to cook frozen peas (quickly so as to not leech out all the sugars).\n\nOther frozen veg can be added as well/instead of but some of them actually need cooking for a number of minutes which just won't be done in the bowl of ramen.",
   "created_utc": 1703151008,
   "score": 17,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebcn0j",
   "message": "Squeeze the water out of your hair before using conditioner. You’ll need a lot less!",
   "created_utc": 1703161707,
   "score": 71,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb3sxb",
   "message": "Buy ground beef in bulk, cook it and then freeze it in ziploc bags in 1 pound measurements.  Also super useful with chicken.  \n\nMakes super quick work of weeknight meal prep.",
   "created_utc": 1703155824,
   "score": 197,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kean8r1",
   "message": "There's a Youtube video showing how to do that thing you don't know how to do.",
   "created_utc": 1703143045,
   "score": 19,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebgx7k",
   "message": "I used to travel a ton. My two travel hacks are; bring a fresh pair of socks in your carry on and bring an orange.\n\nThe fresh socks; after a long day of meetings or tourism when you get on a plane your socks will be ripe. Yet nothing feels better than fresh socks and taking your shoes off. I take them off at my seat and quickly stuff the offending socks on a plastic baggie from headphones or something similar and put them deep in my bag.\n\nAlso, I have sat next to stinky people too many times to count. Bad breath AND BO. If you crack open an orange, it will deodorize or block their scent. Even the people nearby will thank you.\n\nOne additional hack; if you have a bad sore throat, chew on an uncoated aspirin. For a minute, it tastes awful. But the chewed aspirin will sit on the back of your throat and relieve the pain incredibly well for an hour or more.",
   "created_utc": 1703164050,
   "score": 187,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebikb6",
   "message": "Right before your babies bath, put a small heating pad on low heat under their blanket in the crib. When you go to change them, turn it off but make sure none of the heat gets out. Then  when it’s time to put them down, they won’t cry being put in a cold crib. Most people don’t realize that they are crying because of the temperature change. Yea, yea don’t come at me…ya gotta do it safe but all you new parents out there, you just got a game changer right there. Learned it from a nurse and I’m a nurse. Good stuff.",
   "created_utc": 1703164887,
   "score": 101,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keaynbs",
   "message": "To cut your whitening strips in half (the long way) U really dont need to whiten the back and folding them over your teeth usually makes them sensitive. You get double the strips for the same price",
   "created_utc": 1703151833,
   "score": 230,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keb4di9",
   "message": "Choose a film based on the director, not the actors in it. It's not foolproof but you're much more likely to enjoy it if you've liked their previous work.",
   "created_utc": 1703156246,
   "score": 139,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebd884",
   "message": "If you ever get painful blisters inside your mouth, put some aspirin on it. Run an aspirin tablet under water until its sorta mushy and put it right on the sore. Leave it there 5 minutes minimum. Applying the aspirin does not hurt at all and it provides relief for 4-6 hours. Best of all, the blister will heal faster.",
   "created_utc": 1703162045,
   "score": 179,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keah8ao",
   "message": "You can easily untie knots in plastic takeout bags by twisting the ends and pushing them through the knot.",
   "created_utc": 1703139088,
   "score": 18,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebfrer",
   "message": "Admitting you don’t know something can be the first step to learning something new and thus improving yourself.",
   "created_utc": 1703163439,
   "score": 49,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "kebhz74",
   "message": "Write the breaker number on the inside of the outlet/switch cover.\n\nIf you have to do any electrical work, this will give you a very good 1st guess as to which breaker to flip.",
   "created_utc": 1703164592,
   "score": 50,
   "submission_id": "18ng177"
  },
  {
   "comment_id": "keawrw9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ng177"
  }
 ]
}