{
 "submission_id": "18nlrab",
 "title": "What was your favorite Christmas gift as a kid, and do you still have it?",
 "selftext": "",
 "created_utc": 1703161151,
 "permalink": "/r/AskReddit/comments/18nlrab/what_was_your_favorite_christmas_gift_as_a_kid/",
 "score": 10,
 "url": "https://www.reddit.com/r/AskReddit/comments/18nlrab/what_was_your_favorite_christmas_gift_as_a_kid/",
 "comments": [
  {
   "comment_id": "kebeihb",
   "message": "We were EXTREMELY poor growing up in Korea (late 70s). I remember getting milk and cereal for one Christmas. It was such an amazing treat. It's one of my fondest memories\n\n...\n\nMy son was upset that he got a used car last Christmas",
   "created_utc": 1703162772,
   "score": 6,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebc43f",
   "message": "Tickle me Elmo and no I don’t still have it.",
   "created_utc": 1703161398,
   "score": 3,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebce7h",
   "message": "My n64. One of my fondest memories. In my opinion it is one of the greatest consoles of all time, it just blew my mind when it came out. And yes I still have it.  On days when I’m bored/ feeling down I’ll fire up smash bros or Mario 64 and just nerd out in nostalgia",
   "created_utc": 1703161563,
   "score": 3,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebdvi6",
   "message": "It was a polaroid camera, now they became popular again and I still have it hehe.",
   "created_utc": 1703162414,
   "score": 3,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebepha",
   "message": "Lego Power Miners Claw Digger set. In my country, original Lego was worth a lot of money, and when I received this set for Christmas, I was delighted. I played with it for six months, rebuilt it many times... unfortunately, then I brought it to school to show off to my friends and it was stolen. It’s still a shame because I know who did it, but I can’t prove it.",
   "created_utc": 1703162878,
   "score": 2,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebczva",
   "message": "A bratz mp3 player. And yesss",
   "created_utc": 1703161912,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebg9zk",
   "message": "God damn headphones, mfs 10 years livin. Sony",
   "created_utc": 1703163712,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebh6r4",
   "message": "A Logitech K120 keyboard. That thing has seen me through essays, university applications and everything in between.\n\nOriginally, I wanted the mechanical gaming keyboard that my brother was given that year, but I have grown to hate obnoxiously loud, clicky switches.",
   "created_utc": 1703164187,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebikgj",
   "message": "My first computer, a ZX Spectrum +2B, and now I'm an IT professional so thanks Mum and Dad!  I'm actually not sure if it still exists because I live in another country now.  Recently my Dad said he \"threw out some old computer parts\", I said well was it the computer sitting in my wardrobe and he said no, he didn't think so, it was stuff in the garden shed (which was all junk anyway).  Apparently my childhood bedroom is full of boxes now and other miscellany, the wardrobe is there but I'm not asking my 76 year old Dad to go clambering through it all to check.\n\nSo, when I visit early next year I plan to help him sort all that stuff out *and* I'll see if it's still there and plan to bring it home and restore it since I'm sure the datacorder belts have turned to mush by now, and it'll need new capacitors.  Hopefully it is, if not *c'est la vie*.",
   "created_utc": 1703164889,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebrlcy",
   "message": "My own Xbox 360 \u0026amp; yes!! \n\nMy family had a halo 3 edition Xbox 360 but we had to share it in the living room. ( I actually still have that one in my closet now too.) \n\nI remember being 13 and the joy I had to have my own that I didn’t have to share. Plus my brother and I were able to play together without sharing a screen.",
   "created_utc": 1703169008,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebtcxq",
   "message": "Lego 5580 - got it when I was 8. Yeah, I still have it and recently rebuilt it.",
   "created_utc": 1703169759,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kebv2zq",
   "message": "A bycicle. No I don't as I overgrew it",
   "created_utc": 1703170469,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kec4681",
   "message": "A baby doll I wanted very badly.  Yes I still have it!  It's stored safely \u0026amp; is over 60 years old.",
   "created_utc": 1703174026,
   "score": 1,
   "submission_id": "18nlrab"
  },
  {
   "comment_id": "kec68od",
   "message": "Because I was an incredibly boring child, one of my gifts was a combination safe. I still use it for cash and prophylactics.",
   "created_utc": 1703174801,
   "score": 1,
   "submission_id": "18nlrab"
  }
 ]
}