{
 "submission_id": "18nmfpn",
 "title": "What's the most unexpectedly funny thing that's ever happened to you during a family gathering?",
 "selftext": "",
 "created_utc": 1703163418,
 "permalink": "/r/AskReddit/comments/18nmfpn/whats_the_most_unexpectedly_funny_thing_thats/",
 "score": 211,
 "url": "https://www.reddit.com/r/AskReddit/comments/18nmfpn/whats_the_most_unexpectedly_funny_thing_thats/",
 "comments": [
  {
   "comment_id": "kebvl53",
   "message": "Christmas 1993 - the week leading up to it, my parents kept finding wrappers from the Little Debbies we kept in a basket to grab and put in lunches and like 5-6 at a time were gone. They asked my teenage brother if he was eating them all and he said no, so they looked to me, the 5 year old and I kept insisting it wasn’t me. Well they just assumed it was me and I got a spanking for “lying”. \nFast forward to Christmas Eve, whole family is in town sitting in the living room on our couches and suddenly an opossum sprints between the two couches causing absolute chaos. After a movie worthy parade of adults with brooms, screaming children and 3 barking dogs, we managed to chase it back outside through the side door it snuck in (where my dad was getting firewood earlier that week - that’s how we think it got in). We then moved the couches to reveal dozens of Little Debbie wrappers and smashed cakes. I just remember bursting into tears and saying “I told you I wasn’t lying” and that is how I got a new puppy for Christmas - RIP Taylor, had her until college - best dog ever. My dad still feels bad when I bring it up LOL",
   "created_utc": 1703170677,
   "score": 148,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebvpl6",
   "message": "My cousin walked in on our grandparents having sex and when he went to tell his parents he walked in on them having sex.",
   "created_utc": 1703170727,
   "score": 45,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebufp2",
   "message": "My dad was trying to get whip cream for his ice cream, we had one of those actual steel whip cream dispensers you can put your own in or whatever. Something malfunctioned on it because while we were all sitting out in the living room we heard a loud “SHHHHHHH” and my dad yell “motherfucker!” And when we all ran in we found the entire kitchen absolutely destroyed with whip cream even on the ceiling. He was so pissed but we couldn’t stop laughing it was so fucking funny",
   "created_utc": 1703170206,
   "score": 117,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebnppk",
   "message": "When I was a child, our neighbor was known to be quite the recreational fisher with coveted secret spots. During a family BBQ I announced to everyone that she was going to show me her \"bass hole\". 45 years later this is what people remember about me.",
   "created_utc": 1703167307,
   "score": 21,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kece2km",
   "message": "We were visiting an elderly relative because she didn't get out much; after all, she was 95. We came in and her son tried to let us down gently, that she probably wasn't up for much visiting (though this was a planned visit?).\n\nVery next thing, we heard this woman holler at the top of her lungs, \"I AIN'T DEAD YET!\" as she proceeds to RUN out of the back room to greet us.\n\nWas absolutely wild to watch this 95 year old, 95lb woman practically run over my dad with her walker.",
   "created_utc": 1703177695,
   "score": 13,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebtmd8",
   "message": "My brother brought a friend to Christmas dinner. When my Father asked what he does for a living, he said, “I hunt Bigfoot”\n\nHe was serious. Many funny questions followed.",
   "created_utc": 1703169869,
   "score": 213,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebkmvr",
   "message": "A ridiculous debate on whether taper candles should be lit briefly before a formal dinner so they aren’t “brand new and Bourgeois” as everyone sat for the meal. As everyone sounded off with serious opinions that grew in intensity, a family member who found the entire conversation growing contentious slapped the tabled and declared, “The Queen is not coming!” And squelched the debate!  It has become a catch phrase to quickly shut down a conversation, since.",
   "created_utc": 1703165886,
   "score": 163,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecd531",
   "message": "My grandmother had a jar full of m\u0026amp;ms one Christmas. She told the family to write down their guesses as to how many m\u0026amp;ms were in the jar. Closest guess wins a prize. Everyone gets their guesses in only to find out my grandmother had no idea how many m\u0026amp;ms were in the jar. We laugh about it 25 years later.",
   "created_utc": 1703177359,
   "score": 166,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebn83t",
   "message": "Hosting brunch, was running the dishwasher post meal prep, started quite literally shooting flames out. So that was exciting",
   "created_utc": 1703167085,
   "score": 149,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecsb92",
   "message": "My grandmother told us a story over thanksgiving dinner …\n\nI will relay it here from her perspective ;\n\nWhen I was first married to grandpa and pregnant with your mother we bought a new house. There was a neighbor lady who introduced herself and would come by for tea and help me do laundry and housework . This went on for a bout four months then one day over tea this woman tells me she is in love with grandpa . She tells me how handsome and charming he is and how she has developed a deep affection for him. To prove this she pulls a tuft of hair with a red ribbon tied around it. She proceeds to tell me that she has been collecting grandpas pubic hairs from the laundry and carrying them around in her wallet..\n\nNeedless to say we were all aghast …",
   "created_utc": 1703182859,
   "score": 144,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebfsa3",
   "message": "My grandma tried virtual reality for the first time and started dancing with the virtual dancers. She was so into it, she didn't realize we were all watching and joining in!",
   "created_utc": 1703163452,
   "score": 18,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebgjbr",
   "message": "The cat jumped on the table and stole the turkey right off the plate. It was like a scene from a cartoon",
   "created_utc": 1703163848,
   "score": 122,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebg4v9",
   "message": "My uncle, who's terrible at tech, somehow managed to change the language settings on his phone to Chinese. Watching him try to navigate it had everyone in stitches",
   "created_utc": 1703163637,
   "score": 229,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecfekz",
   "message": "I was bending over to get a bowl out of the pantry, when the belt loop to my pants caught the spout to the water container on the counter, then proceeded to dump water into the back of my pants.",
   "created_utc": 1703178179,
   "score": 114,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kechjjj",
   "message": "During Thanksgiving dinner one year, my 3 year old nephew taped bandaids over his eyes and then locked himself in the bathroom. Then he flipped out. When we finally got the door open, we couldn’t stop laughing.",
   "created_utc": 1703178955,
   "score": 100,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebrxxu",
   "message": "My grandmothers pants falling down to her ankles while she was carrying the turkey to the table for Christmas dinner. It was 40 years ago and I will never forget how hard everyone laughed.",
   "created_utc": 1703169160,
   "score": 187,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebp7l4",
   "message": "Neighbor's giant hog got loose and went for a stroll down the road. He was chasing her down with a stick and she was holding up traffic. It was a fun show on a Thanksgiving day.",
   "created_utc": 1703167977,
   "score": 93,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecu5xm",
   "message": "I was lounging on the living room couch when my grandmother shouted a question from the garage, I yelled back my answer and continued playing scrolling on my phone. I swear to god she teleported because a split second later I hear from right behind me “Hey Starlight I \nw-“ Spooked outta my gotdamn mind I screamed. She screamed. We stared at eachother for a total of 5 seconds before we both doubled over laughing. Still one of my favorite memories with her.",
   "created_utc": 1703183530,
   "score": 73,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked386y",
   "message": "My grandmother lived in a 1920 craftsman house with a gravity furnace in the basement.  A gravity furnace is a throwback.  It is a large furnace with giant ducts that go to every room in the house.  It operates on the principal that hot air rises, and in this case it rises through the ducts and up through large grates into each room.  They were horribly inefficient but bullet-proof and operated soundlessly.  \n\nSo, Christmas dinner at Grandma’s house.  There were about a dozen family members around the table.  During one of those conversational lulls that sometimes occurs, my uncle dropped one of those giant black olives.  Each step of the way you could hear it as it bounced off his plate, rolled across the table, dropped onto the floor, rolled across the floor and directly into a furnace grate, and then down that metal duct all the way into the furnace.  \n\nYou probably had to be there, but in the moment it was the most hilarious thing on earth.",
   "created_utc": 1703186855,
   "score": 75,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebtgs3",
   "message": "Not funny, but it was totally unexpected and it happened during a family gathering. I don't remember it because I was only about a year old, but basically, I killed my grandfather.\n\nHe had narcolepsy. This was in the 70s and I'm not sure how well he was medicated for it but he would fall asleep all the time just randomly.  I'm told he would be talking one second and sound asleep sitting in a chair the next.\n\nAnyway, at this particular event he apparently was bouncing me on his knee as you do, and suddenly dropped me (I was fine) and passed out.\n\nEveryone thought it was kinda funny because Grandpa fell asleep holding the baby, except Grandpa did not fall asleep. Grandpa had a massive heart attack while bouncing my fat baby ass on his knee.  I got dropped when he died, I guess.",
   "created_utc": 1703169804,
   "score": 182,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebkc7u",
   "message": "Got drunk in front of my great grandmother and started to shit talk my entire family in a baby voice to my baby niece; while the entire family thought I was out of line my great grandmother thought it was hilarious and that I had valid points",
   "created_utc": 1703165745,
   "score": 232,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keddvyg",
   "message": "This was at a Thanksgiving party when I was around 8 or 9. I was down in the basement playing Taboo with about 10 other people, including an aunt that had already had quite a bit to drink.  \nMy word is peacock, so I think about some phrases I've heard with peacock in them before and give my clue: \"She thinks she's all that, strutting around town like a _____\"  \nAnd my aunt yells at the top of her lungs, \"WHORE!\"",
   "created_utc": 1703190802,
   "score": 63,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kec373j",
   "message": "All of the lil kids got dollar store dart guns from a family member dressed as Santa. My cousin, after a few drinks, shot a dart at my grandma's head from across the kitchen. Later, out of nowhere, while they were standing next to each other... She hits him square in the nuts.\n\nI haven't been to a family Christmas in years. I imagine they haven't changed much.",
   "created_utc": 1703173661,
   "score": 169,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kec78pe",
   "message": "Cousin’s tube top decided to give up the ghost when she was reaching for something.",
   "created_utc": 1703175179,
   "score": 58,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecu75w",
   "message": "Extended family get together for Christmas with all my aunts, uncles, cousins, grandmother, etc. My younger cousins are all close in age to my youngest brother and they were playing hide and seek around the house while the adults were chilling and talking. One of my cousins decided to hide in the guest bathroom shower. My uncle (not his dad) needed to use the bathroom and didn’t think to check behind the closed shower curtain. He proceeds to take care of business. As he’s sitting there, he hears a snicker behind the curtain. All we hear from the living room is “WHAT ARE YOU DOING IN HERE?” “I’M SORRY!” “DON’T JUST STAND THERE, GET OUT!” Then a very bright red faced cousin comes running out of the bathroom and disappears upstairs. My uncle eventually comes out and couldn’t stop laughing. We bring it up all the time and it always gets a good laugh, even from my cousin.",
   "created_utc": 1703183543,
   "score": 46,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedabit",
   "message": "This was at my maternal grandmother's funeral, at the cemetery waiting for everyone to show up prior to the actual burial. We were waiting on my uncle to show up because he had somehow gotten to the wrong cemetery, and it was cold and rainy. My dad went to huddle under another relative's umbrella, and ended up slipping on a slick granite gravestone and beefed it into the grass. The name on the gravestone? Klutz. Everyone got a good laugh out of it, I'm sure my grandma would have probably been laughing the hardest.",
   "created_utc": 1703189464,
   "score": 48,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecvcyb",
   "message": "Was at Thanksgiving and all 3 of my younger sisters had their boyfriends in tow.  My grandma asks me in front of all 30+ people why I didn't bring any girls around the last few years.  My oldest sister, who lived with me at the time said, \"Oh grandma you don't want to meet any of the girls Nissir sees\"  \nMy grandma asked, \"why is that?\"  \nSister \"well, they aren't very smart\"  \nGrandma \"that isn't very nice to say, why do you think that?\"  \nSister \"there are currently 7 tooth brushes in our bathroom, but only 3 people live there grandma\"  \nGrandma pauses for a second then calls me by all 3 names while blushing.  Everyone busts out laughing, I can't look anyone in the eye till after Christmas.",
   "created_utc": 1703183967,
   "score": 38,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked7rgd",
   "message": "My visiting-from-college sister’s kitten dragged off a big hunk of a Christmas ham and snarled at us when we tried to take it back, and my sister wailed “no, we’re raising him to be a vegetarian!”. There was a talk after about the nutritional requirements of cats and the little dude got on a normal cat diet after that. It also answered the mysterious mauling of bags of bagels in the pantry over the last few days: poor little thing thought bread was food. We bummed some wet and dry food from a neighbor since stores were closed for Christmas and took the ham prize away.",
   "created_utc": 1703188523,
   "score": 41,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebs34v",
   "message": "Thanksgiving 2015, my ultra conservative parents invited the old widowers church group over to celebrate. Dry, boring, creepy old dudes that love to reminisce about the \"Cal-poly\" days. Everyone is going around the table doing the \"I'm thankful for...\" bullshit and it's quiet and my mom sneezes and sharts right there at the dining table. I never wanted to sit on the Amish spindleback again. But even the tiny little 4'5\" Mr. McCormick laughed at that one.",
   "created_utc": 1703169222,
   "score": 72,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebh081",
   "message": "My niece was telling everyone mommy and daddy got into a wrestling match last night. Turns out they were just have really loud sex lol",
   "created_utc": 1703164093,
   "score": 92,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebjwwk",
   "message": "Thanksgiving 1985 we were all laying around watching TV and out of the corner of my eye I see my little brother slowly backing his ass up to my aunt who is a joker herself then proceeded to rip the nastiest fart ever right in her face at point blank range. I've never seen someone come up so fast a swinging...lol. funniest thing I've ever seen. RIP STEVO.",
   "created_utc": 1703165543,
   "score": 108,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kec3ajg",
   "message": "Christmas morning, we were opening gifts. My MIL is opening a gift from her husband, and freaks out. She mistook a new electric screwdriver for a dildo. She saw the general shape of it, and threw it across the room. We all knew what she thought it was.",
   "created_utc": 1703173697,
   "score": 55,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked00p8",
   "message": "My brother had a friend who had been yearning for an ascot.  On Christmas afternoon he came barreling into our house to tell my brother, \"I got my ascot for Christmas!\"  In the short silence after Martin's declaration, my grandma asked with a straight face, \"Did it hurt much?\"",
   "created_utc": 1703185682,
   "score": 28,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebfwj0",
   "message": "My cousin decided to demonstrate his 'magic skills' and accidentally turned the family dog blue. Turns out, it was just some safe color spray, but the dog looked like a smurf for a week!",
   "created_utc": 1703163515,
   "score": 62,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecxgpr",
   "message": "My cousins wedding, the girls who had bullied me in middle school were going to be there and I wasn't legally supposed to go because I was on probation and it was at an embassy. It was the English embassy and I still don't know ehat they thought I was going to do by going to the wedding. I seriously don't see the English hiding me out over probation for a marijuana charge but whatever.\n\nI was so nervous I was honestly shaking when I walked in. Plus, it was a cash bar so we had alcohol hidden in my mom's car. I knew it was going to be a problem before I got there. Problem was my parents gave us money for the cash bar, we had the hidden alcohol, and the gay bartender had a thing for my boyfriend so the cash bar became free for us. \n\nI don't remember much. I do know at some point we had all of the wedding party in the parking lot getting drunk. Both the bartender and the grooms mom was trying to sleep with my boyfriend. Also apparently I was dancing with the best man and the back of my dress came up over my underwear and my whole family saw it. \n\nI should point out that my cousin who was getting married isn't mad about any of it. She thinks it's hysterical. She actually understands why I got so drunk and that I tried to get out of going in the first place. Turns out she didn't want those girls there either. Her mom insisted on inviting them there. We went to the same school so she saw what went on and how I was treated.",
   "created_utc": 1703184742,
   "score": 21,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kee1xe8",
   "message": "OMG I tell this story every year!  So one Christmas I gifted my mom a ceramic duck, life sized, with 12 duck outfits for every month. Mom lovingly dressed this duck in it's little rain coats and summer bathing suits and whatever all year.   Mom placed the duck a few steps up on the staircase adjacent to the living room. \n\nSo now It's Christmas Eve a year later in you typical extended Italian family. Tables are up in the living room to host about 25 people. We all find our seats and settle in for the 7 course feast of fishes. \n\nAs we sat, waiting for the food, we all hear an EXPLOSION in the direction of the staircase. Every head turns to witness the duck, dressed in a Santa suit, rise into the air and launch itself onto the floor below, shattering into pieces.  The duck feet, however, remained planted on the stairs. \n\nIn the ensuing chaos we finally determined that after a year of wearing humiliating outfits the duck committed duckicide to get away from my mom. She was decidedly offended by this analysis. \n\nLater we found out that earlier that day ol' ducky fell and broke away from his duck feet so my brother used a 2 part epoxy to mend him. The gasses built up inside his hollow body causing him to rise like Jesus at Easter. \n\nWe never failed to remember duck at every Christmas from that date forward.",
   "created_utc": 1703199939,
   "score": 20,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebm71o",
   "message": "My godfather’s funeral… on the way to the burial site, a sway bar broke on the hearse.  We were on the interstate and pulled into the rest stop immediately.  There was no backup hearse available, so, the funeral got delayed a day.  While we waited for a tow truck, a local TV crew was pulling in, and we made the news that night.  The next day, he had his final rest… transported via the Suburban working van.",
   "created_utc": 1703166619,
   "score": 51,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebikf2",
   "message": "Two of my now ex-wife's sister's kids were arguing about something. One of them goes to the fridge to get something and the argument continues. At one point, the fridge raider says to the other \"don't make me take this hot dog after you.\"\n\n😁🤔",
   "created_utc": 1703164888,
   "score": 49,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedevvs",
   "message": "Quite a few! One year my sister was talking to my grandma on Christmas Eve, sitting at the table, (where my uncle put out cheap plastic patio chairs) and then my grandma’s chair broke and she just clunked to the floor. My cousin’s over the top GASP plus the fact that my grandma was there and then suddenly gone in a second, just absolutely killed my sister lol. Even my grandma was laughing. \n\nAnother year my uncle accidentally pressed Self clean on the oven and locked the dinner rolls inside. My mom actually took a pic once we were able to open the oven door and the rolls were totally black. \n\nOne Thanksgiving which was months after my grandma had passed away, my mom was putting away all the dishes which included my grandma’s good China. My cousin accidentally bumped into my mom and she dropped all the dishes. We all joked that if it was my aunt, grandma would’ve came back to haunt her, or she would’ve dropped dead right there. Lol 😂 \n\nAlso, does my aunt and uncle absolutely losing it during my grandpa’s funeral count? Something struck them funny and they were hunched over pretending to cry but actually suppressing laughter. My mom and great uncle weren’t too thrilled but my grandpa wouldn’t have wanted us to cry that day!",
   "created_utc": 1703191175,
   "score": 15,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedib1m",
   "message": "So, we had my aunt and uncle as guesr overnight and we have used the pull-out couch that sat proudly in the living room.\n\nThe next morning, we all run around doing prep and all. So much that no one sat down for even a minute. Guest and other familly members come in, we say hello, hug and all. And we sit down for talks and all.\n\nGramma sit down on the couch....that promptly close on her. Shee was stuck, with only her head, arms and feet being out.\n\nWe all laughed so much that it took a good while before we calmee down enough to free her from the man-eating couch.\n\nDon't worry about her. She was fine and was laughing even more than us.",
   "created_utc": 1703192436,
   "score": 15,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebg1l7",
   "message": "During dinner, my little nephew shouted, 'Look, I'm a fountain!' and started spitting water everywhere. It was a mess, but hilarious",
   "created_utc": 1703163589,
   "score": 42,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kee4x8e",
   "message": "My grandpa died after a long battle with emphysema when I was 17. He’d said for a long time that he was ready to go and was 92 so while it was sad, it wasn’t devastating. My Mom, 92 y.o. grandma and I went to the funeral home to pick out a casket and the guy showed us a $10,000, top-of-the-line model first. My mom looked at my toothless, elderly grandma and asked the guy to show us something more economical. He took us to the opposite end of the gallery and said “Now this is a really nice model. Shows well. I do have to let you know that it’s made of compressed cardboard…”\n\nMy Mom turned to my grandma and said “If I knew we could have buried him in a cardboard box, I would have just gone to the liquor store.”\n\nMy teetotaling, usually humorless grandma cackled and the funeral home guy was mortified. It was awesome.",
   "created_utc": 1703201186,
   "score": 13,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedakdp",
   "message": "Conservation between my mom and her aunt:\n\nAunt: “So how’s Robbie? How’s her mom handing the pregnancy announcement?”\n\nMom: “she had a stroke”\n\nAunt: “oh so she didn’t take the news well?”\n\nMom: “no, she actually had a stroke”",
   "created_utc": 1703189557,
   "score": 13,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebrz3d",
   "message": "Accidentally exposing myself to everyone at my grandmothers 82nd birthday party.   \nI standing next to a swing making a small speech. My shorts got hung on the swing and when I walked my shorts went all the way down to my knees. It was embarrassing to say the least.",
   "created_utc": 1703169173,
   "score": 26,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecolyc",
   "message": "In the early 90s, I asked for a Stretch Armstrong for Christmas. I received some sort of purple knockoff Stretch Armstrong (maybe a lizard or a bug or something?), and my family explained to me that it needed to be \"broken in\" to stretch easily (I believe this was on the instructions). So, my dad, UPS Teamster, grabbed it to give it some preliminary yanks so I could enjoy it.\n\nHe dislocated one of the arms from the shoulder socket and, well, it was hilarious and the end of that toy.",
   "created_utc": 1703181505,
   "score": 24,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecx1qd",
   "message": "Family thought it was funny, i was mortified. My now husband and i had been dating for less than a year, and at his grandparents Christmas they open presents youngest to oldest. He was half paying attention when grandma asked “who has the youngest?” And he said “we do!” Like it was a damn pregnancy announcement. Everyone started congratulating us and he just sat there laughing. We didn’t even have kids for another two years 😂",
   "created_utc": 1703184590,
   "score": 24,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked1hrx",
   "message": "My grandmother gave my great aunt (her sister) a back massage pad that goes over the back of the chair and proceeded to announce to the family that “now we don’t have to share vibrators any more!” \nEveryone froze for about 10 seconds then slowly began making our way outside, to the kitchen, whatever, so we could howl with laughter. \nLater my grandmother asked my mom what we all were giggling about and mom explained what a vibrator ACTUALLY is (grandparents were VERY sheltered) and the only response we got was “yall are a bunch of immature children!”  Maybe so but it was hysterical! It’s been over 20 years and we still laugh about it.",
   "created_utc": 1703186218,
   "score": 23,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebma9e",
   "message": "I changed my top in a closet where I didn’t know my nephew was hiding during hide and seek. 🫣",
   "created_utc": 1703166659,
   "score": 32,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked7bo4",
   "message": "We were cleaning my colourful rocks in my fish bowl growing up and at Christmas my grandpa thought it was candy and broke 4 teeth out on them. Not so funny at the time but we laugh about it now",
   "created_utc": 1703188363,
   "score": 11,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keda5qv",
   "message": "My bad tempered, miserable uncle dropped a Yorkshire pudding in a jug of squash and stormed out of the room in a massive huff. Refused to come back to the table and when he finally did he ate his food in stony silence.",
   "created_utc": 1703189404,
   "score": 10,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedla7f",
   "message": "I once had an edible and forgot there was a family Zoom call that day, so I put on sunglasses, and thought I was keeping my composure relatively well (I wasn't), until my younger sister who lives on a farm had a rather talkative chicken enter the frame and nobody was addressing this hilarious event when the humdrum complaints about HOA's was being constantly interrupted by BAWK BAWK!\n\nI was laughing my butt off and at least four other family members had to mute themselves because the situation was getting funnier by the minute.",
   "created_utc": 1703193548,
   "score": 11,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebki3o",
   "message": "Not me but my dad(as a kid) took a shit in the Fireplace and went around bragging about it. My grandma still brings it up to this day",
   "created_utc": 1703165822,
   "score": 27,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecmofe",
   "message": "Had a whole Thanksgiving dinner conversation around the origin of the word \"fuck\". It was highly amusing and educational. I miss that side of the fam.",
   "created_utc": 1703180811,
   "score": 19,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked47e6",
   "message": "At thanksgiving this year right after dinner My brother passed out and had a seizure in front of the whole family.  It was his wife’s green bean casserole with a ridiculous amount of salt in it that pushed his blood pressure over to a dangerous level.",
   "created_utc": 1703187214,
   "score": 20,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecigf0",
   "message": "Kids table Christmas time at gram’s. “Pass me a bun” turns into throwing buns at each other. Then THAT cousin (we all have one) decided they want their bun toasted. Cousin starts toasting the buns over the candle and somehow it lights on fire.\n\nAnother Christmas with gram we were playing kickball in her finished basement. We all decided it would be a good idea to use her ornaments that she hung from the drop ceiling as target practice.",
   "created_utc": 1703179286,
   "score": 23,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedrvrq",
   "message": "I went on a cruise with my entire family, like grandparents, aunts, uncles, cousins and everything. In the Bahamas I found a guy in a bar that was selling some weed. I was like cool and we went out to this restroom thing somewhat on the beach to show me what he had. As he’s showing me what he’s got, a police officer walks in, I think he recognized him and saw us go in there. He tells us to put our hands on the wall, I’m like “Fuck me my parents are going to kill me and I’m going to be arrested in the Bahamas on a family trip”. Right as the cop comes over to me and starts asking my name and my papers the other guy just fucking books it out the door. The cop goes chasing after him. I’m like, holy shit. I kinda peek out and see the cop running down the beach after him, I go directly the other way and run straight back to where some of my family was. Never saw that cop or that guy again 🤷🏻‍♂️",
   "created_utc": 1703196010,
   "score": 7,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kee1tds",
   "message": "My grandmother started a food fight (specifically chocolate mousse fight). She was trying so hard to have a nice Christmas dinner with the family but was just being so over the top about everything. My family is not fancy. My grandmother is usually not fancy. They're essentially a bunch of Albertan rednecks, so this sudden turn to gold rimmed plates and crystal goblets was absurd. We all appreciated the effort, but a LOT of jokes were made. When she brought out dessert - chocolate mousse in crystal bowls my cousin made yet another remark and my grandmother broke. She reached into her dish and smeared chocolate mousse over my cousin's face. Chaos ensued. Best Christmas dinner ever. 😅",
   "created_utc": 1703199893,
   "score": 6,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kecknd0",
   "message": "So this was Christmas 2015 or 2016, when those “hoverboards” were super popular. I had a couple of drinks and thought it was a good idea to ride one my cousin brought. I slip and fall flat on my back in the kitchen in-front of all my immediate and extended family.",
   "created_utc": 1703180080,
   "score": 14,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keczpic",
   "message": "When my mom was little everyone would walk down the stairs one at a time on Christmas morning. Eventually that led to the tradition of \"falling\" down the stairs. Later still, Christmas began to be hosted at a cabin where they slept downstairs and the living room was upstairs so they naturally did \"falling up the stairs.\"",
   "created_utc": 1703185568,
   "score": 12,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedflno",
   "message": "This happened a few weeks ago, it was a smaller family gathering kind of awkward since my grandma was there and the previous year there was quite some drama with her and me. Skip forward to when I was starting to leave, said grandma walked up to me and said  \n\"Before you leave I have a gift for you\"   \nShe handed me a piece of meatloaf and went back to here seat without saying another word.",
   "created_utc": 1703191442,
   "score": 5,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedlpvu",
   "message": "My sister set my mom’s house on fire. (Candle + curtains), but the funniest thing about it was the scene going on- smoke everywhere, people freaking out, and Happy Holidays blaring through the whole thing.",
   "created_utc": 1703193709,
   "score": 6,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedprf9",
   "message": "Not me but my ex bf was opening a new canister of whipped cream. His sister sat across the table from him during dessert. When he put too much pressure on the nozzle, the cream shot across the table directly in her face! Not a drop was spilled on the table and I nearly spit out my applepie laughing",
   "created_utc": 1703195215,
   "score": 7,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedseya",
   "message": "One year for Passover, my husband's grandfather got pretty heavy into the wine before dinner. We all sit down, and we get to the part where he's supposed to tell the story of Passover. It went fairly standard at first, until he said, \"So Moses told Pharaoh to let his people go, and Pharaoh said, 'Fuck you!' And then Moses said, 'No, fuck *you*!\" We all lost it",
   "created_utc": 1703196214,
   "score": 11,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebjxk4",
   "message": "Eons ago, when we weren't all too fucked up to have family gatherings my... daughter-of-uncle... she got into karate REAL HARD. My uncle also found some prestigious Russian/Ukrainian-only school.  \nThe problem: karate is all honorable 'n shit.  \nMy school was racist and hated us Ukrainians. As a result, I had to invent my own martial art to not die.  \nShe wanted a match to see who was a better fighter.  \nMind you, she knew I had to invent my own fighting style.  \nShe did some honorable \"hoo\" and \"haa\"s before I jumped on her, and then my father jumped on me to not have me accidentally kill her.",
   "created_utc": 1703165551,
   "score": 19,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kee9ysi",
   "message": "We were having my grandmas birthday party and my \nMom was taking the trash out, tripped on the lid, fell in and knocked herself out.\n\nOne of the funniest things I've ever seen",
   "created_utc": 1703203305,
   "score": 2,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedg07i",
   "message": "I was at my GF's house at the time for Xmas.\n\nHer aunt, uncle, and two younger cousins were there, along with her parents and her brother, Chris.\n\nChris was in his early 20's, I was in my mid 30's, I had a shaved head, he didn't.\n\nThis was my first time meeting the cousins. The family had been over dozens of times in the past few years so it's not like the cousins were not familiar with each other. \n\nThe girl cousin, Heather, who was about 10, comes up to me and hands me a drawing she had been working on.\n\nIt was a picture of a lion. It was captioned: Dear Uncle Chris. Go Tiger! Love Heater\n\n1) I'm not your uncle.  \n2) My name's not Chris.  \n3) That's a lion, not a tiger   \n4) And you misspelled your own name.\n  \nShe's not special.",
   "created_utc": 1703191593,
   "score": 255,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedsvro",
   "message": "A family member revealed that they owned a television",
   "created_utc": 1703196392,
   "score": 0,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keduggg",
   "message": "One Thanksgiving, the napkins caught on fire from the candles. My grandmother pick them up and ran to the sink to put it out!",
   "created_utc": 1703196999,
   "score": 0,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kedyql4",
   "message": "i wass digging through a big black of stuff while the others were at the table they thought it looked very funny and intermittenly laughed about it mulitple times through christmas.",
   "created_utc": 1703198660,
   "score": 255,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked9vee",
   "message": "Wait you guys actually",
   "created_utc": 1703189297,
   "score": 252,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "ked86ss",
   "message": "My uncle and hurt his girlfriend came over for Christmas one time we were just casually talking when my dad said I'd remember when you lived with our aunt and this is of know what my sister just said you know I'm even university by the time you used to get married",
   "created_utc": 1703188678,
   "score": 248,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keccg7i",
   "message": " Many people share unexpected hilarity from family gatherings, such as accidental pranks or amusing misunderstandings.\"",
   "created_utc": 1703177105,
   "score": 244,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "kebkuii",
   "message": "A mass shooting",
   "created_utc": 1703165987,
   "score": 226,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keeg1ap",
   "message": "Catching my uncle right between the eyes with a badminton birdy while he was throwing tennis balls into the game...",
   "created_utc": 1703205877,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keegd9u",
   "message": "We were at a seafood buffet for a family reunion. Something sounded really loud. People hit the floor because they thought it was gunshot. Some screamed or gasped. I spilled shrimp everywhere. People included other patrons who were in the restaurant and not a part of our family. My aunt was in wheelchair because of an injury from a fall. One of her wheels had too much air(?) and exploded. Proceeding to scare the shit out of everyone.",
   "created_utc": 1703206017,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keegoo7",
   "message": "One Christmas, my ex's nephew got one of those giant art kits with all the crayons and markers and such. I'd pined for one as a kid, and after he went to bed I availed myself of the crayons and drew an underwater scene with fish, seaweed and a starfish. \n\nI can't draw for shit, so it was terrible. I put it aside, forgot about it, and went to bed. \n\nIn the morning, I woke to find the kid's mom with drawing in hand, complimenting him on his work. He kept telling her it wasn't his. \n\n\"You don't have to be embarrased! It's really good! I'm going to put it on the fridge!\"\n\n\"I'm telling you, I didn't draw that! I can draw way better!\"\n\nAt that point, I confessed that the drawing was mine. His mom said we could still put it on the fridge.",
   "created_utc": 1703206151,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keei9vf",
   "message": "A structurally questionable chair broke the second my brother sat on it. He fell in the most humerous and non-injurious way possible. We all chanted LARDASS LARDASS LARDASS for entirely too long. He is not overweight, and everyone in the family knew that chair was done. Cue chair jokes for \u0026gt;10 years",
   "created_utc": 1703206826,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keekoep",
   "message": "At a Christmas party at my grandmothers. My cousins and I were playing hide and seek. I hid in the tub. One of the guests, an older man, comes in and takes a fat shit while I was hiding in the tub. None of my cousins believed me.",
   "created_utc": 1703207853,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keel4za",
   "message": "At my ex’s aunt’s house in Bend OR it was a lovely thanksgiving. The bird was just out of the oven and the table was set, overlooking a lightly snow-dusted patio. My ex’s uncle was standing over it about to carve when a wild ass turkey wandered onto the patio and peered in at us as they were about to cut up his dead homie.",
   "created_utc": 1703208049,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keelh2v",
   "message": "My uncle drunk at a family 4th of July pool party...kept doing the pull my finger thing to the little kids and they loved it... He got steadily drunker... After about 12 drinks he does it again and just shits himself... Thank God we were outside... My aunt had to hose him off in the side yard... It was awesome",
   "created_utc": 1703208193,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keelx99",
   "message": "My grandparents were doing their standard transphobic slurs and everybody that wasn’t them and my dad gave me a look of “shit is this the year -insert name here- snaps?” While I was actively shotgunning an Arizona tea. They mostly know I’m queer af, just wasn’t expecting the entire world to stare at me all at once",
   "created_utc": 1703208384,
   "score": 1,
   "submission_id": "18nmfpn"
  },
  {
   "comment_id": "keem3ni",
   "message": "Thanksgiving 2014 - My grandpa farted the longest/loudest fart of all time (it lasted for 15 seconds) and my cousin had his first laugh (he is 3 months old). My cousin's face turned black because he couldn't get air because he couldn't stop laughing. It was absolute chaos.",
   "created_utc": 1703208461,
   "score": 1,
   "submission_id": "18nmfpn"
  }
 ]
}