{
 "submission_id": "18nx71w",
 "title": "Homeowners of Reddit, what are some reasons you hate owning your home?",
 "selftext": "",
 "created_utc": 1703192439,
 "permalink": "/r/AskReddit/comments/18nx71w/homeowners_of_reddit_what_are_some_reasons_you/",
 "score": 189,
 "url": "https://www.reddit.com/r/AskReddit/comments/18nx71w/homeowners_of_reddit_what_are_some_reasons_you/",
 "comments": [
  {
   "comment_id": "kedn5uv",
   "message": "Finding all the things the previous home owner half-assed and having to fix them.",
   "created_utc": 1703194242,
   "score": 188,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedmant",
   "message": "The expense.\n\nEverything seems to cost $10k to fix these days.",
   "created_utc": 1703193922,
   "score": 211,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedppj0",
   "message": "Seems like I get around 5 to 10k saved up and then something major breaks and I’m poor again it’s a vicious cycle",
   "created_utc": 1703195196,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedwx8m",
   "message": "You slowly start seeing the seams and imperfections.  Each one with a dollar sign over it",
   "created_utc": 1703197950,
   "score": 122,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedyqfu",
   "message": "I never wanted to be Bob Vila but here we are.",
   "created_utc": 1703198658,
   "score": 91,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedpc7t",
   "message": "Everything is your problem.  The more rural you are, the more problems.  Deer died in the yard?  Oh shit, who's problem is this?  FUCK it's mine",
   "created_utc": 1703195058,
   "score": 234,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedl4ip",
   "message": "When like three different things all break at the same goddam time",
   "created_utc": 1703193490,
   "score": 185,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedr28e",
   "message": "The previous owner concealed many problems by making it impossible for my home inspector to get access to the affected areas.  If I were to buy again, I would make it a condition of the sale that nothing blocks inspector access.\n\nCheers,  \nRuss",
   "created_utc": 1703195701,
   "score": 122,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedxjbz",
   "message": "I have so many dreams of remodeling, but damn is remodeling expensive.  Especially because I want to do my bathrooms (2) and kitchen, which are the highest ticket remodel items.  \n\nAlso property taxes.",
   "created_utc": 1703198189,
   "score": 49,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee9537",
   "message": "Finding contractors. I called 36 plumbers this summer. The guy that showed up fixed my broken shower handles with a single washer and tried to charge me $800. Being a homeowner has brought out my inner Karen…I called relentlessly for two weeks and complained and bitched and moaned. I paid $200.",
   "created_utc": 1703202955,
   "score": 38,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keebtcz",
   "message": "The absolute terror of any kind of dripping noises.",
   "created_utc": 1703204087,
   "score": 42,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedufe1",
   "message": "Knowing at some point I'm going to have to replace the major things like the a/c unit at some point. If the toilet breaks or water heater bust or a pipe burst it's on my dime. \n\nAt some point I'm going to have to replace the roof. I'm not very friendly with a lot of folks around here so I have to do a lot of research to get good references to not get screwed on who I pick to do the work or pay some subscription price to something like Angie's list to get a good deal. \n\nI hate paying mortgage every month but as opposed to rent I'll take it. \n\nI also hate that my house is so small, I want bigger but I'm not willing to jump into the housing crises to buy bigger or have a larger payment.",
   "created_utc": 1703196988,
   "score": 25,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedv83v",
   "message": "Property tax and asinine insurance costs",
   "created_utc": 1703197295,
   "score": 24,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedyif5",
   "message": "It’s an anchor. It’s a lot more difficult to up sticks and leave when you’d have to go through a selling process instead of just letting a lease run out or even breaking a lease.",
   "created_utc": 1703198572,
   "score": 32,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedtcxl",
   "message": "My HOA. \n\nThey raised it by $70 a month last year and $100 this year. It’s only gonna continue going up.",
   "created_utc": 1703196574,
   "score": 73,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedwvon",
   "message": "Constant yard work",
   "created_utc": 1703197934,
   "score": 20,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedy18l",
   "message": "Nothing compared to renting the shitty, overpriced, sloppily made, basement apartment, that I moved out of. \n\nMy house has been a huge benefit to my quality of life and mental health.",
   "created_utc": 1703198383,
   "score": 19,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keerkxi",
   "message": "Water is a fucking menace. My favorite sound used to be pounding rain, now it fills me with anxiety.",
   "created_utc": 1703210797,
   "score": 15,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedvou0",
   "message": "I'm thousands of dollars in debt from home repairs and it still needs thousands of dollars of repairs.",
   "created_utc": 1703197472,
   "score": 29,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee1a3j",
   "message": "My wife had our heating and air conditioning systems inspected as we are in our 70s and don’t want surprises.  The air was fine. The forced hot water system was deemed very efficient but the water pump irreplaceable.  My wife found a “broken” unit on line, rebuilt it and installed it. It works fine.  She then rebuilt the other pump so we have a spare.  We should be good until cremation time.",
   "created_utc": 1703199671,
   "score": 32,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedzip0",
   "message": "The never ending list of small things that need to be fixed, updated, or cared for. It’s not insurmountable but it is never ending. Still prefer owning though.",
   "created_utc": 1703198968,
   "score": 13,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee060l",
   "message": "Tired of fixing shit. People complain about rent...they'd complain a lot more about an unexpected HVAC replacement.",
   "created_utc": 1703199222,
   "score": 27,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedp7ya",
   "message": "My neighbors.",
   "created_utc": 1703195014,
   "score": 32,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee3507",
   "message": "As an older person who has owned a bunch of houses (only one at a time, however) I can attest to the fact that that ALL houses are potential money pits.   It’s SO worth it to learn basic plumbing, electrical, HVAC \u0026amp; carpentry.",
   "created_utc": 1703200441,
   "score": 11,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedsywn",
   "message": "Owned a house from 2015-2021 payment was $280 a month, sold it for over 400% gain. I now own a fruit farm in Hawaii, no mortgage. \n\nNever would've happened if I didn't buy that old shit house everyone told me not to buy",
   "created_utc": 1703196425,
   "score": 47,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedrdn4",
   "message": "I've lived in the same home for a long, long, long, long time.  It began as my childhood home, a duplex, in 1973.\n\nI grew up in this home as a small child, moved away for school, moved even further to explore and expand my horizons, moved back home, moved away, again, to the \"Big City,\" and once again returned when family needed support.\n\nWhen I purchased this house in August of 1990 the interest rate was around an eye watering 14%.\n\nAnywho, I've seen lots of changes, many I never expected!\n\nWe will be selling this home, after more than 50 years, this year.  Biggest reason for leaving:  the \"avenue\" my home is on was designated an arterial road 2 years ago.  What was once a a fairly quiet \"avenue\", close to every amenity anyone could ever want, has become a busy, noisy, dirty, dusty, dangerous thoroughfare!\n\nMore and more lovely century homes have been designated commercial properties and turned into businesses, or scooped up and turned into multiplexes owned by slumlords!\n\nFor the past 2.5 years, an old school, just around the corner from us, was torn down and they've been rebuilding and rebuilding and rebuilding.  Noise.  More dirt.  More big trucks, continuously.\n\nWe are a 15 minute walk to our waterfront.  Only 7 minutes of that walk has sidewalks.  They've said for 25 years they will put sidewalks in - all the way down.  Nope.\n\n\\*Older homes are lovely.  But they cost $$$ in updating and maintenance.",
   "created_utc": 1703195820,
   "score": 20,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee09fb",
   "message": "The work.  My days off are busier than my days at work.  I go to work for a break.",
   "created_utc": 1703199260,
   "score": 22,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedwsoi",
   "message": "It's paid off, but the sum of the taxes, insurance, utilities, and maintenance is more than I ever paid for rent back in the day.  It seems like the only way to actually \"own\" it in the classic American dream sense would be to put some money into an interest bearing account, then find some company to pay all of the recurring bills out of it.",
   "created_utc": 1703197901,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee0d4x",
   "message": "So many small things break and if you aren't good with fixes, you pay $200 a pop for each minor thing. These add up.",
   "created_utc": 1703199301,
   "score": 8,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee3kow",
   "message": "Something is always broken, and you're always responsible to fix it.",
   "created_utc": 1703200625,
   "score": 7,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keeea4f",
   "message": "We bought our house 10 years ago - new construction so we’re the only owners. Everything (the appliances, the garage, the flooring…..fucking everything) is starting to get weird this year. I’m getting really good at pretending everything is “just the wind”",
   "created_utc": 1703205134,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keemobx",
   "message": "Man reading this thread makes me happy I’m a renter.",
   "created_utc": 1703208706,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedotnq",
   "message": "Nada, zip, zilch. All the minor issues are nothing compared to the equity. Purchased 7 years ago, current rate 2.7%, pmt is well below anything I could rent. Equity is roughly $200,000.",
   "created_utc": 1703194866,
   "score": 60,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedubui",
   "message": "Go away black rock, I ain't selling",
   "created_utc": 1703196948,
   "score": 27,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keef6vn",
   "message": "Renting vs owning ✅ rent is the maximum you will pay per month; a monthly mortgage is the minimum you will pay each month - choose wisely!",
   "created_utc": 1703205519,
   "score": 25,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keduh8c",
   "message": "I’m seriously like George Bailey in It’s a Wonderful Life.  Big old decrepit house that I can’t keep up with.  Wouldn’t change a thing about my life. I love it.",
   "created_utc": 1703197008,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedw048",
   "message": "Canadian here: For the last decade, value has by-and-large driven by \"the market\". It doesn't matter how much sweat,effort, and money I've put into making this house better, it doesn't budge the value.  \nMy parents were not only able to afford a house on an average income, but gain value from \"fixing up\" their current house and move to one that was bigger or in a better location, rinse,repeat.",
   "created_utc": 1703197592,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee352r",
   "message": "Recently, the massive jump in home insurance premiums if you live in a high risk area.\n\nThe worst part is that cost isn’t going down or away.",
   "created_utc": 1703200442,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee8m7n",
   "message": "HOA",
   "created_utc": 1703202734,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keehpjl",
   "message": "I live in Texas and I hate it here.",
   "created_utc": 1703206587,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keellme",
   "message": "The expense.  We have just gone through two of the most expensive years we could have imagined.  \n\nThe pool was here when we got here, and hadn’t been maintained.  It would have been the same amount of $ to close it up and fill it in, versus repairing it - completely from coping down to blasting and replastering.  we would never be able to afford a new pool but this was 25% of the cost of a pool so it hurt.\n\nThis year, we had planned and saved for a kitchen.  We got started and whelp, it mounted up and went from April to October. In the middle was a massive hailstorm that nailed our roof and siding, almost total loss.  Roof was almost 100% covered by insurance but the siding was “meh, it really only hit that one side” which was not correct.  If we just repaired that one part, the entire rest of the house would not even remotely match- that siding was from 1970.\n\nWith buying and installing a whole-house generator, we probable put (my hand now trembles) $108K in this past year.\n\nNext year we really have to replace the driveway and the garage doors.  I may cry.\n\nBut….\n\nOur house has gone up tremendously in value, it’s tight as a drum now (all new windows plus the sheathing and siding and roof, this kitchen/dining room open concept is amazing, and we are going to be taken out feet first from this place.  We had a nice way to spend COVID shutdown in the pool.\n\nI like coming home.",
   "created_utc": 1703208246,
   "score": 6,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedzlxv",
   "message": "It is costly to carry month to month and way more space than I need. Just waiting for my 21 year old son to get on life’s road, and my ass is moving to senior housing. I want the simple life, and money for vacations before I’m too old to enjoy them.",
   "created_utc": 1703199004,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee64c6",
   "message": "You have to clean this shit like once a week or it turns into a disaster. How?? How does it get messy so fast??\n\nAlso the realtor conveniently forgot to mention that our basement floods every time it rains a little too hard. So the boiler and water heater both broke at the same time because of the water. Then we had to put a sump in to prevent future flooding. That was a lot of surprise money all at once.",
   "created_utc": 1703201687,
   "score": 4,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keejryb",
   "message": "It was a $134k \"starter home\" when we bought it in 2014. Now it's a $370k trap. If this is what a \"starter home\" costs, I'm never going to be able to move out.",
   "created_utc": 1703207466,
   "score": 4,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keekhtj",
   "message": "Makes the idea of moving 1 million times more complicated. Like how do I even? I'll just stay here.",
   "created_utc": 1703207775,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keelqts",
   "message": "Spent $18k in October for a new HVAC, about to spend another $20k to fix a leaky roof.",
   "created_utc": 1703208308,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedw7ul",
   "message": "Don't hate any of it. It's my home. I dislike having a yard, but society and my HOA say I have to have one, so I make sacrifices to be happy with what matters to me.\n\nWe all make choices and sacrifices.  Not hate.",
   "created_utc": 1703197676,
   "score": 10,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedph46",
   "message": "We bought our house in march. Within a month of moving in, we had a leak in the ac drain pan that caused a 5x5 section of our ceiling to come crashing down in the living room. That cost about $4000 to fix. A tree in the back yard decided to start falling apart, so there was another $1500 to get it taken out. Our driveway needed replacing (this we had planned for) at a cost of $20k. \nI have no savings left.",
   "created_utc": 1703195109,
   "score": 7,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedzi69",
   "message": "Always wanted a pool.  Got a nice one with my latest house.  $225/month in cleaning/maintenance (I do not do it myself).  Also $180 twice a year for filter cleaning, and occasionally a few hundred bucks for something else up to $1500 to get the white shit cleaned off our pool that EVERYBODY says is from our water features, but the white shit is nowhere near the water features and its less UNDER those features.\n\nLandscaping.  Again, I don't do it myself, but its a few thousand bucks a year to avoid my HOA sending me letters.  I do mow myself, again, to avoid the letters.\n\nNo matter how great you may think your home is, after a few years its just a lot of annoyances and becomes \"just a home\".  Kinda like a car, new when you buy it, 5 years later its just \"your car\".\n\nI'm actually selling it in a few months even though I have a 2.25% interest rate and have only been here 3 years because my wife's new job is a 2 hour commute, 1-way, but at least I made a couple hundred thousand on it.  We'll sell it and move into a rental until we find a better home in Dallas (and probably at 6% interest, but putting $200k into stocks that have a 10%+ return beats a down payment).  Oh, and I'll use my VA loan for the next house, $0 down, no PMI, slightly lower interest.  Best perk about serving your country a few years, VA loans for life, up to one per year.  With no money down, and house costs always going up, its a quick way to earn some money.",
   "created_utc": 1703198962,
   "score": 7,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedrc67",
   "message": "Been in my house for a few years. I got a notice this week from my home insurance company that I need to replace part or all of my roof to remain insured because it is “at risk” for a problem at some point in the future (super specific). Even better, they then gave me two dates for when I need to have the work done by and it’s not obvious which one is correct.. but one of the dates is in two weeks.",
   "created_utc": 1703195804,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedym37",
   "message": "Upkeep, had to replace windows and roof, can't afford to update the inside.\n\nThere is always something that needs to be replaced.",
   "created_utc": 1703198611,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee3bm2",
   "message": "Zero problems with it, especially since it's already paid off.",
   "created_utc": 1703200519,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee4zmo",
   "message": "It takes a lot of work. You have to do a whole checklist of stuff to keep a house in good condition.",
   "created_utc": 1703201215,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee5qmh",
   "message": "I own a house made in 1875, it's a petite beauty. 1600sq ft twelve minutes outside of Boston, not the biggest backyard but very low maintenance, and decent neighbors. \n\nBut the fucking draft that has come with this house and the amount of time/money I have spent trying to locate it is something I am not proud of and it is my white whale.",
   "created_utc": 1703201529,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee8947",
   "message": "There’s so much more gravity to everything. When I was renting and had an annoying roommate, I had the idle thought in the back of my head “eh, I’ll move somewhere else when the lease is up.” Now when I get that feeling over noisy neighbors or xyz problem, it’s “if I sell now (~1 year into owning) paying the closing costs and realtor fees are going to put me out so much money.” Those fees are ~6% of the sale price, so if I sell the place for the exact price I bought it, that’s like 1/3 of my down payment vanishing into other peoples’ pockets. Feeling committed to a place I fell out of love with doesn’t feel great.\n\nAlso, I’m not handy, so I dread stuff breaking since those are $$$ to fix.",
   "created_utc": 1703202584,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keea2dv",
   "message": "For me, it's wanting to do simple things like paint, but I can't find the motivation to do it and won't pay anyone else because it's so easy.  So I'm too lazy to do it but too cheap to pay anyoe to do such a simple task.",
   "created_utc": 1703203347,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keecc4h",
   "message": "There’s no person to report faults to. You have to get them sorted yourself.",
   "created_utc": 1703204309,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keecyse",
   "message": "Appreciation is a killer if you never plan to move.  I live in a modest home where the value has increased 150% in the last 10 years.  What does that do for me if I never plan on moving?  Ridiculous taxes and insurance.  Both of those are now running me near $1000 a month.  Everyone tells me to sell my house and reap the rewards.  Why?  If I stay in this area I just overpay for something else, rinse, and repeat.  Add the cost of repairs and maintenance and it gets out of control.  The only solace is our daughter will be able to sell it one day and benefit from the increased value.  Unfortunately, by then, we will have spent an equal amount of our money to keep it.",
   "created_utc": 1703204574,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keeias4",
   "message": "It’s that major appliances fail within a few years and it’s intentional. In the past seven or eight years, I have repaired or replaced:\n\nThree dishwashers, replaced two, repairs one - estimate total expenditure $3500\n\nA hot water heater (old, but this required all kinds of retrofitting) - $1400\n\nHVAC — again old, but required retrofitting, $7,000 and got a deal\n\nThree, soon to be four, microwaves $900\n\nDryer - old $600 for repairs\n\nThree disposals $500\n\nToilet - $150\n\nKitchen faucet $150\n\nI need a new refrigerator but I am afraid that it will be another piece of shit that breaks all the time. $4000",
   "created_utc": 1703206837,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keejzw9",
   "message": "Sold mine during COVID divorce.  Got rid of spouse and 80% of my stuff.  Never been happier!",
   "created_utc": 1703207561,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keekn8z",
   "message": "My roof is, to my knowledge, original to the house - about 23 years old. \n\nEvery time a big thunderstorm comes through, I pray a big hailstorm plows thru and sits on top of my house for a little bit.\n\nMeanwhile, my buddy on the other side of town has had his roof replaced twice in the last eight years because of hail.",
   "created_utc": 1703207840,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keel1r3",
   "message": "My water heater went out this weekend. That was a fun $900 that was unexpected.",
   "created_utc": 1703208012,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keel3xp",
   "message": "Always a list of things to do.  My house is only 7 years old but there’s always grass to mow, snow to shove, weeds to kill, showers to clean, carpet to clean, etc.",
   "created_utc": 1703208037,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keel51z",
   "message": "Our house is at that age where all the original stuff is starting to go bad. New furnace, new water heater, new refrigerator. And now the built-in oven is dying and the roof shingles need replacing. And the carpet is pretty gross too.",
   "created_utc": 1703208050,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keel6wh",
   "message": "Everything that goes wrong you pay for. It sucks.",
   "created_utc": 1703208071,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keewxa1",
   "message": "Your neighbors can really make your life hell.",
   "created_utc": 1703213092,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kef0cku",
   "message": "All the maintenance is on me, now. Oh, there's no hot water and you need a new water heater? Have fun learning how to install it.",
   "created_utc": 1703214596,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kefap04",
   "message": "Lawn/ garden upkeep.\n\nFixing up stuff that should have been done properly in the first place.",
   "created_utc": 1703219492,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kefedxy",
   "message": "Mine is paid off, which sounds great. But taxes and the cost of repairs keep going up at a ridiculous rate, so it's always going to be a money pit.",
   "created_utc": 1703221406,
   "score": 3,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedrlu2",
   "message": "I hate that it's best investment my dumbest ever made",
   "created_utc": 1703195906,
   "score": 8,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedr5h7",
   "message": "There is ALWAYS something leaking.",
   "created_utc": 1703195735,
   "score": 5,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedu0zt",
   "message": "For me it's the maintenance. I know nothing about home repairs and maintenance, and because I own and don't rent I have to take care of it myself. Fortunately my boyfriend is a private contractor, he is self employed so when he does any job for me I do pay him for it as he has to make a living too.",
   "created_utc": 1703196832,
   "score": 4,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kedvmyj",
   "message": "HOA and property taxes",
   "created_utc": 1703197452,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "kee4l5z",
   "message": "I enjoy thunderstorms much less now, because of the potential damage to my home, and the cost to fix it.",
   "created_utc": 1703201046,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keebaxm",
   "message": "It’s too expensive. Repairs get more and more expensive plus I live in a state with a home insurance issue and that is getting insanely more expensive. My monthly payment will rise at least $100 every year because of insurance. It’s cheaper to live in a nicer neighborhood and rent.",
   "created_utc": 1703203872,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keeblbr",
   "message": "The price…. I bought when the housing market was at the absolute peak frenzy.  This was in Austin Texas.  Homes would have over 80 offers.\n\nWe paid way too much.  Value has dropped by over 150k.  It’s such a shit box compared to what we paid for it.\n\nWe were desperate.  We should have taken a breather and just agreed to rent, instead of buy.",
   "created_utc": 1703203993,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keec6cb",
   "message": "EVERYTHING is on you. New roof? That'll be 20 grand! Oh, your septic shit the bed? $7500! Damn, looks like your gutters are trashed, that'll be $800. Finished paying off your mortgage? Cool, you still owe property tax. Oh, and it'll keep going up every year.\n\nHome ownership does have its upsides, but its downsides can be brutal.",
   "created_utc": 1703204240,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keecj6f",
   "message": "No mobility. Unless you’re into long distance commuting, you’re kind of stuck to your area. I kinda long for the days of picking up and moving to wherever I want.",
   "created_utc": 1703204391,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keeffa9",
   "message": "I rented a house for 7 years and maybe had to change a lightbulb in terms of maintenance and now after a year couple years of home ownership, it's a hot water tank, dishwasher, electrical, and black mould",
   "created_utc": 1703205617,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keeidbh",
   "message": "Both of my toilets have issues and I'm working a minimum wage job. I can only poop in the downstairs one. Both of the bathroom sinks don't work.\n\nI am changing jobs next month, so I will make do until I can afford a plumber.",
   "created_utc": 1703206867,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keeidka",
   "message": "A 5 minute repair job takes 3 days and multiple trips to the DIY shop. A job requiring a tradesperson takes either 10 months to find someone or when you do is unexpectedly extortionate.",
   "created_utc": 1703206870,
   "score": 2,
   "submission_id": "18nx71w"
  },
  {
   "comment_id": "keejr1p",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18nx71w"
  }
 ]
}