{
 "submission_id": "18nytid",
 "title": "What secret will you never tell your parents?",
 "selftext": "",
 "created_utc": 1703196711,
 "permalink": "/r/AskReddit/comments/18nytid/what_secret_will_you_never_tell_your_parents/",
 "score": 224,
 "url": "https://www.reddit.com/r/AskReddit/comments/18nytid/what_secret_will_you_never_tell_your_parents/",
 "comments": [
  {
   "comment_id": "keegyt3",
   "message": "\\[pre-cellphone era\\]  I answered the phone and it was my aunt, calling from Florida.  My parents had planned a long driving trip to see her.  She was calling to say that maybe now wasn't a good time to visit.  It only took about 30 seconds for it to turn into a rant about not really wanting them in her house, to flat out insults about every wrong they had ever done to her.\n\nWhen the rant ran out, I said \"They left an hour ago.\"\n\nMy aunt said, \"Let's just make this our little secret, okay?\" and hung up.",
   "created_utc": 1703206269,
   "score": 144,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keedvtd",
   "message": "I stole this tape they bought that taught couples some new techniques to spice up their sex life. They were demonstrated by two real people so it was porn. I let a friend hold it and he lost it. I'm sure they know but I'll never admit it.",
   "created_utc": 1703204965,
   "score": 226,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kef1vjs",
   "message": "Had skipped school and the school called my dad to ask why I didn’t show up. So he calls me and says why the he’ll aren’t you at school. So I told him that I’m actually on a field trip and they should know that and he says ok let me talk to your teacher. So I was in downtown and there was no shortage of homeless people so I ask one if he’ll pretend to be my teacher her for 5 bucks. He sold it perfectly and my dad apologized to me.",
   "created_utc": 1703215275,
   "score": 188,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeexug",
   "message": "Well, I WAS going to hide the fact that I got robbed at gunpoint, but my sister's mouth is too flabby",
   "created_utc": 1703205414,
   "score": 18,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeb263",
   "message": "I was in fact in a dangerous area when travelling and survived a night of bombing",
   "created_utc": 1703203767,
   "score": 38,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keem29h",
   "message": "My super religious father has no idea how drunk I got in high school. I think my mom knew but she definitely never told my dad, most likely to save me from the hell he'd put me through.",
   "created_utc": 1703208444,
   "score": 178,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keed3v5",
   "message": "When I was a kid we were on my Dad’s boat far out at sea. He asked me to take the wheel. After about five minutes I saw a big log floating and I steered into it and hit it with the prop, HARD. I had seen a cartoon where they did this and it just turned the log into tooth picks. It didn’t do that. We had to get towed in by the Coast Guard.",
   "created_utc": 1703204633,
   "score": 103,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keezk0f",
   "message": "When I was 14 I left the house at one in the morning to hang out with friends in an empty field and watch a meteor shower, which I had ironically been grounded from seeing with my family due to sneaking out to hang out in the woods. I went out my window (difficult and needed help from my friends due to being a twig) and then came in through the back door at three (left it unlocked). \n\nNearly got caught but told my dad I had simply been taking the dog out, which he believed since I'd done that before. Never snuck out again though due to the scare nearly being caught gave me.",
   "created_utc": 1703214246,
   "score": 72,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keesn2e",
   "message": "[deleted]",
   "created_utc": 1703211257,
   "score": 237,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeeqdf",
   "message": "I lied when I said they repaid me for half of my sister's wedding dinner. My dad was somewhat forced into early retirement and while splitting the dinner bill wouldn't change things overall, I did not want him stretching his retirement money to cover something I could afford to pay for in full.",
   "created_utc": 1703205327,
   "score": 54,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kefmo73",
   "message": "I got so drunk and stoned one night I let a raccoon in the house because I thought it was my dogs. I got the raccoon out but the raccoon ripped up the couch. I just flipped the couch pillows over it’s been a year and they still haven’t found out",
   "created_utc": 1703226345,
   "score": 231,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kedyec1",
   "message": "That closet I got with the lock is not to protect my valuables, it’s to hide my sex toys",
   "created_utc": 1703198527,
   "score": 126,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keebqrk",
   "message": "\"I remember the day you adopted me\"\n\nI never told them, they gave me all the love that shaped me as a person. Surely they had their reasons (which I will never question) for never saying it during their lives.\n\nThey passed away several years ago. And I will miss them every single day of my life.\n\nSometimes parents don't need to know any secrets. Because there's a good chance they already know or have deduced it long before you've even considered telling them. \n\nThey love you unconditionally. It is your sole decision to share something with them or not.",
   "created_utc": 1703204057,
   "score": 32,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keedub5",
   "message": "I burned the house down and not the Christmas tree. I left the lights on without putting water. I was playing with the dog and we knocked over something. A spark was created and then the  fire on Christmas eve. I told my parents it just sparked and started. My parents got a divorce soon after that. Not sure if I caused that too but life has been shitty since that point.",
   "created_utc": 1703204947,
   "score": 83,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keetef8",
   "message": "I had my mom buy me BMX XXX not because I wanted to play a BMX game but because you could unlock actual porn from it.\n\nThe game was also pretty lit though.",
   "created_utc": 1703211582,
   "score": 252,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kefxv9e",
   "message": "When I was a junior in high school I bought my dog at a flea market for $20, rubbed some dirt on her, brought her home, and told my parents she was a stray I found at a friends house. They still have no idea.",
   "created_utc": 1703234513,
   "score": 172,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kee6cqw",
   "message": "Made out with one of my Moms friends. Looking back at it, I regret it and am not proud of it. She was super hot but I’m glad it just stayed as making out multiple times over the course of the summer and nothing more. We almost had sex but fortunately I did not have condoms and so I turned her down. \n\nUltimately it turns out she was fucking crazy (in my experience). She always seemed normal to everyone else though",
   "created_utc": 1703201784,
   "score": 222,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeuin8",
   "message": "I found the Polaroids. Including the ones in Robin Hood/ Maid Marienne outfits",
   "created_utc": 1703212059,
   "score": 253,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kefh71e",
   "message": "My grandmother on my fathers side gave me 5 thousand dollars and made me promise not to tell either parent. I never did.",
   "created_utc": 1703222983,
   "score": 47,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keencf2",
   "message": "That i tried to kill myself when i was like 14. My dad and i had a huge fight and i was about to hang myself, right before i went through with it he called me and asked me to come downstairs and that he was sorry. We made up, had he not called me i probably wouldn’t be here now. That was years ago and I’m so much better now, i wouldn’t dream of doing that now.",
   "created_utc": 1703208993,
   "score": 185,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeq0vp",
   "message": "[deleted]",
   "created_utc": 1703210128,
   "score": 71,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keexjpl",
   "message": "That time I accidentally kept taking sleeping pills wasn't wasn't an accident, I was trying to kill myself because I was unhappy.  Told them I got \"drunk\" after taking two and was in this weird state I couldn't sleep, but couldn't remember taking the previous pills, so I kept taking more.  In reality I took them all at once.  Got a tube of charcoal forced down my throat for that one.  \n\n\nYears later the \"neck injury\" I said was because my lanyard was ripped off my neck, was actually a failed attempt to hang myself, the knot fell apart after I lost consciousness and I woke up on the floor with a rug burn where the rope was.",
   "created_utc": 1703213364,
   "score": 233,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kee9fq0",
   "message": "My address lol.",
   "created_utc": 1703203078,
   "score": 64,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keejul4",
   "message": "I had a huge problem with alcohol. They might have been suspecting it but I was always able to control it just when I needed to so they didn't catch on. One night we were in a club and I drank WAY too much, more than I ever did. So at like 4 AM everyone had gone home except for some dudes smoking outside. I went up to them and asked them which way is home. Long story short, I ended up taking a pill with them which to this day I have no idea what it was. I completely lost track of everything. Next thing I knew, they were also gone and I had no idea where I was. I freaked out, I was already pretty much at my (drunk) mind, but the hours before were missing. It was dark, and I was in another town as I didn't recognize anything around me. I've dealt with depression before, but right then and there it hit me so hard I couldn't believe what I was feeling. So I just went on some long road until I saw a truck coming my way. Then I found myself standing in front of it waiting for it to hit me head on. The truck stopped, the guy saw me all along and had just enough time to stop. What I'm sure about is that I wasn't counting for that to happen, but just accepted it. That is very much me in many situations (which are never this drastic ofc) that I'm convinced I meant it seriously in those moments. So what happened is I walked up to the dude and asked him for directions. Luckily, while lurking around, I was actually making my way back into my town. I still had to walk. 2+ hours home, but getting in bed that night/day was the best feeling I've ever felt.\n\nSo yeah, I'm not ever telling them this one.",
   "created_utc": 1703207497,
   "score": 47,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kedu220",
   "message": "Four years ago I put a loaded pistol in my mouth. Was going to end it all and my dad don’t know he saved my life that day..",
   "created_utc": 1703196843,
   "score": 235,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keejoof",
   "message": "The extensive self harm scars on my torso, and the new tattoo I just got over them after being two years clean",
   "created_utc": 1703207426,
   "score": 126,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keey7j9",
   "message": "When I was younger (maybe 10 or 11) I had been eating bagels for a week straight. They were so fucking good. Cream cheese slathered all over. One morning my dad said no more bagels for a few days, and I said ok, but when he went upstairs I had a bagel. He'll never know.",
   "created_utc": 1703213647,
   "score": 214,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keexke3",
   "message": "When I was 10 I went on our old sailboat with my parents and sister for the weekend. When we got back I ran ahead to the car while my parents unloaded at the dock. I fancied myself a locksmith I guess and decided to pick the lock on the trunk of our 1980s Caprice Classic. With a stick. I decided to unlock the trunk of the car with a stick. \n\nWell, needless to say it didn't work and also I broke a stick off in the lock. \n\nSo my parents get to the car and for some reason the key doesn't work and we have a giant pile of bags and large coolers. My dad proceeds to fiddle with the key and lock, tries to pry the trunk open and cusses for what seems like hours. It's getting dark. Dad is still cussing. He finally manages to pry the rear of the back seat forward and there is a tiny gap to the trunk. I'm convinced to crawl through into a pitch black trunk and try to open it. I get in somehow. Eventually I brace myself on my hands and knees, arch my back, push hard as I can and the trunk pops open.\n\nWe load up the trunk, tie it down with a bungee cord, and drive the two hours home. \n\nDad is still cussing.\n\nI will never tell him.",
   "created_utc": 1703213372,
   "score": 22,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kefvv8t",
   "message": "When i was a teen, I once stole a cucumber from the crisper to use as a dildo. I threw it out the window when my parents came home early. My mom was so confused that the cucumber was missing which made me feel pretty guilty. Then, a while later, she was equally confused as to why there were cucumbers growing in her garden. She served those magic cucumbers to so many people- family meals, church potlucks etc",
   "created_utc": 1703232948,
   "score": 206,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keen19m",
   "message": "I would never tell them that cocaine is a hell of a drug. I quit a long time ago, but I would still never want them to find out that for years, all I would do at night is drink and snort blow.",
   "created_utc": 1703208862,
   "score": 203,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keerqny",
   "message": "It was me that pissed in the trash can next to the toilet and not the dog (I was 6).\n\nThey still tell the story to this day because the dog was infamous for doing crazy shit.",
   "created_utc": 1703210864,
   "score": 204,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kef17ky",
   "message": "My brother raped my sister. I beat the fuck out of him and drove him to the police station.",
   "created_utc": 1703214978,
   "score": 202,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeubh1",
   "message": "Sometimes, I wish they hadn't found the tumor and saved my life.\n\n\nAnd when my life changed and I had a uriostomy bag  for 10 years, I would have let me talk to the \"shrink\" they didn't like. Because it completely changed my life. And I didn't fully understand it. Especially at 9 years old.",
   "created_utc": 1703211972,
   "score": 24,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keew8zd",
   "message": "Dirty money payed rent a couple times. Random envelopes at the door saying “from God”",
   "created_utc": 1703212798,
   "score": 23,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kedtsmz",
   "message": "That I've been depressed for years",
   "created_utc": 1703196741,
   "score": 192,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keezzmd",
   "message": "As I was packing my bag that I was going to take to the hotel with my soon to be wife on our wedding night, my dad put a bottle of champagne in it and said it was, \"to make things go easier the first night.\"  I just said, \"Well, Thank You!\", as I was surprised that he didn't seem to at least suspect that we had been having sex for over two years.  I wasn't going to tell him then, and I never did.",
   "created_utc": 1703214436,
   "score": 250,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kees03f",
   "message": "That I tried every single drug I was able to get my hands on at some point in my life (except heroin). My former flatmate and I had over 100 marijuana plants in a hidden room in our building's basement and we paid our way through College with our production. Afterwards I did cocaine for years with the guys I worked with. My parents still congratulate me for never falling into drugs (unlike my aunt and uncle whose lives were destroyed by heroin).",
   "created_utc": 1703210978,
   "score": 170,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keenk4s",
   "message": "I did in fact sneak the neighbor girl in when we were 15 16 for booty calls…. 🤷‍♂️",
   "created_utc": 1703209084,
   "score": 238,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeriy3",
   "message": "I've known about my father's affair with my Aunt for years, and I am still wondering why there was no divorce.  \n\n\n(My siblings don't know and luckily aren't on Reddit. And I found out on my own.)",
   "created_utc": 1703210773,
   "score": 84,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keevf64",
   "message": "My dad isn't my dad. I have dna proof. I'm 27. He doesn't know",
   "created_utc": 1703212447,
   "score": 143,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keefarx",
   "message": "I'll never tell my super conservative Christian parents about my crochet dildo",
   "created_utc": 1703205565,
   "score": 80,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kef2znd",
   "message": "Never told my dad I was SAed twice in high school bc the one time me and my ex almost had sex he took off the condom and I flipped out. And me thinking I could trust my dad , I let him know in a really awkward way and he shamed me for it. Stood outside the walgreens, handed me $100 like it was a drug deal and told me to go get a plan B. He wouldn't even go inside with me since I was so scared. After that I knew I could never trust him again. \n\nPS: If you're a father, and your daughter comes to you with something so important and scary, please be kind.",
   "created_utc": 1703215778,
   "score": 76,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kefo2ch",
   "message": "(Kinda sad) \n\nI was an only child (age 10 or so) with my Mom and I was tired of her working all the time. So one day, I took her car keys and threw them…I mean THREW them into our heavily woodsy backyard. So she would spend more time with me and less at work. \n\nThe next day she freaked the fuck out (of course) and was downright distraught. She was eventually able to get a taxi to work but I felt bad, so I went out to go find the keys I threw. \n\nLong story short, I couldn’t find the keys and she got fired from her good paying job. We had to downgrade our house to a shitty apartment and she had to work crazy amounts of overtime at a shitty grocery store… all because I threw her keys.\n\nI tried several times to tell her but I just couldn’t ever get the words out…",
   "created_utc": 1703227271,
   "score": 69,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keer63l",
   "message": "That I suffer from ADHD and take meds and see counseling for it. And have for the last few years.\n\nThey're retired middle school teacher's. But they're old school. They think that only a VERY small percentage of ADHD kids are diagnosed correctly and that most of them just need good parental discipline. \n\nThey're getting on in their years, not sure what kind of cognitive dissonance it would cause them to realize that one of their own children should have been treated with meds and counseling.\n\nIt's really best for us all if they never find out.",
   "created_utc": 1703210620,
   "score": 56,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keefmq3",
   "message": "my former step-mom was very, very attractive, especially to high-school-aged-me. i would watch her shower every weekday morning as she got ready for work and i got ready for school. \n\ndefinitely not my proudest moments, but that's my secret.",
   "created_utc": 1703205704,
   "score": 230,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keekg6x",
   "message": "Your good intentions really fucked me up",
   "created_utc": 1703207755,
   "score": 221,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kee0lwe",
   "message": "Nice try, mum....",
   "created_utc": 1703199397,
   "score": 27,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keelgj1",
   "message": "That I know for a fucking fact they love my older brother and sister more. They treat me so definitely and its fucking obvious.",
   "created_utc": 1703208186,
   "score": 201,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keesfx2",
   "message": "Long time ago, I chucked a \"pack\" over a prison wall for a local gang for some cash, the \"pack\" was intercepted leaving the guys who hired me to think I'd stolen from them, ended up with a bounty on my head. Moved to a foreign country at 17 years of age, and got stuck out there for longer than anticipated due to COVID. So yeah, they still believe it was for a massage course.",
   "created_utc": 1703211170,
   "score": 105,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keepcx8",
   "message": "I have accounts of my parents bank and my mom spends a lot of money each month. If it gets low I would put in some money so it doesn’t overcharge.",
   "created_utc": 1703209844,
   "score": 51,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kedu8ye",
   "message": "That I am not entirely straight.",
   "created_utc": 1703196917,
   "score": 212,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeghbq",
   "message": "That I think they're both shitty, toxic people, and I'll only be attending their funerals for my kids. Every day I try to be less like my them (my parents) and I long for the day to be free of them.",
   "created_utc": 1703206065,
   "score": 4,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kedtv2i",
   "message": "There's a million things I'll never tell my parents because they're garbage people that I don't speak to.",
   "created_utc": 1703196767,
   "score": 54,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeb73b",
   "message": "That I do a lot of drugs, and that essentially LSD saved my life. They’d never understand how much it heals my depression for periods of time after use.",
   "created_utc": 1703203826,
   "score": 20,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keenno3",
   "message": "I know you walked in on me jerking off.",
   "created_utc": 1703209124,
   "score": 42,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeqe3k",
   "message": "I resent them so much for the way they gaslit and continue to gaslight me. I’ve come to understand it’s their coping mechanism but it pretty much kills any opportunity to have a genuine relationship with them",
   "created_utc": 1703210285,
   "score": 40,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keesyw1",
   "message": "That meditation retreat I went on was actually Ayahuasca ceremony. They had a hard enough time processing that I “believe in meditation” so I doubt it’d go over well.",
   "created_utc": 1703211398,
   "score": 43,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keexrdz",
   "message": "I'm intentionally vague about what I spend on stuff because I don't want long discussions about how I could find a better deal. \n\nI'd rather spend the precious time I have with my parents talking about other things!",
   "created_utc": 1703213457,
   "score": 38,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kefmjev",
   "message": "That my cancer came back. My Mom is 76 \u0026amp; StepDad 85 both with heart problems. They didn't handle it well years ago so now would destroy them.",
   "created_utc": 1703226259,
   "score": 37,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keep3az",
   "message": "I idiotically sprayed pepper spray in the house when they were away and it took a day and a half to fully leave. All fans on pointing out of the house. I felt so bad for my pets. Just the spray air was bad.",
   "created_utc": 1703209732,
   "score": 110,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keey519",
   "message": "That my brother molested me when we were kids. He died earlier this year after about a decade of no contact between us. I think it would cause unnecessary pain to my mom if she ever found out and I can't do that to her.",
   "created_utc": 1703213617,
   "score": 38,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keflvpz",
   "message": "I texted my mother's ex boss back when I was 5 years old and asked him for an opportunity to return to her job, because I didn't want her and my father to keep fighting. Her previous job was 900 km away, and can only go home for 2 weeks every 6 months. I deleted the text message immediately but her ex boss responded and she took the job. I only saw my mom twice a year then, but her and my father's relationship got better. They are both now happy in retirement.",
   "created_utc": 1703225835,
   "score": 36,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kef3bjr",
   "message": "I hurt myself really bad after my dad said, “If you’re gay, stay in the closet. I don’t want to know.” It didn’t matter that I was straight—that brought no comfort. I was destroyed to learn, at 15, that my dad’s love was, apparently, entirely contingent on my sexual orientation.",
   "created_utc": 1703215933,
   "score": 18,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kee2tqs",
   "message": "I think my life would’ve been much better if they weren’t around so much when I was growing up. Which says a lot because they were barely around. \n\nEither all or nothing basically… and they certainly can’t give me their all.",
   "created_utc": 1703200310,
   "score": 92,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kedzdy9",
   "message": "What my cousin and I were really up to that day.",
   "created_utc": 1703198915,
   "score": 29,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeqhll",
   "message": "Two things:\n\nI was involved in a drive-by while on vacation a couple years ago (obviously not hurt)\n\nAnd the sheer amount of pot that I ingest.",
   "created_utc": 1703210325,
   "score": 92,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kef5rrs",
   "message": "My parents think we are close. My parents and my brother came to the United States with no job, no car and no place to live. They left me in our home country less than a month after I was born. After three years, they came back and got me. I never bonded with them. I was a troublemaker that didn’t listen to them. They gave me a good life and though they didn’t have anything when they came to the States, they lived the American dream and retired as millionaires. We chat on the phone every now and again, and we say “I love you” to each other (they never said those words until they retired and moved back to our home country), but I only say it to be polite. I don’t actually have any feelings toward them. It’s like I’m indifferent or something.",
   "created_utc": 1703217086,
   "score": 67,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeljtc",
   "message": "That I'm Bi \n\nRealistically mom wouldn't care, even when the discussion of my own child's gender issues came up she was fine. She's the one that raised me to believe that everyone should be able to live as their own authentic self (not in those words, but the same idea). The issue is that my father, who has since passed, was also bi and cheated on her at least once (but probably more than that) with other men. The only person that I've ever told is my husband, and he's totally fine with it.",
   "created_utc": 1703208225,
   "score": 206,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kefhmi0",
   "message": "I was generally a really well behaved kid and I never got in much trouble. As a result, my parents trusted me way too much and would frequently leave to spend weekends with friends at the casino or on little trips. \n\nMost of the time I just enjoyed having the house to just me and the dog and played video games and watched scary movies. But one time when I was in 9th grade, I mentioned to a friend that I had the house to myself the entire weekend. My parents had always warned me against saying that I had the house to myself around others for this exact reason….\n\nMy friends convinced me to seize the opportunity and we threw an absolute RAGER at the house and invited literally everyone we knew. I was a bus boy at a restaurant and I for some reason invited all the line cooks who were like, in their 20’s. \n\nWell….everyone and their brother came to my house that night. No exaggeration, probably over 60 people. The line cooks came and brought a shit ton of weed and alcohol and invited their friends once they realized we had a pool. \n\nIt actually went fairly well and I definitely gained some popularity points at school and most of my friends and the line cooks stayed behind to help clean up before my parents came home. \n\nI told them I had some friends over (which they had said was ok as long as I told them who it was) but they could sort of tell some shit went down but didn’t quite know what. \n\nEventually my step dad found a cooler with a red ring around the top of it that had been used for jungle juice and he questioned me about it like an interrogator. But I held my ground. They called my friends and my friends parents and they didn’t snitch either. \n\nI got in trouble because they knew I had some sort of get together but to this day they have no idea the level of sheer havoc that took place that night….",
   "created_utc": 1703223232,
   "score": 33,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "kef5x20",
   "message": "That i paid for christmas presents and aid for family in need with money i made from adult content online. This is a real confession i plan to never make to them. \n\nA family member was going through a rough patch so i sent them a non-insignificant sum of money which was given to me in exchange for an nsfw arrangement. This wasnt the only time either, i spent around $170 on the first ever round of christmas presents for my parents and siblings. I had never had the money to buy christmas presents and we didn’t even celebrate most years but this year everyone got gifts🖤\n\nIt’s beyond embarrassing and i feel like any gifts/money in the future would not be accepted so i plan to keep this secret as long as possible.",
   "created_utc": 1703217156,
   "score": 123,
   "submission_id": "18nytid"
  },
  {
   "comment_id": "keeesbx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18nytid"
  }
 ]
}