{
 "submission_id": "18o0rhl",
 "title": "What warning signs are you seeing that no one is paying attention to?",
 "selftext": "",
 "created_utc": 1703201902,
 "permalink": "/r/AskReddit/comments/18o0rhl/what_warning_signs_are_you_seeing_that_no_one_is/",
 "score": 144,
 "url": "https://www.reddit.com/r/AskReddit/comments/18o0rhl/what_warning_signs_are_you_seeing_that_no_one_is/",
 "comments": [
  {
   "comment_id": "kefak5i",
   "message": "Lack of well reported local news",
   "created_utc": 1703219424,
   "score": 33,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefrd9a",
   "message": "Being in healthcare for almost 30 years I will say, hands down, that the insurance you choose is actually more important than the doctor you choose… your insurance carrier will dictate your care waaaaay more than your physician will. They decide what tests you get, when you can have them done (if auth is required), whether or not your doctor recommended surgery is truly medically necessary and when you have to leave the hospital if you’re ever admitted. If THEY believe you no longer meet medical criteria for IP care… you’re out, no matter what your doc thinks or wants for you.",
   "created_utc": 1703229575,
   "score": 243,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefb1pl",
   "message": "Teachers are quitting in droves",
   "created_utc": 1703219668,
   "score": 18,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kef1n05",
   "message": "Healthcare is freaking scary. Staff shortages are reducing access to so many things.",
   "created_utc": 1703215170,
   "score": 31,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefljv4",
   "message": "Reading comprehension is in the toilet.",
   "created_utc": 1703225623,
   "score": 131,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefir9h",
   "message": "The collapse of public education is coming faster than any of us think",
   "created_utc": 1703223902,
   "score": 144,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefh9fd",
   "message": "Working as a pt in a hospital. I can tell you 90%of the (chronic) patients aren’t getting enough treatment or medical resources.",
   "created_utc": 1703223020,
   "score": 138,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefhokh",
   "message": "I see several. Public education and healthcare seem like they are on the brink of collapsing. People being priced out of housing is also a major issue.",
   "created_utc": 1703223266,
   "score": 144,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefpjhr",
   "message": "Generative AI will (and kinda has already) call into question the legitimacy of every single piece of digitally consumed content.",
   "created_utc": 1703228279,
   "score": 181,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefl8yw",
   "message": "Daffodils are growing in December in Ireland",
   "created_utc": 1703225428,
   "score": 213,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keevdlr",
   "message": "Large sea trawlers scooping up sand and depositing it on fake beaches like in Dubai. They're scooping up sea life and depositing it where it doesn't belong where it will A) die or B) become an infestation",
   "created_utc": 1703212429,
   "score": 84,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefnb0e",
   "message": "The tiny harbingers of the breakdown of the social contract. Road rage, general lack of courtesy, immediate escalation for the smallest inconvenience. People just don’t care as much and it’s becoming a social contagion, why would an individual act in everyone’s interest when it seems like one can’t always expect the same?",
   "created_utc": 1703226767,
   "score": 149,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefjdt5",
   "message": "We're going to have a critical shortage of service workers and essential workers.",
   "created_utc": 1703224279,
   "score": 26,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keffk5u",
   "message": "The DoD is blaming American veterans for underwhelming enlistment numbers.\n\nApparently, us complaining about how bad it is to be in the military is preventing them from pulling the wool over peoples eyes.\n\nOn that note, please educate yourselves on the rape/sexual assault statistics across all branches of the armed forces and spread the word.",
   "created_utc": 1703222055,
   "score": 212,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefhfmx",
   "message": "The fact that we’re losing topsoil, and bee colonies are collapsing",
   "created_utc": 1703223121,
   "score": 215,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keeqqjk",
   "message": "Florida, and other parts of the country that are vulnerable to hurricanes, have large swaths of areas that are becoming uninsurable for homeowners insurance.",
   "created_utc": 1703210432,
   "score": 102,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefi1vj",
   "message": "Specific to my family:\n\nThere have been 4 people in my family diagnosed with cancer within a 30 year period. They are comprised of two small cell lung cancer diagnoses and 2 thyroid cancer diagnoses. Thyroid cancer is not genetic (at least according to their oncologist) and the two who had it are siblings. \n\nBoth cancers can be caused by long-term exposure to Radon in the home. 3 of them lived in the same house, and the 4th visited frequently and also lived in the same town.\n\nI've expressed this to my immediate family and I seem to be the only one who cares enough to want to get the houses tested. None of them know the last time they got tested. For reference, my mom is one of the thyroid cancer diagnoses, and I grew up spending a lot of time in that house as a child.",
   "created_utc": 1703223479,
   "score": 175,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keeew15",
   "message": "There's a loneliness epidemic that already has taken root, and is getting worse. Romantic and platonic relationships are at an all time low, and forming new relationships seems as impossible as ever. This is only going to cause more mental health issues and premature health issues.",
   "created_utc": 1703205393,
   "score": 80,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefpwum",
   "message": "The Pentagon is somehow missing over 2 trillion dollars from their 6th failed audit in a row. Our government is full of corrupt assholes and no one talks about it\n\nEdit: What I'm getting at here is that there's a good chance the reason that money is incorrectly counted or even unaccounted for is simply because they don't want it to be. They don't want us knowing what their budget is used for. \nThanks for the likes guys and thanks for keeping the discussion civil. FTG",
   "created_utc": 1703228537,
   "score": 89,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefphr9",
   "message": "Many graduating high school seniors in public schools are practically illiterate.",
   "created_utc": 1703228246,
   "score": 158,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefg7la",
   "message": "the increase of anxiety inducing posts on the internet lol",
   "created_utc": 1703222421,
   "score": 3,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefmw0m",
   "message": "As a therapist, I am observing some patterns currently:\n\nThe poorest clients are feeling the squeeze the most, per usual. But they aren't alone. I have daily conversations with folks about feelings of shame, guilt, and worry around benefit loss and cuts, credit card spending, housing, and food prices. Fucking food prices. \n\nTrying to get a new patient appointment with our largest healthcare provider in town isn't gonna happen for most folks until mid-March. Seeing a specialist is averaging four plus months out. \n\nAn overall sense of unease and dread that permeates the majority of my clients concerns, be it fear of facisim, loss of rights, fear of a coming civil war, the horrific coming election, to the big one, global warning. \n\nWith the current wars now colliding with all that unprocessed existential dread (thanks Covid), shit is dark.",
   "created_utc": 1703226489,
   "score": 17,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kef966n",
   "message": "It doesn’t really snow here anymore. We used to get at least a few inches two or three times per winter. It’s been over 50 degrees the last two weeks. \n\nAnd an honorary mention: Seems like there’s fewer and fewer bugs around each spring and summer. Used to go outside and there would be tons of bees, butterflies, beetles, and of course, tons of mosquitos. Now? Barely a fraction of that number.",
   "created_utc": 1703218743,
   "score": 51,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keernoj",
   "message": "Ocean acidification",
   "created_utc": 1703210829,
   "score": 136,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefrwsi",
   "message": "The immigrant students here in Ireland with English as a second language have better spelling, literacy, and vocabulary than the English speaking Irish students. Few people in my year actually know how to spell properly, and it’s appalling because never has there ever been a point in history where information has been so available online. Ireland’s future generation doesn’t know the difference between were and we’re and their and there.",
   "created_utc": 1703229966,
   "score": 83,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kee8q75",
   "message": "It seems there is some consensus that the headlights these days are too bright, but no one seems to be interested in taking responsibility for it. YOUR headlights are too bright. YOU. Fix it.",
   "created_utc": 1703202781,
   "score": 184,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefju3i",
   "message": "Nobody cares about the subject matter of their jobs. At all. About their jobs. Myself included. Which means that almost nobody is passionate about what they do. I work in tech and I'm just bored. Everyone I know is bored.",
   "created_utc": 1703224552,
   "score": 12,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keeh0h9",
   "message": "A shortage of clean fresh water",
   "created_utc": 1703206288,
   "score": 99,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefggfy",
   "message": "The 99% own less and less each day and everyone seems to be ok not ever being able to own shit and live life on loans\n\nEdit spelling",
   "created_utc": 1703222558,
   "score": 5,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefibc8",
   "message": "I live in a high elevation area of Wyoming and we have no snow at all. It was almost 60° here a couple of days ago.",
   "created_utc": 1703223635,
   "score": 15,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kee6wuq",
   "message": "At somepoint we as nation gotta look at the rising suicide rates and the mass shootings being caused by mentally unwell people and try to counter it.",
   "created_utc": 1703202018,
   "score": 69,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keg1lx5",
   "message": "An entire generation (maybe 2) is being stripped of the ability to build generational wealth because housing is too expensive everywhere in the west. We're also getting raked over the coals as computers and algorithms have figured out how to scrape every last nickel and dime from us while also not taking so much that we revolt. Additionally, jobs we were told would be high-demand or that pay well simply aren't and don't. A large swath of \"blue-collar\" jobs that you used to be able to raise a family and buy a house on now you can barely make rent with. It feels like everything is less and less merit based and more and more class-based which was what America was supposed to be trying to escape by leaving Europe. And I know reddit is going to say \"America has always been class-based\", and that's true of every society to some degree, but that doesn't change the fact that it's got a lot worse recently. You know what is the common thread through EVERY revolution in human history? Young men feeling like they have no future.",
   "created_utc": 1703237504,
   "score": 202,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keed0yl",
   "message": "Where are all the bugs? Haven’t seen fireflies in years\n\nEdit: Since people are asking, I live in rural India, [this](https://imgur.com/a/v8A4N0g) is (a part of) my backyard. Every couple of months, someone would chance upon wild honey here.  This hasn’t happened in about 10 years now.",
   "created_utc": 1703204599,
   "score": 27,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefh22p",
   "message": "The 2024 election. Its proclivity to be a horrific event is absolutely frightening",
   "created_utc": 1703222902,
   "score": 76,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefbfgc",
   "message": "Going from several feet of snow each winter to rain. No more ' 9 months of hard winter and 3 months of poor sking '",
   "created_utc": 1703219856,
   "score": 190,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefp32c",
   "message": "Who the fuck wants to live longer in this shitstorm? I'm not depressed, suicidal etc. but I just don't want to see how much further we can fall. Society is failing. We are all in freefall but our online lives are doing just fine.",
   "created_utc": 1703227967,
   "score": 60,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefuq1g",
   "message": "A alarming lack of willing to be compassion to others less lucky or disabled, Everyone is trying put others down and everything is breaking down as a result over time.",
   "created_utc": 1703232070,
   "score": 163,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefozi2",
   "message": "This may be weird, but I’ve noticed more and more people driving around in cars with only one working headlight—at night, of course. I have 0 statistics backing this up, but I strongly theorize people not replacing their lights like they used to is a sign (not of laziness like boomers around me complain about, but) of the rapidly declining rate of people’s funds—in my neck of the woods in America, specifically. People can’t even afford their own fucking headlights anymore, or are too exhausted from nonstop work days and little if any time off to be able to do something so menial. Such an observation, if it is in any way accurate, feels nauseatingly ominous. I know “they” have been saying it for years, but I feel like a huge financial collapse is rapidly incoming and I have no idea how 80% of the nation will survive.\n\nAnother observation (again, specific to where I live):\nThe *dangerous* way people everywhere are driving. This week alone, I can’t count the amount of times I’ve been minding my business, staying in my lane, and nearly been sideswiped or wrecked with someone who—upon safely passing them—I could glance at and see was STARING AT THEIR PHONE INSTEAD OF THE ROAD. Almost every near-miss I’ve had was with someone texting and driving. None of whom seemingly ever realized what they did. I’ve had people swerve into my (*oncoming*) lane on two-lane roads, I’ve had other people race past stop-signs, cut me off, and slam on breaks in front of me. I’ve had people blow through stoplights (three times today alone on my way to and from work) when i had right of way (thank god i was paying attention). And semis have been driving like they think they're toyota corollas and not 10 ton hunks of deadly metal.\n\n(Edit: spelling \u0026amp; one fact check)",
   "created_utc": 1703227899,
   "score": 52,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefuq33",
   "message": "My sister's told me their astigmatism is so bad they can barely see to drive at night. My mother cannot see and walks bent over, yet continues to drive. My dad has alzheimers and my mom let's him drive and he pulls out in front of people. THERE ARE SOME REALLY DANGEROUS PEOPLE DRIVING ON THE ROADS!!! Best to assume they are the worst and practice defensive driving.",
   "created_utc": 1703232071,
   "score": 52,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kef3qoh",
   "message": "Silence in the woods lack of animals…. Really young kids like 3 years or so at the meal table hypnotized by their tablet",
   "created_utc": 1703216127,
   "score": 236,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefrwk2",
   "message": "The thrift stores are filled with clothes from SHEIN",
   "created_utc": 1703229961,
   "score": 90,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefkxu1",
   "message": "I'm seeing a growing lack of grace from people. As we live more on the internet, it's become easier to simply throw people away who do something wrong of offend someone. There is no humanity in that and I find it worrisome. A mob mentality is forming.",
   "created_utc": 1703225235,
   "score": 205,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefmw2b",
   "message": "This Spring my husband and I took a mini road trip from the SF North Bay to Fresno for a comic con and got hardly *any* bug splatter.  In the California Central Valley. During a **huge** superbloom.  Fuck.",
   "created_utc": 1703226490,
   "score": 96,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefitwx",
   "message": "Since COVID, kids are staring at screens earlier and for longer periods than ever before, and it is negatively affecting ability to focus and interact with others.",
   "created_utc": 1703223946,
   "score": 116,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefo3il",
   "message": "... *gestures broadly*",
   "created_utc": 1703227292,
   "score": 157,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefftjq",
   "message": "Fentanyl overdoses. It’s like we all know of it but it’s just on the rise. With no indication or plan on how to stop it",
   "created_utc": 1703222203,
   "score": 22,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefmmob",
   "message": "Medical advances the last 30 years, including statins, better blood pressure medicines, detailed medical imaging, artificial joints, colonoscopies, heart coronary surgery techniques and other technologies, will make out bodies outlast our minds for tens of millions of us.  There could be an epidemic of dementia coming soon unless we can develop better brain health.",
   "created_utc": 1703226317,
   "score": 188,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefj93j",
   "message": "There is no safety net for elderly people in the US and homeownership (home being that thing they sell for live out their days in an old folks home) is at an all-time low.",
   "created_utc": 1703224200,
   "score": 160,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "kefoysm",
   "message": "The worst effects of the covid era haven't fully reverberated yet. Long covid. Loneliness. Our economic system failing the majority. The lack of trust in so many different facets has been weakened.",
   "created_utc": 1703227886,
   "score": 101,
   "submission_id": "18o0rhl"
  },
  {
   "comment_id": "keflge2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18o0rhl"
  }
 ]
}