{
 "submission_id": "18o76hq",
 "title": "What innocuous sign or symptom did you notice that turned out to be a serious medical issue?",
 "selftext": "",
 "created_utc": 1703221820,
 "permalink": "/r/AskReddit/comments/18o76hq/what_innocuous_sign_or_symptom_did_you_notice/",
 "score": 125,
 "url": "https://www.reddit.com/r/AskReddit/comments/18o76hq/what_innocuous_sign_or_symptom_did_you_notice/",
 "comments": [
  {
   "comment_id": "keg3x8z",
   "message": "I went to the optometrist for my regularly scheduled check up. They said I didn't need to change my prescription, but, after a couple of extra tests they recommended I go to an ophthalmologist. I probably would have been lazy about that, but the optometrist mentioned there might be a small bleed in the eye, so I figured that sounded bad.\n\nI go to the ophthalmologist. They said it's possible I have glaucoma. Recommended an MRI. So I go get an MRI.\n\nThe MRI revealed I had a brain aneurysm.\n\nI got it repaired, it never ruptured, that was 2.5 years ago and I am fine. But if I had blown off my regular optometrist appointment, or if my optometrist hadn't been so diligent, who knows what could have happened. There was not a single symptom whatsoever (the eye bleed and glaucoma were unrelated to the aneurysm). Now I'm on low-dose blood thinners for life and need an MRI every few years forever. So in a way I'm safer from aneurysm-related death than the proverbial \"guy next door\" who doesn't know about it.",
   "created_utc": 1703239370,
   "score": 148,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefutl2",
   "message": "I had my hip reconstructed in August of this year. I was told around the 8-week mark I was going to be feeling so good I would need to rein myself in and take it easy so I didn't go too hard and reinjure myself. \n\nAt 4 weeks I get to come off the crutches and start weight bearing as tolerated. Everything's great for the first week but I'm noticing my hip is starting to hurt again. Both I and my surgeon brushed this off at first. I've had this hip worked on previously and it's not unusual for it to take longer to heal. But it's weird, that last surgery removed all the innervated tissue in my joint and I shouldn't be feeling pain there. \n\nWell, I wasn't. Turns out I fractured my hip somehow and was walking around that. That's what was hurting. Had we not caught it when we did and put me back on crutches I would have snapped my femur head right off. I'll be off to surgery again in just a few hours to hopefully get it fix.",
   "created_utc": 1703232145,
   "score": 10,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefo4pr",
   "message": "I had a weird rash and an unexplained bruise that turned out to be leukemia. My roommate who bullied me into seeing a doctor probably saved my life.",
   "created_utc": 1703227315,
   "score": 78,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keffk4q",
   "message": "My grandad had an issue with wetting the bed at night frequently. He tried to hide it but we found out. \n\nGood thing we did because it ended up being prostate cancer. We were able to get proper treatment before it got worse.",
   "created_utc": 1703222055,
   "score": 236,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefri0q",
   "message": "My grandfather died of covid in December 2020. Grandmother had it too but recovered. My aunt and mom were talking about what great shape she’s always been in. She even still gets her period a few times a year! No way, she’s in her late 80s, what does her doctor say about that? Everyone rolls their eyes at me, but they make her tell her doctor. It’s two different types of uterine cancer. One hysterectomy later and she’s doing much better.",
   "created_utc": 1703229669,
   "score": 232,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefy2d6",
   "message": "Killer headache and fever for a few days, ended up it was spinal cord disease and I became paralysed from it.\n\nThis was 4 years ago, still paralysed, but doing okay for myself.",
   "created_utc": 1703234671,
   "score": 61,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefnmb9",
   "message": "My cousin was very tired one day. That’s it, not nauseous or anything else. They thought it was the flu as she has no other conditions and is very young and healthy. Turns out she had randomly become septic from a minor infection she never noticed. She could’ve died as bacteria got into her bloodstream and her body started shutting down",
   "created_utc": 1703226974,
   "score": 12,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg855u",
   "message": "I started craving iceberg lettuce like you wouldn’t believe. Like I’d wake up in the middle of the night and go to the fridge just to eat handfuls of lettuce. At my worst, I was eating an entire bag of iceberg lettuce a day, no dressing or toppings, just munching on it like it was popcorn at the movie theater.\n\nFinally decided I should drag myself to the doctor for a few blood tests, assuming I was a bit dehydrated or vitamin deficient or something. My hemoglobin was 5 when it should be 13-16, ideally. My ferritin (iron stores) level was 1, which is literally as low as the test goes. I went straight from the doctor’s office to the hospital to be admitted for two blood transfusions and an IV iron infusion. The hospital staff couldn’t believe I’d been walking around and even working overtime w",
   "created_utc": 1703242692,
   "score": 238,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefru0j",
   "message": "Waking up to pee, then drinking 12-16oz of water right after.  Diabetes.....",
   "created_utc": 1703229909,
   "score": 145,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefklse",
   "message": "I was experiencing extreme numbness in my face hands and feet, my family noticed when I was rubbing my face like someone expericing withdrawl from cocaine. When we went to the doctor, I was on such high dose of medication for my disability it was on the verge of shutting down my kidney. The perscribing doctor lost their license to practice soon after.",
   "created_utc": 1703225028,
   "score": 134,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keft24i",
   "message": "A good friend had a sore shoulder; she assumed she’d tweaked it teaching one of her dance classes. However, it didn’t seem to get better and was really annoying so her doctor ordered an x-ray. Her shoulder was fine, but the image also picked up a large tumor that was completely unrelated to her shoulder pain. Surgery and chemo went well, and she’s now officially been cancer-free for seven years!",
   "created_utc": 1703230817,
   "score": 88,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefsomy",
   "message": "I started losing my appetite. I just would get full off literally a bite of food. I thought this was great, I'm losing weight without even trying, everyone thinks I'm hot, maybe because now I'm an adult I'm not hungry all the time? But then it turned into me having to puke every morning if i didn't get enough sleep, then it started happening if i was nervous or in a rush, then every time i ate it would come right back up or I'd get really bad abdominal cramps. Then i just had the cramps 24/7. 10lbs lost turned to 20, into 40, into 80. I was 77lbs and very weak. Turned out to be crohn's disease.",
   "created_utc": 1703230539,
   "score": 97,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefke4w",
   "message": "During COVID I got it. I was home after a few days and I got a cough. Would not stop!  I took a bunch cough syrup, NyQuil, DayQuil etc. kept coughing sooooo much.   This went on for a day or so. I was on the couch so I wouldn’t wake up my husband with my coughing and my dog wouldn’t leave me alone.   He wasn’t usually a lap dog but he kept poking me with his nose.  Finally coughed myself awake and went into the bathroom. I had cyanosis - my lips looked like used a blue lipstick. \n\nCue me “oh shit”.  I woke my husband up and told him “I need help” then I collapsed.  Woke up 3 days later after being rushed to the hospital and coding on the way.",
   "created_utc": 1703224895,
   "score": 200,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefk6tf",
   "message": "Not me, but my mom. \n\nUnexplained severe upper back and neck pain. \n\nIt was the beginning of the stroke that killed her earlier this year.",
   "created_utc": 1703224770,
   "score": 19,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefns3r",
   "message": "Thought I was having a really dark period.  Turns out it wasn’t blood..it was endometriosis shedding.  It had attached my ovaries to my bowels.  Had to have full hysterectomy.",
   "created_utc": 1703227080,
   "score": 200,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefpc35",
   "message": "My roommate complained of: shortness of breath, labored breathing, exhaustion, coughing, weakness, non-restoritive sleep, and had a history of sustained and increasing white blood cell levels. X-ray showing an area of shadowing in the left lower lobe of the lung, however the 'doctor' never bothered to read the results.\n\n\"Doctor\" ignored all the complaints for about two and a half years, and even joked there was nothing wrong with him. \n\nHe eventually managed to speak with another Doctor and was sent for X-rays. He was diagnosed with metastatic bilateral Stage 4 lung cancer. Diagnosis to death was three months!\n\nI would send notes with him for the 'doctor' to read, which he never bothered to do. I had accurately described the lung cancer two years prior to his death, and had the 'doctor' put aside his ego, my roommate could have had a different outcome.",
   "created_utc": 1703228137,
   "score": 54,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg0180",
   "message": "My wife: inability to process fats in the diet. \n\nIt went from “you’re at an age” to “pancreatic cancer”. Pancreas tumour was constricting her bile and hepatic ducts. The eventual jaundice was the most obvious piece of evidence however.",
   "created_utc": 1703236240,
   "score": 235,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefx2kd",
   "message": "Daughter was fatigued. Back pain. Started swelling everywhere. Chronic kidney failure. Diagnosed when they were at 3%. Super rare auto-immune disease triggered (somehow?). Kidney biopsy. Blood transfusions. Total plasma exchange. Then the start of dialysis and super expensive drugs. 5 weeks later dialysis able to be stopped when kidneys reached 17% function. 4yrs and 3mths later (only this week!) she had her last dose of meds. Kidneys currently at 81% function and hoping the 26% chance of relapse doesn’t happen.",
   "created_utc": 1703233888,
   "score": 159,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keftn9z",
   "message": "Had a really bad headache and vomiting for a couple of days, Got in to see my doctor, she wanted me o have a CAT scan. Turned out I had a brain hemorrhage. Luckily in the one area that did zero long lasting damage.",
   "created_utc": 1703231260,
   "score": 157,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keftnmz",
   "message": "Ex of mine had soreness in his leg. He thought it was muscle tension or something, but nothing helped it. Finally ended up in the hospital because the pain escalated. It was a massive blood clot. Turned out he had terrible circulation because a major vein (the lower vena cava) was just... missing.  He was put on serious blood thinners and (presumably) remains on them to this day.",
   "created_utc": 1703231268,
   "score": 149,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kega6q0",
   "message": "I felt more stupid and turns out I had a benign brain tumor taking over 2/3 of the space inside my skull. Had surgery and I’m less stupid now.",
   "created_utc": 1703244227,
   "score": 125,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefhjip",
   "message": "Excessive weight gain during my last pregnancy,  with excessive tiredness.  They tried to blame it on my age, but I nagged. My thyroid had shut down and had some strange things growing on it. Once I started the thyroid meds the growth went away.",
   "created_utc": 1703223184,
   "score": 208,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegfgyw",
   "message": "My Dad started having trouble swallowing his food. \n\nHis esophagus would fill up and he’d have to excuse himself during dinner to quietly go throw up. \n\nIt was an intermittent problem that he successfully ignored for several months. He hid it from us and his new gf who was a recently retired thoracic OR nurse of 30 years experience. \n\nUntil she noticed. And made him go to the doctor. Who told him testing would take a few months.\n\nGF armed him with the right terminology and sent him to the ER. He told them he was over age 70, having trouble keeping food down and losing weight. They had him in for scans and an endoscopy that day. \n\nStage 3 cancer, with the tumour in his stomach right next to the esophageal opening. Things would shift around so sometimes the opening as clear and he could get food down and other times it pinched shut. \n\nHe lasted 18 months with a nasogastric feeding tube, and horrific chemotherapy symptoms that were worse than the disease. If it had been diagnosed two months sooner it would’ve been operable. \n\nCause was an incident when he was four years old, his aunt and uncle (in their 90s) came up with that piece of family history. His mom had gone out to fill the mop bucket at the pump in the yard and left a cup of concentrated bleach on the kitchen countertop. Dad wandered in, saw a cup of milk and sucked back a slug of it. He spit it back out and started screaming. No obvious long term damage until 65 years later. \n\nThe cancer was a specific rare combo type caused by caustic bleach damage mutating a stem cell that split and became two kinds of cancer in one deadly blob. Then it remained under immune system control and suppression until he hit his older decades. He’d been carrying around a ticking timebomb in his gut for longer than he could remember. \n\nThis was a man in perfect health, fit, looking over a decade younger than he was and he should have lived into his 90s. No comorbidities at all. Unless you count the ego that kept him from getting checked sooner.\n\nTake your symptoms seriously guys. He never got to meet his grandkids.",
   "created_utc": 1703247793,
   "score": 179,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg4wk2",
   "message": "Through the day and through a few of my classes, I started to feeling a tingling sensation on my arm. I ignored it throughout the day and my arm slowly starter going numb. Then the tingling moved to my leg and then I lost total feeling and control of the whole right side of my body. Turns out my body was mimicking a stroke from such a severe stress response that I totally ignored which led me to being hospitalized for 4 days. I was only 21 at the time and I still deal with the effects over a decade later 😬",
   "created_utc": 1703240152,
   "score": 157,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefhltu",
   "message": "Persistent back ache turned out to be hypothyroidism.  Inability to ride a bike up a hill despite my higher-than-average level of fitness diagnosed as pernicious anemia.  I'm too scared to ignore anything anymore.",
   "created_utc": 1703223221,
   "score": 181,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg4h8n",
   "message": "I had light bleeding early on in pregnancy, no pain, doctor told it was a miscarriage. A week later I was still bleeding but it was getting heavier, not period heavy, just more than before. Still no pain.\nA friend I happened to have recently seen a family member go through am ectopic pregnancy and suggested I go to emergency, which I did. After 3 nights in hospital with other more urgent surgeries going before me I finally had a laparoscopy which found it was an ectopic pregnancy and I had been bleeding internationally from a ruptured tube for over a week.\nThe surgeon said my organs had actually started shutting down and if was left another 4 hours it would have been too late.\n\nI recovered and now have a healthy 5 year old.",
   "created_utc": 1703239813,
   "score": 16,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keffvrd",
   "message": "I went to see my primary care doctor for a standard checkup.  One of my blood tests (creatinine) was elevated for no apparent reason, so he ordered a kidney ultrasound to try and find out what was going on with them.  The kidney ultrasound revealed hydronephrosis (swelling) in both my kidneys, so my doctor then referred me to a urologist, who ordered a CT scan to try and diagnose the issue.  The CT scan did reveal the issue, scar tissue from previous surgeries in my abdomen was restricting my ureters (tubes that connect kidneys to bladder), which was a big problem in an of itself... But it also revealed that I had kidney cancer, which I had absolutely no signs or symptoms for yet, just found it entirely by happenstance.\n\nBut yeah, all of that from a creatinine blood test being marginally elevated, I otherwise had no signs or symptoms and didn't even notice anything wrong.",
   "created_utc": 1703222238,
   "score": 11,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg4ixx",
   "message": "At my sister’s wedding my father left early with my mum, without telling anyone why.  Turns out he spotted some blood in his urine, and had been feeling under the weather for a few weeks.  He saw his GP two days later, and a week after that was in hospital for tests.  Turned out he had late stage prostate cancer which had already spread to his bones, liver and brain.  He died ten weeks later.",
   "created_utc": 1703239851,
   "score": 22,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefkrs7",
   "message": "Random sharp lower abdominal pain on one side when going to sit on the toilet. Slowly got worse over months. BAM ovary ready to burst and bleed me out. \n\nI had been teaching swim lesson with kids pushing off my stomach same day. Doc told my mom I was lucky, if it’d burst I wouldn’t have gotten to a hospital in time.",
   "created_utc": 1703225131,
   "score": 17,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keflciz",
   "message": "Spacing out a lot. Turns out I was having absence seizures which were only diagnosed this year after having 2 tonic clonic (formally known as grand mal) seizures. I was formally diagnosed with epilepsy this year.",
   "created_utc": 1703225492,
   "score": 9,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg7vzo",
   "message": "Lifelong weird symptoms: really flexible joints, poor heat/cold tolerance, headaches, back pain, pale, tall, thin, abnormal sternum, flat feet, asthma, difficulty writing due to hand pain, etc. Diagnosed at age 35 with a rare and incurable condition called Loeys-Dietz Syndrome. People who aren't monitored closely can die from ruptured aneurysms. The diagnosis saved my life and validated years of mysterious pains and problems.",
   "created_utc": 1703242492,
   "score": 127,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kege7gc",
   "message": "Had a gut feeling something was wrong waking up at 6am. Could not put my finger on it! I went to the ER and the doctor thought I was joking for coming in saying \"something doesn't feel right\". Had a mild fever, some cramps, feeling hot-flashy. She kept saying \"sounds like female cramps to me\" and I HOUNDED her to please investigate more.\n\nAfter some tests, i was told I need to strip down and prep for surgery in an hour because my appendix was massive and about to rupture.\n\nAfter surgery they said it was so gangrene, that if I waited one more day I'd have a 50% chance of survival due to septicemia. Phew! Trust your gut instincts!",
   "created_utc": 1703246994,
   "score": 122,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keflkuh",
   "message": "Couldn’t keep down food every time I ate. Chalked it up to food poisoning until I was in severe pain. Turns out I had gnarly gallstones that started effecting my liver. Even my eyes started to be jaundiced.",
   "created_utc": 1703225641,
   "score": 249,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg6uuk",
   "message": "Wasn’t feeling great a week or so after having a baby. Headache and nausea but these were typical for me. Went in for a check up and I had postpartum preeclampsia and was close to having a stroke or seizure. Got readmitted after that.",
   "created_utc": 1703241686,
   "score": 115,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg9ga6",
   "message": "This is kind of gross but my good friend had diarrhea for like a year. Not like you get with the flu where it’s all water but never solid, plus cramping and frequently having to go. Not a ton of pain just really uncomfortable every time she had to poop. She just thought she needed to eat more yogurt and fiber. Self diagnosed irritable bowel. Turns out she had stage four colon cancer and was only diagnosed once she had severe pain in her side once it had spread to her liver. She died last year and I still really miss her.",
   "created_utc": 1703243686,
   "score": 237,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefrlj9",
   "message": "A friend's mom had a dark streak under her thumbnail that wouldn't disappear for weeks. She didn't give it any thought. My friend only learned that from a casual conversation with his mom when he went home to visit, and she had had the symptoms for over two months by then. As a med student, he was alert and suspected that something wasn't right and insisted on her going to the doctor, and a week after he was told it was melanoma.",
   "created_utc": 1703229738,
   "score": 215,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegbt60",
   "message": "I lost 60 pounds during lockdown (I had to be in control of something, apparently it was what I ate.)  Suddenly during mid 21, my weight loss stopped dead in the water.  And I itched all over and was exhausted by noon. \n\nThyroid issues run in my family, but my doctor suggested that I was cheating on my diet.  I weigh and measure everything going onto my plate, I'm not eating anything different or new, so Something Else Is Going On.  Because I was adamant about it, she referred me to an endocrinologist.  Who palpated my throat and said, \"Hm, your thyroid is a bit enlarged. Let's send you for an ultrasound.\"  So I went on a low dose of thyroid hormone and all was well until I had a second ultrasound a year later and the thyroid had grown rather spectacularly.  We planned surgery, and by the time I did get it out (2/22) the thing had grown so much I was having trouble eating food that wasn't soft, and I kept getting out of breath. \n\nApparently it wrapped around the sides of my throat almost to my ears on either side and had grown down into my chest. It was the biggest one my surgeon had ever removed. \n\nAnd yeah, when it went to pathology, it was turning cancerous in spots.  \n\nBut if I hadn't gone and gotten that baseline scan, we wouldn't have realized it was growing like that until I couldn't eat or drink at all, and the cancer would have spread.",
   "created_utc": 1703245390,
   "score": 101,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefv5qz",
   "message": "I would always have intense stomach pain while eating. at one point it was so bad I lost 40lbs from just not being able to finish meals. I thought i had some form of eating disorder for YEARS. I always had random cramps but it didn't seem serious since anytime I went to the er they told me it's normal for women.\n\nwell I have endometriosis and all foods from meats, grains, fruits, to even veggies cause inflammation of my endometriosis tissue. I found out by constantly eating wrong and being put on estrogen based birth control. it has disabled me.",
   "created_utc": 1703232400,
   "score": 193,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg8p41",
   "message": "My clumsiness and \"butter fingers\" were usually laughed away by everyone, myself included, as just a quirk I had that I would grow out of. Turns out I have multiple sclerosis and that's why I keep falling over and dropping things.",
   "created_utc": 1703243117,
   "score": 191,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg3xfl",
   "message": "I had a cough that wouldn't go, plus I have asthma. Got myself an uber to ER one afternoon as I thought I just needed some oxygen and steroids for the asthma.   Turned out I had Haemophilis Influenza and covid and was in iso for 6 days. Sick little puppy I was.",
   "created_utc": 1703239374,
   "score": 98,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg8vxe",
   "message": "Numb fingers turned into a numb arm. Diagnosed with carpal tunnel. \n\nNumb flank and legs. Diagnosed with anxiety.\n\nNumb back. MRI. Diagnosed with Multiple Sclerosis.",
   "created_utc": 1703243256,
   "score": 96,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefp05g",
   "message": "Went in for a UTI. They asked how long I'd had stage 4 breast cancer. Um...",
   "created_utc": 1703227912,
   "score": 56,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg0z5x",
   "message": "Few years ago I had some pain in my lower belly for a few months. Didn’t think much of it, but one night it was absolutely unbearable. The next morning I had a strange feeling but the pain was gone, so I went to work normally. Over the weekend the feeling did not go away, so on Monday after work I went to the doctor and he directly send me to the emergency room, since my appendix was torn.",
   "created_utc": 1703236987,
   "score": 88,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg1d8j",
   "message": "I get reflux and I was experiencing a period of it being bad. Eventually saw a GP who diagnosed it as a stomach ulcer. Tests. Should’ve gone to the hospital but didn’t want to be a burden on the health system. \n\nI had yersiniosis. It’s the bacteria that causes the plague. Literally, the black plague. I’m pretty sure that contributed to me going into septic shock a few weeks later after an unrelated, routine procedure. \n\nIt’s been a year and I still have digestive issues and post sepsis syndrome.",
   "created_utc": 1703237307,
   "score": 167,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg10l6",
   "message": "Not me, but my mom. When l was a toddler l started getting ear infections. My mom took me to my pediatrician, who diagnosed it as a toddler allergy. When we moved she took me to another doctor who immediately diagnosed it as Cholesteatoma. A tumor was growing in my ear, and l needed surgery. I would need multiple surgeries until l was eight and the tumor was finally removed. I'm now deaf in my left ear, and need accommodations for school and work. As a child l would miss school because the medicine they gave me made me throw up.",
   "created_utc": 1703237018,
   "score": 156,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg5pic",
   "message": "Not me, necessarily, but a number of medical professionals over the course of a year+ considered my insanely high percentage of eosinophils to be not *that* big a deal - up until a rheumatologist was like “Hey, uh… that’s pretty whack. Maybe you should see a hematologist for your fucked-up blood.”\n\nSix years and one allogeneic stem cell transplant later, and I’m not still feeling bitter, like, at all.",
   "created_utc": 1703240782,
   "score": 151,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegbho2",
   "message": "Not me, but my sister - in her early 20’s she suddenly started getting really itchy skin, all over. Went to the doctor who said she had SCABIES and gave her cream which did absolutely nothing. Didn’t bother to order a blood test.\n\nA few weeks later she noticed a little bump under the skin on her collarbone. She went to a different doctor who ordered an emergency x-ray…\n\nTurns out she had stage 2 Hodgkin’s lymphoma, with a 10cm mass behind her sternum which had spread to the lymph node under her collarbone. 8 months of chemo and 6 weeks of radiotherapy later, she was in remission. Hodgkin’s is considered a curable cancer, she’s been cancer-free for over a decade ☺️\n\nHer ONLY symptom was itchy skin. If it hadn’t spread to a spot she could feel under the skin, it may not have been picked up at all.",
   "created_utc": 1703245166,
   "score": 153,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg6j7l",
   "message": "Not me, a friend. Breast pain. She was told it was normal discomfort with breastfeeding. Pain came and went. Repeatedly told it was nothing - just related to breastfeeding. A few months later, she was diagnosed with breast cancer. Died a year later.",
   "created_utc": 1703241437,
   "score": 72,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg8n7y",
   "message": "My brother had lower back pain for a long time before he did anything about it. Finally got a colonoscopy and they found he had late stage colon cancer. He was gone within a year.  \n\nGot chronic lower back pain? It might not be colon cancer but check it out anyway. There are treatments available.",
   "created_utc": 1703243078,
   "score": 70,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegcwyp",
   "message": "1) A year of extreme exhaustion, big black circles under my eyes, sweating while walking up a flight of stairs, (weirdly an extreme change in smell and inability to eat meat), and nap attacks making me unable to work. \"Blood works fine\" \"you're a healthy 32 year old woman\" \"take more vitamins\" (I had super low vitamin d levels) aggressive stage 2 breast cancer. Took me a year but I kicked it for now! My extreme sense of smell and aversion to meat went away 1/2 to three quarters of the way through chemo. My onc never heard of that one before but said cancers weird",
   "created_utc": 1703246145,
   "score": 73,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegj8h7",
   "message": "As a doctor, I was admitting a patient and I was talking to his wife in the ER. She was explaining his condition to me and I just stopped her and told her to get her thyroid checked out cause I saw an irregular lump on her neck. She said she hadn't noticed it.Was a thyroid tumor, it got removed before it could spread. Also diagnosed the guy with something pretty rare and we managed to cure him. A day of big wins.",
   "created_utc": 1703249994,
   "score": 73,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegagv0",
   "message": "My mum had stomach cramps for a few weeks. She’d always been slim, healthy and very active. She saw three different doctors who all said it’s constipation and was prescribed laxatives which didn’t help. We took her to hospital because her stomach was distended and they told her to ‘try and eat some cake and chips’ to help things move along and sent her home. A week later she collapsed and went into shock, rushed to the A\u0026amp;E and had to have part of her bowel removed due to a massive tumour blocking her intestines. Turned out to be bowel cancer and she passed away this March.",
   "created_utc": 1703244432,
   "score": 65,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefhsil",
   "message": "Nope, nope. I’m too anxious of a person for this post.",
   "created_utc": 1703223330,
   "score": 23,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg7m4t",
   "message": "I always had dodgy digestion and suffered from tiredness.\n\nI gave up eating yeast in my 20s, but still the symptoms were creeping back. When I got married 10 years ago, most of the people who couldn’t have gluten were my cousins so I thought ‘huh l’ll try that’.  And it worked really for a while.  But I was still getting some symptoms, so I went back to the doctor,  he ran a test for ovarian cancer (due to the location of some pain) which he ruled out, and generally seemed utterly uninterested.  \n\nI got pregnant, and had my daughter.  I had to have a C-section because she couldn’t get out (spoiler: there was something in the way).\n\nA couple of years later I started feeling nausea around my period, but I put it down to perimenopausal symptoms (I was in my mid 40s)\n\nA few months after that I noticed I was passing blood.  And the second time I happened I went to the doctor.   4 months later I was diagnosed with stage 3B bowel cancer.   I think I’d had a tumor for about 15 years. \n\nI’d been complaining about fatigue and bad digestion almost all my adult life, and it was always put down to stress or depression.  But I wasn’t depressed I was knackered,  it just feels the same to me.",
   "created_utc": 1703242279,
   "score": 133,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keggwz7",
   "message": "At 34w pregnant, I started gaining weight rapidly. Up to that point I’d only put on about 15 lbs but that quickly doubled. My OB gave me a stern lecture about my eating and weight gain and had me take the gestational diabetes test a second time in case we had missed it. She was very dismissive and wrote me a referral to a prenatal nutritionist to manage my diet. \n\nOne week later, I woke up with a blinding headache in the middle of the night. Couldn’t see, could barely think, started vomiting, was shaking uncontrollably and unable to answer questions. Husband packs me in the car in my pajamas, no bag, nothing, and we head to the ER. A very savvy doctor took one look at me, ordered blood draw, and sent me upstairs to L\u0026amp;D before the test results even came back. \n\nI had eclampsia. Wasn’t even pre-eclampsia anymore. The shaking was seizures. My blood pressure was 200/120, there was protein in my urine and creatinine in my blood, and I was in early stage kidney failure. \n\nThe only treatment is to yeet your baby, so I very quickly became a mom, had my kid, and enjoyed a 12-day hospital stay. One dosage of Lasix and I was back to my pre-preggo weight. (One of the symptoms of eclampsia is rapid weight gain, but that is also one of the symptoms of being knocked up so it often goes unnoticed.) \n\nWe’re all good now, and no hard feelings to the doc … I had a really normal pregnancy until 34 weeks and not a single risk factor for eclampsia, and it developed within days. But I’m definitely one-and-done now — way too risky to have a second, and giving birth on magnesium sulfate is the least pleasant experience I’ve ever had.",
   "created_utc": 1703248666,
   "score": 61,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg1rb5",
   "message": "Right side abdominal discomfort rapidly descended into excruciating sharp consistent stabbing pain and shortness of breath. Intense pain from abdomen to shoulders and back.\n\nHurt to move, hurt not to move then uncontrollable persistent vomiting started and continued for 12 hours straight.\n\nI couldn't move because if I did I vomited continously. Couldn't take my RX nausea medication because I couldn't even keep a sip of water down. Couldn't take a full breathe because of the pain. Was also running a fever so wasn't thinking straight other than thinking I was dying.\n\nFinally took a chance and reached and got my mobile and called my doctors office. They took a message and said they'd call back. I was sure I'd be dead when they called back.\n\nCall my insurance company's nurse hotline and while vomiting told them I needed help cause I might be dying or might just have food poisoning.\n\nNurse hotline called 911. 911 sent EMTs. EMTs dropped me off at the ED. Ed couldn't get an IV started because I'm a tough stick and I was severely dehydrated.\n\nAfter getting to the ED I thought I'd feel better. Like I could psyche myself into not being so sick. I thought they'd send me home even though I couldn't talk or move without extreme pain and vomiting.\n\nI got worse they final got the IV in and hit me with duildid and morphine and told me I was staying and may have to have emergency surgery.\n\nSurgery on what? They didnt know yet. They sent me off for CT scans and xrays cause I can't have MRIs (medical implant made of metal in me).\n\nAcute cholecystitis and acute pancreatitis seemingly with liver failure beginning. Yay. No.  I was in critical condition and not going home.  Unfortunately, holiday weekend so no surgical team available to removal my gallbladder and maybe pancreas too.\n\nThey stablized me for 24 hours and managed to get a team in to remove my gallbladder. Even after they removed my gallbladder my blood panels were still horrible they spent the next 5 days trying to stablize me and get my liver panel to improve. Finally they tried giving me food. Blood panels improved a bit and though still bad they stayed even in the bad range. \n\nGot discharged and told Good Luck with that.\n\nWith what?",
   "created_utc": 1703237626,
   "score": 168,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg8cdy",
   "message": "Weird tiny red spots on my feet from tight shoes. Another weird tiny red dots on my hip from bumping a counter. I had NO SYMPTOMS of anything. \n\nDiagnosis?  Severe Thrombocytopenia.  ( Extreme low platelet count. Platelets are the part of your blood that clogs and seals injuries.) Normal is around 150 to 400, mine was 2. Let that sink in!\n\nI was in the hospital for 3 days getting 3 platelet transfusions, whole blood, doses of medications and eating chocolate pudding out of cups. I was on steroids for another 3 months after that.\n\nWhat caused it? No one knows! Will it come back? Possibly!\n\nI have monthly blood work to watch for it.",
   "created_utc": 1703242846,
   "score": 58,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg9lqh",
   "message": "Headaches wouldn't go away. Blood pressure tested high a few times and dr gave me a speech about weight loss and put me on blood pressure meds. Still didn't get better and started having gastric cramps. More weight-loss discussions. Six months down the line I woke up in severe pain, rushed to emergency room and was diagnosed with parasites in my liver and nearly died. Will have to be monitored for the rest of my life as it wasn't caught in time.",
   "created_utc": 1703243799,
   "score": 57,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg9yjb",
   "message": "Oddly enough, tripping up a set of stairs…. Did it on a construction site and practically fell at the feet of the Construction manager.  Was literally bundled into the back of a vehicle and taken to the local hospital to be checked out.  Turns out I had a renal cell carcinoma the size of a grapefruit on one of my kidneys.  My urologist remarked that given another 6 months I would have been incurable.",
   "created_utc": 1703244062,
   "score": 57,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keggtfg",
   "message": "My mom started acting and speaking bizarrely. For example, she lost her cell phone in Burger King and told me she dropped her \"watch\". She seemed really distant, and had awkward stresses as she spoke. I was moving out at the time and we thought she was having a mental breakdown.\n\nI called a number to have someone evaluate her for mental health issues. She was well enough to argue with them and kick them out of the house. They scheduled a follow up in 2 weeks.\n\nEventually I just called 911 and had her evaluated at the local hospital. She had a massive brain tumor and needed immediate surgery. It was a great success, and she did much better after that.\n\nAt least for a while. Then other tumor sites popped up and she eventually passed. But that first surgery bought her another year of life when she might have died the next month.",
   "created_utc": 1703248608,
   "score": 57,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegj349",
   "message": "Thought I had psoriasis on my scalp, didn’t think much of it. Thought my constant UTI was from dehydration. Thought my bone pain was from being a hard worker. Thought my constant fatigue was cuz I’m depressed. Thought my hair falling out was from a bad shampoo. Thought the symmetrical rashes I get on my joints was from a good sensitivity. Turns out; sometimes it actually is Lupus. This all took over a decade to diagnose too.",
   "created_utc": 1703249912,
   "score": 50,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg55tt",
   "message": "The \"pulled muscle\" I needed to get a massage for was actually a collapsed lung.",
   "created_utc": 1703240357,
   "score": 94,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg92af",
   "message": "Irregular periods. Turns out I have premature ovarian failure which caused osteoporosis and infertility. Sad face.",
   "created_utc": 1703243391,
   "score": 47,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegiazp",
   "message": "I had a stiff right shoulder so I went to see a shoulder specialist, he said at my age (50ish) its probably an impingement from exercising incorrectly, bad form on my push ups . So I got treated for that (an injection ).  \n\nA few months  later I noticed a tremor in my right hand so I guessed at a trapped nerve in that same shoulder . I went back to the doctors and got referred to a \"movement clinic \".  Thats in the neurological dept.  A few brain scans later : the good news is theres nothing physically wrong with my shoulder, the bad news is that I have Parkinson's.",
   "created_utc": 1703249471,
   "score": 48,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegasgn",
   "message": "I had a cough, but only when I swam laps. Lung cancer in my 30s.",
   "created_utc": 1703244670,
   "score": 39,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kege4wx",
   "message": "Little blood during bowel movements. And not every time. A little on the toilet paper. Like maybe just an angry hemorrhoid. Colonoscopy later, S3 rectal cancer. I’m a year removed from diagnosis and 6 months from last treatment, and scans were clear in Nov but it was a stroll through hell to get here.",
   "created_utc": 1703246948,
   "score": 44,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegf4dh",
   "message": "My husband had a swollen lymph node on the side of his neck. His doctor wasn’t concerned and told him to come back in 2 months if it was still there. Turned out to be tongue cancer from HPV. 6 weeks of radiation - it was an awful thing to go through, but he’s doing well now. Please make sure you’ve had your full course of the HPV vaccine, my good people!",
   "created_utc": 1703247581,
   "score": 40,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg1p9m",
   "message": "My hands are quite yellow, I thought it was normal but it turns out it's because my liver is not good",
   "created_utc": 1703237581,
   "score": 76,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg881p",
   "message": "I (53m) was pretty much healthy mainly living with high blood pressure. Active, had played rec volleyball for 14 years. My job for 4 years had me walking 10 hours a day.\n\nI had a type of kidney stone attack that lasted 3 hours at home. Painful as hell. My GP sent me for a sonogram. Ended up finding a 13 cm tumor in my belly. Terminal cancer diagnosis. That's about 21 months ago. \n\nWithout the discovery of the tumor at that time I'd likely be dead now.\n\nKidney stone wasn't quite innocuous as per your post. But fateful nonetheless.",
   "created_utc": 1703242756,
   "score": 74,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg9cw8",
   "message": "Hot flashes in my early twenties, and scrolling on the computer started becoming hard to follow along with. The surgeon told me my thyroid basically disintegrated as she lifted it out of my throat.",
   "created_utc": 1703243614,
   "score": 37,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kega7nm",
   "message": "I had to pee all the time. Wake up multiple times in the middle of the night to pee. I was also very tired and couldn’t put on any weight.\n\nI had a teratoma tumor that was pressing on my bladder. It was cancerous but thankfully the cancer was contained within the tumor. Also don’t google teratoma unless you have a strong stomach.",
   "created_utc": 1703244246,
   "score": 39,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegcipg",
   "message": "In my teens my periods had never been consistent. By 19 they stopped entirely. Didn't mind at all because hey, now I don't have to worry about randomly trashing my underwear and don't have to go on hormonal birth control to stop them.\n\nEventually did get it looked into. I have Empty Sella Syndrome - on an MRI, my pituitary gland can barely be seen, squished up against the inside of its little pocket of skull, causing hypopituitarism. The syndrome can cause central deficiencies in TSH, growth hormone, ACTH, LH/FSH, ADH, and a few others.\n\nLuckily I only have TSH and LH/FSH deficiency, so I only developed hypothroidism and osteopenia (due to lack of Estrogen), and although my IGF-1 is just within limits, I am unusually short for my family and have reactive hypoglycemia so I imagine theres' some growth hormone involvement.\n\nIf it was more severe, I could get secondary adrenal deficiency (wherein if you get too physically stressed, you can literally die due to the effects of an absence of cortisol) and Diabetes Insipidus (uncontrollable water loss via urination, can lead to severe dehydration).",
   "created_utc": 1703245881,
   "score": 36,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegdbiq",
   "message": "See a doctor if you bleed from your ass.\nI now have crohns and some type of muscular problem, the most sad part about the muscular thing is my back just cant take weight like i could before all of this, have always been the 115Kg man with lots of muscles and now i am a 115Kg man but i can only use 25% of it wich fucking sucks.\n\nI at least started Rinvoq and my back is much better and i have never been this flexible all my life, i can touch my palms on the ground when i wake up, 8 months ago i could not touch below my knees.\n\nAnother pro tip, if you get a major surgery dont say no to fentanyl.",
   "created_utc": 1703246412,
   "score": 34,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegf8b5",
   "message": "I had a mole on my neck that I was sure was fine. My doctor said it was fine too. But my husband was convinced it was something else, so he made me an appointment with a specialist. It turns out it was melanoma, which runs on my family and killed my grandma. My husband probably saved my life by making me go to that appointment.",
   "created_utc": 1703247646,
   "score": 39,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegh7vm",
   "message": "I noticed that crewneck shirts were starting to feel like they were choking me and figured it was just weight gain. But the bigger size did the same thing. Then I started having issues with food feeling like it was getting caught in my throat. Turned out to be a huge tumor that caused me to lose most of my thyroid, some lymph nodes, and compromised my vocal cords.",
   "created_utc": 1703248843,
   "score": 37,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegna1y",
   "message": "I had extremely heavy bleeding, like more than 2 pads in an hour. I was trying to conceive at the time, but had been unsuccessful for over 2 years and we had a fertility work up at a fertility clinic in 2 months. Any female knows exactly what I suspected was happening. At the time, I didn’t know to go to the ER (it was mid covid and I was worried about inconveniencing them), so I went to an urgent care. The female receptionist and female nurse both knew what I knew. But the male doctor waltzed in and said “well your urine pregnancy test is negative so it’s probably just a heavy period”. After explaining that I don’t really get periods, and this was excessive, he said “well I could do a pelvic exam, but I’m not a specialist”. So I went home and just figured that if it was a miscarriage, there was nothing I could do. \n\nTwo weeks later I had a positive pregnancy test and a nagging feeling took me to the ER. The first doctor tried to play it off as my just being very early along, so I was obviously overreacting. He wouldn’t even bring up the word “miscarriage”. I had to ask three times before he said “well, it’s a possibility” and when I asked why I had negative tests before but a positive one now, he stuck to his guns that I was just very early along. But he had me come back in two days with another doctor for a follow up, who looked right at my period and ovulation tracking and was able to tell me that I was likely having a miscarriage complication before I even got my blood test back. \n\nI did have a miscarriage, but my HCG levels were still rising. I had retained tissue somewhere, and they couldn’t find it. They suspected it was forming as a tumor and may have caused major infection if I hadn’t caught it, which could have rendered me infertile. \n\nHappy to say I’m 6 months pregnant now and I learned a lot about advocating for myself.",
   "created_utc": 1703252107,
   "score": 35,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg6mn8",
   "message": "Having a feeling like I had kinda a cat hairball in the back of my throat, and a little heartburn.\n\nSomebody should start a PSA series on what losing your airway feels like when it's mild, moderate, and severe. Because some allergies become progressively more serious over time/repeated exposures and I could have saved myself and my family a lot of...everything...if I had known.\n\nI got so used to my health issues all being 100% benign that having a potentially deadly thing was a shock. I was playing the part of boiled frog in a pot of anaphylaxis. And we have really strange assumptions about what anaphylaxis actually is and how it looks, and very little info on how it FEELS *before* it's bad enough to kill you.\n\nI was just like haha I need liquid Benadryl cause I can't seem to swallow these pills anymore, so funny! Haha no, ya dipshit, you're dying. Quit it.",
   "created_utc": 1703241509,
   "score": 92,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kefxzcv",
   "message": "One night out of the blue I had the worst headache (I was crying because of how bad it hurt), vomiting, and fainted. I had never fainted before so luckily my parents took me to the ER. I had sepsis.",
   "created_utc": 1703234605,
   "score": 65,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg4vv8",
   "message": "I got really bad “indigestion” but it turned out to be a gallstone blockage\n\nNot fun. I don’t cry much but I was full on sobbing.\n\nIf you get intense pain in your diaphragm, and especially if it’s slightly to the right or goes through to your back - RUSH. TO. A\u0026amp;E!\n\nI was fine in the end, the stone dislodged by itself in about 5 hours. But gallstones are no joke and can be fatal if ignored. My husbands mum almost died from them when he was a kid!",
   "created_utc": 1703240137,
   "score": 67,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegc0w4",
   "message": "I had a blurry eye for 15 minutes. 3 days later i had MS.",
   "created_utc": 1703245540,
   "score": 30,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegda6d",
   "message": "I had an extremely difficult childhood. I was always terrified at night to the point I kept my mom awake nearly 24/7. I cannot describe the terror. How intense it was. They were very religious. I told them I was seeing and hearing demons that wanted to drag me to hell. Literally saw them with my own eyed or so I thought. This continued but as I got older I felt less terror and just regular fear. Relied on my parents much much less anf quit telling them about it. The \"demons\" manifested into many other things such as dead children standing in my bedroom staring at me etc. Not to mention I was sad nearly all the time and crying. In my adult life I finally met a good therapist who truly listened to me. Turns out I have a long ass diagnosis. If I can remember it correctly that is.  -- Major Depressive Disorder with moderate severity with mood-congruent psychotic features, with moderate/severe anxious distress. \nHoly fucking moley was I glad to be told I wasn't actually crazy. Just my brain chemicals are all screwed up. In my teen years I unsuccessfully tried to end myself on several occasions. Still have som4 difficulty with suicidal tendencies.",
   "created_utc": 1703246388,
   "score": 31,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegdvtq",
   "message": "A friend of mine one day said her foot felt like it wasn't attached. She went to the doctor and found she had been walking around for a month on a broken leg.",
   "created_utc": 1703246785,
   "score": 31,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegfbl3",
   "message": "Loss of central vision. I had ignored it for a few days, but was playing soccer and saw two balls coming towards me! \nWent to have it checked and it turned out to be a big-old brain tumour pressing on my optical nerve. \nDue to the Hydrocephalus caused by the tumour, I likely wouldn’t have survived until morning. Good thing I had it checked when I did!",
   "created_utc": 1703247702,
   "score": 30,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegrzgv",
   "message": "My PCP heard a very faint murmur at my physical in 2019 - no doctor had ever heard anything but she didn’t think that was unusual. She said I could get an echocardiogram if I wanted but it was probably nothing. My mom has a faint murmur as well that’s just nothing so I wasn’t worried. She heard it again in 2020, ‘21, ‘22 and then finally this year I decided to get it checked. Turns out I have a Bicuspid Aortic Valve (common birth defect) and an Ascending Aortic Aneurysm that will require open heart surgery at some point. Not a hugely scary diagnosis but requires some lifestyle changes (no heavy lifting etc) to avoid excessive dilation and dissection. My cardiologist said it’s pretty rare for a Doctor who doesn’t listen to heart sounds 24/7 to hear a murmur like that. I owe a lot to my PCP!!!!",
   "created_utc": 1703254351,
   "score": 30,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg5wx0",
   "message": "leg cramps.\n\nI thought they were Charley Horses but after a week I still hadn't been able to sleep and I was partaking of every substance (legal or not) to at least try to sleep.  \n\nUltimately I ended up at the Emergency Room ( resisting all the way)  and found out ...I had 2 blockages in my veins of my right leg.   It had already begun to be necrotic - they couldn't find a pulse in my ankle. \n\nSo I was given the option of  ??? re-plumbing my veins in my right leg or ..,. \n\ncutting it off at the hip. My sister wanted to chop off; I opted for surgery (BUT it was a mess -  internal bleeding, emergency secondary surgery) \n\n\u0026amp;#x200B;\n\nIt was *AWESOME*  /s.",
   "created_utc": 1703240944,
   "score": 60,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg90hp",
   "message": "My brother - \nHe always had asthma and growing up it wasnt uncommon to hear the front door slamming shut as my parents took him to the hospital for an asthma attack that wasn’t responding to normal inhalers. \n\nWell About 9-10 years ago (he’s a full adult, moved out, lives in his own apartment)he had to be somewhere early one morning that was far from where he lived in the city, so he was staying at my parents house. I heard the door slam shut at 3 AM and saw he was gone and figured it was an asthma attack and was on the way to the hospital. \n\nLater that day I was talking to my mom and It turns out that it was a massive pulmonary embolism and had he not gone in he would have died 😅",
   "created_utc": 1703243352,
   "score": 57,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegc7ok",
   "message": "For 10 years I woke up nearly every morning with a splitting headache that would shoot up the back of my neck and around my skull. I thought I was sleeping wrong, wife got me to check my blood pressure one day - it was 220/150. I was in the red for having a stroke at any minute. \n\nThankfully I have it under control and seeing a cardiologist. No more headaches!",
   "created_utc": 1703245672,
   "score": 56,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegejeo",
   "message": "Years ago, I had to have surgery on my kidneys for a kidney stone that was too large for any sort of regular treatment.  as they were inserting the nephrostomy tube. I felt this really sharp pain in my chest and I had trouble breathing until they sat me up after the surgery. I felt this heaviness in my chest and some difficulty breathing. I mentioned it to the nurse and she actually mocked me and said that another patient had the same surgery that same day and that person wasn’t complaining about anything they sent me home despite me telling them I was still in a lot of pain and I was having trouble breathing when they sent me home. I had to walk up three flights of stairs, and I had to stop at every single step to catch my breath that night, I slept upright in a chair because it was the only way that I could breathe the next day. My breathing got so bad that I had to take an ambulance to the hospital. Turns out that’s when they were inserting the nephrostomy tube they had punctured the bottom of my lung and it was filling up with fluid and my right lung had actually collapsed. I’m fine now, but I spent an entire month over Christmas in the hospital having my lungs drained of fluids,",
   "created_utc": 1703247211,
   "score": 54,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegj88x",
   "message": "I had to insist i was in a great deal of pain every day for about 5 years, and see Every Specialist Known to man before finally getting a Lupus Diagnosis.\n\nHad they caught this shit sooner I might not need chemo-grade lupus treatments now to stand a chance at walking again.\n\nIt's frustrating.\n\nI blame my Gender.\n\nCondescending male asshole doctors rolling their eyes.\n\nAt first i just felt shitty. And had someone listened to me at that stage I wouldnt be so sick now.\n\nfor well over half a decade; I was like no, you aren't hearing me- its getting worse, something is wrong- i cant walk. Im a mess. Every other week my eyes swell shut with a horrible symmetrical rash and I cant function At All. Heres photos. I feel like Im dying, all the time. Won't someone please at least TRY to help me?\n\nDocs be like: mmmmmmm Depression?\n\nI got so tired of being told i was depressed that i almost gave up.  Eventually they all start refering you to psych cause your file is too big and you look like a loony hypochondriac.\n\nDont give up.\n\nDemand more tests. Theres so many tests that arent your basic blood panel.\n\nDo them. all.\n\n\u0026amp;#x200B;\n\nAnd for the record no its not normal to be able to physically feel direct sunlight burning your skin like a hot poker after about 38 seconds. And for the record, theres things outside the realm of psychosis that can cause actual vampiric symptoms. If you suspect a patient is delusional, blind fold em and hit em with a UV flashlight. repeat the experiment with the thing turned off.  That would be easy? right?\n\n\u0026amp;#x200B;\n\nOr you can just send em to the psych ward and add to their medical trauma, cause eh. Woman.",
   "created_utc": 1703249990,
   "score": 56,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keg8ya0",
   "message": "I was having dizzy spells and pins and needles in my hands and feet. Then I started dropping things and my leg would go numb. Several years later, after all sorts of tests showed \"nothing\", I collapsed at work one night. Three day hospital stay and left with a diagnosis of MS.",
   "created_utc": 1703243306,
   "score": 25,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegbbsz",
   "message": "I experienced times where I couldn't understand what people were saying, I couldn't initially respond either and would have to wait a second before asking them to repeat themselves. Turns out I'm epileptic and was having focal seizures.",
   "created_utc": 1703245054,
   "score": 28,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegep22",
   "message": "I had a friend who always had a terrible odor coming from his feet whenever he took off his shoes. One day, I couldn't take it anymore and asked him why his feet stank so bad. He finally confessed that he had an ingrown toenail. As the week passed, I noticed that he started going to bed earlier and earlier. I pointed out to him that his early bedtime and the foul foot odor might be connected. It turned out that his ingrown toenail was causing him a lot of pain and even causing some bleeding. He finally went to the doctors after about a week and they told him he had blood poisoning from the infection which was causing his drowsiness. The doctor said any longer and they would have had to remove his toe.",
   "created_utc": 1703247312,
   "score": 25,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keghi6e",
   "message": "My stomach pain and diarrhea ended up not being just the simple stomach bug I thought it was. Ended up getting diagnosed with stage 2 colon cancer 9 days after my 36th birthday.",
   "created_utc": 1703249012,
   "score": 27,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "keghvnk",
   "message": "Missed my period. Hurt when I used the bathroom. Thought it was just a bladder infection. Turned out to be a 7in, 5lb cyst. Lost my right ovary, doctor said it was the biggest he’d seen in his career",
   "created_utc": 1703249229,
   "score": 24,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegmhdo",
   "message": "Weight gain that wasn’t decreasing with diet and exercise. I had a tumor growing in my uterus that got up to 10 lbs by the time I was able to have a hysterectomy.\n\nThe hormones the tumor was producing also made it impossible to lose weight.\n\nBut yeah, it was just that I had to be more disciplined per everyone (health professionals and parents) 🙄\n\nI literally starved myself for years. I just hope it won’t have a negative effect on anything as I age.",
   "created_utc": 1703251709,
   "score": 29,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegulpj",
   "message": "I took a shower one morning and everything on my body was normal. That night I took another shower and my left nipple had inverted during the day. Called my doc and pushed for an appointment. Was diagnosed with stage 2 breast cancer within 2 weeks. Now I’m sitting here mostly bald, recovering from a double mastectomy and 16 rounds of chemo, ready to start radiation on 12/26. All because my nipple looked weird…",
   "created_utc": 1703255536,
   "score": 26,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegxo5r",
   "message": "I'm a total hypochondriac now who gets every little thing checked. Here's a collection of things that led to me being so nuts:\n\nGrandma woke up lethargic one day, dead from leukemia within 24 hours 💔\n\nI felt warm and broke out in hives on an Alaskan cruise, undiagnosed childhood diabetes accelerated from the all-you-can-eat buffet i enjoyed 😱\n\nSuddenly, I was able to eat a large bowl of food after years of complicated pre-existing conditions that disallowed large meals....6wks pregnant 🫶\n\nFriend's son got knicked by a rock while mowing his lawn. It got a little infected, but he just cleaned it and bandaged it at home. It led to bone cancer, and he was gone within the year 😞\n\nDad woke up disoriented from a night of partying in Vegas but insisted it was unlike any hangover he's ever had .... stroke. \n\nHusband slept all day and didn't eat for 24 hours, but took all my metformin blood sugar medicine thinking it was motrin... Pancreatitis survived only from the excessive Metformin 🤯\n\nHusband felt unusually exhausted from moving a potted plant... blood level was at a 5 instead of the normal 12-16. He needed 2 emergency blood transfusions 😬\n\n\n\nAnd this is why I'm the crazy person always at the doctor 🤣",
   "created_utc": 1703256878,
   "score": 27,
   "submission_id": "18o76hq"
  },
  {
   "comment_id": "kegk00k",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18o76hq"
  }
 ]
}