{
 "submission_id": "18ofgdl",
 "title": "Whats the creepiest/scariest thing that you've seen but no one believes you? (Serious)",
 "selftext": "",
 "created_utc": 1703253279,
 "permalink": "/r/AskReddit/comments/18ofgdl/whats_the_creepiestscariest_thing_that_youve_seen/",
 "score": 137,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ofgdl/whats_the_creepiestscariest_thing_that_youve_seen/",
 "comments": [
  {
   "comment_id": "kegppm1",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703253280,
   "score": 1,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keh399s",
   "message": "In Phoenix AZ, 3 times I have seen a jackrabbit the size of a border collie. Wife and kids were there too. I though it was a mountain goat from about 100 feet, then it fucking hopped away casually.\n\nI just... how.\n\n3 times",
   "created_utc": 1703259201,
   "score": 247,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehowv7",
   "message": "A ghost lady standing where my bedside table should be. I had been asleep and reached to the table to get my water bottle when I felt a hand touch my arm. I jerked back and saw the lady holding out her hand to shush me, like a child. She was whispering to a man standing beside her. There was a lamp on across the room so I saw them very clearly. I shot out of the bed and hit ALL the lights and they vanished.",
   "created_utc": 1703267579,
   "score": 214,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehjzp3",
   "message": "I saw a legit UFO in 1985 (don’t laugh it’s true, I’m still shook) It literally was right above us and two other people with me saw it.",
   "created_utc": 1703265693,
   "score": 13,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei0o4w",
   "message": "A non supernatural/paranormal one.\n\nI was about 10, my parents and I were camping in Montana(in the winter, not my idea). We weren’t too far from a small town and decided to walk into town for dinner.  There was a decent enough path even with the snow. I was walking about 20 feet behind my parents just messing around like any kid. We had heard wolf howls the night before and early in the morning. As we were walking along we heard some closer howls, my parents kept walking while I slowed down a bit to listen. The howls stopped suddenly and that’s when I heard something I turned and looked at the bushes. There was a full grown wolf not 5 feet from me crouched in full hunting mode. I did the dumbest thing and took off towards my parents. I caught up to them and they kept me between them the rest of the walk. They didn’t really believe me and neither did most of the people at the restaurant except for an elderly hunter. He said the same thing had happened to him before.",
   "created_utc": 1703272109,
   "score": 78,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehnfz6",
   "message": "I was coming home and walking into our garage late one night when I noticed a woman sitting in the passenger seat of my mom's car.  That freaked me out at first.  I walked up to the passenger side and the window was down.  I asked her what she was doing in our car.  She said, waiting on her husband, in a foreign accent. \nI then went inside the house and went to my mom's room ... woke her up and told her about the lady.  She came with me to the garage, but the woman was not there anymore.  I walked over to the car and said, look the window is down. My mom said, one of my sisters must have left it open. She said, please roll it up and let's go to bed. I said, you don't believe me do you? I said, there was some Spanish woman in the car and she was waiting for her husband.  She said no... but it was strange because a Cuban couple lived in the house before us and the husband had passed away. (edit wording)",
   "created_utc": 1703267018,
   "score": 177,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehl1n4",
   "message": "When I was in college, I would go to Joshua Tree National Park to rock climb over spring break. Around dusk one night, my buddy and I were hanging around camp. A HUGE lizard walked onto a rock about 20 feet away. The lizard's body was at least three feet long without the tail. And probably about a foot thick. We watched it for about ten seconds before it scurried away. \n\nI have been to JT dozens of times, but I have never seen anything like that since.",
   "created_utc": 1703266095,
   "score": 80,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehchgh",
   "message": "Driving down small woodsy back roads with a friend and saw a pair of ghost legs walk across the road and disappear. We're dead silent for a good half hour, too scared to ask the other if they saw the same thing.",
   "created_utc": 1703262814,
   "score": 156,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kegyijn",
   "message": "Many years ago I did recovery for a funeral home and was sent to retrieve the remains of an elderly woman from a hospital morgue. As I loaded the gurney into the hearse I heard the voice a child say, “Tell them Mommy wants to wear her blue dress.”   \n\n\nI spun around and saw a young girl about 12 years old in a parochial school uniform smiling, then she waved ‘bye’ and disappeared. \n\nI told the funeral director who laughed, but days later he told me that a when a relative brought in a blue dress for the service they told him that the woman had lost a daughter at a young age when struck by an auto walking home from Catholic school.",
   "created_utc": 1703257238,
   "score": 206,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keh5bb7",
   "message": "SO and I saw an unidentified flying object. It was hovering over a lake we were sitting at. Was pretty close to us and made no sound. It was a rectangle. It was night so i thought I'm hallucinating, just to be sure i asked SO if he sees that thing over there, and he just said \"wait, you see it too?\"\nBoth of us thought we are hallucinating.",
   "created_utc": 1703260019,
   "score": 6,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehz1jg",
   "message": "I lived on the 5th floor of a very old apartment building while attending school. It was small apartment, 3 rooms, with a single entrance  I was laying in bed reading a textbook when I looked up because of some movement. It was a tall, slim middle aged man, dressed in 1800s clothes. He walked diagonally through the room, lifting the edge of his hat in greeting, and disappeared as he walked through the closet door. I had heard about weird things happening in this building and mentioned this to a neighbor who just stared at me.",
   "created_utc": 1703271473,
   "score": 134,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehima5",
   "message": "About 15-18 years ago when my grandpa passed away my grandma stayed in my parents house for a week or so. Our apartment was small and we had a 5m long corridor that connected three rooms (one from each end and one on the side with a doorway, but no door, i stayed at the side room and my grandma on one end, my parents on the other end). Every single night that my grandma stayed with us in the apartment at around 12-01 o'clock i could hear heavy steps that made the floor creak. The sound was like someone was stepping on sand wearing boots. I could hear the steps behind the wall and everytime the steps would get close to the doorway, it was dark but i could still see, so when the steps reached the doorway i would see no one but still could hear the steps moving further towards the room where my grandma was sleeping. I was a little kid at that time so the situation would make me shit my pants, i was too scared to move or to make a sound. And the next day i didn't tell my parents (God knows why). But after a week, when my grandma left, i stopped hearing those steps and when i told my mom she jokingly said that it was my grandpa looking for our grandma.",
   "created_utc": 1703265167,
   "score": 88,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei6iov",
   "message": "When I was 15 my Mom passed away after a long battle with cancer. That night I woke up to a figure sitting at the end of my bed. I couldn’t make out any features but by the silhouette I could see it was human in nature. I kept trying to talk but couldn’t really form words. I remember wanting to sit up but I couldn’t, it was like being frozen in place and I felt too sleepy to keep my eyes open. As someone who was and is scared of the dark, I should have been terrified but for whatever reason I felt safe and okay. I would have dismissed this all as a dream except the next morning over breakfast my sister, who was 10 and had been stoic as fuck throughout my mom’s illness, nonchalantly told me that Mom had visited her last night. She basically described the same scenario I had experienced. Years later other family members told me similar stories about being visited the night my Mom died. \nMy dad never believed me though.",
   "created_utc": 1703274417,
   "score": 21,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei7621",
   "message": "When I was 7, my 4 year old sister went missing from our home during the night. I looked for her everywhere and then went to bed! Didn’t tell my parents, went to BED. \n\nIn the AM, she reappeared at breakfast and when I asked her where she was, she said she went to play with her friend. \n\nFast forward a few weeks, I hear giggling outside our bedroom window at night. Again, my sister is no where to be found.\n\nFollowing the giggles, I lifted myself up to see out the window just as (what I can only describe now) a filthy, black-eyed child staring back at me growling, also lifted itself up. This being smelled like hot garbage, btw.\n\nTo this day my sister denies any of this and says I must’ve been dreaming…..",
   "created_utc": 1703274672,
   "score": 131,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehd9ou",
   "message": "Some years ago I inherited the war trophies of my great uncle. These included what I have since found out is called a good luck flag, sword that was dated to be several hundred years old, and a nambu pistol. I had them all displayed initially,  but weird shit started happening. One day when I looked in a mirror and for a split second saw what looked like a Japanese solider staring angrily back at me. I took them down. Still have all 3 and do shoot the pistol a handful of times each year. Get a weird feeling of being watched whenever I pull out the flag or sword to show someone",
   "created_utc": 1703263115,
   "score": 66,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehpiud",
   "message": "I watched a ufo flying random pattern for an hour when I was 12. It split into 4 objects, and they continued.",
   "created_utc": 1703267809,
   "score": 128,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehqd9o",
   "message": "In my neighborhood a child and apparently mother and father, naked with books in hand and staff walking one behind another.  Called non emerg as I feared for their safery.  Appeared aome type of psychotic episode.  Keep looking cause did not believe my eyes at first glance",
   "created_utc": 1703268133,
   "score": 169,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei5vtn",
   "message": "Not something I saw but rather heard. When I moved out of my mom’s into my own apartment with my son a couple of years ago, I was in my room standing in front of my dresser putting my jewelry on and my son was sitting behind me on my bed. I think we were getting ready to leave and he was just hanging around in my room waiting on me. All of a sudden I heard what sounded exactly like my late cat’s very distinctive sounding meow, and I thought to myself “weird..that sounded like Lucy” and right away my son said, “that sounded like Lucy” and I whipped around and said “omg right?! You heard that too!” And we’re both convinced it was Lucy letting us know she was still around🥹❤️ her meow didn’t sound like your typical cat’s meow. It was very dainty and throaty and soft. She had died recently from heart failure it was really traumatic I rushed her to the vet in the middle of the night frantic and she died there. I feel like I didn’t properly say goodbye everything was so hectic and happened so fast.",
   "created_utc": 1703274164,
   "score": 255,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei2854",
   "message": "There's a spot in San Diego where a ton of sea lions give birth in a cove that people can stand above and take pictures and watch. It's relatively well protected thanks to a ton of rocks at the shore but there's also a massive drop off that reconnects to the larger ocean. When I was just out of high school I was there w my ex and just having a normal, regular time. Out of complete no where comes this massive great white that just devours this sealion from the drop off and disappears back into the depths. I'll never forget just the pure frozen terror I felt that this killing machine was that close to me and no one ever saw it.",
   "created_utc": 1703272726,
   "score": 53,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehinwv",
   "message": "I saw a “dog ghost” twice in the same area, several years apart. I don’t believe in ghosts, I’m just not sure what else to call it. It was a white, slightly translucent, kind of glowing dog, and both times it moved across the same hillside. It was running, but the speed it’s legs were moving did not match the speed it was moving AT ALL. Imagine projecting an imagine of a dog running 10mph but moving the image across the hillside at 30mph. Best way I can explain it.  \nI would assume it was some trick of the light, but it happened in two different seasons and at two different times of day. So I suppose that’s possible but seems less likely.",
   "created_utc": 1703265185,
   "score": 1,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keh33y2",
   "message": "Driving through the Montana mountains at 3am I saw a large hairy figure next to a tree. It appeared to be over 7 feet tall and immediately turned and disappeared into the woods. Was it Bigfoot? Perhaps.",
   "created_utc": 1703259141,
   "score": 115,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehy0wv",
   "message": "I used to work a retail job in an old church building that was said to be haunted. Doors would slam, lights would flicker, things would move, etc.\n\nOne day I was organizing crap down in the basement with a coworker when she started to freak out. I turned around, and behind some boxes, she found a hole in the drywall that exposed a cavity in the stonework behind it. In the hole was a small, ornate wooden box. It was an empty coffin designed for an infant...\n\nI told my boss about this and the box was promptly sold later that day to some unknown buyer for a whopping $7. All of the weird paranormal stuff ceased shortly after...",
   "created_utc": 1703271078,
   "score": 23,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei2sxo",
   "message": "Didn't see it but heard it. My friends and I got a cheap set of walkie-talkies from Walmart and were playing around with them in the middle of the day. There's a bit of silence as we're trying to figure out the volume and out of nowhere there's a male voice saying \"mayday mayday mayday\" that comes through all of our walkie talkies and it definitely sounds like it from one of those aircraft headsets. We try to answer back but there's no response. I called non emergency but they said there weren't any reports of distressed aircraft or ships and even if there were, they couldn't do anything about it.\r  \n\r  \nAlternatively, a couple months later I saw a plane with an engine on fire go over my campus but apparently no one else did.",
   "created_utc": 1703272952,
   "score": 244,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehl1d0",
   "message": "When I was about 13. I was laying on my bed, and something punched twice from underneath. Like solid punches I could feel through the mattress. Loud thuds. Almost lifting it. My dad was downstairs watching tv. First thought was to look under the bed for my brother. There was no one under there. And there wasn’t enough clearance to swing a proper punch anyway. Still don’t know what happened to this day.",
   "created_utc": 1703266092,
   "score": 1,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei3b6o",
   "message": "I'm not even sure that I believe me. I live by an open field and I had taken my dog out to use the bathroom. I was out by the field (it's right past my backyard) and noticed something floating down from the sky. It was weirdly human shaped. I took my eyes off it reluctantly to see if anyone or anything was in the field, the field was empty. (this was after harvest so easy to see the whole thing) I look back up and watch the figure? disappear below the tree line, then look back into the field. And there was a person. In the field. That was empty before. I watched for a few minutes to see if they had anything, like a kite or something, but they didn't. It was so weird.",
   "created_utc": 1703273152,
   "score": 140,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei3g1j",
   "message": "January 1, 2000 \n\nJust past midnight, I was ringing in the new year with the family when I glanced out the living room window and saw a group of people wearing black robes and hoods passing by in complete silence while holding lanterns. \n\nNo one else saw them but me, but it’s something I never forgot. I often wondered who they were.",
   "created_utc": 1703273206,
   "score": 159,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehevvw",
   "message": "I saw a person disappear in a flash. I was watching this guy on his phone cuz his jacket was cool and then poof he disappeared it was so unnerving",
   "created_utc": 1703263740,
   "score": 186,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei0ae8",
   "message": "I saw the Mothman by the lake in Chicago a few years back, but the craziest part was he imposed a great sense of ease I’ll say upon me. Almost like he was looking out for/over the area.",
   "created_utc": 1703271961,
   "score": 239,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei6wcn",
   "message": "DC, late 90s: was out walking after dark, avoiding  an abusive situation at home. Turned a corner and came upon a lifeless body and 3 adult males standing stunned. It vaguely looked liked there was a knife in the neck of the body, but I didn't  focus enough on it to be certain. I walked quickly away and turned onto the next available path, then sprinted. I went out of the neighborhood by bus and keenly read the local news for a stabbing victim for weeks, but never found anything. Years later when there was searchable databases for police reports by area, I looked and found nothing in the area for that date.",
   "created_utc": 1703274567,
   "score": 193,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehn806",
   "message": "On my exchange trip, we visited the Lunt-Fontanne/Ten Chimneys house in Gennessee Depot. I got talking to a nice older lady that told me so many facts about the couple, and I assumed she was just a tour guide. I then saw the same woman in pictures on the wall, as the real tour guide explained that the lady in question had died in 1983. Turns out I'd had a full conversation with Joan Fontanne, or rather, her spirit.  She was a nice lady, and I like knowing I \"met\" someone from Hollywood's Golden Age.",
   "created_utc": 1703266932,
   "score": 4,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei6o33",
   "message": "\nI once saw someone without a head at a church when I was a child. It happened during a mass, my family and I were seated on the right side. On the left side of the row, I noticed a girl (judging by her clothes) without a head. I've often wondered if I was the only one who witnessed it.",
   "created_utc": 1703274477,
   "score": 187,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei74zm",
   "message": "A buddy and I were watching a bad horror movie back in vhs days (Witchboard starring Tawney Kitaen). Sitting on his living room couch in a dark house when a man walked past the tv and down the hall and disappeared . I asked my friend if he saw it too and he said yes, it’s the ghost that lives here.",
   "created_utc": 1703274661,
   "score": 117,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei98ok",
   "message": "My grandpa died suddenly a few years ago. I’m not spiritual but my grandmother is anglican. I woke up one morning having had a dream where I was at a party at my grandparents house and my grandfather was there. He hugged me, told me he loved us, and said “I can’t tell her myself, but tell gran I love her and I’m here with her”\n\nI woke up and thought wow, weird dream, I’ll have to tell my gran about it when I get home from school. So I go to school and rush over to see my gran as soon as I get back, and I walk into her living room and she’s crying on the couch (very usual for her to cry like this), I ask what’s wrong and she starts telling me about what a horrible day she’s had, and she finishes it all off by saying “and the worst thing is, I haven’t seen your grandfather in my dreams yet, why won’t he visit me?” \n\nIt really was a jaw drop moment for me. My dream, which came before her terrible day, was the answer she needed. To this day I don’t know how it could be possible unless my grandfather really did know about that day, and really did visit me. I’ve always been atheist (like my grandfather) but since that day I’ve begun to believe that at least in some way our loved ones aren’t gone after death.",
   "created_utc": 1703275498,
   "score": 212,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keh4cvw",
   "message": "I was in a park that was connected to a forest with a few friends (it was 8pm in November so it was pitch black outside) and one of my friends (we’ll call him jasper) said “I’ll give who goes into the woods a fiver” me and the common sensed all said no, but jasper just walked down the muddy hill into the woods. I activated my flashlight so I could see him, and out of the corner of my eye I see something that keeps me up at night to this day.\n\nIt was a tall man, with a prison like shirt and trousers. He was skinny and was 7ft approx tall, and had grey strands for hair. He stood grinning demonically at the tree, when all hell broke loose when the man made direct eye contact with us. I stood staring at him like Dustin from stranger things as I screamed “JASPER, FUCKING RUN!!”\n\nAnd fucking run jasper did, and in 4 seconds he was with us.\n\nI tried that horror movie gimmick where the light goes out and when it comes back on the thing is gone, only it was with my flashlight.\n\nAnd as I expected, the man was gone. Although I saw him run into the woods, My friends yelled “WHAT THE FUCK, YOU GAVE US A HEART ATTACK!!” \n\nI know what I saw. They never believed me.",
   "created_utc": 1703259642,
   "score": 108,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehj17d",
   "message": "[deleted]",
   "created_utc": 1703265329,
   "score": 88,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehs8ih",
   "message": "I knew this guy from childhood. And his wife from McDonald’s. We met up and I invited him over for a few beers. Apparently he was addicted to meth, and Felecia I already knew died with suspicious circumstances. He gets a couple beers in and confesses to me he killed her. I asked a few people later what I should do. They said if the police don’t care, it is what it is, he’s on meth, who knows. No one cares he confessed to me he murdered his wife.",
   "created_utc": 1703268845,
   "score": 129,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kegsmfj",
   "message": "I was out one night during a school trip. I was near a forest. And felt like I was being watched. Rumors said, the place was haunted. Not that I believed it. But I was still cautious. \n\nI grabbed a multitool and flicked out the pocket knife.  Then I grabbed my flashlight and looked about. Nothing. But I couldn’t shake the feeling. But then. I looked a darker area of the camp. Near the edge of the forest. I couldn’t see anything but I felt like…. Someone, not something, someone, was there. I couldn’t see them. So I shined my flashlight into the darkness. But… nothing. Or so I thought. \n\nThere was a quick flash of movement out the corner of my eye. Someone was there. But they stayed in the shadows. I kept my eyes out for ages. Waiting for whoever was out there to make a move. But… nothing. But I could feel. Something was there. Then I saw it. It was a dark figure. It kept moving through the forest. It never approached. But someone was definitely there. \n\nI slowly went back to my tent. But stayed up the rest of the night. My multitool never left my hand the whole night. But eventually I finally passed out. \n\n\n\nThis. Was then followed by a nightmare. A horrible one. I was trapped in a maze. This thing was following me. It’s form was shifting but it felt… human in nature. It would follow me slowly through the maze. When it cornered and caught me. This made me wake up… but I wasn’t awake at all. I found myself waking up back in the maze. This cycle repeated over and over for thousands of times. Waking up in the maze again and again. \n\nWhen I finally awoke. I was scared that it was still the nightmare. When I confirmed I was awake… it felt like something was still there.",
   "created_utc": 1703254643,
   "score": 117,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiagko",
   "message": "I was traveling with my 6 year old (at the time son). We stopped in Gatlinburg for the night, at a hotel I had stayed in several times before. Around 3 am, I heard a very loud pounding on my door. I jumped up, ran to the door, opened it, and there was no one there. The hotel was one of those old style hotels where the doors open out onto an open walkway, so I could see in every direction, no one around. I just thought it was some plumbing issue, and was surprised that my son wasn't awakened. I laid back down, and moments later, the pounding occurred again, this time continuing until I opened the door. Still, no one there. I thought that i must be asleep, but I was scared shitless. Still, my son hasn't budged.  At this point, I am sure that I'm wide awake, and I turn on the TV. The Olympics were on, so I was distracted for a few minutes. Then the pounding came again, and as I ran to the door, I could see the door shaking with the force of the strikes. As I grabbed the door handle, the pounding moved to my right, and down the wall, where it ceased. This kind of reassured me of my plumbing theory, so I was actually a little relieved. I laid back in bed, TV and lights still on, my son sound asleep next to me. At this point something bit me under the sheet, on the inside of my right thigh. I threw back the covers, and saw a visible human bite mark on my leg. Obviously, I stayed awake the rest of the night. When we awoke, my son had heard nothing. I met my brother and his two sons, who were staying next door to us, and he asked me what that pounding was last night, so I knew I wasn't dreaming or otherwise hallucinating. I told him what happened and showed him the bite mark on my leg. We packed the car, and left. I have since stayed in this motel again on several occasions, and never had any sort of untoward incident. I have no explanation.",
   "created_utc": 1703275985,
   "score": 117,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei38k6",
   "message": "Some years ago I rented an apartment which was part of an old mansion. It was cut in half to make three apartments, one at the front was unusable and abandoned so it wasn't partitioned. \n\nYou had to go through a long hallway to see each door. In the 2nd one lived a rather young couple. I lived in the last one. \n\nMy door opened to a small patio with a stair to go up to the roof, passing a small room in a state of disrepair, to the side there was a door to the terrace.\n\nDirectly under the abandoned room was the kitchen which was connected to the bedrooms via doors, with the bedrooms having no windows but big twin doors that did had windows.\n\nSo one day well past midnight I was thirsty so I went to the kitchen through the patio trying not to bother my sleeping family in the other room. So I open a twin door and I see a canine head looking at me from the room above the kitchen. Thinking that my dog had somehow went through the terrace door I aim my phone camera to use the zoom because it was dark and the room had no outside light.\n\nWhat I see instead is a white dog head seemingly floating, looking at me with empty black eyes from INSIDE the room.\nUntil it moved slightly towards the open window which revealed it had black fur on it's big body. Easily standing 2 meters tall. \n\nI snapped a very bad photo and nopped back to my room.\n\nThis all happened in far less than a minute but felt like years. I no longer live there. \n\nEdit: Here's the zoomed in pic https://imgur.com/tHKdP9d",
   "created_utc": 1703273124,
   "score": 13,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei1qvg",
   "message": "Nearly 7 foot tall Skinwalker walking along the side of the road within 70 feet of my car. Dropped down all fours and sprinted across the road in front of me, looked the square in the eye. Not making it up.",
   "created_utc": 1703272535,
   "score": 23,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehyto0",
   "message": "[deleted]",
   "created_utc": 1703271387,
   "score": 10,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keidmtw",
   "message": "My aunt and I were pretty close and she was pretty sick one time when she came to live with me. We talked about death and I told her that she could totally haunt me if she felt like it when she was on the other side. Just joking. \n\nOne thing about her is she loved her soap operas so much so that she'd make me watch them with her when I got home from work. \n\nWell she died and one night I was explaining to my husband how she'd always make me watch her stupid boring soaps. On our wall just above our TV we had some framed pictures and some flags with the 6 inch wooden handles fully tucked behind the frames so the flags were secure. After I spoke so badly about those soaps one of the flags popped out from behind one of the frames and landed in front of the TV.\n\nMy husband and I just stared at each other. That was impossible to happen without force.",
   "created_utc": 1703277267,
   "score": 103,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehopt9",
   "message": "An exorcism. My sons remember it as their dad did it. He was a minister. Guy comes into the church, tells the minister that he knows he’s possessed. Minister did everything he could to get the guy to get therapy which he had already done. Said he would kill him self if it wasn’t done. I’ve never seen anything like it before. I won’t go into a lot of detail but a storm started over the church but nowhere else. The windows bent inwards but didn’t break. Afterwards, no damage. Something came out. He was fine afterwards.",
   "created_utc": 1703267506,
   "score": 46,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei6lps",
   "message": "My mum can sense spirits and such. \nMy ex boyfriend killed himself a good few years ago now, and one evening, my mum told me she could sense him. I turned on the voice recorder on my phone and me and my mum shared our memories of him.\nWhen we played it back, we heard him replying to something I said, telling me that he remembered the memory I was talking about.",
   "created_utc": 1703274450,
   "score": 102,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehv4gh",
   "message": "me and a couple friends from high school broke into the overbrook asylum in cedar grove, NJ. it was considered one of the most haunted spots in the state before it got torn down and converted into a park and condominium location (i’m not religious but building multiple homes over the bodies of thousands of people felt very wrong and not a good idea.)\n\nwe slid under the fence after the patrol vehicle went on it’s way and went into one of the main buildings where they housed the criminally insane and they performed lobotomies, EST, and a lot of outdated treatments. we found a lot of old medical documents dating as far back as the 20’s, specimen jars containing hands, eyeballs, kidneys, slices of brains, among various other body parts. all human. \n\nthe worst tho was when we went towards a staircase that led down to the underground tunnels that connected the campus. every building was connected by a maze of tunnels meant to trap escapees and it was rumored only those who knew the map could ever make it out. many people tried to escape through them but got lost and froze to death due to the harsh weather. we all stared down there questioning if we wanted explore until we heard an echoing roar coming from it.\n\n could’ve been a homeless person, could’ve been freaking pipes, but 16-17 year old us were convinced it was a ghost and anyone old us told us it was either option 1 or 2.\n\ni’ve seen enough horror movies to know you don’t build houses in cursed land and i’ll never buy property there, as nice as it looks and is advertised",
   "created_utc": 1703269954,
   "score": 79,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei4zcy",
   "message": "My uncle was driving in a nowhere road and he saw a child waving his arms on top of a car that’s been submerged in a lake. He shouted at him to get him help , but the kid kept waving his arms and not replying. Then when my uncle went back to the truck to get a rope or something the child and the car were gone. It was weird",
   "created_utc": 1703273809,
   "score": 113,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei8s99",
   "message": "Went night swimming in the Ottawa river with friends. A MASSIVE fish touched me and I saw a large fin, it looked like it was the size of me. No one else saw it, or seems to really believe me",
   "created_utc": 1703275317,
   "score": 168,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keicljy",
   "message": "One night, very late and in the middle of the winter in Southeast Alaska, I had to go outside to my car to grab my phone charger. It was so quiet outside. Everything was very still and motionless. I remember I wanted to take in how quiet everything was, so I just stood outside my house and embraced the silence. Then out of nowhere, a massive wind blew through the forest across the street in one particular spot. Then, I heard a deep growl, like some sort of animal was ready to attack. I was so freaked out that I ran back into the house and did not charge my phone that night lol. Part of me thinks that something, or some sort of spirit was angrily moving around outside and I just happened to witness it.",
   "created_utc": 1703276846,
   "score": 132,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei40kl",
   "message": "So there I was, in school, transitioning between 1st to 2nd period.\nI get seated , start pulling stuff out of my bag, I realize that there is a journal sitting under my chair. \nI figured the dude who had this class in first period left his journal, technically, I was right.\nBut that’s not the scary part . \nI open the journal to see if there was a name in it so I could return it to its rightful owner and the content of this journal consisted of a list of people \u0026amp; what third period class they had. \nThis dumb ass was dumb enough to label the list a “hit list”. \nSo I do what’s right and I go directly to the administration and present it to them.\nThey did their due diligence alongside the PD and investigated this list . Spoke to local detectives and all.\nCome to find out this young man had purchased a rifle two weeks before this . \nOnce we found out, we put two and two together and figured that he had plans and the means to shoot the school.\nThere’s a part of me that feels as if I may have prevented a school shooting and I hope that that’s the case… because I was on that list. \nHow in the hell he managed to spell “Jacob” wrong I will never know, it goes to show how idiotic he was. \nThis kid was bullied pretty often for his obvious stupidity and special ed accommodations. \nI made it on the list byproxy because I was friends with one of the kids that gave him shit…. But don’t feel bad for him. He was no angel himself. \nHe was immediately expelled, as for criminal charges I’m not sure where he stands. He was just here one day and gone the next.\n\nThe part that most people have trouble believing are the odds that he just so HAPPEN to forget his journal, not only in the same class that I had after him but in the exact seat. The cherry on top is that I was an occupant of that list. Not to mention I’m typically not the nosy type. I just want to know who to return it to 🤷🏻‍♂️. \nThe odds of this happening are so fucking slim that I can’t even blame people for calling bullshit. \n\nBut I rather people not believe me \u0026amp; have possibly prevented a school shooting than the worst case scenario occurring.\n\nTLDR \nI found a list of intended targets for a school shooting and I was one of them.",
   "created_utc": 1703273429,
   "score": 29,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei31yw",
   "message": "One morning when I was about 10 or 11 years old, I woke up to what felt like my bed moving. We lived in an old farmhouse in Maine built in the 1830s. I was obviously terrified, but after a little bit I feel asleep again. It happened again, woke me up, now I’m REALLY terrified. \n\nI used to wait to hear my mom get up and start making tea before I would get up for school, so that’s what I was waiting for. I didn’t know what time it was though. It kept happening, I was wide awake now while it was happening. Finally I heard my mom downstairs and I built up all the courage I could to come out from under the blankets and ran downstairs and told her. She didn’t seem fazed at all, just told me to start getting ready for school. I’m sure she thought I was having a nightmare or something. \n\nAnyways, I ended up going back up to my room and turning the lights on, my bed was completely pushed maybe 4-5 feet from the bottom across the floor (this room had a rug, it wasn’t sliding on its own). Knowing what happened and seeing the confirmation after still creeps me out until this day. It’s the type of thing no one would really take seriously unless it happened to them.",
   "created_utc": 1703273052,
   "score": 54,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei8sz1",
   "message": "Forgive me if you've read this before. I've posted it a few times and I'm just going to copy paste. \n\npara-weird-normal-blog\nThe Stickman Figure Phenomenon\nThe figures have been described as unusually tall, black in appearance, lacking any facial or bodily features and very lean. Their appearances have been documented on message forums and websites since 2008 and often are sighted around dusk or dawn. Reports have had them walking on the sides of roads or in alleys and they seem to follow the unlucky person who witnesses them. \n\nAnother strange thing about these stick figures is that they make no sound and cast no shadow. Rumour also has it that the figures are often charged with some form of electricity (most often reported as static). Source.\n\n\nI had some experiences as a child that I would consider paranormal. After my teenage years I never really opened up about them to people, because of how crazy it sounds. It wasn't until several years ago that I started researching on the internet and found I wasn't alone in seeing these strange creatures. I know it might sound silly to some, but this is what I experienced: When I was growing up I had a best friend who lived down the street. We lived in a quiet, small town where her dad was always working. I would walk to her house everyday after school and we would often take walks, walk to the liquor store to buy candy etc. I would often see a stick man following us, peeking out from behind her coach etc. He was all black and changed sizes. Sometimes the size of a small cat, other times taller than a normal size man. I felt very scared of him and felt he was mischievous at best, perhaps evil, I finally got the courage up to tell my best friend and she admitted to seeing him too. I always got the feeling he was the same one every time, not different stick men. One time he appeared in the shape of a stick figure horse (like a bad child’s drawing.) I always believed him to be somehow following me and watching me. Until, when my best friend passed away suddenly our senior year of high school. She had a genetic heart condition that nobody (including herself) had known about. I’ve never seen what we called “stick man” ever since. I believe now perhaps he was some form of grim reaper awaiting his time to take my friend. I don't know if that's really the case, but it seems odd the sightings of him disappeared after she passed.",
   "created_utc": 1703275325,
   "score": 47,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiajxx",
   "message": "When I was 12 years old, me and my buddy from the same building used to ride bikes together.\nWe used to store the bikes in the basement. Which was very creepy and dark. We always went together to retrieve the bikes. One morning I was behind her with the keys and she asked me to give them to her. I saw a hand waving at us through the frosted glass, I showed it to her and she saw the same thing, we didn't utter a word and at the same time started to run upstairs screaming. Their apt was on the ground floor, we were screaming at her parents and described the same thing pretty much at the same time. Her father went downstairs immediately and opened the basement door and looked around. The basement was very small, there was no other escape route from there. Noone was there, and noone believed us. We never stored our bikes there ever again.",
   "created_utc": 1703276022,
   "score": 58,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keifpxz",
   "message": "My high school boyfriend’s grandma passed away nearing the end of mine and his relationship. I was her caretaker fresh out of high school up until she died, we were extremely close. (she was a very religious woman. Prayed everyday multiple times a day. My boyfriend and I were both atheist at the time.)\nOne night my boyfriend and I and 4 of his friends were sitting at his dining room table talking about her and the afterlife and all of our opinions about death. \nIn the middle of our conversation, a green/blue orb appeared in the corner of his kitchen and shattered with a popping sound of dropping a glass jar. We all looked at each other in complete shock and never mentioned a word about it again. It shook all of us to the core. \nI still don’t know what it was or how it happened.",
   "created_utc": 1703278106,
   "score": 55,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keih31j",
   "message": "Moved into a house that is almost 100 years old, and after about a year of living there one day I was sitting alone painting some figurines when Alexa blurts out \"Yes, Diana. It is Jimmy's favorite song\" and then proceeds to play Beethoven's 5th Symphony. Diana is the name of the lady who previously owned the house and has been dead for about 5 years. Jimmy was her cello-playing husband who, after Diana died, moved into a senior assisted living community.",
   "created_utc": 1703278652,
   "score": 150,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehwpp5",
   "message": "Copy paste from a post I made Some time Ago.\n\nNot that scary, but my mother has always had this extra sense. She can sense spirits, and used to see them as a child.\r  \n\r  \nThere's nothing like chilling at someone's house, or moving out of one, and your mother saying \"There was some energy/spirit/shadow/evil there\"\r  \n\r  \ncoincidently, she approached me about this apartment we lived at saying it had bad energy. The night before, I dreamed of a shadow screaming a loud metallic noise while I couldn't move, and my parents screaming from their room. When I woke up (I slept on a chair in the living room, their bedroom was visible) I looked at their open doorway, and saw the shadow looking at me, then peel behind the doorway.\r  \n\r  \nI didnt tell her about the dream beforehand",
   "created_utc": 1703270569,
   "score": 25,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei98va",
   "message": "A friend and l toured an old plantation, we were both in our mid20s.\n\nI got distracted by something and when we turned a around , we didn't see the tour group. \n\nWe thought they'd gone into the nearest building,  so we went in there. It was a long, low building with iron circles set into the wall. The group wasn't there,  so we turned to leave. We both heard a a loud 'crack' sound. Neither of us knew what the noise was; we looked back,  but saw nothing. \n\nWe walked until we found the tour group and rejoined them. \n\nAfter going through a big carriage building we ended up in the building we'd seen by ourselves. \n\nIt was the slave quarters, and the rings set into the wall were for chains. The tour guide picked up a whip while they were explaining everything and cracked it.\n\nThat was the sound my friend  and l had heard.",
   "created_utc": 1703275500,
   "score": 75,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keic6nb",
   "message": "When I was a kid, late 90s, I saw a very large black cat.  Like larger than a German Shepard in northern PA while camping with my family.  To this day I remember not really registering what I saw but it was the tail that got my attention for how long and black it was, like a cats tail,  no one believed as PA doesn't have mountain lions.",
   "created_utc": 1703276677,
   "score": 29,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keicyfm",
   "message": "My bf and I lived in an old attic apartment in Chicago, and I’m pretty sure my boyfriend got possessed in front of me. He fell asleep all of a sudden around 3 am and when I tried shaking him awake he started mumbling in Polish (he doesn’t know polish at all), would NOT wake up, and when I asked him what his name was thinking he was having a stroke he said “Kathleen” and kept mumbling in Polish. So I asked how old he was and he opened his eyes, looked straight at me, said “you’re asking too many questions,” and fell back asleep. He had no recollection of it after he eventually woke up.",
   "created_utc": 1703276993,
   "score": 56,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kegynr6",
   "message": "can't technically see it, but i'm tired of people saying that we're just \"overreacting\" - our fucking future.",
   "created_utc": 1703257299,
   "score": 39,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kehx4k9",
   "message": "Was in Florida sitting with my best friend on the balcony at 2 in the morning just chatting about life. Suddenly out of no where, what I can only describe as a glowing neon green orb appeared in the sky.  Then it started falling towards earth and my friend and I started FREAKING out. Then after falling for about 3 seconds just as fast as it came it disappeared. We have absolutely NO idea what it was. I looked up if there were any comets that night and the following morning on the local news to see if anyone else saw it. Nothing.",
   "created_utc": 1703270729,
   "score": 14,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keh20k2",
   "message": "My wife Making out with my cousin Jeffrey.",
   "created_utc": 1703258697,
   "score": 32,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keif1k5",
   "message": "This is like 5 years ago. I used to live in a very violent neighborhood. Sometimes it felt like a literal warzone. I called 911 so many times, but this one time in particular was the scariest.\n\nI was asleep, and woke to the sound of a woman screaming in terror. It's one of those sounds that must be embedded in our DNA to recognize bc that was the sound of a woman screaming over and over for her life. So she screams maybe 3 or 4 times, then I hear a single gunshot. Then silence. \n\nThe whole thing took maybe 3 seconds. From asleep to 3 seconds later, I was shaking terribly and dialed 911. Told them what happened. They sent a patrol car, but of course found nothing.\n\nFast forward a few days, I'm leaving home through a shared alley. The alley is blocked off by a cop. Cop says that a woman was killed in the house next door to mine, then her body was taken into another county and burned. I read an article about it in the paper, and it said she was stabbed to death.\n\nSo I was left wondering if she was a tually shot and the burning of her corpse made it seem like she wasn't, or if maybe it was a double murder, or if there were just two completely separate murders within a day of each other, all within my earshot. Still shudder thinking about these poor women.",
   "created_utc": 1703277836,
   "score": 103,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiimya",
   "message": "I love vintage items and naturally shop in antique stores often. A few months ago, I was in an antique store near my house and noticed a humble but beautiful dresser with a tag that read, \"made in 1800\". I opened the top drawer to inspect it and got this very strong, sudden... vision? I don't really know what to call it. Suddenly I was seeing things through the eyes of a woman in the top floor of an old farm house, standing in front of the dresser, opening the drawer. I can tell you what the room looked like around \"me\", what she (I?) was wearing, and I got a sense that she was shorter than me (I'm 5'7, so slightly above average height for women in the U.S.) I immediately burst into tears. It was overwhelming. I've never had anything like that happen to me before.",
   "created_utc": 1703279283,
   "score": 188,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei87ci",
   "message": "Probably doesn’t count but my dad shoplifted a pair of earrings I was looking at for me for Christmas. He did it right in front of me. \nI told my mom and she didn’t believe me my sister was there and said she didn’t see it (she also didn’t see him BUY them) so I felt kind of gaslighted. \nOh well. They were nice earrings.",
   "created_utc": 1703275084,
   "score": 43,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiezx6",
   "message": "I saw a single, rotating parrot wing materialize in mid-air for a split second. I was attending a class at a metaphysical bookstore at the time. The owners said that it was just the shop ghost saying “hello.”",
   "created_utc": 1703277818,
   "score": 4,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keih8yl",
   "message": "More to the “creepy” side than scary, but here we go.\n\nI once saw a prominent anime voice actor in his 50s kissing a fan in an autograph line in a way I wouldn’t kiss my mother. He has had a ton of other allegations of sexual assault and harassment made against him over the years, and I feel stupid that I didn’t believe them until I saw this. There are still people who defend this creep to this day - and I guarantee based off my experience and those of too many others who have worked with this guy - the only ones who do defend him just haven’t been around him long enough.",
   "created_utc": 1703278718,
   "score": 30,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keihflx",
   "message": "An orange monster looking thing on all 4s with a gaping mouth. I was never a believer of things like that until I saw it. I’m a 26 year old boring mother who likes reading, watching sitcoms, and baking bread. Nobody believes me when I tell them. I reached out to a paranormal investigator who helped do some research on the big field I saw it in. Turns out it used to be a sacred ground for native Americans and connects to an underground cave system. The native Americans also had a name for a similar creature. I’ll never forget it’s long arms and legs bent at such sharp angles. Or it’s mouth. Fuck.",
   "created_utc": 1703278795,
   "score": 4,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keihj0b",
   "message": "Bigfoot, or some kind of scarily similar animal, in rural Missouri. I don't like telling the story because people think I'm crazy, but it was one of the most terrifying moments of my life.\n\nI've had dreams about it and I regret more than anything not trying to get proof in that moment.\n\nOh well, I know what I saw and my grippy socks are warm.",
   "created_utc": 1703278833,
   "score": 3,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kegrd88",
   "message": "[removed]",
   "created_utc": 1703254062,
   "score": 5,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei02ud",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keivcxd",
   "message": "I used to see an incredibly angry man and a crying woman in my bedroom every night as a child until my parents moved me into their room and they went into the loft conversion. Anyway, that room is now our study and my dad has experienced some ghostly stuff (phantom touches, people calling his name, things like that) but always puts it down to explainable events, but it became almost a running joke in the family that every time we heard a noise in the house we’d say “oh that couple are back again!” And laugh. \nFast forward to my 16th birthday, my grandmother has gotten out her wedding album because she married on her 16th birthday and she wants to show me her dress and stuff. And there they are. The man who used to scream at me and spit at me and curse at me was my great great grandfather, and the crying woman who would always beg him to stop scaring me was my great great grandmother. I swear it was them, but no one believes me. There are stories of him being a horrible man and she was supposed to be a very timid woman so it fits. I also knew their nicknames and curse words that my parents had sworn they’d never told me. I knew facts about our family, weird idioms he used to say, stuff I shouldn’t have known. But I do, and to this day I’m convinced they’re stuck in that house for some reason.",
   "created_utc": 1703284284,
   "score": 68,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiw5xe",
   "message": "One person believes me, some of the ones that matter to me do not but here goes:\n\nI will start off with I’m not a religious person but I’m not an atheist, I suppose spiritual is the term used in these situations. \n\nMy grandmother who essentially raised me for the first 5 years of my life because both of my parents were working two jobs to try and make it, was born and raised in El Salvador, she had my mom, my aunts and uncles, and even took in some orphans who had fled the terrorists or had become orphans because their parents were killed due to the civil war and I grew up calling them aunts and uncles just because she raised them. She was a fucking bad ass, she saved my mom from being sold into human trafficking by walking for three days and finding where my grandfather (whom I never meet and am glad I didn’t) was hiding my mom before he had sold her and took her home, then when she realized that her kids were going to get killed one way or another staying in her home country, she got the 18 of them including herself to go to the US, 14 of them made it across. My mom was the second oldest, she was 19, the rest were 15 and younger. \n\nWhen she died it hit me harder than anything, when I was a kid I would take advantage of the fact that she didn’t speak English, so she would try to tell my mom the things I said and I would say, “she doesn’t know English mom, of course I didn’t say that she’s just confused,” I mean I was a little fucking prick. \n\nThen when I was in highschool she got moved to a retirement facility, she was being abused etc and I just couldn’t go visit her, I have a horrible hatred/fear of medical facilities, and I didn’t want to see her at one of these places even though my mom said she kept asking for me. Anyhow she got put on hospice and she was at one of my aunt’s houses, she broke down when she finally saw me and I broke down and started apologizing for all of the times I wronged her and that I didn’t see her, and this frail woman just smiled and said, “you were my first grandson, all of those times that you said and did those things do not matter because it never made me feel any less for you, you are my heart and I will always be part of you and you of me,” of course all in Spanish and it eased the pain a little. \n\nShe died 48 hours later, I was the only grandchild that had yet to visit her before then and I was the last. The day of her funeral I kept breaking down and crying and hurting. So now I will get to the part that not many believe. \n\nI’ve always been an avid and lucid dreamer, I have had dreams that I can recall even now that happened years ago that literally felt like hours and sometimes even days. But they were always out of this world crazy yet so realistic in the way they felt and every time I told people about my dreams they would say, “you are making all of this shit up, you probably watched it in a movie, etc.” \n\nBut the dream I had the night after her funeral was the most visceral and real experience I have ever had and will swear by it till I die. \n\nIt started off with I was walking through a very beautiful park; I was walking barefoot through the greenest grass I had ever seen and felt, the blades tickled but there wasn’t a grainy feeling of dirt, mulch, or pebbles to be found. The sun was shining, its warmth caressing my skin, oak trees, red wood trees, pine trees, and cypress trees all in this same place. I could smell the aroma of each individual tree even knowing that not all of them typically exist in the same forests. There were people playing with dogs, talking, laughing, birds chirping, deer, cows, Buffalo, and bison grazing through the grass without a care of the others. \n\nI continued walking, admiring the sites, and I passed a bench with a person sitting on it, not even taking a glance, simply seeing their figure out of my peripheral vision. And the figure in a sarcastic manner said, “are you really just going to ignore me? Damn!” \n\nI knew the voice, but it was foreign because it was in English, but the soft tone made my heart stop. I doubled back and it was my grandmother, only she was 20 years younger, young enough for me to not have seen her that young but with gestures I recognized. I cried and screamed and hugged her and she just said, “sit down mijo.” \n\nWe talked for hours on end, she told me things not even my mom knew about, and that this was the best way she knew how to show me “Heaven,” and that all of her pains were gone etc. \n\nAnyhow I woke up from the dream, tears in my eyes, but a warm hand touched my shoulder and I heard a whisper right by my ear, “Te amo mijo, yo estoy bien.” \n\nI told my mother about this first thing in the morning and she about collapsed to the floor and cried. And she said, “mijo, she talked to me last night too, she said she had just gotten done talking to you!” \n\nAs I said I’m not religious, but I am spiritual, and nothing in this world had me believing in an afterlife, until that experience. I’m extremely open minded yet skeptical of most things, this is the one that no one will ever be able to change my mind on.",
   "created_utc": 1703284604,
   "score": 105,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kejdk65",
   "message": "I was 17 and in the hospital, in heart failure waiting for a heart transplant in the pediatric cardiac ICU. I was, admittedly, pretty drugged and having a hard time. \n\nOne day my parents left my room to go have lunch and they turned the lights in my room off so I could rest. A few minutes after they walked out, I heard a noise like someone shuffling along the ground. I sat up and by the foot of my bed there was an old man crouching and smiling a horrible, manic smile at me. He started to laugh very cruelly and he grabbed my bed rails and started to shake the bed. I started SCREAMING and a nurse ran in to check on me and turned the light on. The second the light came on the man disappeared.\n\nI told my parents about what had happened when they came back to my room, and they convinced me I was just hallucinating from all the medication I was on and from the lack of blood I was getting to my brain. I believed them.\n\nLater, I was having a conversation with the Child Life specialist for the ward and I told her that earlier that day “a man had appeared and shook my bed”. She went white and asked me if he was really old and thin, and if he had been laughing. I told her he had, and she told me that several other children that had previously occupied my room had described that same man to her. To this day I get freaked out thinking about what I saw, and I wonder if that man was just a common hallucination that a bunch of deathly ill children imagined, or if he was really there.",
   "created_utc": 1703291807,
   "score": 54,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kei71al",
   "message": "Just a few days ago I woke up really early. At like 6 am I saw my dad getting ready for work. He was wearing a white shirt and jeans. And then at 7 am I saw him laying in bed, with a hoodie and black pants. He didn’t even have work that day and he was only planning to leave the house to get groceries in the afternoon",
   "created_utc": 1703274622,
   "score": 44,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keihbnv",
   "message": "A couple years ago, I was driving down a local FM road in Texas (basically, the smaller, usually two lane highways that connect city to city down here). Well, this particular stretch is outside of town and it’s a sunny, Sunday afternoon and I’m by myself. I come to a stoppage in the road, where another relatively major road has a T shaped intersection. I come to a yield to turn from the “top”’of the T, right onto the “bottom” road. As I’m coming back up to speed, with no cars in sight and a 15 year old 6 cylinder Taurus so not exactly zipping it, a giant black mass suddenly drops onto my windshield, thankfully in the center where I can still see to the left of it. After I stop screaming at the top of my lungs, I realize as it begins to flutter its wings away that a full sized turkey vulture (trust me, the name fits, they are huge birds of prey) has just swooped down onto the front of my car, perhaps mistaking a leaf or something on my hood for a rat or something. It then flies quickly away after realizing its error. \n\nTook me about an hour to fully calm down from that, and my parents never believed me when I got home.",
   "created_utc": 1703278750,
   "score": 40,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiikeq",
   "message": "- Walking home from Sunday school in my very small town with a friend. It was her house we were walking to. Nearby was a burned out house and, naturally, we detoured to snoop around it. A piece of wood on the ground stood up on its own. We ran so fast to her house; I remember picking stickers out of our frilly early-90s dress socks. \n\n- Raised by a single mom, and one evening she was crying about the financial situation. I went to bed and cried too. Then a very strong, pleasant aroma filled my bedroom… it was like someone sprayed amazing perfume right in my face, but I was in there alone. It didn’t smell familiar.\n\nHaven’t really mentioned it, especially now as an adult. I’m sure both have reasonable explanations, but each time, I was very much freaked out and couldn’t make sense of either event.",
   "created_utc": 1703279255,
   "score": 46,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keitbxe",
   "message": "We had to say goodbye to our cat Bugsy(15m) last June. I was heartbroken, we had said goodbye to his 'sister' cat(12f) 5 years ago and slowly he had become more my cat than my husband's anymore over the years. Maybe a month after his passing, I climbed into bed and got settled. I reached out my hand to feel for him and remembered he wouldn't be there. So I pulled my hand back, then immediately felt/heard the sound/motion of Bugsy jumping from the floor to the bed. I didn't feel him land, just the leap from the floor.",
   "created_utc": 1703283492,
   "score": 34,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiywl0",
   "message": "I tell this story pretty often but about half the people I tell think I am lying or just confused. I'm not. \n\nI was paddle boarding at the beach in Destin, FL and I was paddling probably about 20 yards from the shore. The waves were pretty rough so there weren't too many people in the water (I can't actually recall **anyone** in the water) but there were kids playing in the shallows near the shore and lots of people on the sand, mostly on their phones. So I'm paddling along and I see this great big shadow in the water ahead of me. At first, because of the size, I assumed it was just a big clump of seaweed. But it was moving in the same direction as me so my mind immediately starts trying to figure it out. Is it a shark? We have a lot of sharks. Is it a manatee? I've never seen a manatee this far north. Dolphin? Too big to be a dolphin. It's only when a big wave came and kind of \"lifted\" the shadow up in the water with it that I got my first good luck and I realized it was a crocodile. Not an alligator. A crocodile. We have lots of gators here and they range from pretty small to moderately sized, but this was easily 5x the size of any gator I had ever seen. It was terrifying. My whole body basically froze and locked up and all I could focus on was not falling into the water. It was absolutely huge, but it was just cruising effortlessly through the water. I've been scared by animals plenty; aligators if they surprise you, bobcats that get too close, cotton mouths that run right at you, but this was the only time in my entire life I have been *terrified*. The fear was on a whole other level.",
   "created_utc": 1703285689,
   "score": 32,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keiiwn0",
   "message": "30 years ago doing a week long canoe trip just me and my dogs around French River when I was taking a leak and heard someone turned around and there was an adult cougar just watching me 20 feet away before I scared it away.Nobody believed me as lots of folks back home don’t believe they’re in the GSA.I know the difference between a cougar vs bobcat/lynx.",
   "created_utc": 1703279393,
   "score": 27,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kej5h0k",
   "message": "Youngest daughter \u0026amp; I were driving down a one lane country road. I stopped at the railroad crossing; there were no trains. I started across the tracks and there was an honest to god locomotive bearing down on us, light blazing, steam rolling from the stack. We both screamed. I popped the car into the next gear down and flew across those tracks, then slammed on the brakes and twisted around in my seat to see - Nothing. Nada. No train. I looked at Youngest Daughter. She looked at me. “Did you?” “See what I saw?” Yeah, we both saw the locomotive. The very antique steam locomotive that wouldn’t have even been on that track anyway if there even had been a train. Which there wasn’t/was/wasn’t. We decided it had to have been one of those location memory kind of hauntings but whatever, in the moment it sure as hell felt like a real train bearing right on top of me and my then 12-year-old kid, and remains by far the scariest of all my supernatural experiences.",
   "created_utc": 1703288389,
   "score": 29,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keinh31",
   "message": "This is true but nobody believes me. This was like 20 years ago, and I was visiting a SE Asian country for the first time with my now-husband, to meet the relatives and whatnot. Turns out his paternal grandma's house was haunted af. Mysterious lights, footsteps on the staircase without anyone there, scratching at a 3rd story window (our bedroom lol) with no trees or anything nearby, that kind of thing. The family had stories about people getting pushed down the stairs by an invisible force and just seeing spooky shit. It happened enough that usually people except grandma refused to stay in the house by themselves, including my husband (who would insist on me accompanying him everywhere, including the bathroom, lol). I wasn't too bothered since I had bigger problems (food poisoning) and the ghosts hadn't hassled ME so 🤷 though I was there for the weird noises and feeling presences.\n\nAnyway, on the last day of our visit my now-FIL had the bottom floor excavated for whatever reason and they found the remains of 3 people buried under the house.",
   "created_utc": 1703281217,
   "score": 24,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keit3c0",
   "message": "When my grandma passed away, she had been living with me and my family in hospice, so she died at my home. We had a huge ponderosa pine tree in the front yard. About an hour after she passed, a ZILLION crows showed up and hung around in the big tree, cawing like mad. They stayed for an hour or so, and then all took off, all at once. I've never seen that many crows in one place before or since, and definitely not in that tree. There are many cultures that ascribe significance to crows and say that they are somehow connected to the dead, and after that experience, I have to say, I believe it. It was weird.",
   "created_utc": 1703283399,
   "score": 23,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kej0x1b",
   "message": "Was asleep one night with very little on as it was super super hot and my room didn't have AC, and I had a glass door that led into the backyard and I had left it cracked to get a bit of air flow. I would have been about 17/18, and I distinctly remember dreaming nice dreams until it suddenly turned into dreaming about watching myself asleep at the window with a bunch of other people watching me and banging on the window as if to try and wake me up. Then I shot back into my body and it felt as if someone had slammed both of their hands on either side of my body to get me to wake up. I jerked awake and was sweating and was super freaked out. \n\nLooked up and there was a man in the backyard looking right at me. I screamed and he turned and ran, and jumped over the fence we had. The fence banged against the brick wall, and I slammed the door shut and ran upstairs and woke up my mum and partner and tried to tell them what happened. They didn't believe me and just said the whole thing was a nightmare, but I KNOW it wasn't.\n\nWasn't the only freaky thing to happen in that house that made me believe ghosties were real, either.",
   "created_utc": 1703286514,
   "score": 22,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keijcb4",
   "message": "In Summer of 2020, it was a breezy night. I decided it would be good to open the windows and sleep under the summer breeze. Over the course of the last few years prior, I had been doing a lot of soul work. Mainly \"shadow work.\" For those that don't know what that is, it's when you work through a lot of trauma and massive life changes that you maybe didn't process at the time. If you don't work on these things, eventually you will develop illness in the body over time. I was trying to avoid that, but also I just needed to work through a lot of bad choices I had made in my lifetime, and things that had happened to me. I need to release it all to bring me peace.\n\nFast forward to that evening. I had been very peaceful, out in my gardens all day, just trying to stay sane throughout the whole covid situation. I opened the windows and enjoyed the breeze. Around 9:30-10:00pm my husband said, \"Let's just go to bed early!\" That sounded so nice! It had been a long day after all! I did my normal bedtime routine and climbed into bed. I laid there for about 30 mins, starting to doze off and out of the corner of my eye I saw a light in my backyard. This light was SMALL, maybe the size of a softball but BRIGHT like a spot light. As I watched it, it began moving towards my window. I didn't have my contacts in or glasses on, so I really couldn't see any detail, only that it was bright and nearly blinding me. It moved through the window screen and over to where I was laying. At this point I am WIDE awake, watching this thing move with ease through my room, moving as if it were a bubble floating through the air. \n\nI tried to wake up my husband, but I could not move. Not one muscle in my body would do as I asked. I was frozen. I struggle for a few seconds to move my arms and reach for him but could not. The light at this point hovered over my head and I saw it form into 2 tall thin light beings.....is the only way I can describe them as they stood next to my side of the bed. Instantly the light shifted over my head and I began to see what I can only describe as hieroglyphics. Geometric shapes, strange words and signs being put into my brain. I could see them above my head and also inside my minds eye. As this happened I began to breathe very heavy out of fear for what the hell was going on and why. This went on for what seemed like forever but I think was only about a minute, then it stopped. They looked at me and lit the light again, and at that point in my mind, I said \"No, please don't do anymore.\" At that moment it stopped. The light went dark as if a switch had been flipped, and THEY and IT were gone. At that point, I could move again. I laid there wondering what on earth did I just see and why were these strange symbols just downloaded into my brain?! I rolled over and fell asleep immediately. The next morning, I told my husband and teenage kids what had happened! I felt crazy trying to explain it and it seemed as if I just didn't have the proper words to describe the beings or the light or even the hieroglyphics. \n\nI have since done a ton of research on it, but it does leave me wondering if anyone else on here ever experienced this?? Please share your story because I know there are a ton of people who have. Did anything come of the download information?",
   "created_utc": 1703279571,
   "score": 18,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "keipvz7",
   "message": "I grew up in a small town in Victoria, Australia. There wasn’t much to do as a teenager, so two of my friends and I would walk around the streets at night looking for parties to gatecrash (lol). We never found one.\n\nOn one particular night, we decided to walk down a street on the outskirts of town which was surrounded by farmland and a few industrial buildings. There was a streetlight maybe every 20 metres, so the street itself was very dark. Once we got to a particular streetlight, we heard the sound of intense wings flapping from above us. We each looked up, and what we saw is something I still don’t fully comprehend.\n\nIts wingspan seemed enormous, and along with its wings, it seemed to have four limbs and an oddly humanoid shape. It made the sound of what I can only describe as the piercing sound a train makes when it makes a turn. \n\nThe three of us sprinted back to town, and did not say a word to each other for about 30 seconds of sprinting. None of us could figure out what this was, but from popular culture, it seemed similar to the Mothman legends that have been described throughout the world.\n\nOne of the legends is that the appearance of the Mothman is a prophecy for death. The mother of one of the friends who I was with that night died of cancer shortly after.\n\nAnother thing worth nothing; there was a patch of graffiti on a rail bridge close to the area of where this happened. The graffiti was of a humanoid figure with large wings. I’d never taken much notice of it over the years, until that night.",
   "created_utc": 1703282153,
   "score": 19,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kej19vc",
   "message": "A dead woman came to me in my dreams and told me her name/showed me how she was killed and where. I looked up the name and she is an unsolved murder case in a local city. Sounds absolutely insane but really happened. Her body was found near the house she showed me in the dream but out on the beach.",
   "created_utc": 1703286663,
   "score": 18,
   "submission_id": "18ofgdl"
  },
  {
   "comment_id": "kej3l3g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ofgdl"
  }
 ]
}