{
 "submission_id": "18ogm2x",
 "title": "What are the cons of humanity finding an unlimited energy source accessible to everyone for free?",
 "selftext": "",
 "created_utc": 1703256595,
 "permalink": "/r/AskReddit/comments/18ogm2x/what_are_the_cons_of_humanity_finding_an/",
 "score": 243,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ogm2x/what_are_the_cons_of_humanity_finding_an/",
 "comments": [
  {
   "comment_id": "kegxhq1",
   "message": "Job losses for a lot of people and They’ll find a way to make us pay for it still.",
   "created_utc": 1703256801,
   "score": 85,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh2tfp",
   "message": "A lot of jobs lost. Assuming this energy source can power everything from homes, to phones, to cars, the entire fossil fuel industry is done for.\n\nThey'll be a never ending wave of people trying to block access to it and run nonstop marketing compaigns to convince people that it's bad for everyone to have free unlimited energy.\n\nAlso, some asshole is gonna try to build a super weapon.",
   "created_utc": 1703259022,
   "score": 165,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh0kjp",
   "message": "People in higher power will find a way to exploit the shit out of it for personal gain. No matter what.",
   "created_utc": 1703258106,
   "score": 234,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegx6k9",
   "message": "It could be used to power a tool of destruction",
   "created_utc": 1703256668,
   "score": 203,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegx8me",
   "message": "We kill each other over ownership.",
   "created_utc": 1703256693,
   "score": 117,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegx7ol",
   "message": "Unlimited energy means unlimited power. Image how that would affect people's interactions.",
   "created_utc": 1703256682,
   "score": 95,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh2auw",
   "message": "Probably an explosion in global warming because we start doing things which are incredibly energy-inefficient and vent the waste heat.",
   "created_utc": 1703258816,
   "score": 57,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegx7n4",
   "message": "Companies will just monetize it and keep it to themselves",
   "created_utc": 1703256681,
   "score": 53,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegxgvr",
   "message": "You mean the sun?",
   "created_utc": 1703256791,
   "score": 21,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehjsw8",
   "message": "Population running rampant and destroying the environment more than we already have for things like mineral extraction, farmland and housing.",
   "created_utc": 1703265623,
   "score": 5,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh3xhw",
   "message": "The same thing that happens with the limited energy sources that are available for free now, a government will hire a company to build/take over the infrastructure needed to harness said energy source and then charge far more than it costs to maintain the service to the public. They then make large amounts of money and continue to collect for as long as the energy source is in demand. After a while said company has ridiculous amounts of money and uses that money to influence laws keeping any technology that could surpass theirs (competition) in research stages. They then lower funding into customer services while hiking up prices because whatcha Gunna do about it at this point? Aaand then we're where we are at now with most petrol/power/telecommunications companies around the world. Human nature to fuck over the rest of humanity to further yourself and maybe your immediate family is the con.",
   "created_utc": 1703259471,
   "score": 9,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh3zl5",
   "message": "If every individual had the means, the Earth would be destroyed fast.",
   "created_utc": 1703259495,
   "score": 4,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehbplo",
   "message": "Someone will totally control it and put a price tag on it.",
   "created_utc": 1703262514,
   "score": 4,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehcteb",
   "message": "Here's the thing: Hydrogen is unbelievably common. Its estimated that 75% of all matter in the Universe, all of that mass, is comprised of Hydrogen. Because of its structure Hydrogen is packed with unimaginable potential for energy which is why you can look up at the night sky (or at the daytime sky for a lesser effect) and see burning balls of Hydrogen dotting the heavens. Once we have sufficient transportation and refining infrastructure in place in space energy costs will become, in theory, trivial. You can mine Helium and Hydrogen from the surface of the moon, launch it into Earth Orbit, and then microwave beam the converted power to Earth-- and once the necessary infrastructure is in place the cost per terawatt/hr plummets.\n\nThose things we consider scarce here on Earth are usually relatively abundant in Space, and the reason we consider them scarce is because the elements and resources we value are generally buried or prohibitively expensive to exploit. In Space that equation is different: heavy loads don't cost as much to move in low/zero G, refining and purification processes are more efficient and produce better results in low/zero G, and the ease *and* abundance of those elements and resources make them so cheap as to be without value. A single asteroid 20mi across pulled from the Belt and placed in orbit around the Earth would provide so many Rare Earth minerals that it would tank the market prices ground-side. Once we reach this level of technological sophistication, with the infrastructure to produce all the refined materials we need in Space, the traditional resource-scarcity model of market economics will become obsolete. How do you attach value to gold when there's nugget of gold orbiting the planet with more gold ready for processing than the Human Race has ever extracted from the Earth across all of time?\n\nSo there's a utopian promise that if we can get the tech, and get that tech into space, we can beat these awful market paradigms we locked ourselves into over the course of the last 3000 years (since the invention of money). That promise is also a veiled threat-- while there's plenty to critique about Human commerce, the present model represents an evolution of behaviors and expectations, in the realm of economic activity, that is a best-fit solution to the Human experience. We broadly respond to stimuli in the same way, we broadly all act in predictable ways when it comes to accumulating stored wealth/resources, negotiating a trade or exchange of goods or services with those resources, and who has access. All of that becomes irrelevant the moment the reality of essentially unlimited resources becomes a reality-- without scarcity Human economic models fall apart.",
   "created_utc": 1703262942,
   "score": 4,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehjm1y",
   "message": "Energy use always ends in heat. Unlimited energy means unlimited heat. Then, sweaty overpopulation. We can't \"energy\" our way around not enough water or no feasible way to grow enough bulk grains (rice, wheat and corn are hard to do hydroponically). If we solve energy we'll have those other limits to confront. If we do find a way to solve all that we'll all go insane from a lack of interesting challenges ;) we will devolve, things will fall into disrepair, then it reboots!",
   "created_utc": 1703265550,
   "score": 7,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegxc6t",
   "message": "You could create a bomb that gets charged with unlimited energy and just ship it to a building to blow up. Likewise, you could have murderdrones flying in the sky 24/7 firing kill lasers at anyone you please.",
   "created_utc": 1703256735,
   "score": 5,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehaj6b",
   "message": "Unlimited power means a lot of things. First unlimited power translated into unlimited labor, particularly limited robotic labor. Unlimited robotic labor means unlimited food and conservation. This means unlimited leisure time for humans. That's means unlimited time to think, plan, reflect...and...lobby for societal change.\n\nUnlimited power also means unlimited resources as power really mean energy and energy is required for life, just changing forms.\n\nThis translates to no employees, which means loss of societal control, becuase once homes and families are self-sufficient, the no longer will need or be willing to toil for someone else. All these things together are great for humanity but terrible for the rich and those in power because people can keep the fruits of their labor and won't need to work for others but for themselves.\n\nWe won't need utility services like gas or electricity because we can all live \"off grid\".\n\nUnlimited labor means unlimited food because we can garden for ourselves or have robots and ai do thing for us.\n\nCapitalism as a system collapses. Because the only things I'll need to consume are renewable sustainable and self attainable. Unlimited Power = Unlimited clean water. Etc.\n\nAlso means I don't need money as much as we currently do. I don't need money to buy food if my robot is gardening it for me. Which means no sale tax. No utilities fees.\n\nJust look how 2 years of covid scared the bejesus out of the people in power and the societal changes (like work from home), job changes (societal rebalancing/refocusing), advent of ai, decreased consumerism, increased societal connection and reclamation of power (think Isreal boycotts now all over the world), etc. People are waking up to their individual power and autonomy and saying fuck the man.\n\nUnlimited power/energy is the ultimate path to true freedom.\n\nAnd we just can't have that.",
   "created_utc": 1703262059,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehc9e5",
   "message": "Capitalists would still try to find every way they could to restrict it/make money off of it.",
   "created_utc": 1703262727,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehfyji",
   "message": "Does it also unleash unlimited pollution? \n\nAs the gas boom of the 1800s in Indiana proved, when people think a resource is unlimited, they will consume it in crazy, extremely wasteful ways with little regards for the consequences.",
   "created_utc": 1703264148,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehkxi2",
   "message": "Basically all of science would be undermined because the laws of physics as we know them would be invalidated.",
   "created_utc": 1703266050,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehr9ei",
   "message": "Someone blows up the planet within 24 hours and we all die",
   "created_utc": 1703268472,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh20j6",
   "message": "If we don't come up with a way to make elements using reactors, we'd sure as hell go through resources quicker than anticipated. Recycling would be a very interesting concept if you can put one thing in and get another base/raw element back.",
   "created_utc": 1703258697,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh4x4n",
   "message": "unlimited power would mean unlimited computing power which would A) make proof of work crypto currencies worthless and B) heat up the planet even more.",
   "created_utc": 1703259864,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh7cap",
   "message": "[I can't see that going wrong](https://youtu.be/Sg14jNbBb-8?si=FMANIXC5cks1twjo). Not at all.",
   "created_utc": 1703260812,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh8hes",
   "message": "Unlimited energy is a bomb that dwarfs a supernova. If it was possible, the first time it was used would be the end of the universe.",
   "created_utc": 1703261259,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehdzy4",
   "message": "Pumping unlimited heat into the environment is probably not a good thing. This would make interstellar space travel doable though.",
   "created_utc": 1703263397,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehflgb",
   "message": "It won't be free and won't be accessible to everyone.",
   "created_utc": 1703264008,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehk3q2",
   "message": "Lots of new hardware \u0026amp; infrastructure would probably have to be developed to handle it.",
   "created_utc": 1703265735,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehlwag",
   "message": "ZERO.  Someone will want to make money off of it.  No chance in hell anything like this will ever be free.",
   "created_utc": 1703266423,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehnyjm",
   "message": "well the biggest con is that it is not possible.",
   "created_utc": 1703267216,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehome1",
   "message": "The rich will still make us pay for it",
   "created_utc": 1703267470,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehpfuk",
   "message": "Just like with everything else, those with the most money/resources will find a path to controlling the distribution of that energy source at a cost to those that do not have the most money/resources.",
   "created_utc": 1703267777,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kei0vfx",
   "message": "We have one, it's called the Sun.",
   "created_utc": 1703272189,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kei6brt",
   "message": "No it's not going to happen back in the 70s when I was in El Paso they were building the nuclear plant out here where I now lived in Arizona. El Paso is the only part of Texas it's not on the Texas grid. The politicians were taking our money promising us how cheap our electricity was going to be it was going to be next to nothing. So what happened people have to line their pockets or they don't feel fulfilled, there's a whole another race of humans that only take.",
   "created_utc": 1703274342,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kei92k5",
   "message": "There will be a lot of war over who gets to control it and whoever wins is going to charge out the ass.",
   "created_utc": 1703275429,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kei93zl",
   "message": "It will be discredit, \"cancer clusters\", \"it's dangerous\", outright lying to deceive the public, an incredibly inefficient power grid will make it unusable.\n\nOwning something people need for survival is power, old white men will never give that up without a fight.",
   "created_utc": 1703275445,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keigdew",
   "message": "none. energy is the only thing between us and feeding the world, prosperity for all.",
   "created_utc": 1703278368,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keigvmr",
   "message": "Shareholder value. Have you thought of the shareholder value?",
   "created_utc": 1703278571,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keihyct",
   "message": "We will weaponize it",
   "created_utc": 1703279007,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keii7ll",
   "message": "We would over produce everything. The washing machine broke down they are so cheap to make just buy 3 more and toss the old one in the bin",
   "created_utc": 1703279112,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keik6fk",
   "message": "Disinformation explosion. Massive fearmongering, marketing and other tactics to convice you that 'this' energy is better than 'that' energy. Similar to the diamond industry where contrived scarcity and importance was created to build a market. I say similar because in this situation, everyone has access to it.\n\nAnd\n\nRegulation to prevent you from using or accessing the energy. Govt's crave stability. Limiting access would keep the status quo and make societal changes incremental vs abrupt.",
   "created_utc": 1703279908,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keim81m",
   "message": "So much doomerism. \n\nCost of living would go down massively. Not just for the energy people use, but also every product you consume from your phone to your food would be way cheaper to produce and transport. \n\nAssuming it's clean, we basically solve global warming.\n\nSolve water shortages. \n\nNew products that are currently energy limited can enter the market. \n\nWe could utilize super computers to help society and solve more problems.",
   "created_utc": 1703280719,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keim8rh",
   "message": "There will absolutely still be a Carbon Tax.",
   "created_utc": 1703280727,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keinhr2",
   "message": "militaries finding it and finding out how it could be used as a weapon causing it to destroy humanity",
   "created_utc": 1703281225,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keiobez",
   "message": "You really think it would be accessible to everyone for free?",
   "created_utc": 1703281552,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keiqns8",
   "message": "Don't worry.\n\nBig Oil will kill anyone who has ever seen this new power source and hide the only prototype in a huge warehouse where it'll be looked at by top men.",
   "created_utc": 1703282449,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kej97iv",
   "message": "You mean the Sun?",
   "created_utc": 1703289946,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kejdwbv",
   "message": "Large explosives the likes of which we haven't comprehended to this point in time.",
   "created_utc": 1703291958,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegxwqm",
   "message": "It will further drive the destruction of the planet",
   "created_utc": 1703256980,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh1zyn",
   "message": "It would fuel a large population growth worldwide.",
   "created_utc": 1703258690,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh5oa2",
   "message": "but how will the billionaires make money?",
   "created_utc": 1703260162,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehjzav",
   "message": "You mean like solar and wind?\n\n\nOr do you mean something magical that doesn’t require technology, infrastructure, utility companies, and installation?",
   "created_utc": 1703265689,
   "score": 3,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh0bk0",
   "message": "[deleted]",
   "created_utc": 1703258001,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh19l9",
   "message": "The number of lazy people will increase to the point that this system will collapse, or civilisation will die and we will roll back to the ancient ages",
   "created_utc": 1703258394,
   "score": 2,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh2zrj",
   "message": "It is physically impossible. \n\nEven if you tap energy from the multiverse there is always a limit.",
   "created_utc": 1703259095,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehfn68",
   "message": "Not sure how you expect it to be free OP",
   "created_utc": 1703264026,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegzjjg",
   "message": "Less reason to work and More Tiktok.",
   "created_utc": 1703257672,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh1j72",
   "message": "Awww the poor capitalists would have an aneurism",
   "created_utc": 1703258503,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehdltm",
   "message": "there is no way it would be free, at least not for anyone alive today, there is way to much money in not making this happen for our society today to accept it.",
   "created_utc": 1703263246,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehrosd",
   "message": "Capital owners would hog it and monetize it",
   "created_utc": 1703268634,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegy3zs",
   "message": "Many of the most powerful and wealthiest companies on Earth are energy companies (Saudi Aramco I believe is rumored to be worth around $3T or so? It's hard to say but certainly they are massive)\n\nSo either those companies take control of this energy source and now it's not \"unlimited\" it will be limited by what you are able to pay... Or if someone tries to just offer unlimited energy to all... These companies would have you and your whole organization/family killed off. To protect their empires...\n\nAlso, there is no such thing as true \"unlimited energy\" that's a fantasy. The universe (particularly in our small corner, on Earth) is finite. The laws of physics are finite in that sense. But to be clear, there could be an energy source so vast that it's \"practically infinite\" but that's not the same as truly unlimited.\n\nAlso, \"accessible\" is a key word. For example, Earth will basically never run out of oil. There is just so fucking much of it inside the Earth. What humanity is running out of is the \"accessible oil that's near the Earth's surface where we can access it\". Accessibility is extremely expensive, until new technologies come out. \n\nAlso, accessibility means you need to be able to store and transfer it. Like we could make incredible nuclear reactors... sure. But we don't have the battery technology to store it properly, and we don't have the technology to cheaply transmit that energy in a useful form around the world to all the poor nations. Energy storage and transfer is extremely hard and expensive. Way more difficult than generation itself, these days.",
   "created_utc": 1703257066,
   "score": 0,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehahk2",
   "message": "Arthur C Clarke touched on this one in 3001 (I think) - with unlimited energy came the problem of *unlimited heat*, meaning the people of Earth had to cover a huge chunk of the planet's surface in reflective material to bounce the sun's rays back into space.",
   "created_utc": 1703262041,
   "score": 0,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kejw939",
   "message": "More of the planet would be paved over, more waste heat and reflectivity etc would accelerate mass extinction. \n\nThis is why reducing consumption is the only real option to achieve sustainability, and technological utopianism is a flawed mythology",
   "created_utc": 1703300025,
   "score": 0,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegyrue",
   "message": "Sunburn can give you skin cancer",
   "created_utc": 1703257349,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kegz5m8",
   "message": "Someone would still find a way to monetize it",
   "created_utc": 1703257511,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh0oiw",
   "message": "[Big Bada Boom](https://www.youtube.com/watch?v=Uwzg7SYZKF0\u0026amp;ab_channel=SedoyZloy)",
   "created_utc": 1703258152,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh17px",
   "message": "Potential economic disruptions and geopolitical tensions arising from the shift away from current energy dependencies.",
   "created_utc": 1703258372,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh5bw4",
   "message": "You mean the sun?",
   "created_utc": 1703260025,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh67l6",
   "message": "Someone will find a way to \"own\" it and charge for it.",
   "created_utc": 1703260369,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh6b7m",
   "message": "We already have one... It's called the sun. It keeps us warm, grows food for us and the animals we eat... Makes it rain... Pretty awesome really, and look what has happened...\nWhen you think of it, from an origin of life perspective, the unlimited free energy source (the sun) has created all the cons you can think of... We would be nothing without the sun...",
   "created_utc": 1703260409,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh7rwk",
   "message": "The Pope will get his hands on it",
   "created_utc": 1703260983,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh7s6o",
   "message": "\"lol free for everyone???? loooool\" - Nestle",
   "created_utc": 1703260986,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh838a",
   "message": "Rich people all around the world become poor overnight...I don't see this happening without massive upheaval and pain. \n\nThis is the con...rich versus poor becomes actual war.",
   "created_utc": 1703261107,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh8nz0",
   "message": "Sounds like solar energy to me.",
   "created_utc": 1703261328,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh8px4",
   "message": "It would destroy the power dynamic between the superpowers and the poor nations they use as pawns. President Obama once told Africans they couldn't get air conditioning because the planet would boil over. They cheered him for telling them they weren't good enough for basic comforts Americans enjoy. Could you imagine being an impoverished nation and suddenly having the means to take care of your own people? No longer needing to make deals with tyrannical governments to feed your people? Imagine living in Yemen and suddenly you don't need to be Iran's puppet anymore. America and China would never allow this.",
   "created_utc": 1703261350,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh8u49",
   "message": "A truly unlimited source of power? We'd break the laws of thermodynamics and the thermodynamics police would come knocking.\n\nAn effectively unlimited source of power?\n\nIn addition to the other comments, there's a problem of usability of the power. You can stick a tiny solar panel out in front of your home, and that's effectively unlimited power \\[at least until the sun dies in a few billion years\\], but it doesn't generate many watts. If the watts are too low, it doesn't do a damn thing. If the watts are too high, an individual cannot actually use this. We are actually limited on the amount of volts / amps that can travel along a circuit, especially with metal wiring. Too high of a voltage \\[potential\\], you get arcs. Too low of a voltage, it's useless. Too high of amp \\[current\\], you burn the cable out. Low amps compared with volts are useful, but again we are limited by volts on the low side. A truly unlimited voltage potential = completely unusable, the moment you plug anything into it, it just explodes or the wire burns out immediately due to an arc.",
   "created_utc": 1703261395,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh8vm3",
   "message": "Heat buildup - using the produces waste heat, and some of that stays on the planet (some is radiated into space). Fairly soon the planet is unlivable.",
   "created_utc": 1703261412,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh8vqg",
   "message": "Tesla tried for this, corporations and politicians blackballed him into bankruptcy.",
   "created_utc": 1703261413,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keh9k6x",
   "message": "Corporations and governments will still find ways to charge people for power.",
   "created_utc": 1703261681,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "keha2l5",
   "message": "Population growth that would grow to the point that we'd be short of some other resource like freshwater.",
   "created_utc": 1703261879,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehahdr",
   "message": "Maybe we already have that technology. No money it.",
   "created_utc": 1703262039,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehb2eu",
   "message": "Cons? No one would leave their house cause we’d all be too busy enjoying our low bills and renewable energy. There really isn’t a downside to this. Renewable energy is the future to saving our only earth",
   "created_utc": 1703262263,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehcs0a",
   "message": "Unlimited energy leads to Star Trek replicators, faster than light travel, technology which we can’t understand because unlimited energy doesn’t exist in our equations. Creating new matter directly from energy negates the need for money.",
   "created_utc": 1703262928,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehcsld",
   "message": "Depends on the form of delivery. \n\nIs it something like Mr. fusion from Back to the Future? Then oil use is going to skyrocket for road paving and tires. \n\nIs it through the traditional grid? Then a lot of countries might end up even poorer unless they have a material source needed to make use of it.",
   "created_utc": 1703262934,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehd9lz",
   "message": "Necromorphs mostly.",
   "created_utc": 1703263114,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehdnbw",
   "message": "Drilling a hole into an ancient prison and setting free the ultimate evil plunging us into a post-post apocalyptic medieval world where no one understands how to have a conversation that isn't incredibly passive aggressive to the point where it almost ends the world.",
   "created_utc": 1703263262,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehegps",
   "message": "It will almost immediately be made not free and be monetized as much as possible",
   "created_utc": 1703263577,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehejf5",
   "message": "The Americans will destroy and or steal it",
   "created_utc": 1703263605,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehewyr",
   "message": "Someone will want to control it.",
   "created_utc": 1703263751,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehfaj0",
   "message": "Do you mean the sun?",
   "created_utc": 1703263894,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehfesv",
   "message": "Oh, you mean like the sun?",
   "created_utc": 1703263939,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehfrc5",
   "message": "New arms race. Probably end in the destruction of the planet. Or a good chunk of the planet at the very least. Hopefully enough people survive to rebuild civilization with their unlimited energy. In the wake of this tragedy, people actually agree to try not the kill each other so that part isn't really a con. \n\n\nAnother possibility is space travel is now much easier. Can we put this unlimited energy source in spaceships? That would be a game changer.",
   "created_utc": 1703264071,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehfvws",
   "message": "We kill each other over ownership.",
   "created_utc": 1703264120,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehfvyb",
   "message": "Free?",
   "created_utc": 1703264121,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehg8j5",
   "message": "It wouldn't be free, some rich prick would figure out a way to monetize it.",
   "created_utc": 1703264250,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehgdbv",
   "message": "Well if someone had unlimited power they would soon become scarred and deformed after attempt on their life, but they would assure you their resolve has never been stronger. The Republic would be reorganised into first Galactic Empire, liberty would die with thunderous applauds, and order 66 would be enacted.",
   "created_utc": 1703264301,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehgw9l",
   "message": "Cons will find clever ways to make it not free",
   "created_utc": 1703264502,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehh17m",
   "message": "We are still working 40 hour weeks with improvements to automation in thw workplace.  What about unlimited energy would change anything....",
   "created_utc": 1703264556,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehh7dq",
   "message": "Unlimited heat.",
   "created_utc": 1703264623,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehhps1",
   "message": "Whoever found it would disappear under mysterious circumstances and whatever they found would go with them.",
   "created_utc": 1703264820,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehhqoy",
   "message": "it will never be accessible to everyone for free some rich motherfucker will monopolize it.",
   "created_utc": 1703264829,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehhzk8",
   "message": "Corporations wouldn't be able to make a profit on it.",
   "created_utc": 1703264922,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehi9dm",
   "message": "Oil companies stop making record profits bcuz the price hike is due to the ‘summer blend’",
   "created_utc": 1703265028,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehibtz",
   "message": "see what has happened to hydroelectric power:   heavy regulation, push against its environmental downsides, mismanagement, infrastructure challenges, neglect…\n\nall make it way more expensive than it should be.",
   "created_utc": 1703265054,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehihqs",
   "message": "If it was truly unlimited we'd each hoard so much we would create entire planets for family or even individuals to live on",
   "created_utc": 1703265118,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehj3km",
   "message": "People will find a way to profit off of it.",
   "created_utc": 1703265354,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehj9sq",
   "message": "Explosion goes boom boom",
   "created_utc": 1703265420,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehjgvy",
   "message": "They will revert back to mainly fighting over religion and ethnicity.",
   "created_utc": 1703265495,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehku34",
   "message": "Overpopulation",
   "created_utc": 1703266013,
   "score": 1,
   "submission_id": "18ogm2x"
  },
  {
   "comment_id": "kehxb7w",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ogm2x"
  }
 ]
}