{
 "submission_id": "18ohh93",
 "title": "People who missed out on a once-in-a-lifetime opportunity, what was it?",
 "selftext": "",
 "created_utc": 1703258936,
 "permalink": "/r/AskReddit/comments/18ohh93/people_who_missed_out_on_a_onceinalifetime/",
 "score": 23,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ohh93/people_who_missed_out_on_a_onceinalifetime/",
 "comments": [
  {
   "comment_id": "kehfl7t",
   "message": "My husband, myself, and my daughter, who was 14 at the time, were on the AC boardwalk later in the evening when a drunk girl ran up to my husband and offered to lick his butt under the boardwalk. He turned her down, but I still think opportunity lost. He won't be getting an offer like that again.",
   "created_utc": 1703264006,
   "score": 40,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehb1zt",
   "message": "I’m a web designer - In 2009, I and a developer friend had an idea for an app that featured scrollable videos that are intentionally really short. We didn’t follow through with it because we thought it might not catch on.",
   "created_utc": 1703262259,
   "score": 30,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehofgq",
   "message": "My friend offered to help me buy 100 btc back when they were just a few bucks, because he understood the tech. I remember thinking about it, and saying \"n'ahh\" at the time.\n\nHe is now rich. I am not. lol",
   "created_utc": 1703267398,
   "score": 25,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh7ico",
   "message": "I could have helped the widow of a Nigerian prince and became rich in the process.",
   "created_utc": 1703260876,
   "score": 26,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh2ztm",
   "message": "I got offered a job as a touring performer.\n\nHas yet to come up again, so I'm sort of assuming it won't happen again.",
   "created_utc": 1703259095,
   "score": 11,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehfhgw",
   "message": "About 15 years ago I never applied to the random posting I saw in the Saturday paper looking for people to be trained to become professional cheese tasters. Was a legitimate add. I was working in the wine industry at the time and I have a good palette.\n\nI met someone who  actually applied and went through the cheese tasting training. \n\nthrough the training he is now a chocolate, honey, tea, coffee, and cheese taster. He gets to judge competitions all around australia. He doesn't get paid but gets flown and hotels for the big shows.",
   "created_utc": 1703263966,
   "score": 10,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehimn1",
   "message": "I had a summer fling with a woman. She was from Spain. We were not in Spain for the summer. At the end of the summer she asked me to move to Spain to be with her. For reasons that were important to me at the time, I declined. Those reasons mean nothing to me now. So I do kind of regret it. My life would have been completely different.",
   "created_utc": 1703265171,
   "score": 11,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehwtc8",
   "message": "I'm a musician and gigging started to drop off so I took a pretty well-paying day job.\n\nOne afternoon while I was at work I got a call from a very famous rock star/front man, rnr hall of fame member.  I didn't know him well, but we had a lot mutual acquaintances. He said 'hey I'm at the studio going some recording, why don't you come down'.   I told him I couldn't do it because I was at work(!).  And, of course, I never heard from him again.",
   "created_utc": 1703270608,
   "score": 9,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehz69b",
   "message": "When I was around 17/18, I bought my then gf a burger from Burger King. Got it home and she starts chewing down, suddenly she's screams out in pain. Opens her mouth and spits out this huge bolt from the broiler. Instead of taking photos and keeping the evidence/contacting a lawyer (this was back in the 90's) I wrapped the screw up, went back to the store, shoved it back into the hand of the manger. Got a refund for the meal and a few coupons for free meals for the next few weeks. \n\nMy gf ended up with a chipped tooth, and all I could say was I'm sorry. Here's a free meal for tomorrow? 🤷🏽‍♀️",
   "created_utc": 1703271525,
   "score": 5,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kei8jn3",
   "message": "There was a super sweet, attractive guy from a nice rich family who I made out with at summer camp when we were teenagers. He tried to have a relationship with me and I rejected him because \"I'm really messed up and you would never understand me.\" We lost contact after that. 16 years later I've been through absolute hell with terrible relationships, money problems and life in general. I still think of him often and wonder what life could have been like.",
   "created_utc": 1703275222,
   "score": 3,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keie4p4",
   "message": "Years ago a friend thought I was a really good writer and gave me a book on comedy writing and told me I should work at it. \n\nLife got in the way and I decided to focus on a career that was more stable. \n\nThat friend became a writer/showrunner/and producer for many comedy shows. Some very well known. \n\nI remember this Jim Carrey story often:\n\nMy father could have been a great comedian but he didn't believe that that was possible for him, and so he made a conservative choice. Instead, he got a safe job as an accountant and when I was 12 years old he was let go from that safe job, and our family had to do whatever we could to survive. I learned many great lessons from my father. Not the least of which was that: You can fail at what you don't want. So you might as well take a chance on doing what you love.\n\nJim Carrey",
   "created_utc": 1703277468,
   "score": 3,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh2tvk",
   "message": "Joanne.",
   "created_utc": 1703259027,
   "score": 5,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh6wqh",
   "message": "New company (later called) called Comcast offered me a job in 1985.",
   "created_utc": 1703260642,
   "score": 3,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh6u1g",
   "message": "I had an opportunity to work for and with chef Morimoto but wasn't able to because of transportation issues due to my siezure activity not allowing me a drivers license. Restaurant was in DC and I was living att in Virginia. It still makes me sad to this day.",
   "created_utc": 1703260614,
   "score": 2,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehms4p",
   "message": "Whatever it was. Missing it was Not at all worth it !",
   "created_utc": 1703266761,
   "score": 2,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kei8zru",
   "message": "Saw someone local selling a GMC Syclone in good condition, running and driving, just wasn't charging, for $2500.  Never see a deal like that again",
   "created_utc": 1703275399,
   "score": 3,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keifcim",
   "message": "I was dating a Japanese woman while we both attended an American college. Her parents were filthy rich and liked me a lot. \n\nI was invited to come live in Japan when we graduated and I turned it down because of a band I was in that broke up a year later…\n\nNever saw or spoke to her again.",
   "created_utc": 1703277957,
   "score": 3,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehmfqn",
   "message": "I went with the salad instead of the soup",
   "created_utc": 1703266629,
   "score": 3,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh92kn",
   "message": "Well when I was young and naive, I had an interview with Northwestern Mutual. Office manager or whatever they’re called said I had the opportunity to make $80,000 out of college. Read some not-so-great things about Northwestern Mutual and specifically that office.\n\nHappy to announce that I haven’t regretted turning this down a day in my life 😂",
   "created_utc": 1703261488,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh3ixw",
   "message": "being apart of my schools contingent that marched in during national day",
   "created_utc": 1703259310,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh3ujr",
   "message": "I was offered a job in St. Croix and turned it down.",
   "created_utc": 1703259438,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keh668g",
   "message": "I thought of a site like ebay two years before it came out.",
   "created_utc": 1703260355,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehmwwe",
   "message": "Peace",
   "created_utc": 1703266812,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehp2ez",
   "message": "A better position in the company, boss only posted some of the openings while trying to make payroll history with lies. A Former Sunday School teacher who proudly left his wife in labor to go to his monthly audit. I hope his large intestine gets caught in the car door.",
   "created_utc": 1703267636,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehqcw5",
   "message": "Who knows never got the offer",
   "created_utc": 1703268129,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehqk3m",
   "message": "I had the funds to buy 1000 ETH or so. Chickened out and decided not to. I got a vague amount between 10-50 but literally had cutting edge research done saying it will go up, and decided to not believe myself. I was bittersweet right.",
   "created_utc": 1703268204,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehtq3f",
   "message": "Two times I have had a chance to get rich and blew it. \n\n1. When the crypto craze happened in like 2017 I had a tip about Ethereum when it was like 150$. I invested a bit here and there but then it crashed in 2018 or something. Here’s the thing, if I had just kept investing when it was like 90$ fearlessly I’d be rich when it blew up to like 4k a few years ago. Instead I lost money cuz thought it was dead.\n\n2. When the meme stock craze of a few years ago hit I invested a bunch into AMC when it was 8$. It started to lose value and I panicked and sold it at a loss. A month later it blew up to 60$ or so. If I had fearlessly kept investing I’d be rich right now if I cashed out at the peak. Instead I lost money.",
   "created_utc": 1703269412,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehv261",
   "message": "I work at a retail store, and on 23-Feb-2022 I realized I had the greatest idea 24 hours too late...\n\n2-22-22 Sale! Come in dressed in a tu-tu and receive 22% off.",
   "created_utc": 1703269930,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehvzng",
   "message": "I really considered buying 40 bitcoins at $25 each. I decided it was a bad financial decision and focused on my university studies. It made me sick for a bit when I saw it hit $10k, but realistically I probably would have cashed out at $50 anyway.",
   "created_utc": 1703270290,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kehylzn",
   "message": "I don’t know if it was once in a lifetime, but when I was 27 I walked past a crew shooting a TV episode (downtown Chicago) and a guy told me their casting agent’s name and said I should call them. But I was on my way to a job interview so I ignored that. Hmm, wonder what might have been.",
   "created_utc": 1703271306,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "kei4wlu",
   "message": "I've been offered several extramarital affairs. Said no to all of them. I may have missed a couple once in a lifetime experiences, but I'd never give up a once in a lifetime love for any of them.",
   "created_utc": 1703273780,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keidipt",
   "message": "There was a big company that was looking to hire me. I was scheduled to take a couple of flights on their private jet to their headquarters and also with some of their customers going to present at a conference. It was essentially going to be an interview in a way. \n\nI accepted a job with a small startup instead. Big company no longer wanted me to go on the trips. Probably my only shot at riding in a private corporate jet.",
   "created_utc": 1703277220,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keidqg5",
   "message": "I could have gotten onstage with Strapping Young Lad and sang Far Beyond Metal, but because I did not know the lyrics I did not do it. It is my biggest regret in life. I should have just gone up there and screamed.",
   "created_utc": 1703277308,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keidrmx",
   "message": "In 2013 I had a personal offer from Vitalik Buterin to get in on the pre-sale of Ethereum at $0.11 per ETH. Never even saw the email",
   "created_utc": 1703277321,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keifxkl",
   "message": "It was the early 80s. The odds on my team winning were 500-1, and I thought that had to be worth a fling as I walked past a bookmaker. But I don’t bet, so that 100 was safe.\n\nMy team won.",
   "created_utc": 1703278191,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keikfkp",
   "message": "Idk if dogecoin counts because when it was worth .00017 I put 5 bucks into it just for laughs, thinking if it ends up being worth something someday then I'll make money, if not it's just 5 bucks. Had I known it would actually be worth something a few years later I would have put a lot more than 5 bucks into it.\n\nOther than that, I missed out on potentially good friendships. The semester after I started college, the leasing company that ran the housing for the school told me they were moving me to a different apartment on the other side of the complex. I didn't want to move so I complained and they let me stay where I was at. The person they meant for me to room with as it turned out when I later met him was a fellow gamer and he was also in an IT major. We hit it off pretty good and he invited me to come work at this noodle place that he worked at. Me being socially awkward and nervous I said no. We ended up losing contact eventually and I regret everything to this day.\n\nAnother maybe opportunity was a guy who asked me to come see him sometime at work down at the Menards. I again never did it because I was very sheltered and had severe social anxiety. But I was bicurious and he told me some stuff that suggested he was gay and he was really cute so I often I wonder if he would have ended up being my first boyfriend. \n\nThose last two were my biggest regrets.",
   "created_utc": 1703280007,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keilcu3",
   "message": "Bitcoin early.\n\nA house in 2008 because I was 12",
   "created_utc": 1703280371,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keilyqu",
   "message": "Not buying bitcoins when they were at .10 cents a coin",
   "created_utc": 1703280617,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keimdpc",
   "message": "when my favorite artist was heavily making eyes at me at a bar as a teen, and i didn´t go in for the kill",
   "created_utc": 1703280782,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keiorkt",
   "message": "I used to frequent a local net cafe in my neighborhood when I was in middle school. That was around 2009-2011. We'd go there after school and have amazing fun playing LAN Call of Duty, Left 4 Dead or other games. It was a very small shop but the owner was super cool and everyone knew each other. Some high school kids had discovered bitcoin and were buying it as some sort of cool novelty. Someone even made a bitcoin transaction just to prove that it was real money. Of course at the time all of us thought it was a waste of money to get thousands of bitcoin to get something that costs a few bucks. A lot of the kids there had bought thousands of Bitcoin for pennies, but I personally didn't. Most of the guys who had BTC eventually cashed out shortly after for a small profit and it was just a cool story for most of them that they made 50-100 euros of profit. Not a single person actually held on long enough to make any serious profit, and personally I never bothered to get any.\n\nIf I had spent what I spent in a week there anyways on BTC I'd be a rich man now.",
   "created_utc": 1703281727,
   "score": 1,
   "submission_id": "18ohh93"
  },
  {
   "comment_id": "keipflf",
   "message": "A friend and I tried to see The Smashing Pumpkins at a weirdly small venue back in the day. Like it was kind of surprising they were playing there. Unfortunately my friend was just a few days short of being 18 so we missed the show. They ended up breaking up a month later.",
   "created_utc": 1703281982,
   "score": 1,
   "submission_id": "18ohh93"
  }
 ]
}