{
 "submission_id": "18oiplk",
 "title": "People who married someone that cheated while dating, how’s your marriage now?",
 "selftext": "",
 "created_utc": 1703262205,
 "permalink": "/r/AskReddit/comments/18oiplk/people_who_married_someone_that_cheated_while/",
 "score": 194,
 "url": "https://www.reddit.com/r/AskReddit/comments/18oiplk/people_who_married_someone_that_cheated_while/",
 "comments": [
  {
   "comment_id": "kehfw60",
   "message": "Divorced\n\n~~You can't~~ *Avoid marrying* someone you don't trust.\n\nSo simple, yet such a hard lesson.",
   "created_utc": 1703264123,
   "score": 60,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei5nrr",
   "message": "Divorced. Due to an affair. Everyone, including me, thought we had an amazing 13 year marriage and we were working on trying to have our second child..",
   "created_utc": 1703274075,
   "score": 84,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehcvt9",
   "message": "She continued to cheat so we divorced. She continued to cheat on the next guy so they divorced and she still didn't learn. She's now alone and miserable in her 60's.",
   "created_utc": 1703262968,
   "score": 246,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei76vk",
   "message": "I know a guy who dated this girl in college who cheated on him and he still married her.  Midway through their marriage she decided she wanted to try polyamory (so she said) and the first dude she dated was the guy she cheated with in college.  The marriage is now in shambles.",
   "created_utc": 1703274680,
   "score": 102,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei4pmj",
   "message": "I found out he cheated near the beginning of our dating relationship, then I thought was faithful so we married 3 years later.\n\nTurns out he was cheating pretty much constantly throughout the entire 3 years of dating and 10 years of marriage… including right before our wedding and right after our kids were born. \n\nI don’t know why I forgave him so many times. I think it was a mix of youthful hope and trauma bonding.\n\nAnyway, we’re divorced now and every night I enjoy the peaceful and glorious sleep of a woman who knows nobody is out cheating on her.",
   "created_utc": 1703273704,
   "score": 168,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei2uz3",
   "message": "Over - I divorced him. Could never get past that early breach of trust and the resentment was dissolving my soul.",
   "created_utc": 1703272975,
   "score": 251,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei7tg3",
   "message": "She later came out as gay and we divorced after 2.5 years",
   "created_utc": 1703274929,
   "score": 68,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehdsl3",
   "message": "It's going brilliantly, all 4 of us are pretty joyous now.",
   "created_utc": 1703263318,
   "score": 109,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei3ukj",
   "message": "He cheated one drunken night while away at college. \nHe doesn’t drink anymore, we went to therapy and we’ve been married for almost 30 years now. We have a happy life together. But I wouldn’t say this is the norm, most relationships don’t work after cheating",
   "created_utc": 1703273364,
   "score": 218,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehfosn",
   "message": "My marriage is awesome. I fully trust in him again and he’s the absolute love of my life. But just because it worked out for me doesn’t mean it will for everyone. It took a lot of hard work on both of our parts to get our relationship to where it is now. I would never fault anyone for not wanting to put that work in. Also cheaters often aren’t properly remorseful, and if they’re not then reconciliation isn’t possible. My husband was properly remorseful and was willing to lead the effort and work needed for our reconciliation. If that hadn’t been the case I would have had to leave.",
   "created_utc": 1703264043,
   "score": 155,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei2p2d",
   "message": "My 18 year old boyfriend cheated on me during our freshman year of college. We were 1300 miles apart and had only been dating for 4 months when we each left for college. \n\nHe confessed, I was brokenhearted, he felt awful. \n\nThat was  27 years ago. We’ve been married for 21 years with 2 kids and 2 dogs and we can’t get enough of each other. He’s the best thing that’s ever happened to me and I trust him with my life.",
   "created_utc": 1703272910,
   "score": 62,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keib6p6",
   "message": "Well, I didn't find out about the cheating until after we were married and learned he was cheating while married. Got divorced. so.... not well.",
   "created_utc": 1703276276,
   "score": 132,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei979m",
   "message": "Not married but in LTR 4+ years.\n\nShe cheated on me with her ex, whom had cheated on her previously.\n\nThey got married and he cheated on her again, she tried to get back with me, after all those years, knowing full well I was perfectly happy in another LTR. So yeah she wanted to be my cheating partner. \n\n“The mind of thieves thinking everyone else steals”.",
   "created_utc": 1703275482,
   "score": 137,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keigo5z",
   "message": "Got divorced and haven't seen him for over 30 years.  He cheated the whole time we were married too.  \n\nHe blamed a \"dead bedroom\" for his cheating, but he got the cause and effect backwards.  He cheated constantly and didn't like to use condoms so I stopped having sex with him to preserve my own health.  It didn't matter how often we had sex, we were having sex almost daily for a while and he'd still find time to cheat.",
   "created_utc": 1703278487,
   "score": 70,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keij7k7",
   "message": "Dated for a while after the cheating, then it petered out. Moved on. Both of us had serious relationships with other people. \n\n\u0026amp;#x200B;\n\nThen we both found ourselves single at the same time. Started hanging out again (truly trying to be platonic. Even tried to set each other up with other people.), but the connection was there. Eventually gave into the feelings and have been happily together for almost 15 years (married for 13 of those) with two kids and complete trust.",
   "created_utc": 1703279517,
   "score": 121,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei9rk6",
   "message": "I was the one that cheated, back in college. We got back together, and I’ve been faithful ever since. That was about 19 years ago. Sure happy she took me back, our life is as good as we could hope for.",
   "created_utc": 1703275706,
   "score": 192,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei607f",
   "message": "Honestly, from older me to younger me: I wouldn’t say it’s worth it. \n\nYou are young and you have so many wonderful things to do in your life ahead of you! I did reconcile with my partner, and while I love him, damn that was 4 years of my life I won’t get back. 4 years of time and effort *working on the relationship* I could have spent on something else. It was an opportunity cost, and if I had the chance again I wouldn’t do it. \n\nAt the time, I remember browsing Reddit and thinking “2-5 years to get back on track, that’s worth it”. You know, I might have used that energy to write a novel, or learn to salsa, or invest more heavily in the other important relationships in my life, move to another country or become a marine biologist! There were so many *other things* I could have done with that time and emotional bandwidth, rather than all of the work of reconciliation. \n\nI have grown in many ways in this process, and I am emotionally more resilient because of it (I now have a “when shit hits the fan” playbook) but overall it’s been painful and taken a lot from me. I think I could have spent that energy on better things.",
   "created_utc": 1703274213,
   "score": 83,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei4nru",
   "message": "Not me but a relative of mine. A pattern developed where every 2 years her husband cheats, isn't remorseful about it, makes her feel bad about leaving him, and then eventually they get back together, and the cycle repeats itself...",
   "created_utc": 1703273683,
   "score": 93,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keixm7r",
   "message": "My ex never cheated until we were married. But the first time she did it, she led me to believe she wanted things to be better, so I gave her another chance. Turned out those words were hollow and unsubstantiated. I left her after she did it again.\n\nIMO, it's not quite \"once a cheater, always a cheater\". But I think anyone who cheats and doesn't follow that up with some deep, self-initiated inner work to get to the core of their issues will always be a cheater.",
   "created_utc": 1703285179,
   "score": 27,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehr37m",
   "message": "OP if you’re asking this to see if you should stay with a cheater:\n\nDon’t. Just leave. A lifetime of stress and insecurity isn’t worth whatever you delude yourself into thinking they can provide you that a good loyal person can’t.",
   "created_utc": 1703268407,
   "score": 166,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei3u29",
   "message": "Cheating that ends up never happening again and a couple reconciling is very much the exception to the rule.  I would say 10% or less.  \n\n\nIf you're asking this because you've been cheated on, I would GTFO.",
   "created_utc": 1703273359,
   "score": 30,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehdrkx",
   "message": "She was coming out of a very abusive LTR, turned out she was still sleeping with him for the first couple months of us dating. She eventually told me, said \"we never had the convo\" which was true, but I still decided to cut ties and date other people. About 6 months later, I was in something super casual and she called and asked to have coffee..been 12 years now. I trust her implicitly.",
   "created_utc": 1703263308,
   "score": 132,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehyc2q",
   "message": "Divorced. \n\nHe’s remarried. She’s single and travels a lot to spend time with men she meets online.",
   "created_utc": 1703271198,
   "score": 147,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei4cmo",
   "message": "My sister in law did. Every time she caught him she blamed the other women. Now she hates his guts but she won't divorce him.",
   "created_utc": 1703273560,
   "score": 143,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei5v7r",
   "message": "Not me but my friend who is 62 cheated on his wife early in there marriage. They're now at I think 28 years together. He was also a huge alcoholic at the time and after he cheated on her turned his life around.",
   "created_utc": 1703274157,
   "score": 67,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei5c6l",
   "message": "She cheated again and we got divorced.",
   "created_utc": 1703273948,
   "score": 75,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiaqoi",
   "message": "I basically just lost my couch surfing, broke best friend who I’ve been trying to keep on track since she got released from the psychiatric hospital because she’s decided that a married Man with an aging, frail wife is her soulmate, and I just don’t understand.\n\nFurther, she doesn’t like my tone in giving her shit about it.\n\nCan’t save em all.",
   "created_utc": 1703276097,
   "score": 83,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keibsmd",
   "message": "Don't do it. If you aren't married, run away.",
   "created_utc": 1703276519,
   "score": 80,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kejqnyk",
   "message": "My then girlfriend cheated on me once in college when we were dating long distance. Been married for 13 years now and from the outside things are going well. She is a devoted wife and mother, we both have good jobs and are generally happy. However, our libidos are not matched which is something that I have struggled with since before we got married. The general lack of desire from her and knowing she chose someone else over me still haunts me at times even though it happened years ago. There have been a few times where she admitted she is not physically attracted to me. If I could go back I would choose a different path. I don't know why but it didn't bother me as much when I was younger, but now it really keeps me from being a truly happy person.",
   "created_utc": 1703297462,
   "score": 16,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei5ly8",
   "message": "My friend is just about to do this and I'm sitting on the sideline with a bowl of popcorn.\n\nPeople make some dumb decisions",
   "created_utc": 1703274056,
   "score": 51,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keianuc",
   "message": "Oh she ended up cheating again after the marriage, and I finally realized that love doesn't just take hard work — it takes hard work from both of you!\n\nFiled for divorced and I've been a Danve Machine tramp ever since!",
   "created_utc": 1703276064,
   "score": 26,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kej9pah",
   "message": "Reading these comments is a reminder to never get married 🫠",
   "created_utc": 1703290155,
   "score": 31,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehykih",
   "message": "My parents were both married before they met each other and both basically cheated before breaking up with their respective partners and then marrying each other.\n\nThey are still together since 30 years, while like 90% of my friends have divorced parents by now. Also I would add their marriage is quite happy and they still love to travel together a lot. \n\nTo add my mother e.g was „forced“ to marry quite young. She was not really forced but my grandparents were super catholic and in order to be allowed to live with her boyfriend, they said „fuck it, let’s just get married“. For my father it was a different thing, but I mean sometimes you don’t know with whom you fall in love.\n\nWhile I think usually it’s probably not a good sign to marry someone that cheated with you on their partner, I think we cannot generalise haha",
   "created_utc": 1703271289,
   "score": 140,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keimhfm",
   "message": "Divorced. I don’t put up with a cheater.",
   "created_utc": 1703280824,
   "score": 12,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kei6g2v",
   "message": "It did not last because he kept cheating.",
   "created_utc": 1703274389,
   "score": 23,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiadi7",
   "message": "She cheated while I shipped to basic and the whole time I was on baby leave. Divorce in the process.",
   "created_utc": 1703275950,
   "score": 25,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiaq0g",
   "message": "OP if they broke your trust then it’s gonna be very hard ever trust them again or not see them differently, and they’re likely gonna do it again.",
   "created_utc": 1703276089,
   "score": 25,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keihw8p",
   "message": "It failed, tried for four years but it was always there, never really trusted her again…",
   "created_utc": 1703278982,
   "score": 11,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kein2fg",
   "message": "Divorced when she left me for him 6 years later.",
   "created_utc": 1703281055,
   "score": 11,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keinsdn",
   "message": "Not me but I've seen it three times.  Each time the cheater cheated again ending the relationship.",
   "created_utc": 1703281343,
   "score": 11,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehtt5m",
   "message": "Over.",
   "created_utc": 1703269445,
   "score": 51,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keijena",
   "message": "We ended up divorced because they did it again. While this isn't the case with ALL relationships, I find that people in general don't change. They may say they will, and even mean it, but at the end of the day people are who they are. What you see is what you get.",
   "created_utc": 1703279598,
   "score": 10,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiw9jv",
   "message": "OP honestly at 21 you probably shouldn't be settling down yet anyway. Let alone trying to set up a lifetime with someone who has already cheated on you. Don't let this selfish tool damage your sense of self worth. You can and will do far better. Kick his ass to the curb and move on. Just learn from this and learn to recognise the red flags for next time.",
   "created_utc": 1703284643,
   "score": 10,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kej34ix",
   "message": "Happily divorced",
   "created_utc": 1703287419,
   "score": 10,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kekbzug",
   "message": "He kept cheating until I divorced him. Then he got cheated on by the woman had been cheating with, and he dumped her for the cheating even though he had been cheating on her too, lol.",
   "created_utc": 1703308479,
   "score": 10,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keimmo7",
   "message": "Divorced, but that bitch paid for my nursing school.",
   "created_utc": 1703280882,
   "score": 19,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keivjfn",
   "message": "I have a very blunt view but I firmly believe a cheater will always be a cheater a majority of the time. \n\nOP if you’re asking because you were cheated on just get out of the relationship. The emotional rollercoaster will not be worth it.",
   "created_utc": 1703284356,
   "score": 18,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kejdf1d",
   "message": "We were married 13 years. He cheated, I filed for divorce. He told me if we get a divorce that I should consider him a ghost and he died by suicide a few days after my birthday that year, leaving 3 kids behind. The whole thing was terrible.",
   "created_utc": 1703291744,
   "score": 19,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kelaw2g",
   "message": "My wife technically cheated on her partner with me, although their relationship was pretty much dead anyway. We've been together for 22 years since and no infidelity. Initially, I did think that maybe she'd do the same to me, but I was willing to take the risk.\r  \n\r  \nEvery relationship is unique and people cheat fir all sorts of reasons. In my wife's case, she needed to get out of an abusive (emotionally and physically) relationship",
   "created_utc": 1703329095,
   "score": 21,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keinjtp",
   "message": "Married someone who cheated with their best friends wife.\n\nWe divorced and the best friend stayed with his wife. \n\nHe turned into an abusive husband and they break up and get back together regularly. The children are messed up, the husband never trusts her and has hit her in anger.\n\nSo if you are looking for an answer on if you should stay, that’s it there.",
   "created_utc": 1703281248,
   "score": 8,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keivsoq",
   "message": "I need to stop reading these posts… The world is grim enough without the sad reality of the lonely future ahead.",
   "created_utc": 1703284459,
   "score": 9,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kej7ogm",
   "message": "Divorced. Turns out that was only the start of many shitty things she would do. If someone cheats on you leave, they don’t respect you and won’t start anytime soon.",
   "created_utc": 1703289305,
   "score": 10,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kejeu0e",
   "message": "The divorce was finalized exactly 2 months before our 4th anniversary. He married the other woman one month later as she was 7 months pregnant. It’s been 17 years and they’re still married and he is still a cheater. I remarried 12 years ago and have a 9 year old daughter.",
   "created_utc": 1703292375,
   "score": 9,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kejnc1h",
   "message": "Ok so I think I have a hot take on this. I cheated on who was eventually my wife when we dated. She broke up with me obviously. I dated other women and a few years later I kinda realized that I measured every woman against her. I had this awful realization that I would likely have to settle for second best. \n\nAs fate would have it our paths crossed again and we ended up dating. I actually would agree that most people fit into the “once a cheater, always a cheater” category, but I had a second chance and there was no way I was gonna screw this up. \n\nWe married and had kids. I loved her and never strayed. I avoided any situation that could even potentially lead to or be remotely considered the start of cheating. \n\nUnfortunately, she fell out of love with me and we are divorced. Boo. However, I learned that you simply CAN NOT cheat on someone and still love them. It’s something I would never do again. You can recover from being a cheater but there has to be consequences and you have to own up to the mistakes. I wish it worked out but I don’t regret not cheating again, even when the marriage sucked.",
   "created_utc": 1703296019,
   "score": 8,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kejqkkz",
   "message": "He left me for a girl he had a crush on in high school.... 25 years ago. They fight and have the most toxic relationship and I should have gotten myself out way sooner. Like before the marriage.",
   "created_utc": 1703297419,
   "score": 9,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiihb5",
   "message": "He cheated while dating. Said he’d never do it again. Well he did and we’re no longer together. Shame on me for believing him the first time.",
   "created_utc": 1703279220,
   "score": 18,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kehbfze",
   "message": "It’s good but i still have nightmares of him leaving me for her. I can forgive but forgetting has been hard.",
   "created_utc": 1703262409,
   "score": 129,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiabne",
   "message": "I think being a loyal or disloyal person kind of forms by the time you are an adult. Personalities change rarely.",
   "created_utc": 1703275929,
   "score": 16,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiaymj",
   "message": "He tried to kill her on multiple occasions. She cheated while married. We're blissfully happy and fully committed to one another. The thought of her cheating on me never crosses my mind.",
   "created_utc": 1703276185,
   "score": 8,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiky4c",
   "message": "He cheated in the dating period. He was just divorced after 20year marriage. I made excuses for it and believed he was truly remorseful and would never hurt me like that again. We married and as far as I know he had been faithful for over 7 years until he got drunk while on a vacation with our closest couple friends. He had an affair with the wife while her husband and myself were sleeping. I guess they thought no one would ever know and in their drunkenness decided to have a fling for the weekend when we would go to sleep.",
   "created_utc": 1703280208,
   "score": 8,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keitf3p",
   "message": "I would never marry someone who cheated on me while we were dating because they will do it again.",
   "created_utc": 1703283527,
   "score": 7,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiwjyq",
   "message": "Divorced. She has the kids over Christmas and it's miserable at my house over the holidays. I love my kids but the chain of events has turned the kids into hollow people with zero semblance of family. It's wonderful /s",
   "created_utc": 1703284755,
   "score": 9,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "keiylj3",
   "message": "Cheaters gonna cheat. She cheated again. Now she’s married to him, and has cheated on him (before and after they got married).",
   "created_utc": 1703285568,
   "score": 8,
   "submission_id": "18oiplk"
  },
  {
   "comment_id": "kej734z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18oiplk"
  }
 ]
}