{
 "submission_id": "18oi95e",
 "title": "What gift are you most looking forward to giving?",
 "selftext": "",
 "created_utc": 1703261001,
 "permalink": "/r/AskReddit/comments/18oi95e/what_gift_are_you_most_looking_forward_to_giving/",
 "score": 17,
 "url": "https://www.reddit.com/r/AskReddit/comments/18oi95e/what_gift_are_you_most_looking_forward_to_giving/",
 "comments": [
  {
   "comment_id": "keh81h8",
   "message": "Got my mom tickets to the hockey world cup next year",
   "created_utc": 1703261088,
   "score": 9,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehd14u",
   "message": "Before my son was born, my wife had a miscarriage and we have a dew We have two kids now and she has two bars on her necklace with their names. I bought a 3rd one with the date of the miscarriage and a baby foot.\n\nI only hope the date is correct. I remember she was traveling for a work conference in Texas and it happened when she got there. I was able to find the date of the hotel stay and based on the day of the week and what I was doing when she called I am 99% sure the date is correct.",
   "created_utc": 1703263025,
   "score": 6,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh8699",
   "message": "Got the wife a chicken coup. Looking forward to fresh eggs",
   "created_utc": 1703261139,
   "score": 2,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehet2i",
   "message": "I'm actually looking forward to my dad opening his presents from my sister, auntie and my uncle. I have found out they have each bought him a pair of slippers. My dad bought himself a new pair last month and will probably last him a year or 2. So at least he's sorted for the next 8 years or so. \n\nI have said nothing to any of them",
   "created_utc": 1703263709,
   "score": 4,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehautj",
   "message": "My son is getting a desk and new art supplies and my daughter is getting a huge doll house and lots of Barbies. We didn’t know if we were even going to swing Christmas this year but it worked out and I’m SO excited.",
   "created_utc": 1703262183,
   "score": 3,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehiv0u",
   "message": "2 gifts this year.\n\nour family dog, unfortunately had to be put down just due to cancer, this was devestating to my parents. I had a painting done with all of our family pets that have crossed the rainbow bridge including our family dog. I am givng this to my parents in memory of all our dogs and cats that have left us.\n\ni got my brother a custom sorting tray for his Pokemon cards. were both in our mid/late-30's and we rekindled our love for pokemon cards after our mom found our childhood card collections in the shed and we got back into it. collecting cards with my brother has brought us together again. So i had a shorting card tray made for him so he can organize his cards better.",
   "created_utc": 1703265262,
   "score": 2,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehm4xn",
   "message": "Got my mom her dream sandals (the one that’s good for arthritis lol). She’s happy. For my dad, money.",
   "created_utc": 1703266516,
   "score": 2,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehmtip",
   "message": "My time. It’s really precious",
   "created_utc": 1703266777,
   "score": 2,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keho9ua",
   "message": "Got my mum a Lego Aston Martin - she isn’t expecting it but I know she’ll like it",
   "created_utc": 1703267337,
   "score": 2,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh839x",
   "message": "Me just blessing someone with my appearance is more than a gift in my opinion!",
   "created_utc": 1703261107,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh87dr",
   "message": "Deez Nutz",
   "created_utc": 1703261152,
   "score": 0,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh7wql",
   "message": "Self-Esteem",
   "created_utc": 1703261036,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh7xk6",
   "message": "giving up",
   "created_utc": 1703261045,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh8gk4",
   "message": "A chocolate reindeer to my neighbours",
   "created_utc": 1703261250,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh8il7",
   "message": "Got my daughter a calendar of cat balls. Can’t wait to see her reaction. \n\nhttps://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR8qZtA2EVlKGZW74K7ccwR_9-dmvHqKFKFqA\u0026amp;usqp=CAU",
   "created_utc": 1703261272,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh8rz0",
   "message": "To Spread the gospel. not material!",
   "created_utc": 1703261372,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keh9szh",
   "message": "I gave my old cleared out iPads to people that can still use them for basic things (it gets full when you have a bunch of stuff downloaded), \n\nIt,was free,I hope they get something out of them.",
   "created_utc": 1703261776,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehidrn",
   "message": "This year, all of them for my mom.\n\nMy father passed this year, and my mom has put on a brave and strong face, but I know she's stuggling. It doesn't help that my siblings forced her to agree to nobody giving or getting any presents this year because they'd rather spend their money on vacations and other things for themselves.\n\nShe thinks I'm going along with the \"no presents\" thing, but in reality I've gotten her multiple things, including a couple things my Dad would get her every year without fail(a certain perfume she likes).I'm only going along with it so she doesn't feel obliged to get me anything in return.Every year Mom is the one who makes sure that everyone had *something* under the tree and in their stocking, so Dad went out of his way to make sure that she got something special too. \n\nTL;DR: Mom thinks nobody is getting presents this year, but really she's the only one getting anything.",
   "created_utc": 1703265075,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehqree",
   "message": "every christmas, my mother complains that her light-chain is too short for the whole christmas tree, so I got her a longer one",
   "created_utc": 1703268281,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehrp4a",
   "message": "My GenZ cousin joined the US Navy this year. I heard from his dad that they had a \"Jelly Donut Incident\" (Full Metal Jacket reference for those who don't know) in basic training.\n\nI got him a $50 Dunkin Donuts gift card for Christmas so him and his crew mates can have donuts on me now that the drill instructors can't hold it against them.",
   "created_utc": 1703268637,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehs79t",
   "message": "3D Printed and painted my brother an Ingsoc Half-life 2 combine mask. It has red LEDs in the eye sockets as well, it's gonna be sick.",
   "created_utc": 1703268832,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehsx3f",
   "message": "My nephew (age 4) has autism and is largely non-verbal. He can say maybe 40-50 words total, and can’t really form sentences yet. He is currently obsessed with sinks (like for dishes, hand washing, etc). I found him a play sink that has a motor to circulate water down the drain of it and back through the faucet. This saves his mom and grandma from holding him up to the kitchen sink for 20 minutes so he can play with/examine things. He can say “fountain”, “handle”, “sink”, and “water”, which is really impressive for a kid with as limited a vocabulary as he has! I’m so excited for how excited he is going to be about it. He gets his own sink!",
   "created_utc": 1703269105,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehtalw",
   "message": "I sent my brother a bunch of deep dish pizzas from Lou Malnati’s in Chicago.",
   "created_utc": 1703269247,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kehwsxi",
   "message": "My mom loves turtles and I got her that cool turtle necklace\n\nhttps://www.amazon.de/YFN-Schildkr%C3%B6te-Halskette-Sterling-Geschenke/dp/B0C58DF1NJ/ref=mp_s_a_1_16_sspa?crid=346ULPFZJAFIK\u0026amp;keywords=schildkr%C3%B6te+geschenk\u0026amp;qid=1702560088\u0026amp;sprefix=schi%2Caps%2C100\u0026amp;sr=8-16-spons\u0026amp;sp_csd=d2lkZ2V0TmFtZT1zcF9waG9uZV9zZWFyY2hfYXRmX25leHQ\u0026amp;psc=1",
   "created_utc": 1703270604,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kei58s1",
   "message": "My love",
   "created_utc": 1703273913,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kei59d7",
   "message": "Hope!",
   "created_utc": 1703273919,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keiliw4",
   "message": "Peace \u0026amp; Quiet",
   "created_utc": 1703280440,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "keis2i8",
   "message": "Got my 4 year old a travel microscope for her adventures",
   "created_utc": 1703282995,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kejegpn",
   "message": "I bought my 6 year old niece a Tomagotchi. Fr I want to play with it lol. Hope she likes it!",
   "created_utc": 1703292211,
   "score": 1,
   "submission_id": "18oi95e"
  },
  {
   "comment_id": "kejik15",
   "message": "a nail gun and a lowes gift card",
   "created_utc": 1703293987,
   "score": 1,
   "submission_id": "18oi95e"
  }
 ]
}