{
 "submission_id": "18oi8qx",
 "title": "What is the worst thing you or someone you know posted by mistake on social media ?",
 "selftext": "",
 "created_utc": 1703260974,
 "permalink": "/r/AskReddit/comments/18oi8qx/what_is_the_worst_thing_you_or_someone_you_know/",
 "score": 44,
 "url": "https://www.reddit.com/r/AskReddit/comments/18oi8qx/what_is_the_worst_thing_you_or_someone_you_know/",
 "comments": [
  {
   "comment_id": "kehcnle",
   "message": "Many years ago, a coworker of mine made a series of Livejournal posts that she thought were private, chronicling how she was cheating on her husband.",
   "created_utc": 1703262881,
   "score": 143,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehd7to",
   "message": "Old friend of mine posted his girlfriend’s tits on Facebook when trying to post a photo of his new quad. He titled it “like my new toy?”. 16 likes and one comment later he realized what he had done.",
   "created_utc": 1703263095,
   "score": 98,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehmamn",
   "message": "My cousin who was in his 50’s  posted naked pics of his gf on facebook dressed as an elf holding presents and candy canes.",
   "created_utc": 1703266575,
   "score": 43,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehrlum",
   "message": "A girl I went to school with posted a picture on Facebook of her new tattoo, “Belive”. It was up for about 15 minutes before someone posted about the spelling and she deleted it. How she or the “artist” didn’t notice is beyond me.",
   "created_utc": 1703268603,
   "score": 204,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keh9cr2",
   "message": "Chris evans screen recording his gallery….. lol",
   "created_utc": 1703261600,
   "score": 106,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehx1co",
   "message": "My ex thought she was posting in a private chat.  She admitted to having a few affairs.\n\nWhat's really sad is all the support she got for it and, of course, everyone said it was my fault.\n\nPretty much the only ones who criticized her and supported me over this were her two sisters.",
   "created_utc": 1703270695,
   "score": 165,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehk250",
   "message": "I ranted about my job and my dislike of my supervisor on MySpace. I worked for a political campaign at the time. A blogger for the opposition party found it and put it on blast. I was emptying out my desk the next morning. I deserved it and leaving that field was for the better in my personal life, but it was one of the most embarrassing and humiliating moments of my life. The thing has spread around the office like a wildfire and seeing everyone watch me be escorted out remains burned into my brain.",
   "created_utc": 1703265718,
   "score": 173,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehwseu",
   "message": "Maybe tamer than most on here, but I have a friend who only posts pictures of herself that are heavily photoshopped and/or have snapchat filters that make her look \"better\". (I say \"better\" because it clears up her skin and straightens her teeth, but it makes her look so fake she looks like she's a CGI puppet.) It's so embarrassing, there's all these photos of her family on vacation and everyone looks fine except it looks like her husband has his arm around his CGI waifu.\n\nBut every now and then, every once in a while, she accidentally uploads a genuine photo, and it's shocking to see her *look like a real person*. These photos typically get taken down soon after and replaced with a CGI version.",
   "created_utc": 1703270598,
   "score": 30,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehpt2d",
   "message": "My little brother’s friend posted an album of his 1 year old on Facebook. Middle of the album was a dick pic with his face.",
   "created_utc": 1703267917,
   "score": 27,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehjb4x",
   "message": "Gather 'round children and let me tell you of the horrors of early Facebook. Back in the late 00s Facebook had a feature where you could send \"gifts\" to people that were really just a digital picture and spam. 90% of them were so-and-so sent you a bouquet of roses and it'd be a little picture of some flowers and you could click to send another \"gift\" to someone else. Anyway, my dad didn't realize that those would show to everyone on your friends list, and as he was in the process of leaving wife #2 for wife #3 I logged on one day to a wall of \"[Dad] has sent a spanking to [wife 3]\", \"[dad] has sent a slave bikini Leia to [wife 3]\", \"[dad] has sent a sensual kiss to [wife 3].\"\n\nI was already mad at him over the obvious affair he had been having, so this triggered us not speaking for several years.",
   "created_utc": 1703265434,
   "score": 110,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehshb7",
   "message": "About 7-8 years ago a married (to a woman) guy in Scotland tried to post a pic of his grandson on Facebook and accidentally uploaded two photos of himself topless with some guy's dick in his mouth. He couldn't work out how to delete it for ages and ended up claiming it was a 'face swap'. I always wondered if he got away with it or not.",
   "created_utc": 1703268937,
   "score": 213,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehtp72",
   "message": "Attractive girl I know took a steamy shower pic with boobies out on her Instagram story. I figured it was an accident and felt bad so I let her know, she was so embarrassed she pretty much cried to me lmao",
   "created_utc": 1703269403,
   "score": 185,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehd7y6",
   "message": "People who accidentally type searches into the ‘New Post’ box. \n\n“Grandpa why is your new Facebook status ‘big-titty lesbians eating ass’?”",
   "created_utc": 1703263097,
   "score": 134,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehm9uk",
   "message": "I was fucked up on drugs, blacked out and posted a picture I drew of a melting face that said HELP “save me from me” on the forehead,with a song about doing hard drugs, playing over the video. I didn’t even remember doing it. My whole family saw it. Everybody saw it fucking embarrassing and pathetic. Addiction is evil and no joke. God bless.",
   "created_utc": 1703266568,
   "score": 157,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehppdg",
   "message": "Someone posted something about loving JFK and I went posted what I thought was a nice normal gif of JFK, not knowing that it was a gif of the zapruder film when he gets shot in the head but over and over again at a seizure inducing speed.",
   "created_utc": 1703267878,
   "score": 94,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehybpq",
   "message": "Idk if it's accidental. But i did regretted it.\n\nWhen i was 16 i was super into green day and blink 182. I saw a video of a live performance where they were butt ass naked with only their guitar covering their crotch. I thought it was hilarious so i grabbed my own guitar,get naked and took a pic of me doing the same thing. I posted it on myspace. The next day in school my whole class was kinda freaking out about it.",
   "created_utc": 1703271194,
   "score": 89,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehq3x0",
   "message": "Few years ago now I thought i had a new mole on my skin and being the huge health worried that I am I immediately panicked and went to do an e-consult online. I could only do it on my laptop so I uploaded the pictures I took of my skin on Facebook so I could save them on my computer, silly me forgot to change the privacy settings to ‘Only me’ who could view it and a few moments after uploading my best mate pops up asking me “Why have you posted your fat on Facebook?” Had he not done that who knows how long I would’ve left it there for!",
   "created_utc": 1703268032,
   "score": 73,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehzddf",
   "message": "A woman in my neighborhood accidentally posted a nude of herself in her dirty bathtub. She realized it pretty quickly but not quickly enough. So many people still have the screenshot.",
   "created_utc": 1703271601,
   "score": 34,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei3u6e",
   "message": "Remember when Rafael Ted Cruz shared incest porn on his Twitter?",
   "created_utc": 1703273360,
   "score": 37,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei2m4p",
   "message": "Girl I worked with made a Facebook post about a “nice hot bath” but EVERYTHING was reflected in the tap.",
   "created_utc": 1703272878,
   "score": 63,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei1sf0",
   "message": "I sent my boobs to my sister by mistake, followed by : does this look like a cancer growth to you ?. Trying to save face",
   "created_utc": 1703272553,
   "score": 54,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei2y7q",
   "message": "A girl I knew made an instagram post on Remembrance Day (Canadian version of Memorial Day). It said something like \"Today I want to remember my amazing Grandfather and Opa. Both of them fought bravely in WW2, even though they were on different sides\". The pictures were of her grandfathers in military dress, and the Opa was wearing a very.... distinctive uniform.\n\nI still wish I had screenshotted it, but it was gone when I returned.",
   "created_utc": 1703273011,
   "score": 47,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehzm6w",
   "message": "I’m pretty sure the rapper Nelly posted a video of himself getting a bj on instagram. Considering his follower count, that’s pretty bad…",
   "created_utc": 1703271697,
   "score": 24,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei16kx",
   "message": "This random girl I follow on Instagram that happens to be from the same town as me once accidentally posted a video of her fully nude in the shower on her story\n\nHappened just before midnight and I was high as fuck watching a movie whilst on my phone and had to do a double take as I was so confused at first\n\nIt was up for less than 5 minutes before she realised or someone told her",
   "created_utc": 1703272312,
   "score": 21,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei2ri6",
   "message": "When I first met my gf a few years back… we were chillin one day at my house… and at some point she started playing with my dick while recording… and my lil brother called me like 3 times back to back (FaceTimed me) and 2 of my best friends were blowing my phone up. \n\nShe accidentally posted it on my Snapchat story as she was recording off my phone lmao. \n\n\nNot really a big deal my and my friends laugh about it to this day.",
   "created_utc": 1703272937,
   "score": 19,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei31ak",
   "message": "I accidentally posted a weight loss progress pic that happened to be naked in the group chat. No way to unsend it. I freaked out and tried to hide it under spam which made it more obvious. Embarrassed for days. At least everyone got a good laugh out of it.",
   "created_utc": 1703273044,
   "score": 19,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei5zsm",
   "message": "The singer in my semi-successful band fell asleep holding his iphone whilst we were on tour.\n\nHe somehow shared a zip file containing our new, unreleased album to Facebook whilst he was asleep. We'd spent months and thousands of dollars working on it, and we were meticulously planning the launch. And he just posted it. People downloaded it and shared it. That was it.\n\nI still can't believe it to this day.",
   "created_utc": 1703274208,
   "score": 42,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei3ufw",
   "message": "A friend of mine (who I’ve since lost contact with) posted a POV photo of his naked girlfriend stretched out below him with his cock inserted. He made the post at roughly 2am (I was working nightshift), and he deleted his entire social media presence by 8am.",
   "created_utc": 1703273363,
   "score": 17,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehztpe",
   "message": "A guy i went to college with posted a mirror selfie to show off his back muscles, but he had another mirror on the other side of the room, which was visible in the reflection and showed that he was ass naked. full penis on instagram",
   "created_utc": 1703271778,
   "score": 55,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keh86de",
   "message": "Dick pic",
   "created_utc": 1703261140,
   "score": 39,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keh7z5v",
   "message": "A guy posted his Crypto account summary.  No seed or anything, but somehow he posted his account summary. He's doing pretty well.",
   "created_utc": 1703261063,
   "score": 29,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehvpjr",
   "message": "I once sent a porn video with my boyfriend to a work chat... I immediately deleted it, but several people still managed to see it. They didn't ask me anything about it",
   "created_utc": 1703270182,
   "score": 51,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei9v68",
   "message": "Coworker got drunk and was posting Snap stories at the bar. Was tapping through the next morning while taking a shit and kind of chuckling at the progression of drunkenness with each passing snap. And there it was, the nip slip. I distinctly remember audibly saying \"Ha, nice... Oh noooo...\"\n\nIt was a funny conversation on monday morning.",
   "created_utc": 1703275746,
   "score": 13,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei8oll",
   "message": "Some of the worst things I’ve seen were not mistakes. Just people sharing waaay too much information with the world about their family and relationships and it’s so embarrassing.",
   "created_utc": 1703275276,
   "score": 12,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei2yac",
   "message": "Had a gay Facebook friend accidentally post a hardcore porn ad (dude with dick in mouth)on his wall, he quickly deleted but then posted that it wasn't funny as his mom was on Facebook.",
   "created_utc": 1703273012,
   "score": 11,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei632k",
   "message": "Full nude jerking off in the shower on Snapchat story. When I saw it, it had been up for 16 minutes. Dude didn’t take it down for almost half an hour. He is probably horrified",
   "created_utc": 1703274245,
   "score": 11,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei969b",
   "message": "I had a friend that is a digital illustrator, she takes custom orders.\n She logged into the wrong insta and cross-posted some very detailed and quite frankly, very well done furry porn to her fb wall.\n I sent her a message within 2 minutes of her posting.\n But that's how i found out furry porn is expensive and you never know who does what to pay the bills.",
   "created_utc": 1703275471,
   "score": 10,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehxk5s",
   "message": "When I lost my virginity to a girl I texted my friend about it the next day but sent it to her on mistake 😔\n\nIt's not social media but close",
   "created_utc": 1703270898,
   "score": 27,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei1sfs",
   "message": "Somehow, Facebook recorded me and my girlfriend having an argument and posted it... I had my phone in my pocket and hadn't been on Facebook in at least an hour.\nI deleted it as fast as I noticed sound coming from my pocket",
   "created_utc": 1703272553,
   "score": 19,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei3zei",
   "message": "I posted a selfie before the gym on BeReal a few weeks ago, didn't realize you could clearly see my dick through my shorts until my GF texted me about it. Normally not a big deal, but it's only her friends that follow me on the app",
   "created_utc": 1703273416,
   "score": 8,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei5bf5",
   "message": "My Twitter and Facebook both got hacked a few years ago.  I didn't own a smart phone at the time, just a regular dumb phone.  I was about 4 hours from home and started getting text messages from people all over the place asking me why the fuck I was posting porn all of a sudden.\n\nEnded up having to call a trusted friend, give him my email password and ask him to please take care of it.  Fun day.",
   "created_utc": 1703273940,
   "score": 7,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei9ycf",
   "message": "There was a lady (Google Margret van Wyk) who sent a coochie pic intended for her husband to her kids parents hockey group.",
   "created_utc": 1703275781,
   "score": 8,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei4r3o",
   "message": "When Ed Balls tried to search his own name on Twitter but instead posted it to his feed. \n\nNot the worst but it did birth national Ed Balls day which is hilairous to me - 28th April.",
   "created_utc": 1703273720,
   "score": 15,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei2z6c",
   "message": "A girl I used to work with posted a screen shot of a selfie she took, underneath the selfie there was the other pictures in her gallery and one of them was her giving a blowjob.",
   "created_utc": 1703273021,
   "score": 14,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei55ak",
   "message": "I ranted about my job and got doxxed, worst experience of my life",
   "created_utc": 1703273875,
   "score": 13,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei8jrc",
   "message": "Way back when. I posted pics of me and an EX with our new Dyson. Our friends had always ribbed us a bit about my old vacuum which was a hand me down from the 80's that frankly barely had suction. So this was quite the home life upgrade. She was doing some posing I took the pics. We both missed that shiny new canister totally let you see I was naked. Now I am a well known nudist in my own home so it wasn't shocking that I was naked, It just wasn't expected in a posted where you know people on 5 continents from the friends list would see em.",
   "created_utc": 1703275223,
   "score": 6,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keib8r8",
   "message": "My aunt's boyfriend posted her boob online when she got out of surgery. He didn't know it was risqué.",
   "created_utc": 1703276299,
   "score": 7,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keibx04",
   "message": "I had a friend who is kinda autistic repeatedly post porn on his Facebook. He kept acting like he had no idea he’d done it when we’d message or call him about it, and he for whatever reason, had the hardest time deleting it. Funny enough, he never got his account suspended or anything. It was like weekly, just straight up pics of women masturbating or sucking dicks with some porn site name and tons of people commenting “uh, dude you know you just posted porn to your Facebook profile?” And him just acting oblivious and leaving the posts up. The funniest part is we’re from the deep, religious south so most of his FB friends were conservative Christians. He gets really mad if you ever bring this up and pretends it never happened. Was a hilarious and magical time.",
   "created_utc": 1703276569,
   "score": 7,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keidbku",
   "message": "I worked at a lab during covid pandemics. My former boss sent by mistake to his WhatsApp status a corona test result instead to the patient (with the patient's name and the logo of the lab). He didn't notice until his boss reminded him of lab tests confidenciality... He got almost fired because of being too boomer to use chats properly",
   "created_utc": 1703277140,
   "score": 7,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keiee74",
   "message": "Not sure if it technically counts as “social media” but we got a new spindle sander at work (carpentry shop) last year. If you don’t know what that is, picture a dowel about an inch around and 6 inches tall with sandpaper around it rotating very quickly while also moving up and down. \n\nI took a video of it running with the caption “best seat in the house!” and sent it to what I thought was a WhatsApp group chat with my friends. Shortly after posting I realized it was, in fact, the group chat with the board members of my region’s chapter of an international college honors society. \n\nI have never been so thankful that WhatsApp gives you the ability to delete a message. I still don’t know to this day if anyone saw it.",
   "created_utc": 1703277574,
   "score": 7,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei0a04",
   "message": "Had a coworker, another manager in my district, get drunk right when COVID started and realized she didn’t know how Snapchat worked.  For about a 90 minute stretch, kept posting videos of her squeezing her bare tits and teasing her clit over her panties.  She’s a real cutie so I wasn’t upset at all.",
   "created_utc": 1703271957,
   "score": 16,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehuamc",
   "message": "In high school I put a picture on a private Instagram of myself in between 2 sophomores in their underwear. I thought I was sick. They weren’t happy, like AT ALL. I regret some of those days.",
   "created_utc": 1703269635,
   "score": 9,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei2dbe",
   "message": "i accidentally posted porn on my families gc and i deleted it for myself which really got me in trouble \n\n\nlooking back on it it was a stupid mistake",
   "created_utc": 1703272783,
   "score": 10,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei9k6h",
   "message": "I had a very strong friend group in college long before social media. As people get older they change, make new friends. Hannah and Lakmé were so close in college, best friends, did everything together just as friends. They were like sisters for years. Hannah got married and stopped texting Lakmé, stopped inviting her to events and parties. Hannah started her new life. Lakmé got drunk and got on instagram. We all kept Hannah’s catching HPV three times in college a secret. Cut to 15 years later and Hannah posted photos of her new baby. Lakmé had no idea she was even pregnant. So she posted something like, “Great baby, hope it didn’t catch HPV on the way out from those three times in college you caught it from randos you met on the street.” I guess Hannah didn’t keep up daily with her Instagram and we all saw it. Us, her family, new coworkers, her new friends. Lakmé sobered up the next day and realized her mistake. But the damage was done.",
   "created_utc": 1703275624,
   "score": 5,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keia1mq",
   "message": "No socials, but new a girl who sent her running one out on her family chat. Had her parents brother cousins, aunts, uncle's, and Grandma. She fucking died and I couldn't hold the laughter. I heard her crying",
   "created_utc": 1703275818,
   "score": 4,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keic2ct",
   "message": "A highschool friend posted hundreds of pictures from her porn tryout on FB.  Hundreds.  She then proceeds to tag everyone so we won't be surprised if we see them.  Pretty much guaranteed at this point.  Her reasoning?  Just so she wouldn't lose them.",
   "created_utc": 1703276629,
   "score": 4,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keie14f",
   "message": "My bio parents, who haven't been together since before my birth, openly sexting on each other's Facebook walls.",
   "created_utc": 1703277428,
   "score": 5,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keievmo",
   "message": "Knew a girl that had her phone stolen and it was already logged into to her FB and IG and she had a bunch of nsfw pics on her phone and yea.. they all got posted to her FB and IG for everyone to see.  It obvi got removed by FB but it was up for at least 30-45 mins.  And not just  like a modest mirror selfie with tits out, the pics were like up close spread eagle and finger in the butthole type pics lol.  To make it worse the first comment on there was from her grandma slut shaming her thinking it was actually her that made the posts lol.  Shit was wild.",
   "created_utc": 1703277770,
   "score": 5,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehy0sp",
   "message": "A family member of mine who i wont specify for privacy reasons had came out on Facebook, they then later deleted the post and said their account was hacked (this is an old story and also likely to be incorrect)",
   "created_utc": 1703271076,
   "score": 8,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei8xt2",
   "message": "Probably when ted cruz shared step-porn on twitter",
   "created_utc": 1703275378,
   "score": 4,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keidf31",
   "message": "Some guy I know uploaded a video of him jerking it on to his fb story",
   "created_utc": 1703277180,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keidjul",
   "message": "My grandmother was sending nudes to some guy on her phone and apparently accidentally posted it on Facebook. Everyone in our family saw the old cave and I never wanted to be more blind in my life then in that moment.",
   "created_utc": 1703277232,
   "score": 5,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keidyi8",
   "message": "I loved the grandma who posted a picture of her grandson on FB, but it was really a selfie of her nude, huge boobs laying in the sun.\n\nHer friends went crazy trying to get her to take it down, but she didn't know how!",
   "created_utc": 1703277398,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keig77e",
   "message": "My father liked the local swingers group, not realizing that activity would be seen by EVERYONE. Cue multiple calls to me by every single mutual friend... . And he couldn't figure out how to undo it, so we made a one time deal that I would log into his account and do it for him and not look anywhere else. (Not that I wanted to, I'd already made that mistake when trying to locate a blank CD at our house. It was not blank...)",
   "created_utc": 1703278299,
   "score": 5,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keigdwq",
   "message": "I thought instagram was just a way to add cool filters to stuff so I used it to make an artsy dick-pic I sent to my then GF. \n\nAccount got suspended about 30 seconds later and I realized what happened. Thankfully I didn’t have any followers on there at the time, but that was embarrassing to say the least.",
   "created_utc": 1703278374,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keigg7s",
   "message": "Years ago I went \"Live\" on FB and my phone was in my suit jacket pocket. Hundreds of people witnessed me pushing an entire shopping cart full of merchandise out of Walmart. \n  Surprisingly nothing happened legally. I did however face a barrage of comments from my friends and some relatives for what I did. My super secret second life was exposed.",
   "created_utc": 1703278399,
   "score": 4,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keii02v",
   "message": "Maybe not that bad, but my friend's mom joined Facebook. She wanted to snoop on an old boyfriend of hers. She typed his name over and over in the search box...but it wasn't the search box. It was the status update box. We all saw his name repeated over and over on the feed. She then made another status update that was \"how do I delete this shit?\"",
   "created_utc": 1703279026,
   "score": 5,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keij4y2",
   "message": "A coworker of mine came to work with a neck brace. She said she wasn't going to be able to work for a while. A few days later she posted a video of herself dancing at a party. Someone who didn't like her told the company and she was fired.",
   "created_utc": 1703279487,
   "score": 4,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehynpp",
   "message": "A redneck cousin fucker and washed up actor posted that he thought President Biden should be publicly hung.",
   "created_utc": 1703271324,
   "score": 12,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehmvk1",
   "message": "I wouldn't say by mistake, but I was literally coerced and forced to write about my trauma by people protecting my ex girlfriend's partner because they wanted to make him feel better that he, apropos of nothing, disclosed to me embarrassing shit that he presumably wanted to pretend that he was coerced. \n\nThey were pissed off that I refused to take part in their honeypot bullshit or date/hook up with young people  and I  notified the FBI and police. Turns out that criminals don't like accountability.",
   "created_utc": 1703266798,
   "score": 10,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehw0uz",
   "message": "My girlfriends uncle (by marriage, not biological), who cheats on his wife and seemingly everyone knows except the wife (we think, she could be suppressing it), posted a picture of his girlfriend or prostitute or whatever on Facebook on accident. My gf was one of the few to see it before it was taken down a short while later",
   "created_utc": 1703270302,
   "score": 7,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei44qc",
   "message": "Medical issues.",
   "created_utc": 1703273474,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei7kzi",
   "message": "Ed Balls",
   "created_utc": 1703274834,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keifood",
   "message": "My best friend accidentally posted an extremely nsfw video of her meant for her boyfriend in a group with literally everyone in our major. Her phone screen was broken so she couldn't even delete it herself, and it's what caused her to send it in the first place. \n\nThankfully, it was very late in the night and I think I was the only one who saw it and I deleted it within seconds of her sending it. I was one of the few people with permission to delete other's messages too. I deleted because I thought it was a porn video and figured she had a virus on her phone or someone sent it from her phone as a prank. Didn't even cross my mind that it was HER lol",
   "created_utc": 1703278092,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keifzgr",
   "message": "My buddy asked my Facebook and other websites kept posting porn ads, we had to tell him his ads are based off his viewing history",
   "created_utc": 1703278213,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keigmhs",
   "message": "My friend posted a pic of him and his girlfriend topless in bed like a sex selfie  on his wall for everybody to see anyway i messaged him asking him to take it off otherwise his parents will see so he didn’t believe me then blocked me but deleted it after meaning i was right",
   "created_utc": 1703278469,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keihkwi",
   "message": "In college my friends boyfriend ( now husband) was drunk uploading pictures from his phone to facebook and accidentally uploaded a topless picture of her. We screamed and asked another friend to confirm what and where we were seeing it! Called her repeatedly to let her know. She finally answered and didn’t even seem upset ( ‘I was sleeping’). It was gone a few minutes later.",
   "created_utc": 1703278854,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keij2u3",
   "message": "I sent a nude to my friend so she could approve of it before I sent it off to a guy I liked. Well apparently she was presenting in her college class and forgot to disconnect her phone from the projector before her whole class saw my nude. Good times.",
   "created_utc": 1703279463,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keijgct",
   "message": "I’m 67. Sitting in the hot tub naked, wearing a rain hat and drinking a beer.  My wife comes to the door and snaps a pic..she is partially blind. I didn’t have the jets on.  Within 5 minutes my 40 yr old son texts..” hey you can see Dads junk in that picture you just posted..” his wife had seen it lol. Facebook.",
   "created_utc": 1703279618,
   "score": 3,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kei0461",
   "message": "Oh it was me.  I was complaining to my sister in law about her brother not paying child support and it was on her wall.  I didn't know.",
   "created_utc": 1703271893,
   "score": 5,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehpi75",
   "message": "I got temp-banned from one of my FB meme groups for accidentally posting a meme that had a Nazi symbol that I somehow overlooked.",
   "created_utc": 1703267801,
   "score": 10,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keh7uem",
   "message": "Elon musk?",
   "created_utc": 1703261009,
   "score": 7,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "kehhwxp",
   "message": "[deleted]",
   "created_utc": 1703264895,
   "score": 9,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keihs6y",
   "message": "I had a guy I know post a live facebook video of his girlfriend sucking him off - I'm not sure if it was intentional, but if it was, he was clearly hammered.",
   "created_utc": 1703278935,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keijsks",
   "message": "A friend posted a video to their Snapchat story in the middle of the night her and another girl snorting coke off a guys dick at a club and both trying to suck him. It had disappeared by the next morning, but a lot of people's memories remained.",
   "created_utc": 1703279756,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keijzrg",
   "message": "My girlfriend at the time was showing her parents some pictures from our vacation, casting it onto the television. In the middle of the pictures there was a .gif of my hard cock jiggling from side to side.",
   "created_utc": 1703279836,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keiktvv",
   "message": "Well there was that swedish politician who posted a picture on him at the beach…with his dick showing.",
   "created_utc": 1703280163,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keil5yp",
   "message": "Not a post, a comment. Our former classmate’s baby was stillborn. She posted her trauma and another person we went to school commented “congratulations! How is the baby doing now?” \n\nI messaged that person and told them, hey you misread that. Would you want to edit your comment? She replied she was a social media expert and knows what she’s doing. Comment remained. \n\nLady posts a tribute every year, with the photo, and yes, that horrible comment reappears",
   "created_utc": 1703280294,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keil65t",
   "message": "Pictures of their family orgy. Honestly so bizarre.",
   "created_utc": 1703280297,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keil7e6",
   "message": "i posted my dick by mistake",
   "created_utc": 1703280310,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keim2ov",
   "message": "Long ago some \"new rich\" Russian woman bragged on LiveJournal about opening her new restaurant in Moscow.  Lots of pictures and menus and describing her problems finding good staff.  Interesting reading.\n\nI check back a year later.  All her restaurant posts were deleted and she's living in a big city in Africa doing charity work.  I figured she popped up on the radar of the Russian Mafia and had to flee the country.",
   "created_utc": 1703280660,
   "score": 2,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keim8q0",
   "message": "My girlfriend accidentally sent a picture of Auschwitz-Birkenau to the landlord groupchat 2 days ago 🤣🤣",
   "created_utc": 1703280727,
   "score": 1,
   "submission_id": "18oi8qx"
  },
  {
   "comment_id": "keib9uy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18oi8qx"
  }
 ]
}