{
 "submission_id": "18oof9m",
 "title": "What’s something your body does and you don’t know if it’s normal?",
 "selftext": "",
 "created_utc": 1703277734,
 "permalink": "/r/AskReddit/comments/18oof9m/whats_something_your_body_does_and_you_dont_know/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/18oof9m/whats_something_your_body_does_and_you_dont_know/",
 "comments": [
  {
   "comment_id": "keiim5o",
   "message": "Lots of people have joints that crack, but my right ankle would make a noise so loud it echoed off walls. It didn't take any special effort to crack that loudly either: just sit for a few minutes, shift absentmindedly, and BANG. There was no real way to prevent it; delaying just made things louder.\n\nPeople often mistook that sound for the building settling. Was glad of that mistake because otherwise it would have been embarrassing. The few individuals who figured out the source assumed I must have had massive ankle problems.\n\nExcept I've never had an ankle injury of any sort. Never even twisted it. Nature gave me strong tree-trunk-like ankles.\n\nA few months ago it stopped. Decades of shattering noise, then silence. I have no idea why.",
   "created_utc": 1703279274,
   "score": 3,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keil5ti",
   "message": "Sometimes when I lie in bed in total darkness I see random bright flashes. Not often but it always startles me when it happens.",
   "created_utc": 1703280293,
   "score": 3,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keifpfz",
   "message": "My jaw pops.  Constantly.   Whenever I open my mouth too wide, yawn, anything like that it pops in place.  I'm seriously freaked that one day it will get stuck.",
   "created_utc": 1703278100,
   "score": 4,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keiktfo",
   "message": "I get a lot of muscle spasms and twitching probably both because I need to drink more water and ptsd",
   "created_utc": 1703280157,
   "score": 2,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keig3nw",
   "message": "My knees crack so loudly while standing up \u0026amp; sometimes when walking after not moving for a bit but I don't have any pain or stiffness.",
   "created_utc": 1703278259,
   "score": 3,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keigd0k",
   "message": "Tolerate massive quantities of alcohol and drugs",
   "created_utc": 1703278364,
   "score": 2,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keiizez",
   "message": "Sometimes I'll get randomly hungry and eat over 5,000 calories a day for a few days. Then I won't eat much for a few days. And my weight is relatively constant besides for bloating.",
   "created_utc": 1703279424,
   "score": 2,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keigqrg",
   "message": "damn its a good question  \nsomething crawls under my skin,i almost dont feel like i need to sleep at all,and sometimes my heart is hurt without any reason.",
   "created_utc": 1703278517,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keikf76",
   "message": "I spit when I smell something bad",
   "created_utc": 1703280003,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keihc3t",
   "message": "If I don't keep my ears warm, I get a sore throat",
   "created_utc": 1703278755,
   "score": 0,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keimsma",
   "message": "piss comes out of my butthole and shit comes out of my dickhole",
   "created_utc": 1703280947,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keig63p",
   "message": "Sometimes I wake up in the night choking and coughing on what feels like a acid and I can't sleep again for hours",
   "created_utc": 1703278286,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keiifri",
   "message": "breath",
   "created_utc": 1703279203,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keijioo",
   "message": "Every once in awhile I poop out a little glob of blood.",
   "created_utc": 1703279644,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keimt5l",
   "message": "My body builds resistances to substances quick as hell. Alcohol and drugs get expensive too damn fast. I'll take a tolerance break for a month or two and there's no reduction.",
   "created_utc": 1703280954,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "kein2hc",
   "message": "Nearly every time I stand up quickly, I feel dizzy, lightheaded, and my vision gets super blurry, sometimes completely going black. Then, a few seconds later, I’m fine again.",
   "created_utc": 1703281056,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keinnm4",
   "message": "Doctors told me to use lotion to get rid of the incessant itching deep in my bones. After testing, I was only extremely anemic. Now I know!",
   "created_utc": 1703281290,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keis1kz",
   "message": "I pee 30 times a day",
   "created_utc": 1703282985,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keiskir",
   "message": "I will be nearly asleep and my whole body will jump, or jerk. It has actually hurt several times. It won’t happen every single time I try to fall asleep but it happens at least a couple times a week. I believe it’s anxiety",
   "created_utc": 1703283192,
   "score": 1,
   "submission_id": "18oof9m"
  },
  {
   "comment_id": "keitlkb",
   "message": "Sleep paralysis 😱 I mean google says plenty of other people experience it too… but is it normal??",
   "created_utc": 1703283597,
   "score": 1,
   "submission_id": "18oof9m"
  }
 ]
}