{
 "submission_id": "18op4jy",
 "title": "What is the best example of \"kid logic\" you have ever seen?",
 "selftext": "",
 "created_utc": 1703279695,
 "permalink": "/r/AskReddit/comments/18op4jy/what_is_the_best_example_of_kid_logic_you_have/",
 "score": 235,
 "url": "https://www.reddit.com/r/AskReddit/comments/18op4jy/what_is_the_best_example_of_kid_logic_you_have/",
 "comments": [
  {
   "comment_id": "keipxzw",
   "message": "I desperately wanted a kitten when I was younger. Every time we went to the grocery store, I'd try and sneak cat food into the shopping cart, thinking that if we got home and unpacked it, we'd *have* to go out and get a cat.",
   "created_utc": 1703282174,
   "score": 63,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejbs21",
   "message": "My grandparents' old trailer had ants. I wanted to help and knew they liked sweet things, so I added a bunch of sugar to some juice and made a trail from the house to an ant hill to lead them out. It did not have the desired effect.",
   "created_utc": 1703291028,
   "score": 219,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejbq70",
   "message": "Maybe not best but recent: My coworker’s kid lost a tooth yesterday, and the kid said he was going to wait until Sunday to put his tooth under the pillow so the Tooth Fairy can meet Santa lol",
   "created_utc": 1703291006,
   "score": 11,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej7dgm",
   "message": "When I was 15, I used to babysit this lovely kid called Jack.\n\nHe would very proudly tell people \"I'm three!\" And hold up three fingers. One day, I asked him how old did he think I was? He gave this very careful consideration.\n\n\"26.\" He said firmly.\n\n\"Why do you think I'm 26?\" I replied, mildly offended.\n\n\"Mummy looks after me and she's 26. You look after me too.\"\n\nFair enough!",
   "created_utc": 1703289179,
   "score": 86,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejee8m",
   "message": "My 5 yo grandson insists the instructions you receive with a Lego set are “the constructions”, and really I’m having difficulty arguing against it.",
   "created_utc": 1703292179,
   "score": 111,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keilj3a",
   "message": "My husband was working at a child care center and his car was in the shop so he needed a ride. When I arrived to pick him up, one of the children who was also getting picked up asked if I was his mom. Because that's who picks up people from day care, moms and dads. Makes perfect sense using kid logic.",
   "created_utc": 1703280442,
   "score": 146,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej94qo",
   "message": "I was a student teacher, and bumped into one of my seven-year-old students in the morning. He was walking and told me \"I always step over the cracks [in the sidewalk].\"\n\nI asked \"How come?\" and expected him to say something about \"So I don't break my mother's back.\" (That's an old rhyme).\n\nInstead, he said he was \"practicing\" ... \"in case there's an earthquake!\"",
   "created_utc": 1703289913,
   "score": 44,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej8nd2",
   "message": "Leaving the daycare center, a kid called back, \"BYE-BYE! Be safe, watch out for polar bears!\"\n\nWe are not in polar bear territory, but polar bears live in the snow, so since it snowed earlier in the day, it was only logical that we were at elevated polar bear risk.",
   "created_utc": 1703289708,
   "score": 158,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keioqxk",
   "message": "My kid as a toddler invented the word “nexterday” because she knew “yesterday” and “next” but not “tomorrow”.",
   "created_utc": 1703281721,
   "score": 195,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej8tkw",
   "message": "When I was a kid we experienced an earthquake. I ran to my mom screaming “the dinosaurs are coming!” I was really into The Land Before Time and whenever the Brontosaurus walked the ground shook so it made sense.",
   "created_utc": 1703289782,
   "score": 202,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejbmlt",
   "message": "Whenever we went on holiday, and my daughter started seeing Seagulls, she'd say \"look, holiday birds!\"",
   "created_utc": 1703290963,
   "score": 166,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejfp6m",
   "message": "My son once told me he had a brew after he bumped his arm. I said I think you mean bruise. He said that it was a brew because he only had one.",
   "created_utc": 1703292761,
   "score": 5,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keix8jn",
   "message": "When I was really little our preschool class grew beans in a window and my little brain decided that all food must be grown from seeds. Long story short my mom found about 15 chicken nuggets in her flower bed when she was planting tulips.",
   "created_utc": 1703285028,
   "score": 192,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejnpki",
   "message": "Two of the neighbor kids locked themselves out of their house while their mom went to the store. My kids invited them in, sat them at the kitchen table, gave them a drink and a snack and kept them company until their mom got back. \n\nAfter the kids went home, I told my kids that they had been very hospitable.\n\nMy seven year old was very indignant. \"We were NOT! We were very nice to them. We didn't spit on anybody!\"",
   "created_utc": 1703296177,
   "score": 245,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejb2qa",
   "message": "My sister has two children, ages 3 and 1. I had my first child in September so my nephews now have a cousin.\n\nThe three year old insists that it is only his cousin, since he is the oldest and his younger brother will have to wait for the next one before he gets a cousin of his own.",
   "created_utc": 1703290733,
   "score": 184,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejfz9j",
   "message": "When I was like three or four years old and my family went to the beach, I stole the little sugar packets from the hotel's breakfast room and emptied them in the ocean, because I didn't like that it was so salty.\n\nEdit: typo.",
   "created_utc": 1703292887,
   "score": 210,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejj7zq",
   "message": "Aight so one time my niece was over with my brother and his wife. My niece said “let’s be dragons” so I’m like ok cool this is fucking awesome. \n\nHere I am in my 50s and get to be a dragon. So I put up my big dragon wings and dragon face and she stopped dead in her tracks and said “uncle guru, you don’t have to pretend to be a dragon you can just BE one. See? I’m a dragon and so are you. Let’s go see dad.”  \n\nSo we’re just standing there like two humans and she says “we’re dragons” with a shrug of her shoulders like I know it’s obvious but just in case..\n\nSo yeah, blew my mind lol",
   "created_utc": 1703294271,
   "score": 87,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejaro9",
   "message": "My daughter was having trouble falling asleep and came to me crying that her pillow didn’t work",
   "created_utc": 1703290605,
   "score": 207,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keixql2",
   "message": "My niece said that Santa was fat because he was pregnant, and that he was going to give birth to gingerbread men.",
   "created_utc": 1703285227,
   "score": 201,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejhhz9",
   "message": "1.  Two of my Kindergarten students switched coats and thought that their parents would take the wrong kid home\n\n2.  I was talking about the gears on my mountain bike, and my daughter said “My bike is a two-speed:  stop and go”",
   "created_utc": 1703293538,
   "score": 157,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keikqr3",
   "message": "I was fly fishing a popular canoeing river when two middle school aged kids came paddling down ina rented canoe.  They got turned 180 degrees in an eddy and instead of trying to turn their whole canoe back around they just turned around in their seats and started paddling downstream again.  Most adults would try paddling back around but this was by far the more efficient way to handle it",
   "created_utc": 1703280128,
   "score": 94,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej1uzm",
   "message": "A friend's kid cut a big chunk out of his hair, then realized he'd get in trouble, so he carefully laid the hair on his head. It promptly fell off.",
   "created_utc": 1703286907,
   "score": 48,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejm0h2",
   "message": "I was around five and my mom explained to me where babies came from, that girls had eggs in their tummies. Went to the doctor shortly after and I’m laying on my back as she pushes on my belly, as doctors do. Cue me moaning and telling her she’s cracking my eggs.",
   "created_utc": 1703295463,
   "score": 114,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keik77k",
   "message": "I thought cotton came from clouds, and the colorful cotton you would catch at sunset",
   "created_utc": 1703279916,
   "score": 93,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej8aof",
   "message": "My kid asked to go to the “fish museum.” She didn’t know the word for aquarium, but I’d say she got the concept across pretty well. Now we don’t refer to it as anything else.",
   "created_utc": 1703289561,
   "score": 92,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej5djv",
   "message": "When my grandson would tell me something that happened in the recent past he would say it happened \"yesterday long time ago.\"",
   "created_utc": 1703288348,
   "score": 164,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejh1ph",
   "message": "A toddler I was watching stood next to a tree. He then licked the bark of the tree  the way a dog would lick an ice cream cone: full blown, no inhibition.  \n\nShocked, I asked him why licked the tree, and he said, \"I didn't know what it tasted like.\" He caught me so off guard, so all I could say was,  \"you know what,  that's fair. \"  \n\nI asked him if he liked it. He said, no, no he did not.",
   "created_utc": 1703293345,
   "score": 73,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keja9sv",
   "message": "I was one of many kids who thought musicians played live in the radio station when you heard their songs on the radio",
   "created_utc": 1703290395,
   "score": 150,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejf05k",
   "message": "I was very stressed about my mom washing our dog with our shampoo because it said \"Not tested on animals.\"",
   "created_utc": 1703292452,
   "score": 109,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej9rs0",
   "message": "When I was a little girl, I had a Barbie and a Ken doll.  I wanted more Barbie and Ken dolls.  I put them in a shoebox together, naked, and pushed it under the bed so they could make more dolls.  I had no idea how close I was to knowing how babies were made.",
   "created_utc": 1703290184,
   "score": 118,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keitaf7",
   "message": "My younger sister once said to my mother, \"Mum, how old were you when Jesus was a child?\"",
   "created_utc": 1703283476,
   "score": 22,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej7l8v",
   "message": "I used to wonder why the snow was on top of the mountains if they were closer to the sun",
   "created_utc": 1703289268,
   "score": 15,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejbsw4",
   "message": "When I was about 6 or so, my very religious grandmother offered to buy me something at the church yard sale. There was a Grateful Dead shirt. I wasn't familiar with their music back then, I just liked the color and design. She told me it wasn't proper attire for a Christian. I responded with \"Christians go to heaven when they die, right?\" She said yes, to which I proclaimed they would then be grateful to be in heaven, and grateful they were dead.  The logic didn't work, and I didn't get the shirt. \n\nMy mom still brings it up and laughs occasionally. As an adult I love the grateful Dead and for my 40th birthday my mom got me a grateful Dead vinyl box set.",
   "created_utc": 1703291038,
   "score": 62,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejaqj5",
   "message": "I used to work as an english teacher at a kindergarden and one of my students told me: “your nails got longer you should tell your mom to cut them.” \nMy mom lives 3500 km away from me in a different country, it was heartbreaking for her to find out about that.",
   "created_utc": 1703290591,
   "score": 58,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej0jgs",
   "message": "My granddaughter said there are microbes on Mars, and she knows this because her teacher said microbes are EVERYWHERE.",
   "created_utc": 1703286358,
   "score": 117,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejfg1z",
   "message": "We use “Dadu” for grandfather in my language. My dads brother visited from India, he didn’t know what to call him, so he started calling him “more Dadu”",
   "created_utc": 1703292650,
   "score": 11,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keinz24",
   "message": "When my oldest was 2, he was obsessed with peanut butter M\u0026amp;M's. One day he was eating some and proudly declared that he knew where peanut butter came from. To get peanut butter, you simply crack open peanut butter M\u0026amp;Ms like an egg, and scoop it out.",
   "created_utc": 1703281417,
   "score": 81,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejdzqz",
   "message": "My grandson helped me bake a birthday cake for his grandpa. He and I mixed it, baked it, let it cool, HEAVY SIGH! \n\nWe frosted it and decorated it, sprinkles anyone?\nHe wanted to have cake right away. I explained we had to sing Grandpa happy birthday. I'm thinking after birthday dinner.\n\nMy husband had just got home from work and was in the shower.  Grandson knocks on the bathroom door  and proceeds to sing the birthday song as loud as he could.\nHe then runs  to the kitchen to announce grandpa got his birthday song! Let's eat cake! \n\nHe was 3.5 years old!",
   "created_utc": 1703291999,
   "score": 239,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejaov7",
   "message": "I once bought bubblegum flavored toothpaste for my 4 year old granddaughter. We got home from the store in the early afternoon and she really wanted to brush her teeth because, bubblegum right? I told her she could brush her teeth before bedtime. She thought about it for a few seconds and hit me with, “It’s already before bedtime”. She got to brush her teeth right then and there.",
   "created_utc": 1703290571,
   "score": 161,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej6wyz",
   "message": "My husband and I used to have two cats. One cat’s name was just Little Cat.\n\nMy 3 year old niece called our other cat “Big Cat” because if there’s a little cat, there has to be a big cat.\n\nAnd our other cat was pretty big so I couldn’t even correct her.",
   "created_utc": 1703288989,
   "score": 107,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej8k2n",
   "message": "About 30 years ago I was a coach on a swim team. One of the kids I coached was named Bryan, age 4. Bryan was super close with a 17 year old girl Tamica.  She was on the  team and was good friends of the family. Well one day Bryan saw Tamica hop in her car and drive home after practice. He ran to his mom and asked “Mommy, is Tamica married?” She said “No Bryon why would you think that?” He replied “Cause she drives a car”. We all had a good laugh because in his experience only married people (his parents most likely) drove cars.",
   "created_utc": 1703289670,
   "score": 81,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej854t",
   "message": "I once fed our VHS player a peanut butter and jelly sandwich because my parents were tired of it \"eating\" the tapes.",
   "created_utc": 1703289497,
   "score": 36,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keips4a",
   "message": "When I was 7, I figured out Santa was a myth because I noticed my stocking was full on Christmas Eve - *before* he was scheduled to arrive. AHA!",
   "created_utc": 1703282112,
   "score": 84,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejgrps",
   "message": "When my daughter was 5, she asked me how to spell \"zizz.\" I told her z-i-z-z. She knew that was wrong so she said, \"Spell Julie is 5, but don't spell Julie and don't spell 5.\" She wanted to know how to spell \"is.\"",
   "created_utc": 1703293228,
   "score": 209,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejhk93",
   "message": "When I (white) was a kid, my best friend (black) was floored to learn white peoples’ poop was brown. He’d just assumed ours was white.",
   "created_utc": 1703293564,
   "score": 205,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejhqt5",
   "message": "When I was little my parents were planning to adopt a baby to be my little sister. She was from Japan. I thought babies were born speaking whatever their native language was so I told my parents she wouldn’t be able to talk to us, and we were going to have to learn Japanese, which they still laugh about to this day. \n\nThe real parents ultimately decided to keep her so the adoption didn’t happen. I hope she was loved. \u0026lt;3",
   "created_utc": 1703293641,
   "score": 191,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejieuw",
   "message": "My son when he first encountered lasagna.\n\n\"Oh.  It's spaghetti cake.\"",
   "created_utc": 1703293925,
   "score": 191,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejbext",
   "message": "I had just birthed my daughter via C-section. My toddler son saw my incision, and concluded that his baby sister had busted through my stomach like the Kool-Aid man.",
   "created_utc": 1703290875,
   "score": 201,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keiwao6",
   "message": "closing their eyes makes them invisible",
   "created_utc": 1703284656,
   "score": 47,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej1bna",
   "message": "\"I don't want to live on Earth, because Earth is in space, and space is dark, and I'm afraid of the dark.\"",
   "created_utc": 1703286683,
   "score": 152,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejd1gm",
   "message": "i dont know if this counts, but this kid asked something i never heard anyone ask before: how come Cinderella shoe doesn't change after midnight?",
   "created_utc": 1703291577,
   "score": 96,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keje7of",
   "message": "When I was a kid, my brothers and I came up with \"Christmas Adam\" as the day before Christmas Eve, because Adam came before Eve.",
   "created_utc": 1703292097,
   "score": 96,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej03rj",
   "message": "High school friend shared that when she was little she thought babies came from Target because she always saw them in the carts when they went shopping at Target.\n\nKeep in mind we grew up in the 1970s in Minnesota and Target was were we shopped. There was no Walmart here.",
   "created_utc": 1703286182,
   "score": 8,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej4m6x",
   "message": "I once asked my mom what the civil war was like, because it was before i was born, and she was around before I was born. Logic.",
   "created_utc": 1703288034,
   "score": 218,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejftkj",
   "message": "When my cousin was 2 or 3, she liked to hold her mom's shopping list at the grocery store.  She asked my aunt one time, and she said \"the list is in my head\"\n\nMy cousin was horrified, she thought that her mom had stuck the paper in her ear and it was literally in her head",
   "created_utc": 1703292815,
   "score": 153,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej6pf5",
   "message": "Not me but a friend. \n\nHer dad was an alcoholic, and would drink as long as he could find more alcohol. So, logically, the best way to get him to stop drinking was to empty the bottles. And the best way to do that? Drink them all with the determination of a 7 year old who wants a sober parent.",
   "created_utc": 1703288902,
   "score": 0,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej99ie",
   "message": "cutting a pizza into 8 slices instead of 6 means more pizza",
   "created_utc": 1703289969,
   "score": 178,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej6t2j",
   "message": "I was in college when my son was little but he always referred to it as my job. I told him I was going to school, he even had to come with me a couple of times, but he wasn't having it. His logic was that school is for kids, you can't be mom and a kid, so it must not be school.",
   "created_utc": 1703288945,
   "score": 129,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejhqgm",
   "message": "My son (around10 at the time) and I were watching \"The Lou Gehrig Story\" and towards the end of the movie he asked me what sickness did he have and I said Lou Gehrig's Disease. . . after a few seconds my kid said something along the lines of \"Well they should have known all along since his name was Lou Gehrig.\"",
   "created_utc": 1703293637,
   "score": 118,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej8bo9",
   "message": "When I was a kid I once asked my Mum how many days there were in a year and when she said 365 I asked if that was how many people there were on the planet because I assumed everyone had their own individual birthday… I guess I forgot twins existed.",
   "created_utc": 1703289573,
   "score": 253,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keijsb5",
   "message": "When I was little I thought that since AM was morning and PM was afternoon, then ZM must be night!",
   "created_utc": 1703279753,
   "score": 112,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej873b",
   "message": "I was in a playpark with my kid when she looked way across the square and spotted a figure halfway up a staircase, stopped in mid step, probably an older person resting or something. My daughter announced \"That person's run out of batteries.\" Now that I'm a good deal older myself I appreciate that description more every time I climb a flight of stairs.",
   "created_utc": 1703289520,
   "score": 75,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej7ddh",
   "message": "So… I have a naturally-low core temp, which makes my skin feel like an ice cube.\n\nYoungest Cousin (born 2019) had had a high temp back in 2019, my aunt just handed her to me to have me cool her down by holding her — I became the Baby-Cooling Station. When she decided she needed to cool down at a cook-out in 2021, she shouted, “I GE I PAK!”, toddled-over to where I was napping, grabbed my hand, and just put it to her forehead before shouting, “I GAH I PAK!” when my aunt asked her what she was even doing.\n\nEDIT: \n\nI just felt like typing-out how she said those two things, since it was super-cute. But, they mean, “I GO GET ICE PACK!” and, “I GOT ICE PACK!”, respectively.",
   "created_utc": 1703289178,
   "score": 178,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejeavs",
   "message": "This was the funniest. My friend had a little brother who was probably about 4-5 at the time. He asked his mum where babies come from. She said something like \"when a man loves a woman, he puts a baby in her and then she carries the baby until later\". The kid then goes without a pause \"oh well mummy I love you so when I'm older I'm going to put a baby in you\". The mum just did not know how to respond to that at all. Everyone else was in hysterical laughter.",
   "created_utc": 1703292136,
   "score": 116,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejnduo",
   "message": "A new student who was learning English came up to me grabbing his tummy and said \"No power, need power\" aka I'm hungry. I often think of this little dude and hope he goes far.",
   "created_utc": 1703296039,
   "score": 111,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejauor",
   "message": "My 3-year-old couldn't think of the words \"butter knife” and instead called it a “butter cutter”. That’s what we call it now.",
   "created_utc": 1703290640,
   "score": 222,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejeih2",
   "message": "In late 2020, my nephew told us he hated the farmers and they should go to jail. Incredibly confused, we asked why. He said he wished they would stop killing people because he wanted to go back to school. \nAfter some back and forth, we realized when we’d been saying ‘quarantine’, he didn’t understand the word and decided we must mean ‘corn fields’. 5 year old logic then reasoned that the corn farmers were the cause of lock downs and all the people getting sick. \nMy family still jokes about ‘those damn corn farmers’ anytime something throws a wrench in our plans.",
   "created_utc": 1703292233,
   "score": 223,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejis6w",
   "message": "One of my kids loved soda, and he only got to one of the mini ones per month. He also loved Captain Crunch Crunch Berries. One day, he thought what could be better than combining his two favorite things. He figured he needed 3 sodas to make it work, so he saved up for three months. \n\nThe day finally arrived. He poured the cereal. He poured all of the soda. He put his spoon in the bowl and scooped up a mouthful, put it in his mouth, and chomped down. \n\nIt… did not go as expected. It was awful. He was so upset because he basically had to throw out the whole thing. It’s such an interesting kid logic to me that two of your favorite things could be combined (but actually can’t always be combined). \n\nI lied about one that. It wasn’t my kid. It was me, when I was a kid.",
   "created_utc": 1703294083,
   "score": 107,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keja19k",
   "message": "One day, when my daughter was around five, I was sitting in the living room reading when I saw her out of the corner of my eye peering around the corner from the hallway at me. Then she runs full tilt from the hallway, through the living room, into the kitchen. She comes out of the kitchen and asks me, \"Daddy, could you see me?\" She thought if she ran fast enough she'd be invisible.",
   "created_utc": 1703290295,
   "score": 47,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejdzk5",
   "message": "My grandma caught my dad baptizing kittens. He found a hole with standing water and dipped their heads gently back into it, saying, “In the name of the father, the son, and in the hole he goes.”",
   "created_utc": 1703291997,
   "score": 213,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kein8pn",
   "message": "i thought jesus was buried in the cemetery in our city, didnt know too much bible lore back then.",
   "created_utc": 1703281124,
   "score": 180,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejf7f1",
   "message": "When my son was 3, my Dad took him to the airport, and they took a short fight and went back to my Dad's house. In his garage, he had his dirt bike. After they went into the house, my son said, \"Papa, when can we go to the dirtport?\" He reasoned that you rode airplanes at the airport, then you must ride dirt bikes at the dirtport!\nAnother time, he couldn't remember the term flea mark. So he said, \"You know the ant market.\"",
   "created_utc": 1703292544,
   "score": 102,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejkvmq",
   "message": "My nephew uses the word “soaking” instead of “very”. He heard his mom say “soaking wet” one time, and now says “I’m soaking hungry”, “I’m soaking happy”, “I’m soaking thirsty” when he wants to be dramatic",
   "created_utc": 1703294972,
   "score": 199,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej9s9n",
   "message": "My cousins believed that the tallest people were always the oldest (because that’s generally how it works with kids) so thought our 6’2” uncle was older than our grandparents.",
   "created_utc": 1703290190,
   "score": 190,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejgvfa",
   "message": "I worked with a 6 year old child with ADHD who told me \"I can't throw away in my brain trashcan what I'm thinking about even when it's bad\"",
   "created_utc": 1703293272,
   "score": 180,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejqsme",
   "message": "A few years ago one of my colleagues brought her little daugther to work, I guess she must've been around 4 or 5 years old at the time.\n\nAfter we all said our hellos, another one of my colleagues tried to make some small talk with her and said, in that overly theatical voice some grown-ups use when they want to talk to little kids, \"You've gotten *so* big, Becky! What year are you in?\" meaning of course the grade at school.\n\nBecky looked at her for a couple of seconds like it was the dumbest thing she'd ever heard and deadpanned, \"In 2015 like everybody else.\"",
   "created_utc": 1703297521,
   "score": 175,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejjctf",
   "message": "When my son was three I told him not to draw on the walls.\n\nHe got a step ladder, got up on the top bunk bed, and drew on the ceiling.",
   "created_utc": 1703294327,
   "score": 82,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejkjzl",
   "message": "Two gems from my 3 year old daughter...\n\nWhen I ask her who she played with today if she didn't play with anybody she says \"nobody\" but if she played with somebody she says \"yesbody\"\n\nWhen she asks for something she says \"I want M\u0026amp;Ms\". If I tell her \"no\". Her response is \"yes, I do want it\".",
   "created_utc": 1703294833,
   "score": 86,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejbght",
   "message": "Our orchestra conductor told us about a young violin student who had identified violins, violas, cellos, and basses as all looking like they are brothers. She looked at a guitar hanging on the wall of her classroom and said, “That’s a brother from a different mother.”",
   "created_utc": 1703290893,
   "score": 171,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejax5d",
   "message": "I had broken up with my boyfriend but had gotten back together and my nephew was asking about my relationship status when he was about 4. \"So are you... broken down?\" Totally logical as down is the opposite of up!",
   "created_utc": 1703290669,
   "score": 244,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej660d",
   "message": "Towels can’t get wet because they dry things. \n\nYou have to stay away from trees in lightning storms because wood conducts electricity. \n\nYou say thank you when someone has done something for you, so if you ask someone to do something and quickly say “thank you” they have to do it because they already got the thank you.",
   "created_utc": 1703288677,
   "score": 243,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejg9de",
   "message": "Dinner tummy is separate to dessert tummy and snack tummy.\n\nThere is always room for dessert no matter how 'full' the dinner tummy is.",
   "created_utc": 1703293014,
   "score": 169,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejcj4o",
   "message": "And if you’re around my age, you may remember that comedian who had a puppet called Madame. I thought she was the same “person” as the puppet Elaine Fairchilde in Mr. Rogers, AND I thought they were both Phyllis Diller.\n\nI remember definitely being perplexed about why she may or may not be a puppet sometimes, but pretty much let it go.",
   "created_utc": 1703291350,
   "score": 78,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejctsr",
   "message": "“Mom, if you give me my Christmas presents early, I can enjoy them longer.” Too old to believe in Santa but not old enough to have patience.",
   "created_utc": 1703291482,
   "score": 80,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejg41x",
   "message": "My overly religious (at the time) younger sisters kept my five year old daughter sometimes. She heard a lot of Bible talk, which didn’t stick apparently. \n\nOne day they taught her the pledge of allegiance facing a huge flag hung indoors. She balked at repeating it and said “It sounds like an IDOL to me!”",
   "created_utc": 1703292947,
   "score": 151,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kej6c0w",
   "message": "I grew up in Pittsburgh.  I knew what Pirates and Penguins were.  On the other hand, what is a Steeler?  Pirates are thieves on boats so Steelers steal things on land.  They just spelled it weird.",
   "created_utc": 1703288747,
   "score": 199,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejcvi9",
   "message": "\"Does the dog talk?\"\n\n\"No.\"\n\n\"Why not, he has a mouth!\"",
   "created_utc": 1703291503,
   "score": 71,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejeind",
   "message": "I was doing a little Christmas project with my son, who was about 5 at the time. It was a plate you could draw on, then bake it, to make a decorative plate.  He drew a skeleton with a Santa hat.  He said he chose a skeleton, because it’s dead, and Jesus is dead, so the skeleton could sing “Happy Birthday, Jesus” in heaven.",
   "created_utc": 1703292235,
   "score": 68,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejckmi",
   "message": "My brother (4) went shopping at the shop under our apartment with 3x50 cents to get chocolate for him and his 2 siblings. He found a chocolate we all liked and asked “how much money” it is. They said 150 cents.  he started crying because “he only has 3 money”",
   "created_utc": 1703291369,
   "score": 129,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejc756",
   "message": "Mine is my logic because I was a child genius. \n\nWhen I was a wee little one I wasn't able to say my brother's whole name nor could I say \"brother\" so I always called my older brother \"Broth\".\n\nWhen I was 5 or 6 I was in our garage with my friend and we found a can of orange spray paint. Obviously, this means it's time to go spray paint some curse words! Our garage went to an alley, next to the door on the pavement I sprayed out \"ass\". Out on the pavement on the side of the garage I sprayed out \"damn.\" I was killing it.\n\nBut wait! I think, my parents are for *sure* going to know this was me right? 💡❗️ I come up with the *perfect. plan.*\n\nI go *inside* the garage, right next to where the passenger would get out of my mom's car when it was parked, and sprayed \"Broth did it\"\n\n🤦🏻‍♂️ my mother still tells this story more than 25 years later.",
   "created_utc": 1703291207,
   "score": 233,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejggs0",
   "message": "When my son wanted to go to a toy store, I said we didn't have enough money.\n\nHe then suggested we go to the money store to get money for the toy store.",
   "created_utc": 1703293101,
   "score": 59,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejp8ko",
   "message": "when we went to a seafood restaurant and  i ordered king crab legs, my 4 year old daughter looked at the waitress and said \"i'll have the princess crab legs\".",
   "created_utc": 1703296822,
   "score": 64,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "keiyqrw",
   "message": "I remember a story of an astronaut going to give a talk in a school and one kid asked him \"how do I become an astronaut?\" and the astronaut replied \"you have to go to school for a very long time and then train your body and mind and then pass a test. its very hard\" and then the kid replied \"thats like only 4 things!\". Changed my outlook on life haha",
   "created_utc": 1703285625,
   "score": 60,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejomsf",
   "message": "First time I was ever left unsupervised\n\nApple juice = good\n\nMilk = good\n\nApple juice + milk HAS to be good\n\nIt was not good",
   "created_utc": 1703296562,
   "score": 55,
   "submission_id": "18op4jy"
  },
  {
   "comment_id": "kejnd9y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18op4jy"
  }
 ]
}