{
 "submission_id": "18ot8sv",
 "title": "What was the worst pain you've ever experienced?",
 "selftext": "",
 "created_utc": 1703291456,
 "permalink": "/r/AskReddit/comments/18ot8sv/what_was_the_worst_pain_youve_ever_experienced/",
 "score": 104,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ot8sv/what_was_the_worst_pain_youve_ever_experienced/",
 "comments": [
  {
   "comment_id": "kejeewf",
   "message": "An infected rotting tooth. It created pulses of agonizing pain from my neck to my temple, it was impossible to sleep because reclining usually made the pain worse. I measured time in half-minutes.\n\nIn my worry about not overdosing on Acetaminophen, I overdosed on aspirin. That causes hearing loss. It's no joke.",
   "created_utc": 1703292188,
   "score": 57,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejga1s",
   "message": "My best friend taking her own life on Christmas Day",
   "created_utc": 1703293022,
   "score": 56,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejlbvj",
   "message": "1. Losing my first baby. \n2. Realizing after 8 almost 9 years my husband didn’t give a shit about myself or his 3 kids..",
   "created_utc": 1703295170,
   "score": 51,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejq6y6",
   "message": "Ovarian cyst rupture. 10/10 even after Lortab and 800mg Ibuprofen.",
   "created_utc": 1703297248,
   "score": 40,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejqvsv",
   "message": "Getting my IUD inserted. No pain meds other than ibuprofen (they told me thats all I'd need).",
   "created_utc": 1703297562,
   "score": 38,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejq2cy",
   "message": "I was hit by a car. I ended up in hospital with broken ribs and a collapsed lung.  The first night I was in there they needed to insert a tube between my ribs to drain the chest cavity.  They rolled me onto my side, numbed my skin and made an incision. Then they shoved a tube between my ribs.  That was the worst pain I’ve ever felt.  There was a young nurse in there. She came around to the other side of the bed and held both my hands while they were doing it.  She was the angel I needed.",
   "created_utc": 1703297192,
   "score": 44,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejupmh",
   "message": "I was hit head on by a pickup truck while on my bicycle. His windshield was broken by my face. Had a bad TBI, broken bones and my teeth knocked out.  Ended up having several back surgeries and am ok today.  I know it could have been much worse and am grateful.",
   "created_utc": 1703299291,
   "score": 19,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejg26v",
   "message": "Loneliness",
   "created_utc": 1703292923,
   "score": 56,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejkirx",
   "message": "An ovarian cyst rupture",
   "created_utc": 1703294818,
   "score": 15,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejkqd9",
   "message": "Pancreatitis. At the er rn with it and I'm fucking struggling.",
   "created_utc": 1703294909,
   "score": 13,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejfgih",
   "message": "Physically: contractions. I usually have a pretty high pain tolerance but that shit had me crying like a baby😂\n\nEmotionally: having to watch my brother beg the code team to save his 4 month old daughter’s life.",
   "created_utc": 1703292656,
   "score": 28,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejfsj0",
   "message": "Gall bladder pain",
   "created_utc": 1703292803,
   "score": 11,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejmspp",
   "message": "Ovarian cysts pain",
   "created_utc": 1703295792,
   "score": 10,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejh8ry",
   "message": "Childbirth",
   "created_utc": 1703293428,
   "score": 28,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejuwqx",
   "message": "I have had four children, and while that hurt (especially the first one. JFC that took me into a whole new realm of mind blowing pain), I'm going with kidney stones.\n\nThey hurt just as bad as labor, but no sense of when it would end, no amount of pain killers would work, and NO reward (aka A Baby)  at the end. \n\nI'd rather have another baby with no epidural (like my fourth) in a ditch on the side of the road than have another kidney stone (and I've had three of those). Death would be welcome.",
   "created_utc": 1703299384,
   "score": 9,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "keji9vo",
   "message": "Had severe aches in just about every muscle in my body a year back. I could barely sit, couldn't open doors (gripping the doorknob hurt too much), and spent the days rotating between uncomfortable positions in bed.\n\nStill no idea what it was.",
   "created_utc": 1703293868,
   "score": 9,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejuxsj",
   "message": "Watching my mother deteriorate from cancer. It made me glad she had finally passed. No more suffering.",
   "created_utc": 1703299397,
   "score": 9,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejnmt5",
   "message": "l have Fibromyalgia. When a flair comes it affects every nerve ending in my body. l can feel my heart beat in my nerve endings and its excruciating. Im on fentanyl patches but when l have break thru pain l take vicodin!!",
   "created_utc": 1703296146,
   "score": 15,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejkg42",
   "message": "Shingles",
   "created_utc": 1703294787,
   "score": 7,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejp676",
   "message": "Kidney stones and kidney failure. \nBefore that was a bloody ejaculation…",
   "created_utc": 1703296794,
   "score": 6,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejtaoy",
   "message": "Shattered tailbone, with bone puncturing disk pushing sciatic nerve out of the channel.  Waiting for third surgery.  \n\nTake enough medicine to kill pain long enough to walk when I can.",
   "created_utc": 1703298635,
   "score": 7,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "keju3fd",
   "message": "Miscarriage. I was 12 weeks , that shit hurttt. I was sweating so much from the pain that by the time I got to the hospital I needed fluids .",
   "created_utc": 1703299013,
   "score": 7,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejw6hw",
   "message": "Trigeminal Neuralgia. Known as the Suicide Disease because so many people who have it commit suicide due to the pain. \nI get painful attacks in my head/jaw/brain. Feels like my head is a cantaloupe and someone is squeezing it. All I can do is walk around and scream until the attack ends. \n\nI’ve had two brain surgeries so far that have helped. I can get three more brain surgeries and fix the issue; however the surgeries are extremely intense and I can’t do it right now. Instead I take medicines and get shots in my head every 3 months. It’s rough.",
   "created_utc": 1703299991,
   "score": 7,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejddni",
   "message": "I had a bad stomach bug a few years ago. Worst back pain I have ever experienced, and I developed IBS afterwards.",
   "created_utc": 1703291728,
   "score": 7,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejehfy",
   "message": "loosing my virginity",
   "created_utc": 1703292220,
   "score": 6,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejepun",
   "message": "An inflamed gall bladder",
   "created_utc": 1703292323,
   "score": 7,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejj2hi",
   "message": "I think it was when I had walking pneumonia.\n\nI have high tolerance to pain, I wasn't medicated when I gave birth. But whatever walking pneumonia is hurt like hell.",
   "created_utc": 1703294206,
   "score": 6,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejmevz",
   "message": "Blocked colon. Felt like my guts were going to explode",
   "created_utc": 1703295628,
   "score": 5,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejsg82",
   "message": "C diff. So so painful. Thought I was going to die shitting",
   "created_utc": 1703298258,
   "score": 5,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejuqqy",
   "message": "Getting divorced and seeing her with the man she cheated on me with.",
   "created_utc": 1703299306,
   "score": 6,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejjr3p",
   "message": "Tie between getting kicked in the thigh by one of my horses, and having my femur fractured. Kidney stones. And the day my DVT (deep vein thrombosis) finally let itself be known after 6 months of it growing",
   "created_utc": 1703294494,
   "score": 5,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejnn4n",
   "message": "Kidney stones",
   "created_utc": 1703296149,
   "score": 8,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejdowx",
   "message": "A bad kick in deez nuts",
   "created_utc": 1703291866,
   "score": 4,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "keji6vr",
   "message": "Cracked ribs",
   "created_utc": 1703293832,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejj1wx",
   "message": "Waking up from my ORIF surgery on my ankle. Even after a nerve block the pain was unbelievable agony.",
   "created_utc": 1703294199,
   "score": 4,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejoeng",
   "message": "Child birth",
   "created_utc": 1703296466,
   "score": 4,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejpedq",
   "message": "Dislocating my hip",
   "created_utc": 1703296893,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejvhxb",
   "message": "Physically: nerve damage in my leg after a surgery - it legitimately felt like my leg had been set on fire, and they had to give me the heavy stuff to make it even vaguely tolerable.\n\nMentally: losing family this year and last.  Even when you know it's coming, the death of someone close is still a gut punch.",
   "created_utc": 1703299658,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejvm02",
   "message": "Having a molar extracted where the infection was so deep that the anesthetic didn’t work. The infection had spread to the nerve. I felt like I was being tortured in the chair and quite literally thought I would die in that moment. I was drenched in sweat afterwards and sobbed in agony for 2-3 hours.",
   "created_utc": 1703299713,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek60xa",
   "message": "1-Physical pain of labor contractions before epidural \n\n2-Being diagnosed with cancer with 2 boys under 4 yrs old. I am here 10 yrs later though!!!!",
   "created_utc": 1703305085,
   "score": 4,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek82km",
   "message": "I had a 15cm tumor rupture, rip off my gallbladder, and cause internal bleeding. Nothing touched the pain and to add insult to injury, also discovered I was allergic to morphine while going through these pain scale 10 pain attacks.",
   "created_utc": 1703306210,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejtza8",
   "message": "Have you tried stepping on a LEGO in the dark?",
   "created_utc": 1703298962,
   "score": 6,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejuc61",
   "message": "Period cramps. Used to be so much worse when I was a teenager. Sometimes I used a knife to cut/ stab myself in my thighs to distract myself from the pain. And I don't even have a medical condition.",
   "created_utc": 1703299121,
   "score": 6,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejr7o1",
   "message": "I fell from the top of a ladderwell (staircase in the navy), and I hit my funny bone at the bottom. It was an 8.5’ fall straight onto that nerve bundle and omfg, it hurt so bad I couldn’t even form words to tell people to go get someone from medical. I sounded like a baby and had to be supported just to walk",
   "created_utc": 1703297713,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejre4f",
   "message": "OCD",
   "created_utc": 1703297795,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejt87b",
   "message": "Kidney stone, by far. I couldn't stand up, couldn't lay down, and like I was going to throw up constantly purely from pain before. It was awful. I drink a ton of water now to avoid ever experiencing that again",
   "created_utc": 1703298602,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejtfqs",
   "message": "Waking up from hernia surgery with none of the pain killers working. They gave me a small fentanyl injection though and I was good within like 12 seconds flat lmao.",
   "created_utc": 1703298704,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejups6",
   "message": "I actually consider myself fortunate that in my 34 years here my worst pain was a 4 finger+palm burn from grabbing a hot pan. \n\nEnded up being objectively minor but the pain was incredible.",
   "created_utc": 1703299293,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejwutq",
   "message": "When my grandma died, a part of me did too.",
   "created_utc": 1703300325,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejx7xz",
   "message": "Each and every time one of our pups pass away.\n\nPhysical pain from some injury will pass, the heartbreak of losing a pup never does.",
   "created_utc": 1703300504,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejx99i",
   "message": "Kidney Stones.   Wouldn't wish that pain on my worst enemy.",
   "created_utc": 1703300523,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejxegu",
   "message": "Gallstone attacks. Legit thought I was dying and at the time, was welcoming it if only to make the pain stop.",
   "created_utc": 1703300594,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejy6t2",
   "message": "I've had my cervix dilated to about 4 to 6 cms and it didn't compare to the pain endometriosis puts me through monthly. I've had to sit and bleed on the floor because I physically cannot move. I've passed out in the toilet from the pain. and I've passed 2 uterine casts due to my medication. it feels like a devil baby is shredding its way out of my stomach every period.\n\nI have a tattoo on my collarbone and didn't make any type of face or noise while getting it done because I was cramping. \n\nfuck endo.\n\nedit: I even had a laparoscopy and while in pain from that was saying how it wasn't shit compared to my period. that's how I knew it was bad lol",
   "created_utc": 1703300983,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejnxoc",
   "message": "Soul crushing betrayal. Worse than childbirth, gall bladder, oral surgery……",
   "created_utc": 1703296270,
   "score": 4,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejq003",
   "message": "Stubbed my little toe so hard that I passed out. Pain was horrific—until I passed out.",
   "created_utc": 1703297163,
   "score": 5,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejed1f",
   "message": "That one dentist visit when was in secondary school (or maybe it was primary). Failing that, the time my calf cramped up playing football",
   "created_utc": 1703292164,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejhszp",
   "message": "My older brother Pyle drives me on our parents bed when I was 8 and my head stuck to far out the bottom.\n\nIt felt like eternity but I thought I was being electrocuted when pain shot all the way up from my neck to my spine.\n\nMy older brother was never so nice to me again.",
   "created_utc": 1703293667,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejixct",
   "message": "Having my knee reset after a 45 degree dislocation when I was 13.",
   "created_utc": 1703294145,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejj972",
   "message": "Blood clot in my catheter",
   "created_utc": 1703294285,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejkb08",
   "message": "A broken heart beats a nut kick anyday. Nut kick hurts but a broken heart lasts longer",
   "created_utc": 1703294727,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejpyab",
   "message": "The beginning of a colonoscopy without sedation. I asked them to stop and walked out. I was 17.\n\nIf we are talking about non-physical pain, then losing my mom at 28",
   "created_utc": 1703297142,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejq0h7",
   "message": "Pulling my hamstring. Though it hurt worse emotionally than physically",
   "created_utc": 1703297168,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejquo7",
   "message": "Being shot in the back with a pellet gun when I was a kid. I seriously thought we was were friends.\n\nEdit: typo",
   "created_utc": 1703297547,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejr2ga",
   "message": "Braking a leg",
   "created_utc": 1703297646,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejr3mk",
   "message": "L4-L5-S1 Spinal Fusion.  A real treat.",
   "created_utc": 1703297661,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejr8lx",
   "message": "leg cramp and having that stomachache when u didn't eat😭",
   "created_utc": 1703297725,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejsik1",
   "message": "Before it was a tooth infection/abscess that had gone untreated a week, not even with painkillers because my dentist was busy. I was pregnant so I couldn't take anything but Tylenol, which didn't work.\n\nThen it was unmedicated back labor with a heavy dose of pitocin that decreased the time between contractions to a minute maybe. Don't have a baby at a small hospital on a Sunday, the anesthesiologist takes forever.",
   "created_utc": 1703298286,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejtrvn",
   "message": "Physically - hitting a ditch that resulted in a vertebral compression fracture (not as bad as it sounds, but still really painful and disturbing to experience lol)           Emotionally - realizing the wrong I'd done to someone in my past and accepting the pain I'd caused in their lives. I thankfully have done all I can to apologize to them and make sure they know exactly what I'm sorry for. It was just saying things that were really upsetting, but it was so completely messed up of me, and I am still working on becoming who I want to be instead.",
   "created_utc": 1703298868,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejtun7",
   "message": "I pulled the muscles in between my ribs.  Worse than broken ribs.  Couldn't clear my throat without doubling over",
   "created_utc": 1703298904,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejuabe",
   "message": "so far, once i was walking outside after it rained, holding my kitten who shouldnt be outside lol cuz she climbs fences,  \n\n\ni walked down the deck stairs and whoosh, slipped hit my spine and ass and got a bruise a size of a tennis ball on my ass and it was so bad, hurt like hell.  \n\n\nanother time i was putting up decorations in my room on a shaky chair and fell and my like leg(bone) hit this thick wood painting i had that was leaning against my dresser; i hit it and layed on the ground for like 20 minutes.  \n\n\nit left an indent in my leg LOOLL",
   "created_utc": 1703299098,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejuejs",
   "message": "Being told ‘I never actually loved you’ by an ex I grew up with and dated 5 years in my twenties. I’ll never forget that feeling.  He took it back later and said he was just angry but it was already done.",
   "created_utc": 1703299151,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejugv5",
   "message": "getting my iud inserted",
   "created_utc": 1703299180,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejv237",
   "message": "My ear two days after getting a helix piercing",
   "created_utc": 1703299451,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejwusa",
   "message": "Brain damage took away my abilities as an artist. I used to be considered fairly talented—people wondering why I can’t draw like I used to is a pain I was never prepared for.",
   "created_utc": 1703300324,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejxekm",
   "message": "I once had the left side of my face swell up because of an issue with my teeth. I had a throbbing pain throughout my face making me unable to eat. I cried a lot.",
   "created_utc": 1703300596,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejxlqr",
   "message": "I'm going to be completely honest. I've broken 3 bones (one of which was my tailbone), but spraining my ankle is the absolute worst pain I've ever felt. I STILL have trouble walking on that foot, and I haven't been on a slide since. I wouldnt wish it on my worst enemy.",
   "created_utc": 1703300693,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejy6yx",
   "message": "In order of ouch:\n\n1) Gallstones\n2)kidney stones\n3) pancreatitis.",
   "created_utc": 1703300985,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejytu0",
   "message": "Childbirth, ovarian cyst burst, broken toe and finger those acute pinpoint pain really get me",
   "created_utc": 1703301304,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek0t0a",
   "message": "When my first child died at daycare. There is nothing that hurts worse than losing your child.",
   "created_utc": 1703302307,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek3tmg",
   "message": "Lupus flare/ premedicated lupus.\n\nThe sac around my heart held fluid and the chemo made me lose about 50lbs. Still feels like someone replaces all of my joints with straight rods from time to time. Currently in bed for daw two, walking hurts.",
   "created_utc": 1703303894,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek4frq",
   "message": "Physical, after-birth contractions, days after having my daughter. Emotional, being dumped 6 months ago; thought it was too good to be true, he was amazing to me, but was hiding a whole double life and was lying to me the whole time, I flew out to see him and everything.",
   "created_utc": 1703304225,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek4mq1",
   "message": "Ovarian cyst rupturing. I fell to the floor, vomiting, puking, and crying from the pain. It was a 7/10 on the pain scale easily.",
   "created_utc": 1703304330,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek4uum",
   "message": "I am a guy so probably gas pain",
   "created_utc": 1703304451,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek52hg",
   "message": "Just walking. I had degenerative hip syndrome for my entire childhood. Many years of the worst pain ever, just to walk.",
   "created_utc": 1703304565,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek5cld",
   "message": "1.Unexpected death of my husband \n2.Kidney stones",
   "created_utc": 1703304719,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek6qt1",
   "message": "Depression / Loneliness.",
   "created_utc": 1703305472,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek73kn",
   "message": "The contraction-like pain in your guts when you have IBS is pretty terrible.",
   "created_utc": 1703305669,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek74ko",
   "message": "Gallstones. Nearly killed me. My body went into shock, but it didn’t help the situation and it couldn’t sustain that state, so it started shutting down. BP fell to 52/19. I was roughly 30 weeks pregnant, too.",
   "created_utc": 1703305685,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek7k23",
   "message": "Waiting for my best friend/cousin to come over to play cards, only to find out he was just killed in a work accident. He was only 17, about to start his senior year of high school.\n\nHis death was 1000% preventable. His damn boss doesn’t care. She got married within the same month and can afford to donate $1 million dollars to the humane society, however let my grieving cousins family struggle to make ends meet.",
   "created_utc": 1703305924,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek7wcl",
   "message": "Treatment from breast cancer and having a mastectomy. Can't explain having a port put in my chest, the worst pain I have ever had as soon as meds wore off. I cried in bed trying not to wake anyone. I couldn't move or sleep ugh",
   "created_utc": 1703306114,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek8yow",
   "message": "Colonoscopy. They said it wasn't a big deal, so sedative wasn't really advisable. They were fucking liars. Liars!",
   "created_utc": 1703306717,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek9ivm",
   "message": "Gall stones. Lips went pale. Was fully conscious and could understand words but what came out of my mouth was slurred gibberish.",
   "created_utc": 1703307033,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejvpss",
   "message": "Appendicitis. Thought I was dying",
   "created_utc": 1703299766,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejn2qc",
   "message": "Childbirth and waiting too long to request an epidural 😵‍💫",
   "created_utc": 1703295910,
   "score": 2,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejtmgu",
   "message": "My ex made me watch the Taylor Swift documentary",
   "created_utc": 1703298795,
   "score": 3,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "keju2ay",
   "message": "Losing my vergenty and childbirth",
   "created_utc": 1703298999,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek9ct1",
   "message": "Endometriosis. It’s no joke.",
   "created_utc": 1703306937,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek4rbv",
   "message": "Nerve conduction velocity test. It involves sticking one needle in your elbow and another one between your fingers, then running a current between them. You are basically being electrocuted. They repeat the test for each finger.\n\n0/10 would not do again.",
   "created_utc": 1703304399,
   "score": 0,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejwhuq",
   "message": "MRSA infection",
   "created_utc": 1703300145,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejwug4",
   "message": "It sounds stupid but it was this time I chopped chili peppers and then just grabbed them and mixed em with my bare hands.\nAfter that questionable decision I felt like my hands were on FIRE, it was level fucking 10, red alert pain. It lasted the whole day and it didn’t go away.\nI tried washing my hands, milk, olive oil, cold water, ice, alcohol… that stupid mix worsened the pain.\nIt eventually wore off during the night.\nBut I remember getting in the car on my way home and just crying and begging to my mom to please take me to the ER because I couldn’t bear it anymore (she refused lol)",
   "created_utc": 1703300320,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejwwxi",
   "message": "The most pain felt at once, I'm not sure.\n\nMost pain I felt consistently was the onset of my MS. All of the skin in my left side hurt like when your arm falls asleep from restricted blood flow, all the time. From every folicle on the left side of my head to the sole of my left foot. Every second for about 2 years. Showering felt like being flayed. Like my hair was being pulled and making my skin fall off.\n\nIt's loads better now. In hindsight I can't believe I lived like that and didn't catch a life sentence for murder.",
   "created_utc": 1703300353,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejxg8r",
   "message": "Spilling boiling hot water on my stomach/groin area. Ended up healing within two weeks, but the pain was absolutely bonkers. Fastest I've ever been seen in the ER, too.",
   "created_utc": 1703300619,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejxzck",
   "message": "Having an ingrown toenail cut out",
   "created_utc": 1703300881,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejygwr",
   "message": "Kidney stones. Vomited quite a bit",
   "created_utc": 1703301121,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kejz0r4",
   "message": "Unable to take the exam that could change my life, because of extreme anxiety.",
   "created_utc": 1703301401,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek0ej8",
   "message": "IUD insertion. Passed out on the way home and had to call my bf out of work because I was upstairs in bed but the medicine I ordered was sitting at the door. I couldn’t get up to make it downstairs",
   "created_utc": 1703302098,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek0r1m",
   "message": "Upper ankle sprain . Playing in basketball game, Was running full speed to try to reject a guy in front of me, when I landed it was on a persons foot that was standing under the hoop. The pain was so bad I threw up …",
   "created_utc": 1703302279,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek10gi",
   "message": "A colposcopy to the back of your cervix with no pain management",
   "created_utc": 1703302412,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek12bh",
   "message": "A little lidocaine injection into an open wound in my finger.  Hurt for about 1 second of incredible pain then nothing.  Really weird.  \n\nLots of other pain from surgery, injuries and such, but that one second is the worst pain.",
   "created_utc": 1703302438,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek12pp",
   "message": "Emotionally: having a friend die in my arms when I was 13\n\nPhysically: When I got launched of a quad doing about 50km/hr, I hit the ground between my shoulders and below my neck. It was excruciating. But when I was at the hospital, the doctor said that I got very lucky. I didn't get have a concussion, and that although I'm in a lot of pain, there were no broken bones or major injuries. He said that I probably would've been killed or paralyzed if I had landed any further up towards my neck",
   "created_utc": 1703302445,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek1ex3",
   "message": "In terms of physical pain, not emotional pain lol. I got a really bad case of poison ivy one summer. The doctors told me my skin reacted to it worse than most people’s do, basically there was something about my skin that caused the reaction to be worse idk. The poison ivy inflammation started at my ankles and went all the way up my legs and bum, going all the way up my waist. Basically my entire lower body was covered in a red, inflamed rash that would also ooze. It was not only itchy, but extremely painful. The doctors told me they genuinely never saw a poison ivy reaction that bad. I basically couldn’t walk or do anything too physical for three and a half months. I had to have both my legs covered in gauze and other wrappings, and I had to get shots on my legs frequently. Not fun.",
   "created_utc": 1703302622,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek1gtk",
   "message": "I haven't experienced a lot of painful things but getting my IUD inserted was horrible. I was told to take pain medication an hour before I had it inserted but I woke up late so I didn't have time to. The pain was so bad I almost passed out. Not to mention having horrible cramps for months afterwards.",
   "created_utc": 1703302649,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek1lfg",
   "message": "When I was in high school my left nut would swell up if I got sexually excited and didn’t do anything about. Would wake up and feel like I’m getting kicked in the balls for hours at a time.",
   "created_utc": 1703302716,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek1zhx",
   "message": "The night after my IUD insertion. It hurt to walk, to pee. I got a shooting pain while peeing in the middle of the night, tried to stand up thinking that would help and woke up next to my bath tub with my ass in the air lol fuck those things, that didn’t last a year.",
   "created_utc": 1703302921,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek2046",
   "message": "Central nervous system hypersensitivity syndrome. Developed it nearly 10 years ago. Things that should feel innocuous, like clothing,  became unbearably painful. Started in my knee. Became too painful to bear weight on that leg. Couldn't stand long enough to have a shower or do anything. 24/7 excruciating, unrelenting  pain for 1.5 years. Couldnt work or do anything. Hqd to drug myself to sleep. Doctor tried all kinds of painkillers. Didn't work. Can't take opiods because they make it worse long term. Finally found a drug that dampens the pain so I can function. No way to fix it though.",
   "created_utc": 1703302930,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek241i",
   "message": "Physical: rolled my ankle then dislocated my knee. When drs ask about pain of 10/10, this is now that. \nEmotional: watching my dad die.",
   "created_utc": 1703302989,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek28vu",
   "message": "Depression, loneliness, addiction, terrible financial situation, unemployed, and tooth ache all at the same time.",
   "created_utc": 1703303059,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek29pc",
   "message": "lost my son in a motorcycle accident, he was 19.  He was killed instantly.  He would be 31 on this coming Valetines day.  It eats you alive daily, but especially this time of year. i do feel he's with me alot of times though.",
   "created_utc": 1703303071,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek2ds9",
   "message": "I broke my tooth in half during BMT graduation, eating some beef jerky. The nerve was exposed and I didn't want to get held back during tech school so I thugged it out. I couldn't even inhale through my mouth, twice during the 6 weeks I was eating in the DFAC and bit down on that side of my mouth... it was like my brain immediately swelled in my head and I would completely lose the desire to talk, eat, move. Worst pain ever",
   "created_utc": 1703303129,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek2jb8",
   "message": "Losing my mother",
   "created_utc": 1703303210,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek3dfa",
   "message": "Falling off a swing and my chest hitting against the rocks at the bottom",
   "created_utc": 1703303652,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek3r4d",
   "message": "The worst pain I’ve ever felt is probably from flu I had a while back. For some reason when I get flu my joints get inflamed really bad and it’s all of them. Every joint you could think of in the human body becomes painful like a 5-10 on pain scale and imagine it going on for 3 days. I cried a few times because the pain would never cease or lessen just pulse here and there. Always constant. If it was a kind of pain that only lasted an hour or two it would be no sweat, but after a whole day, it just becomes a nightmare.",
   "created_utc": 1703303857,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek3xor",
   "message": "Dry rot after wisdom teeth removal.",
   "created_utc": 1703303955,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek43aw",
   "message": "Sciatica. Some days I just wanted to cut my leg off it hurt so much, plus nerve pain travelled up back and also made it feel like I had been kicked in the balls.",
   "created_utc": 1703304040,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek46z0",
   "message": "Kidney stones",
   "created_utc": 1703304093,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kek4g02",
   "message": "Rotten tooth that needed a root canal.",
   "created_utc": 1703304229,
   "score": 1,
   "submission_id": "18ot8sv"
  },
  {
   "comment_id": "kekbo1v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ot8sv"
  }
 ]
}