{
 "submission_id": "18ox8no",
 "title": "What is not as fun as it would seem to be?",
 "selftext": "",
 "created_utc": 1703304476,
 "permalink": "/r/AskReddit/comments/18ox8no/what_is_not_as_fun_as_it_would_seem_to_be/",
 "score": 19,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ox8no/what_is_not_as_fun_as_it_would_seem_to_be/",
 "comments": [
  {
   "comment_id": "kek56gh",
   "message": "Game testing",
   "created_utc": 1703304626,
   "score": 199,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekygqm",
   "message": "Traveling for work.  Always thought it would be fun to see the world on someone else’s dime.  \n\nThe novelty wears off very quickly.  It’s exhausting, you never get as much downtime as you think (or have as much energy to do things as you think), and after a while you start to really miss home cooked food, your own bed etc.",
   "created_utc": 1703321599,
   "score": 131,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keklxb8",
   "message": "Living in a little village on a mountain. Everything is super expensive, and everyone’s an alcoholic",
   "created_utc": 1703314140,
   "score": 11,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keklyyu",
   "message": "New Years Eve in Times Square.",
   "created_utc": 1703314165,
   "score": 211,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek5pq4",
   "message": "Being a zookeeper.\n\nI thought it would be my dream job growing up. Studied zoology for 4 semesters and fought hard to get an internship in the field.\n\nI quit within a week :(.\n\nEven after a bunch of volunteer work with dogs/cows/horses, I had **no** idea how unbelievably foul zoo work could be. I threw up multiple times each day there. My car stunk to high heavens (which never fully went away) and my roommate was threatening to throw me out - not even showering was helping!\n\nThe animals are cute, but I have no clue how people can deal with that. Ugh.",
   "created_utc": 1703304916,
   "score": 81,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek94km",
   "message": "When I was growing up back in the 80s I knew I wanted to work with computers when I grew up. There was still a lot of magic to them back then, especially when you were 10. Commodore, Atari, Apple (both the \\]\\[ and Mac lines), Coleco, TI, IBM, Radio Shack, and Amiga all had multiple viable personal computers. You had an ocean of groundbreaking peripherals and every day it seemed like sound and graphics jumped by light years. We didn't have the internet but we had BBSes. All my friends had their own BBSes and it was constant drama between us all.\n\nToday I work in IT. I'm at a mid-level management position so most of my job is managing projects, coordinating vendors, and transitioning our legacy datacenter to AWS.\n\nIt is nowhere near as exciting as 80s movies led me to believe.",
   "created_utc": 1703306808,
   "score": 252,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek8qhy",
   "message": "I worked a (manual, not explosive) demolition job. Gotta be fun tearing things down, right? It was brutally hard work, and hard on the body.",
   "created_utc": 1703306587,
   "score": 162,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekoxdf",
   "message": "Working in the entertainment industry",
   "created_utc": 1703315904,
   "score": 166,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekfqy3",
   "message": "Touring. Either as a band or another kind of artist. So much boring downtime, so much driving, eating like shit, not being able to shower or use the bathroom when you want, loading heavy ass gear in and out, up and down stairs... Touring is the reason so many artists develop addictions. Being fucked up lets you be content with doing nothing and having tons of downtime.",
   "created_utc": 1703310689,
   "score": 215,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek87wd",
   "message": "Sharing a standard sized bathtub with your romantic partner when one of you is over six feet tall.",
   "created_utc": 1703306292,
   "score": 126,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekaniq",
   "message": "Driving 18 wheelers or operating heavy equipment. It’s awesome at first and stays awesome for a while but, then it becomes the most bland thing on earth. Day in day out it ruins the charm.",
   "created_utc": 1703307688,
   "score": 59,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekucfo",
   "message": "The work hard play hard mentality. You work a ton and have a ton of money but you’re too tired to go anywhere to spend any of it.",
   "created_utc": 1703319120,
   "score": 132,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekcnlp",
   "message": "People used to always tell me 'oh it must be so fun to work at Spirit Halloween!!'. It was not.",
   "created_utc": 1703308876,
   "score": 205,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keka0ic",
   "message": "I'm saying this as I'm currently in Vegas but slots, at least the modern ones. I don't particularly see the appeal of them. Maybe it would have been different if it were the original coin operated ones. I could see myself getting addicted to those. But I just feel weird inserting 20$ bills and watching them vanish. It just puts me on edge.",
   "created_utc": 1703307315,
   "score": 105,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek6dkj",
   "message": "Owning pet ferrets \n\n(here in the UK at least, where de-scenting them is illegal)\n\nThey're so cute but oh man it's not worth it 🤮🤮",
   "created_utc": 1703305274,
   "score": 212,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekjg55",
   "message": "Having a job where you don't really do much. \n\nFulfillment is important.",
   "created_utc": 1703312734,
   "score": 236,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek9nri",
   "message": "Autofellatio. \n\nFeels more like sucking a cock than getting your cock sucked. \n\nAlso tends to hurt your back.",
   "created_utc": 1703307111,
   "score": 173,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keka5z6",
   "message": "Going to Disneyland and Universal Studios, I spent most of the time waiting in extremely long queues (many 30-45 minutes wait) to go onto the rides or avoiding rides because of their extremely long queues, everything was also very expensive.",
   "created_utc": 1703307404,
   "score": 205,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek5zbx",
   "message": "Shower sex.",
   "created_utc": 1703305062,
   "score": 145,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kem7zim",
   "message": "Being a videogame QA tester.\r  \n\r  \n\rI've had a handful of people aspiring to be video game testers, thinking that testing games as in 'playing them' - and I mean games only - all the time is a quick and easy way to make your hobby your job while making money in the process.\r  \n\r  \nThe reality is much different and not nearly as fun as one may think.\r  \n\r  \nYou will be playing the same boring part in a game over and over and over again,\r  \n\r  \nlet along the game might not be even that good to begin with.\r  \n\r  \nSoon enough you'll be completely burnt out, sick of playing games.",
   "created_utc": 1703344589,
   "score": 33,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keke70s",
   "message": "Sex on the beach.\n\nThe deed, not the drink.\n\nThere are some places where sand DOES NOT belong.",
   "created_utc": 1703309821,
   "score": 133,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek5pzn",
   "message": "Engaging with local politics. Democratic society should be building youngsters up to enjoy and even anticipate the act of expressing their first amendment rights, speaking out/up in town halls, demonstrating against injustice, etc.\n\nInstead, we do none of those things, and day by day those liberties evaporate.",
   "created_utc": 1703304920,
   "score": 28,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekboy3",
   "message": "Carnival rides. Why are they so crazy? I don’t need to know what it feels like when my body thinks its about to die.",
   "created_utc": 1703308294,
   "score": 150,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekq583",
   "message": "When you’re 13 dreaming of being an adult for freedom then it sucks ass 10x more",
   "created_utc": 1703316650,
   "score": 146,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keku98u",
   "message": "Winter.  As someone who lived in a place with 6 months of winter for four decades and then got the hell out when they could afford to... you are a special breed of person if you \"love\" winter.  \n\nThe cold.  The layers of clothing.  The shovelling.  The scraping the ice off your vehicle.  The freezing rain on the roads.  The snow drifts.  The darkness.  The heating bills.  The slush.  The lack of any colour that isn't yellow, brown, white, or grey.\n\nSure, the first snow fall might be pretty but after that you're praying to a god that you don't even believe in that it will be summer again soon.",
   "created_utc": 1703319064,
   "score": 188,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekaxsq",
   "message": "I just don’t think rollercoasters are worth the lines.",
   "created_utc": 1703307853,
   "score": 139,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekknff",
   "message": "Working at a movie theatre, I think I could rival the “Swamps of Dagobah” story if I was good at telling stories. It was horrible, and something I’ll remember till I die.",
   "created_utc": 1703313403,
   "score": 47,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekdxeq",
   "message": "Staying up all night. As a kid you just want to do this all the time. In high-school I did a few all night D\u0026amp;D sessions. It was fun at first, but by 6am your just freaking tired as hell. I did an all nighter Magic tournament back when I still played years ago. I had work the next day. Good god what an exhausting day. After lunch I barely remember anything other than the feeling that my shift just wouldn't end. I had been up for at least 36 hours. I went to bed at 4pm and didn't wake up till noon the next day. Staying up is fun, but sleep is always nice as well.",
   "created_utc": 1703309664,
   "score": 72,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek7pvx",
   "message": "indoor skydiving",
   "created_utc": 1703306015,
   "score": 60,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekk063",
   "message": "Having fun. I'm happy just chilling on my couch at home, thanks.",
   "created_utc": 1703313046,
   "score": 60,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kel78ks",
   "message": "Living in what was once your dream country.\n\nI loved Tokyo when I visited, but now I’ve lived here for years and I’m over it. I feel it would be the same anywhere though.\n\nAlso studying what you enjoyed as a hobby! When I had to do illustration at university, the lack of interesting briefs really made it dry.",
   "created_utc": 1703326892,
   "score": 18,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekq2h7",
   "message": "Driving a car. I was so excited to get my license and to buy a car finally. It was my dream that became true. I sometimes just went for some rides just to start feeling the car better(I drive manual) and to enjoy speed and empty night roads. Everything was great for the first year, but then...I changed my work for a higher salary and my schedule also changed. Now I spend 3-4 hours a day being in a traffic jam and it's such a waste of time. Also most of my friends and relatives don't have any car so I sometimes help them to move things. I fucking hate driving now. My dream now is to get a personal driver and to enjoy a passenger seat.",
   "created_utc": 1703316604,
   "score": 54,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kelnbp6",
   "message": "I’ll tell you the opposite \n\nWhen I turned 18 had no idea what I wanted to do for a living, worked a dozen random jobs, one being a tire tech at a automotive shop\n\nI fucking hated it, quit after 3 months\n\n6 years later I lost my job I almost enjoyed, unemployment was about to run out, only job offer I got at the end was tire tech, but on semi trucks\n\nWhich I was 100% it would be worse, but had to take it so figured I’d suffer until I found something else\n\n5 years later I’m now a diesel mechanic and I fucken love my job lol\n\nReally goes to show if your co-workers are a bunch of pieces of shit like at every job I ever worked until I became a tire tech the second time, it can make a fun job garbage. And if theyre cool it can make a shit job great\n\nIt took working a job I didn’t want but with cool people to start enjoying the work, and now I work with people I absolutely hate but I still like my job and even with being surrounded by jackasses I still have a good time",
   "created_utc": 1703335943,
   "score": 17,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekddsr",
   "message": "Having too many one night stands.. it gets unfulfilling after a while",
   "created_utc": 1703309328,
   "score": 61,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kemqc1r",
   "message": "Being an adult isn't that nice as you think as a teen\r  \n\r  \nBeing a teen isn't as fun as you remember as a adult",
   "created_utc": 1703351500,
   "score": 1,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekjmf7",
   "message": "Clubbing. I mean, some people love it, but it's just a loud, anoying, expensive, protentious mess to me. A bunch of peacocks in a room screaming over peacock music to spend money on a 0.01% chance someone might look at them. It's kind of embaressing, honestly.",
   "created_utc": 1703312833,
   "score": 227,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek8ji0",
   "message": "Just adulting in general.",
   "created_utc": 1703306476,
   "score": 113,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kekpmet",
   "message": "I thought it would be fun to work at the Spirit Halloween Store, but I did it one year and it wasn't fun.",
   "created_utc": 1703316331,
   "score": 11,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kel3qkf",
   "message": "Tickling",
   "created_utc": 1703324773,
   "score": 12,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keklqup",
   "message": "Two person kayak",
   "created_utc": 1703314032,
   "score": 19,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keleikd",
   "message": "Festivals.\nYou wait in line for drinks like half the time, you have to wait in line for the bathroom which is almost always packed and very unhygienic (vomit, piss, shit in random places) sometimes the music isn't great, the weather can turn from amazing to absolute crap in a few minutes and everything is overpriced. \nAlso getting out of the event whether it be Uber or driving, can take just as long as waiting in line for drinks. On the odd few occasions people also end up losing stuff i.e wallets, phones, glasses etc... At the end of the day, you end up waiting/ideling for most of the festival rather than actually enjoying it.",
   "created_utc": 1703331213,
   "score": 18,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kelbbla",
   "message": "Zip lining. I did a zip line course in southern Ohio and it was ok but I wouldn’t spend money to do it again…",
   "created_utc": 1703329348,
   "score": 10,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek5a9o",
   "message": "Getting your own place. Well, because of bills.",
   "created_utc": 1703304683,
   "score": 50,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kek5xk0",
   "message": "starring in a porno",
   "created_utc": 1703305035,
   "score": 34,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "keky3p1",
   "message": "Visitors in the hospital. If you're exhausted and in agony, pulling yourself together to reassure someone else isn't reassuring at all. If you're going to, say, ignore strict instructions to stay away and instead swarm the room en masse before the pain meds kick in at least bring a balloon or something. It's incredibly awkward to ask hospital security to kick people out so you can wince and faint in peace\n\nAlso back rubs when sick and injured. Movies show it as some healing bonding moment and heartfelt expression of human solidarity. Apparently it just makes me want to shove the uninvited grabby petting person out the nearest window.",
   "created_utc": 1703321383,
   "score": 26,
   "submission_id": "18ox8no"
  },
  {
   "comment_id": "kektfth",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18ox8no"
  }
 ]
}