{
 "submission_id": "18ozkij",
 "title": "What's something you believe simply because it's too weird to be made up?",
 "selftext": "",
 "created_utc": 1703312826,
 "permalink": "/r/AskReddit/comments/18ozkij/whats_something_you_believe_simply_because_its/",
 "score": 5,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ozkij/whats_something_you_believe_simply_because_its/",
 "comments": [
  {
   "comment_id": "kekmcis",
   "message": "My parents have been divorced for two years. At the height of their animosity, my father told me:\n\n“your mother doesn’t trust ANY men because her OWN father doesn’t think that fidelity includes blowjobs from geishas.”\n\ndon’t know if it’s true, but part of me believes it—given my mother’s trust issues, my grandma’s depression, and my grandpa’s regular flights to Japan.",
   "created_utc": 1703314385,
   "score": 1,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "keko3cj",
   "message": "“Let go or be dragged” and old zen proverb I heard at a meditation class. Really changed the way I let myself worry about things",
   "created_utc": 1703315405,
   "score": 4,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "kekjvho",
   "message": "What is it about vaginas that make them attractive? Moist smelly strange looking thing that bleeds",
   "created_utc": 1703312972,
   "score": 0,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "kekk8cn",
   "message": "They can’t get pregnant if they’re on top, gravity.",
   "created_utc": 1703313169,
   "score": 0,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "kekmgwn",
   "message": "Nothing. Something sounding \"too\" weird is no indication it's true. In fact I don't think there is such a thing as too weird, as in there's no hard limit or maximum to weirdness. People will often come up with something even weirder given enough time.  \n\nI've head some very strange and weird stuff over the years.  \n\nSome will believe almost anything. It's like they have no filter or guard in place to protect them. There are a number of possible different reasons for this.  \n\nAnd then some will bend and twist their perception of reality to fit their beliefs. They have rigid ideas and beliefs and everything must conform to them. They may deny anything that does not fit their beliefs. They may even seek to attack and destroy that which does not conform to their beliefs.  \n\nI'll give you a couple real examples.  \n\nSomeone told me that a three headed monster chicken roams a hill and drags members of the public underground.  \n\nAnother person told me that they use helicopters flying upside down to cut hedges.  \n\nLastly, Arthur Conan Doyle, the author of the famously logical Sherlock Holmes, believed that [two girls took photos of fairies living at the bottom of their garden](https://en.wikipedia.org/wiki/Cottingley_Fairies). He believed that only those two girls saw them as they were pure children.  \n\nHe desperately wanted to believe it as it fitted into his beliefs. Needless to say it was a hoax.  \n\nI've heard plenty of things like that. Some of them much worse.",
   "created_utc": 1703314453,
   "score": 1,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "kekodlz",
   "message": "\"And now that you don't have to be perfect, you can be good.\"\n\n--John Steinbeck, East of Eden",
   "created_utc": 1703315575,
   "score": 1,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "kekofuk",
   "message": "“Graveyards are full of irreplaceable people”.\n\nThat quote helped me stop going down the path of working myself to death because “my job needs me”.",
   "created_utc": 1703315612,
   "score": 1,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "kekoifw",
   "message": "“It’s easy to fool someone,it’s hard to convince them that they’ve been fooled”",
   "created_utc": 1703315659,
   "score": 1,
   "submission_id": "18ozkij"
  },
  {
   "comment_id": "kektj67",
   "message": "That every house (thats not new) you have gone to, someone (normally an old person) has died there. Even if its a new condo or something, someone died on the same land you live in. People die in houses all the time.",
   "created_utc": 1703318640,
   "score": 1,
   "submission_id": "18ozkij"
  }
 ]
}