{
 "submission_id": "18p1kz2",
 "title": "[Serious] What do you need to get off your chest?",
 "selftext": "",
 "created_utc": 1703321318,
 "permalink": "/r/AskReddit/comments/18p1kz2/serious_what_do_you_need_to_get_off_your_chest/",
 "score": 225,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p1kz2/serious_what_do_you_need_to_get_off_your_chest/",
 "comments": [
  {
   "comment_id": "keky065",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703321319,
   "score": 1,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel0sx0",
   "message": "I feel lonely as hell..",
   "created_utc": 1703322990,
   "score": 249,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel181l",
   "message": "I desperately need a hug",
   "created_utc": 1703323237,
   "score": 190,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelcfmi",
   "message": "Not looking for sympathy or pats on the back, just getting it off my chest. \n\nI got sober this year, 6 months now, and not a day goes by that I don’t wish I could pick up a handle or down a bottle of painkillers again. That is all, have a fantastic whatever day it is.",
   "created_utc": 1703330031,
   "score": 41,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel68eg",
   "message": "My best friend and I don't talk to each other anymore and I miss her so much",
   "created_utc": 1703326289,
   "score": 131,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "keky8yy",
   "message": "I've spent close to $300 in the last week on stupid games and I will never get that money back.",
   "created_utc": 1703321469,
   "score": 104,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel6qe5",
   "message": "I feel like a failure.",
   "created_utc": 1703326581,
   "score": 82,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelrf0r",
   "message": "I fucking hate the job hunting process. All HRs and hiring managers can fuck off.",
   "created_utc": 1703337873,
   "score": 58,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kekz9ov",
   "message": "A lot of things but it doesn't matter. Nothing's going to change.",
   "created_utc": 1703322090,
   "score": 154,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel9j4g",
   "message": "This will be the very first Christmas that I've had to spend away from my wife and kids because of work and no matter what I tell myself or them, I'm so fucking lonely. I've been, off/on in the oil and gas industry in Texas since my mid 20's, I'm going to be 45 on January 1st (I'll still be at work for that also) but our family has grown accustomed to me not being around for holidays and birthdays and such so we usually plan those things around my days off.\n\nSomething about this time makes it hard to breathe. I cry all the time now, I'll never tell them but I feel like I've failed them as a father and husband. My wife has stuck by me through the hardest times, I'm sure she's wanted more from life and could have had it with someone else, she says she wouldn't want to be anywhere else but that doesn't make any of it easier to swallow. I can feel my kids drifting away, especially my older two. I'm gone with work for 28-35 days at a time and I've missed so much of my kids growing up. I understand it was my choice to keep doing this but I guess as I'm getting older it's really hitting me how much I've missed and I'll never get those years back. We make it on what I earn from my job but \n\nThis year, like a lot of other people has been the absolute hardest year so far for us as a family. in March we lost our house and all of our belongings in a fire. Over 20 years, a lifetime's worth of memories were gone.we took over the house (which was my dad's) from my sister who, apparently decided at 36 that she wanted to become a meth head. Spent $6k getting the house out of default, $2k cleaning it up to make it liveable and then paid the mortgage with the intention of repairing my credit and getting the house in my name and out from under my dad's.\n\nThat never happened, we lost everything and he and his new wife came down and gave us $8k because, I guess he thought that would cover everything we lost and hit the road. He got $300k from insurance on a house he bought for $99k. He left a check with my wife to give to the crew clearing the debris left after the fire, it was for $9k. I know I should have had renters insurance and I kick myself everyday for not having it but I didn't and that's that. We have 4 kids and they're his only grandchildren, my brother and sister don't have any kids and probably won't ever have any and even after the fire, to this day he hasn't called to ask about them and how they're doing or how they're handling that kind of trauma.\n\nI guess I went all over the place with this reply but I guess the thing I wanted to really get off my chest is, I'm sorry. I'm sorry for not being a better son, brother, husband and father. I'm sorry for arguing with my mother and not telling her I love her the last time I got to talk to her before she died. I'm sorry I couldn't make my father proud of me, I'm sorry I couldn't give my wife the comfortable life she deserved. I'm sorry I wasn't there for my babies when I'm sure they needed me to be. \n\nI'm just so sorry.",
   "created_utc": 1703328277,
   "score": 47,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kekyord",
   "message": "My daughter. She’s 2 weeks old today and won’t sleep anywhere else. Girl it’s 1 am I need to shower.",
   "created_utc": 1703321735,
   "score": 138,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kekzdwu",
   "message": "I don’t know how to date",
   "created_utc": 1703322160,
   "score": 85,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelashw",
   "message": "I hope my ex will have a very bad christmas and that he never contacts me ever again",
   "created_utc": 1703329038,
   "score": 27,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel630c",
   "message": "I think about killing myself everyday",
   "created_utc": 1703326205,
   "score": 53,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelsojy",
   "message": "I feel inadequate",
   "created_utc": 1703338440,
   "score": 22,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kekzqnl",
   "message": "I got laid off from my job but I haven't told my parents or anyone else yet. I don't know where my next pay cheque is gonna come from and I don't have much money left. We come from a poor background and it's honestly freaking me the fuck out. I just want this to end so badly.",
   "created_utc": 1703322365,
   "score": 35,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelfr6y",
   "message": "I secretly love that all my ex girlfriends that treated me like shit are miserable, and I'm  really  truly honestly happy with the way things turned out in my life",
   "created_utc": 1703331904,
   "score": 14,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "keky9rj",
   "message": "[removed]",
   "created_utc": 1703321482,
   "score": 13,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel6vhs",
   "message": "Reddit has enriched my life. I've learned things that improved my finances and health, I've talked with interesting people, and I've expanded my sexual explorations. I know people make fun of Reddit or criticize aspects of it, but I love this place.",
   "created_utc": 1703326662,
   "score": 67,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel0lf1",
   "message": "I don't understand how to enjoy life and I'm worried that I'm going to look back on my deathbed with regret.",
   "created_utc": 1703322872,
   "score": 25,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel7ynt",
   "message": "I feel like something big is coming but I can’t put it into words. Almost like everything that happens right now is pointless and will have zero impact. I feel crazy so I don’t talk about it",
   "created_utc": 1703327319,
   "score": 25,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "keloo4u",
   "message": "I’ve come to the conclusion my family, wife and kids, don’t care if I’m around. My a 41 year college freshman, decided to take a break from school and change my major. I told the wife the other night and she said figures. It’s crushed me. She didn’t even ask what I was thinking of change my major to. It’s pre-law. I want to be a lawyer.",
   "created_utc": 1703336593,
   "score": 27,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel8wxa",
   "message": "i kinda don't want to work anymore.  \n\n\ni'm 45 and have been unemployed for almost 2 years. originally quit because of back-to-back covid and burn out. told my boss i needed a year off and she was okay with taking me back once i recovered. when i checked on the team last june, i found out that half the team was laid off including her. i was in the company for ten years and my salary more than doubled during that time. starting anew in a different company for the same post means that my starting salary might be half of what i used to make. as it is, my finances can probably last another 6 more months though i am waiting for a windfall from my family.",
   "created_utc": 1703327904,
   "score": 9,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel7otf",
   "message": "Unusual human behavior. \n\nLike when people flip out on airplanes. When people flip out at a fast food restaurant department stores.\n\nIt's like a different type of mental illness.\n\nThey revert back to adolescence and throw temper tantrums.",
   "created_utc": 1703327160,
   "score": 19,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel4cij",
   "message": "I'm afraid for my marriage and my family.",
   "created_utc": 1703325160,
   "score": 9,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelbprv",
   "message": "my therapist told me my parents were abusive yesterday. i just sat there, silent. i didn't really know how to take the information? i have a good relationship with my parents, but it hasn't always been like that. there's some resentment there and i know i have some trauma from certain things they would say/do, but i never thought someone would describe them as abusive? idk...it was a lot to take in, but also felt like i needed to hear it? idk, dude.",
   "created_utc": 1703329603,
   "score": 9,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel05e0",
   "message": "My mother got away with molesting me because she burnt into my brain the cops won’t do anything, and really she was right. It takes YEARS before the cops are able to reach every sexual assault case.",
   "created_utc": 1703322605,
   "score": 18,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelqa3t",
   "message": "That sometimes I regret marrying my husband.",
   "created_utc": 1703337356,
   "score": 19,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel2uio",
   "message": "I'm horny posting way too much...",
   "created_utc": 1703324209,
   "score": 16,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel76iq",
   "message": "[deleted]",
   "created_utc": 1703326856,
   "score": 9,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel5du6",
   "message": "My girlfriend broke up with me because of her mental health and refused to let me in or help. All that after coming home from a deployment that destroyed my mental health. I’m on antidepressants, I’m moving to a whole new city  in 2 months alone, my anxiety is through the roof, I’m at my breaking point and I’ve never felt so alone or broken. The only thing that’s kept me barely going is my dog.",
   "created_utc": 1703325765,
   "score": 7,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemaswn",
   "message": "I'm afraid of the future.",
   "created_utc": 1703345665,
   "score": 7,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel7d7i",
   "message": "I'm only the backup plan for my friends. I don't have any other friends and I can't socialize good, so I just deal with it and pretend it's all good.\n\nHolidays aren't going great :)",
   "created_utc": 1703326969,
   "score": 7,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelroko",
   "message": "i need MONEYYY",
   "created_utc": 1703337994,
   "score": 6,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kem7t9a",
   "message": "I'm getting better and have no one to share it with because no one knows my story\n\nI used to find joy in the thought of my own death. \"Hey, it's the end, finally I won't be hurting\". I used to try to keep myself in a low place because it worked better than actually falling again. I used to vape (3 months clean coming up soon). I used to self-harm. I used to waste my life away on anything bad for me... gaming all the time, not making friends, no real hobbies, a porn addiction. \n\nMaybe I'm still working in getting better, but I'm joining extra-curriculars in school. I'm getting the next step to being better. And I don't need friends to make my life good, I just am working on fixing myself rn in ways I didn't think I needed.\n\nI'm reading. I'm going and walking. I go to they gym. I might get a job this upcoming semester. I play games still, just not as much. I cook, I clean, I take care of my cats...\n\nMy life fell apart September of 22. It was my grand awakening to the real world. To grief. To people leaving. To people hurting me. I was 15 and no one was there for me, but I was naive and didn't know. \n\nI'm 16 now... a lot has changed. Looking at last year... it felt so dark. So cold. Looking anytime before that, I just seem like a stranger. But now... idk. I've been broken up with recently and it was getting close really fast and it meant something to me again because I was happy before and into it. \n\nThe worst part is... no one knows. I'm proud of myself, but I just wish someone was close enough to me to know it",
   "created_utc": 1703344522,
   "score": 7,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemcfyz",
   "message": "I’m so sick and tired of my mom. My dad died a year and a half ago and she’s doing nothing for herself. Doesn’t cook for herself, doesn’t clean up after herself and refuses to go to therapy. I want to go overseas and carry on with my life but she’s holding me back.",
   "created_utc": 1703346278,
   "score": 5,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemp77a",
   "message": "Seeing my parents grow old eats away at my soul every day.",
   "created_utc": 1703351076,
   "score": 6,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kekzjof",
   "message": "I really, really want the answer to my life's problems to be weapons, but I think it isn't.",
   "created_utc": 1703322253,
   "score": 19,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel1ana",
   "message": "My love for alcohol is dying as I get older, just don’t want it anymore very rarely in the form of beers during sporting events",
   "created_utc": 1703323279,
   "score": 12,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel59yw",
   "message": "That I wish I could tell my family ive been back on meth for 6 months right under their noses and only hide it so they dont worry and self preservation. The fact everytime i start using they all compliment me on my sudden progress and the happiness i have, even tho thats the drugs. I wish i could help you understand why i do what i do. But none of you seem to grasp it. It fixes what 15 years of therapy and psyc meds have not. One day, I'll find a better answer but for now. It is what it is. At least I don't think about suicide everyday while I'm using",
   "created_utc": 1703325704,
   "score": 11,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelg3uf",
   "message": "Breast cancer.",
   "created_utc": 1703332111,
   "score": 5,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelqiku",
   "message": "My 17 yo son is very disrespectful to me, it destroys me, he seems angry about something? I am confused if it’s normal teenage behaviour, or if he is just taking on his dads (my ex) traits as he was/is similar or if there’s something else going on and as his nearest/ dearest I am coping it. I miss his hugs so much",
   "created_utc": 1703337464,
   "score": 5,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelunpd",
   "message": "I'm very unhappy with my life in general. \n\nI have a good job, just got a raise and my boss appreciates me.\n\nI have a loving and supportive wife.\n\nNone of it brings me any joy. I'm a miserable grump most of the time and don't know why anyone puts up with me.\n\nI daydream about leaving everyone and everything behind, moving somewhere else and starting over alone.",
   "created_utc": 1703339302,
   "score": 4,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kem73hv",
   "message": "Man I just want a hug.",
   "created_utc": 1703344253,
   "score": 5,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kekycuy",
   "message": "mw3 \u0026amp; war zone are both such ass !!!",
   "created_utc": 1703321533,
   "score": 10,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel4bhm",
   "message": "Ability to having kids should be opt in. Not opt out",
   "created_utc": 1703325144,
   "score": 10,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel0f0w",
   "message": "Pneumonia.",
   "created_utc": 1703322768,
   "score": 6,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel6xss",
   "message": "The bra-line under my tits.",
   "created_utc": 1703326703,
   "score": 5,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kela0eu",
   "message": "Shit dog I’m high asf.",
   "created_utc": 1703328584,
   "score": 6,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelj95u",
   "message": "just wanna die ngl",
   "created_utc": 1703333842,
   "score": 7,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kekyzin",
   "message": "My chest 🗣️ I'm saving for top surgery",
   "created_utc": 1703321921,
   "score": 24,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel9rz1",
   "message": "Everyday i contemplate suicide and no matter how happy i am it has never left me",
   "created_utc": 1703328428,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelemq0",
   "message": "I just confirmed my suspicions of my bf cheating thanks to the dash cam.",
   "created_utc": 1703331278,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelevpz",
   "message": "A cat who’s making biscuits.",
   "created_utc": 1703331414,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kell6ys",
   "message": "I'm really depressed and a lot of it is because of how my partner treats me. Tried addressing the behavior but nothing sticks long-term. She has made some very minor improvements but the actual.important stuff doesn't seem to click.",
   "created_utc": 1703334865,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelmgp6",
   "message": "Someone fucked me up and now im a mess, without my parents i would be in the streets already.cant get a job since i dont have any self confidence,",
   "created_utc": 1703335511,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelop73",
   "message": "My relationship is starting to become toxic: almost no sex life, just from time to time a little trip and I feel more like her best friend than her bf.\nEven if we talked about it, nothing changed and I'm trying my best to change this situation. Every day I feel more frustrated",
   "created_utc": 1703336607,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelq61z",
   "message": "Christmas is shit and it should be acceptable yo just not celebrate it without family kicking off and getting upset you wanna stay home",
   "created_utc": 1703337302,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelqt4v",
   "message": "Get off your damn phones when you’re driving!!!! You drive too slow, swerve all over the place, and slam on your brakes cause you aren’t paying attention. So annoying trying to get somewhere anymore.",
   "created_utc": 1703337598,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kem8pta",
   "message": "This cat.\n\nSeriously, I can't sit down without her getting all up in my shit. She acts like she has no bed of her own and is starved for attention.\n\nPlease, help me",
   "created_utc": 1703344873,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kem9hd9",
   "message": "I am a total failure and can only keep getting out of bed \"one day at a time\" for a short time longer.",
   "created_utc": 1703345167,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemfjkg",
   "message": "I love eating ass",
   "created_utc": 1703347445,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "ken97zt",
   "message": "I have a cold and it’s starting to travel from my sinuses down into my lungs. I want it out of, and off, my chest. Ugh.",
   "created_utc": 1703358859,
   "score": 3,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "keky46r",
   "message": "Cat",
   "created_utc": 1703321391,
   "score": 10,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel0myi",
   "message": "My man boobs!",
   "created_utc": 1703322896,
   "score": 7,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "keldhvh",
   "message": "After I found out my husband cheated on me earlier this year (he confessed he was drunk when it happened and he claims the woman later told him he kept saying my name the whole time) I've had trust issues. I never used to care if he was on his phone a lot but now I suspect him all of the time. Also found our, he was sending videos of himself and some of me to women on snapshot so we can have a threesome. I told him I want a divorce but he begged me to give him another chance. He is the love of my life. I can get past the snapshot stuff but the fucking someone elss is hard. I started a snapshot myself and have been talking to two guys. Actually met one in person and we clicked. We We've had a few dates and have sent each other explicit videos and photos. I haven't fucked him yet because I'm still married but I really want to fuck him. Between my husband cheating, my trust issues now, and my seeking someone else, I think my marriage is over.",
   "created_utc": 1703330642,
   "score": 7,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel2dca",
   "message": "I've recently started dating for the first time after a messy break up about 4 years ago, there are 3 people who i've been talking too who are all really nice and have had a couple of dates with them so far with more booked in Jan.\n\nIts emotionally exhausting and i feel like its causing some of the stuff i thought i'd moved past to bubble up to the surface and its giving me serious anxiety attacks, i feel like any day i might just sack it off and go back to being a recluse.",
   "created_utc": 1703323914,
   "score": 6,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel3j4n",
   "message": "I constantly struggle with a feeling of \"I don't want this\" \nThat feeling covers just about all aspects of my life, not in a I'm jumping off a bridge way...",
   "created_utc": 1703324643,
   "score": 5,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel46w4",
   "message": "Hair.",
   "created_utc": 1703325062,
   "score": 6,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel91wr",
   "message": "Mistakes I made towards my girlfriend. We’re still together because she loves me very much and so do I. I just wish I could undo the stupid shit I did towards her because she really didn’t deserve that at all.",
   "created_utc": 1703327988,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kel931n",
   "message": "I would tell my ex that she didn’t deserve what I did for her",
   "created_utc": 1703328007,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kele0ea",
   "message": "I’m miserable but can’t seem to get myself to change. I just want to move out and start over",
   "created_utc": 1703330932,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelgn6w",
   "message": "That I’m bisexual and no one knows it! Hid it ever since I was a teen! Wonder if being molested by an older male as a child while down by the river and actually liking him doing it had anything to do with me being bisexual?",
   "created_utc": 1703332415,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelh620",
   "message": "I feel like college is a huge waste of time and money knowing my country's way of college is disappointing compared to other countries.",
   "created_utc": 1703332705,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "keliud6",
   "message": "I feel like my \"best friend\" is just using me as an editor. I've started editing her videos, tried to tell her how draining it is, and she just brushes it off. My friend tells me I might be overthinking it, but this friend also said she understands where im coming from.",
   "created_utc": 1703333628,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelj6d3",
   "message": "I may get into a long term relationship with a woman 22 years my senior. I'll have to bring her to my country while I'm in college.\n\nI love her and we work out great together, but I worry for the future of our age gap relationship.",
   "created_utc": 1703333798,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kell1e4",
   "message": "I'm an internet addict and I need to stop please help me (also I jerk off a lot)",
   "created_utc": 1703334784,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelm5oo",
   "message": "I wish I never went to college. I feel like an underachieving burned out loser who wasted the past 5 years of my life and now I’ll never be able to live the life I dreamed of before.",
   "created_utc": 1703335353,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelmsbi",
   "message": "I fuck up everything I touch, and I mean EVERYTHING.",
   "created_utc": 1703335672,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelplky",
   "message": "I feel like no one will love me ever again. I just want a genuine human connection with a person I love and who will love me back and hold me tight.",
   "created_utc": 1703337031,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kem8h3q",
   "message": "My parents think I've stopped playing games and watching YouTube at night, but I haven't and I feel bad because it feels like an addiction to play late at night",
   "created_utc": 1703344780,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kem8nhl",
   "message": "I wonder if I'm depressed. I'm tired all the time, don't celebrate my wins as much as I used to, and have to actively hype myself up to do some of the hobbies that I used to enjoy a lot more. Sometimes I just get moments of numbness or randomly want to cry. But it feels like a reach to call that depression when I hear stories of actual depression struggles from acquaintances that are genuinely having a hard time.",
   "created_utc": 1703344849,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kem98eo",
   "message": "The housing market is so fucked that I feel I've wasted my 20s in the attempt to save for a house/condo that I'll never be able to afford. I'm starting to think I should have moved out and just rented and enjoyed my 20s more",
   "created_utc": 1703345069,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kema8f7",
   "message": "I don’t really know what to do with my life. Also I need hug",
   "created_utc": 1703345450,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemai3n",
   "message": "The world (humanity) hasn’t really changed since the feudal times of how civilization is being run and who benefits.",
   "created_utc": 1703345552,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemb0ve",
   "message": "My bf low key treats me horribly. He saved me from my toxic ex before but he has anger issues and doesn’t know how to control it. Therefore he can get mad about the smallest things and unleash it on me, his family, or others/friends (verbally) I really do love him…but my mind is starting to wonder. Is he really worth it? He does treat me better and all..it’s just the anger that needs fixing..",
   "created_utc": 1703345747,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemfkj3",
   "message": "I’m probably completely unlovable. My three past relationships have ended with me being cheated on, I have two failed engagements, and now have more insecurities than confidences.\n\nI feel unwanted, disposable, callow, and depressed. I’ve always put everything into my relationships to try and be the most supportive, loyal, kind, and respectful partner, but all I get is pain.\n\nMy current goal is to die naturally before the depression kills me.",
   "created_utc": 1703347455,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemj0np",
   "message": "This infection.",
   "created_utc": 1703348743,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemk4ie",
   "message": "Lonely as hell and I’m tired of being alone",
   "created_utc": 1703349169,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemo3zw",
   "message": "These little COVID eff-bombs taking up residence in my chest. Now I'm isolated and quarantined for the holidays with a wracking cough and pounding headache/body aches. I hate this virus. Jerk.",
   "created_utc": 1703350674,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemp2il",
   "message": "I'm trying to find my person out there. It's...not been a great year, just kind of one shitty thing stacked on top of another, and I am trying so hard to keep my shit together. I feel alone and lost, and I really just wish I had someone to hold hands with, ya know? Nothing crazy, just like...that or a hug. Trying to be social and put myself out there while my world has just been slowly crumbling away at my feet is extremely taxing, and I'm not doing great. I miss the small shit from being in a relationship. Never realized how little I actually talk to people until I went from having someone to talk to every day, to now they're gone and I'm just kind of...alone.",
   "created_utc": 1703351025,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemp4s7",
   "message": "All i need is a good friend...  \nWill start with a good internet friend.....\n\ni am 18, so if anyone want to be my friend........",
   "created_utc": 1703351049,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kempw2o",
   "message": "My husband cheated ..n i decided to give him a second chance ....but I feel so sad that I feel unsafe with one person who shld hv been my safe space",
   "created_utc": 1703351335,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kempzen",
   "message": "Im stuck inside a tiny apartment in a dangerous ass area.  The longer I stay here, the more depressed I feel",
   "created_utc": 1703351369,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemujhi",
   "message": "I am tired of not having anything to look forward to. I’m 52, kids are grown and in their own, I’m single and not dating. I have a good job and work from home, but I no longer get much sense of accomplishment from my work. I do t dislike my work per se, but I also have a low-level sense of dread when I have to log on every morning. \n\nI have a couple of hobbies I guess, but most times I don’t have the mental or emotional energy to engage in them. \n\nThe next ‘big’ thing I have to look forward to is retirement, I guess, which is 15 years away. I can’t really change careers at this point, in part because my employer is one of the few (in the US) that still offers a pension + 401(k)…so if I want to have anything approaching a decent living in retirement I’m kind of locked in here. \n\nI’m just existing.",
   "created_utc": 1703353083,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemvkkd",
   "message": "I’m so lonely, I want a romantic relationship, but I’m not a good looking person and I can’t afford makeup to hide my flaws. I want to know what it feels like to be in love.",
   "created_utc": 1703353464,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemyihe",
   "message": "On Reddit?   People need to know not all republicans are racist assholes.  Not all religious people are brainwashed.   Not every single cop is bad.",
   "created_utc": 1703354603,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemzf9r",
   "message": "I’m coming to terms with being alone again for the first time in 6 years and it’s scaring the shit out of me.",
   "created_utc": 1703354959,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kemzia1",
   "message": "When my ex and I broke up, I not only lost the love of my life but my best friend too. I’d do anything to go back in time and not have a romantic relationship if that meant I didn’t lose him all together.",
   "created_utc": 1703354992,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "ken1p9p",
   "message": "I really miss them.",
   "created_utc": 1703355860,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "ken2o45",
   "message": "I've felt lonely as hell since after covid lockdowns 2020. Recently that loneliness minifestet into depression and dumb thoughts. Luckily not done anything stupid yet and hopefully never will.",
   "created_utc": 1703356243,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kendqep",
   "message": "I've had an addiction for a little while now. Not saying what it is, because I feel that bad about it.",
   "created_utc": 1703360677,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kene7ey",
   "message": "I'm so lonely and can't stop thinking about it every day",
   "created_utc": 1703360872,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kenf45w",
   "message": "im such a selfish person",
   "created_utc": 1703361247,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "keninjj",
   "message": "I get so tired. \n\nMy life has felt like a bare-knuckle boxing match from birth, and I feel like post-40, I just can’t deal with it anymore. Romance is checkered, career non-existent. But for my two teenage kids, no family. \n\nI have friends and my kids I see once a month, and that’s it. I don’t think I’ve ever had any dreams, and it’s long since I’ve had any hope.",
   "created_utc": 1703362736,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kenjvfb",
   "message": "I’m financially struggling and I’m not sure if it’s going to get better",
   "created_utc": 1703363254,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kenkpie",
   "message": "No matter how much I apply, I can’t land an interview let alone a job.",
   "created_utc": 1703363608,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kenkrf5",
   "message": "Everyone around me is falling in love and getting married to someone who is crazy about them. I really wish I could meet my person and have my best friend go on shared adventures with me and love the crap out of me.",
   "created_utc": 1703363631,
   "score": 2,
   "submission_id": "18p1kz2"
  },
  {
   "comment_id": "kelk1ju",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18p1kz2"
  }
 ]
}