{
 "submission_id": "18p26sm",
 "title": "Whenever you get angry, do you have any way to control it?",
 "selftext": "",
 "created_utc": 1703324019,
 "permalink": "/r/AskReddit/comments/18p26sm/whenever_you_get_angry_do_you_have_any_way_to/",
 "score": 37,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p26sm/whenever_you_get_angry_do_you_have_any_way_to/",
 "comments": [
  {
   "comment_id": "kel7fm2",
   "message": "Close my eyes, take a deep breath. Remind myself that it's not worth it.",
   "created_utc": 1703327009,
   "score": 12,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kel6kky",
   "message": "Yes. Step back take a couple deep breaths and tell myself it isn’t worth being pissed off. Especially if the event that pissed you off is minuscule or already over. \n\nExample. Wreck your car. The car is fucked whether you’re mad or not. It’s easier to deal with while you’re calm so there is no sense in being pissed off. It’s not going to unwreck your car.",
   "created_utc": 1703326487,
   "score": 8,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kel3l6b",
   "message": "I punch my pillow really hard or cry alot at the restroom to make myself cool down..",
   "created_utc": 1703324678,
   "score": 4,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kel808f",
   "message": "Sadly, no. \n\nI often break things. Then have regret in breaking them. And for someone in poverty? With no money? This is very bad",
   "created_utc": 1703327347,
   "score": 3,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelbni5",
   "message": "I usually just try to relax. If it's an email from work I would write it out, lock my PC, get up, grab some tea or water, come back and delete it after making myself laugh. If it's a person to person interaction I would just say \"okay, alright\". Obviously depending on the context of why and when you are getting angry. It's important that you are in control of your emotions etc, don't say anything when you are angry, it makes you say mean things that you can't fix later on",
   "created_utc": 1703329562,
   "score": 2,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kel7d9f",
   "message": "Anger is healthy, suppressing it is NOT healthy. Sadly we are all taught to suppress anger instead of deal with it in a productive way. It can be channeled and used for growing, but it's not always easy to find out how, and certainly would need some more serious support/coaching especially at the beginning, when learning how to...",
   "created_utc": 1703326969,
   "score": 2,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kele9rb",
   "message": "Yep. That's called self-control.",
   "created_utc": 1703331078,
   "score": 0,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kel3hse",
   "message": "Just observe your thoughts and think that getting angry isn’t worth it or just take some time by yourself",
   "created_utc": 1703324619,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kel9hsh",
   "message": "I usually just take a shower and relax, although I usually will hit the wall a little at the start in residual rage",
   "created_utc": 1703328254,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelalzu",
   "message": "I'm not sure I've gotten angry this year.",
   "created_utc": 1703328931,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelb6iv",
   "message": "my subconscious reaction since childhood has been to shut down and not speak any more than absolutely necessary. i guess growing up in a house that (sometimes quite literally) smacked you down for being emotional does that to you",
   "created_utc": 1703329264,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "keld8r3",
   "message": "I pop. \u0026amp; rage at people . Then feel the guilt .",
   "created_utc": 1703330500,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kele4bd",
   "message": "I'm getting better at stopping and thinking before l explode. I've also taken the time to look for patterns and why I'm feeling that way. I've noticed that a lot of my anger actually comes from fear, so I'm trying to remove myself from situations that cause overstimulation or panic.",
   "created_utc": 1703330994,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kell2j3",
   "message": "Anger is a secondary emotion. It doesn't exist in a vacuum. The first key to controlling your anger is understanding the *source* of your anger. You have to be willing to analyze each source, and there are usually multiple, and ask yourself if you're in the right. Sometimes, it's absolutely okay, valid, and worthwhile to be angry, especially if you use the anger as energy to fix problems. Sometimes, it's not justified, and you have to move forward anyway. Either way, taking your anger out on people who don't deserve it is never acceptable. Collateral damage is just a way to push your own feelings on someone else who doesn't deserve it.\n\nThe second key is understanding that anger is like pressure: it builds up over time. Little tiny bits of anger all bundle themselves together until the pressure is too much to handle, and their container (your self control) breaks. Funding a way to release the pressure through non destructive means will help you manage and control even the fiercest temper. Breathing, counting, meditation, music... everyone has their own way to handle it, but you have to practice when you are calm. If you practice when you are calm, you'll know what to do when you're overwhelmed.\n\nSource: a martial artist who has been through a lot of therapy.",
   "created_utc": 1703334799,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelll0h",
   "message": "I try to be really quiet. Or I write it out.",
   "created_utc": 1703335066,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelmqyo",
   "message": "Chant, 'Om Mami Padme Hum'. Works really well for me when I'm angry or about to bear pain/fear.",
   "created_utc": 1703335652,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelmyah",
   "message": "Breathing is everything",
   "created_utc": 1703335757,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelogn1",
   "message": "I picture the person that annoyed me at their funeral. It makes me smile and I get less angry.",
   "created_utc": 1703336489,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelppi2",
   "message": "/clutchhhead",
   "created_utc": 1703337088,
   "score": 1,
   "submission_id": "18p26sm"
  },
  {
   "comment_id": "kelpv9a",
   "message": "I take it out on stray cats in a dark alley later that night. Nobody gives a shit, you can just strangle a couple of those for kicks. That usually calms me down for a couple of days.",
   "created_utc": 1703337157,
   "score": 1,
   "submission_id": "18p26sm"
  }
 ]
}