{
 "submission_id": "18p5qdh",
 "title": "Which college degrees will automation render worthless?",
 "selftext": "",
 "created_utc": 1703338248,
 "permalink": "/r/AskReddit/comments/18p5qdh/which_college_degrees_will_automation_render/",
 "score": 33,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p5qdh/which_college_degrees_will_automation_render/",
 "comments": [
  {
   "comment_id": "kelzoc5",
   "message": "Nothing is worthless if you gain transferrable skills. Some things are just more immediately obvious in the way that those skills transfer.",
   "created_utc": 1703341387,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelspgi",
   "message": "I’ll give my hot take: college degrees are about proving you’re capable of sticking to something and knowledgeable in a field\n\nLots of careers are going to be destroyed by automation but most of these are not specific to a college degree (like manufacturing). Your college degree remains more powerful than someone without one on the grounds you did 4 years studying something and likely have a range of personal/academic experiences that college provides",
   "created_utc": 1703338450,
   "score": 58,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keluwm4",
   "message": "Not as many as you think.\n\nA lot of *technical* things will get replaced, but quite frankly most jobs are less about that and more about judgement calls, prioritization, etc. \n\nAnd AI is still pretty rough and I don't think it's going to improve as quickly as people think. Outputs still need to be vetted.\n\nEdit: Also, a lot of jobs have *already* been reduced simply by computers over the past few decades. Making up some numbers, payroll jobs in a big company went from (say) 500 down to 50 as the personal computer was introduced; AI *might* reduce that to 40-45. The automation has already been implemented. The sorts of jobs that AI can help with are the ones that *already* went through automation. \n\nThere are a few industries where AI will have an outsized impact, and those happen to be media and tech--the ones who are writing the most about AI. For most people, it will make very little difference.\n\nIt's also telling that many tech companies that laid people off due to \"AI\" have, in fact, re-hired many of them because whoops it turns out everything still needs curated, and the best people who know how to do that are the ones you just let go.",
   "created_utc": 1703339410,
   "score": 41,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keluae0",
   "message": "Automation may impact certain routine-based degrees, but adaptability and interdisciplinary skills will remain crucial for future success across various fields.",
   "created_utc": 1703339146,
   "score": 125,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kem2a56",
   "message": "When the printing press was developed lots of scribes lost their jobs, but people who could read were super valuable to the burgeoning book publication industry.\n\nThe industrial revolution rendered blacksmith almost worthless, but advanced knowledge of metallurgy was still very valuable to the folks designing and building machines.\n\nThe pc revolution did away with traditional drafters, but an architecture education is still valuable for building modelling.\n\nThe ai revolution will be the same. Education in any topic is never useless.",
   "created_utc": 1703342430,
   "score": 152,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelzlju",
   "message": "I studied philosophy and you can’t rendee something useless if it already is",
   "created_utc": 1703341356,
   "score": 91,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelulsv",
   "message": "Here's a website with automation probabilities for various jobs.\n\n[https://willrobotstakemyjob.com/rankings/highest-risk-jobs](https://willrobotstakemyjob.com/rankings/highest-risk-jobs)\n\nThat doesn't mean every job that is at high risk is actually going to get automated, but a high-ranking job is easier to automate.",
   "created_utc": 1703339280,
   "score": 68,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemg8jj",
   "message": "These questions are worthless without a timescale. In the next 5 years? Nothing. In the next 100 years? Everything.",
   "created_utc": 1703347700,
   "score": 46,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelxsh3",
   "message": "Someone will always need to oil the robots.",
   "created_utc": 1703340611,
   "score": 33,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kem9ruw",
   "message": "It’s not a degree per se but EMT-P. I don’t see how robots will ever take over emergency first aid.",
   "created_utc": 1703345275,
   "score": 6,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemp07v",
   "message": "I know a bunch of people that went to the military for coding that never actually learned it and they are just using chat GPT to do all their work meanwhile I'm just sitting over here with an IT bachelor's and I can't get a job and I code for fun.",
   "created_utc": 1703351003,
   "score": 16,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kem0r89",
   "message": "People who go to college to then do simply office stuff. Like bookkeeping and shit. Automation will take over more and more in repetitive office tasks. So if you are someone where 90% of your work consists of those tasks. You are in the danger zone.\n\nThose people will still be needed. Just maybe not as many.",
   "created_utc": 1703341820,
   "score": 20,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemq8x1",
   "message": "I think I am the last “draftsmen”.\n\nArchitects and engineers used to hire blueprint draftsmen who just focus on drawing all of the plans. In the 80’s it became all on computer with AutoCAD but still needed several CAD people/specialists.\n\nNow they have Building Information Modeling, which is what I do. I just build the project in 3D space and the program (Revit) automatically makes a lot of the blueprints for me. I just clean them up.\n\nComputational Design is coming, basically AI will listen to the board meeting of the client and the architects/engineers and automatically create models and plans. \n\nThere used to be large buildings full of draftsmen for projects being hand drawn. Then there was 5-10 CAD people. Now there’s 1-3 BIM people. Soon there will be 1 Comp Design guy.",
   "created_utc": 1703351468,
   "score": 9,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelxr8c",
   "message": "Rather than thinking about college degrees that will be rendered \"worthless\", consider a college degree that's been much maligned but likely to make a return due to AI!\n\nPhilosophy! \n\nThe original college degree gets a lot of flack for not being commercially viable. But philosophy is at the end of the day is about being human and engaging with the systems humans build. I think philosophy will return to prominence going forward and not just because of AI!",
   "created_utc": 1703340598,
   "score": 33,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kenexss",
   "message": "It's not the degrees, it's the *jobs*.  A job that can be automated is one that doesn't require a lot of decision making or original thought.  Look at how accountants were impacted by VisiCalc.  It didn't make an accounting degree worthless, it just meant needing a lot fewer of them.\n\nJobs that don't require any degree are the ones to worry about most.",
   "created_utc": 1703361174,
   "score": 4,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keo8zsv",
   "message": "can't make a lib arts degree more useless, checkmate skynet",
   "created_utc": 1703373924,
   "score": 4,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelsqsh",
   "message": "None. There may be fewer positions but they will not be worthless. Automation mostly takes the less talented positions.",
   "created_utc": 1703338465,
   "score": 28,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemjlaf",
   "message": "None because automation is a tool. That's like saying a hammer renders carpentry obsolete.",
   "created_utc": 1703348964,
   "score": 18,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "ken5x9a",
   "message": "The more mundane your job is, the more likely it will become automated. \n\nThe smaller the amount of tasks that you do at your workplace under your position, the more likely that position will become automated. I.e. data entry. \n\nThe more physical your activity and the fuller the range of motion, the less likely your position will be automated. \n\nAlso the higher the education level for the simpler task, the more likely your position is to be automated. For example, a paralegal. \n\nAnother thing to note, currently no AI model has the ability to work independently, so I believe that most businesses will do less replacement and more of an expectation of increased productivity.",
   "created_utc": 1703357536,
   "score": 5,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelv1u8",
   "message": "Even hotter take than the “hot takes” I’m seeing so far: a degree wouldn’t be “worth” or “worthless” if universities wasn’t an inherently ultra capitalist, unbelievably expensive money grab scheme in countries with non-socialized higher education. Automation wouldn’t be an issue of replacing labor for easy profit either, but would rather be accompanying existing labor for better working conditions.",
   "created_utc": 1703339471,
   "score": 20,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemwftu",
   "message": "The most important thing I learned at university was how to do research. That’s  not going to change.",
   "created_utc": 1703353793,
   "score": 5,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "ken4ocz",
   "message": "A lot of jobs that people with college degrees have will go away, but those people will still be able to get jobs.\n\nAcademic credentials aren't like machines, they don't really become 'obsolete'. Even if you studied something totally worthless, there are still jobs that just require people who can communicate, conduct research, and compile their findings. Lots of people with BAs don't wind up getting jobs that directly correlate with their degree.",
   "created_utc": 1703357039,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "ken50ef",
   "message": "Accounting, graphics design, most low level creative jobs",
   "created_utc": 1703357169,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keniyqm",
   "message": "Clown college. Robotic clowns are the future. (This is a joke btw).",
   "created_utc": 1703362868,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kenoncl",
   "message": "We don't know how far AI and robotics will advance in future decades, but it's not unreasonable to suggest that they will replace a lot of human labour if/when it becomes profitable to do so.",
   "created_utc": 1703365278,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keo3f59",
   "message": "Pretty much all of them eventually.",
   "created_utc": 1703371496,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keogdcu",
   "message": "Eventually all of them. The first ones to get taken out with the new wave of automation are intellectual rather than physical.\n\nOf course people will say, \"Machines can't do X, only a human can do X,\" which is something people have been saying ever since the first machine proved that machines can do X. It's a coping mechanism to deny what's happening until they've lost their job to a machine that they thought could never do their job.",
   "created_utc": 1703377235,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keojv1f",
   "message": "It’s the HS diploma holders and GED recipients who will need to worry most about automation and that’s 2/3rd of American adults over 25.",
   "created_utc": 1703378815,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "keotgxc",
   "message": "Eventually, in a long enough time? All of them. Eventually, once you include physical robotics, you can even have automation building and fixing the automation. I don't think there are jobs that exist that couldn't potentially one day be done by some sort of automation. Hopefully this will lead to a post scarcity society, but who knows.",
   "created_utc": 1703383217,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelsmy1",
   "message": "graphic design",
   "created_utc": 1703338420,
   "score": 7,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kencpdp",
   "message": "Most of them. Few degrees will not at least be altered by AI. The education world really isn’t prepared for this.",
   "created_utc": 1703360256,
   "score": 3,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemd13n",
   "message": "Sorry for the spelling\n\n\n\nEvery degree is great to have because it will show to people that you did some time doing something for a few years. It show that you are someone who could work real life tasks or if you dont know how to do it you will learn them. Basically the think how Stallone said in that show. Its true. Finishing it doesent mean that you know how to do it, but it shows that you are ready for challenges.",
   "created_utc": 1703346501,
   "score": 3,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemn0uj",
   "message": "Teaching. The ability for AI to provide perfectly individualized instruction to each student will be much more valuable than one person who often doesnt really want to be there reciting slides to a bunch of kids for 35 minutes.",
   "created_utc": 1703350264,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kenbhfr",
   "message": "You're not going to lose your job to AI.  You're going to lose your job to someone who knows how to utilize AI to increase productivity.",
   "created_utc": 1703359771,
   "score": 4,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kendg9x",
   "message": "Pharmacists. Now pharmacists are almost never compounding medications, they're just pulling pills off a shelf. It's only a matter of time before the job becomes outdated",
   "created_utc": 1703360562,
   "score": 4,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kenivy4",
   "message": "College degrees are already worthless for most professions.",
   "created_utc": 1703362836,
   "score": 3,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelt58w",
   "message": "Most degrees are already worthless. People don't come from most degrees with actionable skills. \n\nThe only degrees that are still worth it are the ones that are required to do a specific job. The number of those will decrease.",
   "created_utc": 1703338645,
   "score": 1,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kem95nz",
   "message": "As an automation engineer..I rendered many jobs useless.\nBut it's worth it. For the operators mental state.",
   "created_utc": 1703345042,
   "score": 3,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelt9g1",
   "message": "Hospitality management, and culinary degrees aren’t looked at very well either. 90% of the time they’ll take the person with job experience over the person with a degree.",
   "created_utc": 1703338696,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kelz3vb",
   "message": "Not many, the jobs that are lost by automation are going to be factory and manufacturing like in the last century. Lots of really basic jobs too like grocery stores\n\nHigher ed has problems but it’s still the best way to invest in yourself. Sure you’ll pay but 120,000 to make 5mil over your career is an amazing return.",
   "created_utc": 1703341157,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemg5nu",
   "message": "It is not specific degrees that are becoming useless, but mediocre workers in almost all fields.\n\nThese are people who cannot work independently or whose work is often flawed and needs to be corrected by others.",
   "created_utc": 1703347670,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemrji4",
   "message": "Photography- specifically in the realm of marketing\n\nI can simply create whatever picture composite I want from scratch without a photographer, , or travel, I have a low level admin supply one cell phone picture and tell AI what background I want and viola....",
   "created_utc": 1703351961,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemxz87",
   "message": "It's hard to say for now but the simple answer is a lot more than we would anticipate. Maybe the health field is the only sector that's going to be less affected",
   "created_utc": 1703354396,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemy18b",
   "message": "Accounting",
   "created_utc": 1703354416,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "ken1d40",
   "message": "None but maybe an MBA.  I work in Data and recently have had many meeting with my C-Suite and when talking about limitations and the data we have for these projects and brainstorm what we can do.  I honestly believe it automate the highest rungs of the ladder before the bottom.  And even that isn’t today but it is in my lifetime.",
   "created_utc": 1703355726,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "ken1kic",
   "message": "Accounting",
   "created_utc": 1703355807,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "ken2oo9",
   "message": "My SIL got an associates degree in medical coding.\n\nWhile she was working on it, we told her.. you know, your job is literally being automated out from under you.. what do we know..\n\nShe got a job and worked for 6 months before she got laid off and the company folded.\n\nLiterally, the day after she got laid off, she got her first tuition loan bill..\n\nShe now works unloading trucks in a warehouse, loathing her every working moment..",
   "created_utc": 1703356249,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kengh0t",
   "message": "Retail Pharmacists",
   "created_utc": 1703361813,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kem6ub2",
   "message": "Degrees, or jobs? Entirely different questions.",
   "created_utc": 1703344157,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kem74wc",
   "message": "Not so much college degrees but skills, whether or not it requires a degree. \n\nProgramming. Won't disappear but will not need nearly as many people. \n\nAdvertising and related activity. Will be much cheaper to just use AI to pump out ads. You'll only need one person doing that, rather than 100 coming up with stuff on their own.\n\nHopefully, creative arts will stay clear of AI, but I'm not confident it will.  There will be need for elevator music, for example, which may be just done by AI for far less time and expense. Artwork for hotels and other spaces that are, well, public but not intended as a public display of art, if that makes sense. \n\nPerhaps there will be a way to distinguish between AI created art and human made art, and the value of the latter will increase. And, just maybe, an increase in the volume of art overall will help everyone appreciate it.",
   "created_utc": 1703344269,
   "score": 1,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemelee",
   "message": "What happened when the Industrial Revolution came about? Farmers went to the cities and became factory workers. What happened when calculators and computers became widespread? Mathematicians became math teachers and programmers. Humans will always adapt. In the end, we as individuals can change far more quickly than the technologies and societies we create. So there’s no need to panic imo.",
   "created_utc": 1703347092,
   "score": 3,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemwcl8",
   "message": "Eventually all of them. The thing people are ignoring is why new jobs opened up for people when previous jobs were automated. \n\nWhen a new job is created humans don't just automatically know how to do them. They need to be trained and a workflow needs to be created for them, just like what needs to be done to have a robot do the job. This is true for ever job. In every job a human needs to be taught how to do it. In the past it has been magnitudes quicker to train a human to do each new job, which is why they would get them. That gap is getting smaller though. As soon as we hit the point were robots and machines can learn a new task just as quickly as a human it won't be just some jobs taken over it will be every job. \n\nEven if new jobs are created why would anyone spend the time training a human, who they will need to pay wages and benefits to, and who will eventually leave or die, forcing you to retrain a completely new person. Instead you would go straight to training a machine that you will be able to own forever and that can work throughout the night and never takes holidays.",
   "created_utc": 1703353761,
   "score": 3,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "ken6uo2",
   "message": "Writer, graphic artist, voice actors, etc.",
   "created_utc": 1703357910,
   "score": 2,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemmw3q",
   "message": "A lot of college degrees are already worthless. College is also overrated",
   "created_utc": 1703350215,
   "score": 1,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemt1eq",
   "message": "Accountant\n\nLawyer\n\nStatistical analyst\n\nGraphic design\n\nActor (especially porn)\n\nThere's about a million others. Don't get me wrong there will still be some humans involved but at far less numbers. It will be more about guiding the AI as it does the work.",
   "created_utc": 1703352517,
   "score": 1,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kencg3g",
   "message": "Writers and graphic artists are gonna be fine.\n\nAI is terrible at those things and people are already repulsed by it.",
   "created_utc": 1703360152,
   "score": 1,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kenjpsd",
   "message": "late to the party but entry-level art and design. Creating corporate content, emails, banners, flyers, etc. will all be done with gen AI. Why am I paying someone to format a webpage with css if I an just ask chat gpt. why am I paying someone to design an email when I can just use AI and ab test",
   "created_utc": 1703363187,
   "score": 1,
   "submission_id": "18p5qdh"
  },
  {
   "comment_id": "kemwqa2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18p5qdh"
  }
 ]
}