{
 "submission_id": "18p6a9z",
 "title": "What should be taught in US public schools that is not taught currently?",
 "selftext": "",
 "created_utc": 1703340061,
 "permalink": "/r/AskReddit/comments/18p6a9z/what_should_be_taught_in_us_public_schools_that/",
 "score": 237,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p6a9z/what_should_be_taught_in_us_public_schools_that/",
 "comments": [
  {
   "comment_id": "kem6mxn",
   "message": "*checks US literacy rates and math scores*\n\nHow about we do basic reading, writing, and arithmetic before taxes (which reading and math handle anyway)?",
   "created_utc": 1703344083,
   "score": 25,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemakqr",
   "message": "How to read, write a coherent sentence, think critically for oneself, and use logic to solve problems.  \n\nAnd I’m not kidding.  It’s really sad what the system turns out. Illiterate kids who have no basic skills and no way to think for themselves.",
   "created_utc": 1703345580,
   "score": 128,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemdv65",
   "message": "Media literacy, which also dovetails with critical thinking skills. \n\nAs others have mentioned, financial literacy - budgeting, loans/credit cards \u0026amp; how interest on those is calculated; retirement planning/saving.",
   "created_utc": 1703346819,
   "score": 114,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem3ud9",
   "message": "Home ec/skills needs to be required. There are just too many adults that don't know how to do basic adult skills: cooking, cleaning, basic repairs, child care. It does not take a *specific* set of genitals to master *any* of the above either. By 18 yrs, you should be able to clean a house and make a basic meal  of a nain course, a starch(rice, pasta, potatoes/yams or bread) and a vegetable on your own!",
   "created_utc": 1703343026,
   "score": 73,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem01kd",
   "message": "Adequate sex ed. It’s still abstinence only in half the country.",
   "created_utc": 1703341533,
   "score": 120,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem8hbr",
   "message": "I know that school curriculum  varies a lot between states and even neighboring school districts, but y’all are commenting a lot about basic graduation requirements I had to go through in high school . \n\nDid no one have to go through an economics/civics class to learn things about taxes, finances, career planning, resumes/ job interviewing etc. Or some basic home-ec classes that taught things like cooking, cleaning, sewing, basic home improvement type things?",
   "created_utc": 1703344783,
   "score": 119,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemd5m2",
   "message": "[removed]",
   "created_utc": 1703346550,
   "score": 105,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kely4ps",
   "message": "financial literacy",
   "created_utc": 1703340747,
   "score": 36,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem5d5s",
   "message": "Not sure where yall went to school, but we were taught all of the stuff you're listing.\n\nSex ed started in 5th grade, DARE all throughout elementary, so we knew about drugs, high school health covered all the other bits about being human. Home ec taught us how to cook and sew and basic domestic functions. Regular economics class taught us that capitalism is a scam and unless you were born rich, knowing how to balance a budget isn't going to save you from the grind. We even had a class dedicated to just driving and road safety.\n\nBelieve it or not, math, English, history, geology; they are taught for all 13 years of a US public education.\n\nThe only thing I can think of that wasn't covered is how to pay attention...",
   "created_utc": 1703343598,
   "score": 155,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemaq0o",
   "message": "how to handle conflict, how to gently say no, how to communicate. Some people really don't get social skills or role models, and that's a real hindrance\n\n\nEdit: spelling",
   "created_utc": 1703345636,
   "score": 47,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem1l5a",
   "message": "Civics",
   "created_utc": 1703342167,
   "score": 130,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "ken5qsy",
   "message": "Can we provide a course on how to protect yourself from scammers, crooks, and other clowns as well as how to do ACTUAL research on a topic to get more information instead of reading random S\u0026amp;!# on the internet and assuming it's accurate? The amount of misinformation being pumped across everybody's phones, computers, and tablets is scary!",
   "created_utc": 1703357463,
   "score": 11,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "ken6xpk",
   "message": "Elementary teacher here.\n\nMedia literacy.\n\nIt's not just enough to read. To function in today's world, students need to be able to evaluate where a source is from, it's potential credibility, and what the organization who published it may want from the reader. With the continued advancement of AI, this is going to become all the more important and challenging, and the implications for these people who are going to become voting citizens is scary.\n\nScience education is also leagues behind what the research says is best practice. It doesn't really matter if you exit the school system knowing how photosynthesis works. It does matter that they know how to have an idea, test it, BE WRONG, and try again. We have a huge need for people to enter the sciences and very little genuine science happening in classrooms.",
   "created_utc": 1703357944,
   "score": 11,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem89yu",
   "message": "Looking at my country I'd say logic. The smallest amount needed to quickly understand by heart when some statement are built over nothing or when some maths doesn't make sense",
   "created_utc": 1703344705,
   "score": 8,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kembx6g",
   "message": "This thread is full of things that shouldn't be taught by schools. Teachers are now tasked with teaching things like morality \u0026amp; worldview, to the detriment of teaching things like reading and math. The more we expect schools to cover, in place of parents/families/communities doing their duty, the less effective they will be at teaching any of it.",
   "created_utc": 1703346079,
   "score": 63,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemikar",
   "message": "Do they still teach typing? My zillenial friends/coworkers were amazed by house fast I typed and wish they were as quick, I asked didn’t you do Mavis Beacon Teaches Typing? And they looked at me blankly. I only graduated hs 13 years ago!!!! But apparently computer classes don’t really teach it, if they take a computer class at all",
   "created_utc": 1703348576,
   "score": 7,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemuwcm",
   "message": "Critical thinking, especially as it pertains to online information and political statements",
   "created_utc": 1703353214,
   "score": 7,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "ken5mkw",
   "message": "Civics. Kids have no clue how the government works.",
   "created_utc": 1703357416,
   "score": 6,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "ken5vqi",
   "message": "Sandra Day O'Connor lobbied to have Civics mandatory in all public schools.",
   "created_utc": 1703357519,
   "score": 6,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kenk4sh",
   "message": "Budgeting. Cooking. Time management. Factual history. Actual sex education.",
   "created_utc": 1703363367,
   "score": 6,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemdh8i",
   "message": "Civics and political science and political philosophy I would love to stop dealing with people who have no clue how our political system works, no idea on what’s actually in the constitution, and even worse just seem apathetic to it.",
   "created_utc": 1703346672,
   "score": 12,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kengv0i",
   "message": "How to properly debate and knowing what logical fallacies are. I’m starting to see younger people be essentially proud of blocking people on social media as soon as they disagree with them. If people can’t handle opposition to their argument, compromise and working together with people with different ideals is over.",
   "created_utc": 1703361976,
   "score": 5,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kelxxt5",
   "message": "[removed]",
   "created_utc": 1703340670,
   "score": 36,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem74ci",
   "message": "It doesn’t matter if the kids aren’t paying attention because they’re looking at their phones and their parents yell at the staff whenever the kid gets disciplined.",
   "created_utc": 1703344263,
   "score": 10,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem1k5f",
   "message": "Trades.",
   "created_utc": 1703342155,
   "score": 32,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kelwm22",
   "message": "Japanese internment is treated as a side note in American WWII politics but if it happened in any other country it would be considered a crime against humanity",
   "created_utc": 1703340129,
   "score": 92,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemjujx",
   "message": "My entire knowledge of WW1 from school was that Franz Ferdinand got shot and it was a powder keg of tensions already.  That's all.  Multiple grades never went beyond the term powder keg.  I don't even know what a powder keg is.  I gather it's some sort of old bomb or something based on context clues but the entire school system just skipped over a massive, world changing war.",
   "created_utc": 1703349064,
   "score": 3,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemrsfh",
   "message": "Any U.S. history that extends beyond the 1960s.",
   "created_utc": 1703352054,
   "score": 5,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemwsw6",
   "message": "How to tell when a piece of media, anything from a statement or product packaging to an entire book series or organization, is lying, what it's trying to make you think or feel, and *why* it's pushing that particular line.",
   "created_utc": 1703353932,
   "score": 4,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "keni48f",
   "message": "Real home economics, like budgeting, taxes, insurance, etc. \n\n\nWhen I was growing up we had ‘home economics’ classes that consisted mainly of worthless crafting projects and baking cookies.",
   "created_utc": 1703362510,
   "score": 4,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "keo3w2m",
   "message": "Critical Thinking/Philosophy 101",
   "created_utc": 1703371695,
   "score": 4,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kep5rbx",
   "message": "Adequate sex ed. It’s still abstinence only in half the country.",
   "created_utc": 1703389092,
   "score": 4,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kep8e0f",
   "message": "ASL, basic taxes, and sex education! I'm from an abstinence only state and it's not effective.",
   "created_utc": 1703390410,
   "score": 4,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kep9v5n",
   "message": "Financial literacy",
   "created_utc": 1703391169,
   "score": 5,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kelxmuf",
   "message": "Social etiquette.\nNo, it's not OK to yell at a cashier because you can not get the item you want.",
   "created_utc": 1703340551,
   "score": 31,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemxfhd",
   "message": "Get the politicians out of education and let seasoned educators guide education. Not principals and other admins.\n\nTeachers with 20+ years of experience in successful districts as well as ones from struggling districts. \n\nIt's not a matter of what should be taught. \n\nIt's what students need to succeed.  Kids don't need to be pushed from one grade to the next to keep the numbers good. \n\nThey need food. Sleep. A stable home life. Support for when stuff isn't good at home. They need smaller classroom sizes and materials.\n\nYou want better students? Start at the beginning. \n\n- free daycare\n\n- free breakfast and lunch\n\n- well paid teachers\n\n- well paid support staff\n\n- more counselors\n\n- stop tying funding to \"success\" of a school and cutting funding for a poor school\n\n- if a teacher is bad, a decent principal can and should identify it easily. Hold them accountable. \n\nThis should come from corporate taxes and the absurd wealth.  If a billionaire can lose tens of billions and still be one of the richest on earth, that's too much money. \n\n\nThe reason \"good\" school districts succeed is the teachers are paid, parents can afford tutors, lessons, and materials. Kids aren't struggling to eat or get sleep. \n\n/rant over.",
   "created_utc": 1703354181,
   "score": 17,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemfz6i",
   "message": "I'm not sure what this would be classified as, but the ability to recognize deception and general misinformation.  \n\nSpend 10 minutes on Instagram and see hundreds of comments on blatantly staged or fake videos that treat it as reality.  And I'm not just talking about things trying to look real, even skits and joke videos that were never intended to trick anyone.  Things that humans should immediately be able to identify as not real. \n\nAnd the more serious application is political.  Someone can give off every possible red flag of being a total scumbag con artist and their supporters somehow believe them.  I don't understand why some people can't identify such things.",
   "created_utc": 1703347605,
   "score": 8,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "ken0m8s",
   "message": "Critical thinking",
   "created_utc": 1703355430,
   "score": 7,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "ken0bh1",
   "message": "Money management and how to create a budget. That, and how to do your taxes",
   "created_utc": 1703355314,
   "score": 23,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kemd5wh",
   "message": "Sign language",
   "created_utc": 1703346553,
   "score": 18,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "ken5bwd",
   "message": "Critical thinking.",
   "created_utc": 1703357297,
   "score": 5,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kem15gj",
   "message": "How to do taxes\n\nHow credit cards really work\n\nBudgeting\n\nOff the top of my head",
   "created_utc": 1703341987,
   "score": 46,
   "submission_id": "18p6a9z"
  },
  {
   "comment_id": "kenb8k1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18p6a9z"
  }
 ]
}