{
 "submission_id": "18p7n1t",
 "title": "If a nuclear bomb goes off, where are you hiding?",
 "selftext": "",
 "created_utc": 1703344299,
 "permalink": "/r/AskReddit/comments/18p7n1t/if_a_nuclear_bomb_goes_off_where_are_you_hiding/",
 "score": 101,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p7n1t/if_a_nuclear_bomb_goes_off_where_are_you_hiding/",
 "comments": [
  {
   "comment_id": "kem7kq1",
   "message": "It’s already over depending on the proximity, so I’m just chilling.",
   "created_utc": 1703344432,
   "score": 224,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kema3lh",
   "message": "I'm not hiding.  I'm getting a front row seat for that.  I want to be vaporized in a millisecond",
   "created_utc": 1703345399,
   "score": 161,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemheh6",
   "message": "The gym cuz u need a membership to get in there and most likely the bomb doesn’t have a gym membership sooooo…….",
   "created_utc": 1703348141,
   "score": 226,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemd353",
   "message": "I learned in elementary school that hiding under my desk will protect me from nuclear explosions, so you'll find me there. I'm not sure why Zuck is bothering with a $100 million bomb shelter when he could accomplish the same thing with a few pieces of wood.",
   "created_utc": 1703346522,
   "score": 162,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemfaug",
   "message": "The Winchester.",
   "created_utc": 1703347354,
   "score": 106,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemsqr5",
   "message": "Nah, just going to pour a nice, big drink. \n\nMy sister lives in Hawaii and a few years ago they got a text message from emergency alert system that they were about to be bombed or whatever. There’s literally nowhere to go….they poured a drink, sat on their lanai, and cuddled their dogs. 🤷🏻‍♀️ Made sense to me.",
   "created_utc": 1703352405,
   "score": 25,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem95i8",
   "message": "Im not hiding. \"A millisecond of brilliant light and we're vaporized. Much more fortunate than millions who wander sightless through the smoldering aftermath. We'll be spared the horror of survival.\"",
   "created_utc": 1703345040,
   "score": 198,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemvfdq",
   "message": "If a nuclear bomb goes off without any warning, and you're within the range of the fireball, you wouldn't even have enough time to process what's going on, let alone find a hiding spot, before you're incinerated.\n\nSo the more realistic question would be, if a nuclear bomb goes off and you were luckily far enough away to not be instantly barbecued, where are you hiding from the fallout?\n\nLucky for us, the radioactive fallout from a nuclear bomb has a pretty short half life. You only need to shield yourself from the radioactive dust for about 2 weeks before the radiation decays to relatively safe levels.\n\nIf you're in your car, hopefully you've got enough water in there to survive 2 weeks, because what you'll need to do is close all the windows, stuff the vents to close them off, and hopefully not run out of oxygen in there for the next 2 weeks. Your car almost certainly won't run due to the EMP, so that's about your only choice.\n\nIf you're at home, do the same thing with sealing all the doors and windows. Immediately fill all your bathtubs and sinks and any other containers you can find with water that you'll be using for the next 2 weeks, before your city water gets contaminated. The water in the pipes won't be contaminated yet, but the reservoir water is, so collect as much clean water as you can, while you still can. If you need to let any loved ones into the house who were outside during the blast, strip all their clothes off and leave those outside, immediately wash them thoroughly with soap and water, keep the dirty water and rags/towels you used far away from everyone.\n\nRemember, dust is the big enemy here. Dust is what carries almost all the radiation from the blast, so keep as much outside dust outside as you possibly can.\n\nHopefully you planned for this in advance and you've got potassium iodide tablets everyone can take for the next 2 weeks. A Geiger counter will help you stay away from areas of the house that are unsafe.\n\nGet out some board games, because your electronics are probably all dead, and you're not going anywhere for the next 2 weeks.",
   "created_utc": 1703353409,
   "score": 191,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem8bpw",
   "message": "Behind your mom",
   "created_utc": 1703344725,
   "score": 18,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem99cv",
   "message": "Why would you hide? Just tank the blast like a man and walk away unscathed.",
   "created_utc": 1703345080,
   "score": 247,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemow6f",
   "message": "I'm gonna hide by the bomb. No one would think to look for me there.",
   "created_utc": 1703350962,
   "score": 152,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemu5r9",
   "message": "ITT people who don’t realize how likely they are to survive a nuclear blast. Ground zero is vaporized, but atomic bombs are very survivable if you are a couple miles away as long as you know how to respond. \n\nHiding from the initial blast, iodine tablets, the dust is the longer term deadly part and so wearing a mask and rinsing off or changing when you go indoors to keep contamination away.",
   "created_utc": 1703352943,
   "score": 42,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem8r7b",
   "message": "Depends, am I in the blast radius? If so I’m gonna be outside embracing it. Am I outside the blast radius? I’m sure there will be more so I’m just waiting until I’m near it to embrace it.\n\nNo one wins in nuclear war.",
   "created_utc": 1703344887,
   "score": 82,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemborz",
   "message": "Wherever the cockroaches go. They’ve got it figured out.",
   "created_utc": 1703345993,
   "score": 88,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "ken0j93",
   "message": "So I actually had to deal with this question on the fly.\nI was in Hawaii when we all got the missile incoming alert on our phones. Once I verified that others had gotten the same alert, I then had to think where to hide. First I thought the bathroom? No.. the closet? No.. the hallway? No... I concluded it's an atomic bomb..there's no hiding.. so I got comfy in bed and waited to die.\nWe had been informed the icbm only takes 15 min to get here from North Korea so that's how long we all knew we had to live. In that ppl had to call family to say goodbye.\nI had concluded that unless there's more than one missile I prolly would survive the initial blast as my island prolly wouldn't be a target unlike Oahu.. but my parents were there so I concluded they would die.\nI was worried now about fallout.. and having to survive off what food and water I had... And now having to defend it from my neighbors. \n\nIt was an interesting exercise... Thankfully it was a false alarm\n\nOh I did see video of dads wrenching up drain covers and dropping their children in and replacing the drain cover over them... An interesting strategy. The fathers ran off tho.. not sure where they hid. Id think the blast would still get to the kids thru drainage openings tho.",
   "created_utc": 1703355397,
   "score": 93,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemkbdt",
   "message": "in a Fridge from the 50s of course.",
   "created_utc": 1703349242,
   "score": 87,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem7okf",
   "message": "Under my blanket",
   "created_utc": 1703344473,
   "score": 46,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem89mf",
   "message": "If a nuclear bomb goes off, I’m probably dead, so I’ll probably just go outside and watch.",
   "created_utc": 1703344701,
   "score": 104,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemf59n",
   "message": "If we are dumb enough to use nukes I would rather be incinerated than scratch and claw until a slow death in what is left of our planet.",
   "created_utc": 1703347297,
   "score": 51,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem7heo",
   "message": "Under my desk.",
   "created_utc": 1703344398,
   "score": 28,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemsi7e",
   "message": "Depends on distance.  \nWithin 1KM: Doesn't matter, just hope you do not survive.  \nBetween 1-5KM: Also doesn't matter, but you'll probably survive with serious injuries.  \nBetween 5-10KM: My hallway, quick to get to and no windows. Most injuries at this sort of distance will be mainly from the pressure wave.  \nFurther then 10KM: Shouldn't need to hide unless it's an exceedingly large device or you happen to get unlucky with falling shrapnel. Might also be unlucky and be rendered blind if your looking directly at it.  \n\n\n**DISCLAIMER**  \n/\\\\ This is all learned from the internet and might be complete bogus. Do not trust the words of a random internet stranger, especially me, over anyone who actually know what they are talking about.",
   "created_utc": 1703352318,
   "score": 28,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemfpu9",
   "message": "Mattress firm. They ain't going nowhere",
   "created_utc": 1703347510,
   "score": 12,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemasfg",
   "message": "Look at me I'm glowing.",
   "created_utc": 1703345660,
   "score": 13,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemjqz6",
   "message": "I’m running towards it.",
   "created_utc": 1703349025,
   "score": 13,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kembpj6",
   "message": "I wanna be near the impact site, cannot risk being alive",
   "created_utc": 1703346001,
   "score": 12,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kema1t0",
   "message": "I’m hoping it hits me on the forehead. I’m not trying to be roughing it in a dystopian nuclear fallout scenario. Miss me with all that lmao",
   "created_utc": 1703345380,
   "score": 10,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "keml8n9",
   "message": "In heaven bro",
   "created_utc": 1703349591,
   "score": 10,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemvlkg",
   "message": "Let it take me. I’m not living in the Fallout universe. Fuck that.",
   "created_utc": 1703353474,
   "score": 9,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem9dkn",
   "message": "The Fridge…",
   "created_utc": 1703345127,
   "score": 29,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem7v4o",
   "message": "I'm probably dead if I'm within close range - I'd go and witness the beauty before kicking off.",
   "created_utc": 1703344542,
   "score": 9,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemfxi0",
   "message": "Biggest myth of a nuclear war? \n\nSurvivors are the lucky ones",
   "created_utc": 1703347588,
   "score": 8,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemiafo",
   "message": "Your best plan of action is to try and catch it",
   "created_utc": 1703348474,
   "score": 7,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "ken52ux",
   "message": "Knowing my boss, I'd have to still come into work. And I won't be allowed to hide.",
   "created_utc": 1703357196,
   "score": 7,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem94yw",
   "message": "Nowhere because what's the point",
   "created_utc": 1703345034,
   "score": 24,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemc9rq",
   "message": "If i'm at ground zero I'm going outside to watch it fall and detonate. Something bout staring death in its eyes and not being scared is oddly poetic.",
   "created_utc": 1703346213,
   "score": 12,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemsgpz",
   "message": "I’m running to wingstop and having all the lemon pepper wings…fuck the diet",
   "created_utc": 1703352302,
   "score": 6,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemzgq8",
   "message": "[Depends on where and how big.](https://nuclearsecrecy.com/nukemap/)",
   "created_utc": 1703354975,
   "score": 5,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemlwiq",
   "message": "My boss needs me to work that day so I ’ll be at work working, probably.",
   "created_utc": 1703349843,
   "score": 15,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemafjl",
   "message": "Scarlett Johanson's bedroom.",
   "created_utc": 1703345526,
   "score": 22,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem7gk0",
   "message": "In my bathroom.",
   "created_utc": 1703344390,
   "score": 5,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kem98nw",
   "message": "GonNa die anyways …so um 😁Might try drive a car ….idk how to drive",
   "created_utc": 1703345072,
   "score": 6,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemezo7",
   "message": "I live within the hazard radius of a nearby nuclear plant, which would be the likely target of any nuke were fired at my region.\n\nNot really anywhere safe to hide from a nuclear blast if it hits closer to home, but I *do* have potassium iodide tablets for the family to help fend off radiation sickness for a couple days on the road while we get the fuck out of the radiation zone if that plant is targeted.",
   "created_utc": 1703347239,
   "score": 5,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemg186",
   "message": "I live close to a major target. There is no hiding.",
   "created_utc": 1703347626,
   "score": 6,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemj5hn",
   "message": "fuck hiding - me, my dog and my cat are going at it head on",
   "created_utc": 1703348796,
   "score": 5,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemrmhx",
   "message": "In the strip club eating lasagna and enjoying the last few seconds we have left.",
   "created_utc": 1703351995,
   "score": 6,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemgj9f",
   "message": "I'll be hiding in the pile of dust that I will become when the heat/shockwave hits. You'll never find me.",
   "created_utc": 1703347811,
   "score": 3,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "kemy0ii",
   "message": "How about a nice game of chess.",
   "created_utc": 1703354409,
   "score": 4,
   "submission_id": "18p7n1t"
  },
  {
   "comment_id": "ken53wh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18p7n1t"
  }
 ]
}