{
 "submission_id": "18p9clq",
 "title": "What's a moment where you surprised yourself with some deep self discovery?",
 "selftext": "",
 "created_utc": 1703349192,
 "permalink": "/r/AskReddit/comments/18p9clq/whats_a_moment_where_you_surprised_yourself_with/",
 "score": 60,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p9clq/whats_a_moment_where_you_surprised_yourself_with/",
 "comments": [
  {
   "comment_id": "kemm9bw",
   "message": "When I realized that me working constantly, picking up more hours, and doing the hardest tasks was a form of self harm.",
   "created_utc": 1703349976,
   "score": 53,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kemwjp2",
   "message": "“Don’t set yourself on fire to keep other people warm.” \n\nA friend told me that, and it completely changed how I interact with people. I’m still kind and try to be as helpful and empathetic as possible, *but not to my own detriment*.",
   "created_utc": 1703353834,
   "score": 39,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kemq6cm",
   "message": "That I traumatized people because I’m traumatized myself.  It wasn’t intentional, but I do need to be more careful and aware.",
   "created_utc": 1703351442,
   "score": 31,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kemko0u",
   "message": "1 ply toilet paper.",
   "created_utc": 1703349374,
   "score": 9,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kempio7",
   "message": "Critical thinking, Religion and Philosophy classes changed me deeply as a person. Not all for the better mind you, now i feel like the freed prisoner returning to the darkness of the cave when I talk to people. Alone, trying to convince people to think beyond the cave.",
   "created_utc": 1703351194,
   "score": 11,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kenly27",
   "message": "A pivotal point in my life was when my husband had a cardiac arrest at home and with the 911 operator coaching me, I did CPR on him and essentially saved his life. He lived another 24 years  and recently passed away at age 82 of COVID.",
   "created_utc": 1703364130,
   "score": 17,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kenj6rk",
   "message": "For years I would rearrange rooms/houses all the friggin time.  It was almost a compulsive behavior, and my friends would jokingly ask me which I rearranged over the weekend.  The side story here is that I’ve been chronically ill for the past few decades.  It finally dawned on me that my rearranging behavior was my way of trying to exert some control over my life, which is something I lost w my medical issues.",
   "created_utc": 1703362963,
   "score": 7,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kemz39b",
   "message": "This probably isn't expected and I hope one day this finds it's way to him:\n\n\\- When Dave Chapelle did a show a few years back, he told a story about a friend of his, a transwoman named Daphne. And during his story, he talked about a moment where she was in the audience, after opening for him, and they were having a good discourse back and forth about her trans experience. At the end of the exchange, he said \"I love you, but I have no idea what you're talking about\". And she said \"I don't need you to understand me! I just need you to know I'm going through a human experience.\"\n\nI haven't earned the right to have an opinion on important matters like trans-rights, but for a majority of my life, I felt awkward around trans people. But that sentence changed me forever. It gave me a clarity regarding the challenges we all face as human beings. Whether gender, sexuality, culture, religion, etc. - we all have our own battles to face. And those battles are no less important than the battles we see in others. \n\nI longer see a gender, sexuality, race, culture, etc. in the people I run across every day of my life. I just see people. I like that about myself.\n\nThank you Dave, and thank you Daphne.",
   "created_utc": 1703354827,
   "score": 15,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kemqmk7",
   "message": "microdosed some new Penis Envy too much at work for shits \u0026amp; gigs then had a breakdown in the locker room. when boss finds me, he's like, you gotta stop doing this youre 53",
   "created_utc": 1703351610,
   "score": 6,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kenhb0b",
   "message": "I didn’t discover this but I was venting to my one friend that I have restless leg syndrome, get migraines frequently, always sweat for no reason, etc and he was like “dude I know you, you have anxiety”. So I went to a therapist and it turns out I do.",
   "created_utc": 1703362164,
   "score": 6,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kenklyt",
   "message": "The ice show at the castle. Outdoor. A major storm hit and the backdrop wasn’t secured at the bottom. It was going to blow away. I put on my skate guards and ran down a muddy gravel path to find items to secure it with. I’m soaking wet on my knees tying this thing down. Everyone else was in the cabin staying dry and warm. Turns out in an emergency situation I turn into Scarlett O’Hara. \n\nIt’s like a switch flips and I become this focused, resourceful person. My nickname in college was Marijuana McGuyver because as a party trick I could make a bong out of anything and sold weed. Someone invited a professor to the party and they actually came. We’re high and reek of pot. Sock around a fork in an outlet and the lights went out. We escaped unseen.\n\nMy roommate was on a date and the condom fell off inside her. She had no abortion money. I came up with the idea to have her call her mom to put money in her account for a book she needed for a class. Boom. Walked her to CVS to get Plan B.\n\nI’m a fun loving light person. But in a crisis something happens in me and I change to a taskmaster. I’ve discovered I’m unusually resourceful during a crisis.",
   "created_utc": 1703363568,
   "score": 7,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "ken2oun",
   "message": "When I finished the last 3 years of my 5 year bachelor’s experience with straight A’s. I learned if I applied myself and read the books I could learn and do anything! \n\nWhen I did a dry fast for 3 days and 3 nights! I learned I could control my desire to eat.",
   "created_utc": 1703356251,
   "score": 5,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kenpwsw",
   "message": "My life balance categories for happiness that I somehow came up with while wandering around one time: Personal, Professional, Family, Fitness. I just try to balance those 4 things in the long run, always.",
   "created_utc": 1703365812,
   "score": 1,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kenr0v9",
   "message": "When I was a bullied frightened 13 year old and alone in my room I used to ceaselessly ask myself \"Who am I? Me in here just now who am I?\" There was no answer to this question but I would go into a state of deep peace and joy before snapping out of it. Now as a 41 year old I have discovered this is called self inquiry and is a route to spiritual enlightenment. I have tried it again but with limited results.",
   "created_utc": 1703366287,
   "score": 3,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "kenxymr",
   "message": "For all the people struggling with self esteem i read a book that said \"Don't get upset over stuff that a 13 year old boy said about you when you were younger. Times and opinions change and you will never know whether they meant it or not so stop replaying that in your head.\"",
   "created_utc": 1703369184,
   "score": 1,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "keo3r6a",
   "message": "\"I like to touch myself to BBWs\"\n\nOnce I realized that, I realized that I find BBW women sexy and it was great.",
   "created_utc": 1703371638,
   "score": 1,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "keod13c",
   "message": "When I realised I don’t give a fuck what other people think. It was a gradual thing but definitely been there brewing away for many years. I’m an expert at saying no without any guilt.",
   "created_utc": 1703375737,
   "score": 1,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "keohul6",
   "message": "Yo, this is some straight up truth right here. Life-changing realization.",
   "created_utc": 1703377901,
   "score": 1,
   "submission_id": "18p9clq"
  },
  {
   "comment_id": "keohv0f",
   "message": "I was surprised to learn that my fear of failure was holding me back from pursuing my true passions.",
   "created_utc": 1703377906,
   "score": 1,
   "submission_id": "18p9clq"
  }
 ]
}