{
 "submission_id": "18p9ue2",
 "title": "Military vets of Reddit, what’s the absolute dumbest shit you’ve ever gotten your ass chewed for?",
 "selftext": "",
 "created_utc": 1703350650,
 "permalink": "/r/AskReddit/comments/18p9ue2/military_vets_of_reddit_whats_the_absolute/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p9ue2/military_vets_of_reddit_whats_the_absolute/",
 "comments": [
  {
   "comment_id": "kemydzo",
   "message": "Got an LOR (Letter of Reprimand) because I was late to an aircraft launch due to doing a task that my TSgt ordered me to do after I told him that he ordered me to do after I informed him that it would probably cause me to be late. I had to sprint across the flightline while carrying a bunch of equipment, and was able to knock out my portion of the launch procedure fast enough that the jet was still able to take off on time, meaning that the mission was not negatively impacted.\n\nI got chewed out, handed the LOR to sign, and decided to write a rebuttal (which is where you can explain the circumstances of what led to you getting in trouble, or admit guilt and own up to your mistake, OR throw your boss under the bus for being an ass. I went with the third option).\n\nWhen it was sent to the 1Sgt to be added to my file, the 1Sgt called me into his office to discuss it. I explained the situation, and he basically said \"Seriously? He gave you an LOR for following his orders AFTER you told him it was a bad idea? That's fucking stupid. I'm shredding this LOR. As far as I can tell, you did nothing wrong. Go back to your Section and tell him to come talk to me.\"",
   "created_utc": 1703354553,
   "score": 15,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kemrns0",
   "message": "Rubbing dog food on my butt",
   "created_utc": 1703352007,
   "score": 8,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kemr5n5",
   "message": "The list is long and distinguished.",
   "created_utc": 1703351814,
   "score": 22,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kemryex",
   "message": "I was a a Ssgt in the Air Force, and had an idiot Airman who got pulled over on base on a Saturday night. His BAC was over .2 an hour after the initial stop. I got called at 0200 to get to the 1st Sargent's office immediately, and in uniform. Our Commander started yelling at me about how it was my fault. Thank God the Chief stepped in.",
   "created_utc": 1703352115,
   "score": 11,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kemrpcn",
   "message": "Some dude who should’ve never been a sergeant was flipping out because he was homesick from deployment and needed a target.\n\nI was in country about six months before he got there yet he was crying at his desk and just being generally useless.\n\nThe shit thing is I sat next to him and had to balance doing my ducking job, feeling sympathetic for him, and just avoid him if possible.  \n\nDude had a fucking ego and was kind of racist.  Guy was power tripping all the time and threw his rank around, never offering solutions just problems and complaints.\n\nI trained him on how to do something, he remembered it differently, I confirmed with other people that my way was correct, and he chewed me out for being insubordinate for correcting him.  \n\nDude actually left the deployment with a bad review which is almost impossible to do without getting booted.",
   "created_utc": 1703352023,
   "score": 4,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kene71p",
   "message": "Anyone in a leadership role getting in trouble for something their subordinates did in their free time would fill this thread.\n\nHow could I have let my sailor let his driver's license expire?! 🙄",
   "created_utc": 1703360868,
   "score": 5,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "ken04jr",
   "message": "So far it's probably smiling like a dumbass in ranks",
   "created_utc": 1703355236,
   "score": 3,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "ken6gwj",
   "message": "I was a brand new airman and just got to my first squadron. Me and the rest of the new guys had to do some training that lasted a few days.  We got done an hour or two early on the last day and the instructor said we could head out for the day.  The next day our PO1 yelled at us for leaving early and said we were all getting double watches that weekend. I told him that was bullshit because the instructor (who also reported to our PO1) said we could leave.\n\nI didn't have a single watch that weekend.",
   "created_utc": 1703357757,
   "score": 3,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "ken0h5q",
   "message": "Not me, but some random sailor from another ship visiting ours to borrow some tools or something.\n\nAnyways, my division was fixing up something in our \"p-way\" (passageway/hallway) using some caulk to seal up some edging. He passed by us as we were using it and says \"ohhhh CAULK\" (trying to joke that it's pronounced \"cock\").\n\nMy cheif was well known on our ship for being a total bitch. She was a power tripping, anti-misogynist, and literally anything would set her off.\n\nShe overheard him say \"ohhh caulk\" and absolutely tore into him about how unfunny it is and threatened to tell his command. We were so embarrassed to have her as our cheif.",
   "created_utc": 1703355375,
   "score": 5,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kemtdnz",
   "message": "Terrorizing the new privates by throwing around bricks of C4 and even going as far as throwing it at each other in small clumps. Poor guys just about crapped themselves. Yeah, Top didn't find it funny. Claimed in effected morale in a negative way. On the flip side, our Butterbar thought it was funny as hell.",
   "created_utc": 1703352649,
   "score": 2,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "ken1ydt",
   "message": "I got a dumb chewing once for failing a run on a fitness test. I also got the upper hand on that one....the course was out of regs, so I politely-ish informed that the score could \"get lost\" or I would request mast. It got lost.\n\nOne of the biggest ass chewings for something dumb that I gave out was to a boot who showed up drunk to a driving course, under the legal age for drinking. Everyone not inside the main building heard me, and I went on for probably 15 minutes. Finished it off with a 6105 for good measure. \n\nI chewed out a gun team leader and fired him on the spot for pointing a mortar system downrange the wrong direction and he couldn't explain to me why it was aimed the way it was or how one of the firing chart he supposedly used worked, despite having clear instructions printed on the face of it.\n\nChewed that same boot a second time the same day because after I fired him, he self appointed himself to be the safety driver and relieved the one who's job it was, when only the range safety officer (myself) could appoint or relieve safety drivers.\n\nHad another, chewed him out because he couldn't figure out to drink water in the extreme heat. Then had to chew him out again because he turned around and drank too much water, and went down. Kid took an entire magazine of silver bullets because he couldn't figure out how to drink water correctly.\n\nThose were the days lol.",
   "created_utc": 1703355959,
   "score": 2,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kenahnt",
   "message": "We were having a farting competition over several days.   Pull my finger and time how long it's audible for.  With us going a bit crazy on the baked beans.  We ended up setting off the environmental monitor designed to protect the equipment that we were working with.  A few times.  Even after we stopped the competition, the beans just kept working their way out. \n\nA few months later, we were even more bored and decided to do some medieval style jousting.  With on person on an office chair, with a mop and a bin lid.  Whilst being pushed by somebody else.  Of course, to make it more interesting.   We had to set fire to the mop and set off a load of smoke alarms.   As we had to be within X seconds of some equipment.",
   "created_utc": 1703359369,
   "score": 2,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kenb23x",
   "message": "Three of us were rousted by SP in the park for \"being in a dark place after dark\".",
   "created_utc": 1703359604,
   "score": 2,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kend11f",
   "message": "When I was in A School as a E-3 I was failed on a room inspection because I left my dress shoes out. The instruction allowed us to leave one pair of boots, shower shoes, PT/tennis shoes, and civilian shoes each at the foot of our beds. I made the switch to wear brown boots over my boot camp issued black boots since theyre far comfier so my black boots were left at the foot of my bed while I wore my brown boots. The reason the failed my room was because of my black boots being out. The dumbass PO1 who was NMT thought they were my dress shoes because they were shined so well. When I told him they were my boots he asked me how I would be out in uniform without them and I told him to look at my feet and tell me what he saw. He didnt like being wrong so instead he got on me for an \"attitude\"",
   "created_utc": 1703360387,
   "score": 2,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kenoru1",
   "message": "I was in the air wing, Marine Corps. I was driving into work one day and parked near the smoke pit area of my building. One of our gunnies was out there smoking and I guess he didn't like my music because he came over and chewed my ass out for playing music too loud.\n\nIt wasn't even that loud but he was a jackass who came over from the ground side and thought he was still an 0311 but with helicopters.",
   "created_utc": 1703365331,
   "score": 1,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kenovri",
   "message": "I was put on report for \"skylarking,\" which they defined as \"an intolerable lack of seriousness.\" I was totally fucking guilty.",
   "created_utc": 1703365377,
   "score": 1,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kenq5bn",
   "message": "Not dumb, but funniest.  We got a new platoon sergeant, fresh off drill sergeant duty. This dude was a grizzled, scary looking dude.  I was his driver.  We hadn't really had a chance to get to know him by the time we went to the field for training.  He was giving the platoon a convoy briefing across the hood of the Humvee with the map spread out.  Giving frequencies, radio code words, checkpoints, etc.  He looked around and saw nobody was writing it down and flew off the handle.  Threw his helmet.  NOBODY'S WRITING ANYTHING DOWN? I GUESS I'M DOING THIS FOR MY -- HEALTH.  GET IN THE -- VEHICLES.  WE'RE LEAVING IN 5.  I jumped in the driver's seat and he leaned over and hit me in the arm with a big shit eating grin.  \"Think that got their attention?\" \n\nEnded up being the absolute best NCO I ever had the privilege to work with.  Nothing but respect.",
   "created_utc": 1703365913,
   "score": 1,
   "submission_id": "18p9ue2"
  },
  {
   "comment_id": "kent3ed",
   "message": "Not a vet but I remember hearing a story about a cadet in one of the academies who was in some club or team and in class they got yelled at for having un-shined shoes, but at the club meeting they got yelled at for having too shined shoes",
   "created_utc": 1703367158,
   "score": 1,
   "submission_id": "18p9ue2"
  }
 ]
}