{
 "submission_id": "18p945i",
 "title": "How do you deal with your “everything’s a conspiracy” relatives, during the holidays?",
 "selftext": "",
 "created_utc": 1703348497,
 "permalink": "/r/AskReddit/comments/18p945i/how_do_you_deal_with_your_everythings_a/",
 "score": 112,
 "url": "https://www.reddit.com/r/AskReddit/comments/18p945i/how_do_you_deal_with_your_everythings_a/",
 "comments": [
  {
   "comment_id": "kemnk3l",
   "message": "Double down and throw it back in their face\n\n*\"The moon landing was faked\"*\n\n\"You really think the moon is real?\"\n\n*\"COVID was a way to control us\"*\n\n\"Please, COVID was just a front. The government really controls us with chicken noodle soup and toilet paper\"\n\n*\"The world governments are going to collapse. Start buying gold and Bitcoin\"*\n\n\"If you were really paying attention, you would know we really need to put our money in sundials and Wrangler jeans. He who controls the pants controls the galaxy.\"",
   "created_utc": 1703350463,
   "score": 74,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemioz5",
   "message": "dont engage. Change the subject, excuse yourself from the convo/leave the room, greyrock them. Much like trolls, dont feed into their behavior.",
   "created_utc": 1703348623,
   "score": 132,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken62a8",
   "message": "Ask them why Donald Trump didn’t stop/expose it while he was in office. Convince them that the only possibility is that he’s in on it",
   "created_utc": 1703357592,
   "score": 40,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken30cw",
   "message": "I play dumb. “I don’t know who that is. No I’ve never heard of that. I’m… no I don’t know. Marilyn Morploe? No never heard of her. JFK, the peanut butter brand? I’m so confused. They had an affair? Like with rides and fair food.” They eventually get frustrated and stop.",
   "created_utc": 1703356379,
   "score": 27,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemmjwn",
   "message": "People rarely believe in principled conspiracy theories with a definitive start and end, they just don’t like other people, don’t understand how the world works, and have a vague sense of untrusting and superiority. \n\nLike if you run into someone who believes the moon landing was a hoax, ask them why Russia triangulated the signal and approved of it coming from the moon. “Because they’re in on it too” they’ll instantly say; because the entire world is a giant conspiracy, to them. \n\nSo you have to hit them with that first, and as condescendingly as possible. “You think the US didn’t land on the moon? Pssshh, the US and Russia aren’t even real dummy, they’ve been run from the shadows since the beginning of time, which also isn’t real and was made to make us suffer from our reptilian overlords, now pass the potatoes sheeple.”\n\n\nAlso this works great with religion. Say the phrase “ancient Jewish tradition actually dictated…” and your super religious grandma will beg you to stop talking about the Bible.",
   "created_utc": 1703350086,
   "score": 36,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemikry",
   "message": "make up the stupidest most stupid conspiracy you can think of then try and sell it to them",
   "created_utc": 1703348581,
   "score": 46,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemoqfr",
   "message": "Ask then about work or their hobbies or sports. Some people are so weird they can’t talk about anything else.",
   "created_utc": 1703350903,
   "score": 10,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemsluc",
   "message": "I don't go to see them. If I have to go see them, I don't engage. I change the subject or talk to relatives who *aren't* unhinged. I vent to my friends about the ridiculous things I've heard real people say out loud. \n\nThis year I've decided to turn it into a morbid game. I'm going to set a timer on my phone, start it when I arrive, and see how long it takes for my mom to say something awful.",
   "created_utc": 1703352356,
   "score": 10,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemw7kb",
   "message": "My  nutjobs missed out on two years of grandchildren, until we reached an agreement that there will be not one word of politics, religion or economics, or I will take these grandchildren and walk. \n\nIt is fantastically effective.",
   "created_utc": 1703353706,
   "score": 18,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemqql7",
   "message": "I encourage and engage. Disagree with everything they say. \n\nEx: homophobic uncle\n\n     Uncle: all Gay men are going to hell I hate them\n     Me : I read a study that 89.45% of people that hate the gay is because they’re in the low (I never read no such study)\n       Uncle: *goes on a rant and turns red**\n      Mom: please stop 🤦🏾‍♀️",
   "created_utc": 1703351654,
   "score": 14,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemxpx8",
   "message": "Cut them off. They don’t deserve to be around normal people.",
   "created_utc": 1703354296,
   "score": 13,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemzv0z",
   "message": "Hitler/Genocide is not a conspiracy.  I no longer have contact with that side of the family.",
   "created_utc": 1703355132,
   "score": 5,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemimmz",
   "message": "Take the tinfoil hats to give out...",
   "created_utc": 1703348600,
   "score": 9,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemt7xe",
   "message": "I smoke weed. I bring enough for all the other sane people. We take a nice walk before dinner. It takes the edge off when the conspiracy fans start talking about bullshit.",
   "created_utc": 1703352586,
   "score": 5,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemyl94",
   "message": "I flat out say “alright, well, not doing that!” And then I stand up and walk away. \n\nI like it because it gives you all the control. It’s aggressive enough to let them know they are absurd, but soft enough to not be combative.  It leaves them feeling pretty stupid, all by themselves. Very effective.",
   "created_utc": 1703354633,
   "score": 5,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken7j1w",
   "message": "I remind them that their preferred news channel and only \"source of truth\" just paid almost a billion dollars in a settlement for knowingly lying to their viewers. Knowingly. Lying. So I don't take a single thing these people say seriously and they can keep the bullshit to themselves.",
   "created_utc": 1703358185,
   "score": 4,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemsim5",
   "message": "I ignore and don't engage them.\n\nIt's so weird to see otherwise very intelligent and bright folks who will spout off the most ridiculous shit when it comes to certain things.",
   "created_utc": 1703352323,
   "score": 4,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kents1k",
   "message": "I just say “I don’t listen to Evangelicals anymore. They lost all credibility and moral authority when they endorsed Trump.”",
   "created_utc": 1703367442,
   "score": 4,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenx5n4",
   "message": "As a hippie-ish child of early Boomer parents, whose worldviews all contain DNA traceable to Rush Limbaugh/Fox News, I've learned to just STFU about certain topics.  Strangely, **I'm** the one considered to be the crazy conspiracy theorist, yet my claims are all supportable by facts and references and tend to get proven correct over time.\n\nVery early on, I remember my Dad (who came of age during the Cuban Missile Crisis) red face screaming at the TV whenever a Russian athlete placed in the Olympics, and thought to myself, *Way to defeat the purpose of the Olympics, Dad!*  I'm an America-hater for standing against the Gulf Wars and not believing Saddam had WMDs, a junkie apologist for standing against the lies and cronyism underlying the Drug War,  an industry hater for wanting pollution controls and sensible environmental laws (even as we could see the Los Angeles sky get less and less smoggy over time as the population continued to explode), and most lately, an America hater/Putin mouthpiece for suggesting Ukraine is like the Cuban Missile Crisis in reverse, and Literally Hitler for speaking out against the treatment of civilians in Gaza.\n\nGatherings better spent talking about safe topics like the weather and cats.",
   "created_utc": 1703368847,
   "score": 4,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo0zg1",
   "message": "I had the misfortune of spending the holidays one year with my partner’s, um, eccentric, far-right uncle. The man was convinced that we’re all being tracked by the government. I had enough of his nonsense and just said, “you aren’t important enough to track.” Anyways, haven’t had to visit the man in a a few years now, thankfully",
   "created_utc": 1703370452,
   "score": 4,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo8nxg",
   "message": "Thankfully I only have one.  Nutjob brother in law.   \n\nTypical red hat, fox news, brain worms type.\n\nHe got pretty bad in the early days.  Back in 2015 Thanksgiving and Christmas were a nightmare with him.  Every conversation naturally went to Trump.  We had to ban political talk of all kinds as well as fox news during family events.  He still constantly tried to interject politically charged snide comments which we immediately shut down.\n\nWe just wanted to have family gatherings with no politics.  This apparently infuriated him that he couldn't use those gatherings as his own personal Trump rally.\n\nIt all came to a head a few years later.  We were done.  So sick of it.  I physically removed him from the house and into the yard.  He was told that he was no longer allowed to attend unless he could keep his mouth shut.  That was on Thanksgiving.  He did not attend the following Christmas which we realized was the nicest, most peaceful holiday we had had in a very long time.\n\nThe following Thanksgiving he returned.  Apparently my sister had finally put her foot down.   I dont think he said more than a few words per gathering after that.   In recent years he has improved thankfully.",
   "created_utc": 1703373778,
   "score": 4,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemm5iz",
   "message": "Make reference to something completely imagined and random, as if it's common knowledge. Might lose them to the internet for a while. Say something like \"I don't think Kennedy was assassinated by the CIA, after all the Schneeweisschen protocol precludes their involvement...\"",
   "created_utc": 1703349937,
   "score": 7,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemxp40",
   "message": "Wear a mask",
   "created_utc": 1703354287,
   "score": 3,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenh85o",
   "message": "Just ask for sources. Usually it's tiktok or Reddit 👀",
   "created_utc": 1703362130,
   "score": 3,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenidez",
   "message": "Throw out crazier conspiracy theories like how Finland is just a myth created by the Japanese and Russian governments due to fishing rights.\n\nThe crazier the better.",
   "created_utc": 1703362618,
   "score": 3,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenwilx",
   "message": "I usually mirror them. And every time I do it I've met with anger.\n\n\u0026gt;submarines are scanning our thoughts? \n\nDUDE! US just moved their fleet to the Adriatic. That mean that we are in the radius of influence. What's the last thing they influenced  you? Wait. Does the influence drops with radius?\n\n\u0026gt;Earth is flat? \n\nOMG! Finally someone who understands that the magnetic polarity of the compass changes to circular direction the closer we are to the plate edge. \n\n\u0026gt; Illuminati run the world?\n\nThat's not really a secret anymore, is it?",
   "created_utc": 1703368578,
   "score": 3,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo3qvj",
   "message": "Personally, I tell them to shut the hell up. I’m too old to have patience for that shit. We’re having a nice family dinner, quit flapping yer gums and ruining it for the rest of us.",
   "created_utc": 1703371634,
   "score": 3,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemk322",
   "message": "Just don’t respond to the conversation or entertain it, smile and change the subject.",
   "created_utc": 1703349154,
   "score": 5,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken2j8t",
   "message": "Never argue, only ask questions. Why do they do that? Why do they want that? What will they do when they succeed? How do you know about this? Why haven't they stopped the information leak? \n\nAnd just let them talk themselves into a corner where eventually everyone is either a Lizardperson eating babies or the Devil is plotting against God.",
   "created_utc": 1703356190,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken3u2n",
   "message": "I say roll with it. Show interest,  ask questions and above all else get it on video. Then post it here Tuesday.",
   "created_utc": 1703356706,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken83e4",
   "message": "“I get it. Sometimes it’s just more comforting to believe that there’s someone ultimately in charge rather than admitting that none of us know what the fuck we’re doing because that can be really scary to realize.”",
   "created_utc": 1703358407,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken8ucn",
   "message": "I come up with even more ridiculous suggestions and troll them.",
   "created_utc": 1703358705,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken9e1g",
   "message": "I don't engage, but I do keep a tally and kinda shake my head later. Some ones from past years: \n\nEdward R. Murrow did a political hit job on Joe McCarthy. \n\nKwanzaa is a made-up holiday. (I know. Don't @ me.)\n\nCovid vaccinations are unnecessary if you use hydrogen peroxide in a nebulizer.\n\nSo-and-so didn't get the day off because minorities get first pick.\n\nThe black guy that got beat up and sued the force is just looking for a payout.\n\nWhat would the holidays be if everyone behaved?  I'll let you know when it happens.",
   "created_utc": 1703358927,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenq95y",
   "message": "Just laugh. I did that with a nutso uncle and he had no idea how to respond. With multiple relatives, keep it going.\n\n“Wow, that’s even funnier than Uncle Stan’s!”\n\n“Did you hear cousin Susie’s conspiracy about XXXXXX? It’s totally wild!”",
   "created_utc": 1703365958,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenr3fw",
   "message": "I don’t. Disowned them long ago",
   "created_utc": 1703366317,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenupv3",
   "message": "I excuse myself to go start dishes or even just go to my game room. The conversation ALWAYS goes into whack job territory. I’m known as not very social so it works.",
   "created_utc": 1703367830,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenz6c9",
   "message": "Are you kidding? There’s your entertainment.",
   "created_utc": 1703369691,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenzzdm",
   "message": "I like to relay it back in a way that makes it clear how stupid it sounds. Lots of pauses too. I really draw it out. \"So you're telling me.....the shadow government.....who already has access to our cell phones....with the built in microphones.....that we wilfully carry.... put tracking devices in vaccines....so they can keep tabs on the population....but only the ones who are compliant?\"",
   "created_utc": 1703370033,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo3emx",
   "message": "I don’t . I have a sister in law who thinks everything and I mean everything is a conspiracy. She has learned not to try to convince me because I just ignore her. She even whispers to my wife who by the way just listens because it’s her sister.  Also my step son is the same way and when they get together it’s crazy. But they won’t discuss it in front of me because I’ve made it clear I don’t like it. It is great that they know that and respect my wishes. So we have great holidays.",
   "created_utc": 1703371490,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo9ydm",
   "message": "You're the normal person. Laugh at them. Repeat what they just said to you in an amused tone with a smile on your face, and then laugh again and don't say anything else about it. Don't argue it, let them say as much as they want and don't refute a single point, like they're telling you a funny story. Ask for more details like you can't wait to hear what hilarious bullshit comes next. Make it clear that debating such stupidity is beneath you, to the point where you think it's funny. They'll stop.",
   "created_utc": 1703374359,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keod1ps",
   "message": "Stay home and watch Hallmark movies",
   "created_utc": 1703375745,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kep7q7y",
   "message": "I completely agree with everything they say, and then add onto it until they cry uncle and say that I'm nuts.",
   "created_utc": 1703390072,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kepdw9o",
   "message": "Nod along with their conspiracy, then slap your knees, stand up, and announce it's time to fight back and that everyone should get their guns and be ready to head out in ten minutes.",
   "created_utc": 1703393384,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemmyx9",
   "message": "Don't invite them, cut them off. Get rid.",
   "created_utc": 1703350244,
   "score": 2,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken3g0h",
   "message": "My entire family of origin and cousins, are rational liberal people. My wife’s family of origin is the same. I have to go all the way to cousin-in-laws to find conspiratorial types. And I’m happy to be entertained by their delusions.",
   "created_utc": 1703356551,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenk2h1",
   "message": "Laugh. “If you believe that I’ve got an iceberg to sell you.” Then walk away laughing.",
   "created_utc": 1703363340,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemj7cy",
   "message": "[deleted]",
   "created_utc": 1703348815,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenm9a2",
   "message": "I roll with it. It is what it is. I can still love my family even if we have different views. \n\nI’m not going to one up them or change their minds at this point and I’m not going to mock something they truly believe. \n\nI finally stopped fighting them and now I just listen. Say that’s pretty wild. That’s interesting. I even let them tell me why they believe it and then guess what!? The evening ends and they go to their houses I go to mine and we say I love you and go through it all the next time I see them.",
   "created_utc": 1703364261,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemsgfi",
   "message": "I like conspiracies so I engage with the conversation. I may not believe them all but I enjoy the rabbit hole and sometimes learn something, prove something, disprove something. It's a fun topic.",
   "created_utc": 1703352299,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenao3x",
   "message": "Laugh at them in the same way I laugh at clowns.",
   "created_utc": 1703359443,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenek8s",
   "message": "I just ask questions and give a \"wow\" and keep asking deeper questions.\n\nYou get to watch their live disappointment and frustration as their reasoning makes less and less sense, while they try to reason it.. but they can't get mad at you, because it sounds like you're interested.\n\nIt's like playing with a Venus fly trap.",
   "created_utc": 1703361019,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenf7gw",
   "message": "I openly laugh at them now. I am not going to hide my true feelings from these people any longer. If a toddler walked into the room and shit on the floor I'd laugh at the toddler. These people are no different. Public humiliation is powerful. At least the toddler doesn't know what they're doing.",
   "created_utc": 1703361284,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenf8sd",
   "message": "I don't. I exclude them or myself.",
   "created_utc": 1703361300,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenfax9",
   "message": "I just say “oooh spooky!” and walk off. Every time.",
   "created_utc": 1703361324,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenlcq8",
   "message": "My in laws think the Old Testament is literal. I chuckle every time they talk about it.",
   "created_utc": 1703363881,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kendei5",
   "message": "Interesting",
   "created_utc": 1703360542,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemvoto",
   "message": "They're correct.",
   "created_utc": 1703353509,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemvs0q",
   "message": "I like to respectfully listen to their perspectives and share some credible sources that offer different viewpoints. It leads to interesting conversations, and I believe keeping an open mind promotes understanding and unity.",
   "created_utc": 1703353540,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenc83j",
   "message": "I just nod and go \"mmm hmm, mmm hmm\" a lot.",
   "created_utc": 1703360063,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kendvq7",
   "message": "It's like a funny entertainment, let them explain you the flat earth and drink every time you must laugh. Win win situation 🙌",
   "created_utc": 1703360737,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kene8v8",
   "message": "[removed]",
   "created_utc": 1703360888,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenf2np",
   "message": "I brush up on weird random facts beforehand and use them to respond to their bullshit. They're usually too stunned or impressed to continue with their rant.\n\nAny suggestions?",
   "created_utc": 1703361229,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenoi9i",
   "message": "I don't have any relatives like that.",
   "created_utc": 1703365218,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenproy",
   "message": "Let them be, nobody is perfect and nobody knows everything. If they are teaching it to your kids thats your right to step in. I talk sports and hobbies and thats about it",
   "created_utc": 1703365752,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keotvdp",
   "message": "Fix them and myself a drink and enjoy their stories.",
   "created_utc": 1703383406,
   "score": 0,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemylna",
   "message": "Well so far they've been right on every count so you might give them a listen and actually learn something.",
   "created_utc": 1703354637,
   "score": 248,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keml3o2",
   "message": "I just work to ramp up their conspiracy  theory even more. I just say off the wall stuff to make them think more about it. It’s fun and also they can’t tell if you are agreeing or disagreeing with them. It’s fun!",
   "created_utc": 1703349539,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemmvzc",
   "message": "Depends.. if it’s an “interesting” one I want to hear all about it for the entertaining factor. If it’s like a political one or something like that I just smile and don’t engage",
   "created_utc": 1703350213,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemoc2j",
   "message": "[deleted]",
   "created_utc": 1703350758,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kempub3",
   "message": "I’ve tried to rebuttal with facts, and often the response is “well, I don’t know” to which I respond “now you do, because I just told you”.  Not worth the effort.",
   "created_utc": 1703351316,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemqrbw",
   "message": "One up them. Every conspiracy they bring up, bring up an even crazier one. \n\n“The moon landing was fake”\n\n“You believe in the moon?”\n\n“Covid wasn’t real”\n\n“You think viruses exist?”",
   "created_utc": 1703351663,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemqw1t",
   "message": "Well my relatives is a soccer fan so I cut out some red and yellow squares from construction paper and I have a whistle at the ready",
   "created_utc": 1703351713,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemryjy",
   "message": "Don't interact. Alter the topic, get out of the room or excuse yourself, and greyrock them. Similar to trolls, avoid encouraging their actions.",
   "created_utc": 1703352117,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemvfpf",
   "message": "If they're interesting people who can speak well I would certainly listen to them but if they're not then I'd be less interested.",
   "created_utc": 1703353412,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemw2rd",
   "message": "Just reply “you may be onto something, start a podcast” … this will encourage them to research setting up a podcast , then they will be busy for the holidays",
   "created_utc": 1703353655,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemw5ln",
   "message": "Drink a bud light in front of him.",
   "created_utc": 1703353684,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemwouc",
   "message": "If they you the moon landings aren't real you tell them the moon isn't real. Just out crazy them at all times.",
   "created_utc": 1703353891,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemx6e1",
   "message": "Make them stay outside at -10.",
   "created_utc": 1703354079,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemxkis",
   "message": "“Ok, thank you for letting me know about that”",
   "created_utc": 1703354237,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kemyife",
   "message": "They got to you too, didn't they!?!",
   "created_utc": 1703354602,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken01z8",
   "message": "I literally pay them no mind. If they insist on seeking me out to tell me specifically about something, I just ask them to explain what they mean by things they say. Eventually they run out of time to \"spoon feed\" me things, and move on.",
   "created_utc": 1703355207,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken2teu",
   "message": "Keep your distance or drink heavily.",
   "created_utc": 1703356302,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken2x62",
   "message": "Just go deeper in their madness :\n\n- Whe didn't land on the moon : because you still believe the moon exists ?!",
   "created_utc": 1703356343,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken3n2o",
   "message": "I ask what year they expect the grand conspiracy to happen. “Oh the global cabal is going to cull 90% of the population? When? What year will this definitely happen by so I can check back in?”",
   "created_utc": 1703356629,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken4346",
   "message": "One up-ism, minimize their conspiracy with your own BIGGER conspiracy.\n\n“You haven’t heard about the government coverup about all the hydrogen in the water!?!”\n\n“You think the birds are fake?  They stopped doing that in the 70’s, now it’s rescue dogs”",
   "created_utc": 1703356805,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken4at2",
   "message": "Had an uncle (in-law) tell me some weird story and ended with \"if you don't believe me look it up!\", I told him that it's not my job to prove your crazy story!\n\nAlready had been married for about 7 or 8 years and did this with some relationship capital built up with my father in-law.  So tread carefully and read the room.d",
   "created_utc": 1703356890,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken4ed9",
   "message": "Encourage it. It's awesome to watch it unfold.",
   "created_utc": 1703356930,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken66g0",
   "message": "Egg them on",
   "created_utc": 1703357640,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken6u4a",
   "message": "Ask them if someone who works 40 hours a week deserves enough to eat and a place to live.",
   "created_utc": 1703357905,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken7361",
   "message": "Laugh a lot.",
   "created_utc": 1703358005,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "ken7f01",
   "message": "Listen to Knowledge Fight and then, instead of arguing, you can just point to how practically every single thing they believe leads back to either white nationalism, antisemitism, or both. It's pretty effective in either getting them to shut up, or getting them to at least be honest about who they really are.",
   "created_utc": 1703358139,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenb3vq",
   "message": "Eggnog. Lots and lots of Eggnog.",
   "created_utc": 1703359623,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenf7ta",
   "message": "Science is the answer to conspiracy and keep demanding proof, results, or evidence. All their arguments boil down to basic questions whether if he finance, politics, or biology. Don’t engage until you’ve educated yourself and have the weapons to argue with if you even want to start things. I just change the subject and ignore the comments after stating I won’t speak to them about those issues because it’s the holiday and not a damn debate.",
   "created_utc": 1703361288,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keni7l5",
   "message": "I encourage it.  Tell me more.  Acting interested and open.  Wow, that's wild.  What else?",
   "created_utc": 1703362550,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenl6rr",
   "message": "I edge them on lol did that at work one time. This guy was a bush hating .had his tv red dot taped over and his phone camera he walked out on smoking deck as I was walking in and said how about them gas prices he blew up and while I was in break room laughing pplcame in and where pissed off and said thanks alot just kept on laughing",
   "created_utc": 1703363810,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenlokj",
   "message": "I use to debunk them with simple internet searches, but I have cousins that stopped speaking to me completely because of it. I don't get invited to family reunions anymore. I stopped debunking and let them believe what they want. I realized I valued peace more. Now, if anyone starts with that kind of conversation, I remove myself from the room if I can.",
   "created_utc": 1703364020,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenm334",
   "message": "Honestly I just ignore them. If I can’t I troll them.",
   "created_utc": 1703364189,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenn1eo",
   "message": "Pregame with several shots of liquor when parked half a block down the road to they cannot see me.",
   "created_utc": 1703364596,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kennlu2",
   "message": "My father in law is big into Qanon and NESARA/GESARA.  I love it.  Whenever he brings it up (and he always does, I love peppering him with questions and watching him turn himself into knots until he gives up and walks away.\n\nIf you don’t take this shit too seriously it can be a lot of fun.",
   "created_utc": 1703364834,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keno3hr",
   "message": "“Anyway, speaking of changing the subject, how’s that mac n’ cheese.”",
   "created_utc": 1703365046,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenp79g",
   "message": "I stopped arguing with my brother about that stuff. He's gotten better though. He used to believe in the Lizard people bullshit. \n\nHe was into crypto but I think he got into it pretty late and after Bitcoin crashed he hasn't said much about it. I know it has rebounded, but still hasn't brought it up.",
   "created_utc": 1703365514,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenqdrl",
   "message": "Tell them to go fuck themselves.",
   "created_utc": 1703366012,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenqiyj",
   "message": "Wall of silence. you can't argue with beliefs.\nIf they are willing to limit topics to other, more normal things, then that's different.",
   "created_utc": 1703366074,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenra76",
   "message": "I laugh in their face. I have a step sister that’s a nurse that is full on crazy. She’ll start going off, I’ll give a good chuckle and just say something dismissive like “oh, yeah? That’s sure something.”\n\nWe don’t talk much",
   "created_utc": 1703366398,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kent6p1",
   "message": "Give them a double of what ever they drink and sit them in the com",
   "created_utc": 1703367196,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenw137",
   "message": "Just let them go and tune them out. I am never going to change their minds so its not worth me getting worked up over. \n\nSo i just dont engage them on the topic.",
   "created_utc": 1703368375,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenxkdg",
   "message": "outconspiracy them with esoteric shit",
   "created_utc": 1703369021,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keny3jo",
   "message": "Offer them a couple benedryl for anxiety.",
   "created_utc": 1703369240,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kenyycy",
   "message": "i entertain them for the duration of the conversation and then i get on with my life",
   "created_utc": 1703369598,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo1sin",
   "message": "Tell them my own conspiracy theories and compare notes.",
   "created_utc": 1703370799,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo44g0",
   "message": "Drinking and the charcuterie board mostly",
   "created_utc": 1703371793,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo4eu1",
   "message": "I choose once again not be around them.",
   "created_utc": 1703371914,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keo9r1k",
   "message": "I completely play into it, encouraging them further.  It's more fun than arguing, and it's a game I play to see if I can get them to agree with the most outrageous idea.",
   "created_utc": 1703374268,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keoa1pk",
   "message": "Just remind them that the real conspiracy is the rich turning the poor against each other. Divide and conquer is their plan.",
   "created_utc": 1703374401,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keocowx",
   "message": "What if you married her and the holidays are no different than any other day?",
   "created_utc": 1703375585,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keof1vo",
   "message": "Add to it lol",
   "created_utc": 1703376641,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keog4fi",
   "message": "Like drywall man in “Office Space” when talking about dealing with his boss on Friday:  “I just avoid the mother fucker”",
   "created_utc": 1703377126,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keoiwz6",
   "message": "I like learning about conspiracy theories because I think they're interesting. I'm usually the sacrificial lamb for everyone else.",
   "created_utc": 1703378385,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keoj7vz",
   "message": "It can be challenging, but sometimes it's best to just avoid engaging in those conspiracy discussions altogether and focus on enjoying the time with your family.",
   "created_utc": 1703378524,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keojetm",
   "message": "Alcohol and sarcasm that seems genuine.",
   "created_utc": 1703378613,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keokf56",
   "message": "FEED THE TROLL",
   "created_utc": 1703379070,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keonyf6",
   "message": "Smoke and wave boys. Smile and wave.",
   "created_utc": 1703380697,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keoshgh",
   "message": "Banging Cartman's mom",
   "created_utc": 1703382760,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keou5m2",
   "message": "Don't argue. You won't convince them. Love them as they are. We're all imperfect in different ways.",
   "created_utc": 1703383540,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keouaf8",
   "message": "WOW....I thought I was the only one.     *Hugs to you for throwing this out there,*  \n\nHe knows he is always invited,   There is always a plate for him in our house.    But he prefers to be alone. \u0026amp; I respect it, he an adult, has always had a choice. It hurts me... but it's his life.",
   "created_utc": 1703383602,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keowvqg",
   "message": "I conspire against them with the rest of my family of course",
   "created_utc": 1703384837,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keoxfva",
   "message": "I plan to arrive late, eat a plate of food and then split. I see the family members I care about, quite a bit. I'm not sticking around for the once a year dog and pony show.",
   "created_utc": 1703385102,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "keoyoby",
   "message": "Oh really? Where’d you find that info in the first place? Google? You know they have an algorithm for ppl like you. \nThe conspira-cysts are all talk but generally not good at answering questions",
   "created_utc": 1703385689,
   "score": 1,
   "submission_id": "18p945i"
  },
  {
   "comment_id": "kep0yx2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18p945i"
  }
 ]
}