{
 "submission_id": "18pdbig",
 "title": "what's the scariest science fact that the public knows nothing about?",
 "selftext": "",
 "created_utc": 1703360573,
 "permalink": "/r/AskReddit/comments/18pdbig/whats_the_scariest_science_fact_that_the_public/",
 "score": 202,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pdbig/whats_the_scariest_science_fact_that_the_public/",
 "comments": [
  {
   "comment_id": "keovnqe",
   "message": "Scientific litterature conclusion on alzheimer's disease and other neurodegenerative diseases in general is that the diseases start decades before the first obvious symptoms and that we need to treat them at this stage. When you exhibit obvious symptoms, it's too late, your brain is already mush.\r  \n\r  \nIf you get diagnosed with alzheimer's at 65, you had the disease since your early 40's at least. And you experienced very mild symptoms but didn't notice it. And your brain fought like hell to compensate the deficit. When you get diagnose, your brain is already very severely damaged and will never recover from the deficit.",
   "created_utc": 1703384259,
   "score": 16,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kep0faa",
   "message": "For two days in September of 1859 a massive solar flare (coronal mass ejection) powerful enough to make hanging telegraph lines burst into flames from the induced current washed over the Earth. Another massive burst in 2012 only just missed Earth, but it's not going to be pretty when our luck runs out on this.",
   "created_utc": 1703386519,
   "score": 125,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoasqu",
   "message": "Insect population depletion",
   "created_utc": 1703374737,
   "score": 3,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keol80d",
   "message": "Europa even though smaller than earth has more water than all water bodies in the world combined",
   "created_utc": 1703379438,
   "score": 179,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keosbge",
   "message": "For me personally the acidification of our oceans. You don’t want to know what will happen if all plankton dies.",
   "created_utc": 1703382684,
   "score": 23,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keolx3m",
   "message": "Alcohol increases the permeability of the blood brain barrier by unpredictable factors, which is why people die from overdose on their normal drug dosages",
   "created_utc": 1703379763,
   "score": 49,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keohbib",
   "message": "CO2 levels are causing the pH levels in the ocean to move towards an acidic level. No not like burn yourself acid, but just enough that it's causing an already noticeable impact to microorganisms at the bottom of the food chain. This may eventually lead to a ecological collapse. It seems to be impacting phytoplankton which is responsible for producing a good chunk of the air you breath as well. If the oceans go anaerobic the atmosphere would become toxic. A similar event has occurred during one or two of the past mass extinction events.",
   "created_utc": 1703377660,
   "score": 131,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keot0vr",
   "message": "Our bodies have no way of knowing that we're breathing oxygen. If I could snap my fingers and replace all the oxygen in you room with another inert gas you wouldn't notice. You wouldn't start to choke or struggle. You'd just get sleepier and sleepier until you die. That's why carbon monoxide is so dangerous. If you have any sort of gas appliance in your building, invest in a detector.\n\nEdit: Thanks for providing better explanations on carbon monoxide. Still deadly but not for the same reasons other gases are.",
   "created_utc": 1703383009,
   "score": 132,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoila4",
   "message": "By the time AIDS was first discovered in the United States in 1981, 250,000 Americans were already infected with HIV",
   "created_utc": 1703378235,
   "score": 203,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kenygx7",
   "message": "The actual amount of crude oil that's been pumped directly into the ocean. BP had High Definition 4K live footage of the pipe that ruptured and chose to censor it. And it's not just BP that's had an incident like that.",
   "created_utc": 1703369396,
   "score": 214,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kenzst1",
   "message": "Scientists were trying to study the effects that microplastics have on the human body and brain but were unable to draw any reasonable conclusions because they **could not find a control group.**",
   "created_utc": 1703369956,
   "score": 249,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kenj0gr",
   "message": "The greatest chemical contributor to IQ loss and violent behaviour is Lead and it's still in millions of people's piping.",
   "created_utc": 1703362888,
   "score": 49,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keopdqs",
   "message": "This thread is a lot less fun than i expected.",
   "created_utc": 1703381341,
   "score": 25,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kep1fr3",
   "message": "last time i had to go under the knife i mentioned to the anesthesiologist \"i read online that no one knows how anesthesia even works\" and he kinda just said \"yeah....\"",
   "created_utc": 1703387003,
   "score": 49,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keo7tqw",
   "message": "Tetra ethyl lead raised worldwide lead levels so significantly they had to drill into arctic ice to find an in contaminated sample",
   "created_utc": 1703373410,
   "score": 242,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keo4o73",
   "message": "We all get cancer. But most are so little and small they can’t and won’t hurt us",
   "created_utc": 1703372023,
   "score": 145,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keogkde",
   "message": "related, but does anyone know a subreddit like this? for unknown/disturbing/existential “fun” facts?\n\nedit: one has been made!! r/scarysciencefacts",
   "created_utc": 1703377322,
   "score": 78,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keowrki",
   "message": "People don’t talk enough about the melting permafrost and the associated positive feedback loops that only accelerate what’s already started",
   "created_utc": 1703384782,
   "score": 238,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kenmp5o",
   "message": "If an electrical line is damaged and is in contact with the floor, even walking away from it with big steps can cause a huge electrical potential difference between your feet and kill you",
   "created_utc": 1703364449,
   "score": 213,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keo7ssl",
   "message": "I'm sure there are plenty of people  who know this, but personally I find it terrifying af. \n\nIf the vacuum of space didn't block sound from reaching us, the sun would be as loud as a jackhammer *everywhere* on Earth. Everywhere, at all times. And because sound travels slower than light, if the sun were to go out it would take eight minutes for the light to stop but 13 years for the sound to stop. So life on a cold, dead Earth for 13 years and still hearing the jackhammer scream of our dead sun.",
   "created_utc": 1703373398,
   "score": 184,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keo8jx9",
   "message": "Swimming in freshwater could expose you to Naegleria fowleri — a brain eating amoeba** that is fatal 97% of the time, and is almost impossible to treat effectively.",
   "created_utc": 1703373730,
   "score": 36,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keo5alw",
   "message": "There are millions and billions of dollars in research into how to make people buy crap. The missus took a year of psychology and what they got the most research on is how to manipulate you and me into buying crap we don't need. Mental illness we know a little about. Making you want the new crap that you don't need? We know a helluva lot about how that works.",
   "created_utc": 1703372287,
   "score": 225,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoh20v",
   "message": "If you start showing any signs of rabies, you are going to die. Or at least in 99% of cases that happens.",
   "created_utc": 1703377541,
   "score": 2,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kenm5z5",
   "message": "Brain aneurysms can happen at any time, to anyone. No matter what age you are, or even how healthy you are, if you are currently alive, you have a chance of getting a brain aneurysm. When you do get one, there's a 50 % chance you'll just die immediately. Like, you'd be alive one minute, and then lying on the floor unconscious the next minute. Are the chances of actually getting a brain aneurysm at any random moment low? Yes, but it's still not 0.",
   "created_utc": 1703364223,
   "score": 228,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keobdgq",
   "message": "Take an Astronomy 101 course at your local community college.  People have no idea the amount of and variety of things that exist in space, that can and do happen, that would send us back to the Stone Age, or outright annihilate life on Earth.  I’m not talking asteroids, comets, and solar flares, everyone knows those, I’m talking supernovas, gamma ray bursts, wandering planets, wandering back holes, and more.  And none of it do we have any ounce of control over.  The good thing is the galaxy and universe are unbelievably large, so our chances of being affected by these things are, quite literally, astronomically low, but it ain’t zero.",
   "created_utc": 1703374997,
   "score": 32,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keobxm1",
   "message": "It is estimated that by 2050, more than 10 million people will die due to antimicrobial resistance.  Many people know, but nothing is done and it is terrifying.  Scary as fuck.",
   "created_utc": 1703375250,
   "score": 86,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kenzueo",
   "message": "The first contraceptive pill was never tested on women. They tested it on men instead.",
   "created_utc": 1703369975,
   "score": 245,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoao8o",
   "message": "**Prions.**\n\nI do not recommend researching. There is nothing to be done if you have prion disease.",
   "created_utc": 1703374680,
   "score": 40,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoy1bu",
   "message": "For me, it’s the perma frost scenario. The perma frost holds so much c02 (edit*** methane) that when it thaws it will just skyrocket our levels and there will be nothing we can do about it.",
   "created_utc": 1703385386,
   "score": 72,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoamea",
   "message": "I wanna know what they do in Antarctica with the windows and doors closed etc",
   "created_utc": 1703374658,
   "score": 120,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kep1teb",
   "message": "Why did I read this whilst knowing full well I have anxiety?",
   "created_utc": 1703387185,
   "score": 56,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoo74q",
   "message": "I'll let the others have the easy ones. \n\nThe inevitable displacement of Mexico City due to the abuse and lack of fresh water. It will be an international incident by their own making, displacing roughly 20 million people. Half of their utilities infrastructure is faulty and the current leadership has no viable way to repair and maintain their current system. It's not a matter of if, but when the system collapses. Normal groundwater reserve use is ten percent for any major city and only under dire circumstances should it be used at all. Mexico City uses almost half of their supply from groundwater reserves annually. Current projections show a complete collapse within 15 years.",
   "created_utc": 1703380806,
   "score": 43,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoh89g",
   "message": "Geiger counters used to be incredibly easy to make, but now it is extremely hard to find non-irradiated materials to use as a reference point to count off of.\n\nhttps://qz.com/emails/quartz-obsession/1849564217/low-background-metal-pure-unadulterated-treasure",
   "created_utc": 1703377619,
   "score": 226,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoqewk",
   "message": "This whole comment section has some scary shit but one thing seems to ring out around the horror. Just enjoy what we got while we got it cuz you might get run over or you might get shot",
   "created_utc": 1703381815,
   "score": 2,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kenki5w",
   "message": "Gamma Ray Bursts.\n\nIf ever one happens to be close enough and aimed exactly at Earth, we're basically all dead.",
   "created_utc": 1703363523,
   "score": 119,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keotzk5",
   "message": "In Yellowknife, NT Canada, there was a gold mine operating for 54 years, and a byproduct of that mining process was arsenic trioxide... 237,000 tonnes of it, enough to kill everything on the planet. They figured the best thing to do was to bury it in permafrost. The problem is, it's starting to get warmer, so they have to figure out what to do with it. It's not a secret. Just no one is talking about it.",
   "created_utc": 1703383462,
   "score": 202,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kep3fje",
   "message": "The scariest ones are the ones NOT in this thread... because the public doesn't know about them",
   "created_utc": 1703387971,
   "score": 134,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kepb0zv",
   "message": "This is a fun thread to read right before bed.",
   "created_utc": 1703391786,
   "score": 193,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keocbku",
   "message": "The worlds soil is running out of nitrogen pretty rapidly, and most farmland is essentially “zombie” farmland where it would be completely unusable without fertiliser, and if we ever run out of the minerals needed for fertiliser then we are rather screwed, and on top of that the nutritional value of most fruit and veg isn’t in a great state either there’s so much crop inbreeding, I mean one bad virus in the US could tank production of certain crops",
   "created_utc": 1703375422,
   "score": 23,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keounyd",
   "message": "Prions are virtually indestructible.\n\n\u0026amp;#x200B;\n\nEdit to add:  They can survive on dental tools even after being autoclaved.",
   "created_utc": 1703383781,
   "score": 112,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keopg4r",
   "message": "The chemical manufacturer that invented and produced Zyklon B (the gas used to murder groups of people at concentration camps in WWII) was called IG Farben, a subsidiary of BASF. BASF not only still exists but is also the largest producer of industrial chemicals in the world",
   "created_utc": 1703381371,
   "score": 179,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kepf4a9",
   "message": "Viruses stay with you forever and a lot flair up later in life to fuck you up.\n\nNo one knows if COVID will come back in already infected people as something worse",
   "created_utc": 1703394075,
   "score": 232,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keni3f5",
   "message": "Soil vitamins going bye bye and antibiotics not working anymore",
   "created_utc": 1703362500,
   "score": 107,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keohh1e",
   "message": "TIL: Ignorance is bliss.",
   "created_utc": 1703377730,
   "score": 108,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoelb3",
   "message": "Scientists were studying the effects of PFAS and realized the same thing as with microplastics. It’s so rampant that they couldn’t find a control group that did not have any in their blood.",
   "created_utc": 1703376437,
   "score": 72,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoeqb7",
   "message": "An Extinction Level asteroid could hit Earth with only a few days notice. Asteroids can appear very quickly from what appears to be nowhere. There is nothing we could do to prevent it from hitting.",
   "created_utc": 1703376498,
   "score": 235,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keolq96",
   "message": "The Earth doesn’t give two shits about us and our existence. We can do a lot to impact it but it will happily wipe us out of existence just like millions of living things before us and go on happily without us.  \nOur life and entire human history is a forgettable moment in Earth’s history.",
   "created_utc": 1703379674,
   "score": 230,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keocajz",
   "message": "There’s this concept called the False Vacuum Decay.\n\nBasically, ya know how an electron can orbit an atom (just roll with it)? And how it can orbit at a high state sometimes, then releases energy and drops to a low state? That low state is called the vacuum state. It’s the lowest state that a thing can be in, it’s the “default”. But there are some examples of a “false vacuum”. Basically, imagine a ball rolling down a hill. The false vacuum is a little valley it gets caught it. But it could still go lower.\n\nLong story short: for various reasons we are afraid one or more fields in our universe might be in a false vacuum state.\n\nIf that false vacuum were to collapse, which could happen randomly via quantum tunneling, or if we pump enough energy in an area, or through a dozen other theoretical mechanisms, then the universe as we know it goes bye-bye. Everything we know ceases to exist from that point into a bubble which expands at the speed of light. And within that bubble nothing we know can ever exist again. It’s not destruction, it’s erasure and change. Within the bubble, the laws of physics will be different. Chemistry might not exist. Biological life might not be possible.\n\nAnd we’ve done some experiments. Here are the results.\n\nhttps://en.m.wikipedia.org/wiki/File:Higgs_FalseVacuum2018.jpg\n\nThe circles are indications of how certain we are. We’re positive our universe exists in the bigger circle. We’re fairly sure in the smaller circles etc etc.\n\nThe yellow means we’re in a false vacuum. Green means we’re good. Red means “you fucked up the experiment.”\n\nSo long short: we’re fairly sure that we’re in said false vscuum",
   "created_utc": 1703375410,
   "score": 224,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keocfqx",
   "message": "A Gamma ray beam from a supernova 2billion light years away singed the top of our atmosphere about a month ago. The energy’s in the universe are mind blowing.",
   "created_utc": 1703375472,
   "score": 86,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "keoo8ym",
   "message": "There is about a 1 million year gap in which we know almost nothing about with almost no fossil evidence for that era. That’s enough time for beings to evolve, advance, and eventually die out.",
   "created_utc": 1703380829,
   "score": 8,
   "submission_id": "18pdbig"
  },
  {
   "comment_id": "kep0lwe",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18pdbig"
  }
 ]
}