{
 "submission_id": "18pe422",
 "title": "People who overcame depression, what is the single most important piece of advice to tell someone struggling with depression?",
 "selftext": "",
 "created_utc": 1703362837,
 "permalink": "/r/AskReddit/comments/18pe422/people_who_overcame_depression_what_is_the_single/",
 "score": 192,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pe422/people_who_overcame_depression_what_is_the_single/",
 "comments": [
  {
   "comment_id": "kenlyqi",
   "message": "Depression lies to you. Don’t listen to it. You are worth it, people do like you, and you can do it.",
   "created_utc": 1703364138,
   "score": 203,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenjvr5",
   "message": "You have to put in the work outside of therapy and meds. It’s a lifelong commitment.",
   "created_utc": 1703363258,
   "score": 86,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kennenp",
   "message": "Only way out is through. And you will get out. For me, the hardest part was forgiving myself. The second hardest was asking for help. When you can do both and give it time, you get through.",
   "created_utc": 1703364751,
   "score": 134,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenr2n5",
   "message": "I wouldn’t say I overcame depression but you need to learn to live with it and find someone to talk to. I’ve had chronic depression for over 25 years and was always looking for a “cure” in my 20s and had unrealistic expectations of what therapy was going to do for me.  \n\nI’ve accepted my mood baseline is at a 3 out of 10 instead of a 5, like it is for most people. I’m never going to be a motivated and ambitious person. I just try to do the few things I enjoy regularly and get of out situations that make me too miserable.  Getting outside once a day is key as well.",
   "created_utc": 1703366308,
   "score": 68,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenm4wp",
   "message": "If you need to rest, take a rest.",
   "created_utc": 1703364210,
   "score": 32,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenrusn",
   "message": "*What works for ONE person doesn't mean it'll work for everyone.*\n\nI went through severe depression years ago and I got the same regurgitated response from unhelpful sources. I'm willing to bet that people here have heard \"Go for a walk\" or \"Think happy instead\" or some obvious garbage that was thrown at them without thought. Back then, a lot of boys and men had to bottle it up and get told to man up if things weren't looking bad. I couldn't talk to my friends at the time because 90% of the time would result in you being called \"gay\" or a \"pussy\". So I bottled it up. That ate away from me on the inside and made it worse.\n\nOne day, It got to a point where I finally built the confidence to tell my teacher about having suicidal thoughts. Her response was to tell me how \"unmanly\" I was being and threatened to give me a detention. Ouch. Back then, mental health wasn't taken seriously, and I saw a lot of deaths throughout my teenage and young adult life.\n\nI was lucky enough to spot the issue. If the environment or people around are contributing negatively to your health. **Get away from them as soon as possible.** It is more important to enjoy your own company than to deal with the toxicity. This applies to later in life. Soon after, I was able to focus and break down these demons in my head. Get to work and shortly find a small group of friends whom I enjoy spending time with.",
   "created_utc": 1703366637,
   "score": 32,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenymhk",
   "message": "Mindfulness training. My depression was mostly based on anxious feelings about the past (stuff that already happened that I can't control). Moving my sense of life to the present moment helped. Lots of people aren't actually looking around at their life, they are seeing a projection based on their spiraling train of thought. Your problems don't need to go away, you need to go away from constantly dwelling on them.",
   "created_utc": 1703369461,
   "score": 27,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenln0f",
   "message": "For me, I know the things that help me get out of a depressive episode: exercising, eating well, doing hobbies I enjoy, seeing friends/family. It's hard when you're in one to convince yourself that anything will work or to even try. The biggest breakthrough I've had is to force myself to just do those things anyway, even if it feels pointless or hard.",
   "created_utc": 1703364002,
   "score": 51,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenrvi9",
   "message": "For most people suffering from depression you'll have bad times and good times.\n\n**Seek help during the good times.**\n\nI think so often, and I certainly was/am guilty of this, people have a depressive episode and when it subsides after starting to get help (or sometimes just through time) they go \"I've done it, I've fixed my depression\". That's not the case, that's like having an infection and not completing you course of antibiotics, you've fixed it for now, but it will come back until it's treated fully.\n\nThe good times are where you're going to be able to work through things in therapy and set up healthy defence mechanisms and warning signals against depression.",
   "created_utc": 1703366645,
   "score": 20,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenwhfe",
   "message": "Sometimes depression is part of how you are wired as a human. Take medical help and do self-care religiously. Accepting that you have depression is one major step to recovery.",
   "created_utc": 1703368564,
   "score": 19,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenk2ok",
   "message": "There is help out there and hope to get better and resources/people to help you.\n\nHowever they aren't gonna find you. You have to want to get better and actively seek it out. Depression can make that really hard though.\n\nHard to plan a medical treatment and therapy and stuff when you can hardly brush your hair and teeth or get out of bed.\n\nBut if you can, you will get better. Depression is an illness, and modern medicine is a wonderful thing in solving previously incurable problems especially with mental health.",
   "created_utc": 1703363343,
   "score": 50,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenyqpo",
   "message": "One day at a time. *This too shall pass.*",
   "created_utc": 1703369509,
   "score": 53,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenjuou",
   "message": "I'm still fighting it but it is different for each person; you're asking for advice in an online forum, fact check this with real professionals. For me\u0026lt;\u0026lt; it is the anecdotal evidence that the bad phases go away and the good phases make it all worth it. Not sure if I'll like listening to some shit like that in a couple of years though.",
   "created_utc": 1703363245,
   "score": 13,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kens9xx",
   "message": "Medication\n\nFor the love of all that is holy Medication\n\nThe first one you get might not work exactly,  nor the second, but you just continue until one of them or some combo of them works for you and fuuuck me the brain is saved.",
   "created_utc": 1703366814,
   "score": 13,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo7u45",
   "message": "Don’t drink alcohol. It may seem to help but it really makes it a lot worse.",
   "created_utc": 1703373415,
   "score": 15,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenki65",
   "message": "Don’t give up. Eventually you will find something that works. Be open minded, that something might be psilocybin.",
   "created_utc": 1703363523,
   "score": 11,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenln89",
   "message": "Not sure if it was full blown depression. But exercise and sunlight helped me a lot.",
   "created_utc": 1703364005,
   "score": 10,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenjrzj",
   "message": "Honestly? To tell people to go fuck themselves.",
   "created_utc": 1703363213,
   "score": 38,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenvhi5",
   "message": "I still struggle with it. But during a depression wave, all logical thoughts and tips are useless. The most important thing that you must do is HANG IN THERE, don't give in to whatever dark thoughts going through your sick brain. Cling to your sanity with all your might until the wave passes.",
   "created_utc": 1703368152,
   "score": 8,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenkimz",
   "message": "It never goes away. \n\nIt doesn’t get cured, you just learn to ride the waves. \n\nJust know that as much as there’s times where you feel like you’re drowning in feelings, there’s also times your head is going to be well above water.",
   "created_utc": 1703363529,
   "score": 25,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenqfaf",
   "message": "Don’t kill your self I tried to and I’m very grateful I failed it will get better",
   "created_utc": 1703366030,
   "score": 12,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kent09o",
   "message": "Don't give up. If a professional has given up on you it's because they are ignorant, not knowledgeable. Find a different professional. \"If the pills didn't work then maybe you don't need pills\", one doc said after I tried one kind. For me it was a combination of psychological therapy and the right pills. It did end up taking about 22 years but I got there. Unfortunately, going off the pills is a very bad idea but I'm okay with that.",
   "created_utc": 1703367122,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenxc8v",
   "message": "Do not waste more of your life fighting against taking meds. And advocate for yourself. Always. And do not stop trying to find the best medication for you until you find one that works (in conjunction with therapy, exercise, meditation, vitamins). The reason there are so many meds is because people respond differently and there are combos that can work wonders. Do not settle for half a life.",
   "created_utc": 1703368925,
   "score": 5,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo6aar",
   "message": "Therapy and  Psilocybin",
   "created_utc": 1703372724,
   "score": 4,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoel8d",
   "message": "Understanding that depression isn't logical is the best weapon against it.\n\nIf you have negative thoughts, write them down and review them after a week. If you have evidence to the contrary or none at all, then it's just untrue, intrusive thoughts from your \"emotional mind\" as opposed to logical thoughts from your \"rational mind.\"",
   "created_utc": 1703376436,
   "score": 5,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenjqi7",
   "message": "Be strong.  Find a good psychiatrist and do whatever he says.",
   "created_utc": 1703363196,
   "score": 11,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenvbro",
   "message": "\"We are going to die, and that makes us the lucky ones. Most people are never going to die because they are never going to be born. The potential people who could have been here in my place but who will in fact never see the light of day outnumber the sand grains of Arabia. Certainly those unborn ghosts include greater poets than Keats, scientists greater than Newton. We know this because the set of possible people allowed by our DNA so massively exceeds the set of actual people. In the teeth of these stupefying odds it is you and I, in our ordinariness, that are here.\" - Richard Dawkins\n\nMaybe for some people this quote is sad, but for me, I think it really encouraged depressed me to buck up and make the most of my life, regardless of the effort it took. Life is short, you only get one, you didn't exist before and you won't exist after. Why waste it",
   "created_utc": 1703368086,
   "score": 6,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenv9f2",
   "message": "Look up NLP. There’s free videos on how to do techniques. It’s easy to learn. Works quick, took me about 3 days to release a 20 year old traumatic memory.",
   "created_utc": 1703368059,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenzts8",
   "message": "it will get better. get a pet, something to care for to give you a tangible purpose",
   "created_utc": 1703369967,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo0dgp",
   "message": "I’m struggling with depression and recently got a job with great insurance and I’m going to be seeking out therapy. Can anyone give some tips for someone that is deathly afraid of sharing things to a stranger due to past experiences where people I’ve confided in either spread what I told them or I’ve overheard them talking about me.\n\nIt’s honestly my first time being able to afford therapy and I’m just scared. 🥺",
   "created_utc": 1703370199,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo1v07",
   "message": "Some days it will just feel like all the progress you thought you had made getting out of it just crumbles in front of you, try not to beat yourself too hard over it, and just make it trough the day. Better times will come",
   "created_utc": 1703370830,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo2ut1",
   "message": "Don’t isolate yourself. Though it feels like that’s what will feel better, it’ll be much worse if you’re not connected to people you love.",
   "created_utc": 1703371254,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo4m6g",
   "message": "Find a purpose. I still deal with depression, but having something that needs me or that I feel I need to do, keeps me going each day. Whether that purpose is family, a pet, your job, or a hobby, you need it to keep going. If you have none of that, it is so much harder to keep going. \n\nAnother big piece of advice is to force self improvement. I know that seems like bad advice because during depression that is the hardest thing in the world to do, but it really does help to dress up to the nines and see yourself well groomed. To exercise and see your body growing stronger. When I got into my deepest depression I started forcing myself to weightlift. At the beginning it was very hard just to do one exercise, but now I crave it. It gives me a rush to look in the mirror and see muscle definition and think, \"you did that. Your hard work is showing and you look good.\" Little things really do make all the difference.",
   "created_utc": 1703372000,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo7ric",
   "message": "Go see a pro, get some meds, do a CBT class. Getting help helps.",
   "created_utc": 1703373382,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo8np2",
   "message": "Therapy and meds.",
   "created_utc": 1703373775,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo8w94",
   "message": "I have some experience with mental health in a professional capacity.  Inpatients with severe depression are almost catatonic and have to be watched very carefully for reasons I won't go into.  I don't think there is much you can \"tell\" them as such, but I think being there for them and listening carefully if they do speak to you is about all the average person can do.  Treatment, therapy and advice is best left to the professionals here.\n\nFor those with suffering with mild depression or unhappiness - firstly validate their feelings and don't expect them to magically feel better.  Unhappiness and other negative mind states are unavoidable and are actually often quite necessary and useful.  They are a part of life after all and can sometimes provide motivation to make positive changes.\n\nNext, encourage good physical health, sleep, exercise, contact with the outdoors/nature, self care, finances if possible, relationships (especially friends and family) and purpose/meaning in life (work, study, hobbies, religion, helping others, volunteering, whatever).  Good mental health often follows from these.\n\nEstablish a routine and a system for keeping on top of tasks, even if it is just to achieve/complete one little thing each day (or whatever time frame works for you) - the results soon add up.\n\nAvoid becoming addicted to quick and easy dopamine fixes including social media, internet, video games, alcohol, junk food, drugs, spending, casual sex, porn, gambling etc.\n\nMedication can help to an extent but it is often not enough on its own and not always necessary in mild cases, especially those of recent onset.\n\nPractice CBT diligently, ideally with a therapist at first and keep doing the homework/thought diaries even if you feel better.  Don't expect it to always make you feel \"better\" though - that's not really the idea.  It's more about understanding your mind and coming to terms with the range of various thoughts, emotions and moods we all have and can't really avoid.  \n\nPractice mindfulness.\n\nIf you actually have physical symptoms of depression, e.g. loss of appetite, waking up earlier than usual, feeling slowed down etc., then it is probably more than mere unhappiness and this is probably a good time to speak to a doctor.  Depression is almost as much a physical illness as it is a mental one.\n\nFinally, report any thoughts of self-harm, harming others or suicide to a professional as soon as possible.",
   "created_utc": 1703373879,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keofpqb",
   "message": "You have to change how you think inside your head because your thoughts are your worst enemy.",
   "created_utc": 1703376941,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keofzzc",
   "message": "Meds help. Body and brain chemistry will become off over time.. take them",
   "created_utc": 1703377070,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keogaxa",
   "message": "Overcame… maybe not… but am feeling much better and my advice is: take the damn meds!",
   "created_utc": 1703377205,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepioza",
   "message": "Physical activity works wonders for mental health.",
   "created_utc": 1703396204,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepkumr",
   "message": "Do something. That paralysed feeling will keep you depressed. Finding something to get you out of the house, moving around, and engaged will get you out of your head.",
   "created_utc": 1703397567,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepo9ir",
   "message": "I had a post-it note above my work area that simply said,  \"You are not your thoughts.\" Which was more of a grounding reminder that bad or intrusive thoughts will happen, but I don't have to make them true. \n\nI'm unsure also where I saw it, but it was a person talking about depression and they basically said, \"Depression doesn't even have the balls to exist in the physical realm to kill me, so until it stops hiding in my brain like a coward I won't let it rule my life.\"",
   "created_utc": 1703399906,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepyymd",
   "message": "It’s like the terminator- “Ill be back”",
   "created_utc": 1703408160,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kent4sg",
   "message": "Talk about it with people you trust. Just saying outloud to someone you trust that you arent ok because of 'reasons' will make you feel heard and will make you feel like someone knows your pain and anguish.",
   "created_utc": 1703367174,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keny4jc",
   "message": "Things won't get better but one day you'll feel better, hang on and you'll get stronger. Don't live in the past and the future, it has happened, it will happen. Change isn't linear, keep your chin up, never bottle it up. \n\nPs. Do poetry, it helps. It doesn't need to rhyme. You just need to write it down. \n\n     I'm rooting for you:)",
   "created_utc": 1703369252,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo0k4v",
   "message": "You won't always feel this way.",
   "created_utc": 1703370276,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo1sm4",
   "message": "Diet. Diet diet diet. Ruling out potential physical causes.",
   "created_utc": 1703370800,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo2wbc",
   "message": "It doesn't ever go away. I've been depressed for a very long time, since I was a kid, and wasn't diagnosed until I was well into adulthood. It requires constant maintenance and awareness, along with putting in the work to help yourself. At the end of the day, you're the only person that can help yourself. It feels good in the moment to mope and beat yourself up, but you're just digging a deeper hole into profound despondence. \n\nTalk to a doctor, get the proper medication, and go out and do something, anything. It doesn't have to be big- you can do a load of laundry, clean your apartment, go for a short walk, write in your journal, whatever. Get outside and interact with the world around you, preferably in nature. It sounds corny but it'll reconnect and ground you to the real world. It may help to go no-contact with people for a while so you can clear your mind of distractions and negativity. Get your body moving and challenge yourself physically; getting your blood pressure up is good for you and it is stimulating. But when you've earned it, treat yourself to something nice and remind yourself that you are worth being alive.\n\nIt also helps to know that constant happiness is not possible, and that it's okay to be neutral or even unhappy on occasion. Life is generally dull and you're not always going to feel satisfied, but that's okay and it is completely normal. Don't let influencers, social media or your friends/family make you feel insecure and unworthy because you're not feeling constant bliss. That is all a facade sold to people so they constantly consume and reach a high that's unattainable.",
   "created_utc": 1703371272,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo526h",
   "message": "Sleep. Regular, good sleep.",
   "created_utc": 1703372184,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo54dq",
   "message": "You have to go against your nature. If you want to stay in, you need to get out",
   "created_utc": 1703372211,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo7r3s",
   "message": "Have *real and meaningful* internal dialogue, and stop trying to distract yourself from your own thoughts all day every day. As uncomfortable as it might be at first, your brain is NOT going to stop making you feel the way you do until you address the issues. \n\nWhen I say real and meaningful dialogue that means talking to yourself the way you might talk to a good friend in a similar situation. Don't just ask yourself surface questions. Follow up those questions with deeper ones. Really dig into exactly what's getting you down. Once you identify those issues, then you need to identify the steps you need to take in order to correct your situation, then start taking steps (they can be itty bitty baby steps if that's all you can get yourself to do) to change your situation. \n\nNote: There are plenty of people out there whose depression is a purely medical issue and should be treated as one, but I think the majority of depressed folks are depressed because of their circumstances. Not everything can be changed and fixed, but there are usually steps that can be taken (sometimes big, scary, but still necessary ones) to get your mental wellness back on track.",
   "created_utc": 1703373377,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo83r9",
   "message": "I pay close attention to my self talk. I can recognize when my mental chatter is getting noisy and chaotic, and that’s a warning sign that I need some help to pull out of it. I will let those closest to me know I’m having a rough go. They are patient and keep an eye out for me. I will reach out to my therapist and med lady to make sure we have all hands on deck.",
   "created_utc": 1703373535,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoad0h",
   "message": "Even though you dont want to.. make yourself go out.. get out of the house.. with friends if you can. Go to lunch, shopping, movies, even the grocery. You have to MAKE yourself do it. You will feel better when you get home. I feel better when I get up, take a shower, do my hair, makeup, dress nice..even to do things around the house. It is a lifelong thing. You may be exhausted, tired, all you want to do is sleep. You can get tired from too much sleep. Get up and get dressed.. in real clothes, not stretchy pants and a t shirt. You never overcome it, you learn to live with it, to deal with it better. I have been on so many different meds.. now I (58 F).. am finally feeling like what I remember my old self to be. I am on Trintellix and Prozac. I bowl in 3 leagues. I am retired bartender (30 years). I used to be the life of the party. Now I hardly leave my house. To bowl and grocery. I have even taken to having groceries delivered. The last couple months I have been falling into such a bad depression, I feel like I am drowning. Just this past week, I MADE myself go out. For context, my husband is in a nursing home with a terminal illness (ALS).. I have to make myself go see him. He cannot speak, he cannot move anything but his eyes. I have been living like this for 15 years. I took care of him at home until 5 years ago. I live alone. I have 2 daughters.. 37 and 34.. one lives out of state. I cannot even make myself do Christmas this year. But you have to take it a day at a time. I pray you find peace.",
   "created_utc": 1703374541,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoayta",
   "message": "Take your meds",
   "created_utc": 1703374813,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoazyh",
   "message": "Recovery doesnt occur in a straight line, its jagged.  There will be valleys along with peaks along the way.  When you have a setback, recognize it and then move on.",
   "created_utc": 1703374827,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keofml4",
   "message": "Overcoming depression?\n\nIt's just kinda something I live with, and I think I always will, to some degree.",
   "created_utc": 1703376902,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keojgbh",
   "message": "I’m overcoming it, today was a hard day that paralyzed me like always but I said nah.  Started little by little, cleaning and I ate.  Went running and now I’m getting ready to take my cats out and feel a bit better.  Like the other comments have said and I’m trying to burn it in into my brain, but we gotta put work into it.  Yes, it freezes you and traps you but don’t ignore it.  I try to figure out what I’m feeling and why and then move on from it.  Good luck fellow human.",
   "created_utc": 1703378632,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoki5o",
   "message": "I was a troubled kid because my dad was an alcoholic and I had responsibilities above my years. I lived in a pub as a kid with my dad a lot of the older barmaids were my female parental figure in my life. One barmaid told me something that has always stayed with me she told me that she had found one of her old diaries when moving out of her shared home with her ex husband (they were divorcing and splitting assets) she said \"I read my diary from when I was 15, I cannot believe what an unhappy teenager I was in my diary it made me think of how much I have achieved now and I cannot believe that I had forgot how troubled I was back then \" this resonated a cord with myself and I realised that things do get better. So keep a log of the bad days but log the good days too! Look back and remember.",
   "created_utc": 1703379109,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keomwtc",
   "message": "The realization that a different future version of myself is just as possible as the past and current versions and it's worth staying around to see what will unfold.  What can be learned or experienced? \n\nSet a small goal to help improve your mental and physical health, then a second and third, then never stop",
   "created_utc": 1703380217,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keon5sc",
   "message": "If you feel your self feeling this way, schedule a doctor's appointment. Can't speak for anyone but myself. When I told her about how I was feeling, it turned out to be a severe vitamin D deficiency. Took the dose recommended to get my levels back up and take them every so often. I no longer feel depressed quite the opposite. I feel like a people person again. It's strange.",
   "created_utc": 1703380331,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoobk5",
   "message": "I’m saying this from the perspective of somebody who experienced pretty severe and prolonged abuse as a child, so my struggle stemmed directly from my trauma. I suffered with rage, depression, and anxiety for most of my adult life until I realized that none of those feelings were mine— my parents were rage-filled, anxious, and depressed people who had no business being parents, and who took all of their unregulated emotions out on me. When I realized that I’ve been carrying around my parents’ negative emotions my entire life, a weight came off. I’m more myself than I’ve ever been. My real self is soft-spoken, gentle, and calm. Who we become as a result of other people’s unkindness is not the entire essence of who we are. We’re a lot more than that.",
   "created_utc": 1703380860,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoocir",
   "message": "I pulled myself out of depression by a combination: surround myself with positive people only, watch fun comedies only, stopped reading or watching news, listening to current music, walked, and most importantly got a divorce. Its like the sun came out. It’s really hard to see the light at the end of the tunnel when you feel trapped and miserable or at the mercy of others",
   "created_utc": 1703380872,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keop0kh",
   "message": "Don't give up if one medicine doesn't work.",
   "created_utc": 1703381175,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keopczb",
   "message": "That some depression can’t be “overcome” without medication and that’s not a personal failing or unwillingness to make needed changes. I find we use the word depression indiscriminately when there are different kinds. I have extremely severe, suicidal major depressive disorder. Even if things are going relatively well in my life, if I am unmedicated I become wildly unstable and suicidal. I’ve had friends recently talk about being “depressed” due to external circumstances like what’s going on in Gaza, living in crumbling, inefficient, abusive infrastructure of capitalism, witnessing a local mass shooting, etc. these can absolutely contribute to situation/contextual depression and feeling down. This is not the same as major depressive disorder. Don’t let people treat you like you’re being melodramatic or unwilling to “get a grip” if they think depression is just feeling sad about the world. MDD is deadly.",
   "created_utc": 1703381331,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keor2wd",
   "message": "I had a teacher in high school who told us that we might think things are never going to get better and the only way out would be to kill ourselves, but the truth is that the only way that things will ever have a chance to get better is if you’re actually alive. That stayed with me through so many bad times.",
   "created_utc": 1703382117,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keotgv1",
   "message": "I have to get outside and be in nature . That's what helps me tremendously",
   "created_utc": 1703383216,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoxeoz",
   "message": "I have drug resistant major depressive disorder, bpd and bipolar.  Therapy and shrooms have turned my life around.  Idk that it works for everyone but I'm 39, tried countless medications just to hit a wall a month or 2 in.  I feel so much better mentally than i ever have on anything prescribed. Still a lot of work to do but for once I'm actually hopeful.",
   "created_utc": 1703385086,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoxh5j",
   "message": "Really did deep to find the real source of the depression.\n\nAfter years of therapy and being diagnosed with major depression and general anxiety, I discovered that I actually have autism and ADHD. I've been pretending to be someone that I'm not for over 25 years and my depression was a combination of severe burnout and never being able to fit in anywhere.\n\nSince I've discovered the autism and ADHD within me I've been able to learn so much about myself and my depression is almost totally gone now.\nI'm still struggling in other ways, don't get me wrong, but because I understand where all of my feelings come from now I can cope with things so much better.\n\nIm not saying you're autistic or anything by the way, just really dig deep and learn about yourself! A big source of my problems is childhood trauma that has been repressed or downplayed as a minor struggle. After therapy I realise that the bullying and psychological manipulation and harassment I was subjected to was incredibly destructive and still haunts my subconscious mind almost a decade after it all stopped.",
   "created_utc": 1703385119,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoyvm2",
   "message": "Your brain is flat out lying lying to you. Read about cognitive distortions... how many of those can you identify with?",
   "created_utc": 1703385786,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kep3hhx",
   "message": "Speak to yourself kindly. Be your best friend. It’s fucking hard, but you can’t be happy if you’re constantly stuck with someone you hate. No one is going to take care of you in the way you need and deserve except yourself, give yourself what you deserve.",
   "created_utc": 1703387997,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kep3q7c",
   "message": "Depression is cruel in that it tricks you time wise— it turns off your ability to remember that you have felt differently and that it is likely you will feel differently in the future. It is all about the lie that this.is.it.\n\n\nIt’s not. It’s just not.",
   "created_utc": 1703388110,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kep5g87",
   "message": "If you're trying your hardest to overcome your depression and nothing is working, medication is absolutely a valid tool to help you deal with it.\n\nTherapy works for many people, but not all. It's OK to be one of those people that therapy isn't a viable tool to help with depression. You just gotta find what works for you and do that thing instead.\n\nI have chronic depression and my depression tool kit might not look like yours and yours probably doesn't look like mine, and that's OK. We all have different coping mechanisms and different skills when it comes to dealing with depression. Just because you handle yours differently than I handle mine doesn't make your methods of dealing with depression any less valid.\n\nDepression is a bitch. It may take a long time to make her go away or she might never go away, instead hanging around like a slutty angel on your shoulder who just wants to whisper assholish comments about you into your ear. Don't listen to her. She's a bitch and she lies like a rug.",
   "created_utc": 1703388948,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kep95kw",
   "message": "Most people won't understand your depression. They may understand depression, they may understand sadness, they may understand much worse depression then yours... its yours. its your battle to fight, you have lots of allies, but none of them understand what is in your head exactly. You need to find your own tools to fight it, and live with it.\n\n\u0026amp;#x200B;\n\nDon't ever listen to anyone that says \"they choose not to be depressed\" or \"I was depressed, I got out of it by being happy\". those people are assholes.\n\n\u0026amp;#x200B;\n\nThere are a lot of us out there that have it, please, don't be afraid to reach out",
   "created_utc": 1703390797,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepactj",
   "message": "This is probably overly niche for most people but here we go.\n\nLong story short I lost one of my parents when I was an early teen and never really knew how to process it fully. I struggled with depression and suicidal ideation for years. \n\nOnce I began college I started going to therapy and had one of the biggest yet upsetting breakthroughs.\n\nMy therapist pointed out that I had mentioned that since I had been struggling for so long that any improvement in my life felt uneasy and wrong. She asked me if I knew why I felt uncomfortable even considering that things could be different. I said I wasn't sure and then she hit me with it.\n\nShe asked if part of the reason I felt that way was because to feel better would seem like a betrayal to my Mom. Feeling bad had become synonymous with caring in my mind and that if I let myself feel any relief it meant I didn't care about her death. \n\nI didn't want to let go even though I knew my mom just wanted me to be happy.\n\nObviously, this wasn't an instant solution, but it helped me shift my mindset towards myself. I eventually began taking medicine to help and continued with therapy until this past February. I'm not \"cured\" and likely never will be. But, I have gained insight and learned how to treat myself with more kindness.\n\nFor anyone struggling, please know that it gets better (even though it sounds cheesey and you feel like you're the exception) it gets better.",
   "created_utc": 1703391427,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepah7i",
   "message": "Get medication.\n\nNo one thinks talking to cancer will cure it.\n\nNo one things talking to diabetes will cure it.\n\nMedical depression is a potentially lethal condition, and medication can be an extremely effective item in a treatment plan.",
   "created_utc": 1703391492,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepgu7j",
   "message": "Depression doesn't stop. You learn to live with it and create methods to combat it. It's a part of your life.",
   "created_utc": 1703395088,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kephk9c",
   "message": "Ignore all the bullshit and keep pressing forward. The depression lies. It lies big and it lies a lot. Just press forward.",
   "created_utc": 1703395517,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kephzgf",
   "message": "Talk to your doctor.",
   "created_utc": 1703395774,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepiz2a",
   "message": "Hello. Your friendly neighborhood mood disorder support group facilitator here. Depression isn’t something that can be overcome in a one size fits all approach. That’s actually a harmful viewpoint. Love and attention won’t fix a chemical imbalance, string of unfortunate events, run-ins with institutions, or poverty. What does help are these things:\n\n-a set routine to follow no matter what\n\n-good sleep hygiene \n\n-solid support system with multiple prongs. Family, friends, schoolmates, counselors, support groups, etc. \n\n-seeking professional help or using free/community services \n\n-be open to new ideas to get out of the depressive episode",
   "created_utc": 1703396376,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepj4gm",
   "message": "That being kind to yourself is the first step.",
   "created_utc": 1703396470,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepjawu",
   "message": "It’s okay to lose yourself in your thoughts. It’s good to feel all of you emotions sometimes instead of suppressing them.",
   "created_utc": 1703396583,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepjq21",
   "message": "You are the only one who can fix yourself. This is not to say don’t ask for help, absolutely do ask for help, but also don’t just sit around waiting for someone to fix your brain for you. Get up, invest in therapy, or start journaling or doing art or writing poetry or just venting to someone. Don’t sit and rot, waiting for health to fall into your lap, because it won’t. And don’t make it worse for yourself. Do affirming words instead of saying “omg I hate myself” all the time. Don’t say “im gonna kms”, your brain manifests the things you say. (There’s actual science behind that, look into it.)\n \nOnto normal, everyday survival tips: If you have trouble keeping your room clean, keep a giant black trash bag in your room. It’s ugly to look at, but it’s low maintenance and only needs to be taken out about once every six months. Also, it’s much less ugly to look at than that giant pile of trash next to your overfilled bin. If you have trouble remembering to drink water, get a disposable Gatorade bottle and refill it with water. (You’ll have to get a new one about once every four months because you can’t really clean them, so find a gatorade you like. Personally, I get the cucumber lime one.) Open your windows, and don’t leave the lights off, it’s making it worse. Try your best to keep your body active. Get up, go to the kitchen, and sit in the kitchen and eat while listening to music. Better yet- go outside and sit outside, sometimes vitamin d actually helps. Dont let your body physically rot. \n \nDo as much physical activity as you can sustainably do without burning yourself out. If that’s just a walk or standing up for five minutes every day, that’s better than nothing. Also, personal hygiene really helps sometimes. Take a shower. Change your clothes. Wash your sheets. Brush your hair.  (I know the teeth thing can get really overwhelming because you only have one pair and because enamel doesn’t grow back, but it’s true- try to save yourself the debt and at least do mouthwash every night. I know you got used to your mouth tasting bad but it’ll really help.) Or ask for help doing these things, have a friend sit with you and talk with you. If they’re good friends, they’ll be willing to do that. Go out. Even if you know you don’t want to, go out. Sit at a cafe and be around people, even if you’re not doing anything. \n \nStretching before bed was one of the first habits I picked up, and I’d suggest that as a starting point. It gave me a bit of of an energy boost the morning after.(But also, I have a disability that makes me more tense, so it’s possible that I got that evergy boost just cuz I’m treating it, so it might not help you.) \n\nMost importantly, You don’t have to do all of these at once. This is a list of all of the little things I’ve collected and incorporated into my routine over a year and a half to keep my wellbeing up. These are the things I would incorporate into my life if I could redo 2020. Trying to bring these all into your life overnight will only stress you out more and make your life worse, and you probably won’t get anything out of them. Pick and choose the ones that are right for you.",
   "created_utc": 1703396846,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepnc3j",
   "message": "Your physical, mental, and emotional health are the most important things. If people don't like you and you're just being you (and you didn't do anything to offens anyone), you need to find new people to hang out with.",
   "created_utc": 1703399249,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepns66",
   "message": "make choices that DON’T make you feel shame. Every situation, every time. Choose to do what you know is right. Going against your personal moral code makes depression SOOOO much worse",
   "created_utc": 1703399566,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepobmw",
   "message": "Exercise",
   "created_utc": 1703399948,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepotrh",
   "message": "If you’re prescribed antidepressants and start to feel better, like much, much better. Like euphoric good, you might actually have bipolar disorder and not only depression. The people around you might be so focused on you improving that they fail to see the beginnings of mania",
   "created_utc": 1703400299,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepoxba",
   "message": "hurting yourself isn’t worth the pain and addiction it causes you.",
   "created_utc": 1703400369,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepvgvw",
   "message": "Plenty of people just live with depression. For some, you don't overcome it. You manage it like a chronic illness. I've had it since I was at least 11, I'm approaching 40.\n\nIf you try the /r/thanksimcured advice and it doesn't work, THAT IS OKAY. Chronic clinical depression is an illness without a cure. \n\nNo amount of sunlight, exercise, or fresh air is going to cure my **chronic clinical mental illness** and I cannot express the amount of rage I feel when I see that kind of advice shoved down people's throats like it's a magic cure-all snake oil trying to make people feel like a failure when it doesn't work. \n\nIt's okay to take medication to manage it. \n\nIt's okay if the first few you try don't work for you. Don't give up. There is a huge variety of medications to try. \n\nIt's okay to have a mental illness. You wouldn't feel ashamed for getting cancer. A disease is a disease, invisible or not. \n\nYou do not need a \"reason\" to have depression. You have an illness. You are human.",
   "created_utc": 1703405300,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepx5tb",
   "message": "Your best memories may be in the future, hang in there",
   "created_utc": 1703406671,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepyeus",
   "message": "Sleep and socializing is critical. Don’t force change yourself anything, but rather look for ways to change your environment if possible. And then work on yourself is easier if support and healthy surroundings exist.",
   "created_utc": 1703407702,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenl57n",
   "message": "Exercise is the most important thing you can do.",
   "created_utc": 1703363793,
   "score": 6,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo9mwm",
   "message": "I'm not sure people actually overcome depression. You learn to manage it.",
   "created_utc": 1703374216,
   "score": 5,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keocek3",
   "message": "Open your eyes and start appreciating and admiring the world around you. There is always something good in your day, you just have to find is.\nCould be as wonderful as seeing or hearing a bird. Watch a flower. See a butterfly. Enjoy rain hitting your face.\nAppreciate nature and you will always have a highlight in your day. Appreciate the small things in live.",
   "created_utc": 1703375458,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keogarj",
   "message": "Get money\n\nIt helps, sorry",
   "created_utc": 1703377203,
   "score": 2,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenv65a",
   "message": " If someone says they overcame depression, then they didn't have depression. It's a lifelong illness. \n\n Far as someone struggling with it, all you can do is face it head on and fight.\n \n Get up when all your body wants is sleep.\n\n Try to be busy in a productive way, like cleaning the house, instead of watching tv. \n\n Little things like that and ride it out because as bad and as low as you feel, it will pass if you keep on keeping on.",
   "created_utc": 1703368021,
   "score": 3,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenuj2g",
   "message": "Echoing what u/Anom8675309 said: exercise and diet. Check out Dr. Chris Palmer and his studies on how diet and exercise are critical in fighting mental illness. I was on 300mg bupropion and I follows his practice. Changed my life and my depression is completely in remission. \n\n[https://www.chrispalmermd.com](https://www.chrispalmermd.com)",
   "created_utc": 1703367751,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo2ntn",
   "message": "It will never truly go away or be “cured.” You will have times you feel really good and that you’ve slain your demons, but then you trip up and you feel like you’re in the pit again. Always remember that there’s always a way out, and that you can get back up no matter how deep you think you’ve fallen. Our greatest adversary is always our own mind, try to look at it from the outside perspective so that you realize everything isn’t as hopeless as we tell ourselves it is.",
   "created_utc": 1703371171,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kepiqpa",
   "message": "Get your dick wet as often as possible. I'm serious",
   "created_utc": 1703396232,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenkb9t",
   "message": "Depression is repressed anger and you need to express anger.  Get off booze 🥃 with a support group near the front of the phone book, and a lot of symptoms will clear up.",
   "created_utc": 1703363442,
   "score": 255,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenm98a",
   "message": "Take your meds!",
   "created_utc": 1703364261,
   "score": 255,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenofrm",
   "message": "Go to a doctor!!!!!!",
   "created_utc": 1703365188,
   "score": 254,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo2q0e",
   "message": "Get outside everyday for most the day. Work outside and do some hard labor. Most importantly get sun in your temples.",
   "created_utc": 1703371197,
   "score": 0,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo3fg1",
   "message": "Exercise!",
   "created_utc": 1703371499,
   "score": 0,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo62bs",
   "message": "You don’t have to always feel this way. Here’s what I did…..",
   "created_utc": 1703372626,
   "score": 0,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo80rh",
   "message": "Take a hit of a spliff or two for a brain reset if you find your depression is triggered through anxiety.\n\nIt won't cure, but it will give you a chance to rationalise yourself.",
   "created_utc": 1703373498,
   "score": 0,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoe4jt",
   "message": "Okay you need to get multiple hours of walking a day\n\nEveryday\n\nStart with at least two if it's not working go to three\n\nExercise can modulate the neurochemicals\n\nMost people who need an antidepressant wouldn't need one if they just walked an excessive amount\n\nIt's going to be very hard to get started at first find anyone who can force you to do it for 3 weeks That's how long you will need to spend on it to make it happen",
   "created_utc": 1703376227,
   "score": 0,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo948i",
   "message": "Liquor always help",
   "created_utc": 1703373980,
   "score": 253,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kennnkf",
   "message": "Go for walks, nature if possible. Start lifting and or running. Cook for yourself and eat healthy. Try to sleep 8-9 hours a night\n\nBuilding these habits will help a lot, but sometimes it's deeply chemical and you need meds for a while",
   "created_utc": 1703364856,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kenzt67",
   "message": "Start small. \n\nGo for a walk. Make a list of things that make you happy. Watch your comfort show. Drive to the ocean. Do a craft. Stretch. Get your hair done. Anything to occupy your mind and make you feel even the slightest bit better. \n\nI promise you, it gets better.",
   "created_utc": 1703369961,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo03yb",
   "message": "There is help, there is a light at the end of the tunnel and there is hope.",
   "created_utc": 1703370088,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo2zsn",
   "message": "Get help. If one form of therapy isn’t working, don’t give up. Keep searching.  Stay connected to people who love you any way you can, no matter how difficult, because they really do care.",
   "created_utc": 1703371313,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo30i9",
   "message": "Depression is a lie. It's a film over your eyes that changes the way you see the world. You can take the film off with therapy, medication, and (often) lifestyle changes.",
   "created_utc": 1703371321,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo367n",
   "message": "My way out was doing something once a day I had been ignoring. Sometimes just once a week if I could not face that day. I eventually was embracing that it made me better by not delaying what needed to be done. I was happyish and finally FELT SOMETHING BETTER!",
   "created_utc": 1703371389,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo3hiv",
   "message": "Be sure to get your vitamin levels checked for any deficiencies. I had severe depression for several years that caused me to take disability leave from work for 3 months and the only thing that made a little dent was heavy duty antipsychotics. \n\nThen I got some blood work done and found out I was deficient in B12 and folate. I started taking supplements for those (in methylated form) and my depression just vanished.  I feel like I wasted so much time suffering for something that should have been easy to diagnose.",
   "created_utc": 1703371524,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo5a7f",
   "message": " Just ensure that u still like/love this person and you won’t let it go. That’s what I would loved to hear during my depression episode.",
   "created_utc": 1703372282,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo6iea",
   "message": "first step is to realize depression is a defense mechanism, your mind is telling you something is wrong, find what that is",
   "created_utc": 1703372822,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo7it3",
   "message": "In addition to therapy and meds, prioritize exercise and eating healthy and developing hobbies.",
   "created_utc": 1703373276,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo7s84",
   "message": "Didn’t exactly overcome depression, but what helped me is giving myself goals. Depression lies to you and the pain is unbearable at times, but pushing yourself to make one little step a day helps. Doesn’t need to be a huge step, but you need to keep trying every day.",
   "created_utc": 1703373391,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo7ti4",
   "message": "You need to realize it’s not your fault.",
   "created_utc": 1703373407,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo9335",
   "message": "Routines are important. Mine always got worse when I got out of my normal routine. Also, it’s hard, but stay active \\ exercise.  Medication was also a lifesaver for me.",
   "created_utc": 1703373965,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo98px",
   "message": "Love yourself enough to keep up with life and do the best for yourself.\n\nDon't get tricked with the victim mentality depression inserts on us, do not follow the distorted ideas of depression. \n\n\u0026amp;#x200B;\n\nAlways believe in yourself that you can get out of it.\n\nI have been depressed ever since I knew myself, have been through traumatizing life events, have a personality disorder, but managed to get out of the hole of depression when I focused on doing the best for my own sake and enjoying the little moments. \n\nWe are here anyways, let's live life to its fullest!",
   "created_utc": 1703374036,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo9dib",
   "message": "When we hit our lowest point, we are open to the greatest change.",
   "created_utc": 1703374097,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keo9fax",
   "message": "Find the right therapist for you. A bad one can make your depression worse.",
   "created_utc": 1703374120,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoaod9",
   "message": "I quit being a piece of shit hiding things and lying. Went to therapy and faced my problems head on. So I guess therapy is my number one suggestion because I know not everyone’s depressed because they’re a piece of shit.",
   "created_utc": 1703374682,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoc1sn",
   "message": "Be active, remember that thoughts affect feelings which affect your actions/behaviour, don’t control your emotions instead manage them. Deal with your problems, if you need to cut people off do it if you need to get rich work on that, remember to not be tough on yourself; treat yourself the way you would treat a friend who’s down(for most people that means being empathetic and compassionate). Drugs are okay just try to keep it in moderation, and don’t tell people or friends about the drugs u do. Psychiatric meds can help sometimes but remember to listen to your feelings if something doesn’t feel right you’re most likely right. Most popular substances are not good for depression that includes cannabis, alcohol and cigarettes, they also drain your wallet. Create a life worth living for you, it might take time and remember that life’s not fair so be grateful for the little things and celebrate the big wins and dance on em haters like u do on top of cop cars",
   "created_utc": 1703375302,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keod02z",
   "message": "Do the small things and believe its only a season.\n\n\nSmall things:\nWork out\nGo out\nMove \nCall friends\nTell your support system you need them\nSee a doctor\nTake those medications\nEat good food\nEnjoy the food\nCelebrate the achievements",
   "created_utc": 1703375724,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keod123",
   "message": "Don't let that bitch win.",
   "created_utc": 1703375737,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keodbgn",
   "message": "It's okay to ask for help.",
   "created_utc": 1703375866,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keodi77",
   "message": "Learning to accept myself with all my flaws including the depression and just knowing that’s part of me but not all of me.  And that it’s not my fault. But it is my fault if I do nothing.  Sounds a lot easier than it is- have to have lots of self awareness, and that may take time.",
   "created_utc": 1703375950,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoe0kq",
   "message": "TMS.  Google it. Look it up on YouTube. It works. Many insurances pay for it.",
   "created_utc": 1703376176,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoe75c",
   "message": "Waking up hurts. Waking up takes time. Waking up is a lot of work catching up on everything you let slide. Waking up sucks. Sometimes it feels like everything is actually getting worse. Try to keep going. Sometimes you won't be able to and will have to start all over again. That sucks too, but it's okay.   \n\n\nIt's not a light switch, it's not just \"all better\" one day.",
   "created_utc": 1703376260,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoeby6",
   "message": "This too shall pass",
   "created_utc": 1703376320,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoisql",
   "message": "You **have** to get out your bed to get better.",
   "created_utc": 1703378331,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keojv6y",
   "message": "You have to really put the effort in and try. It’s a deep hole but you have to force yourself out of it. Journaling, therapy, social interactions, healthy eating, exercise, getting out in nature - each of those are small aspects that can contribute to a whole. \n\nDay by day that will get easier.",
   "created_utc": 1703378817,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keok7c1",
   "message": "You need to accept that life isn't fair and it isn't a competition. You can't compare yourself to others. You are on your own journey.",
   "created_utc": 1703378971,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keolfh5",
   "message": "High intensity cardio for 25-35 minutes, 3-4x times per week, is a cure.",
   "created_utc": 1703379536,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keollde",
   "message": "Discipline is stronger than will power or motivation. If you can find it in you to become disciplined in your daily chores and day to day life you’ll find it easier to stay on top of all the things that give you anxiety. \n\nIt’s not about wanting or feeling like doing those little activities that bring you satisfaction and peace of mind. It’s about doing them no matter how you feel so that you don’t get overwhelmed by a mountain of work.",
   "created_utc": 1703379612,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keolq5y",
   "message": "exercise !!!!!",
   "created_utc": 1703379673,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keomz0s",
   "message": "You can't do it without help. Medication and counseling are important",
   "created_utc": 1703380244,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoo44h",
   "message": "One day at a time.",
   "created_utc": 1703380769,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "keoodkf",
   "message": "Deal with what's causing the depression in a proactive way. Go get a better job, go get the body you want, go tell people they hurt you, or apologize to those you've hurt. It won't go away on its own, fix what's breaking you.",
   "created_utc": 1703380885,
   "score": 1,
   "submission_id": "18pe422"
  },
  {
   "comment_id": "kep259a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18pe422"
  }
 ]
}