{
 "submission_id": "18pe32v",
 "title": "What are you slowly losing interest in as you grow older?",
 "selftext": "",
 "created_utc": 1703362765,
 "permalink": "/r/AskReddit/comments/18pe32v/what_are_you_slowly_losing_interest_in_as_you/",
 "score": 65,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pe32v/what_are_you_slowly_losing_interest_in_as_you/",
 "comments": [
  {
   "comment_id": "keo5i3u",
   "message": "The idea that I “should” be doing this and that because my peers are. Comparison is the thief of joy",
   "created_utc": 1703372379,
   "score": 110,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo60kw",
   "message": "General celebrity culture. I just can’t bring myself to care what they ate/wore/did/bought anymore.",
   "created_utc": 1703372605,
   "score": 228,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenp6bf",
   "message": "My patience for slow internet. I used to watch pixels load like it was modern art. Now, if a page takes more than two seconds, I'm convinced my Wi-Fi is plotting against me.",
   "created_utc": 1703365502,
   "score": 37,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenn1sf",
   "message": "Sleeping in uncomfortable places. You want to go stay at this hotel and I'll take the futon? Nope. Nope to neck and back pain.",
   "created_utc": 1703364600,
   "score": 171,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kens29t",
   "message": "Fake people, staged lives on social media, surface level connections and conversations. Actually, quickly losing interest",
   "created_utc": 1703366724,
   "score": 59,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kentgwr",
   "message": "With the skyrocketing prices, substandard food from restaurants.  I hate disappointing myself paying $60 worth of garbage food.  So i always end up cooking my own.  Am i the best cook? Heck no but at least I don’t pay someone my hard earned money for something i can do better",
   "created_utc": 1703367315,
   "score": 114,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenlozz",
   "message": "Any kind of petty squabbling.  My ex felt I was being a pushover for not picking a fight over every petty little thing. You want the knives to be in a different arrangement in the drawer? Aight, sure thing. Rearrange the towels any way you like. Oh, I accidentally sat in your spot and you want it? Very well, have it.\n\nNone of these tiny little things mean anything. Life is short, and we're all going to die. I do not have the energy to pick a fight over things I ultimately do not care about, but people constantly seem to feel that it's being a pushover to not stand up for yourself about issues that literally do not matter.\n\nI put my foot down when things matter. But I will never, ever give a fuck about if someone took the last of the milk in the fridge, or drank the soda I was saving. If those are things that matter to other people I will respect that, but tiny, insignificant little things like this just don't ruffle my feathers. \n\n\n\nI just want to be calm and cozy and doing the hobbies that bring me joy. The older I get, the less energy I have for pointless squabbles.",
   "created_utc": 1703364025,
   "score": 98,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenkkhn",
   "message": "Spending time with family who don’t have any interest in maintaining a relationship.",
   "created_utc": 1703363551,
   "score": 147,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenp898",
   "message": "Pleasing people.",
   "created_utc": 1703365525,
   "score": 243,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keno65d",
   "message": "The idea that I will become rich someday.. Nothing in m'y current career and situation tends to this possibility.",
   "created_utc": 1703365077,
   "score": 224,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenztp0",
   "message": "Being a striver at work.  I'm nearing retirement age and I'm tired.  Over the last year I've started easing off of being the most helpful, busiest, highest producer and have fallen more into answering questions and guiding my younger co-workers.  They are GOOD at what they do, they have many more years and far more energy than me.\n\nNot to say I'm not doing my job - I am still clicking all the boxes daily.  I just let other people strive now and I have no competition left in me.",
   "created_utc": 1703369966,
   "score": 16,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenr5j7",
   "message": "Being cool.  The older you get the fewer fucks you have to give about whether anybody else appreciates the same stuff you do or not.",
   "created_utc": 1703366342,
   "score": 115,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenpryb",
   "message": "Video games. It's getting harder and harder for me to find new games I like playing. I just end up replaying old games again.",
   "created_utc": 1703365755,
   "score": 94,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenyj1c",
   "message": "Debating. I fucking loved to debate about any and everything when I was young. Now that I'm in my 30s, I like a good discussion but if someone is completely opposed to me, I just let it go. What's the point? I'm almost certainly not going to convince them of anything.",
   "created_utc": 1703369421,
   "score": 82,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenqj4a",
   "message": "Other people's opinions",
   "created_utc": 1703366075,
   "score": 232,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenkhd1",
   "message": "Thinking I can enlighten the ignorant.",
   "created_utc": 1703363514,
   "score": 141,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kens55p",
   "message": "Literally everything. \n\nI used to be a very bold person. Now, I pick my battles wisely. Sometimes, I don't pick any battle at all. \n\nLive and let live.",
   "created_utc": 1703366757,
   "score": 138,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenpl63",
   "message": "Branded stuff! I don’t give a fuck about the brand, just give me something that works and will last",
   "created_utc": 1703365676,
   "score": 241,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenn1kp",
   "message": "Giving a fuck",
   "created_utc": 1703364598,
   "score": 5,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenz00r",
   "message": "Dating. They say there are plenty of fish in the sea. You know what else there is plenty of in the sea? Trash. Lots of trash.\n\nTrying to date feels like a 2nd job or having multiple job interviews. I get tired of getting random d*ck pics, getting ghosted, or having a guy just wanting to smash. (I state from the beginning that we aren't having sex, I'm not doing one night stands, and I'm not gonna be your friend with benefits.) Yet they still try to push it. It is annoying and exhausting. \n\nLike, being single and dying alone with a bunch of cats isn't the threat people think it is. Lol",
   "created_utc": 1703369618,
   "score": 224,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keoax11",
   "message": "Going to stores to shop. Going to festivals. Just going to events in particular. The mental energy it takes these days have me always tired. I enjoy staying at home, with my coffee, blanket, and something to read.",
   "created_utc": 1703374791,
   "score": 118,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenq8r9",
   "message": "Getting up early to go to work. Also working.",
   "created_utc": 1703365953,
   "score": 82,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenudmm",
   "message": "Eating at restaurants. It used to be our only form of entertainment. It's gotten expensive and I've gotten better at cooking.",
   "created_utc": 1703367689,
   "score": 25,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenj59z",
   "message": "Hanging out with people",
   "created_utc": 1703362945,
   "score": 182,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenv80m",
   "message": "New music. I kept up with it right up until my mid 40s. Now I just listen to all the music from the 80s/90s/2000s. I never understood why my parents listened to the same old shit when I was younger, but now I get it.",
   "created_utc": 1703368043,
   "score": 160,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenixn6",
   "message": "Gossiping",
   "created_utc": 1703362855,
   "score": 222,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenqmrd",
   "message": "Gossip\n\nDrama\n\nWorrying about what other people think of me\n\nShopping for clothes",
   "created_utc": 1703366118,
   "score": 65,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenk7p6",
   "message": "Stupid people that are basically self important chimps with no idea about reality",
   "created_utc": 1703363401,
   "score": 253,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenygwo",
   "message": "Drinking alcohol.",
   "created_utc": 1703369396,
   "score": 197,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenxge5",
   "message": "Giving a F*** about things I can't control.",
   "created_utc": 1703368974,
   "score": 57,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo7d21",
   "message": "Growing older, I don't care about seeking constant approval.\n\nNow, I prioritize authenticity, personal growth, and meaningful connections, valuing depth over superficial validation.",
   "created_utc": 1703373204,
   "score": 63,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kense35",
   "message": "Travel. I travelled lots in my 20s and 30s. But it has worn me down. \n\nI no longer have the interest that I used to in visiting new places. I still love learning about different places and cultures, but the act of travel itself has worn me out. The stress that comes with organizing trips, the hassles with airlines, the massive queues at airports and having to sit on a cramped plane simply takes a huge chunk of the enjoyment of travel away. \n\nThe idea of a holiday is to experience relaxation, not increased anxiety.",
   "created_utc": 1703366863,
   "score": 2,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kennhjf",
   "message": "Life",
   "created_utc": 1703364784,
   "score": 228,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenxtb9",
   "message": "Lifting heavy weights. I'd rather lift lighter for more reps these days. Been using more machines rather than barbells, too.",
   "created_utc": 1703369124,
   "score": 57,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo1cw3",
   "message": "Bad bosses.\n\nI'm just so sick and tired of working under insecure arrogant manchildren who couldn't pour water out of a boot if the instructions were on the heel, who can't actually communicate with others, who think that showing you something one time counts as 'training' and then get upset when you're not perfect at your job, and who don't actually bother to ask why you act the way you do.\n\nI've had too many jobs where employers claim I'm not 'showing initiative' when they barely train me, blatently ignore me when I try and ask them something, and place me at a station where I'm left by myself to do whatever that task is.\n\nBtw, one of these jobs was working in the staff cafeteria at a hospital. Like yeah Jeff, what a brilliant idea! I should just touch things that I don't know how to work. And they're always like 'Oh you can just ask me if you don't know.' but in reality if you do, either they ignore you, send you in an infinite loop of 'Go ask that person' or they're very clearly busy with something else. \n\nI do not understand what kind of mental gymnastics you have to do to think that you'd rather have someone touching things they don't know how to work, and potentially hurting themselves and fucking up the entire shift for that day, than to have someone who doesn't do that.",
   "created_utc": 1703370610,
   "score": 59,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenwk7e",
   "message": "Relationships/friendships with negative people. We all have bad days, but if all someone does is complain, they need to figure their life out.",
   "created_utc": 1703368597,
   "score": 155,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenpry3",
   "message": "The holidays. I’m over it. There’s too much expectations, even when you’re struggling financially, people still expect crap; not to mention, it’s constantly in your face, and holidays also means mass crowds of people. I wish they didn’t exist.",
   "created_utc": 1703365755,
   "score": 94,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenuce7",
   "message": "I've lost interest in being angry with my parents.\n\nAnd, mind you, **I am not saying I changed my mind about them*. My parents were truly shitty people, throughout my life, and still are in many ways even if siblings tell me they've gotten better. \n\nI had every right to be mad. I had every right to cut them out because I was *t i r e d* of trying to repair a relationship while swallowing down the anger and resentment.\n\nI just... I don't like to be angry anymore. It doesn't fuel me, it makes me weary. There are only so many times I can get angry at the past.",
   "created_utc": 1703367674,
   "score": 36,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenwa46",
   "message": "Taking any kind of shit from anyone.",
   "created_utc": 1703368479,
   "score": 44,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenk2tu",
   "message": "Personal drama",
   "created_utc": 1703363345,
   "score": 207,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo13am",
   "message": "Shaving my legs in the wintertime.",
   "created_utc": 1703370498,
   "score": 82,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenrjxu",
   "message": "Validation from everyone. Ima just do me cuz in the end, it won’t matter.",
   "created_utc": 1703366511,
   "score": 44,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenwc19",
   "message": "The news (and politics in particular). I’m becoming more and more apathetic as I age.",
   "created_utc": 1703368502,
   "score": 179,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenlwk0",
   "message": "Finding solutions and giving feedback.",
   "created_utc": 1703364113,
   "score": 144,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kentq4d",
   "message": "Basically everything. But since it's almost Christmas i will say I'm not into the holidays anymore that's for sure. My grandparents and dad are dead, I don't have children or a lot of money, i don't need junk, my mom and sister clash and make family stuff hostile at times, plus my sister goes too over the top with gifts and then is disappointed with what she gets even if it's exactly what she asked for, I never know wtf to get for my in laws and I just don't care about anything. I haven't really even watched any Christmas movies this year. Stresses me out and i just want it over with.",
   "created_utc": 1703367421,
   "score": 76,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo42sc",
   "message": "Material possessions. I have stuff I need. It’s fine. I don’t feel the need for constant shopping or upgrading.",
   "created_utc": 1703371773,
   "score": 107,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo2l8a",
   "message": "The world around me I just have no time for idiots and and negativity in general.\n\nI sound like old hippie when I read that.",
   "created_utc": 1703371141,
   "score": 37,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo5x26",
   "message": "Making people happy.\n\nI have a limited amount of time and energy. I have kids and family and friends that I love. They get priority.\n\nIs my aunt upset I’m not coming to Thanksgiving this year? Too bad. Is that old acquaintance frustrated that I’m not making myself available to help her again? I’m sorry to hear that.\n \nSure I’m all for random acts of kindness and the like, but I’m no longer available to spread myself so thin I’m transparent.",
   "created_utc": 1703372562,
   "score": 128,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo8eze",
   "message": "Religion.  Like....I don't care.  I had one.  I don't anymore.  No I don't want to hear about yours.  No I don't want to explain my beliefs.  No I am not hating on you by saying I don't want to discuss. Just so fucking done with everything religion.",
   "created_utc": 1703373671,
   "score": 132,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenpicf",
   "message": "Strangely, but I almost stopped listening to music\nWas a big fan of different genres in the past",
   "created_utc": 1703365642,
   "score": 67,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenth30",
   "message": "Stupid people who can't help themselves.",
   "created_utc": 1703367317,
   "score": 70,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo3yab",
   "message": "Going to concerts. I used to love live music but the expense is insane now and the overall experience such a hassle which rarely meets expectations.",
   "created_utc": 1703371721,
   "score": 74,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo9kvu",
   "message": "Honestly..... having friends\n\nI'm in my early 40's and for the longest time it depressed me that I didn't have a circle of friends or even long term friends\n\nI've found that the older I get, the less I care. I've got a wife who I adore and four children who fill my heart. Why care about anything outside that?",
   "created_utc": 1703374191,
   "score": 17,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenq62t",
   "message": "Pretending to give a crap about stuff I couldn't care less about.",
   "created_utc": 1703365922,
   "score": 95,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenwisj",
   "message": "Relationship advice from anyone younger than 30",
   "created_utc": 1703368580,
   "score": 93,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenlrxt",
   "message": "Sports.  Seems like a ridiculous waste of time now.  I was an avid college basketball fan.",
   "created_utc": 1703364059,
   "score": 43,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo0bfb",
   "message": "I’m only 24 but I’m seriously done with alcohol. It used to be quite the habit ever since I was around 16. I haven’t partaken in that or cannabis for almost 6 months and my mental clarity has never been better. The high of being sober (with the help of cold showers 😖) is amazing. \n\nI only wish everyone could try these methods and see how it works for them! Alcoholism has run rampant in my family for generations so I hope to prevent it now.",
   "created_utc": 1703370175,
   "score": 105,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenwtjj",
   "message": "Massive CGI blow stuff up summer blockbusters.  Particularly with large transforming robots.",
   "created_utc": 1703368706,
   "score": 74,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenmiqs",
   "message": "Going to the movies....",
   "created_utc": 1703364374,
   "score": 249,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenqymv",
   "message": "Christmas. I have children so I do it for them but If I didn’t have children I would definitely not celebrate it.",
   "created_utc": 1703366260,
   "score": 96,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenvabb",
   "message": "Professional sports. I'm bored with grown adults pushing almost $1 billion to play a game. I'm tired of hearing about Ohtani. I'm tired of people saying LeBron is the GOAT because he wiped his nose. I'm tired of the NFL and the psychotic over analysis of every single play from multiple angles. I still like college football but even that is getting to me with signing days, five stars, transfer portals and the such.",
   "created_utc": 1703368070,
   "score": 116,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenx47v",
   "message": "Cinema. It’s just so bland these days and what we’re once subtle messages and metaphors are just full blown in your face and comes across as self righteous. I couldn’t even tell you the last movie I saw in theaters, I went from easily going 2-3x a month to going 2-3x in the last 5 years.",
   "created_utc": 1703368830,
   "score": 26,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo1gmu",
   "message": "I thought my answer was depressing til I saw the others. I’m just really content hanging with my dog, watching Friends (or whatever else) and being unbothered. I enjoy seeing friends and catching up but I’m not as interested in having plans every weekend. I’ve grown to enjoy my own company",
   "created_utc": 1703370655,
   "score": 24,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kentd4r",
   "message": "People who ask questions online and get offended when someone who has life experience answers. If you are offended either you got caught insulting something or someone or you just want assurances that you are not wrong.",
   "created_utc": 1703367272,
   "score": 75,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenqsbi",
   "message": "Politics. I don’t have it in me to get that outraged anymore. I vote how I’ll vote, I donate to the candidates and causes I support, and that’s that.",
   "created_utc": 1703366185,
   "score": 65,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenwgp0",
   "message": "Dating. What’s the point of getting dressed up and going out if it’s very likely it’s another liar, catfish, and/or looks like they just rolled out of bed. If on the off chance they aren’t any of those things, they have the personality/social skills of a brick wall.",
   "created_utc": 1703368555,
   "score": 66,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenirxg",
   "message": "Video Games",
   "created_utc": 1703362789,
   "score": 88,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenn0ks",
   "message": "TV.",
   "created_utc": 1703364586,
   "score": 63,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keno106",
   "message": "Sex",
   "created_utc": 1703365017,
   "score": 155,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "kenojke",
   "message": "Over indulging in French fries. I love French fries.",
   "created_utc": 1703365233,
   "score": 24,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keo67dj",
   "message": "Giving a damn. I've tried to be considerate of everyone, but I've hit a point that if I'm not shown consideration, then forget it",
   "created_utc": 1703372688,
   "score": 21,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keoawym",
   "message": "Christmas…I don’t want to do all the things… burned out",
   "created_utc": 1703374790,
   "score": 22,
   "submission_id": "18pe32v"
  },
  {
   "comment_id": "keu9hwd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18pe32v"
  }
 ]
}