{
 "submission_id": "18pfqmy",
 "title": "What's the most absurd thing you've ever done just to get free Wi-Fi?",
 "selftext": "",
 "created_utc": 1703367532,
 "permalink": "/r/AskReddit/comments/18pfqmy/whats_the_most_absurd_thing_youve_ever_done_just/",
 "score": 107,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pfqmy/whats_the_most_absurd_thing_youve_ever_done_just/",
 "comments": [
  {
   "comment_id": "kenyzvy",
   "message": "Not free WiFi, but a free connection to Internet via Bluetooth.  I used to work very close to an AT\u0026amp;T store.  They sold iPhones and I had an iPod touch.  I would go to the store, set one of their iPhones to share Internet via BT, then connect my iPod touch to it.  Not the fastest Internet by far, but usable.",
   "created_utc": 1703369616,
   "score": 82,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenxbbk",
   "message": "I was living in my car for a while and I camped in a Lowe's parking lot to use their free wifi.",
   "created_utc": 1703368915,
   "score": 61,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo06jr",
   "message": "Procrastinated setting up WiFi after I moved as one of my neighbours had BT internet (which provides a free WiFi hotspot to any other BT customers), so I’d join that with my mum’s details. The neighbour would occasionally turn it off for a while though, and if so, I would have to stand outside the bank on my street downloading stuff to Netflix.\n\nProudest free WiFi was figuring out a supermarket had made their private WiFi password “admin123” after a lucky guess. They didn’t have a customer WiFi option so I felt like a VIP not having to use a spotty 4G connection.",
   "created_utc": 1703370119,
   "score": 24,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenyo1x",
   "message": "i lived in my van before cell phones were able to do web stuff but at the time when coffee shops had free wifi. i had certain spots, usually behind the buildings where they left the wifi on at night after they closed. i would park for the night and use the wifi and when i went to sleep, i would torrent if the wifi was fast enough.",
   "created_utc": 1703369479,
   "score": 11,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo3kpv",
   "message": "Back when Pokemon Go was starting up, I only had wifi on a borrowed iPhone and would walk the neighborhood connecting to open WiFi but I needed one house to reach a Dratini nest. So I took my cable modem down to their house and acted like I had no service and wanted to see what their modem looked like for comparison. I snapped a picture of their label, thanked them and grabbed some things to evolve.",
   "created_utc": 1703371562,
   "score": 10,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo0tnd",
   "message": "It happened behind a dumpster at Wendy’s and I would rather not talk about it ☠️",
   "created_utc": 1703370385,
   "score": 19,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenvs85",
   "message": "Signed into an open public WiFi network without a password or probably any security.",
   "created_utc": 1703368277,
   "score": 15,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo64u5",
   "message": "2007. Poor student. No internet at our flat.\n\nCracked the neighbours WEP encrypted wifi, created a second hidden network with better encryption, and changed their router password so that they wouldn't find out",
   "created_utc": 1703372657,
   "score": 7,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo0tb6",
   "message": "I built a *c*antenna out of a Pringles can with a wifi receiver and aimed it at the library down the road.",
   "created_utc": 1703370381,
   "score": 15,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo7woj",
   "message": "When I was getting clean from heroin back in 2008/2009, I lived in a halfway house for 6 months.  We were allowed to have laptops and cell phones, but there was no WiFi connection.  After discovering this most unfortunate turn of events (how was I going to check MySpace and download MP3s for my Ipod Nano?!), I also discovered that in my bedroom, if I had my computer at a certain position near the head of my bed, I could connect to some random \"Apple Network\" with a string of random characters in the SSID.  It was unsecured but would vary between no signal and, at certain times of the day, up to 3/5 bars.  \n\nI would position my laptop in a way, set uTorrent to download movies, music etc. before heading out for the day or going to sleep at night. For the whole 6 months I was there, it remained unsecured and accessible.   The funny thing was, I could almost never find a signal anywhere else in the place except at that location on my bed.  Sometimes, the universe just looks out for you.",
   "created_utc": 1703373447,
   "score": 6,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenud71",
   "message": "looked around the post its for a password",
   "created_utc": 1703367684,
   "score": 9,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo0qnq",
   "message": "put in a fake email address to get past the access control screen.",
   "created_utc": 1703370351,
   "score": 4,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo2l06",
   "message": "Lived across the street from a McDonald's, so I set up a cheap router, flashed DD-WRT on it to set it up as a repeater.\n\nIt worked pretty decent for the 10 months we were in that street-side apartment. I only had issues when there was a bit more vehicle traffic than usual. It was just a little slower, but still worked. Then we moved to the other end of the building and I didn't have line-of-sight anymore.",
   "created_utc": 1703371138,
   "score": 3,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keohm2s",
   "message": "Offering to work overtime so I could use the office WiFi",
   "created_utc": 1703377794,
   "score": 4,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenv2nq",
   "message": "I ate McDonalds",
   "created_utc": 1703367980,
   "score": 8,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo3mx8",
   "message": "I used to live beside a dominoes pizza and would have to reconnect every 30 minutes of complimentary wifi lol… did this for a year",
   "created_utc": 1703371588,
   "score": 3,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keofobi",
   "message": "Bought a dish antenna, and connected to an open network across a river. This was around 2007.",
   "created_utc": 1703376923,
   "score": 4,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keofum1",
   "message": "I've used local hospitals as I traveled around. Sit in the parking lot, do my thing and leave.",
   "created_utc": 1703377002,
   "score": 3,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keoirhb",
   "message": "I used to haul a 50+ lb. eMac into my local McDonalds to use their wifi when I was young and broke with no internet connection at home. The looks people would give me were pretty amusing.",
   "created_utc": 1703378315,
   "score": 4,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keoitm2",
   "message": "In New York they have these things called LinkNYC that have free WiFi. They are on the street all of their place.\n\nI was staying in an Airbnb that didn’t have WiFi and wanted WiFi for my phone, but couldn’t get a signal. I put my laptop next to the window so it could get the WiFi from the street below, and then connected my phone to the laptop to get WiFi in the room.\n\nSo basically a made an impromptu relay to get WiFi in an NYC apartment.",
   "created_utc": 1703378342,
   "score": 3,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keolj0r",
   "message": "Power went out one night, which meant internet was gone.\n\nI drove down to the local IHOP and sat there for a couple hours on my laptop browsing reddit while waiting for power to come back online. I think I only bought a drink, which made my tip at the time something like 300%.",
   "created_utc": 1703379582,
   "score": 3,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo6xku",
   "message": "Landlords refused to give me a router or internet hookup so I found the neighbors phone number, called them and said their internet usage was up by 200% and I could come to inspect their modem. Never tried pretending I was their ISP, but definitely  didn't say I was their neighbor. Went the next day to inspect their modem, took photos of the password, told them I'd change their settings from the office and left. Used their WIFI for about a year while I lived in that crappy trailer.\n\nWas it scummy? yeah. Illegal? probably. But did it save me thousands of dollars in phone data usage? absolutely.",
   "created_utc": 1703373008,
   "score": 5,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo12ay",
   "message": "I would sit sideways on the couch with my laptop in the bay window because that's the only place where it would connect to my neighbor's wifi.",
   "created_utc": 1703370486,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo64ss",
   "message": "I sat in an empty storm drain next to a house with open wi-fi in Australia. I was loving on a campsite and had to pay for a mobile wi-fi dongle. Ran out of data so I snuck next to the house and proceeded to get eaten alive by sandflies while using the internet.",
   "created_utc": 1703372657,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo7cun",
   "message": "Learned how to hack Wi-Fi.",
   "created_utc": 1703373201,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo9ni0",
   "message": "Used to connect some gadget I bought online to the cable going into the back of the TVs in hotels which gave me free WiFi so I didn't need to pay for it.  Most hotels now give free WiFi so not used it in ages.",
   "created_utc": 1703374224,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keog5fh",
   "message": "Tried a random password just for fun and actually got it right",
   "created_utc": 1703377138,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keognbh",
   "message": "I ordered a drink at Starbucks.",
   "created_utc": 1703377358,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keoiu8f",
   "message": "Bought a 25 foot hdmi cable so I could set my laptop up against the wall next to my neighbors apartment and still watch Netflix on my tv.\n\nIt was crazy, but even 5 feet away from that wall and the signal dropped to zero, but right up against the wall it was almost full signal.",
   "created_utc": 1703378350,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keoj6ua",
   "message": "I use my neighbour's signal, with his authority, of course and the two pubs I drink in have free wi-fi, so happy days.",
   "created_utc": 1703378511,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keojh5d",
   "message": "A startup I know got their first office over a coffee shop, so they could leech off their wi-fi. Gotta save money wherever you can when you are just getting started!\n\nFast forward 15 years, they are now a 100+ Billion dollar company. I think they can afford their own wi-fi now.",
   "created_utc": 1703378643,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keom3ec",
   "message": "No Internet but I had a wifi receiver. It worked great with a 20ft USB extension, I ran it out into the front yard through a window.",
   "created_utc": 1703379842,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keom77i",
   "message": "Sign up for Xfinity public Hotspots with a new email address to get the free 1 hour WiFi for testing it.",
   "created_utc": 1703379891,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keozqit",
   "message": "Bought a kitchen strainer and used it to create a directional antenna for my wifi dongle on a 20 foot USB extender. \n\nI pointed that towards the “clubhouse” of my apartment complex about 500 feet away.\n\nIt was functional enough to stream video.",
   "created_utc": 1703386196,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo3vda",
   "message": "Played Cones of Dunshire",
   "created_utc": 1703371687,
   "score": 3,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keob2jv",
   "message": "Paid for it",
   "created_utc": 1703374861,
   "score": 3,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenz422",
   "message": "2016 I was van life-ing kind of before it was the Instagram influencer thing to do. Was very poor and taught myself to hack basic WPA networks and trolled through neighborhoods at night to find a place to park and get some work done or watch movies.",
   "created_utc": 1703369665,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo0cuv",
   "message": "Buy a coffee from Starbucks - it was an emergency really had no choice!",
   "created_utc": 1703370191,
   "score": 2,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenuotb",
   "message": "🍆😮",
   "created_utc": 1703367818,
   "score": 255,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kenwvzr",
   "message": "I have 5G like a normal person.",
   "created_utc": 1703368735,
   "score": 248,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo2mf3",
   "message": "Walked half a mile in a blizzard because my power and internet were down. Friends house still had it all.",
   "created_utc": 1703371154,
   "score": 0,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo1l3o",
   "message": "Drove to the library O.O",
   "created_utc": 1703370709,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo4efc",
   "message": "The absolute worst free WiFi is at Burger King. It is slow as death and disconnects constantly. I despise Burger King food, it tastes like kerosene. But ya gotta do what ya gotta do sometimes... 🤢",
   "created_utc": 1703371909,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo4kzx",
   "message": "Butt stuff.",
   "created_utc": 1703371986,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keo563c",
   "message": "Wardrove around slowly looking for open WiFi, then returned to an insurance place after hours and sat in their parking lot. \n\n2000 or so.",
   "created_utc": 1703372232,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keogiab",
   "message": "In the days before free WiFi I walked to the public library every couple days to use their computers. Carried a USB stick which I had to plug into the back of those computers by crawling under the desk in order to transfer files.",
   "created_utc": 1703377296,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keon005",
   "message": "Remember when you had to service the glory-hole at Starbucks for two hours of wifi?",
   "created_utc": 1703380256,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keoqsjd",
   "message": "We were broke when i was like 17  and there was a newly  constructed  cul-de-sac  i used go there after midnight  I would  use empty  houses  outside  power to power my laptop  then spend 2 hours most every night  to download  shows for un protected  networksfor me and my siblings. IT was cold and wet but we had watch every movie  in the house  5 plus times had to be done.",
   "created_utc": 1703381986,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keoriio",
   "message": "My first roommate really loved his dirty videos.\n\nUnfortunately we did not have internet service at our house at the time (or any of the time he lived there for that matter). \n\nFORTUNATELY for him, this was back in the golden age of streaming. A magical time when you could start a video and then pause it and it would completely buffer in the background. Now do that 25 times and you're set!\n\nI was actually impressed by his ritual. I asked him where he was going to access the internet and the answer killed me. This guy had been parking outside the public library just in range of the wifi and surfing the dirty waves  in his car.\n\nBetter than going inside I guess",
   "created_utc": 1703382312,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "keosazw",
   "message": "Went and got a job as a wireless network engineer.",
   "created_utc": 1703382678,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep0kgy",
   "message": "Knocked on neighboring doors at my Airbnb apartment offering a bottle of wine for their WiFi password",
   "created_utc": 1703386588,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep28ge",
   "message": "I was in university in the late 90’s which provided free Wi-Fi to all the students. Great if you lived near campus, but I had a sweet studio by myself about 2.5 miles down the hill. Too cheap to get cable internet, (I still didn’t even have a cellphone) so I made an awesome cantenna out of an old gooseneck lamp base and a big ass soup can. Pointed it toward the school and got pretty decent Wi-Fi. \n\nI honestly don’t know why I didn’t shell out some money for cable internet at the time, my rent was only $250/month. Just being a cheap ass I guess.",
   "created_utc": 1703387391,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep2a34",
   "message": "Sat in the gutter outside a petrol/gas station to use their wifi.\n\nThis was the other month, when one of Australia’s biggest phone networks went down and so many of us were without internet/phone signal",
   "created_utc": 1703387413,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep4e6d",
   "message": "I use to smoke meth and sit outside an urgent care just to watch pornography.",
   "created_utc": 1703388432,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep4qwx",
   "message": "Parked next to a VW dealership after hours to download whatever via their open WiFi because I had exceeded my monthly home internet quota. \n\nIt was kind of pathetic but my ISP didn’t have a home (non commercial) plan to satisfy my data consumption at the time, which would be considered anemic by today’s standard",
   "created_utc": 1703388606,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep4t2p",
   "message": "Horny teenager me.. I worked 3rd shift at a Wendy’s in Monteagle TN. I would get off at 2-3 in the morning. I would drive home through the University of The South Sewanee campus. I would park at there library and download so much porn off of there free WiFi. I would do it so much campus police would just park next to me and we would hang out. I was a horny broke teenager!",
   "created_utc": 1703388636,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep5t5q",
   "message": "I was living in my car for a while and I camped in a Lowe's parking lot to use their free wifi.",
   "created_utc": 1703389116,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep7n7x",
   "message": "Sucked off a hobo",
   "created_utc": 1703390030,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep7nc0",
   "message": "Years ago I discovered most university WiFi have two-tier accesses, one for guest and one for student/staff. The guest one is throttled. But then I quickly realised the student one doesn't require login verification as long as the student login is different every session, which I made a python script that generate randomized legit usernames and passwords that allows me to torrent nearly unlimited bandwidth through SSH over VPN. The SSH-over-VPN is an other fun throttle bypassing method.",
   "created_utc": 1703390031,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep8pkh",
   "message": "When college roommates were too deadbeat to pay the bill, I realized a neighbor had unlocked Wi-Fi. I needed to have my laptop essentially in a window to connect but it got me through the rest of the year before I moved out.",
   "created_utc": 1703390569,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kep9mc9",
   "message": "I recently moved to my brother's property out in the country and my garbage cellular 5g won't stream my iptv.  My brother has absurdly fast 5g cable internet, but I am about 100 yards from his router. So I got 2 wifi extenders and ran a bunch of extension cords and set it up. Getting the extenders and the router to all talk to each other was a major pain and I had to adjust the spacing of everything several times to get it right (5g range is trash) but I finally persevered and I can now enjoy my iptv in all of its glory. The only problem is now everyrime I have to mow the lawn I have to take it all apart and then put it back together again. How far would you go for iptv? Lol",
   "created_utc": 1703391038,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kepabx1",
   "message": "Back in the early 2000s my wife and I used to sit in the parking lot of a hotel and steal wifi for business purposes. The cops pulled up saying the manager called, thinking I was a John and she was a prostitute. We told her why we were there and he looked in and saw us both with laptops and just laughed. He told the manager who said we could sit there as long as we wanted.",
   "created_utc": 1703391414,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kepc7ix",
   "message": "Parked outside a McDonald's to download stuff.",
   "created_utc": 1703392437,
   "score": 1,
   "submission_id": "18pfqmy"
  },
  {
   "comment_id": "kepc8ey",
   "message": "Sat in the woods across the street from a house down the road with a laptop for a year to play a game. They had insane range and very good wifi. Could go back in the woods pretty far. One time it was down pouring I still went down there and sat by their mailbox with a jacket over my head and the laptop draped and several people stopped to ask if I was okay to be met with “yeah I’m just playing a game”. The owner did eventually figure it out and would bring me snacks nice old lady. Got wifi eventually tho they finally ditched the dial up lmao",
   "created_utc": 1703392451,
   "score": 1,
   "submission_id": "18pfqmy"
  }
 ]
}