{
 "submission_id": "18phvdz",
 "title": "What is denied by everyone but is actually 100% real?",
 "selftext": "",
 "created_utc": 1703373893,
 "permalink": "/r/AskReddit/comments/18phvdz/what_is_denied_by_everyone_but_is_actually_100/",
 "score": 69,
 "url": "https://www.reddit.com/r/AskReddit/comments/18phvdz/what_is_denied_by_everyone_but_is_actually_100/",
 "comments": [
  {
   "comment_id": "kep5yah",
   "message": "93% of children who were molested were molested by someone they personally know and trust, not stranger danger",
   "created_utc": 1703389184,
   "score": 233,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kepfcnh",
   "message": "You can do absolutely everything right and still fail.",
   "created_utc": 1703394211,
   "score": 231,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kepdg51",
   "message": "\"It can't get any worse\"\n\nIt can ALWAYS get worse.",
   "created_utc": 1703393131,
   "score": 169,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keosmg7",
   "message": "Most evil powerful people are actively supported and encouraged by everyday 'good' people.",
   "created_utc": 1703382823,
   "score": 73,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keov6qn",
   "message": "Just how real family dysfunction is in many cases. Soo many people just turn a blind eye to it.",
   "created_utc": 1703384032,
   "score": 46,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kepbucn",
   "message": "Your mental and/or physical health could shit the bed at random. You could do everything right, and it may not matter. Things like cancer don't discriminate.\n\nNot saying you shouldn't take care of yourself, just that sometimes it isn't fair.\n\nEdit: got a lot of people saying nobody denies this. Lots of people do. I did. I was diagnosed with GERD 2 years ago, and then had vertigo from sep 2022 for about a year which I still get spells of and no doctor can tell me why. My anxiety went through the roof to the point I went from being \"basically fine\" to needing my medication in order to not genuinely consider a permanent solution.\n\nIt can happen. It sucks and you've gotta put an optimistic spin on it to stay sane, I swear, but it can happen.\n\nEdit 2: yall I'm fine I don't need the suicide helpline 😭😭",
   "created_utc": 1703392233,
   "score": 199,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keo9bf2",
   "message": "If it is happening to someone else, it CAN happen to you",
   "created_utc": 1703374070,
   "score": 217,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keo9a8c",
   "message": "Parents having a favorite child",
   "created_utc": 1703374054,
   "score": 213,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keohq0k",
   "message": "double standards in almost everything",
   "created_utc": 1703377843,
   "score": 216,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keop581",
   "message": "The worst thing you can imagine happening to you can happen to you. One deer is in the way and now I’ve lost the person I love the most. It can happen. No matter how bad. It can happen to you.",
   "created_utc": 1703381231,
   "score": 137,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kep3hf8",
   "message": "That their job is secure and they'll never be let go. I made it through multiple layoffs including during the pandemic only to be laid off last week. Thankfully I had already updated my resume and had started looking, but no job is ever 100% secure no matter what.",
   "created_utc": 1703387996,
   "score": 50,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keonxz0",
   "message": "Rampant physical and medical abuse in mental health facilities",
   "created_utc": 1703380692,
   "score": 132,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kep2b6t",
   "message": "You don’t have to be a bad person to end up in prison.",
   "created_utc": 1703387428,
   "score": 224,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kepgp75",
   "message": "Americans already pool money for healthcare, they just do it through a wholly unnecessary, greedy middleman that grossly jacks up the price and denies care",
   "created_utc": 1703395006,
   "score": 156,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kepgnvp",
   "message": "Sometimes your teacher actually does hate you, regardless of what your parents say.",
   "created_utc": 1703394984,
   "score": 150,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keowfvd",
   "message": "Exercise and drinking water really does help mental health I fear",
   "created_utc": 1703384628,
   "score": 27,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keopugm",
   "message": "We are not the main character. Everyone has similar shit going on. Everyone has their own challenges and don't even know you exist. The world doesn't revolve around you. You're a tiny blip in existence.",
   "created_utc": 1703381554,
   "score": 52,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keo99ya",
   "message": "\"Money doesn't buy happiness\" Watch me leave IKEA full of joy with a 100cm plush shark",
   "created_utc": 1703374051,
   "score": 95,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keoorph",
   "message": "People tend to treat you based on fuckability/attractiveness. They like to say they don’t but it’s simply not true.",
   "created_utc": 1703381060,
   "score": 36,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keo9zii",
   "message": "Aging - it's not a disease, it's not faulty, and despite (lucky or unlucky) attempts to evade, it's still going to happen.",
   "created_utc": 1703374373,
   "score": 201,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keoj9oe",
   "message": "Everything fades.",
   "created_utc": 1703378547,
   "score": 224,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keofk8d",
   "message": "They actually do put stuff in the water that makes the frogs gay. Ok, technically it's not making them gay, it's making them hermaphrodites\n\nIt's a pestizide called atrazine",
   "created_utc": 1703376873,
   "score": 195,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keojeuh",
   "message": "The full impact of pretty privilege. Being overweight as a woman or being short or balding as a man don’t just impact your dating chances, they impact your treatment in the workplace, how strangers react to you, “random acts of kindness” by others, even dumb shit like the niceties you get checking out at the grocery store. \n\n\nAnd it’s also incredibly sensitive. I’m thin but can see a difference in how others treat me within a range of 5-7 pounds. It’s maddening.",
   "created_utc": 1703378613,
   "score": 48,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keorpr5",
   "message": "You are never as smart as you think you are.",
   "created_utc": 1703382405,
   "score": 145,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keomt00",
   "message": "That they pick their nose and pee in the shower",
   "created_utc": 1703380168,
   "score": 115,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keolccs",
   "message": "This sub is just an endless repeat of the same questions.",
   "created_utc": 1703379495,
   "score": 228,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keorkqc",
   "message": "Cynicism *feels* way smarter than it actually is",
   "created_utc": 1703382339,
   "score": 54,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kep7biy",
   "message": "Other people can have an experience that you don't understand.\n\nYou having felt sad once doesn't mean you understand what it's like to be depressed. Your occasional knee pain doesn't mean you understand my rheumatoid arthritis. You having had Covid-19 doesn't mean you know what I experienced when I had Covid-19.\n\nHave enough humility to recognize the limits of your own experience.",
   "created_utc": 1703389867,
   "score": 112,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keonbyn",
   "message": "Death's a 'comin'.  Slow and steady or quick n sudden, but one way or another,  it lands at our doorstep.  Most of us live as if we're above it or it won't happen to us.",
   "created_utc": 1703380410,
   "score": 169,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keopmda",
   "message": "Marijuana addiction is a thing",
   "created_utc": 1703381450,
   "score": 223,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keoq15y",
   "message": "I'm convinced a significant percentage of parents regret having kids at all. And they might not even admit it to their partners.",
   "created_utc": 1703381640,
   "score": 230,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keok5ji",
   "message": "The negative effects of alcohol not on the individual but on the societal level. Just look up Fetal Alcohol Spectrum Disorder ( https://en.wikipedia.org/wiki/Fetal_alcohol_spectrum_disorder ), think of traits you don't like in people and go compare...",
   "created_utc": 1703378948,
   "score": 16,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kep0xp0",
   "message": "Getting angry with other drivers when roads are crowded and you complain about all the traffic. \nYOU are the traffic.",
   "created_utc": 1703386765,
   "score": 230,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kep028t",
   "message": "Most people live in a made up fantasy world where they are the main character\n\nEdit- This is not bad. It can, however, be limiting and damaging to believe one’s own subjective experience and reality is the same experience and reality of anyone/everyone else-especially when forced upon others.",
   "created_utc": 1703386349,
   "score": 228,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keouzqx",
   "message": "Everyone is susceptible to depression. \n\nIt doesn’t matter how happy you are, or how insensitive/ dismissive you are of people who have/ had it. It could get you too.",
   "created_utc": 1703383939,
   "score": 239,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kep1zd2",
   "message": "The majority of poor people are poor due to things that aren't their fault.",
   "created_utc": 1703387266,
   "score": 202,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keokwkf",
   "message": "Under the water, the fish don’t stink.",
   "created_utc": 1703379290,
   "score": 183,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keof0wl",
   "message": "That there are no dumb questions",
   "created_utc": 1703376629,
   "score": 181,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keoy4mv",
   "message": "Caffeine addiction is the largest drug addiction in the world",
   "created_utc": 1703385429,
   "score": 204,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kepdkkt",
   "message": "Going through 9 months of an uneventful pregnancy only to find out their heartbeat stopped out of nowhere. You're not always guaranteed to have a healthy baby.",
   "created_utc": 1703393201,
   "score": 33,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "kepj2z7",
   "message": "There's a percentage of society who is irredeemable and no amount of Disney magic will actually ever make them see the error of their ways so you're not going to get any satisfaction out of trying to burn those people because that would require them to act or think in ways that don't directly benefit them and their brains will not allow that to happen. ALL you will ever get is pure frustration for yourself. This is why every psychologist in America, when you ask them how to deal with a narcissist, will tell you \"the best and only way we have to deal with them is to cut them out of your life and if you can't, then keep them at arms length and set *Hard* boundaries and do not let them cross those boundries without doing exactly what you said you would\". If you give a narc wiggle room they WILL use that against you.",
   "created_utc": 1703396445,
   "score": 111,
   "submission_id": "18phvdz"
  },
  {
   "comment_id": "keomrl0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18phvdz"
  }
 ]
}