{
 "submission_id": "18pnw1t",
 "title": "What movie scene made you almost/or leave the movie theater?",
 "selftext": "",
 "created_utc": 1703393791,
 "permalink": "/r/AskReddit/comments/18pnw1t/what_movie_scene_made_you_almostor_leave_the/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pnw1t/what_movie_scene_made_you_almostor_leave_the/",
 "comments": [
  {
   "comment_id": "kepeu01",
   "message": "In Border this hermaphrodite got a boner",
   "created_utc": 1703393912,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepfmd0",
   "message": "The orgy scene in Sausage Party. Was pretty awkward to watch with your sisters next to you lmao",
   "created_utc": 1703394367,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepeor8",
   "message": "For me, it was Ellie's death in Terrifier 2. I didn't leave, but that was some shit I won't forget",
   "created_utc": 1703393828,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepg8j7",
   "message": "The Last Jedi when Holdo went kamikaze",
   "created_utc": 1703394728,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepgrve",
   "message": "Weirdly the ball hitting scene in Casino Royale. I have never felt such strong sympathy pain for a character in a movie again.",
   "created_utc": 1703395050,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepgm4p",
   "message": "The Last Jedi when Princess Leia started flying through space with no space suit using her Jedi powers. So stupid. I usually just roll with movies but that one was ridiculous.",
   "created_utc": 1703394956,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepex3j",
   "message": "avatar 2 was hot garbage from the start",
   "created_utc": 1703393961,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepf1s5",
   "message": "I am legend. When will smith get trapped hanging upside down. I got scared. I hate scary movies. lol",
   "created_utc": 1703394035,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepf6r4",
   "message": "Graphic rape scenes in any horror movie. They just don’t have a place in modern media IMO. Like how they don’t use the gay F work in any movies/tv shows anymore. Phase that shit out.",
   "created_utc": 1703394116,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepflyn",
   "message": "There’s a movie called “a thousand ways to die in the west” or SOMETHING along those lines that was created by the Seth that does Family Guy. I HATED that movie, it was so bland and just relied on potty humor and then there was a scene where someone pooped in a hat, or had a goat shit in a hat or something and I told the person I was with that I couldn’t take it anymore and we left.",
   "created_utc": 1703394360,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepgcsj",
   "message": "Snuck into Rob Zombie's Halloween when I was 13 (looked way older at the time). Watching Juni's actor get beat to death with a branch shook me and I almost left.",
   "created_utc": 1703394800,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepgljf",
   "message": "Idk why but at 14 Nightmare on Elm Street Remake fucked me up. \n\nI have since watch way more graphic movies. It’s embarrassing how much that shitty movie scared me",
   "created_utc": 1703394946,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepgudv",
   "message": "When Pearl and her husband started having sex on the bed that Maxine was hiding under in “X”. 🤢",
   "created_utc": 1703395090,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kephjkb",
   "message": "Matrix revolutions and Moonfall.  Saw a few people walk out on the latter",
   "created_utc": 1703395505,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepi1t7",
   "message": "Really liked Saw and Saw II even though both had moments that made me a little squeamish. Saw III almost got me to throw up in the first 5 minutes.\n\nFell asleep during Snow White and the Huntsman. First and only time that ever happened. I don’t recall ever walking out of a theater on account of lack of quality. I usually enjoy whatever I’m watching enough to get to the end.",
   "created_utc": 1703395814,
   "score": 1,
   "submission_id": "18pnw1t"
  },
  {
   "comment_id": "kepiek4",
   "message": "The nun blasting her puss with a cross. Just such a weird thing to be next to my mom for.",
   "created_utc": 1703396029,
   "score": 1,
   "submission_id": "18pnw1t"
  }
 ]
}