{
 "submission_id": "18pn8h2",
 "title": "Men of Reddit - what's the best sex toy for men?",
 "selftext": "",
 "created_utc": 1703391475,
 "permalink": "/r/AskReddit/comments/18pn8h2/men_of_reddit_whats_the_best_sex_toy_for_men/",
 "score": 171,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pn8h2/men_of_reddit_whats_the_best_sex_toy_for_men/",
 "comments": [
  {
   "comment_id": "keqt11o",
   "message": "Fleshlight. It was great. \nI threw it out before having open heart surgery. \nIn the event of me dying on the table, I didn't want anyone finding it when sorting my possessions out. \n\nI miss it.",
   "created_utc": 1703428985,
   "score": 139,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepdsr8",
   "message": "Venus 2000.",
   "created_utc": 1703393329,
   "score": 43,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepcx6w",
   "message": "A JBL speaker with exposed drivers, play a 64 Hz frequency on YouTube and you're golden. You're welcome",
   "created_utc": 1703392834,
   "score": 132,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepbvjz",
   "message": "A vibrator applied to the under side of the head of your cock is fantastic",
   "created_utc": 1703392252,
   "score": 125,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepmye8",
   "message": "It's hard to beat a good fleshlight. You can have all the buzzing bells and whistles but when it comes down to it, pleasure is simple.\n\n\u0026amp;#x200B;\n\nOFC this one pops off",
   "created_utc": 1703398980,
   "score": 143,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepp499",
   "message": "when i was 12 i heard the term “beat ur meat” for the first time so i went home from school one day and punched myself dozens of times in the groin area until i threw up everywhere",
   "created_utc": 1703400508,
   "score": 44,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepbzd0",
   "message": "My wife's butt while she’s on her Sybian. Don't even have to move. Just stick it in and the machine takes care of both of us. Most explosive orgasm I've ever experienced.",
   "created_utc": 1703392310,
   "score": 141,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepe1sw",
   "message": "A bipolar tri-phase series of e-stim cockrings that connects two cables from two channels into three electrodes from like an Erostek ET232 or an ET312B. One on the base behind your balls such that the conductive rubber touches your taint, one on the shaft of the cock, and one on the tip touching your frenulum, with the rings sheathed in half to limit sensation to those main nerves. With conductive gel as lubricant it can be better than sex lol\n\nEdit: If you think that's wild, wait til you find out what ladies can do with electrosex. My wife begs me constantly to set shit up for her.",
   "created_utc": 1703393469,
   "score": 245,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepmjhh",
   "message": "Pringles, two sponges, a rubber glove, and vaseline.",
   "created_utc": 1703398702,
   "score": 10,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepjg0o",
   "message": "The tailpipe of a 2013 Nissan Altima",
   "created_utc": 1703396670,
   "score": 241,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepfchz",
   "message": "Prostate massager, hands down the best",
   "created_utc": 1703394208,
   "score": 140,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepc54s",
   "message": "the Tenga sleeves are pretty solid. They were on sale on Amazon for Black Friday.",
   "created_utc": 1703392399,
   "score": 16,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepl11o",
   "message": "Some of y'all making fun of people that use sex toys are boring as hell. Me and my boyfriend have a good time with vibrators when we want to spice it up. Or even just a butt-plug with whoever not getting their butt plugged.",
   "created_utc": 1703397686,
   "score": 186,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepcr0r",
   "message": "Tenga Flip zero",
   "created_utc": 1703392739,
   "score": 44,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepqvd9",
   "message": "Well two weeks ago I purchased this wahl brand deep tissue massager, for my shit back. Then I got to thinking, hmmmm could I use this for.....you know.\n\nOh you sure can, with the flat attachment, on the backside of your pecker. Wowsers! I'll be using it more, than just my back, lol.",
   "created_utc": 1703401751,
   "score": 208,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kequ03b",
   "message": "I've been browsing reddit for some ideas on a few sex toys for a while and picked up the ones that seemed most popular. My favorites in the following categories are:\n\n#My Favorites\n\n**Vibrator** - [Funfactory Mantra](https://us.funfactory.com/products/manta)\n\nThe Mantra is by far my most used sex toy. The toy itself feels very nice to hold, it wraps around the head very nicely, and provides a nice range of vibrations.\n\n**Cock Ring** - [XACT-FIT SILICONE COCK RING](https://www.peepshowtoys.com/collections/cock-rings/products/perfect-fit-xact-fit-silicone-cock-rings-3-packs-incremental-sizes)\n\nMight seem too bondage if you aren't into it, but the pressure of having something wrap around to squeeze everything together really shifts up the game. The lower size you go it kind of forces you not to tense up otherwise it will hurt. This just repeats until you can't take anymore which leads to some nice finishers.\n\n**Realistic Vagina** - [THRUST Pro Elite](https://www.lovehoney.com/sex-toys/male-sex-toys/realistic-vaginas/p/thrust-pro-elite-sophia-realistic-vagina-and-ass-70.5oz/a35244g64013.html)\n\nI own about 5 Fleshlights and none of them can best the added realism that comes with this. Having more skin allows your thighs to touch the skin while fucking missionary, lay it on your chest to fuck it from behind, or have it bounce on top of you for cowgirl or reverse cowgirl. The added weight from the toy makes it much more fun than a regular Fleshlight.\n\n**Prostate Anal Toy** - [Njoy Pure Wand](https://www.njoytoys.com/product/purewand/)\n\nWhile simple in nature it really is quite effective. I believe that this is the best anal toy due to how much control you have. With the solid weight behind it and maneuverability it offers a lot for what it is. While it isn't going to instantaneously give you p-spot orgasms, it certainly a tool that can help you get there.\n\n##Special Mentions\n**Double Cock Ring** - [Oxballs Atomic Jock Stretchy Cock and Ball Sleeve](https://www.lovehoney.com/sex-toys/cock-rings/double-cock-rings/p/oxballs-atomic-jock-stretchy-cock-and-ball-sleeve-/a35315g64364.html)\n\nGenerally just really comfortable to wear. The feeling is comparable to a well fitted jacket. I like to use it in combination with my vibrator.\n\n**Vibrating Prostate Massager** - [Aneros Helix Syn V Vibrating](https://www.lovehoney.com/sex-toys/male-sex-toys/prostate-massagers/p/aneros-helix-syn-v-vibrating-silicone-prostate-massager/a46985g84371.html)\n\nWhile I think it is pretty lackluster in the manual p-spot area as well as standalone, I think the toy is a great supplement to masturbating. Having it go off adds a nice focus shift or even enhancement depending on where your mind is at.",
   "created_utc": 1703429456,
   "score": 168,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepnp85",
   "message": "Bro, the other thread was the same question but for women. The majority of replies were joyful reccomendations and reviews.\n\nThe first comment i read here: \"the tailpipe of a Nissan Altima\". Hahahahahahaha\n\nThe other comments are like \"my wife's butthole\", and the replies: \"i also chose this man's wife butthole\"\n\nThis is 100% Kenergy vibes hahahahahahaha",
   "created_utc": 1703399507,
   "score": 7,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepqap7",
   "message": "The Handy",
   "created_utc": 1703401339,
   "score": 164,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepkdvb",
   "message": "Onaholes are pretty rad",
   "created_utc": 1703397260,
   "score": 71,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepsu0h",
   "message": "Ok hear me out, it's those electric pocket pussy, I mean think about it playing fortnite w the boys, a bong on ur left side, beer on the right and a handfree pocket pussy on ur dick hands free tell me that doesn't sound wonderful",
   "created_utc": 1703403238,
   "score": 4,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepfiuy",
   "message": "You ever been to Bosnia?",
   "created_utc": 1703394309,
   "score": 229,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepcf2x",
   "message": "You can never go wrong with a cock ring.",
   "created_utc": 1703392554,
   "score": 48,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepb47h",
   "message": "Love dolls from Japan. Do NOT get the cheap ones.",
   "created_utc": 1703391834,
   "score": 214,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepj5vj",
   "message": "your opposite hand after you sit on it and make it numb, feels like someone elses hand.",
   "created_utc": 1703396494,
   "score": 226,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepqzdx",
   "message": "The replies show why it's sad that most sex toy companies primarily target women, and men are so not used to toys, they just make joke comments about it.",
   "created_utc": 1703401832,
   "score": 47,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "keqebqq",
   "message": "Late here, the Aneros Prostate Massager. You will need patience, an open mind and an open butthole, but the rewards... hands free orgasms, spasms, unmatched pleasure. Like I used to think, wow women seem to enjoy their climaxes way more than men. Not anymore. Literally this product is like a secret bonus ending.",
   "created_utc": 1703420578,
   "score": 26,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepqias",
   "message": "Avoid using armor-all wipes, gents…",
   "created_utc": 1703401491,
   "score": 72,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepcv9g",
   "message": "Lovense max 2",
   "created_utc": 1703392805,
   "score": 244,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepk7yz",
   "message": "Definitely a fat dildo up your bussy. I think once you unlock orgasming while something is in your ass, it's really hard to revert back. You kind of feel like stroking your dick is \"missing\" the full scope of pleasure. Even when I am aiming for a quick hand shandy now before bed or something, a glass wand is in my ass while I'm wanking.",
   "created_utc": 1703397155,
   "score": 25,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepdbe7",
   "message": "[deleted]",
   "created_utc": 1703393057,
   "score": 50,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepolju",
   "message": "Her name is Megan and she's a dick vacuum fueled by weed and white claws",
   "created_utc": 1703400139,
   "score": 98,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepwa7l",
   "message": "Give me 2 popsicle sticks and a rubber band and I'll find a way to fuck it. Like a filthy fucking MacGyver",
   "created_utc": 1703405956,
   "score": 157,
   "submission_id": "18pn8h2"
  },
  {
   "comment_id": "kepq95t",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18pn8h2"
  }
 ]
}