{
 "submission_id": "18pox1w",
 "title": "How to tell children no Christmas tree or presents this year?",
 "selftext": "",
 "created_utc": 1703397512,
 "permalink": "/r/AskReddit/comments/18pox1w/how_to_tell_children_no_christmas_tree_or/",
 "score": 10,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pox1w/how_to_tell_children_no_christmas_tree_or/",
 "comments": [
  {
   "comment_id": "kepkyew",
   "message": "Just gotta be straight up with it, not really a way to sugar coat it",
   "created_utc": 1703397635,
   "score": 7,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "keply8k",
   "message": "Get some paper and write a letter from Santa saying that there has been an issue and the tree wanted to stay planted so everyone will have to draw a tree this year (then draw trees with kids and put them up) \n\nIn Santa’s letter you can also state there will be a delay with the gifts. Then someday in the future when you can afford something, even just some candy and a card, give them something from Santa… \n\nAlso, check with local school, church, law enforcement to find out about any programs that are out there to help you. My local post office asked kids to write their wish and then mailed each kid a little gift. There are so many helpful people out there, seek and you shall find.\n\nChin up, make something from nothing and spend time with the kids. That is the best gift of all.",
   "created_utc": 1703398301,
   "score": 7,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "keplde5",
   "message": "Just say the grinch stole all your decorations and tree and not giving it back this time",
   "created_utc": 1703397914,
   "score": 6,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "keps28i",
   "message": "If this is real...is there a reason you waited until tonight to decide to figure this out? I get having zero funds, but there are so many places out there that provide free gifts and you didn't put your name in for any of them. How old are your kids? Do they understand the concept of Santa yet? Haven't they asked why there's no tree yet? Do you typically have enough to do Santa?\n\nAgain...if this is real...please plan for next year. Get a used fake tree on marketplace (you can probably get it for free), start putting \"x\" amount of money away every month for Christmas and pick up things they would like on clearance throughout the year as you have the funds. I did that for years when our kids were little and we had to watch every dollar.\n\nAgain, again...if this is real...I'm so sorry for your kids and hope there are some family or friends in your life who can help out tomorrow night.",
   "created_utc": 1703402645,
   "score": 3,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "kepo9ce",
   "message": "Make them something. You probably have the tools and supplies to make something for free and get them something when the cash comes in. At the very worst, they'll appreciate it when they're older.",
   "created_utc": 1703399903,
   "score": 2,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "keppewo",
   "message": "“Santa got shot down because of the war”",
   "created_utc": 1703400709,
   "score": 2,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "kepq08k",
   "message": "First tell them their parents and puppy died and they're now homeless orphans.\n\nNo tree or presents won't even matter.",
   "created_utc": 1703401127,
   "score": 2,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "keplca2",
   "message": "You're not so hard up you couldn't make your way to the dollar store and get a few things. You're just not.",
   "created_utc": 1703397894,
   "score": 6,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "kepl3yh",
   "message": "Santa's dead, you killed him by not believing hard enough.",
   "created_utc": 1703397740,
   "score": 3,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "kepl6xl",
   "message": "Either confront the fact. Or do something about it.",
   "created_utc": 1703397795,
   "score": 2,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "keptbeb",
   "message": "\"Sorry. No Christmas Tree or oresents this year\" and explain why",
   "created_utc": 1703403611,
   "score": 1,
   "submission_id": "18pox1w"
  },
  {
   "comment_id": "keq0evo",
   "message": "Guess what kids? We're suddenly Jewish!",
   "created_utc": 1703409366,
   "score": 1,
   "submission_id": "18pox1w"
  }
 ]
}