{
 "submission_id": "18pofso",
 "title": "women, what do you like about your male friends?",
 "selftext": "",
 "created_utc": 1703395746,
 "permalink": "/r/AskReddit/comments/18pofso/women_what_do_you_like_about_your_male_friends/",
 "score": 14,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pofso/women_what_do_you_like_about_your_male_friends/",
 "comments": [
  {
   "comment_id": "kepi5re",
   "message": "They treat me the same as their guy friends",
   "created_utc": 1703395879,
   "score": 32,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepivtm",
   "message": "They have a sense of humor and are knowledgeable of random but interesting stuff; from facts about their town to being able to identify random plants and bugs (lol)\n\n* And being pet people. One had a cat a while ago he can't replace with any new pet, and the other guy has a whole zoo at his house but loves the dogs/cats/snakes/ and lizards in his own different ways",
   "created_utc": 1703396319,
   "score": 8,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keplzdp",
   "message": "I only started to have guy friends this year \u0026amp; honestly haven’t really hung out too much with them to begin with but they seem chill.",
   "created_utc": 1703398322,
   "score": 7,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepoxro",
   "message": "They're almost as good as I am at video games.",
   "created_utc": 1703400378,
   "score": 9,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepiicv",
   "message": "Who doesn't expect or demand anything from me. He trusts and is always close in some way.",
   "created_utc": 1703396094,
   "score": 8,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepq3pi",
   "message": "He doesn’t treat me like I’m helpless and lets me ask questions about being a guy",
   "created_utc": 1703401197,
   "score": 3,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepijz8",
   "message": "That they’re not women and they’ve treated me better than any of my past female ones",
   "created_utc": 1703396121,
   "score": 8,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepkxzn",
   "message": "They’re so much more fun than the female friends. I love the ‘I’m game, let’s go on an adventure!’ attitude that I’ve never experienced with another female.",
   "created_utc": 1703397628,
   "score": 6,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepirzv",
   "message": "There is less manipulation and toxicity. Women seem to be so competitive with other women.",
   "created_utc": 1703396254,
   "score": 9,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepsnpf",
   "message": "They don't break down every word I say as if there were some ulterior meaning. They don't try to doll me up when I'm feeling down, they tell me the truth when I ask for it.",
   "created_utc": 1703403103,
   "score": 2,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepsbjp",
   "message": "Actually being honest with me and helping me with everything that I needed helped with and especially their humors.",
   "created_utc": 1703402844,
   "score": 3,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keplpgj",
   "message": "They're great - my male friends are coworkers that I only hang out with rarely outside of work with other coworkers but I do consider them friends. They are kind, hard workers, trustworthy, funny, and all of them are respectful. In the past, almost all of my male friends in my early/mid 20s eventually tried to sleep with me or admitted feelings for me even the ones who met me through my boyfriend or my boyfriends siblings. There was an exception to 3 guys I met through someone I dated briefly the end of my senior year of high school (it was his group of friends) and I was friends with into my early 20s...all were funny, respectful, and I felt safe and genuinely cared for when hanging out with them. As a side note: saying \"all of them\" makes it sound like I had tons of male friends...I have 3 male coworkers I consider friends and I had 6 male friends from senior year to my mid 20s.",
   "created_utc": 1703398137,
   "score": 2,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepo32z",
   "message": "they dont look at me weird when i grab a random creature or plant and eat crazy amounts of food. also they tend to be less obsessed with how they look.",
   "created_utc": 1703399781,
   "score": 2,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keposx7",
   "message": "I only like the ones with gfs that are loyal cause I know there’s no ulterior motives. They’ve always been chill, are happy with me sharing food and music, and they’ve given me their honest opinion without the cattiness you can experience with other women.",
   "created_utc": 1703400282,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepxq27",
   "message": "They treat me like a person. Care about me without it needing to be more.",
   "created_utc": 1703407124,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepzzn3",
   "message": "When they treat me like an actual person.\n\nHad a previous friend group with one person constantly shutting me out with “Shut up, you’re a woman, you’re not allowed to have an opinion”\n\nId rather be talked over in a friend group than to be silenced every two seconds",
   "created_utc": 1703409013,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepp5l3",
   "message": "They don't care. I can show up with messy hair and unshowered and they won't comment on it. I can fart and theyll laugh. I can cry and theyll give me a pat on the back and say it is okay.\n\nI feel comfortable even in bra and undies around guys. I know the guys are looking, but I trust them. I know they probably spank off to it later. They'll compliment my figure then move on. But they treat me as one of the guys and let me join and compliment when I try things even if I fail. \n\nThe guys will chuckle if I say I'm astill a virgin, theyll ask why but leave it at that. They don't care what I eat. They don't care if I have a different view. \n\nHonestly, it is the women who are toxic and judgemental. It is the women making rape comments when I'm in undies. It is women telling me I suck when I fail when trying.\nIt is women judging me for being a virgin\n\nIt is women calling me a bad person for staying a virgin because I want it to be for love and not risk pregnancy (if I get raped, it is still my responsibility to try and prevent pregnancy). \n\nIt is the women judging my clothes. Women are the violent ones. I know a guy might try and rape me but at least it is expected. A woman will assault and hurt me just for smiling at a guy she likes.",
   "created_utc": 1703400533,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "kepi4b2",
   "message": "8 inch donkey",
   "created_utc": 1703395855,
   "score": 250,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keprfkt",
   "message": "They're a good laugh and I can play video games with them. Also memes, men seem to love memes",
   "created_utc": 1703402170,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keq1zht",
   "message": "They’re interesting, funny, weird; they all are so different and special. They’re lovely and I adore them. If they weren’t, we wouldn’t be friends :)",
   "created_utc": 1703410668,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keq6xx8",
   "message": "He's more intelligent than I am, so when we are discussing something I often learn from him and get a different view.",
   "created_utc": 1703414846,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keqfdg8",
   "message": "I can’t be friends with men, they always wanna fuck me 🥺",
   "created_utc": 1703421314,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keqfik1",
   "message": "Oh, and I can’t have female friends because they all think I wanna fuck them, and/or their husbands wanna fuck me 😭😭😭",
   "created_utc": 1703421411,
   "score": 1,
   "submission_id": "18pofso"
  },
  {
   "comment_id": "keqi2jd",
   "message": "Their being male has nothing to do with me being friends with them lol",
   "created_utc": 1703423066,
   "score": 1,
   "submission_id": "18pofso"
  }
 ]
}