{
 "submission_id": "18ppj7v",
 "title": "What are the top and least important things a woman looks for in a husband ?",
 "selftext": "",
 "created_utc": 1703399929,
 "permalink": "/r/AskReddit/comments/18ppj7v/what_are_the_top_and_least_important_things_a/",
 "score": 5,
 "url": "https://www.reddit.com/r/AskReddit/comments/18ppj7v/what_are_the_top_and_least_important_things_a/",
 "comments": [
  {
   "comment_id": "keponlg",
   "message": "Top: She really wants that compassion and well-roundedness. \n\nLeast: She does not care about the money. She does want you to have some but she doesn't care. She cares if you have enough to take her out on a date and you're okay at the end of it.",
   "created_utc": 1703400179,
   "score": 2,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "keppu97",
   "message": "so if you are talking actual husband material ...\n\nthe ability to provide is important\n\ndecent looks are important ... not everyone can be very handsome, but you can be fit, and have good hygiene, dress well, etc. when i say dress well, i don't necessarily mean suit and tie every day, i mean at least your clothes are clean and are the right size. a guy who wore flashy clothes that were very expensive would actually turn me off.\n\nobviously treat women, animals and children kindly and with respect, even if we would be not as nice. one thing i noticed about my hubby was that he was kind to children, waitresses, animals, etc., and would leave good tips even when the waitress was not excellent. a friend of mine just dumped a guy because he wasn't nice to her dog.\n\nin my case, being a hard worker and well educated was important ... but that doesn't necessarily mean university ... just skilled in something.\n\nand then just be social and reasonably good with people.\n\noh and honest, masculine, loyal and loving.",
   "created_utc": 1703401009,
   "score": 1,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "kepqdrj",
   "message": "not important:\n\nyou don't need to be rich, just ok with a future\n\nyou don't need to be a gym rat or \"roid monster\", just fit\n\nyou don't need to be overtly masculine and be a tough guy all the time, but masculine is nice and dependable and capable is very good.\n\nyou don't need to have had a thousand girlfriends\n\ni am sure there is more both good and bad",
   "created_utc": 1703401401,
   "score": 1,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "kepoosh",
   "message": "Least important thing: looks\nMost important: loyalty, respect",
   "created_utc": 1703400203,
   "score": 1,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "kepoxun",
   "message": "top: values, personality, appearance, and career\n\nim not going to say the least because i honestly cant think about one lol, at some point everything is going to count",
   "created_utc": 1703400380,
   "score": 1,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "kepp7e7",
   "message": "Top - ability to provide. \n\nLeast - I mean anything fits here.......... e.g. how good they are at playing video games, how good they are at driving a space ship, how good they are at exploring mars.... you get the jist",
   "created_utc": 1703400567,
   "score": 2,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "keppc04",
   "message": "Stability, reliability and trust. Personal connection and physical attraction.\n\nConcerns about height are silly, same as requiring a bust size. That's not looking for a partner.",
   "created_utc": 1703400654,
   "score": 1,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "keps2qs",
   "message": "Top\nLoyalty, honesty, funny, nice, job to split bills\nLeast\nHow much money he makes\nHow flat the stomach is",
   "created_utc": 1703402656,
   "score": 1,
   "submission_id": "18ppj7v"
  },
  {
   "comment_id": "kepzode",
   "message": "Top: I’d like him to be sincere and honest. Heck, be brutally honest. As long as know you are exactly who you say you are, I’m happy.\n\nLeast: Certain physical attractiveness. We all have preferences, and all have our boundary bending whims. I’d like him to be attractive to me, but that’s really just base level and thus the least important.",
   "created_utc": 1703408753,
   "score": 1,
   "submission_id": "18ppj7v"
  }
 ]
}