{
 "submission_id": "18pzur3",
 "title": "What's a lesson about sex or relationships that you wish you had learned earlier in life?",
 "selftext": "",
 "created_utc": 1703439604,
 "permalink": "/r/AskReddit/comments/18pzur3/whats_a_lesson_about_sex_or_relationships_that/",
 "score": 43,
 "url": "https://www.reddit.com/r/AskReddit/comments/18pzur3/whats_a_lesson_about_sex_or_relationships_that/",
 "comments": [
  {
   "comment_id": "kescuuo",
   "message": "You can do everything right and it still wont work out",
   "created_utc": 1703452335,
   "score": 12,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesgb8i",
   "message": "Love and compatibility are two different things, and you can have one without the other. Don’t stay in a relationship without both.",
   "created_utc": 1703453753,
   "score": 143,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerxbeo",
   "message": "Know your own worth, before you let others decide it for so. \n\nI've known people and been one myself whose self worth was dependent on relationship status. And that person certainly didn't love me.",
   "created_utc": 1703446025,
   "score": 19,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesme1x",
   "message": "Sex isn't everything. But if your sex drives don't match up your relationship might not last. Dead bedroom sucks.",
   "created_utc": 1703456349,
   "score": 106,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerjm4u",
   "message": "If someone tells you they think they're not good for you because they're afraid they'll abuse you -\n\nListen and then leave.",
   "created_utc": 1703440555,
   "score": 243,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kernusd",
   "message": "You will lose all sexual attraction to a partner if you have to take care of them (weaponized incompetence, laziness, no drive)",
   "created_utc": 1703442295,
   "score": 61,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesn9zk",
   "message": "Answer the question: “Are they worth messing up my pH for?”",
   "created_utc": 1703456727,
   "score": 93,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesf2om",
   "message": "For some reason, kind of needing to pee makes my girlfriend orgasm like crazy. To the point that we wait for it to have sexy time because it makes a huge difference for her. She goes from struggling to get to one, to having multiple powerful O's that she struggles to stand/walk after.\n\nAlso light touches from me, kind of like I'm trying to tickle her, mid orgasm seem to make them last longer for her.",
   "created_utc": 1703453232,
   "score": 221,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keseui1",
   "message": "Get the HPV vaccine.",
   "created_utc": 1703453137,
   "score": 62,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesjghf",
   "message": "Understanding that a relationship isn't supposed to fulfill all of your needs.  You and your partner are each individuals (imagine two overlapping circles). The place where circles overlap is the relationship,  but about 75% of those circles remain the individual. \n\nCherish the overlap of your lives, tend it and nourish it. But also  learn to celebrate and support the parts of your partner that aren't you. \n\n\"The greatest blessing of being in a relationship is having somebody to witness your life\"\n\nAlso sex is great,  but you've never experienced true connection until you've cried together while watching the last charge of the rohirrim on the planes of pelenor during the battle for Minas Tirith. \n\n\n\"DEAAAAAATH\" *EMOTIONAL BONER INTENSIFIES*",
   "created_utc": 1703455077,
   "score": 167,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesgfqp",
   "message": "Always wear a condom, but specially the first time you have sex with someone. It might cost you, literally.",
   "created_utc": 1703453806,
   "score": 159,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keslprs",
   "message": "That I need an intimate connection with someone before I can remotely have sex with them",
   "created_utc": 1703456061,
   "score": 56,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kes9ylx",
   "message": "Cardio is important.",
   "created_utc": 1703451169,
   "score": 219,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keshqzc",
   "message": "Losing your virginity isnt as big of a deal as people make it seem lol. Thought the world was gonna change on my first time but afterwards i just got out of bed and we finished the movie",
   "created_utc": 1703454352,
   "score": 205,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kervb0v",
   "message": "There is more to a healthy relationship than just sex.\n\nEnsure you are fulfilling your partner’s wants and needs. Not just your own.\n\nThere is nothing hotter than the female orgasm.",
   "created_utc": 1703445239,
   "score": 233,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesfz8k",
   "message": "Those little annoying things that you find cute and adorable at the start of the relationship will become major stumbling blocks.",
   "created_utc": 1703453614,
   "score": 201,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerhrng",
   "message": "Even if you think no strings attached sex will work, it won’t. Brain chemicals begin to trigger things oxytocin. Oxytocin is associated with bonds between people. Those attachment chemicals are strong.",
   "created_utc": 1703439793,
   "score": 178,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerk1vf",
   "message": "Relationships that I saw throughout my life will affect my own so I should have gotten therapy earlier to undo everything",
   "created_utc": 1703440734,
   "score": 130,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kes7wq5",
   "message": "Sex doesn’t mean they care about you. Sex isn’t love",
   "created_utc": 1703450339,
   "score": 119,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kero2d4",
   "message": "Condoms and Plan B are available for free at the health department. Pregnancy tests are regulated by the FDA and work all the same so you can cheap out and buy the ones at the dollar store. Only difference is how early they detect the pregnancy and how easy it is to read the test. If I had known this earlier my wife and I would have saved so much money when we were trying for our kids.",
   "created_utc": 1703442378,
   "score": 82,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesj2o9",
   "message": "You can love them for all that they are, even care for them when they’re broken. But that doesn’t mean they have the same values. And after 12 years, they can decide they don’t want to deal with you being the broken one, even if they’re the reason you’re broken to begin with.",
   "created_utc": 1703454914,
   "score": 44,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesjy0c",
   "message": "1) if someone says something like “I’ll kms if you leave”, then they are manipulating you into staying! 9 times out of 10 they won’t actually do it. And if they do? They had those issues before you, and it’s not your fault. Never stick with a relationship that makes you miserable just because you’re scared for the other person. \n2) Don’t settle for less. You should not be wasting your time and energy begging someone to give you the bare minimum. Idc how much you like them, there are 8 billion people in this world so I’m sure you’ll find someone who treats you right\n3) kindness is good, but watch out for love-bombing\n4) people can say “I love you” but still turn out to be snakes \n5) I knew this one already, but some don’t- consent is important in a sexual relationship! If it’s not an enthusiastic and sober “yes!”, then it’s a no!",
   "created_utc": 1703455289,
   "score": 44,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keri6sr",
   "message": "80% of dudes on dating apps yes even paid ones only want short term hook ups. I learned once someone started talking sexual within the first day don't expect much from the conversation",
   "created_utc": 1703439968,
   "score": 169,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesk4te",
   "message": "Your performance gets incredibly better if you understand its about enjoying yourself and one another - not imitating what you see in most porn.",
   "created_utc": 1703455373,
   "score": 17,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerjhyp",
   "message": "Don't take it so seriously. Embrace going with the flow.",
   "created_utc": 1703440507,
   "score": 28,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kes6gqt",
   "message": "Sex drive goes away and is replaced with real love and if you nurture the real love, the physical need will return and be even better.",
   "created_utc": 1703449753,
   "score": 55,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerp7cz",
   "message": "When you live with a woman and a kid, you as an individual person stops existing. EVERYTHING is about the household and not you.",
   "created_utc": 1703442826,
   "score": 142,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesm1k7",
   "message": "There is way more to a relationship than sex. Look for early red flags, because they will always be there throughout the relationship if you ignore them.",
   "created_utc": 1703456199,
   "score": 11,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kespjrb",
   "message": "love isn't enough.",
   "created_utc": 1703457741,
   "score": 11,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesgfjm",
   "message": "Less is more and communication is important",
   "created_utc": 1703453804,
   "score": 9,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesmmfw",
   "message": "Sex and love are not the same.",
   "created_utc": 1703456449,
   "score": 9,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesn0bb",
   "message": "Loneliness isn't love.",
   "created_utc": 1703456611,
   "score": 8,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kespusf",
   "message": "I wish I had learned to read the obvious signs that a member of the opposite sex was interested at an earlier age.  I was oblivious.",
   "created_utc": 1703457881,
   "score": 8,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesqzzr",
   "message": "Intimacy is more than just a sexual act. It's the emotional connection, the mutual understanding, the intellectual compatibility, the acceptance and the vulnerability that someone shares with another person. Sex is just sex, but to find someone to connect with on a deeper level, that's special and that's what true intimacy is.",
   "created_utc": 1703458392,
   "score": 8,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keskgyw",
   "message": "If they cheat, leave. I'm still suffering from the consequences of this 6 years later. I legitimately believe my time of being happy in a relationship is over",
   "created_utc": 1703455519,
   "score": 14,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesjg6f",
   "message": "Leave quietly.\n\nIf a man ghosts you, don't reach out sending paragraphs asking for reasons.\nIf a man breaks up with you, don't beg, don't plead, leave quietly.\nDon't waste your energy and emotion on them, they don't care and silence is much better revenge, they cannot feed on that.",
   "created_utc": 1703455073,
   "score": 66,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerifsy",
   "message": "How much I, a male, would dislike sex. I find it kind of gross.",
   "created_utc": 1703440071,
   "score": 53,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kespeak",
   "message": "Relationships shouldn’t feel like babying or parenting",
   "created_utc": 1703457672,
   "score": 5,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerhh8p",
   "message": "communication",
   "created_utc": 1703439673,
   "score": 21,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keskc5o",
   "message": "Don’t date a guy that’s that much older than you.",
   "created_utc": 1703455463,
   "score": 23,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesoinw",
   "message": "That women are not automatically saints that need to be worshipped the ground they walk on. Toxic femininity is a thing too.",
   "created_utc": 1703457278,
   "score": 22,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keshqgd",
   "message": "This isnt something I had to learn the hard way, but a few ex-friends realized this way too late.\n\nFor the men- Women tell each other everything. So if you are shitty to her, she tells all her friends  and coworkers and family how you mistreat her. If you guilt her into doing things she doesnt like, she will tell everyone that asks her, what kind of monster you are. Doing things like this close down entire sections of your dating pool quickly. And if you do it a couple times, then youll be single *permanently* in addition to becoming a pariah in your social circles.\n\nLikewise- being a gentleman, taking “no” for an answer, being graceful if you dont get your way; women tell each other these things too. Word gets around that you are respectful towards your significant others or potential dating partners (and the choices they make), you are likely to score more dates even with women that may not be into you 100% right away. And youll stop being ghosted if things go sour.",
   "created_utc": 1703454346,
   "score": 26,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerjow7",
   "message": "That sex isn't the most important aspect of a relationship as advertised to younger citizens (in America, at least) by corporate consumerism.",
   "created_utc": 1703440586,
   "score": 32,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keso5nc",
   "message": "Women love Kimchi fried rice with a little sriracha in it. Instant panty dropper",
   "created_utc": 1703457117,
   "score": 9,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesx8k5",
   "message": "That being raised in a religious environment will fuck you up.",
   "created_utc": 1703461353,
   "score": 6,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keshw60",
   "message": "Hearing…it’s not you, it’s me. Or knowing that one day the sex would dry up or fade away",
   "created_utc": 1703454415,
   "score": 4,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesk40h",
   "message": "You will know it when you feel it.",
   "created_utc": 1703455363,
   "score": 4,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesoy8y",
   "message": "Head games are a huge red flag. RUN.",
   "created_utc": 1703457471,
   "score": 5,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesq84l",
   "message": "What an orgasm actually was, and that \"relations\" should be pleasant for both parties involved.",
   "created_utc": 1703458047,
   "score": 4,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesu29a",
   "message": "Don't marry the first person you have sex with",
   "created_utc": 1703459833,
   "score": 4,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket05a7",
   "message": "Never beg someone to love you the way you deserve to be loved because there's definitely someone who will give you the world without having to be told",
   "created_utc": 1703462754,
   "score": 4,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kerkr5f",
   "message": "Condoms are not one size fits all, or even two sizes.  I had many good times ruined by struggling to put on a condom.  MyOne fitted condoms are life changing.",
   "created_utc": 1703441027,
   "score": 11,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesp1zq",
   "message": "Women fake orgasms to have relationships.\n\nMen fake relationships to have orgasms.",
   "created_utc": 1703457518,
   "score": 13,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesdbeu",
   "message": "It is OK (good) to set and maintain boundaries in sexual relationships. You can and should say no if you feel doubt, fear, or are being pressured to do something you do not want to do. If you can't have a mature conversation about sex; you probably shouldn't be having it. It is OK to have likes and dislikes and definitely voice them to your partner.",
   "created_utc": 1703452521,
   "score": 10,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesjfbx",
   "message": "Relationships aren't fair, never will be, and you'll just screw yourself up hoping that everyone else will put in effort just because you do.",
   "created_utc": 1703455063,
   "score": 8,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kes5v8h",
   "message": "Wait for it….",
   "created_utc": 1703449504,
   "score": 5,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesn63w",
   "message": "Make it good for her and it'll be great for you.",
   "created_utc": 1703456680,
   "score": 8,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesvimr",
   "message": "Don’t confuse hormones with love.",
   "created_utc": 1703460523,
   "score": 3,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket5ewa",
   "message": "Slow. Everything slow. Take your time and enjoy the intimacy. Don’t make rash decisions. Pause in the moments and the good times. Take time to improve the negative ones. Be present and think slow, act slow.",
   "created_utc": 1703465271,
   "score": 1,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesm4py",
   "message": "Your libido gets higher as you get older (for me), ask her if she is sure wants to deal with that.",
   "created_utc": 1703456237,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesm7ns",
   "message": "Dead bedrooms don’t end with marriage",
   "created_utc": 1703456272,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesncvx",
   "message": "As a Redditor I have never been in a relationship",
   "created_utc": 1703456762,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesqhae",
   "message": "That instead of being weird and unloveable, my specific brand of weirdness actually puts me in high demand. You just have to learn that and find the proper places to look for compatible partners.",
   "created_utc": 1703458159,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesrqgy",
   "message": "You gotta make the come over here motion with your fingers when inside while working the clip at the same time. Do this until your arms go numb and she is satisfied.",
   "created_utc": 1703458734,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesrziu",
   "message": "Everything will be fine at the end and nothing really matters",
   "created_utc": 1703458852,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kest69s",
   "message": "You can’t help someone that doesn’t want to be helped",
   "created_utc": 1703459409,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesvszd",
   "message": "You can’t have a healthy relationship without having a healthy mind. Loving yourself is important in learning how to love another.",
   "created_utc": 1703460659,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keswnq0",
   "message": "Some chicks are prude. Others are cum guzzlers. Usually rich girls \u0026amp; poor chicks are cum guzzlers. The middle ground is prude.",
   "created_utc": 1703461071,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesxm8x",
   "message": "That sex isn't that big a deal.",
   "created_utc": 1703461539,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesz52p",
   "message": "Don’t assume all of the responsibility for your partner’s happiness.\n\nWhen you see signs that it’s over, let go and move on. Prolonging heartbreak can have some pretty hefty consequences.\n\nSelf reflect on how and why your own actions landed you in the position you’re in.\n\nBehaviors become habit over time. Don’t dismiss and/or allow small dislikes or contention to grow into big time resentment. Whether it be your partner’s behaviors, your behaviors, or the general dynamic of your relationship.\n\nSometimes, you are the bad guy. In terms of your partner’s perspective. Do not take their perspective lightly. Generally, you don’t dismiss your own grievances carelessly. Don’t do it to the person you love.",
   "created_utc": 1703462267,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keszcvu",
   "message": "Go to r/marriedredpill. Read the materials in the sidebar.  Had someone taught me that as a kid instead of what I was taught, the last few decades would have been far easier.",
   "created_utc": 1703462373,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "keszm6d",
   "message": "The same shit I still try to tell myself.\n\nI’m doing a better job in both, but still make many of the same mistakes.\n\nAdvice I’d generally give:\n- don’t stay with someone you’re no longer attracted to\n- don’t stay with someone who is not committed to a future with you\n- don’t sacrifice your core values and life goals for a relationship, and don’t expect that from your partner\n- don’t get so caught up in [insert hobby, bad habit, vice, addiction] that you neglect your partner and the relationship \n- have frequent, honest conversations about eachother’s needs, and really work on trying to meet them in the relationship \n- develop a thick skin so you can have said conversations without being defensive\n- boundaries. Have them, enforce them, respect them.\n- if you’re a man dating women, ignore the toxic narratives from the manosphere. If you’re a woman dating men, ignore the toxic narratives from tik tok narcissists. Get over the gender wars bullshit. These people will only teach you how to be abusive and to destroy a good thing when you have it. You need to have genuine empathy for your partner, and this will never happen if you hold onto dogmatic beliefs about how all women are bitches or all men are dogs.\n- work on yourself. Get into therapy.\n- don’t stay with someone unwilling to work on themselves, especially if the thing they need to work on is damaging the relationship.\n- relationships are hard work and require constant maintenance. But sometimes, the problems in the relationship aren’t fixable. Know the difference between the two.\n- when you find someone who you love and who loves you, who cares for themselves, who respects you and your time, and who is actually willing to put in the work to make a relationship work, do everything in your power to keep them (as in, put in the effort to make them happy and want to stay. Not abuse and manipulate them into staying)",
   "created_utc": 1703462501,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket027u",
   "message": "Don't waste our time on someone who you think might eventually start appreciating everything you've done for them. They won't but they'll string you along as long as they're getting something out of it.",
   "created_utc": 1703462714,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket1159",
   "message": "If he makes you bleed every time you have sex, then you are not the problem.",
   "created_utc": 1703463166,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket2d98",
   "message": "Communicate.",
   "created_utc": 1703463803,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket2tm4",
   "message": "You should really work on yourself and get comfortable with the idea of being alone forever…and then you will hopefully attract the right kind of person who can get into you and all you’re about.",
   "created_utc": 1703464021,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket2uf8",
   "message": "If you won someone over, they most likely settled for you because who they really wanted doesn’t want them.\nIf they turn you down or friend zone you, LET IT GO! If they chase you after you get someone else, they don’t want you. They just liked your attention. \n\nFor my fellas: The girl you like most likely has a bunch of other guys who do as well. Date the woman who likes you, not the one who you like. \n\nFor the ladies: Date men who actually like you. Not the one who just want arm candy, but the one who really wants you. Don’t take anything from a man that you don’t want. Nothing is free, and he will want something in return.\n\nMost importantly: No one is entitled to anyone. Any effort you put in someone is a gamble. The hardest part is cutting your losses when you’ve invested so much in someone.",
   "created_utc": 1703464031,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket33jj",
   "message": "Being screamed at over nothing multiple times is something that shouldn't be ignored",
   "created_utc": 1703464146,
   "score": 2,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket42ku",
   "message": "What love bombing is.",
   "created_utc": 1703464608,
   "score": 1,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket4pkr",
   "message": "There is no such thing as “the one”… there are tons of people that we can meet, date, and love and have really satisfying relationships with. Closing yourself off because you think there’s one perfect person for you really limits you. We force relationships that don’t fit because we think “this is the one and I have to make it work”… sometimes to the detriment of ourselves.",
   "created_utc": 1703464922,
   "score": 1,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket555f",
   "message": "If you are particularly vulnerable, lonely or struggle with self esteem - don’t rush in and settle for the first person to show an interest in you. Chances are they have clocked this vulnerability and sniffed you out as an easy target for allsort of awful reasons. If it feels very ‘full on’ in a short amount of time, they may be lovebombing you. Take your time, keep yourself safe and be aware of red (and green!) flags.",
   "created_utc": 1703465135,
   "score": 1,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket5fnl",
   "message": "You can’t love someone into loving you back or into loving themselves.",
   "created_utc": 1703465281,
   "score": 1,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "ket5p5i",
   "message": "Purity culture because of society or religion is bullshit. Humans have areas of pleasure for a reason, we should take advantage of that. It’s not shameful to like sex. It’s not shameful to have kinks. And it’s definitely not shameful to like butt stuff.",
   "created_utc": 1703465413,
   "score": 1,
   "submission_id": "18pzur3"
  },
  {
   "comment_id": "kesxfaz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18pzur3"
  }
 ]
}