{
 "submission_id": "18q1212",
 "title": "What is the trick that helped you to loose weight?",
 "selftext": "",
 "created_utc": 1703443244,
 "permalink": "/r/AskReddit/comments/18q1212/what_is_the_trick_that_helped_you_to_loose_weight/",
 "score": 118,
 "url": "https://www.reddit.com/r/AskReddit/comments/18q1212/what_is_the_trick_that_helped_you_to_loose_weight/",
 "comments": [
  {
   "comment_id": "kerr8ts",
   "message": "Cutting out liquid calories.",
   "created_utc": 1703443643,
   "score": 76,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kertdig",
   "message": "Counting calories honestly and accurately (including using a kitchen scale because I learned I can’t estimate portion sizes for shit).",
   "created_utc": 1703444483,
   "score": 127,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerxaxf",
   "message": "Sleep! Never realised how important sleep was. But it really does wonders.",
   "created_utc": 1703446019,
   "score": 83,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerxg1n",
   "message": "If you find intense workouts difficult to follow, just achieving 10-15k steps per day can help you significantly. Of course it'll take some time but change WILL happen.",
   "created_utc": 1703446075,
   "score": 55,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kers910",
   "message": "Stop consuming so much.  That's it.  Stop bullshitting yourself and take a good hard look at EVERYTHING you eat/drink during a day.  I bet it will be at least twice as much and as many calories as you thought.  You need to take in less calories than you burn in order to lose weight.  Simple as that.",
   "created_utc": 1703444039,
   "score": 145,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kervz6a",
   "message": "A ‘trick’ that worked well for me was to limit condiments to only mustard.  Cutting mayo and out of sandwiches, and eliminating ketchup and ‘dips’ was an easy way to cut out calories without making drastic changes to what I was always eating.",
   "created_utc": 1703445498,
   "score": 17,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kersilm",
   "message": "A horrible breakup worked for me.",
   "created_utc": 1703444144,
   "score": 22,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kersbz7",
   "message": "I lost almost 50 pounds in three months. This won’t be the case for everyone, as I am able to lose and gain weight very quickly (blessing and curse) but if you follow these following rules that are really the basic foundation of most diets, I think you will have success.\n\nFirst, eliminate sugar as much as you can. A lot of people don’t like this part, but this means giving up drinks with calories, specifically alcohol. I personally didn’t drink in the first place, but a significant part of alcoholism is actually the addiction to the sugars in the alcohol.  Not to sound harsh, but candidly if you’re not willing to do this, you’re almost wasting your time. If you can’t give up beer, you are going to have an incredibly hard time losing weight unless you drastically reduce your calorie intake from food. Which quite frankly, to significantly budget your nutrition just so you can still drink beer is incredibly asinine, and you’re probably going to fail anyway, so just do it. It is much easier to drink calories than to eat them. Which also means do not drink smoothies.\n\nOn that point, fruit is not this magical health food people think it is. Is it better than eating a bag of Sour Patch Kids? Absolutely, and it still has benefits for sure, but keep in mind that it’s still loaded with a ton of sugar and if you are hammering back fruit all day thinking you’re being healthy, you will struggle to shed weight.\n\nSecond, be as diligent and disciplined as you can with tracking your macros. Once you start doing this, you will likely be surprised how many calories you actually are taking in over the course of a day.\n\nThird, almost never cheat. You want to get into a good rhythm and routine where you don’t even consider eating shitty food. There are always going to be excuses around you to eat shitty, so if you constantly cave in you’re going to be going one step forward one step backward. This is especially the case with keto. Every time you cheat on keto, you’re taking your body out of ketosis and therefore it will take a few days to get the ball rolling again. Meaning if you cheat frequently, you’re never really getting into ketosis, and that’s why nothing is happening. The vast majority of people who say “keto doesn’t work!” are the people who drink or eat like shit every weekend as a “treat”, which means they never really get their ketosis really cranking, and therefore don’t lose weight. If you’re on keto, do not have frequent cheat days. It’s the worst thing you can do.\n\nFourth, drink a ton of water. A lot of the time you think you’re hungry, you’re actually just thirsty. If your piss isn’t clear, you need to increase your water intake.\n\nFifth, do not waste time doing exercise that “targets belly fat” but rather just exercise in general. Fat burning does not work like muscle building. You cannot centralize fat loss in a specific area like that.\n\nSixth, and the basic tenant and most important raw fact all weight loss diets share, you need to achieve a calorie deficit. It’s just that simple.\n\nLastly, just stick with it. When you can be honest with yourself and know you’re doing all the right things, trust the process. You will be in a good spot mentally and therefore you won’t stress about trying to rush your weight loss so much. It’s when you know deep down you’re not doing everything right but still living this outer delusion that you are, is when the train really falls off the rails and you fall right back into your habit.",
   "created_utc": 1703444071,
   "score": 39,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerwbwd",
   "message": "Cutting out soda.  But that was a jump start.  The rest is intense discipline; watching what you eat, how much you eat, and regular exercise.",
   "created_utc": 1703445637,
   "score": 20,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kervozr",
   "message": "I'm honestly eating less. Drinking more water \u0026amp; jumping rope a lot at the gym with some easy weight lifting. I've lost 3 to 4 lbs in about a month.",
   "created_utc": 1703445388,
   "score": 10,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqkho",
   "message": "Weight loss is all about energy balance. You can either be in a positive, neutral, or negative energy balance. It’s easier to consume less energy than it is to exercise it off, so focus on eating less.",
   "created_utc": 1703443369,
   "score": 53,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerr1ab",
   "message": "Not eating…",
   "created_utc": 1703443558,
   "score": 31,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kery619",
   "message": "Mediterranean style diet.  Eating mostly veggies and some fruit  Cutting out enriched carbs.  Lean protein , beans, lentils, and legumes.  Drink mostly water.  You get way full before you can over eat like this.  Enriched carbs and added sugar food items will often leave you feeling hungry after you eat.  Just stay away from that stuff and it'll have an impact.",
   "created_utc": 1703446363,
   "score": 5,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes5001",
   "message": "Depeession",
   "created_utc": 1703449143,
   "score": 6,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerwgf2",
   "message": "Taking that first step!",
   "created_utc": 1703445686,
   "score": 5,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes02f4",
   "message": "Thanks for the post, I picked up some tips for myself, I don’t know how to lose weight",
   "created_utc": 1703447135,
   "score": 4,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kervplq",
   "message": "* track what you eat\n* don't eat fast food\n* plan what you're eating in advance\n* do other activities when you normally snack (for example, do a puzzle when watching a sports game you would normally binge a bag of chips). \n* If you're serious about losing weight, let family and friends know and they will help",
   "created_utc": 1703445394,
   "score": 7,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerz9po",
   "message": "Carnivore diet (not on it anymore, but the pace of the results was shocking).",
   "created_utc": 1703446806,
   "score": 6,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqwgp",
   "message": "i cut out soda and watched my calories, i also do cardio for an hour every day. that’s just me tho",
   "created_utc": 1703443503,
   "score": 6,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "keru5td",
   "message": "Started counting calories and tripled my protein intake. Now I aim daily for 100g of protein and 1500c overall and I'm steadily losing weight and feeling good.",
   "created_utc": 1703444790,
   "score": 7,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqbzi",
   "message": "Eating less and moving more",
   "created_utc": 1703443273,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerwd72",
   "message": "80% low carbs\n20% sports",
   "created_utc": 1703445651,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes377y",
   "message": "For me it was all about taking little steps at a time:\n\n1. Intermittent fasting - skipping breakfast. Makes it much easier to be in a calorie deficit when you have 2 meals per day, rather than 3. I lost about 15kg through this way. \n\n2. Cutting out liquid calories. Switch to sweetener versions of your favourite drinks. I lost a few kgs through this way. \n\n3. Preparing at least some of your meals yourself, so that you know how many grams of protein, and overall calories you’re eating, for at least 1 of your meals. Once again, lost a few kgs through this method. \n\n4. Regular exercise - lifting heavy weights. This was more about body composition for me. \n\nBut whichever way you want to tackle it, and whichever methods you pick, to reuse an old cliche - it’s about picking something that is sustainable. In my older age, I’ve had to slowly ramp up the aggressiveness of my approach in order to achieve weight loss. But in the end all these small things added up to a lifestyle change, which was therefore more sustainable than just adopting an extreme diet.",
   "created_utc": 1703448405,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes3w64",
   "message": "Plan your meals out the day/night before. **This is not meal prep**.\n\nYou can do this to get calorie estimations and you’re not going to be stuck making decisions while you’re hungry.\n\nYou don’t even have to meal prep — just make a plan and stick to it, adjusting to fit your needs.\n\nYou can even plan snacks. “Oh I’m going to have an apple at 3, so I don’t need to graze right now”.\n\nPlanning to go out to eat with friends tomorrow? Plan the rest of your meals with that in mind and plan some light bites.",
   "created_utc": 1703448686,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes62wv",
   "message": "I don’t think my “trick” will work for everybody, but as a diabetic, I’m supposed to keep my A1C (3-month average glucose levels) at 7.0 or lower. As someone who’s struggled with weight issues my entire life and lost weight from dieting only to gain it all back, I had to change the way I thought about it. So, knowing I see my endocrinologist every 4 months, I decided that my motivation should NOT be trying to shed pounds, but to try for that 7.0 number. That did the trick. Lost 54 pounds over a six month span. Nothing with added sugar, no pasta, no bread. Drank only water, ate lots of salad. I managed to achieve my goal of 7.0, and for the month following the endo visit, I allow myself to eat (within reason) some pasta, bread and occasional sweet stuff. Seems to work for me.",
   "created_utc": 1703449592,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes6i3s",
   "message": "Intermittent fasting as a lifestyle change. I now often only eat dinner and have lost a lot of weight.",
   "created_utc": 1703449769,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerrp3o",
   "message": "Starvation diets won’t work cause you just gain the weight right back as soon as you stop and it’s not healthy. Try to balance healthy eating habits with a nonrigorous amount of exercise (going in a run like once a day) I also know a few people that lost a lot on a program called shibboleth so maybe try that.",
   "created_utc": 1703443820,
   "score": 5,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqfy7",
   "message": "Cut out the food with “o”s like Oreos, Cheerios? Spaghettios, etc",
   "created_utc": 1703443318,
   "score": 4,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqr9w",
   "message": "Being poor and drinking water",
   "created_utc": 1703443446,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerrkew",
   "message": "Drinking a lot of water and limiting portion sizes.",
   "created_utc": 1703443770,
   "score": 5,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerw8gp",
   "message": "Learn which foods are sustaining but you'll never overeat, and make those your go-to when you think you need something. If you look at those options and say \"Nah...\" you probably weren't actually hungry. Drink water instead.",
   "created_utc": 1703445600,
   "score": 5,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqsry",
   "message": "*lose",
   "created_utc": 1703443462,
   "score": 8,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerz5p5",
   "message": "Cut down on calories, with exercise. Or, just cut down the calories. In essence, burn more calories than you take in. That is all that’s to it. Unless you have some other physical condition that makes that not possible.",
   "created_utc": 1703446761,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerzfme",
   "message": "No workout, 500-700 below calorie maintain, have lost 12-13 kilo since Midt August this year.\nNever lost weight so easy before.\nI used lifesum to calculate my calories the first 2,5 month to help me with how much food I can eat.",
   "created_utc": 1703446874,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerztj6",
   "message": "Intermittent fasting. I stopped doing it in terms of a clear 16/8 but it really showed me how much I was eating and how much I really *needed* vs. what I wanted. \n\nIt helped me adjust to better, long term, eating habits which are like +90% of weight control.",
   "created_utc": 1703447033,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kesa88f",
   "message": "Loose? Get loose clothing to portray lighter weight",
   "created_utc": 1703451273,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kesd46d",
   "message": "landing on the moon. i'm 1/3 as heavy there.",
   "created_utc": 1703452441,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqg1t",
   "message": "I got pregnant and got really sick lost 10kg though.",
   "created_utc": 1703443319,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerujjc",
   "message": "There’s no trick. Consume less than you use in a day and make it a habit and you’ll see results quicker than you think. You can do it!",
   "created_utc": 1703444939,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes3upk",
   "message": "2 Easy rules- no apps, no counting calories, no fad diets. Just two simple things anyone can do:\n\n1. Eat all snacks while standing up, and only in the kitchen. Don't bring that bag of chips to the couch bc you'll eat way more. Also if you're watching TV and you know you're only allowed to snack in the kitchen, snacking suddenly doesn't sound as fun as just sitting there watching TV.\n\n2. Don't drink your calories.\n\nThose 2 tricks helped me lose 30lbs this year! It wasn't hard, I didn't feel deprived, it was just two simple things to focus on *not doing*.",
   "created_utc": 1703448669,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqqmx",
   "message": "im literally plant \n\neat sun like me - weight is for poor,sun for elite of society",
   "created_utc": 1703443439,
   "score": 3,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kert5dp",
   "message": "To give up tricks AND the idea of getting \"motivated.\" Motivation is a luxury earned by those that practice discipline.  FORCE yourself to go to the gym and limit food to 3 meals/day no snacks.  \n\nIt's physics.  You eat more calories than you use, you get fatter.  You spend more calories than you eat, you get thinner/more toned.  Nothing more than that, no tricks.",
   "created_utc": 1703444392,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqv1d",
   "message": "It’s really just a discipline thing. Nothing more, nothing less.",
   "created_utc": 1703443487,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerrwi8",
   "message": "Watching that Freaky Eaters show helps me get back on track. (There's full episodes on YouTube)",
   "created_utc": 1703443901,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerryq4",
   "message": "No carb",
   "created_utc": 1703443926,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerybhf",
   "message": "There are no tricks.  \n\n\nIn the case that the person is healthy its only about calories in versus calories out.  \nGo to the Gym or do serious exercise of your choice and start tracking calories.  \n\n\nAdjust if needed and do that for many months.",
   "created_utc": 1703446422,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes29or",
   "message": "Keto don't cheat changed my life and so easy to do",
   "created_utc": 1703448027,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqxjj",
   "message": "Calories out has to exceed calories in.",
   "created_utc": 1703443515,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerrj7w",
   "message": "I skipped breakfast, had a salad with protein in it or a yogurt for lunch, and stopped eating junk food and sugary stuff. \n\nPlease note: this was back before shrinkflation miniaturized individual yogurts.",
   "created_utc": 1703443757,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kersq31",
   "message": "Intermittent fasting is an absolute game changer.",
   "created_utc": 1703444224,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqk9t",
   "message": "How do people get this far in life not knowing how lose is spelled",
   "created_utc": 1703443367,
   "score": 2,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes05io",
   "message": "Just don't eat a bunch of carbs.\n\nCarbs make you fat. \n\nBasically drop French fries and sweets and you'll probably lose weight.",
   "created_utc": 1703447171,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kertq32",
   "message": "I wanna say smoking weed, but the munchies got me eating twice as much, yet I'm still losing weight. Although I guess it's because I walk everywhere I go...",
   "created_utc": 1703444623,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerzyeb",
   "message": "Keto. Drop the carbs every time I need to drop a few. Has yet to let me down other than my big ass getting complacent when I've reached the goal weight and it trickles back on slowly.",
   "created_utc": 1703447089,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes0nog",
   "message": "Lose*",
   "created_utc": 1703447377,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes2r61",
   "message": "I for one, learned the difference between lose and loose!",
   "created_utc": 1703448225,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerr3y6",
   "message": "2 workouts a day at least 4 days a week. No change to diet. 6 am and then again in the afternoon or evening. Downside is you're always washing your workout clothes and spending a lot of time exercising. But I dropped 20 pounds in a year, almost all fat.",
   "created_utc": 1703443588,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kery6g4",
   "message": "There is no trick actually, “Discipline” is the Key!",
   "created_utc": 1703446368,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerzg4z",
   "message": "Eat less, move more",
   "created_utc": 1703446880,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes14gn",
   "message": "The million dollar question… ignore people that say calorie deficit is the only way, it’s not. Calorie counting has been shown to be 90 percent ineffective and most studies show the weight coming back on the next year.\n\nThere are lots of options - keto, paleo, fasting, vegan, CICO and more\n\nJust be aware that your body will react different ways to different approaches and there’s no reason you can’t do more than one at once.\n\nMost of them have advice in common and that is- \n\nAvoid processed foods\n\nAvoid hyperpalatable (addictive) foods\n\nAvoid sugar, and artificial sweeteners.\n\nBeyond that IMO make sure you are satiated, and don’t take “conventional wisdom” for granted.\n\n(I am fasting and eating mostly keto style meals)\n\nBest of luck",
   "created_utc": 1703447563,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes16o3",
   "message": "I dumped her emotionally abusive ass.  Lost 120 lbs overnight!",
   "created_utc": 1703447588,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes10lb",
   "message": "Loose weight? I don't know what that means, but what helped me lose weight was working 2 jobs, not that it's a healthy option.",
   "created_utc": 1703447521,
   "score": 0,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerqh41",
   "message": "I strapped myself to a rocket and within seconds of takeoff my weight was down 50%",
   "created_utc": 1703443331,
   "score": 255,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kersouf",
   "message": "You have to burn more energy than you take in",
   "created_utc": 1703444211,
   "score": 255,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes5bp3",
   "message": "having no money to buy food. survived in fried potatoes, cheap bread with cheapest spread and sugar tea. lost around 15 kg in three months.",
   "created_utc": 1703449278,
   "score": 0,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9mc5",
   "message": "Eat one meal a day. But a small meal, then fast until the next day.",
   "created_utc": 1703451032,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "keru39x",
   "message": "A Type 2 diabetes diagnosis.",
   "created_utc": 1703444764,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerwim4",
   "message": "You have two options. Diet and exercise. Both together is optimal. If you hate exercise you’re stuck with dieting. The keto diet works great, cutting out all carbs, particularly anything made with grain or flour (bread, cereal, rice, noodles) and potatoes. At some point you’ll want to start eating carbs again if you don’t want to look emaciated, but you’ll want to find a balance so you don’t end up back where you were.",
   "created_utc": 1703445710,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerwv0i",
   "message": "Cutting out alcohol except for holidays and special events. Will power goes down the drain after even a single beer.",
   "created_utc": 1703445844,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerxo63",
   "message": "Ozempic, and I see a nutritionist and therapist to deal with proper diet and emotional eating so when I go off the drug I maintain healthy habits.",
   "created_utc": 1703446165,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerz6e7",
   "message": "Intermittent fasting.   \n\nOne year, I replaced my drink of choice with just water (plain water).  I did 8/16 ratio fasting every day.   For literally a year.   I counted my calories as well.   I did have health issues, like dizziness with this.   I ended up losing 60 pounds in a year though from just fasting.   \n\nHowever, I stopped this routine after going through some traumatic stuff and I am almost back at the weight I had started at.   After the new year, I plan on going back to some sort of fasting routine, but also combine it with excercise.  I am also just kinda concerned with the state of my back and knees as well which is why I want to really try to get in better shape.",
   "created_utc": 1703446769,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kerzo6h",
   "message": "I stopped drinking beer/ soda a lot  + drinking a lot of water helps",
   "created_utc": 1703446972,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes02aw",
   "message": "Better diet and excersize.  There is no trick",
   "created_utc": 1703447134,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes04n8",
   "message": "Divorce diet",
   "created_utc": 1703447160,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes057z",
   "message": "Putting all of my effort/energy into getting my mental and emotional health in a good place.",
   "created_utc": 1703447167,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes09o7",
   "message": "I tracked a bunch of things (eating breakfast, eating junk food, eating vegetables, exercising, weightlifting, drinking alcohol, meditation, hungry before bed, etc). I found that on days when I avoid alcohol, I exercise, and I go to bed hungry (after a reasonable dinner) I would *DEFINITELY* lose weight. I could even get away with a little junk food. \n\nThe hurdle for me was keeping motivated. It’s so difficult to deprive yourself and then find you’ve made no progress. \n\nFind your combination that equals you will definitely lose weight, and do that. Merely knowing I have control is so helpful.",
   "created_utc": 1703447218,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes0lda",
   "message": "Got salmonella. Lost 5kg in a fortnite. So yeah, find some raw chicken or something.\n\nIn all seriousness it was horrible but people told me I looked great afterwards.",
   "created_utc": 1703447350,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes0oz8",
   "message": "eating more, more regularly.   I was under eating to far.  learning your requirements and being able to calculate in extra effort HONESTLY is the key.  also all those little things people say dont count…..do.",
   "created_utc": 1703447391,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes0pfp",
   "message": "Intermittent Fasting and exercise (tennis)",
   "created_utc": 1703447396,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes0q1a",
   "message": "Eat less and exercise more.",
   "created_utc": 1703447403,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes0tbc",
   "message": "Eating less, simple as that",
   "created_utc": 1703447440,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes0unb",
   "message": "When I gain unwanted weight, I do the unhealthy thing and eat almost nothing for a couple days. Just a few vegetables and vitamins.",
   "created_utc": 1703447455,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes12ee",
   "message": "Cutting out any sugary drinks; soda, juice, gatorade, etc.\r  \n\r  \nWould've lost my mind were it not for aspartame.",
   "created_utc": 1703447541,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes143e",
   "message": "Putting less food on my mouth 😂",
   "created_utc": 1703447559,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes16ox",
   "message": "i would just eat around 900 kcal each day for a few weeks, mainly fruits, yogurt, grilled chicken and some vitamin supplements, eating 4 times per day, no exercises , after 1 month I've lost 9 kg, then i wanted to take a break from the diet and started to slowly eat a little more each day for like 2 weeks you need to slowly get away from the diet because if you stop it abruptly you start gaining the weight back.\n\nThen i would take a break, and come back to the diet for another 2 weeks maybe depending on how i'm feeling, losing another 2 kg then slowly getting back to my normal eating habit of around 1800 kcal per day and keep doing this. Start the diet, lose some weight, take a break, start the diet, lose some weight and so on. If done right you lose weight without really having to do anything much, you still eat, at the same time the low amount of food makes your stomach smaller so you cant really eat a lot anymore, and you don't put it back when you stop the diet if you eat less then 1800-2000 kcal and don't abruptly stop the diet and also feel full faster because of the smaller stomach.\n\nIts pretty easy, i don't know why people say its hard",
   "created_utc": 1703447588,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes1s5d",
   "message": "My trick is being underweight for all of my life, no matter what I eat.",
   "created_utc": 1703447828,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes261g",
   "message": "I eat when I’m hungry but I eat about half portions.  I also do 5-6 hours of cardio weekly.",
   "created_utc": 1703447987,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes27tr",
   "message": "Chemotherapy",
   "created_utc": 1703448007,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes287k",
   "message": "Physical activity. Lots of it. I would rather work my ass off than not eat what I want.",
   "created_utc": 1703448011,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes29p1",
   "message": "I dropped sugar from my diet. It was not easy. Natural sugars were ok. So Mellon and other fruits became my main snacks. Took a while to get used to coffee without sugar but the rest was pretty hard too for the first couple few weeks.  Dropped 20lbs in 3 months. Eating as much as I wanted but no sugar, soda, honey or bread.",
   "created_utc": 1703448027,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes2any",
   "message": "I lost weight by not eating diet food. I ate what I normally ate just counted the calories and measured the portions. I don’t drink any soda (seltzer is fine) or juice. Juice is a calorie suck. So are smoothies for the most part. And I used an app ( I chose Lifesum but there are a ton of excellent and free apps) to log my food and activities which helped keep me honest. Good luck!",
   "created_utc": 1703448038,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes2bft",
   "message": "Just show up everyday.",
   "created_utc": 1703448047,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes2cjy",
   "message": "low carb is the only thing that works for me. Unfortunately. \n\nI've tried calorie counting and it doesn't work if I'm eating even whole grain carbs. :(",
   "created_utc": 1703448059,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes2ucr",
   "message": "**Intermitent Fasting** and low HC\n\nSleep\n\nRegular Exercise",
   "created_utc": 1703448260,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes38ly",
   "message": "Diet plan’s over complicate stuff. Never mind making low carb cake out of wheat biscuits, or bread out of an egg and a handful of grass. Go back to basics - eggs, good meat, fresh veg, limit bread, pasta etc, a treat here and there, and you’re laughing. When you get confused by over complicated recipes you lose heart and that’s why diets fail. Simple is effective!",
   "created_utc": 1703448421,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes38wj",
   "message": "Count alcohol when counting calories (if you drink).",
   "created_utc": 1703448424,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes3lxz",
   "message": "Keep my food as natural as possible \n\nFor example rice is a better option than pasta, chicken is great but deep fried and battered not so good, steak yes but not smothered in sauces/gravy \n\nCauliflower and cheese...without the cheese\n\nSalads without salad dressing etc",
   "created_utc": 1703448570,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes3t42",
   "message": "r/loseit really helped me. Calories In Calories Out is really all it takes but the advice and people on there made it much easier for me. It's got to be one of the top subs justifying the existance of Reddit",
   "created_utc": 1703448651,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes3vor",
   "message": "At the end of the day the name of the game is maintaining a calorie deficit.\n\nWater soluble fiber supplements taken with at least 8 oz of water 30-45 minutes before meals helps you feel full faster, but the biggest thing will always be \"don't serve yourself more than you need/eat smaller portions\"",
   "created_utc": 1703448680,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes3you",
   "message": "Opiate addiction \n\n1/10 do not recommend, too many dangerous side effects but still very enjoyable",
   "created_utc": 1703448714,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes46qr",
   "message": "After years of research the conclusion is ..... eat less.",
   "created_utc": 1703448805,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes49bb",
   "message": "Small meals throughout day.  Eat only what a caveman could eat.  Berries, fruits, eggs nuts in am.  Meat and veggies afternoon.  Exercise naturally like hiking.  \n\nMillions of years of evolution we did this.  Then on the industrial age we stopped and ate processed foods and didn't need to work hard to eat (excercise)  \n\nIt's what our bodies are evolved to do.  Do it",
   "created_utc": 1703448835,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes4g8u",
   "message": "I lose weight in the summertime and try not to regain it during winter.\n\nA big breakfast in the morning then basically only drinking (sweet tea, apple juice) till the late evening. A light dinner and then go to sleep. \n\nNo lunch or snacks during the day",
   "created_utc": 1703448914,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes4jv8",
   "message": "Quit drinking beer.",
   "created_utc": 1703448956,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes4mqq",
   "message": "Here are a few:\n-intermittent fasting \n-when I get take out I immediately portion my dish into two - one for now, one for later\n-getting enough sleep and water",
   "created_utc": 1703448990,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes4pwd",
   "message": "Treadmill for 1 hour at 3.5 speed on an incline of 6.0.\n\nTwice a day. Work up to going twice a day. You will know when you’re ready.\n\nYes you have work up to that. I started at 2.5 speed with zero incline for 15 minutes. Each day I would add 30 seconds until I was at 1 hour. The I would start to increase the speed each week by .1 . After I made it to 3.5 I started to increase the incline. Be careful with the incline, if your feet start to hurt, lower the incline for a couple of days or a week depending on you feel. Then start again. Fight the urge to start running, because you will mess up your knees. Being heavy and running is bad for the knees. Lose the weight first. I’ve made all the mistakes so you won’t have to. \n\nTake pre-workout in days you don’t feel like going to the gym. That will give you the energy to go to the gym.\n\nDrink a gallon of water a day. Fat leaves the body as water vapor through the lungs when you exhale.",
   "created_utc": 1703449026,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes4tjj",
   "message": "Drinking plenty of water and walking everywhere if I had the time to spare. And I started kickboxing. I don’t even need to count calories and I’m -30 kg after 6 months.",
   "created_utc": 1703449068,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes4tyf",
   "message": "Sticking to water",
   "created_utc": 1703449073,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes4vfs",
   "message": "Vegan no sugar no oil no junk food, very very seldom restaurant dinner. Lost first 50lbs in about 4 months eating a TON of food, stuffing myself and making homemade desserts with dates walnuts etc. Never going back. After the first 50, I had to reduce the quantity to break my plateau",
   "created_utc": 1703449090,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes53rz",
   "message": "Quit dairy, quit soda/sugary drinks and replaced them with water, stopped eating a lot of processed sugar and replaced it with fruit, eating more chicken and fish instead of red meat, and started walking at least a mile 4 to 5 times a week. Slowly lost 80 pounds over the last 3 years and only have 10 more pounds to my goal weight. All of these changes were not all done at the same time, I just added on more changes as I went. I feel great! :)",
   "created_utc": 1703449187,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes553k",
   "message": "Divorce. Lost my appetite after that.",
   "created_utc": 1703449203,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes59ij",
   "message": "Exercise, sleep and cutting down on carbs always works for me",
   "created_utc": 1703449253,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes5f4o",
   "message": "Keeping alcohol intake minimum or cutting it off completely.",
   "created_utc": 1703449317,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes5hrm",
   "message": "All the stuff you hate to hear works. It works. Slowly, and sometimes the number won't change as much as your body does (I've lost dress sizes worth of fat, but I gained enough muscle that my weight hasn't actually gone down much.) But it does work. And if it doesn't work for you, see a doctor and tell them so, but keep at it unless said doctor tells you to stop. \n\nThe \"tricks\" to it are to find workouts you enjoy or non-food rewards for tolerating workouts you don't, find healthy food that you like that isn't just a substandard imitation of unhealthy food you like, and don't completely ban yourself from ever having those unhealthy foods again (\"sometimes foods,\" sound dumb but you're less likely to relapse into eating nothing but unhealthy junk all the time if you know you're still allowed to have them sometimes).",
   "created_utc": 1703449348,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes5jel",
   "message": "Hunching for downvotes:\n\nA whole food plant based diet. (Including no or little added oils. Restricting added sugar.)\n\nFor the first time in my life I both loosed weigh and after a year kept it. Without restricting calories. I can just say it’s amazing. And I love my new diet with so many new recipes.",
   "created_utc": 1703449366,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes5o47",
   "message": "Weight Watchers",
   "created_utc": 1703449421,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes5o7q",
   "message": "By far the biggest change was cutting out sugar, I lost 45lb in 3 months without making any other changes.  The next biggest thing, you gotta move.  Calories in-calories out.  If the second is more than the first, you'll lose weight.  There is no other way.",
   "created_utc": 1703449422,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes60qj",
   "message": "Stop drinking anything besides water.  \nRiding bicycles/skateboarding again.",
   "created_utc": 1703449567,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes68eo",
   "message": "Burn more calories than I ate.\n\nI went from 315 ish lbs to 225lbs in a year. I didn't change my diet or snacking, just increased my activity level a lot. If you wanna keep it off you gotta keep track of how much you burn and how much you eat.",
   "created_utc": 1703449658,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes69xa",
   "message": "I became a major alcoholic for about 3 months and would stopped eating in favor of drinking. I lost almost pounds in that time. Would not recommend.",
   "created_utc": 1703449675,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes6e6k",
   "message": "Getting medicated for my adhd.",
   "created_utc": 1703449724,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes6gqk",
   "message": "Less sugar, and shitty foods.",
   "created_utc": 1703449753,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes6i24",
   "message": "Divorcing my husband. The amount of stress and anxiety that was causing the downstream impact of emotional eating / sleep issues / depression / lack of movement cannot be understated.",
   "created_utc": 1703449769,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes6yrs",
   "message": "It’s the Candy/Snacks for me, what for other people cigaretts or alcohol is, is/was Candy for me and Lots of other people, if I‘m in stress A Mars Bar here, if I’m sad or angry a Bag of Salt and Vinegar chips there, If I have a withdrawal effect a Buch of sweets and snacks combined with a ton of monster energy drinks/ Cokes. Many people underestimate the Sugar/fat/ Carb intake or Straight up play it down for example: „This energy Bar has so much protein and less Sugar, but one is to little for me let me it 4 of them“ and then you has as much carb intake aş eating 2 Snickers… Cut the sugar no matter in solid, vapor or liquid form, there are no healthy sugars or fats…",
   "created_utc": 1703449960,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes72qy",
   "message": "heroin",
   "created_utc": 1703450006,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes76lh",
   "message": "Weight loss surgery. No shame in it.",
   "created_utc": 1703450050,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes7pfd",
   "message": "Cut out all refined Carbs!",
   "created_utc": 1703450259,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes7scv",
   "message": "Smaller portions, and daily exercise - usually walking.  I love the mini cookies:  Twenty mini vanilla wafers in a serving!  If you only eat 5 you still feel satisfied but not overloading calories.  My trick is not letting myself feel deprived, I guess.",
   "created_utc": 1703450291,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes7sqr",
   "message": "First I cut out drinking every day. Then i stopped buying snacks and crisps, I am not safe around crisps and the only way is to have no biscuits snacks etc. Then i started walking briskly 30 mins as many days as I could. After the drink was cut i lost almost a stone, removing the snacks and walking almost another stone. over a year maybe, not quickly. Diets do not work, nothing time limited will work, you have to \\*change\\* your diet, for good. And the less I eat, the less i wanted to eat if that makes sense.",
   "created_utc": 1703450295,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes7ti8",
   "message": "Take a break from 🍺",
   "created_utc": 1703450303,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes7uti",
   "message": "I eat everything I want within my alloted calories",
   "created_utc": 1703450317,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes837n",
   "message": "Going carnivore. High protein and high fat fills you up with proper nutrition",
   "created_utc": 1703450412,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes83hk",
   "message": "Eating the good stuff first. Knowing what my body really craves when I want crisps or cookies. Having healthy stuff available at all times and eating that before eating the unhealthy stuff I actually want to eat. Turns out, after eating the good and healthy stuff, I rarely feel hungry for the other stuff anymore.\n\nAlso dinner cancelling. That was a tricky one because I'm not a breakfast person, but not eating anymore 3-4 hours before going to bed really helped me.",
   "created_utc": 1703450414,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes8pnd",
   "message": "I replaced breakfast and lunch with ready-to-drink protein shakes; even having whatever I want for dinner, I lost ~25 lbs.",
   "created_utc": 1703450664,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes8z5x",
   "message": "Eating less calories then you burn off! Really that simple.",
   "created_utc": 1703450771,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes90mj",
   "message": "Stop eating so much",
   "created_utc": 1703450788,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes95lo",
   "message": "Calorie count. Diet 5:2. konjac fibre filler tablets. Some exercise. But definitely the end goal is calorie deficit.\n\nTrying to stick to it.",
   "created_utc": 1703450844,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes98dr",
   "message": "Sought professional help \u0026amp; reverse dieting. A lot of people should reverse diet before they go into a cut (diet), because you can’t take away calories if you’re only eating 1500 calories already. I learned this from my educated \u0026amp; certified trainer. I’ve lost 15 lbs this year, \u0026amp; 6 lbs were lost during the reverse stage.",
   "created_utc": 1703450876,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9b79",
   "message": "Semaglutide",
   "created_utc": 1703450909,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9bd0",
   "message": "Water.\n\nDropped all other drinks; soda, juice, energy drinks, all of it.\n\nAfter a couple weeks of the only liquid I drank being water, I started allowing myself a couple cups of black coffee in the mornings. It wasn’t a big issue but I stopped eating later but otherwise did not change much else in my diet and I lost 80lbs in a year.",
   "created_utc": 1703450910,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9h59",
   "message": "What everybody says. Eat less, move more.",
   "created_utc": 1703450975,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9h6q",
   "message": "I quit drinking",
   "created_utc": 1703450976,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9lgl",
   "message": "I've seen a lot of people have success losing weight with meth.  Upgrade your dental plan first and take vitamins.",
   "created_utc": 1703451022,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9noh",
   "message": "Ozempic. Full stop",
   "created_utc": 1703451047,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9orw",
   "message": "Intermittent fasting combined with strength training at the gym. Lost 10 kg in 4 months and gained quite a bit of muscle. The strength training didn't do that much for weight lost but it forced me to switch to a diet that was higher in protein and lower in carbs.",
   "created_utc": 1703451060,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9swl",
   "message": "I tried being a prison nurse (I’m a maternal/newborn nurse at heart but prison is where that shmoney is) and also fell head over heels for someone who was wanting to fuck around with me but I was too heart-eyed to notice. Fell into a deep depression, hated the environment I worked in. Stopped eating almost entirely and when I wasn’t working I’d go to my high school track to just run. For hours and for miles. I’d routinely run up to 6 or 7 miles a day. Within 2 or 3 months I’d lost about 70lbs. I’m a tall female too, nearly 6 feet tall. \n\nIt’s so hard to do this type of hardcore self-abuse when you intentionally do it for weight loss, but fuck… throw in hating work and also going through a heartbreak and that shit becomes effortless.",
   "created_utc": 1703451106,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9t4v",
   "message": "Having a plan on what to eat.\n\nNo snacks or breakast. Only lunch, and fruits and vegetables for dinner.\n\nLunch would be a single portion and not until I'm completely full.\n\nDinner was usually one to one and a half plates of fruit and vegetables (uncooked).\n\nI also did a bit of calorie counting. Rice, bread and noodles are a bad idea. Potatoes are decent. Nuts are fucking terrible, same as meat. Shurimi (pressed fish protein) is extremely good as it has barely any calories and tons of protein. Eggs are also nice. Cheese is okayish.\n\nIf you need to eat meat, eat chicken or rabbit. As it has the least calories.\n\nMy favorite food was to eat Shakshuka.",
   "created_utc": 1703451108,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9tam",
   "message": "don't eat at night/close to bedtime",
   "created_utc": 1703451110,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9vj1",
   "message": "Here is that worked for me very well.  \n1) Cut out sugar and carbs.  I was eating fat grilled meat, vegetables, eggs and such. Very tasty, no problem at all to sustain it for long time.  \n2) Weigh yourself every morning after going to WC. This will show you your progress and keep you motivated. Sometimes where is no visible change, but scale will show the true state.  \n3) Stop eating breakfast (that is start intermittent fasting). It saves time in the morning as well. I have kept this as part of my life, and I see only benefits.  \n4) Go to a gym, and do high intensity resistance training like 5x5 stuff. The goal here is not to keep getting stronger, but rather to improve the hormone response and help to maintain muscle mass.  \n\n\nAnd most important of all, do not get to hard on yourself. It is impossible to keep to a regime for a long time, but you can be flexible. Making some effort is better than none. So have cheat meals, have some fun, it will slow progress, but is going to keep things sustainable. In essence if your current lifestyle is adding pounds, you want to adjust it just enough to start loosing them. Where is no need to chance optimal solution.  \n\n\nAn average male can loose \\~2kg of **fat** a month in a healthy and sustainable fashion. This might not seem much, but most non obese individuals need to loose less than 10kg to get to an ok spot.",
   "created_utc": 1703451136,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kes9xcn",
   "message": "Grilled/baked chicken, smoothies with spinach, salad. It's 90% diet and 10% exercise.\n\nPutting on muscle is more 50/50, but losing weight is all about CICO and eating healthy",
   "created_utc": 1703451155,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kesa10s",
   "message": "Eat less food, stop putting food in my mouth sooner than normal. If I just wait a few minutes, that rush to keep eating goes away.  Must put the fork down sooner.",
   "created_utc": 1703451195,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kesa4zl",
   "message": "Nicotine pouches. Boost metabolism and help suppress appetite.",
   "created_utc": 1703451238,
   "score": 1,
   "submission_id": "18q1212"
  },
  {
   "comment_id": "kesb4fs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18q1212"
  }
 ]
}