{
 "submission_id": "18q2hpk",
 "title": "What historic fact keeps you awake at night?",
 "selftext": "",
 "created_utc": 1703447666,
 "permalink": "/r/AskReddit/comments/18q2hpk/what_historic_fact_keeps_you_awake_at_night/",
 "score": 93,
 "url": "https://www.reddit.com/r/AskReddit/comments/18q2hpk/what_historic_fact_keeps_you_awake_at_night/",
 "comments": [
  {
   "comment_id": "kesg3f0",
   "message": "The fire that destroyed the former royal castle Tre Kronor in Stockholm in 1697. The fire destroyed the state archives, wiping out about half a millennium of written sources on Swedish history.",
   "created_utc": 1703453663,
   "score": 22,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kese0rz",
   "message": "The Bronze age collapse. Around 3200 years ago nearly all ancient civilizations in the eastern mediterranean and Near East region were wiped out in a widespread event/societal collapse that was likely sudden and violent and followed by the Greek Dark Ages and nobody *really* knows what happened. It just blows my mind.",
   "created_utc": 1703452798,
   "score": 163,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keshfga",
   "message": "Man went from the first flight in 1903 to landing on the moon - Apollo 11 in 1969. That was a period of 66 years. \n\nThat was 54 years ago.",
   "created_utc": 1703454216,
   "score": 219,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keska9j",
   "message": "The people who lived when the Roman Empire fell didn't know that the Roman Empire was falling. Such a thing could only be seen in hindsight.\n\nWe never know if we live in such times.",
   "created_utc": 1703455439,
   "score": 248,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes78ek",
   "message": "The Webb telescope has the power to see up to 13.5 billion light years away. The earth is about 4.5 billion years old. That means the Webb telescope is taking pictures of things that happened 9 billion years before the earth even existed.",
   "created_utc": 1703450071,
   "score": 130,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesi1oi",
   "message": "Dinosaurs evolved millions of years before flowering plants. Blows my mind.",
   "created_utc": 1703454481,
   "score": 12,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes9pl9",
   "message": "People just said fuck it I can just tough it out, when having a whole ass arrow stuck in their face with zero antibiotics.",
   "created_utc": 1703451069,
   "score": 231,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesng5k",
   "message": "How little of human history was recorded or survived the ages. Modern humans have been around 300,000 years. Recorded history only goes back to the 4th-5th millenium BCE.\n\nUncounted humans lived, loved, suffered, created, and died for 60-70x the time of all recorded history.",
   "created_utc": 1703456802,
   "score": 14,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes3a9n",
   "message": "Four hundred years ago a trip from Europe to America took two months. Now it takes between seven to thirteen hours.",
   "created_utc": 1703448439,
   "score": 0,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesgnca",
   "message": "This is so niche, but every time I get on a Mary Queen of Scots reading kick, I get re-obsessed with the [death of Darnley.](https://en.m.wikipedia.org/wiki/Murder_of_Lord_Darnley) It's essentially unsolvable at this point, but everybody involved is acting so weird. \n\nShort version is that Mary and her husband Darnley are in a tense, unhappy marriage. He's staying at a house, she's staying at a castle somewhat nearby. She visits him at one point that night, then leaves to do other social stuff. He stays. The house explodes due to a ton of gunpowder in the cellar that didn't really have a good reason to be there? Mary is fine, she's far from the site. The servant who was still in the house dies, apparently looking like you would expect  somebody to look who was in a giant explosion. Darnley, however, is found dead some distance away, partially dressed and apparently strangled (based on Tudor-era forensics, so who knows). Another servant is found with him and is in similar condition (half naked, strangled). \n\nIt's kind of like the Jon Benet Ramsey case in that there's a lot of theories that explain about 95% of the facts while still leaving a few key elements out to bother you. If Mary knew about the plot, would she have risked visiting the house after it was full of gunpowder? If she didn't, was she supposed to be a target as well? Did Darnley figure something out and make a run for it, or was he in the orchard just because he got thrown there in the explosion, and the people who examined him assumed he was strangled because they hadn't seen many people die from having their internal organs liquified by a huge explosion? Was he half naked because he woke up in the middle of the night and started running, or because explosions can rip clothing off people?\n\nThere were trials and confessions, but they were highly political and the interrogation methods of the time were pretty aggressive. It's all just very strange and complicated and it always sticks in my mind. What was supposed to happen? What actually happened? History could have gone so differently if Darnley had lived or Mary had died that night.",
   "created_utc": 1703453891,
   "score": 241,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesboww",
   "message": "That its a certainty that people who were as smart as Einstein lived and died working in sweatshops, agricultural fields, and as chattel slaves.",
   "created_utc": 1703451862,
   "score": 192,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keshytb",
   "message": "It doesn't keep me up at night, but it's an interesting fact: The oldest person alive right now is 116 years and some days. That means that 117 years ago, every single person on this planet was different. In other words, a whole new set of people are here. 117 years was not that long ago.",
   "created_utc": 1703454447,
   "score": 172,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes1mcx",
   "message": "The time between copper swords and steel swords is longer then the time between steel swords and atomic bombs.",
   "created_utc": 1703447761,
   "score": 247,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes86j2",
   "message": "Genius Khan once killed so many people in a fairly short span of time that scientists are able to detect a fall in atmospheric CO2. It was some insane number like two million people in six months.",
   "created_utc": 1703450448,
   "score": 96,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes6opz",
   "message": "28 years ago the jerk upstairs over my condo was born and he never learned how to be quiet at night.",
   "created_utc": 1703449845,
   "score": 104,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes40jk",
   "message": "The ruins of Pompeii. I never stop being amazed at how those corpses were preserved, it’s so tangible.",
   "created_utc": 1703448735,
   "score": 251,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes1om5",
   "message": "Not really a historic fact but thinking about the number of humans being held in captivity against their will and undergoing gosh knows what kind of torture does fuck me up to no end",
   "created_utc": 1703447787,
   "score": 63,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes25v1",
   "message": "Constantinople fell because some doofus left a gate open. This triggers me to this day.",
   "created_utc": 1703447985,
   "score": 47,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesmhnu",
   "message": "All of us are alive because some prehistoric person somehow survived impossible odds.",
   "created_utc": 1703456392,
   "score": 47,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesiwfe",
   "message": "The Soviets may have lost nukes during the Cold War and never recovered them.",
   "created_utc": 1703454840,
   "score": 211,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kescc9r",
   "message": "Major electric companies including GE \u0026amp; Philips got together in the 1920s to form the Phoebus cartel so that they could agree to intentionally lower the lifespan of lightbulbs.\n\nWe had the technology for long-lasting lightbulbs. Profit-chasing execs said nah let's create low quality products so we can cash in.\n\nWhat else are we keeping from ourselves?",
   "created_utc": 1703452125,
   "score": 43,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesamrb",
   "message": "The fact that human civilization only still exists because one Soviet Naval officer disobeyed a direct order to fire a nuke at the US",
   "created_utc": 1703451436,
   "score": 42,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesgyqo",
   "message": "That had Boudicca won that last battle against Gaius Seutonius Paulinus, The entirety of modern human history would be different. So very, very different. People just don't appreciate how much so. It drives me mad thinking about it.",
   "created_utc": 1703454019,
   "score": 151,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesl1jb",
   "message": "Unit 731",
   "created_utc": 1703455766,
   "score": 157,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesergc",
   "message": "Less a single fact and more a trend that over and and over again leaders think conflicts they start will be easily won but they turn into quagmires or drastically escalate and cause massive wastes of human life.\n\nAnd modern day leaders are no different but they have nukes now.",
   "created_utc": 1703453102,
   "score": 56,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesfxfl",
   "message": "A prehistory fact that keeps me awake: The Permian extinction event, the worst extinction ever, has many metrics that are comparable to today. Increased atmospheric CO2, climate change, acidic rain etc.\n\nAt current rates we are speedrunning it. And we also have humans in the mix. A species that are really good at whatever they are motivated to achieve. And the main motivator in the end is IMHO short term survival like all other animals.",
   "created_utc": 1703453593,
   "score": 97,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesgof1",
   "message": "Most of the American males my age are dead.",
   "created_utc": 1703453903,
   "score": 7,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes5nop",
   "message": "Honestly, the fact that there were massive parties thrown during the 1918 flu pandemic while people were literally dying in the streets. Kinda eerie how history doesn't just rhyme sometimes; it full-on repeats. Makes you think about how we handle stuff today, ya know?",
   "created_utc": 1703449416,
   "score": 35,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesgkpx",
   "message": "On June 28th 1998, the Undertaker threw Mankind off \"Hell in a Cell\" and plummeted sixteen feet through an announcer's table.",
   "created_utc": 1703453862,
   "score": 81,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes3as7",
   "message": "I will never forgive Spain for destroying the Codices of the huge indigenous empires. So much history lost for a fucking parasite of an empire",
   "created_utc": 1703448445,
   "score": 208,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesmvh6",
   "message": "Guillotines weren’t banned worldwide until the 80’s.",
   "created_utc": 1703456555,
   "score": 182,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesscug",
   "message": "That Jewish kids who fit the Aryan standards during the Holocaust were taken away and placed with German families and basically brainwashed to be German in some Germanization project \n\nThem poor kids.",
   "created_utc": 1703459026,
   "score": 155,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesqz9n",
   "message": "In the midst of one of the World Wars, in the dark of the night in Istanbul, a group of Greek soldiers accompanied a Greek Orthodox priest on a mission to break into Hagia Sophia and celebrate an Orthodox Liturgy.\n\nNot only that but they snuck out afterwards and nobody knew until later when the priest and soldiers told the story.",
   "created_utc": 1703458383,
   "score": 199,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keso5xy",
   "message": "That Noah's Flood might be a real thing - the black sea flooding from the med",
   "created_utc": 1703457120,
   "score": 35,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keskvoa",
   "message": "If you go back 40 generations in your family tree, or roughly 1000 years, you will have a trillion forbearers. The only problem is that there haven’t been that many people ever, which means we all have substantial inbreeding in our families.",
   "created_utc": 1703455693,
   "score": 126,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesn0q8",
   "message": "The Nazi ideology in the 21st century and the fact that people would rather be ruled by a dictator than have a great free country. Mind blowing.",
   "created_utc": 1703456616,
   "score": 60,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kescyb1",
   "message": "The absence of Prussia in our modern World",
   "created_utc": 1703452374,
   "score": 133,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keseehe",
   "message": "The oldest known names belong to two slaves and their enslaver. Slavery is one of the oldest human institutions.",
   "created_utc": 1703452953,
   "score": 254,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesh65u",
   "message": "That putin is still alive and is giving orders to bomb Ukrainian cities and kill us.",
   "created_utc": 1703454106,
   "score": 106,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kestmlt",
   "message": "World population was 2.5 billion in 1950, in 2023 we crossed the 8 billion mark",
   "created_utc": 1703459625,
   "score": 233,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes58cw",
   "message": "The fact that Genghis Khan make like 10% or whatever of today’s people in Mongolia or whatever. \n\nIt’s like I know I can pop off multiple times a day, but just EXACTLY how many girls did he poon?\n\nIt’s crazy.",
   "created_utc": 1703449240,
   "score": 167,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keshh1k",
   "message": "Both world wars happened because a guy decided to stop at his favorite restaurant for a sandwich",
   "created_utc": 1703454235,
   "score": 47,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes68y4",
   "message": "The burning of the Library of Alexandria. \nDamn...",
   "created_utc": 1703449664,
   "score": 220,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "keshp8i",
   "message": "Four out of the five mass extinctions on the planet occurred with high levels of CO2 in the atmosphere and there is a higher amount of CO2 in the atmosphere now than during any of those mass extinctions",
   "created_utc": 1703454332,
   "score": 117,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kes62be",
   "message": "Ticks' jaws resemble two saw blades, they do a breast-stroke motion with their jaws to dig into your flesh, then they wriggle their head in. Think about that next time you have a tick.",
   "created_utc": 1703449586,
   "score": 167,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesho10",
   "message": "That it is 2016 in Ethiopia right now, they use a different calendar from everyone else.",
   "created_utc": 1703454317,
   "score": 8,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kess5si",
   "message": "I’m blown away by the early mathematics that was achieved by guys who were literally inventing the concepts.",
   "created_utc": 1703458934,
   "score": 236,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ket1dgy",
   "message": "[deleted]",
   "created_utc": 1703463330,
   "score": 254,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesv3bz",
   "message": "The pale blue dot image from voyager 1.  It shows the earth as a tiny speck.  Basically all of the amazing and horrible things that have ever happened in earth’s history occurred inside this tiny speck in the unbelievably massive universe",
   "created_utc": 1703460318,
   "score": 178,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ket6xn4",
   "message": "As a pregnant lady, the fact that enough women got pregnant and gave birth to sustain human population growth for millennia before modern medicine. Holy hell it sucks now, and my babies and I have a much higher chance of survival than ever before.",
   "created_utc": 1703466039,
   "score": 186,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ket03ls",
   "message": "Mankind took tens of thousands of years to develop metal-working, but the lives of Orville Wright and Neil Armstrong overlapped by 18 years.",
   "created_utc": 1703462732,
   "score": 246,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesg47t",
   "message": "Julian the Apostate died because he was in a hurry and didn't want to wear his armor. If he had survived and continued as Emperor, world would be very different.",
   "created_utc": 1703453672,
   "score": 159,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesrrsn",
   "message": "All the lost cities and civilisations beneath the waves or sandy deserts.",
   "created_utc": 1703458751,
   "score": 146,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesy5gp",
   "message": "That I have ancestors that raised Kids from Stone Age till now, survived Wars, all kinds of Collapses and Diseases. Somehow someone in each generation made it through all these hard times so that I can be here, sitting on my couch with a mobile phone.",
   "created_utc": 1703461795,
   "score": 145,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ket3ku0",
   "message": "Charlie Chalplin entered a Charlie Chaplin Look-a-Like contest and came in third.",
   "created_utc": 1703464371,
   "score": 2,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesnjgm",
   "message": "the first hand accounts of people wandering through what the mongols left behind after destroying their enemy",
   "created_utc": 1703456843,
   "score": 67,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesxdvn",
   "message": "Several hundred thousand years ago, the entire human population was reduced to less than 2000 individuals.\n\nWe were scarily close to extinction. \n\nAnd by human, I mean every species in the genus Homo. Not just us sapiens.",
   "created_utc": 1703461424,
   "score": 71,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ketdrz6",
   "message": "We don't know a damn thing of what the gods and myths of the people who first inhabited England are and we likely never will.\n\nThe Scots, Welsh and Irish have their own myths and legends that have survived and passed down. But what is now England was battered so much over the years by Roman, Anglo-Saxon, Viking and French invasions. That there is little to nothing left of what was there originally.\n\nIts why Stonehenge is such a big deal to England. It looks like a pile of rocks to most, but its one of a few things left of that forgotten people. We know it to be a shrine or an altar, but to what ancient gods we'll never know. I find that rather sad.",
   "created_utc": 1703469623,
   "score": 62,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ket09vl",
   "message": "We live closer to T-Rex than the T-Rex lived to stegosaurus.",
   "created_utc": 1703462815,
   "score": 175,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesrlo7",
   "message": "By the time of cleopatra, the great pyramids were already over 2000 years old!",
   "created_utc": 1703458672,
   "score": 155,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ket1p95",
   "message": "For 3 Billion years the only life on earth was single celled",
   "created_utc": 1703463486,
   "score": 52,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "ketdmpx",
   "message": "Ancient Egypt had archeologists, who studied even more ancient Egypt, because dynastic Egypt lasted such a ridiculously long time",
   "created_utc": 1703469544,
   "score": 98,
   "submission_id": "18q2hpk"
  },
  {
   "comment_id": "kesuaxe",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18q2hpk"
  }
 ]
}