{
 "submission_id": "18q616o",
 "title": "What is your example of “the most expensive thing is not necessarily the best thing”?",
 "selftext": "",
 "created_utc": 1703458959,
 "permalink": "/r/AskReddit/comments/18q616o/what_is_your_example_of_the_most_expensive_thing/",
 "score": 205,
 "url": "https://www.reddit.com/r/AskReddit/comments/18q616o/what_is_your_example_of_the_most_expensive_thing/",
 "comments": [
  {
   "comment_id": "ket07ox",
   "message": "Celebrity-banded stuff. Sometimes they may be overpriced average products and that's understandable, but often they're overpriced wholesale rebranded Chinese low quality stuff.",
   "created_utc": 1703462786,
   "score": 183,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kesw0qe",
   "message": "Water. The bottled water market has gotten out of hand.",
   "created_utc": 1703460763,
   "score": 135,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kestuq1",
   "message": "Cars.",
   "created_utc": 1703459733,
   "score": 191,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kesvypo",
   "message": "Giant hollow chocolate Easter eggs are always a letdown.",
   "created_utc": 1703460736,
   "score": 202,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kesvism",
   "message": "Many name brand drugs.",
   "created_utc": 1703460525,
   "score": 59,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketat30",
   "message": "Washer / Dryer - The expensive 'Smart' one has more parts than can/will break, get shorted / need to be replaced. Get the clunker with the analog turn dials, the one that comes in every color as along as its white.",
   "created_utc": 1703468048,
   "score": 210,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket3nv6",
   "message": "Caraway cookware.\n\nCeramic non-stick cookware is already overpriced considering non-stick has low longevity and inferior cooking, but on top of it, Caraway's junk is extremely expensive and cheaply built. The reviews section is full of people who within a few cooking sessions managed to destroy their $595 collection of pots. It's been viral for years now because their huge mark-up for pans that most cost about $20 to make and another $20 to ship leaves them a GIANT budget for ads and influencers despite subpar quality.\n\nIt's literally $133 for a single sauce pan! You can get a non-stick by almost any other brand, including other decent looking ceramic non-sticks, for $50 or under.\n\nAnd if you have $500+ to spend for a Caraway set, you could just use the $500 for an all-clad stainless steel set that actual chefs use that heats better and will last decades--or get a dutch oven and cast iron skillet from a brand like Le Creuset instead for even cheaper.",
   "created_utc": 1703464411,
   "score": 123,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketadgx",
   "message": "Mascara",
   "created_utc": 1703467819,
   "score": 95,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket51p2",
   "message": "Poultry. Eagles, parrots, and other exotic birds are crazy expensive and dont taste any better than chicken.",
   "created_utc": 1703465088,
   "score": 140,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketmaz3",
   "message": "Anything that is claimed to be “Military Grade”.",
   "created_utc": 1703474243,
   "score": 90,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket558i",
   "message": "Alcohol..\nDear Lawd the price of a label is all you get. Anything I've drank that's been in the 200-500 dollar range might as well have been the 10-40",
   "created_utc": 1703465137,
   "score": 105,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keszpyf",
   "message": "Nearly everything with a price range is stupid at the top. \n\nSo a 10k car is better than a 5k car. And a 20k car is much better. But an 80k car isn’t that much better than a 20k car in the same way that the 20k car is better than the 5k. \n\nIt’s still relatively, just as safe, economical, has similar features, and with speed limits on roads, perfectly capable of keeping up.",
   "created_utc": 1703462550,
   "score": 182,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kessa3o",
   "message": "For me: vacuum cleaners",
   "created_utc": 1703458991,
   "score": 97,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keswtk5",
   "message": "College",
   "created_utc": 1703461151,
   "score": 199,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket9r7m",
   "message": "Athletes. For example my team, manchester united, paid £80 million for Antony, £80 million for Sancho, £40mil for this guy, £50 mil for that guy, and they are all shit",
   "created_utc": 1703467495,
   "score": 91,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketrij4",
   "message": "5 Guys burgers as fast food. Decent burgers but not for the price.",
   "created_utc": 1703477090,
   "score": 74,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket6x9m",
   "message": "Politicians",
   "created_utc": 1703466034,
   "score": 14,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketvyok",
   "message": "I work at a high end butcher shop in a wealthy suburb, there is very little difference behind the scenes from the cheap wholesale butcher I was at previously. People are paying premium for the name and the presentation",
   "created_utc": 1703479613,
   "score": 50,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketr423",
   "message": "As a whiskey reviewer: Old whisk(e)y and other spirits.\n\nOlder tastes *older*. Older is more expensive. But -- tasting older isn't necessarily better. In fact, beyond a point, it is worse. The only question is where that subjective point is for any given person. But there will come a point where it's pretty objectively not \"more tasty\" and age and price just becomes a status symbol.\n\nExtreme example: Macallan 70-something years old, most recently I heard one bottle went at auction for around 100k pounds. I could practically guarantee it tastes mostly like licking wood.\n\nBut as for expensive whiskey that I've actually tasted? Van Winkle 15 year rye. Pappy 15 year bourbon. Very very expensive, hundreds or thousands on the secondary market at least, and very much beyond a good age, to my palate. I've had much better whiskey for $60-$80.\n\nMy father in law believes that more expensive huge-brand Cognac is absolutely better liquor, and by the mere fact of being less expensive, something that is the same age but cheaper (like craft whiskey that has smaller distribution and hasn't been hyped to oblivion). He believes it's more expensive in part because it has less nasty chemicals that could give you a hangover. There's absolutely no reason to believe that. But you can't disprove a negative. Instead I'll say, by essentially legal requirement, distilled spirits are quality liquor to such a degree that they just don't have that problem.",
   "created_utc": 1703476862,
   "score": 23,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketolpk",
   "message": "Canada Goose down jackets. They are nice and will work in extreme weather, but you can get something just as good for $1K less.",
   "created_utc": 1703475465,
   "score": 42,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketji64",
   "message": "HDMI cables.",
   "created_utc": 1703472724,
   "score": 27,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kest32m",
   "message": "Overly designed exotic cars that no-one in their right mind would buy for practical use",
   "created_utc": 1703459367,
   "score": 36,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketokpd",
   "message": "Putting edible gold on food.",
   "created_utc": 1703475451,
   "score": 12,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket8dts",
   "message": "This reads like a Taskmaster prize task prompt.",
   "created_utc": 1703466787,
   "score": 34,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keu036v",
   "message": "licensed esthetician here... skin care. The $800 a month skin care routine is really no different than the $20 routine, you're paying for the name.",
   "created_utc": 1703482156,
   "score": 22,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kessq15",
   "message": "Pants. I get way more life out of a $30 Walmart pair than I ever do from an expensive pair of luckys",
   "created_utc": 1703459196,
   "score": 32,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket1x94",
   "message": "Peanut butter",
   "created_utc": 1703463594,
   "score": 11,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kety1ze",
   "message": "The juicero machine.  Basically some wannabe steve jobs invented a \"juicer\" that requires a subscription to use, costs thousands of dollars to buy, and only juices packets specifically designed for it which too were insanely overpriced and even made to \"expire\" after so much time and be rendered unusable to the juicer. On top of it all, it turns out the juicer is just a very complicated mechanism used to squeeze the juice packet which doesn't even contain any raw fruit pulp. Essentially, a expensive scam modeled with the same design philosophy as an apple product made by a guy who im pretty sure by now is sued into bankruptcy.",
   "created_utc": 1703480878,
   "score": 8,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket9rdu",
   "message": "My wife. She's very low maintenance, and always thinks of others before herself. We've been married for 21+ years, 3 kids, and I couldn't have made a better decision by asking her to marry me.",
   "created_utc": 1703467497,
   "score": 53,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketj08y",
   "message": "NFL tickets. Not paying $800 for a nosebleed playoff ticket I'm sorry broh",
   "created_utc": 1703472454,
   "score": 20,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketefmx",
   "message": "steak, a $200 steak doesn't necessarily have better quality than a $50 steak, in fact, I think $50 is typically where quality max's out for price, anything beyond that is just grandstanding/showing off wealth",
   "created_utc": 1703469970,
   "score": 29,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kesz1sx",
   "message": "I use my microwave to heat up water -occasionally- or leftovers. I do not need the 150 different functions that modern electronic microwaves offer. Especially if they make it MORE complicated for me to just heat up what's left of yesterday's dinner.",
   "created_utc": 1703462222,
   "score": 17,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketifg3",
   "message": "Sunglasses",
   "created_utc": 1703472135,
   "score": 11,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketn3kq",
   "message": "Five star hotels are worse than four or three star hotels.  Their rooms look a little fancier but aren't any more comfortable and they gouge you for every little thing when lower star places will include it.\n\nThe worst instance was on my honeymoon, had a client need a last minute surgical video edit and they wouldn't give me wifi without me paying like $50...I ended up just starting to edit it in their lobby where there was free wifi until someone asked me to stop and I told them I only would if they gave me a pass for the in room wifi.",
   "created_utc": 1703474664,
   "score": 16,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket87z5",
   "message": "Water bottles.  A cheap no name vacuum insulated bottle will hold water as well as any Hydroflask or Yeti.",
   "created_utc": 1703466703,
   "score": 15,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketowxi",
   "message": "Weddings",
   "created_utc": 1703475640,
   "score": 10,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketowyv",
   "message": "Viking appliances are absolute crap. When you set the oven to self-clean it fries the fucking motherboard. Overpriced bullshit. ANY appliance manufacturer with a decent name will be better. My aching wallet.",
   "created_utc": 1703475641,
   "score": 10,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kessdnn",
   "message": "Prada is complete shit now.",
   "created_utc": 1703459037,
   "score": 21,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketq626",
   "message": "Computer cables HDMI, CAT5",
   "created_utc": 1703476329,
   "score": 4,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketu37q",
   "message": "Designer hand bags and similar accessories. They're just cheaply made with a popular brand slapped on it.",
   "created_utc": 1703478528,
   "score": 3,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketvfse",
   "message": "Gold leaf on anything. It just cuts up your throat and passes.",
   "created_utc": 1703479305,
   "score": 3,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kessl77",
   "message": "I mean, even though I have an iPhone, definitely iPhones. Other phones have all the same or comparable features, have had them longer, plus some features iPhone doesn’t have. But it’s such a status item, many people don’t care",
   "created_utc": 1703459134,
   "score": 39,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket1jjb",
   "message": "Rolex watches. Not only other cheaper ones have better insides, but let's be honest, most Rolex lines are just tacky or ugly.",
   "created_utc": 1703463409,
   "score": 25,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketd4oy",
   "message": "Tesla",
   "created_utc": 1703469274,
   "score": 11,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kesznb4",
   "message": "Bottled water. In a taste test people couldn’t tell that high end bottled water was actually from a garden hose",
   "created_utc": 1703462515,
   "score": 7,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ket10qb",
   "message": "solid gold toilets",
   "created_utc": 1703463161,
   "score": 3,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketft6b",
   "message": "Pricier clothes - their quality is almost as bad as the cheap stuff",
   "created_utc": 1703470719,
   "score": 3,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketyqrk",
   "message": "Food in restaurants. Yes the food usually gets better as the price goes up, but there is a point of diminishing returns. Tomahawk steaks are just a ribeye with an uncut bone, Salt Bae is an embarrassment to the industry, and if I have to pay more than $55-$60 for a single entree it better do my laundry when I get home",
   "created_utc": 1703481310,
   "score": 4,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keu0bdu",
   "message": "Right now, it’s clothes \n\nI don’t know if I’m getting old, but clothes suck now.  The quality is garbage.  You can walk into an expensive store and see cheaply made crap that will not last more then 1-2 washes, and they’re just slapping 3-digit dollar amounts on everything \n\nNow, it seems that you have to thrift/consignment, then get it altered, so that you’re buying something that you know is going to last.",
   "created_utc": 1703482305,
   "score": 7,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keu1ck2",
   "message": "Winter clothing. There are some brands where the high-end stuff can be amazing and then there are fashion brands pretending to be winter oriented for the look. For context I spent over a decade teaching skiing and being in the outdoors and have seen alot of brands. \n\nQuality wise my preferred brands on what actually keeps me warm is Patagonia, helly Hansen, Dale of Norway, heat tech. \n\nNorthface, bought a pair of northface snow boots and well those things are stupidly warm. \n\nI have seen stupid designer jackets that cost even more than those brands and well they are nowhere near as practical, warm, or dry. Also avoid Canada goose stuff, never really cared for the warmth on the jackets. \n\nIf you are going to go in cold areas, multiple layers. My standard cold wear is, heat tech(or similar), thin slayer, inner puffy jacket, and then outer jacket. I mix my gear based upon the temperature. In spring I will sometimes do shorts under the snow pants.",
   "created_utc": 1703482973,
   "score": 3,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keu3ooi",
   "message": "Worms. You shouldn’t be paying too much for worms. Who's your worm guy? I gotta cheap one if you need.",
   "created_utc": 1703484546,
   "score": 3,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kestoa9",
   "message": "Cult wines",
   "created_utc": 1703459648,
   "score": 5,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "kesyk2s",
   "message": "[deleted]",
   "created_utc": 1703461987,
   "score": 4,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketql4x",
   "message": "Wedding photographers. \n\nIf you know you know. \n\nFucking ripoffs charging 5-10 grand now for 5 hours of work taking advantage of people who are vulnerable and in a trance willing to pay anything",
   "created_utc": 1703476566,
   "score": 7,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keu2jkm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "ketofgk",
   "message": "I used to work in the custom furniture industry, and many customers had such a hard time separating durability from price, and couldn't imagine why super expensive materials and finishes might perform worse than something cheaper. They would expect natural leather to be as stain resistant as vinyl/polyurethane, or expect a thin shellac wood finish to be as durable as a high-pressure plastic laminate for a table top.",
   "created_utc": 1703475370,
   "score": 3,
   "submission_id": "18q616o"
  },
  {
   "comment_id": "keu0bq2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18q616o"
  }
 ]
}