{
 "submission_id": "18q7lfb",
 "title": "[Serious] What's prison like in real life?",
 "selftext": "",
 "created_utc": 1703464175,
 "permalink": "/r/AskReddit/comments/18q7lfb/serious_whats_prison_like_in_real_life/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/18q7lfb/serious_whats_prison_like_in_real_life/",
 "comments": [
  {
   "comment_id": "ket35ug",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703464176,
   "score": 1,
   "submission_id": "18q7lfb"
  },
  {
   "comment_id": "ket3yvk",
   "message": "Depends on the level of the facility and the inmate’s level. Basically state prison can be horrible on sometimes an hourly basis. Or it can be tolerable for those who can adapt.",
   "created_utc": 1703464558,
   "score": 1,
   "submission_id": "18q7lfb"
  },
  {
   "comment_id": "ket4l2f",
   "message": "I only sat in a Danish prison, so somethings we can just get out of the way - we pay rent to be in prison in Denmark, and we also have to buy most food. You get a nice enough room ( americans joke that the prison cells would be some big amount in their city ) \n\nYou can have internet, PC - fuck, it must be the Scandinavian prison systems who are playing all those MMOs. Weekly visits. \n\nI just saw today there had been very good results with prisoners training service dogs, from puppy to ready or not. So far they had trained 42, and in all cases there was a calming effect. \n\nIf its a new prison, or recently restaurated - they also have the staffs rights, very much in consideration. And they cant work in a too abusive and loud enviroment, so a lot is done to make sure its peaceful. \n\nThere is so much weed mostly - because they are not so lenient with harder drugs. But they are there, and you basically just illegally order them from the gangs. \n\nWe seperate the gangs - and that causes fuckups sometimes, when something slips and they can get at each other. There is a lot of violence in prison, and there are lot of violent men. \n\nIn sweden they do it differently, and just mix the gangs willy nilly - They have way less fights in prison among gangs than we do. And that is crazy since on the outside its quite the opposite. \n\nAll of these are of course privileges you can have taken from you.\n\nOur jails though - they can be not fit for humans.",
   "created_utc": 1703464859,
   "score": 1,
   "submission_id": "18q7lfb"
  },
  {
   "comment_id": "ket3978",
   "message": "Incredibly boring most of the time with some stressful moments sprinkled throughout your average week.",
   "created_utc": 1703464220,
   "score": 1,
   "submission_id": "18q7lfb"
  },
  {
   "comment_id": "ket3a4l",
   "message": "In America it is a lucrative and expansive punishment.",
   "created_utc": 1703464231,
   "score": 2,
   "submission_id": "18q7lfb"
  },
  {
   "comment_id": "ket3org",
   "message": "The lives of people in prison are full of boredom, of isolated years and months. That is, they follow the same routine every day, where they are deprived of rights and where they are just another number, which in many cases ends up deteriorating their mental health.",
   "created_utc": 1703464423,
   "score": 1,
   "submission_id": "18q7lfb"
  }
 ]
}