{
 "submission_id": "18q7zy6",
 "title": "How did you find out Santa wasn’t real?",
 "selftext": "",
 "created_utc": 1703465592,
 "permalink": "/r/AskReddit/comments/18q7zy6/how_did_you_find_out_santa_wasnt_real/",
 "score": 4,
 "url": "https://www.reddit.com/r/AskReddit/comments/18q7zy6/how_did_you_find_out_santa_wasnt_real/",
 "comments": [
  {
   "comment_id": "ket67d1",
   "message": "I saw my mum kissing him, turned out it was just my dad putting presents under the tree.",
   "created_utc": 1703465668,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket6s6e",
   "message": "What? Santas not real???",
   "created_utc": 1703465964,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket6ly2",
   "message": "Apologies, haven't posted in a while and apparently \"this community doesnt allow body text\" (?!?) Anyways, I’ll start: my dad used to leave out cookies and milk and what not on for Santa Christmas night. My dad would leave us a small handwritten note for Christmas morning and one Christmas my sister noticed when I was about 5 and she was 6 that \"Santa’s handwriting looks just like dad’s handwriting\". I immediately knew at that moment that Santa was my parents 😂. Share your stories here, and Merry Christmas!!",
   "created_utc": 1703465876,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket6uvm",
   "message": "Common sense when I was about 5. Magic doesn’t exist, so how can this guy fly around the world in one night, dropping off presents to practically everyone. \nMy parents said I was right but not to tell my friends. Over the next few days I told everyone I encountered - adults, kids, strangers. It was game over for Santa Claus in Southern California.",
   "created_utc": 1703466001,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket6po4",
   "message": "I was a snooper, and when I was like 8 I saw a gift that my mother had just bought(peaked in the bag when she was putting the cart back)... then on Christmas morning the present said from Santa",
   "created_utc": 1703465928,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket728c",
   "message": "I was afraid of him and was relieved to hear that he is not real.",
   "created_utc": 1703466103,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket74tk",
   "message": "We were watching a Coca-cola ad and my dad said Santa Claus is an invention of business. That was the start of my anticapitalist journey.",
   "created_utc": 1703466139,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket7az2",
   "message": "The Easter Bunny told me.",
   "created_utc": 1703466226,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket7f3t",
   "message": "I asked my mom and she came clean when she thought I was old enough.",
   "created_utc": 1703466286,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket7s4k",
   "message": "Kids, I don’t remember if it was one or a few, told me at school and I went home and asked my parents if it was true…and ironically they didn’t want to lie.  Of course mostly they were just done with the charade.",
   "created_utc": 1703466473,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket8oup",
   "message": "Excuse me? He is ill have you know!",
   "created_utc": 1703466947,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket9863",
   "message": "Back in the year 2000 I got a Gameboy Camera for Christmas that said from Santa on it. My mother forgot she wrote that it was from Santa and started talking about how she found a used one.",
   "created_utc": 1703467225,
   "score": 1,
   "submission_id": "18q7zy6"
  },
  {
   "comment_id": "ket9jxt",
   "message": "I was in the car and my dad asked me to lie to my siblings that Santa was real. \n\nHe never even told *me* first.",
   "created_utc": 1703467389,
   "score": 1,
   "submission_id": "18q7zy6"
  }
 ]
}