{
 "submission_id": "18q7csj",
 "title": "[Serious] What's your advice on online dating?",
 "selftext": "",
 "created_utc": 1703463358,
 "permalink": "/r/AskReddit/comments/18q7csj/serious_whats_your_advice_on_online_dating/",
 "score": 8,
 "url": "https://www.reddit.com/r/AskReddit/comments/18q7csj/serious_whats_your_advice_on_online_dating/",
 "comments": [
  {
   "comment_id": "ket1fpc",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703463359,
   "score": 1,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket4h46",
   "message": "If she look like she could be friends with a Kardashian, big no-no.",
   "created_utc": 1703464805,
   "score": 9,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket2448",
   "message": "Unless you are a woman, super rich or handsome, its a complete waste of time",
   "created_utc": 1703463685,
   "score": 13,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket9xk1",
   "message": "Don't get too emotionally invested in the process. If you're a hetero guy, you're unlikely to get a whole bunch of interest; that doesn't mean it's a worthless venture, but you're gonna have to be patient. I'd consider myself to be of below average attractiveness, but I've matched with a few people and gone on a few dates.\n\nIf you're a hetero woman, be prepared to be overwhelmed by receiving attention from way too many men, and then marvel at the variety of red flags they throw at you.\n\nI've got no idea what the scene is like for gay people, maybe a little less shit?",
   "created_utc": 1703467586,
   "score": 6,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketb7l4",
   "message": "If you're contacted by an attractive man  who says they're from Texas or some other place in the USA, that they're currently living out of the country,claim that they are either a high ranking military officer, a retired high ranking military officer or work on an oil rig;  say they are widowed with one child, they refer to you as \"dear\" a lot and their command of the English language seems to be a bit askew...block them, they are a scammer.  \n\nI'm not saying that there are no retired military officers, oil rig workers or widowers with kids sincerely looking for love on the internet, but when someone approaches you online, especially out of the blue and they tick most of boxes...yeah, they are almost 100 percent certain to be scammer and they will eventually come up with some story that ends in them needing money from you.",
   "created_utc": 1703468257,
   "score": 4,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketcmqb",
   "message": "I have found it absolutely terrible",
   "created_utc": 1703469012,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketczus",
   "message": "Don’t fall in love with a line of text. Meet them in person in a public, and busy location. Never invest in an online fling until you’ve transformed that into the physical world and have met them.",
   "created_utc": 1703469203,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketko1y",
   "message": "Don’t do it",
   "created_utc": 1703473356,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketmdz0",
   "message": "Only 10% of the people will be halfway honest",
   "created_utc": 1703474289,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "keto0o2",
   "message": "Don’t.",
   "created_utc": 1703475149,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketamj9",
   "message": "If you absolutely insist on using dating app 3 things, Be honest with your intentions, communicate clearly, and there is always more fish in the sea. If nothing is working out take time out to work on yourself. Sometimes in moment while living your life unexpected relationship blossoms out.",
   "created_utc": 1703467951,
   "score": 4,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketd3fe",
   "message": "It’s sucks ass mostly (my opinion) and is hard to make genuine connections often, if that’s what you’re looking for. Great for hook ups if you’re into that sorta thing. Pick good pictures, have something interesting in the profile about yourself and be a good ice breaker when you match. And be smooth, but not creepy. \n\nBut from my experience you gotta sift through a lot of shit and waste a lot of time if you’re looking for something serious.\n\nGood luck, friend\nEdit: and don’t play games, be honest about shit and stay safe",
   "created_utc": 1703469255,
   "score": 2,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketp8n1",
   "message": "My best advice is don't come to reddit for any advice on dating.",
   "created_utc": 1703475817,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketq99r",
   "message": "Don't do it",
   "created_utc": 1703476379,
   "score": 2,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket1t6f",
   "message": "For boys, its a waste of time. Tinder and Bumble work well if you’re too rich or extremely good looking. For average looking guys, its a hit on the self esteem if they take it too seriously. As they say,,,, be handsome or just be rich",
   "created_utc": 1703463540,
   "score": 4,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket1vta",
   "message": "Not even trying it since does not work",
   "created_utc": 1703463575,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket2mie",
   "message": "Don’t do it. Go outside instead.",
   "created_utc": 1703463927,
   "score": 4,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket9lcy",
   "message": "Don't unless you like being ignored by bots.",
   "created_utc": 1703467409,
   "score": 3,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket1qg4",
   "message": "My advice is don't. Just don't. If you aren't going to join a hobby group or anything like that use a dating site with a paid feature that is focused on serious relationships. Not tinder, bumble or those apps they are not your friend.",
   "created_utc": 1703463502,
   "score": 1,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ket5a6d",
   "message": "If you are cishet it might work for you. Both of my sisters met their boyfriends online and they’re both gonna get married sometime soon. I think they are made with straight people in mind primarily.",
   "created_utc": 1703465204,
   "score": 1,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketd3wd",
   "message": "Check shes photo on website what can find people by photo,so u can be sure its not fake\nI used it",
   "created_utc": 1703469262,
   "score": 0,
   "submission_id": "18q7csj"
  },
  {
   "comment_id": "ketqtqb",
   "message": "use it in mexico/guatemala/south east asian or other similar countries, its like 2014 all over again",
   "created_utc": 1703476701,
   "score": 0,
   "submission_id": "18q7csj"
  }
 ]
}