{
 "submission_id": "18q8t19",
 "title": "What's the closest you have been to being arrested?",
 "selftext": "",
 "created_utc": 1703468595,
 "permalink": "/r/AskReddit/comments/18q8t19/whats_the_closest_you_have_been_to_being_arrested/",
 "score": 151,
 "url": "https://www.reddit.com/r/AskReddit/comments/18q8t19/whats_the_closest_you_have_been_to_being_arrested/",
 "comments": [
  {
   "comment_id": "kethgo3",
   "message": "A person with my name had an active warrant (found out later he was a child molester).  Same spelling of the same, same weight, same birthday, same hair and eye color.  He was taller and had a different middle name.  \n\nAnyway, some sort of writ of seizure was issued and got tied to my bank account.  I went to withdraw some cash from the bank teller (back when ATMs were around but not everywhere like today).  When I got to the teller and was asked to wait (which was normal due to another unrelated quirk with my bank account).  \n\nI was standing at the bank counter waiting like usual and after a few minutes, someone grabs me from behind.  I don’t recall them ever identifying themselves.  When they grabbed me, I was trying to sweep their leg and shift my weight back to knock them off me and someone else grabs me.  I’m out face first into the counter and cuffed.  \n\nA guy pulls out this piece of paper from some court.  He starts reading off this list of assets that are being seized (a car and a trailer or something) and my bank accounts were being frozen by order of the court and they started listing a few accounts.  I don’t recall if they told me I was under arrest or not but it seemed I was.  I tell them I have no idea what they fuck they’re talking about and they start reading through the paper again.  I tell them I don’t have the stuff they are talking about and tell them I don’t have a money market account which they could verify at the bank we were at.  They asked me if I was from Michigan which I denied and told them I had lived in Alaska and Wisconsin, but never Michigan.  At that point, they ask for my ID, run my DL and they figured out I wasn’t who they were looking for.  I got uncuffed with a sorry about that.  \n\nFor the next 20 years, that guys arrest record would pop up in my life every now and then.  I’ve been detained by customs more times I can remember, failed firearm background checks, and been told I’m a sex offender by my kids’ school.  It took me about 20 years to actually figure out the entire story including who they were mistaking me for and what he did.  Every time I had a contact with customs or whoever, no one would say what they thought I did.  It wasn’t until the kids’ school told me I was a sex offender that I was able to figure it out.",
   "created_utc": 1703471610,
   "score": 236,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketqej4",
   "message": "When I was a teenager I had a paper route.  I found some mail behind a tree and stopped to see who it belonged to.  A neighbor saw me and called the police.  A cop showed up to my house and asked my sister where the little blonde boy with the red bike was.  None of us were blonde and none of us had bikes. Apparently someone else had seen someone actually steal the mail.  \n\nThe police chief asked my mom to bring me in.   She was an immigrant with essentially an 8th grade education so she assumed they meant welI.  I was accused of stealing mail, read my Miranda rights, and released to my mother.  I maintained my innocence and even pointed out that school attendance records proved I was in school when the crime took place.  \n\nWe had to hire an attorney and just before the trial our attorney told the prosecutor “You know you don’t have a case, right?”  They immediately dropped the case and from that point on I never trusted a cop again.  \n\nEventually it was found that the blonde kid on the red bike was the kid of a racist school board member.  Nothing happened to him.",
   "created_utc": 1703476462,
   "score": 239,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketdpn2",
   "message": "i was arrested for reaching for my coffee during a traffic stop. He was so embarassed for pulling a gun on me and instead of just owning it, he arrested me to make it seem legit.",
   "created_utc": 1703469588,
   "score": 104,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketewev",
   "message": "The police thought I was a burglar because I was running at night nearby to where someone phoned in saying they have been robbed. I was running cos I was at my friends house and I'm scared to walk home at 2 am cos its near a dark park with not much lighting and it's a dodgy area\n\nI just told them over and over it's not illegal to run at night, until they gave up.",
   "created_utc": 1703470219,
   "score": 178,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketdpux",
   "message": "I had an intense staring contest with a cop while I was rolling a cigarette. Nothing happened, but we stared at each other for sometime.",
   "created_utc": 1703469591,
   "score": 190,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketf4t1",
   "message": "Outside of a bar the guy next to me screamed “fuck the cops” and chugged a half plate of nachos at a police cruiser. Then immediately turned and briskly walked off. Cop pulled over and thought that I did it.",
   "created_utc": 1703470347,
   "score": 83,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketgqxz",
   "message": "I once called 911 when I was a kid, I did this to look cool in front of my brother and show I was cool lol. I dialed it and hung up immediately and then the cops showed up and I remember the feeling in my stomach when my mom demanded an explanation, god I was dumb as rocks.",
   "created_utc": 1703471224,
   "score": 86,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketqtce",
   "message": "Once, when I was 21, and coming out of a bad relationship, I got a serious wake up call. It had been a year since I hooked up with anyone and I was desperate. I ended up talking to a nice girl I knew from high school. For the first time, she randomly invited me to come stay at her apartment one night. I also hadn't been sober for a year, and tonight was no exception. I was completely smashed because I had been drinking vodka out of the bottle since I woke up. I spilled my bedside beer all over myself just before I left and still walked out the door thinking it would be fine.\n\nI remember rushing my old beater of an S10 twenty miles down the road at a blistering pace. I ended up getting stuck behind a silver SUV going five under in the left lane. I decided to pass him after becoming frustrated. I went around him in the right lane as they slowed down for a yellow light. As soon as I passed, the light turned red and I flew straight through it. I nervously looked behind me to see the silver SUV activate their flashing blue lights. Turns out, it was an undercover.\n\nI pulled over calmly because I knew I could pass as sober. That's when I realize I am dampened with beer and my shitty window doesn't roll down. I had to open my entire door back then. I knew that if I had to open my door with the cop next to me, I was going to jail. I decided to try a bold move and hope for the best. I immediately hopped out as the officer did and said, \"Officer, that was possibly the dumbest move I've ever made.\" He sorta chuckled at me and asked where I was going in such a hurry. The second I told him, in a slightly embarrassed tone, a girl's house, he chuckled again. After warning me to get there safely, he wished me good luck and let me go.\n\nIt was probably less than 60 seconds from pull over to taking off, but it felt like an eternity. After just that small time, I was dripping with sweat and nearly hyperventilating in the truck. I drove to her house and got a shower immediately to rinse all the sweat off. She laughed at me as I told her the story. The night turned out to be great, but the exact opposite of what I deserved. My friends and family always said I could talk my way out of anything, but I never wanted to have to do that again. \n\nDriving drunk is not worth it, and a DUI would have destroyed my life. I wouldn't even be able to do what I do for a living if I had gotten one. I could've died that night, or worse, killed someone else.",
   "created_utc": 1703476695,
   "score": 74,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketg0gg",
   "message": "Got arrested during a random traffic stop. Had a warrant out for a $60 bounced check to a consignment shop. I bought Xmas presents 6 months earlier, and they just put a warrant out instead of contacting me.",
   "created_utc": 1703470827,
   "score": 54,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketfwws",
   "message": "2005 I was heading home from university for the summer. Had my knife collection in a box buried in the bottom of my smallest suitcase. Get to the airport. To check the smallest bag would cost an additional $85. I’ll just take the smallest bag as a carryon. Totally forgot about the shoe box with knives. When I get to security they pull me aside. Police come and tell me what they found. Class B misdemeanor. I had to take time off work to fly back to my college town for the trial. Was over $1000 worth of knives. One was a hand made Damascus steel pocket knife with an ebony handle with gold inlays. I had a switch blade that got me a federal offense. I should have sprung the $85 to check the bag….",
   "created_utc": 1703470775,
   "score": 94,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keti2vv",
   "message": "My college girlfriend and I snuck into an abandoned hospital in her hometown with a couple of her friends.  Cops came pretty quickly, found us, explained how stupid it was for us to be in a condemned building, and escorted us back to her parent’s house.  They were pretty chill about it all things considered, they honestly seemed like they just wanted us to know how easily we could’ve been hurt and to not take chances in places that are falling apart, especially at night.",
   "created_utc": 1703471944,
   "score": 46,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketjive",
   "message": "I had a severe psychotic episode a few years back. I threw myself into high-speed traffic to commit suicide because I thought it was the only escape from being damned to hell. It was a horrific situation, I can’t believe the things I did. Many heroes were at work that day. Before the cop wrestled me to the ground, I punched him and grabbed for his gun. I’m not sure why they didn’t press charges, they just brought me to the mental hospital. The only explanation I can imagine was how insane I seemed. I was screaming “shoot me! You have to shoot me, I’m dangerous!”. I was also banging my head against the separating barrier inside the cop car, in another attempt to kill myself. Psychosis is the most evil sickness I’ve ever known. Medication is your one lifeline",
   "created_utc": 1703472735,
   "score": 56,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketbxe3",
   "message": "Nice try fed I ain't gonna snitch",
   "created_utc": 1703468637,
   "score": 123,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketc40n",
   "message": "I was actually arrested, at 16, for shoplifting. Never did that shit again.",
   "created_utc": 1703468734,
   "score": 45,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketcwax",
   "message": "Out past curfew as a minor but the cop let us go thank god. We said we were playing Pokémon Go. We weren’t. I was parked and he pulled up behind me with lights on. It was like maybe 11pm. Not too late.",
   "created_utc": 1703469151,
   "score": 43,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketii9a",
   "message": "Had sex in a graveyard at night with my then boyfriend. Turns out cops patrol the area regularly",
   "created_utc": 1703472180,
   "score": 78,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketiiba",
   "message": "I was nearly arrested for supposedly having drugs on me. What I had was an old, unlabeled prescription bottle with a mix of tylenol, midol, and dramamine in it that I keep on me when traveling.",
   "created_utc": 1703472181,
   "score": 17,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kete51z",
   "message": "Being arrested.",
   "created_utc": 1703469815,
   "score": 85,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketgept",
   "message": "Stargazing on the side of the road with a group of friends as teenagers. We had driven specifically 30+ mi to a small town for this, but apparently it's not legal lol. None of us were on drugs btw.",
   "created_utc": 1703471040,
   "score": 16,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kete8x0",
   "message": "I was pulled over drunk with a street prostitute in my car.  One of my headlights was out.  The cop wrote me a ticket and let me drive off, prompting my passenger to say, \"That was a miracle!\"  I drove her back to where I'd found her and went to a nearby bar.  This was 15-ish years ago.",
   "created_utc": 1703469872,
   "score": 52,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketolxa",
   "message": "Back as a teen some friends and I had just smoked out of an apple and got stopped by the cops for looking suspicious because we cut through a playground after midnight. I ate the evidence while he grilled us and then searched out pockets. \n\nAnother time I had to yeet my backpack over a fence right before we go terry stopped. \n\nI wasn’t a good kid but I wasn’t bad to people. Just smoked a bunch of weed.",
   "created_utc": 1703475469,
   "score": 31,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketn6gn",
   "message": "Been arrested. Not a great experience.  Do not recommend",
   "created_utc": 1703474705,
   "score": 12,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keuc0se",
   "message": "2014/2015. Got stopped after work on a rural road at 0230 in the morning because I used my brights to illuminate a herd of deer in the road and apparently that \"gave away\" the position of a cop on the side of the road a few yards away. What should have been a simple stop turned into a 45 minute ordeal on the side of the road where the officer made repeated attempts to get me to agree to him searching my vehicle, which I repeatedly declined. When I asked if I was free to go or being detained he stepped it up to threatening to arrest me for \"interfering with an active investigation\" and having the K9s come out to search my truck anyway, so why not make it easy for him. I declined again and asked for a supervisory officer. A lieutenant came out as the other officer was threatening me again, they had a conversation, the lieutenant came back with my documents, apologized profusely and told me I was free to go after telling me to call him after 48 hours and handing me his card. I called him two days later and he told me that the officer had been removed from patrol duties for violating several department policies and was being referred to retraining. \n\nA year later that same officer was fired from the force because he was overheard in a local Subway bragging about how he wanted to instigate someone into getting into a gunfight with him so he could kill them and be awarded the Medal of Valor or something.",
   "created_utc": 1703490954,
   "score": 11,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketdmr1",
   "message": "I was once set up as either an ititiation or a training exercise for a rookie. They were very vague about why they pulled me over and put me in the back of the police car (literally said there was a \"fight\" involving a similar car). Eventually, they put my wallet on the trunk of one of the police cars, said, \"Have a good evening\", got in their cars and drove away. Sacramento County sheriff, 1995.",
   "created_utc": 1703469545,
   "score": 17,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketcvgx",
   "message": "Actual arrest.",
   "created_utc": 1703469139,
   "score": 16,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketsupm",
   "message": "Used to meet my truck drivers around 10pm till midnight. They came over the mountain around that time on a direct run from airport to airport.\n\nThey would call, I went across the street to the truck stop handed them envelope of cash, they signed for the cash and handed me an envelope receipts. I’d go back to the restaurant. One night I just sat in my truck outside for the last truck.\n\nThats when they hit me. They had been watching the lot from an old warehouse for a while and had me profiled as a dealer. (Mind you, If I was dealing, I wouldn’t sell in the middle of a fucking truck stop parking lot, standing next to my own car, I’d do it in the bathroom.)\n\nHit me with DUI charge (bullshit, I was well under) tossed me in jail so they could tow my truck and search it. Eventually the charges were dropped (2.5k legal), but it didn’t reduce their dumbfuckery one bit. They just became bigger assholes..",
   "created_utc": 1703477849,
   "score": 9,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketvfr8",
   "message": "Story time.\n\nWhen my brother and I were 15 (and stupid. I do not condone my past behavior) we lived across the street from some woods. And it was a really rural area and our house was in the corner. \n\nWe took a bag of paintballs one night and threw them at cars after they come around this slight corner. Because they were going so slow we justified it being safe enough. Like I said, idiots.\n\nOne of the cars stopped though and started cursing at us, treating to beat the shit out of us. And rightfully so.\n\nHe was yelling and looking for us with a flashlight, but we had retreated into the trees so he couldn’t see us.\n\nAnyway, dude called the cops. So about 3 cop cars show up in the street with lights on and start shining their light into the woods. It was about midnight so it was dark out and there lots of trees and brush to stay hidden in.\n\nAt this time my mom woke up from the commotion outside (lights and all) and came out the front door and approached the cops.\n\nThen they got our their speak and announced over the intercom “[NAME] AND [NAME] PLEASE COME OUT OF THE WOODS WITH YOUR HANDS AND PAINTBALL GUN IN THE AIR!”\n\nTo which we obliged. Cops threatened us with charges but ultimately we ended up paying the guy for a car wash and apologized. \n\nCops told us we were lucky we had our mom across the street to take us in. Was pretty scary. \n\nFuck I wish I could say that was the last time I did some shit though. Ended up *actually* arrested as well.\n\nI’ve long since changed my course but god damn I was so dumb lol\n\nEdit - story time\n\nEdit - to clarify, cops assumed we had a paintball gun but we were just throwing them. The impact itself wasn’t actually too hard, and we’re fortunate to have not hurt anybody. But we made it to car 3 I think before cops showed up so… lesson learned.",
   "created_utc": 1703479304,
   "score": 12,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketsgpe",
   "message": "Was arrested by military police once when I was in the service. Been detained (handcuffed and in the back of a cruiser) by civilian police.",
   "created_utc": 1703477626,
   "score": 8,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketsvqe",
   "message": "I was playing hide and seek with some friends at a school playground. It was the perfect spot because it had an immense jungle-gym made of wood with lots of great hiding places. Well, it was after dusk and apparently there were prior drug busts at that spot. So, the cops came to the worst conclusion about our presence at a group of squad cars surrounded us out of nowhere. All the police jump out of their cars, and pulled their weapons staying behind their car doors, ordering us through loudspeakers to come out with our hands up. It was quite intense for a few moments until they saw that it was a bunch of late teens with girlfriends. They ran our names through dispatch and all of us came back without warrants. The real embarrassment was that we were all from a small farm town and everyone’s family (yes everyone) had police EMS Fire Department band scanners listening to the whole thing go down. We got grounded pretty seriously afterwards.",
   "created_utc": 1703477866,
   "score": 4,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kets1f0",
   "message": "Driving on a suspended license. I was pulled over in a small town well known for screwing anyone they can and I was sweating it pretty bad. My tail lights were out and this boss hog looking cop waddles up to my window and takes my license. He's walking back to his car to run my license when he suddenly stops and comes back. \n\nI was driving a 1970 240Z and the cop tells me he had one when he was a teen. He then asks if I'd like him to check my fuse box and I agree. He squeezes in, replaces the fuse for me, then tells me how much fun it was to drive one of these back in the day. He hands me my license and sends me on my way, never having run it. The next day I borrowed money from my dad and paid my outstanding ticket and got my license reinstated.",
   "created_utc": 1703477384,
   "score": 10,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keu54y5",
   "message": "When we were 10-11 yrs old we used to play ‘fuzz-ball’ in an empty lot in my neighborhood.  (Stickball with a tennis ball - with various rules so we could play ‘baseball’ with a limited number of participants). \n\nThe neighbor directly along our first-base line would often come out and confront us about retrieving foul balls from their yard.  We were young punks so we ‘defended’ our position that we are just playing ball and not on their property.  \n\nOn this particularly heated occasion they called the cops…on 11 yrs olds…for playing fuzzball.  The cops asked if we had permission to use the empty lot.  I bluffed and said ‘yes.’  I have no idea why I said it.  We didn’t know who owned it. And that, of course, was his very next question: ‘who owned it?’  I guessed that it was the house along our third base line b/c he had been out to watch us before and seemed nice.\n\nThe officer literally made me go with him to the third baseline house’s front door with him to confirm this permission.  I had never actually met the guy; I didn’t even know if he actually owned it; I wondered why I had ever opened my mouth.\n\nThe owner was home.  The officer asked if we had permission and the old man looked at me and then the officer and said “Why do you think I mow it for them every week?”   I was expecting a yes or no and didn’t fully understand his rhetorical response.  I thought I was going to prison…for playing ‘fuzzball’ …at age 11.",
   "created_utc": 1703485578,
   "score": 5,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kethh9x",
   "message": "I was detained with a friend for trespassing when we were 18. There was an abandoned building and we went in to check it out. It was boarded up but there was conveniently a board that was pried open already so we jumped in. Cops came and threatened to send a dog in after us so we came out. They thought we pried open the window and tried to get us for B\u0026amp;E but luckily didn’t. We had to go to a court ordered class for that one.",
   "created_utc": 1703471619,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketm0bt",
   "message": "Once, and recently.\n\nI was dropping off a lady friend at her family’s home in PA. It was very late, and it’s a very small town. \n\nAs I was leaving the town, I was pulled over. The cop asked what I was doing in the parking lot (next to my friend’s home), and I realized the owner of the lot called the police.\n\nI know not to talk to cops, but I had no choice here. I believed I might be killed if I wasn’t friendly to this cop. He kept me on the side of the road for about one and a half hours, trying to cook up all kinds of ways to arrest me, even suggesting my friend was an underage girl, and demanded that he talk to her on the phone. When I refused, he threatened me, saying he’d go to the home (right then and there) and break the door down. So of course I called.\n\nHe definitely tried his best. I think the lot owner tried too, since the cop told me he was reviewing video of me in the parking lot.\n\nNote: I was also certain, because this was a small town and I was not from the area, that everyone knew each other, and the cop probably knew everyone in the court system, so I didn’t want to challenge him and risk getting arrested and talking to a judge that would never not take the cop’s side.\n\nI believe this kind of thing happens all the time in small towns in America, where it’s hard to hold people accountable for abuses of power.",
   "created_utc": 1703474084,
   "score": 12,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kethv87",
   "message": "Got in a fight on a plane right before landing and was met by TSA at the gate",
   "created_utc": 1703471827,
   "score": 6,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keteyzd",
   "message": "I have been arrested\n\nThere you go",
   "created_utc": 1703470259,
   "score": 6,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketknwl",
   "message": "The couple seconds right before every time I've actually been arrested.",
   "created_utc": 1703473354,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketq03i",
   "message": "That one time I smarted off to a cop and he tased me. After the paramedics removed the darts, they hauled me to jail. \nThat's as close as I've come.",
   "created_utc": 1703476239,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketrmw1",
   "message": "Grenada, smoking pot.  The officers wanted to know who sold it to me. I told them I was an attorney (false) and that I wanted to talk to an attorney, a representative of the cruise line, and the American consulate.  they were soooo happy to let me go",
   "created_utc": 1703477158,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketuqh5",
   "message": "I pulled over into an empty parking lot to take a nap at 2am once.\n\nIt was a hardware store in a podunk town and I remember seeing some flashlights inside and thinking there must be a power outage.  I was travelling back from college for the holidays and just couldn't keep my eyes open anymore and figured it'd be safest to just take a short nap.\n\nI got woken up with a beacon shining behind my car and was told to move on.\n\nThe day after that my little brother who was like 10 at the time shouted that there were men coming with guns to the door!\n\nTurns out while I was sleeping there the biggest gun robbery in the state was happening.  The detectives had tried calling my parents house (this was before cellphones were common) and because my Dad is a controlling asshole no one was supposed to listen to voicemail except him and he was too doped up on opioids to check it for that first day...so they came, guns drawn, expecting a bunch of heavily armed gun robbers.\n\nFortunately they quickly realized there was no way I was some secret gun thief and left shortly thereafter.",
   "created_utc": 1703478900,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketuzm3",
   "message": "Texas State Trooper clocked me at 102 in a 65. The first thing he said to me was to get out of the car. I was already upset and crying due teenage drama before he pulled me over. Traffic was light otherwise he was gonna hit me with Reckless Driving. He let me off with a $400 ticket and I stopped speeding.",
   "created_utc": 1703479043,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketwb1c",
   "message": "The closest I have been to being arrested is right before I got arrested.",
   "created_utc": 1703479819,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketwbys",
   "message": "Actually a couple of years back, on Christmas day we were driving back from spending time with my family to go see my girlfriend's parents. I was tired, so I asked her to drive - but since we had left a bit late, I had told her to just not drive slow and maybe speed a bit so her parents didn't wait for us for so long \n\nWell, luckily I did that because I had apparently had my license suspended for failing to make a payment on a payment plan I had on a speeding ticket. How'd I realize that, you may ask? \n\nWell, my girlfriend apparently did follow my advice and was speeding a bit. What she failed to mention is she *also* had her license suspended but she was actually aware of it. But instead of telling me or just not speeding, she actually did and ended up getting pulled over for it while not having her license on her person \n\nCop asks me if I can drive, I say yes, he checks my license and tells me I actually can't - I'm surprised and feel like an asshole lol. He technically did arrest my girl for a few minutes, but because it was Christmas he let us call her parents to come pick us up \n\nSo, I didn't get arrested but she did and it's a funny story (to me) of how she ended up in the back of a cruiser lol",
   "created_utc": 1703479834,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketxqc4",
   "message": "This stupid truck kept trying to cut me off and I wouldn't let him, we ended up racing a bit and I won (I know winning or not isn't going to matter, I'm just petty) and ended up going at about 120 in a 45, now that could've put me in jail for a good while, but the cop was nice enough to let me off with a warning since 1. I immediately admitted to what I did and 2. I have a clean record so the cops just treated it as a small road rage incident and gave me a warning",
   "created_utc": 1703480680,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kety0ut",
   "message": "During summer between freshman and sophomore yr of college, I got a job working for my buddy's super successful online business. He bought \"legal\" drugs in bulk and sold them online and to headshops/gas stations all over the US. I would package material and sometimes mix up the in-house brand bathsalts.\n\nYes I knew it was shady, stupid, and morally wrong. It was over a decade ago and the easiest job I could get that paid well for 3 months.\n\nLeft back for college, a bit early cuz I wanted to get out of my parent's place. Welp the next week was a nationwide organized sting operation by the DEA busting all the bathsalt rings. New legislation finally got rid of the analog loophole these companies exploited.\n\nEveryone working in the office the boss rented were highschool and early college kids, I don't think anyone was of drinking age yet. They all were arrested and sent to jail for the weekend. I was safely 600miles away. \nThe local news ran the story and apparently we were the youngest ring in the sting by far. The boss took all the blame and said he lied to his employees about everything being legal and everyone else got off the hook except him. He served some time, got out and I heard got into the vapejuice game and is doing quite well. \n\nGlad I left when I did, would have been fun to explain to my parents. And respect to little D for taking the heat.",
   "created_utc": 1703480859,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keud2ea",
   "message": "When I was a teenager I briefly went through a period of sneaking into random places I wasn't supposed to be in as a hobby. Rooftops, utility areas, just places in a building where people normally aren't allowed to be. I had played Mirror's Edge and really liked the whole vibe of being in a big city and exploring the hidden parts of it that most people don't get to see. I never stole or vandalized anything, it was just recreational trespassing.\n\nThere's a long residential building on my block that has two stairs up to the roof, and I got up onto the roof one day and spent a few minutes looking around. I went in the other stairwell on the far side of the building but there was a dead squirrel in the stairwell so I turned around but the door had locked behind me and I couldn't shim it open because it wasn't the same kind of lock as the stairwell on the other side of the building. So I had to walk around the squirrel and go downstairs to walk down a long hallway back to the elevator lobby where the main stairwell was.\n\nJust as I was getting to the elevators one of them opened and a mean looking security guard rushed past me and up the stairs. So I got in his elevator and went back down to leave. It occurred to me that I must have triggered a silent alarm or been spotted on a camera that I hadn't seen and that guard was probably on his way to have some words with me, not realizing that I'd walked right past him and taken his elevator.\n\nThat was the last time I did anything like that.",
   "created_utc": 1703491832,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketfs4m",
   "message": "Actually, being arrested.",
   "created_utc": 1703470703,
   "score": 4,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketdmgr",
   "message": "I got arrested when I was 15 for nicking booze outta Asda. \n\nJokes in them I'd been doing it months.",
   "created_utc": 1703469540,
   "score": 6,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketppyq",
   "message": "I have gotten arrested 3 times. \n\nOnce for smoking weed in the stair case of the projects.\nOnce for smoking weed while walking to work.\nAnd once for driving on suspended license.\n\nWhen I was 13 a cop pulled a gun on me because I went to hug my grandma during a family dispute.",
   "created_utc": 1703476083,
   "score": 6,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketc7f2",
   "message": "Prank calling 911 for the third time at age 10",
   "created_utc": 1703468785,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketcns0",
   "message": "I went fishing without a fishing license",
   "created_utc": 1703469028,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketrgdw",
   "message": "Cops got called in a bar fight, but I bailed before they showed.",
   "created_utc": 1703477057,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketskh1",
   "message": "Being handcuffed,  read my rights, put in a police car and detained 8na cell for 18 hours.",
   "created_utc": 1703477687,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kett4wu",
   "message": "Mom once gave me $20 to go to the market and buy Cheetos. Turned out, the $20 was fake. About a few months later the bank analyzed it and concluded that it was real, just super damaged.",
   "created_utc": 1703478009,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketvubi",
   "message": "Little over 15 years ago my boyfriend and I were smoking a joint with the neighbors behind our apartments at night when suddenly we see flashlights coming from both directions and behind us. Someone called the cops on us and they were coming in from all directions. I'm going to be honest, I was a textbook good girl growing up, I've never been in serious trouble, and I have severe anxiety. I felt like I was gonna collapse. \nNow, this was late summer in Tennessee, us girls were in tank tops and short sleeping shorts. Had us flip out our pockets and they patted down the guys. My boyfriend had  colostomy and urostomy bags. He told him that sustain out and asked if they wanted to see. They declined, checked the grass for a couple minutes and left. \n\nThe baggie was in his overalls between the bags and they were too blind to find the roach that the other guy found instantly.",
   "created_utc": 1703479541,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketvzie",
   "message": "I have multiple stories, but I'll share one of the dumbest ones.\n\nI was 19, DD'ing at a house party where some other underage people were drinking.\n\nAnother 19 year old woman got drunk and ran out of the house for some unknown reason. She ended up falling down in the middle of the street, so I tried to pick her up...what a big mistake. \n\nA nearby cop car caught us while I was mid picking her up and turned on his lights and called for backup. Within minutes 6 cop cars had us boxed in and 12 cops started questioning why I was assaulting this woman. Now I'm no narc, so I couldn't say that I was just trying to help this underage drunk woman back into the house. Instead I could only think to make dumb jokes like \"there's no way I would hit her, she could beat me up\". Thankfully she sobered up enough to say she didn't want to press charges and just wanted to go back inside.\n\nHonestly, if she panicked, she could've easily said I was hitting her to protect herself from a drinking charge. Being a nice guy doesn't pay off sometimes.",
   "created_utc": 1703479627,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketwgr8",
   "message": "Telling a cop to go fuck himself, screaming at him in his face.",
   "created_utc": 1703479913,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketxgae",
   "message": "Was suffienctly sauced.  \"Hey let me go an pee behind this house.\"\n\nOk it was after a Brewer game.  I said that to the driver of the car...  It's a Toyota corola or wtf ever that holds only 4.  Might have been an Escort.  Who cares small car.\n\nThey sitting in the street watching me go pee.  Cop pulls up behind them actually in traffic.  \n\n\"Hey come out from behind that house your pissing on!\"\n\nOk wtf I come out after putting my junk away.  Cop has me dead to rights and I admit I had to piss as the reason I was behind that house.\n\n\"OK hands on the trunk and spread em\" or w/e he said and im locking eyes with 5 of my friends crammed into the smallish car we supposed to be going home in.\n\nCop asks me if that's my ride pointing.  And I'm like yea...\n\nHe's like get the fuck in that car and don't come back.\n\nI jump through the back seat window of the smallish car, shouting go, go, go... feet still hanging out the window, me laying on top of 3 hammered buddies, all smoking, or rolling up what we about to smoke.  2 ankles hanging out the window as we scream out of a street parking spot.\n\nLike it obvious we rolling 7 deep in a 5 person vehicle tops, and my legs (shin down) waving out the window.  I think we drove 10 minutes towards home before we found a spot to reorganize the rest of the ride.\n\nLaughing our collective asses off.\n\nDon't drink and drive.",
   "created_utc": 1703480509,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketxywd",
   "message": "My folks were staying with my grandparents (mom’s parents). My dad went out for the evening with my half brother, came back to the house locked. He went into the back, found a way in with some effort, and the observant, un-knowing neighbors called the cops on him for a break-in. \n\nMy grandma didn’t like my dad much. So, when the cops came, my dad insisted it was his in-laws’ house. The cops said fine, show us a picture of you (their daughter’s husband) in the house. There weren’t any. \n\nEveryone got home just before he was getting hauled off as a burglar.",
   "created_utc": 1703480826,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketxzk9",
   "message": "Midnight in a car dealership's service dept.  Was there helping a service tech tune his truck.  He said owner was cool with us being there, etc., etc.  About 20 minutes into being there, saw flashing lights around building, then cops w/ guns aimed at us.\n\nTaken outside and while guy was explaining the situation, one of the cops recognized me, and said \"Hey, you're that guy from XXXXX!\".  Told him why we were there and he was super stoked about it, to the chagrin of the other cops who had no idea what he was talking about \n\nI had some T-shirts in my car and offered to give them some/sign them, to which he took me up on.  \n\nCouple minutes later, they left after confirming w/ dealership owner that guy was legit, etc.\n\nWent back to hacking/tuning a truck, lol.",
   "created_utc": 1703480838,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketyjpp",
   "message": "When I was a kid, my best friend and I would hitchhike around the American South.\n\nWe were standing on an exit ramp, I guess and two cops in one car rolled up on us.\n\nThey asked us where we where going, etc., and told us to pull out our pockets.\n\nAll our pockets came out except for my best friend's who's left front pants pocket was only pulled half way out. So one cop tells him to pull it all the way out, and he does.\n\nSo the cops separate us on the one on me asks why my friend looks so nervous. I tell him that his parents are really strict and that he'll be in a lot of trouble if his parents find out he's hitchhiking with me.\n\nI can see that my friend does look shaky. He's pale and a little unsteady on his feet like his knees are getting ready to buckle.\n\nThe cops finally leave and a rush over to my friend and ask him what's up?\n\nHe tells me that he has seventy five hits of Orange Sunshine in his left front pocket and when the cop told him to pull the pocket out all the way, he did, but by some miracle the plastic bag full of the hits just hung in there in his pants, behind his pocket.\n\nWe dodged the bullet that time and were able to make the trip down to The Dolley Sods Wilderness Area where the trip just got longer and stranger.",
   "created_utc": 1703481187,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketzcie",
   "message": "4 tabs of acid plus playing grounders with my friends at a park at 3 am. It's a child's game but fun, half of us where drunk underage and the other half where tripping on different amounts of LSD tabs. Cops came and accused us of doing heroin, this pissed me off. I asked why they cared if a bunch of young adults play on the playground while there are no kids or families there, they threatened to tow my car because I had in state license and out of state tags on my car in my dad's name. I didn't budge on my stance and held firm that he was just letting me barrow the car for school. They said they needed to search it and I denied them because they had no probable cause and had no warrant. They ended up running all of our names and we all found out a friend had a warrant from when he was 14, he got taken away while the rest of us drunk or tripping where told to go home. Weed was still illegal and I hid it under a slide at the beginning when I saw the cops, next morning it was still there with my remaining tabs still inside a grinder. Crazy how confident I was in their faces without being obnoxious or dramatic, only spoke in logically sound sentences and only spoke when it pertained to me or I was spoken to. \nThe cops cared more about us being there after hours and trying to get us to admit to doing heroin even though we where all just active and literally playing, not nodding or slumped. Really made me resent everyone in the counties law enforcement, how dare you think I'd touch heroin, go after the robbers and rapist.",
   "created_utc": 1703481686,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keu0plc",
   "message": "Once was patted down by a cop while I had a paintball gun in my waistband. He didn’t find it. \n\nAlso once ran from them on a motorcycle through LA. I got away by riding like an absolute lunatic. \n\nThe first instance was funny, the 2nd was stupid.",
   "created_utc": 1703482556,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keu10kw",
   "message": "I was pulled over for a rolling stop through a stop sign. I just sold the last of my bud, so I wasn't worried at all, most I would get is a ticket. My reason for the rush was the super bowl and just my luck I get the local asshole cop who pulled me out the car and searched me, I had a reputation. Needless to say he didn't find anything so he had to let me go (with the ticket of course) as he drive off he says I'm gonna get your ass eventually, I wish him a goodnight. \nKnowing I was just flagged at a stop sign, I sort of slammed the breaks at the yellow light near my place, paranoid that the cop is still following me and I hear something slide and then a loud BANG come from sun roof. I parked to check it out and it was a fucking pistol (Iron Pipeline)I forgot I stashed up there. \nThat Day I Stopped Carrying Needlessly...",
   "created_utc": 1703482750,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keu16ay",
   "message": "Been arrested, beat up, tasered and pepper sprayed by the cops lol. First time I was arrested I got my door kicked in and 13 cops came in with their guns drawn and screaming at me to get down ,I was confused and had just woke up so I didn't act quickly enough plus i was hollering at them asking wtf was going on, so they body slammed me on the ground HARD. They told me my car matched the exact description of a bank robber that just robbed a bank, and since my car wasn't common in my town (Royal blue 88 cutless classic) they def thought it was me. When they found out it wasn't me they apologized and were walking out the door leaving when dispatch came over the radio and said she had just found out I had a 7yr old warrant and I got arrested anyways. Talk about a bad day.",
   "created_utc": 1703482857,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keu2v8n",
   "message": "I was in the merchant marines and was assigned to military sea life command.  One day I was told to go with an admiral to collect some paperwork.    This admiral had a long fast stride and it was a challenge to stay up with him as he navigated the hallways of the yard. He went through a door with me a few steps behind. As I went through the door I found myself in a room with maps and monitors on the wall and rows of men in US Navy uniforms working at computer terminals.  I immediately felt two hand on my shoulders as I watched the admiral leave the room through a door at the opposite wall. I was escorted to a holding cell with thick black bars and that stainless steel toilet sink combo as this point I’ve only seen in movies.  A navel officer questioned me about who, why and what I was doing entering a secure room. I did my best to explain to him I was just following admiral Huff n Puff. That he lead me in to the room and the SP’s grabbed me as the admiral ran on.  I sat in that cell for 6 hours and was finally released when the admiral was leaving for the day and realized the paperwork was still on his desk and came looking for me.",
   "created_utc": 1703483983,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keuay5u",
   "message": "I have been detained due to running away from home in the middle of the night during deep depression and leaving behind a 'note' when I was 19. Don't think it counts as arrested. 2 cops found me, persuaded me to get in their car (no cuffs) and took me to a centre for the mentally troubelled where I was in a locked room for the night. If that doesn't count as arrested (which I don't think it does as I wasn't told I was under arresrt or read any rights) then that is by far the closest to actual arrest.",
   "created_utc": 1703490069,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keubfhs",
   "message": "I was detained for armed robbery. I have posted it before so I’ll just copy and paste the story.\n\n\nSo I had just picked up 3 of my friends from one of their houses. We left and were on our way to SAran Wrap one of our other friends cars. Not 1 minute after I picked them up we pass a police car. One of my frineds wasn't wearing a seat belt and we saw the police officer turn around and flick his lights on. We thought he saw the frined without his seatbelt on and that was it.\nWe pull over and the police officer sits in his car for 2 minutes until another officer pulls up behind him. We thought it was odd but figured he was just running my plates. He approaches my window and asks me If I knew the reason he pulled us over. I say jokingly \"Casue dummy over here wasn't wearing his seatbelt\" and me and my frineds laugh. The cop looks at me with a stern look and says \"Your vehicle matches the desciption of a car that just left the scene of an armed robbery.\" We didn t know how to react so we just looked at him and had that nervous laughter not knowing if he was just pulling our leg or not.\nHe took all of us out of the car and sat us on the ground. Ten minutes go by and there are about 6 police cars there now and 9 or so cops. People are starting to come out of their houses and its starting to become a scene. They line us up and tell us that the cruiser 50 yards away has the victim in the front seat and she is going to see if we were the ones who robbed her. We had nothign to worry about, we didnt do anything so we were about to be let go. Not what happened.\nONe of the Officers behind us points at two of my buddies and then cuffs both of them up and puts them in the back of a cruiser. My other friend and I dont know what to think. We start talking to one of the officers and he tels us everythign that happened. That there was a knife involved and that the women was slapped and a ton of info. They put us in the back of one of the cruisers together and leave us alone. We talk about what the officer told us and didnt think abything of it.\nThey bring us to the station and sit us at a table and tell us not to talk to one another. The lead officer on the case was our Baseball coach, So I guess he was one of the main invesitgators not arresting officer. They asked us Questions and all of our stories lined up perfectly. After 7 hours of sitting at the police station they finally let us go and tell us that they believed us and that since our stories were all exactly the same it couldn't have been us who did it.\nThis changed the way the cities police Department handled cases like this. Up until this point, if they had an eye witness who positivly ID'd a suspect, they would book the person and that would be it. But since My baseball coach was there, he pleaded for the chief to handle it differently that day.\nTurns out, the officer who told us all the info of what happened got in trouble becasue we were not suppose to know that stuff. So me and my buddy talking about it in the back of the cop car almost got us thrown in Juvi for the weekend.\nThe way we were treated at the station by officers not involved with the case was what hurt me the most. People walking by and asking if we were the thieves and stuff like that. 17 year old me was embarassed by the whole thing during the whole ordeal. But it was an awesome story to tell afterwards.\nI probobly left some details out since Im horrible at telling stories. if you have any questions or anythign just ask away. I will be happy to answer",
   "created_utc": 1703490471,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keuc7ej",
   "message": "I was briefly detained and then let off by the police.\n\nIn the mid-90s I was driving home from a shopping centre late at night with a mate in the car. We decided to take some back streets to avoid an intersection, and noticed a police helicopter circling around further down the street.\n\nIn the darkness we see a police officer crossing the road with a dog. I slow down to let them cross. They stop in the middle of the road. I stop the car. Another car comes flying up behind us and blocks our path backwards. The police chopper's spotlight shines on us.\n\nA plain-clothes officer appears at my window and I'm asked to get out of the vehicle. Other uniformed officers and vehicles appear and I'm asked why we are at the school... I look around and see we are now stopped on the street by a school. I tell them I had no idea there was a school here. I am questioned why I stopped - I said the officer with the dog blocked my path. Is this my car? Yes... well, no (it was a company car assigned to me).\n\nThe police ask more questions while the chopper had its spotlight on me, and my friend keeps yelling for me to tell the police we're just here because we are nosey, or to tell them just to fuck off and stop wasting our time. After looking through the car, the police soon realise we weren't the people who had apparently just robbed the school and let us go.",
   "created_utc": 1703491109,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keucwh7",
   "message": "Changing a AC filter door, in my driveway.  I live with my in-laws….  Fucking cops had me in cuffs until I knocked on my in-laws window(in cuffs) for my parents to come outside and tell them to get fucked.  Keller, tx.  Fuck Keller PD",
   "created_utc": 1703491690,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keucxlo",
   "message": "Back in high school, we were asked to run a mile from the local park back to the school as this was a monthly assignment. So on one of the early months of the school year, I ran to the classroom and sat down. A few minutes later a police officer comes barging in asking to talk to me. Mind you, this officer has nothing to do with the school and doesn't work on the school grounds. He said that he saw me running and he took it as \"I was running away from him\" and potentially committing a crime. And then my teacher had to step in. The officer then switched his story that he was in the area, because apparently someone had robbed jewelry from an elderly person and I matched the description. Luckily my teacher said a few things and finally left. I think I kist have been like 13 or 14 at the time",
   "created_utc": 1703491716,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keue3ph",
   "message": "Actually being arrested.",
   "created_utc": 1703492711,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keuksq1",
   "message": "Brought a cap gun to school, the police talked to me but I was never arrested",
   "created_utc": 1703498646,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keumd9g",
   "message": "Was drunk in a park and stomped a glass bottle so it exploded and when i looked up two officers were walking towards me. They just told me not to do that again. And i have never since lol.",
   "created_utc": 1703500063,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keupu5c",
   "message": "14 I was arrested for robbery of a Radio Shack. At that time I was hanging out with a bad kid and my parents warned me but I wouldn’t listen. So one night I had my best friend over and we snuck out with this bad kid. Now my dad works at the prison and it was cold so I wore his prison jacket. We walked throughout town and I thought we were hot shit being out past curfew. We come across this radio shack and bad kid starts dumpster diving. I’m looking at my friend wondering what the hell is he doing? So bad kid tells us to walk to the other side and make sure no one is coming. So we go ahead and do that. \n\nSure as shit as soon as we turn the corner we see a cop coming and we hid under a rig. For some dumb reason we decide to go back and take a look. Then we hear cops yelling at the bad kid to get down on the fucking ground with your hands up. So we jump behind a dumpster and a cop comes looking for us. I don’t want him to see us hiding so we come out with our hands up and I throw him my backpack which I then realized shit a backpack doesn’t look good. Then put us against the wall and searched us then put me and my friend in a car together. The bad kid they kept him separated from us the entire time. None of this seemed to bother him at all he just wanted his smokes.\n\nSo we’re at the station crying we just wanna go home we didn’t do anything. My friend is shaking and just asking for a glass of water when I’m thinking fuck my dad is gonna kill me. Behind us we see bad kid laughing and having a good time as he’s leaving. My friend was able to get ahold of his mom to pick him up. Me on the other hand my parents wouldn’t wake up if I couldn’t get ahold of them the cops were gonna put me in juvie and that scared the shit out of me. So I remembered how I snuck out and told them if you take me home I can get you in my house so they did. I took them through the basement which was my room and upstairs they sat in the living room as I got my parents. \n\nNow possibly one of the worst parts of all nights my parents switched sides where they sleep so instead of waking my mom I woke my dad up….too which he came down saw the cops and got my mom. I just sat on the rocking chair in the fetal position now saying a word. My dad wanted me to go to juvie while my mom thought she could handle the punishment. So I stayed him and they took everything from me down to just a bare mattress a pillow and blanket. I had nothing besides that and clothes to my name. I was grounded for a few months like that I think. Afterwards I had court and guilty to robbery, breaking curfew and breaking and entering. My punishment was next to nothing. $100 fine, write a letter of apology to the owner of radio shack and  my parents plus 30 hours of community service which I only did maybe 8 hours and probation for 6 months which I didn’t mind staying home. Later my file was expunged and never brought up again.",
   "created_utc": 1703503138,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketjsmp",
   "message": "My bfs ex-wife made a fake police report about drugs in our apartment. The drug dog was. Very friendly withy bfs daughter. She gave him pets after all they found were Flintstones vitamins and Excedrin.",
   "created_utc": 1703472882,
   "score": 4,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketoep1",
   "message": "I got pulled over in my home town 2 blocks from home on DUI suspicion. I blew under the legal limit and passed the field test. Cop made me leave my car and walk home as part of the deal (it had just started raining). I did name drop the Chief of police as my neighbor. Not sure if it helped or not. He told me he would drive by my house to make sure my car wasn’t there when his shift ended (that made no sense as I was leaving it closer to the police station). He made good on his promise, driving by at 6am shining his spot light freaking my mom out.",
   "created_utc": 1703475359,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketomki",
   "message": "Had a buddy who smashed all the toilets downtown. They suspected it was him but they had nothing to go on.",
   "created_utc": 1703475479,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketozv6",
   "message": "Can't decide between:\n\n* The time me and my friends were on a road trip and got pulled over with Snoop Dogg levels of weed in the car, only for the cops to not even search the car, force us to stand out in the freezing cold for an hour claiming there'd been \"burglaries in the area,\" steal all our cigarettes, and leave. \n* The time me and my friends were \"urban exploring,\" at night, in a locked office building, and the cops showed up when we were on the roof. We tried to get down but my friends shoes literally froze his feet to an HVAC duct and were trying to stay quiet while we un-stuck our friend and watched the cops looking around below us. All I remember after we got down was running until my lungs were on fire and getting completely hammered when we got back.",
   "created_utc": 1703475684,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "kett3x0",
   "message": "I (26 m) once was asked by my coworker at a previous job I had when I was 18, to come pick her up. She wanted me to pick her and our other male coworker up because I was the only one with a car. I told her that I didn't feel like it because I was tired, because she was asking last minute, and because I just didn't want to. She said in response to those things that she would suck my dick. I (an 18-year-old red-blooded male) of course said \"Ok, I'm on my way.\" She wanted me to pick them up just to drop them off at someone else's house. To make a long story short we're all in the car and they have me stop at the gas station. Unbeknownst to me, they picked up weed from a guy there and that was the whole purpose of picking them up. I was their oblivious drug taxi! As we were leaving the gas station not too far down the road we get pulled over by a cop (one of my turn signals was out). They pull us all out of the car and search us. I told the cops everything and how I didn't know shit about them picking up drugs. They handcuffed me and put me in the back of the cop car. I have never felt so defeated and worthless in my life...\n\nAfter a little while, they bring me out of the backseat and uncuff me. The male coworker was the main one who did the drug transaction and who had the drugs on him. They handcuffed him and put him in the back of the car. My female coworker was searched and they found a small amount of weed in her purse and a small one hitter. They let her off with a warning. Me and the girl got in my car and I drove her to a random parking lot on the way back to her house so we could breathe a sign of relief. I was this close... to being arrested. For one, I am a black guy and my coworker was white. All he had to do would have been to throw his drugs in my car and not claim them, and I would have been fucked. Luckily, he took accountability. After all that, I asked my female coworker if she'd give me that thing that she promised (the thing that had gotten me out of the house super fucking late and pulled over). And what a surprise, she said she wouldn't blow me. She did say I could suck on her tits if I wanted, and of course, being infuriated by her reneging on her offer, I then sucked on them.\n\nSo that's my story. Thanks for sticking through it, kind of a long read. But that's the closest I've ever been to actually being arrested. Dodged a fucking bullet. I don't talk to either of them now.",
   "created_utc": 1703477994,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketzm27",
   "message": "Back in 2010ish I was a single dad to a 9 year old son. Mom had filed for custody back 3 times and been denied. She had visitation from Friday 6pm-sunday6pm every other weekend. \n\nAnyhow. Son was getting bullied. I was in contact with the school who was monitoring the situation. They couldn’t just expel a kid back then. He had to have 3 “incidents”. \n\nLong story short, he approached my son, who pulled a knife on him. \n\nSmall country town. I work ems. I got the phone call from the principal who said she was supposed to expel my son, call the cops, yada yada yada. But she knew me, knew of my job in the city, etc. agreed to suspend for 2 days if I “took care of it at home”.  \n\nWe don’t spank, but I said this called for it. He got home, 3 seats on his butt. He never cried. He admitted his mistake. Took full ownership. \n\nBefore  he even got home I called his mom. Despite not having custody, she was his mom. Explained situation and she agreed spanking was appropriate. \n\nAnyhow. She picks him up about an hour after the spanking. 10pm that night I had a cop at my door. Who yelled, cursed, slammed his hand down and got in my face. Called me a child abuser. \n\nI kept my cool. Asked him to leave my property. 1 week later, a warrant was issued. \n\nCps investigated. Found no abuse. Family court held a hearing. Judge stated she thinks spanking kids is wrong, except in certain instances….and this was one of them. She applauded my parenting and said no change in custody. \n\nThe prosecutor said different. They said this was a political stand that “spanking is abuse” and mom was pushing for charges. (Because an abuse conviction could change custody). \n\nThe evidence was a red imprint on his bottom in the shape of a finger. The charge was misdemeanor child support. \n\nI plead it down to disorderly person. Spent 7 days in jail, 1 year probation, 2000 dollar fine. \n\n10 years later it was expunged from my record. Never hurt my career in fire/ems. \n\nBut it did ruin my support of the police and the justice system.",
   "created_utc": 1703481854,
   "score": 3,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keto360",
   "message": "i got put in jail overnight a few times. does that count?",
   "created_utc": 1703475186,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "keu1265",
   "message": "I was in Vegas once before I turned 21 and decided to put $20 in a slot machine at one of the strip casinos just to see what happens. I was dumb and my thought process was that I looked older than my age and that security wouldn't stop me. Anyway, I doubled my money and cashed out a ticket for around $40. A cocktail waitress was walking by and asked to see my ID. I had my ID on me, but didn't want to show it, so I did the \"sorry, left it in my room\" excuse. She told me I had to have my ID to be at the casino, so I said \"sorry, I'll leave right now\" and walked away. A security officer saw me, also asked for my ID, said I left it in the room again, then he asked me how old I was. I nervously said \"uhhh....22?\" and he responded back with \"uhhh...you sure about that?\" and then I basically admitted I was (I think 19?) at the time and gave up my ID to the security guy.\n\nA few more security officers came around, and they're all talking to each other trying to figure out what to do with me and they asked me why I was gambling when I wasn't 21. In Minnesota, where I live, you can gamble in our casinos at 18, so I told them that and that I forgot you had to be 21 to play in Vegas. (even though I had lied about my age once earlier, LOL)\n\nAnyway, after about an hour of being detained, they told me they wouldn't be arresting me and that I was trespassed from the place until I turned 21. They also gave me back my $20 that I initially put in the machine, but they said they had to keep the winnings, and they told me not to come back until I was 21. Fine, if that's the worst thing that happens to me from all of this, then I'd be happy. But, I was scared shitless the whole time being detained.\n\nFast forward a couple years later: the next time I was in Vegas (and was now 21), I went back into that same casino and won $4,000 in a night. I jokingly called it payback for detaining me that one time. Haha.\n\nThanks, Wynn, for the $4k. I forgive you now. ;)",
   "created_utc": 1703482779,
   "score": 2,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketkd8w",
   "message": "Big surprise that the people who can’t follow the law can’t follow the prompt",
   "created_utc": 1703473197,
   "score": 1,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketlxjm",
   "message": "I’ve had a few juvenile arrests , but my funniest arrest story was in North Jersey as an adult. Decided to skip community college with some friends, pull up to an apartment complex most of us grew up at. Was rolling a blunt in my car , a random vehicle pulls up. This car looked like an old 60s beat down ride. I thought it was the superintendent from the apartments, but it was a detective there for something unrelated. He asked me where the blunt is. I threw it under the car when he pulled up . Now my buddy had weight on him, a good amount of weed because he was a dealer, this was in 2006. I couldn’t risk him searching everyone so i got my blunt and gave it to him. I was in handcuffs, but the funny side of this story is that the uniformed cop that arrived to take me to the police station, was my childhood D.A.R.E officer 🤣",
   "created_utc": 1703474042,
   "score": 1,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketox6i",
   "message": "comitted arson in front of a musical school, almost burned the whole fucking building down. I'm 14 and since i'm a minor i can't be arrested but i was grounded for the rest of the year.",
   "created_utc": 1703475644,
   "score": 1,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketq9xi",
   "message": "Actual arrest, four times.",
   "created_utc": 1703476389,
   "score": 1,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketqc7q",
   "message": "Actually being arrested.",
   "created_utc": 1703476425,
   "score": 1,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketvtn7",
   "message": "It wasn't the cops but the city patrol. Me and my freinds were lighting peices of fabric on fire in a park until we seen a city van so we had to hide in some bushes and run home lmao",
   "created_utc": 1703479530,
   "score": 1,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketxqhq",
   "message": "I have 4 warrants and have been pulled over 6 times without getting arrested. 😅 each time I write phone numbers on my arm so I can remember numbers lmao. Very tight but whole situations.",
   "created_utc": 1703480683,
   "score": 1,
   "submission_id": "18q8t19"
  },
  {
   "comment_id": "ketxpll",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18q8t19"
  }
 ]
}