{
 "submission_id": "18qbn1o",
 "title": "Guys, what is it about a woman that you find impressive?",
 "selftext": "",
 "created_utc": 1703479871,
 "permalink": "/r/AskReddit/comments/18qbn1o/guys_what_is_it_about_a_woman_that_you_find/",
 "score": 53,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qbn1o/guys_what_is_it_about_a_woman_that_you_find/",
 "comments": [
  {
   "comment_id": "keuawed",
   "message": "Honestly, when I live alone my home is a basic soulless place. But when I have lived with a woman, she really manages to make it into a place that feels alive. Even the cities I live in, as a single man, I only see a fraction of what it has to offer, but when in a relationship, my girlfriend opens up the city in such a colourful way. So yeah, women add a lot of colour to life.",
   "created_utc": 1703490028,
   "score": 60,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu0psq",
   "message": "I love how my girlfriend coordinates her life. Nothing seems to surprise her.",
   "created_utc": 1703482560,
   "score": 189,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu1pd1",
   "message": "A genuinely caring woman can have a calming and comforting effect that’s almost supernatural imo",
   "created_utc": 1703483208,
   "score": 238,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu0268",
   "message": "As a woman, reading this was interesting. Thanks for the answers... never thought these would impress men",
   "created_utc": 1703482138,
   "score": 84,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu2qw0",
   "message": "Competence. Competence is impressive.",
   "created_utc": 1703483901,
   "score": 143,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketwz7f",
   "message": "Their incredible teleportation powers and super-human ability to travel through time.",
   "created_utc": 1703480221,
   "score": 188,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu9edm",
   "message": "Seeing the way a lot of family events are primarily taken care of by the women (I.e. planning, invites, doing most of the cooking, coordination, etc). At least in my experience, the women are the backbone of get togethers, dinner parties, celebrations, etc. It's a lot of coordination and labour and keeps all the family together and bonded. I feel like a lot of families would drift apart without this.\n\nAlso growing another person inside them! Women are basically the reason for family in the first place.",
   "created_utc": 1703488818,
   "score": 159,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketzod5",
   "message": "How soft their skin is.\n\nTheir ability to have a calming effect when us dudes feel like the world is falling apart.",
   "created_utc": 1703481896,
   "score": 190,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketycb7",
   "message": "Dealing with having a period. Basically a week out of every month for most of their life is experiencing discomfort and pain, among other symptoms. Shit sucks hang in there ladies",
   "created_utc": 1703481057,
   "score": 232,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keum14x",
   "message": "This comment section is so wholesome. I have seen a ton of misogynistic men in my life. It’s nice to see there are men who are actually grateful to women. I hope all of you have a great, happy life",
   "created_utc": 1703499757,
   "score": 78,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu11mz",
   "message": "When I realized that they couldnt even own a credit card until 1974 and my own mother grew up in an era without genuine equal rights. \n\nReally. \n\nI cannot believe how close we are historically to women being treated like children. \n\nWhat I find impressive is many a woman’s ability to balance both putting up with that shit while also living life and brushing it off their collective shoulders. \n\nLike god damn, I didnt see it for years, but once you see how talked down to and patronized most women are…its impossible to unsee\n\nIts not the case with everyone but damn I see it often\n\nAlso they generally smell better then me and most men as a default…. \n\nLock me and a few of the boys in a room with a few girls for a week no shower and the men would rightfully be quarantined to the stink corner. Not saying women dont smell. Ya’ll can stink. But got damn it’s just not the same.",
   "created_utc": 1703482770,
   "score": 73,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketwlqm",
   "message": "Ability to grow a human.",
   "created_utc": 1703479994,
   "score": 16,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketzm9r",
   "message": "finding time to do yoga in the morning",
   "created_utc": 1703481858,
   "score": 92,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu1boj",
   "message": "Just how often they turn out to be right. I just hope my wife doesnt read this though.",
   "created_utc": 1703482957,
   "score": 194,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu62i7",
   "message": "Proactivity. Wholesomeness. Feeling that you have a reliable person with you which cares, and not some Eva AI avatar or top model just to show off.",
   "created_utc": 1703486264,
   "score": 66,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketwo0i",
   "message": "I’m really impressed with women who own successful small businesses, especially if they also have children. That must take resilience",
   "created_utc": 1703480032,
   "score": 153,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuktc0",
   "message": "A woman with a strong initiative and straightforward manner is like the hottest thing there is, not the \"boss girl\" social media bs which is usually a mix of narcissism and lack of self-awareness, but when I meet an intelligent woman who has her future planned out, knows what she wants, works hard for it, and in a relationship, actually works hard to grow that relationship and be a balanced partner. Every guy's dream relationship is one where you're both always trying to be the 70.",
   "created_utc": 1703498661,
   "score": 34,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu5b3k",
   "message": "Shout out to single mothers.",
   "created_utc": 1703485704,
   "score": 89,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keufvp6",
   "message": "Soft skin. Like what the fuck",
   "created_utc": 1703494254,
   "score": 62,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketxkxu",
   "message": "How functional they are despite having to deal with periods, pregnancy, and men trying to control their bodies. People (Sexists) try to say that women are the weaker sex, but I can't imagine putting up with all that and still being functional in society.",
   "created_utc": 1703480589,
   "score": 39,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuarvg",
   "message": "The fact that they can manage stress and sometimes physical pain more than men can. It’s really impressive and unexpected for me personally",
   "created_utc": 1703489924,
   "score": 81,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keum130",
   "message": "I find the things in woman impressive the same thing I find impressive in any human: intelligence, empathy, compassion, humbleness, optimism...",
   "created_utc": 1703499756,
   "score": 24,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketxgb3",
   "message": "How they can make time for everyone and everything.",
   "created_utc": 1703480509,
   "score": 33,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu93ni",
   "message": "The ability to just flat out be tough as nails, but be soft, warm, and caring at the same time. I just don’t know they do it but it impresses the hell out of me.",
   "created_utc": 1703488577,
   "score": 58,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu4t0f",
   "message": "Everything.  I'm a 70 yr old male and have found women can do everything a man can do PLUS have children.",
   "created_utc": 1703485335,
   "score": 96,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu50fq",
   "message": "Their 6th sense for relationships and people.",
   "created_utc": 1703485487,
   "score": 86,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketzxma",
   "message": "The trio of wisdom, knowledge, and appreciation of arts.",
   "created_utc": 1703482058,
   "score": 28,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuaddn",
   "message": "I find impressive how resilient and strong my wife is.",
   "created_utc": 1703489603,
   "score": 18,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu2a3h",
   "message": "Pregnancy, raising children, handling the finances, household chores, cooks, primary breadwinner, going to school, and secondary job. Yea, being a woman fucking sucks. Fuck this.",
   "created_utc": 1703483586,
   "score": 38,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu6hoo",
   "message": "Ngl, the confidence. Shit has always and will always baffle me. Like i can’t even talk to family without getting nervous how are y’all able to hold full on conversations for hours and hours, go up to people and start talking to them and just become friends instantly.",
   "created_utc": 1703486576,
   "score": 41,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu88cr",
   "message": "Their ability to make places look good/ lived in",
   "created_utc": 1703487903,
   "score": 24,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keua1e0",
   "message": "The ability to be so fragile and yet so damn strong when they need to.",
   "created_utc": 1703489333,
   "score": 21,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuh3wl",
   "message": "idk about other women, but one thing I appreciate about my wife is her ability to make a house a home. As in, you can tell when she's not there; the house feels dull and lifeless. I hate spending time apart from her",
   "created_utc": 1703495334,
   "score": 22,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keukqln",
   "message": "I’m gay, so I’m not speaking sexually. I always admire women who are confident in their bodies and carry themselves with confidence.",
   "created_utc": 1703498594,
   "score": 22,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keudwgm",
   "message": "Wits and humour, can't go wrong with those.",
   "created_utc": 1703492534,
   "score": 13,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu0vmg",
   "message": "Bleeding for a week straight and not die.\n\nThat is scary.",
   "created_utc": 1703482663,
   "score": 46,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keucvbk",
   "message": "i'm a woman but i do find it very impressive how most of us are willing to give a guy a (countless) chance even though he's not worthy of it",
   "created_utc": 1703491663,
   "score": 26,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kev29jt",
   "message": "Many of the woman who I have become very close friends in the past with were all creative, intelligent, expressed emotions without restraint, had compassion for animals big and small. Someday I hope I can find someone interested in me who shares those characteristics.",
   "created_utc": 1703512300,
   "score": 6,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu9k7v",
   "message": "Being a woman is impressive",
   "created_utc": 1703488948,
   "score": 17,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuc2yx",
   "message": "Empathy",
   "created_utc": 1703491006,
   "score": 17,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keucvsa",
   "message": "Scanning men without getting noticed?\n\nInternet says women notices minute details in men but when? Either this is bullshit or i'm lacking something.",
   "created_utc": 1703491673,
   "score": 18,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketwki4",
   "message": "How easily a girls friend group can fall apart.",
   "created_utc": 1703479974,
   "score": 86,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kety927",
   "message": "Their ability to read men and fellow woman",
   "created_utc": 1703481000,
   "score": 8,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keud7jm",
   "message": "emotionaly mature",
   "created_utc": 1703491952,
   "score": 9,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuc1lj",
   "message": "Honesty/integrity, kindness, sense of humour, positive attitude, dedication to making the most of life for self and others - the things I find impressive in any human, woman or man",
   "created_utc": 1703490973,
   "score": 12,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketwxrb",
   "message": "women deal with a-lot and handle it pretty well, some of them. pushing out them babies as well, and there’s a few things i never notice til i see them.",
   "created_utc": 1703480196,
   "score": 24,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu9gid",
   "message": "When they have huge tracts of land",
   "created_utc": 1703488866,
   "score": 17,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu5bs5",
   "message": "She’s accountable and can apologize and make steps to amend.",
   "created_utc": 1703485717,
   "score": 14,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketzc9z",
   "message": "Same things that makes a guy impressive.\n\nSome kind of personal achievement that can’t be bought, given, taken, or inherited. \n\nLike a technical skill or some hobby or athleticism",
   "created_utc": 1703481682,
   "score": 34,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuet8x",
   "message": "I've seen my girlfriend order clothing online that doesn't fit, then grab some scissors and 5 mins later she's not only got the clothing to fit, but has made it a whole different style",
   "created_utc": 1703493323,
   "score": 11,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keujy4j",
   "message": "I mean, it's probably not overly healthy, but I love a woman who does her own thing and doesn't need a lot of validation for it. Just goes her own way. But is also ope to relationships with other poeple. THIS IS BRILLIANT.",
   "created_utc": 1703497875,
   "score": 5,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keumf4c",
   "message": "In the words of Jim Gaffigan:\n\n\"A woman can grow a baby *inside* her body. Then somehow, a woman can deliver that baby *though* her body. Then by some miracle, a woman can feed a baby *with* her body. And when you think about the male contribution to life... it's pretty embarrassing.\"\n\nIn all seriousness though, my favorite social therory is that the reason men do anything is in the pursuit of women. Like the right woman can really bring the best out of a man which in turn spreads to his family and the community at large.",
   "created_utc": 1703500110,
   "score": 13,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu9gq9",
   "message": "Everything, yall are incredible.",
   "created_utc": 1703488871,
   "score": 10,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu4dco",
   "message": "My wife has certain instincts when raising our child that I simply don't have.",
   "created_utc": 1703485027,
   "score": 15,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu9fyw",
   "message": "God damn. If anyone needs examples of the crap women put up with daily…read the thread. \n\nRemember it asked what guys find impressive about women. Half the thread is about their boobs. Then theres all the backhanded compliments. Like “I like women who dont DO Shit That Annoys Me!” \n\nGuys, come on. Youre makin me look bad.",
   "created_utc": 1703488854,
   "score": 39,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuhl3t",
   "message": "I think what impresses me about women, and I'm really sorry to sound all Peterson here because I can't stand that guy, but it's how well they perform across all competence hierarchies. Not even \"as compared to men,\" even though they do, but I mean just generally. \n\nWhen I am looking to increase any part of my life by gaining some skill or insight, I will usually defer to a female opinion. My personal doctor is a woman, my accountant is a woman, most medical specialists I see are women. My business' marketing consultants and branding specialists are women.  The amount of effort women put in across the board compared to men in even things like attractiveness and self-grooming, clothing and styling, finances, interior design and decor, men just can't hold a candle to this collectively speaking.   \n\n\nAnd the more I started to learn about women and their behaviours, my own shortcomings became exposed to me in ways I never realised. I never realised how bad I dressed, or how bad most men's hygiene and grooming is, because women were so good at doing these things that I almost thought they were biological differences. I thought that woman with expensive hairstyles just *had hair like that.* I thought women who plucked and preened and removed all their hair and tanned all over and were completely smooth were just *really fortunate*. I never realised you could just do all this shit to look so good, and then I noticed hardly any other men knew this.   \n\n\nIn conclusion: what impresses me with women is how advanced they are compared to men, while seemingly doing it in total silence. And how frustrating it must be to feel surrounded and powerless to the \"superior sex\" when the \"superior sex\" is a bunch of low IQ, uninformed, sexually violent psychopaths who couldn't compete academically or professionally or socially any more.",
   "created_utc": 1703495753,
   "score": 21,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuba7b",
   "message": "When she appreciates you for your highs… but also sticks with you throughout your lows. \n\nMen are never going to sustain a 100% success track record. A woman who understands that and chooses to be your pillar of support when you’re getting shafted by life — now THAT is what a man should cherish and hold on to forever.",
   "created_utc": 1703490347,
   "score": 11,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuk4r0",
   "message": "Their ability to love, their independence yet their openness when they need to depend on you. Also, the way they make you feel comfortable, the inner beauty they have and honestly the way the can make us feel amazing or cry in an instant. It's scary in a way yet beautiful if that makes sense. \n\nThere's something truly immaculate about women, especially certain ones. It's like you feel like you can grow more with them, they just embody this higher level. \n\nThe intelligence on many, street smart, book smart and their emotional intelligence, this varies with certain individuals but it's truly remarkable how well-rounded yet insanely unique or amazing they can be.",
   "created_utc": 1703498042,
   "score": 6,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keua2p4",
   "message": "Their scent.",
   "created_utc": 1703489362,
   "score": 3,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuhwwo",
   "message": "With all the responsibilities of a women often in relationships. Some of the women I've observed, I've been impressed with their ability to just get on with it. All right to complain sometimes but they just soldier on. It's impressive",
   "created_utc": 1703496046,
   "score": 3,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuvj12",
   "message": "The way she makes the effort in her cleanliness and appearance, from my point of view it looks exhausting what they do on a daily basis. Hair, nails, make up, style choice etc. My generation of men, we jump in the shower, brush teeth, quick squirt of deodorant, pair of jeans and a shirt and away we go. She does so much more on a daily basis for her appearance, and I never grow tired of looking at this woman, absolutely stunning at 50 years old.",
   "created_utc": 1703507751,
   "score": 3,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuwfcc",
   "message": "I’m impressed when ladies can dress down and do guy stuff. When they know enough things in general to have a reasonable conversation about something they don’t know a ton about. \nRecurring fantasy; attractive woman operating a bulldozer.",
   "created_utc": 1703508425,
   "score": 3,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuz2qt",
   "message": "They sometimes go through like a day of endless tortures that wouldn't be considered legitimate by any modern military law - and later goes like \"Let's have another baby\".",
   "created_utc": 1703510271,
   "score": 3,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kev1i5o",
   "message": "Their sixth sense. Seriously, that's some voodoo level shit right there.",
   "created_utc": 1703511827,
   "score": 3,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kev7q4f",
   "message": "Most of the answers here just seem like a rehashing of the the “women are wonderful” trope. \n\nI think the question is more specifically about what impresses you about *a* woman, not women in general. \n\nI’ve found myself most impressed by a woman when she calls me out on my bullshit in a teasing sort of way. In general, demonstrations of a deeper understanding that I didn’t have on my own. This shouldn’t be specific to women but it always catches me off guard and impressed me.",
   "created_utc": 1703515499,
   "score": 3,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuhe02",
   "message": "a whole fucking lot \n\nin my opinion women carry the world on their shoulders",
   "created_utc": 1703495579,
   "score": 7,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketyeqx",
   "message": "How do they handle thirst comments and people asking them out every.. day...",
   "created_utc": 1703481100,
   "score": 12,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keu3q5r",
   "message": "Not a man, but as a woman, I have been told by many guys that they find my cooking and baking skills impressive. One guy asked me out once because he found out I could make banana bread. Lol \n\nI'm also lurking cause I wanna see what guys are saying in the comments. 😆 \n\nMade homemade beef stew and brought some to a male coworker who gave me a ride home. His mind was blown that I made beef stew cause he couldn't cook very well, apparently.",
   "created_utc": 1703484575,
   "score": 10,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuawrp",
   "message": "When someone texts you or tells you the most absurd joke or item simply because they thought of you. The self-assurance to convey your concern for the other person.\n\ncoloured toenails\n\nHair in the morning",
   "created_utc": 1703490037,
   "score": 4,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keue2fb",
   "message": "If they enter a room, its about them. Even if they dont want it. Never understood how that works",
   "created_utc": 1703492680,
   "score": 5,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keufhnu",
   "message": "A personality, and intelligence.",
   "created_utc": 1703493916,
   "score": 5,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "ketwhz9",
   "message": "[removed]",
   "created_utc": 1703479932,
   "score": 4,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuat89",
   "message": "Everything!",
   "created_utc": 1703489955,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keug72z",
   "message": "How smooth and spotless their skin is",
   "created_utc": 1703494532,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keuisjy",
   "message": "My wife’s ability to take care of everything that she does and deal with my shit and be in a good mood. She’s a goddess and I will worship her forever.",
   "created_utc": 1703496831,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keux04o",
   "message": "Being old school, romantic, loyal, loving and caring, HAVING SENSE OF HUMOR AND SARCASM, when her body is her temple, positive look on life, having passion/strong desire of something. Rest is more or less not so important.",
   "created_utc": 1703508844,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kev1mwp",
   "message": "If she can listen to me for about an hour of me talking about the Mount Chilliad mystery.",
   "created_utc": 1703511910,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kev1xex",
   "message": "Emotional maturity and mental stability",
   "created_utc": 1703512094,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kev2t1j",
   "message": "My girlfriend, who isn't perfect, but nobody is, always is trying to improve, and is constantly motivating and helping me to improve. It's the first time I've been with someone that's felt like we are a team that can handle whatever adversities we come across. I love her so much",
   "created_utc": 1703512635,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "kev5w1s",
   "message": "Depends on the woman, there's about 4 billion of them so you'll have to be more specific.",
   "created_utc": 1703514459,
   "score": 2,
   "submission_id": "18qbn1o"
  },
  {
   "comment_id": "keugvlj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qbn1o"
  }
 ]
}