{
 "submission_id": "18qdakr",
 "title": "What made you go \"Wow, this person is an absolute psycho.\"?",
 "selftext": "",
 "created_utc": 1703486655,
 "permalink": "/r/AskReddit/comments/18qdakr/what_made_you_go_wow_this_person_is_an_absolute/",
 "score": 180,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qdakr/what_made_you_go_wow_this_person_is_an_absolute/",
 "comments": [
  {
   "comment_id": "keu7r12",
   "message": "Had a friend in middle school, we would text/message on MySpace throughout the night talking about how we were vampires and all the vampire stuff we were getting into (peak twilight era) - one day she came to school, legitimately angry at me because I had been “lying” about being a vampire. I remember looking at her and being like “uh yeah.. we’re like.. roleplaying, obviously. What do you mean?” And she went on a full spill about how she was *not* roleplaying and I was a lying loser idiot who tricked her and she was a *real* vampire, dammit. I just remember backing away slowly and thinking “this bitch is crazy”\n\nListen, like 15 years later I can confirm, she was and is crazy as hell.",
   "created_utc": 1703487527,
   "score": 67,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu711z",
   "message": "They didn’t like mister Rogers, like they actively disliked him.",
   "created_utc": 1703486979,
   "score": 49,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu8bju",
   "message": "I had a customer who \"knew\" that her entire family had been replaced by actors. Those had gone through extensive surgery and training to mimic their body language, way of speaking and such while all memories of the relative they replaced had been transferred to them with a chip in the arm. She told me she was a nurse and had witnessed this in other cases. \"It's really crazy! This actor lives in the house of your relative, looks like him, speaks like him, knows everything that happened 20 years ago. But this isn't your relative!\"\n\nShe was 100% convinced of this, not the smallest doubt. Her main concern was what happened to her real family. Only years later I learnt this is called Capgras delusion. I hope she got help, and that she could 'reunite' with her family.",
   "created_utc": 1703487970,
   "score": 33,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu7tq5",
   "message": "I had a girl roommate that made me think that lol. I (F) lived in a condo with 2 other girls. When she and the other girl first moved in (like within the first month sometime) We were all eating dinner together and were talking about funny/psycho tinder dates we had and would show who they were etc. I was telling one about a guy that was fucking crazy, obsessed with me, stalked me for 6 mo. and literally how he made me feel so unsafe and would show up to my house.\n\nThe next week I leave for a week to Boston, and come home from the airport and walk into my house to **SEE THE GUY WHO IS MY PSYCHO TINDER DATE STORY SITTING ON MY COUCH IN PAJAMAS WITH MY FUCKING ROOMMATE**. I remember my stomach dropped out of like fear.. like what the actual FUCK are you doing IN my house. Turns out when I left to Boston, one of my psycho ass roommates found this fucker on fucking FACEBOOK and hit him up to come over *(my roommate \u0026amp; I are GenZ so hitting up someone on FB as a GenZ in 2022 is weird as fuck).* Turns out my my psycho-ass roommate was fucking my psychopath stalker tinder date at my house. he stayed for the WHOLE WEEK I was gone. Like wtf was wrong with my roommate?? she heard me tell that fucking story??? fucked up in the fucking brain. I remember thinking like \"what are you  going to do next mf collect my hair and make a wig out of it???\" I was soooooo uneasy and was stuck with this whack ass girl as a roommate for a whole god damn year. mf psychopath.",
   "created_utc": 1703487588,
   "score": 47,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu78dh",
   "message": "When she tried to hit me with a wooden cutting board in the kitchen because she was mad about something stupid",
   "created_utc": 1703487129,
   "score": 15,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu7p8y",
   "message": "Whenever someone hit a dog",
   "created_utc": 1703487488,
   "score": 11,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu8sb6",
   "message": "When she started sending me pictures of her new boyfriend, half naked. Then showed up at my work to tell me how he felt about me based on what she told him. \n\nI’m so glad I ran far and fast from that one.",
   "created_utc": 1703488330,
   "score": 8,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuekpd",
   "message": "I went on a date with this girl some years back. The date itself was very nice, we got dinner together, talked about this and that, and spent most of the day together. I fully planned on seeing her again. She went to drop me off, I thanked her for the date, said I'd like to see her again, and started to get out of the car. And then she started to get out of the car. And I was like, \"Okay... I guess you can meet my sister and brother in law\" (who I was staying with at the time). Well we all have a nice chat, they say their goodbyes, and then she turns to me and asks if I wanna watch a movie in my room. It's past 11pm, I'm tired, but I figure, what's the harm in a movie. I almost fall asleep a couple times during the movie but resist, since I don't even really know this person. Finally, credits are rolling, I'm standing up to imply that this has gotta end. I ask to walk her to her car, she puts on some whiney voice asking if she can just sleep over. I put my foot down and say I feel uncomfortable with this on the first date. She finally gets the hell out of my apartment. But it's not over. She says something about sleeping in her car in front of the complex bc it's \"too late to drive\" (then fucking leave earlier???)  But I say that I'd rather know she gets home safe. She drives off, I try to go to sleep. About 3am, she calls me, about some guy that's at the pump at the same time as her, and she's scared. I say okay, I'll stay on the phone until you're on the road and safe again. Whatever. She takes off again, I fall back asleep. She calls AGAIN at 5 or so. Crying about \"wrecking her car\" which actually turned out to be her slightly hitting the median. I even hear some trucker asking her to just get the hell off the road. I'm so fed up at this point and I've lost all interest but I talk her through getting back in the car and finishing the trip. The next day she tells me how excited her dad is about \"finally making a friend\" and that \"meeting me is keeping her from killing herself\" and all kinds of whackadoodle shit like that. At that point I just blocked her. No idea where she is now but as long as she's not in my life, that's fine.",
   "created_utc": 1703493117,
   "score": 8,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keublte",
   "message": "Worked for a staging company that built truss grids for concerts. About 500 steel pins of the wrong size got sent to us. These things were about a pound each with a pointed tip. One of the techs filled a big gulp cup with them and kept it in the center console of his car to throw them at other vehicles if they pissed him off. At highway speeds they easily could’ve been lethal.",
   "created_utc": 1703490615,
   "score": 6,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuanl0",
   "message": "When he lost, then tried to manipulate the results of the 2020 Presidential Election in his favor.",
   "created_utc": 1703489828,
   "score": 35,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu840z",
   "message": "when they put the milk first then cereal, im runnin",
   "created_utc": 1703487811,
   "score": 10,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu9j3y",
   "message": "They stabbed me over a napkin dispute.",
   "created_utc": 1703488924,
   "score": 5,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keue4m6",
   "message": "An old boss of mine during a lunch meeting flirted with the waitress and pressed her for her number. She was clearly uncomfortable but my boss was a regular and tipped well, so she gave him a number. \n\nAfter she walked away, my boss bragged about how he’s a major ladies man and could sleep with any woman he wants given the chance to swoon them. \n\nHe continued that conversation in detail for about 20 minutes before finally saying “I’m stressing all of this to you [Goopy] because I want you to understand how easy it would be for me to take your girl if you ever cross me.” He then began to tear up and with a small sob said “please don’t make me wreck your life man.” \n\n\nThat’s the day I started searching for new jobs",
   "created_utc": 1703492732,
   "score": 5,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu786x",
   "message": "I was making small talk with a coworker the other day about what music we are into. he says, and I quote, “I don’t know really… I guess I’m just not that into music”",
   "created_utc": 1703487126,
   "score": 19,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keubqx6",
   "message": "Tom Cruise’s 91/2 minute interview about Scientology (he’s in a dark turtleneck for reference). He sounds loco and laughs like a madman.",
   "created_utc": 1703490728,
   "score": 4,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuce1u",
   "message": "I knew a girl who had HPV or some sort of STD, and she’d fuck guys and not tell them she had it, no condom, and then would put the blame on the guy for not checking with her. “It’s their responsibility to ask if they need to wear a condom”",
   "created_utc": 1703491265,
   "score": 7,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuffiu",
   "message": "Told my bestie I was getting a matching memorial tattoo with my sibling -- in order to remember my brother who was killed by a drunk driver.\n\nShe was offended I wasn't getting my first tattoo WITH HER and tried to pitch matching bestie tats. Said she couldn't believe I didn't think our bond was \"as special\" as the one I had with my dead sibling and it made her feel insecure.\n\nI lost about 160 pounds that month. Good riddance.",
   "created_utc": 1703493864,
   "score": 1,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu6wxc",
   "message": "“I don’t enjoy ice cream”",
   "created_utc": 1703486893,
   "score": 6,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keub1vj",
   "message": "\"I've taken too much ayahuasca, to be have ego problems\" it was explained in response to an intervention relating to abuse and manipulation allegations",
   "created_utc": 1703490155,
   "score": 2,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuefki",
   "message": "She sent me screenshots of her conversations with other people. They were on discord. Her profile pics in the screenshots were the pics she had at the time, which meant she was constantly taking screenshots of her conversations when they were happening",
   "created_utc": 1703492993,
   "score": 3,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keucm5q",
   "message": "I had a friend in college who had a dorm room and so in between classes we hung out in her room and sometimes we go out partying and I’d crash in her room. These were the days we wood go to Blockbuster and rent dvds and I noticed she had a DVD called “Single White Female”. It was an older movie about a woman putting an ad in the newspaper for a SWF to rent her room. Then the roommate was psycho and started dressing like her and getting the same haircut and style and pretending to be her and just became a psycho trying to kill her. I asked if she had already watched it because it was a crazy movie. She said she hadn’t yet. I used to work partime as an office assistant and go straight from the office to night school. She was taking the same classes so she would see me dressed in office clothing. One day she said omg I love your shirt and pants where did u get it and she asked me to take her there and so I did and she bought the exact same outfit. And started dressing like me and shopping at the same stores. Even though she worked as a server it was weird. But it got weirder when she started growing out her hair long and cutting it just like mine and copying my makeup style. When she met my bf briefly she kept telling me she thought he was cute. Then I was at her place and noticed the dvd was still not returned to Blockbuster and I said omg you’re going to get fined for not returning that. She said she was keeping it because she watched it every day. That’s when the hairs on my neck stood up. I then realized she was following the movie script and I was the woman she would try to kill and take over my life. That night I already planned on spending the night because it was late but I couldn’t sleep I was trying to get out of there but the buses didn’t run at that hour I had to wait until 5am. When I heard the buses, I got up and started getting my backpack together to leave and she instantly rolls over onto my pillow and breathes in my scent deeply. I was horrified but kept my cool. I left and ignored her multiple calls and text messages. But I knew I had to go back there to get my jacket and books. So she blows up my phone over the weekend and I asked my friend to go with me and warned her that she was psycho. I finally pick up her call and she acts like nothing is wrong. I tell her I was showing up there with friends to get my stuff and to have them ready. I go there and she wasn’t happy to see my friend walk in with me and I look around and my jacket and 4 books were nowhere to be found. She then says she needed to speak with me privately. I say whatever she needs to say can be said in front of my friend but she refused and kept begging to speak privately. I then tell her to give me my things now and I will call her later so we can talk. She proceeds to pick up a pile of her clothing where she had my jacket and books underneath. I take the stuff and walk out. Total psycho.",
   "created_utc": 1703491454,
   "score": 2,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuct9s",
   "message": "I woke up. Good morning!",
   "created_utc": 1703491616,
   "score": 0,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keud4xk",
   "message": "When one llie and don't understand the situation and unable to understand the situation and start arguing for no reasons I guss",
   "created_utc": 1703491891,
   "score": 0,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keub270",
   "message": "When he tucked his junk and told me to put lotion on my skin",
   "created_utc": 1703490162,
   "score": 254,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu6zwd",
   "message": "When I hear people actually ENJOY eating kale. I mean, you can SAY you like it all you want, but not even lifelong vegetarians probably like it. Eating Kale, and saying you like it, is like listening to Limp Bizkit, and saying you like it: you're just lying to yourself, either for an image, or just masochism. Eventually you've gotta wise up and realize you're torturing yourself for no reason.",
   "created_utc": 1703486955,
   "score": 250,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keu7bqv",
   "message": "June 19th",
   "created_utc": 1703487201,
   "score": 252,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuax7m",
   "message": "created a whole twitter account to harass me but blocked me from seeing his messages",
   "created_utc": 1703490047,
   "score": 1,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuh3wq",
   "message": "Everything about you. Leave me alone",
   "created_utc": 1703495335,
   "score": 1,
   "submission_id": "18qdakr"
  },
  {
   "comment_id": "keuiqxp",
   "message": "My ex-wife threatened to divorce me on Christmas Eve because I told my mom my ex and I were driving separately to the family party. A few hours later, my ex is at the party talking to my family about us having kids.",
   "created_utc": 1703496790,
   "score": 1,
   "submission_id": "18qdakr"
  }
 ]
}