{
 "submission_id": "18qnbvd",
 "title": "What's your opinion on the Jim Carrey led 'Grinch' adaptation?",
 "selftext": "",
 "created_utc": 1703526555,
 "permalink": "/r/AskReddit/comments/18qnbvd/whats_your_opinion_on_the_jim_carrey_led_grinch/",
 "score": 79,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qnbvd/whats_your_opinion_on_the_jim_carrey_led_grinch/",
 "comments": [
  {
   "comment_id": "kevzz3e",
   "message": "Blows my mind it was released in 2000",
   "created_utc": 1703528901,
   "score": 118,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew37g6",
   "message": "Given what Carrey had to go through to get into the Grinch costume, I bet some of those weird \"Jim.Carey faces\" are him genuinely going \"ouch this hurts!\"",
   "created_utc": 1703530307,
   "score": 62,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewd4om",
   "message": "MAX. HELP ME... I'm FEELING.",
   "created_utc": 1703534601,
   "score": 129,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevxhw0",
   "message": "Still kinda blows my mind that this is Cindy Lou Who: [Going to Hell](https://www.youtube.com/watch?v=bmtbg5b7_Aw)",
   "created_utc": 1703527802,
   "score": 100,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevzglk",
   "message": "It's good. I like all the hidden adult jokes,  like the Swingers party",
   "created_utc": 1703528671,
   "score": 247,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevxj17",
   "message": "I sympathize with the sentiment that it’s not a very good adaptation of the source material. Having said that, I find the writing and the performances to be fucking hilarious. It practically goes without saying that Jim Carrey *makes* this movie.",
   "created_utc": 1703527816,
   "score": 153,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew2k6p",
   "message": "If the Grinch says \"The Powder's Bitchin'\" it's a good movie.",
   "created_utc": 1703530029,
   "score": 125,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew9lzp",
   "message": "LOATHE ENTIRELY!\n\n\nNah, I like it 😁",
   "created_utc": 1703533051,
   "score": 38,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewc6ks",
   "message": "It's a one-liner showcase for Jim Carrey.",
   "created_utc": 1703534188,
   "score": 135,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew0p4a",
   "message": "Amazing, my favourite christmas movie. Carrey's grinch set the standard for a whole generation of grinch impressions on social media and grinch actors at Universal Studios.\n\nThat being said, I can see why the Seuss estate stopped any more live action adaptations of his books. The Roald Dahl estste should do the same at this point.",
   "created_utc": 1703529221,
   "score": 252,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewapbl",
   "message": "I love it.. I used to have the hots for Christine Beranski.. 🤣",
   "created_utc": 1703533533,
   "score": 48,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew0twc",
   "message": "One of my favorite Christmas movies, alongside A Muppet Christmas Carol and A Christmas Story",
   "created_utc": 1703529279,
   "score": 77,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevvd0g",
   "message": "I think it’s great.",
   "created_utc": 1703526853,
   "score": 75,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevvgym",
   "message": "Amazing \n\nIt is my favorite Christmas movie, and it’s my sense of humor. I didn’t even think I liked comedy as a kid until I saw that movie. And it’s relatable as a teenager and young adult lol.",
   "created_utc": 1703526901,
   "score": 165,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew8c8h",
   "message": "Kids today. So desensitized by movies and television.",
   "created_utc": 1703532510,
   "score": 149,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew0poe",
   "message": "It's not *better* than the classic cartoon, but it's still really, really great.  Any excuse to let Jim Carrey just \"go\" is great, and watching him improv as this insane recluse monster is so fun, really if there's any stinky parts to the movie it's when they have to get back to moving the plot along.",
   "created_utc": 1703529227,
   "score": 42,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew2ols",
   "message": "Taken on its own merits, it’s amazing and hilarious. Easily one of my top 5 Christmas movies. I get why people bounce off it when compared to the old animated one, but I can’t help but find this one extremely funny.",
   "created_utc": 1703530082,
   "score": 74,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew1rc8",
   "message": "Brilliant",
   "created_utc": 1703529683,
   "score": 56,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewnhbs",
   "message": "When he stops that who and gets in the little car I die laughing every time.",
   "created_utc": 1703539043,
   "score": 13,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewg0o8",
   "message": "Jim Carrey carried the whole thing. Otherwise I'm pretty lukewarm to it. Animated adaptation was perfect, but the movie is worth watching just because of Jim Carrey.",
   "created_utc": 1703535846,
   "score": 11,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew9i6a",
   "message": "To me it's like asking who your favourite Spiderman is. Toby Maguire's Spiderman is different in a dozen ways from the source material, but that's my Spiderman. Anyone else might as well be an imitation. Jim Carreys Grinch is my Grinch. I love the animated one from like 30 years ago my folks might rewatch for the 20th time, but I still prefer it with Jim because it's more my era.",
   "created_utc": 1703533004,
   "score": 51,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevvr30",
   "message": "Watching it right now. One of my favorites.",
   "created_utc": 1703527025,
   "score": 36,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewdxdm",
   "message": "It's amazing! For me it is THE Christmas movie. I'm not in the spirit without watching it at least once. \n\nThe acting, set design, makeup, hair, costuming and just overall vibe is everything. All the small details with extras in the backgrounds are so fun. The humour really worked for me as a kid and even more as an adult. Jim Carrey and the whole casts' performance is iconic, so much great line delivery. I can't imagine looking how they looked and still being serious enough to do these scenes. \n\nEven the bad cgi adds to the vibe.",
   "created_utc": 1703534941,
   "score": 37,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew4qlk",
   "message": "I really hated it when it first came out, but it’s definitely grown on me as I’ve gotten older and empathize more and more with the Grinch.",
   "created_utc": 1703530980,
   "score": 20,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewcc6z",
   "message": "Jim Carrey’s performance is outstanding. I’m very nostalgic for this movie, it takes me back to being like 10-12, and always watched it over Christmas.\n\nIt’s not great but I love it. Where Are You Christmas gives me all the feels.",
   "created_utc": 1703534257,
   "score": 9,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewkcoo",
   "message": "I don’t think I’ver ever really seen it all the way through! It always sort of gave me a headache.",
   "created_utc": 1703537732,
   "score": 9,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kex7w53",
   "message": "It’s a fantastic movie.\n\n*The anger!*\n\n*The fury!*\n\n*THE MUSCLES!*",
   "created_utc": 1703548331,
   "score": 10,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewcplh",
   "message": "Absolutely love it, it cracks me up every time",
   "created_utc": 1703534420,
   "score": 16,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew9nfg",
   "message": "The first 75% of the movie is perfect and I don’t care what anyone else thinks. Jim Carrey’s performance is unhinged, the writing is dark and silly, the sets and costuming are goofy and wonderfully ‘Seuss’-y, it’s so good. Once the Grinch actually begins stealing Christmas the movie loses its luster and stops doing everything it had done well up to that point, but it’s still one of, if not my favorite Xmas movie along with Jingle All the Way.",
   "created_utc": 1703533068,
   "score": 39,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevyjnw",
   "message": "It came out when I was a small kid and I still watch it annually. Love it.",
   "created_utc": 1703528270,
   "score": 18,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewfhtm",
   "message": "I think as far as adaptations of Seuss books go, it's about as good as it could have been. If they tried to stick too close to the book, we'd just end up with a live action version of the animated movie. And that would feel redundant. So I think they handled it well. And Carrey was obviously perfect casting.",
   "created_utc": 1703535616,
   "score": 11,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew5qop",
   "message": "Insufficient Boris Karloff.",
   "created_utc": 1703531397,
   "score": 17,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewlwam",
   "message": "Critics have called it everything from 'shit' to 'fucking shit'",
   "created_utc": 1703538400,
   "score": 14,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew7ow1",
   "message": "In my opinion the movie sucks but his role was exceptionally good. \n\nThe nature of the character allows Carrey with his talent for facial expressions to really shine, even in the presence of a very poorly adapted script",
   "created_utc": 1703532231,
   "score": 26,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewi3db",
   "message": "If not for Jim Carrey, it'd be a pretty bad movie.",
   "created_utc": 1703536746,
   "score": 5,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew2c5d",
   "message": "I dislike it but I can agree with its fans that Jim Carrey did an excellent job in the role and many of the jokes he made are pretty good. Also MAJOR props to the makeup and costuming departments, every character looks very Suessian and Carrey's Grinch feels uncomfortably real. But I don't like most of the non-Grinch moments, I don't like giving him a generic bullied-kid backstory (I say this as a generic bullied kid in real life), and the set design really had issues trying to make it both look like a cramped town full of shitty people and a whimsical little village of happy-go-lucky Christmas fans.",
   "created_utc": 1703529932,
   "score": 40,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewjk1y",
   "message": "Meh",
   "created_utc": 1703537383,
   "score": 11,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew69ep",
   "message": "It’s not a good adaption of the book but it’s too freaking funny to hate.",
   "created_utc": 1703531615,
   "score": 16,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewcf43",
   "message": "It’s completely bonkers and I have no idea who they made it for. It’s scary as fuck for younger kids, it’s just plain weird for adults but it’s also fun to watch? I think? It just insane and I honestly can’t believe they were allowed to make it the way they made it.",
   "created_utc": 1703534292,
   "score": 14,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew3w1p",
   "message": "Fucking great.  I can watch the cartoon if I want a 1:1 adaptation.  Jim Carrey is hilarious and heartwarming in it.",
   "created_utc": 1703530605,
   "score": 11,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewfrii",
   "message": "May be Jim Carrey’s opus magnum.",
   "created_utc": 1703535733,
   "score": 12,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewanfp",
   "message": "Not crazy about it. It’s just him yelling and jumping around for 120 minutes. It’s a stressful watch.",
   "created_utc": 1703533510,
   "score": 9,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewddu5",
   "message": "Jim Carrey's version of the Grinch in movie form is highly divisive. There are two camps - you either think Jim's a brilliant actor who has a lot of range and his comedy chops contribute to making that movie an incredibly hilarious movie, or... you think Jim Carrey is highly overrated as an actor and comedian, that he has no range and is incredibly annoying, and his version of the Grinch is an abomination that should die a horrible death. I've yet to find someone who's meh about the movie or him. I fall in the first group. I watch it every year. It's a favorite.",
   "created_utc": 1703534709,
   "score": 8,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewlolf",
   "message": "They missed the point by making Grinch sympathetic and the Who’s 99% assholes. But it’s entertaining nonetheless.",
   "created_utc": 1703538308,
   "score": 5,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kex8plk",
   "message": "It's pretty much a masterpiece.",
   "created_utc": 1703548712,
   "score": 5,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevyoo7",
   "message": "One of his very best. I'm not a Jim Carrey fan -but do love the Grinch.",
   "created_utc": 1703528330,
   "score": 14,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kew8t8o",
   "message": "I hate it.",
   "created_utc": 1703532709,
   "score": 15,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewhbs9",
   "message": "saw it with my elementary school class... i was actually more creeped out by the way the who's looked than by the Grinch. they looked weird af",
   "created_utc": 1703536413,
   "score": 8,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kevuya0",
   "message": "It’s certainly one of the movies of all time",
   "created_utc": 1703526669,
   "score": 43,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewfqr9",
   "message": "Watching at the moment in my flat rented in London.  Love it.",
   "created_utc": 1703535725,
   "score": 3,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewjcfh",
   "message": "I was 3 when it was released and Jim Carrey as the grinch fucking *terrified* me. Started crying after 20 minutes. Still makes me uncomfortable to this day.",
   "created_utc": 1703537289,
   "score": 3,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewrg1e",
   "message": "“This is not pudding.” Is one of my favourite lines from any film.",
   "created_utc": 1703540818,
   "score": 3,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewsk23",
   "message": "The last insanely quotable Jim Carrey movie. \n\nOne of the best Christmas movies overall IMO.",
   "created_utc": 1703541320,
   "score": 3,
   "submission_id": "18qnbvd"
  },
  {
   "comment_id": "kewawv9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qnbvd"
  }
 ]
}