{
 "submission_id": "18qoc27",
 "title": "So, who ruined Christmas morning and how did they do it?",
 "selftext": "",
 "created_utc": 1703529726,
 "permalink": "/r/AskReddit/comments/18qoc27/so_who_ruined_christmas_morning_and_how_did_they/",
 "score": 177,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qoc27/so_who_ruined_christmas_morning_and_how_did_they/",
 "comments": [
  {
   "comment_id": "kexjm0c",
   "message": "Grandparents told everyone how they get one person something really nice each year and that it was finally my turn. They 'gave' me the really nice big green egg and patio desk i was saving for. Then after they looked real nice to everyone and everyone else was gone they told me it was actually a loan and I would need to pay them to keep it. I told them to fuck off.",
   "created_utc": 1703553774,
   "score": 199,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex5qmn",
   "message": "Grandma forgot where she hid the presents.  Haven’t found them yet.",
   "created_utc": 1703547335,
   "score": 204,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex681g",
   "message": "Drove 4 hours to spend the day with my dad (at his request 3 weeks ago) then immediately after lunch, not even dinner, he said he and his new girlfriend (of 4 weeks) were invited to a friend’s dinner and were going there. My drive was longer than the time spent he spent with me at his house. So now I’m watching Christmas movies and drinking with my grandma instead. After trying fix our relationship that’s been rocky since I was a teenager (now in my 30s), it’s great to realize he truly doesn’t care 😅😅😅",
   "created_utc": 1703547560,
   "score": 50,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex0snm",
   "message": "I gave my little girl a drone.  It went up in the air the first time and just kept going and going and going.  That was like 8 hours ago.  Could still be going….",
   "created_utc": 1703545073,
   "score": 136,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex7syy",
   "message": "80 year old uncle ruined Christmas Eve with family (had to cancel). He got lost while hunting, but not terribly far from road. He heard my brother in law and my grandfather searching for him but was embarrassed so waited to come out at sunrise after everyone went home after hours of searching but before everyone came back (or so he thought). \n\n\nMy 80 year old grandfather, uncles brother, had open heart surgery heart this year and is going through radiation for cancer and couldn't sleep all night thinking his brother died in the woods. Grandfather and other older family members ended feeling so bad from stress we had to cancel.\n\nEDIT: Appreciate the input and concern. Unfortunately he really is a prideful person (and I'm not terribly close to him), so there's slim chance we'd convince him to get evaluated for dementia. I'll be talking to some family anyway to see if it would be possible.\n\nMerry Christmas everyone. Hope you all had a good year :)",
   "created_utc": 1703548291,
   "score": 62,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex8f41",
   "message": "My ex. Told me she was going to stay the night at her mom's house on Christmas Eve because she missed her. I said yes that's your mom, go spend time with her and that we'd met up in the morning. Her mom is calling me Christmas morning asking to speak with her and that she couldn't get ahold of her. I said she should be over there, correct. Her mom said nope she hasn't seen her all night. That's how I found out she was cheating on me.\n\nEdit: Thanks everyone for your words. I'm doing fine and will be ok through it all. Going to be living with family for a bit. And for anyone curious, we were together for 5 years.",
   "created_utc": 1703548576,
   "score": 58,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexb3fb",
   "message": "My sister brought her dog who immediately walked over and threw up all over my kid's presents as if he'd been planning to do that all year.",
   "created_utc": 1703549803,
   "score": 58,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexbhy4",
   "message": "I think I did by realizing I can have a great Christmas by not going home and spending it with friends.",
   "created_utc": 1703549987,
   "score": 184,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexfd3b",
   "message": "My mom invited my nephew that molested my daughter and told us we could leave if we couldn't just get over it. It happened 5 months ago and he's still in a court ordered program for juveniles.\n\nIn her mind I ruined her family by turning this more loved grandchild in to the police.",
   "created_utc": 1703551779,
   "score": 112,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex32fw",
   "message": "My brother by existing. My family flew into Paris from one country, he flew in from another, and had a complete mental breakdown because no one came to the airport to escort him to our Airbnb and ordered him an Uber instead. He proceeded to scream and abuse my parents, stating that they abandoned him and left him to fend for himself in the wild unknown that is CDG airport. He then threatened to leave immediately and refused to leave his room, not even to eat, as a form of protest for my parents being so horrible to him.\n\nHe is 35 years old, and my parents bought his tickets and this trip is on their dime entirely.",
   "created_utc": 1703546110,
   "score": 66,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kewopnh",
   "message": "My mother. She screamed at my dad like a banshee at about 6am. All my dad did was put water in the coffee maker. When you put water in, it immediately starts brewing. I guess that was too early in the morning to start the coffee? I’m not exactly sure what her beef was.\n\nFor context: For the first time in several years,\nmy entire immediate family were all under one roof for an extended period of time. We were staying at my grandmother’s house for the holidays. My mother has always been prone to fits of rage. Growing up, she exploded often. I haven’t been around it in 9 years, neither have my brothers, but we got an ugly reminder of her behavior yesterday morning.\n\n\nMy dad doesn’t believe in divorce. He works nights to avoid her. They pass like ships in the night. They have separate bedrooms and separate lives. My dad’s uncle just passed away, that’s why we all came together. We typically don’t celebrate Christmas together. \n\nI overpaid to fly home today, and I opted out of Christmas  dinner to do so. I left two days before everyone else. I can’t do it. It’s as if she’s possessed by a demon.",
   "created_utc": 1703539591,
   "score": 167,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex7c2k",
   "message": "The drunk asshole that was joyriding last night and totalled my car in a hit and run did a good job of ruining my day.",
   "created_utc": 1703548073,
   "score": 202,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexdy5g",
   "message": "When I was five my dad off’d himself on Christmas Eve night. Woke up and saw presents under the tree went to wake up my dad…. And well he didn’t. My parents got divorced and it was his weekend, it was just us two. Many hours went by before my mom and police showed up. That was over 30 years ago and I remember everything about that day so I’d say he ruined every one ever since. (He used alcohol, and pain pills).",
   "created_utc": 1703551107,
   "score": 203,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex9hxr",
   "message": "Me.  Halfway thru opening gifts with the family, I was in enormous pain.  Wound up spending most of the day in the ER.  Kidney stones.  I could have done without this gift/surprise.",
   "created_utc": 1703549065,
   "score": 169,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexce13",
   "message": "My stepmom physically attacked me on christmas last year so i decided to skip the family get together and stay home alone this year. It has definitely been better than last year but I'm still salty.",
   "created_utc": 1703550393,
   "score": 226,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexk17c",
   "message": "My brother(45) hit the neighbor(30ish) head-on last night in front of the house, killing them both. The neighbor left a pregnant wife and a three year old. Pretty surreal Christmas.",
   "created_utc": 1703553970,
   "score": 55,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex9v9e",
   "message": "Well my father has been in the ICU for the last 6 days, so the kids and I and my mom went to the hospital. He was in a bad car accident 10 days ago. Noone is in the mood for Christmas this year.",
   "created_utc": 1703549233,
   "score": 70,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexsjso",
   "message": "My mom. Screaming at and in front of everyone (including the kids and my elderly grandmother who came out of hospital this morning) that she doesn't want to be a full-time carer for my grandmother. No one asked her to care for my grandma. For the past few years Mom has been asking grandma for her inheritance early so she could buy a house, grandma always said no. Mom moved in with grandma a month ago and now wants grandma to move out so mom can live in the house alone rent free. Where grandma is supposed to go is beyond me as mom has refused to participate in plans for a care home etc because it will likely involve selling the house to pay for this.",
   "created_utc": 1703557928,
   "score": 177,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kew6tri",
   "message": "My in-laws ruined it by showing up at my house.",
   "created_utc": 1703531859,
   "score": 97,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex66ma",
   "message": "Norovirus.  Was up all night with a vomiting 6 year old and I had to “sleep” on the floor in their room.  He last vomited about 4:30am today.  \n\nStripped the vomit-covered sheets and showered him in the middle of the night because he was covered.  My hips are killing me from sleeping on the floor.  Merry Christmas!",
   "created_utc": 1703547542,
   "score": 44,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex762n",
   "message": "My dog was acting weird last night around 11:30 by 2am he was in surgery for bloat. Big guy is going to be fine but man it was not the Christmas I had planned.",
   "created_utc": 1703547995,
   "score": 150,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexksic",
   "message": "Not my Christms ruined, but my friends. Her parents left home to stay in Florida, they were supposed to come back for Thanksgiving. They did not come back. Her parents were supposed to come back yesterday, Christmas Eve to spend time with their kids. They did not. Her parents left her (17), her sister (an adult but legally blind), and her grandmother (who literally just had a stroke and is in the hospital) alone. No financial support, the only person bringing in money is her. She couldn't even celebrate christmas with her family, just her sister. For the past few nights my family has invited her to dinner to help out. I feel so bad for her, no teenage girl should have to go through such stressful events without the support of her parents during Christmas.",
   "created_utc": 1703554310,
   "score": 102,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexlhcr",
   "message": "My mom told everyone that there’s not going to be anymore babies in the family anyway, so my sister can throw away my son’s crib. \n\nI am actively trying to get pregnant and have been taking steps and working on my health to make it happen as I had cervical cancer last year and a few other uterine issues. And for those wondering, yes, she and everyone else in the room is aware of all of this.",
   "created_utc": 1703554620,
   "score": 168,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex889h",
   "message": "Whole fam is sick and I start a medical treatment soon that will completely nuke my immune system (it's used in some chemotherapy regimen) so no one is coming over today",
   "created_utc": 1703548487,
   "score": 10,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexklxm",
   "message": "Mom got hammered Christmas eve and woke up for a midnight snack of the Christmas dinner. Left it all out and the dog ate it all",
   "created_utc": 1703554233,
   "score": 232,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex04mi",
   "message": "Its usually the kids waking me up at 5am. This year it was the dog waking me up at 4am for a diarrhea shit on the carpet.",
   "created_utc": 1703544770,
   "score": 192,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexa9rt",
   "message": "There are a lot of people in this thread that shit the bed over night",
   "created_utc": 1703549417,
   "score": 210,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kewvvb2",
   "message": "Both cats scarfed and barfed. Getting out the carpet cleaner was not in the plans today.",
   "created_utc": 1703542809,
   "score": 116,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexhivd",
   "message": "My cat of 16 years died this morning in his sleep. Didn't tell my 7 year old son because of Christmas. He is sleeping over his grandmothers house tonight and we are going to tell him tomorrow.  We are devastated losing a family member, and I am dreading telling the poor kid.",
   "created_utc": 1703552782,
   "score": 12,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexc5m4",
   "message": "Mother in law. Constant negativity and hateful comments.  It’s exhausting.",
   "created_utc": 1703550284,
   "score": 145,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kew3g5a",
   "message": "The flying public.  I have to work today.",
   "created_utc": 1703530413,
   "score": 38,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexci22",
   "message": "I ruined Christmas. I went to my partner's Christmas gathering for the first time. I'm an immigrant with a very different cultural background, but they were all very friendly and welcoming. They suggested playing bingo, but with no money. Sounds good to me. Then the family matriarch wanted in and wanted everyone to do 50 cents a card... eh okay whatever. I didn't want to play with money but too awkward to say no. \n\nI did good and bad. Started with $10, but before the final card I hit about $5. All good. Then they wanted to do a full blackout game with $2 a card. I was trying to be polite and only play one card, but the patriarch was sitting next to me and told me to do 2 cards. I did 2 cards. I was one spot from winning, and he picked up my card and cleared off my markers. Awkward as hell. Then they called my last spot and I won the whole prize. About $60. Very clearly some sore losers, and it was super awkward for the rest of Christmas lol",
   "created_utc": 1703550446,
   "score": 63,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexc1t0",
   "message": "My mom invited my ex-girlfriend to the family zoom (because she's still family?). My Girlfriend of two years wasn't too stoked to meet her.",
   "created_utc": 1703550235,
   "score": 188,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex3ryl",
   "message": "I sharted at Christmas morning. Luckily, we live next door so I could run home and fix things. \n\nIt was me. I ruined Christmas.",
   "created_utc": 1703546437,
   "score": 153,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex4aks",
   "message": "My wife did by immediately after opening all the presents, tell me how disappointed she is in what I got her. Or I guess I did by buying her shitty presents depending on your point of view.\n\nUpdate to answer some questions:\nWe’ve been married for 25 years\nMost of the gifts were from her Christmas list. She was unhappy that I didn’t also buy things not from the list. \n\nCreative things I’ve surprised her with in the past. \n\nOnce I got her favorite artist (Dar Williams) to call her for her birthday. \n\nFor her 50th I surprised her with a convertible Vw beetle\n\nI’ve surprised her by flying her friends out to stay with us for Christmas a few years ago. \n\nIt’s not that i can’t be creative. I just wasnt this year",
   "created_utc": 1703546670,
   "score": 146,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex8f00",
   "message": "Georgia Power. Lost power at prime casserole cooking time.",
   "created_utc": 1703548575,
   "score": 235,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex1dm9",
   "message": "My husband - pooped the bed - twice after eating a bag of almonds I told him would give him diarrhea.",
   "created_utc": 1703545338,
   "score": 208,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kew5scu",
   "message": "My dog, Waffles.  She decided to try to wake everyone up to see Santa and must have scared him away.  But the whole house was awake at 2:30am",
   "created_utc": 1703531415,
   "score": 118,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexck2f",
   "message": "Brother in Law. 12:06am. Breakfast casserole knocked out of the fridge and all over the floor as he was reaching for another midnight snack. Six minutes flat, impressive.",
   "created_utc": 1703550473,
   "score": 230,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexf80t",
   "message": "The amount of people that shit themselves on here is a little alarming",
   "created_utc": 1703551712,
   "score": 10,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexozkh",
   "message": "Apparently having a rather severe migraine and not wanting to eat shit food at Golden Corral means I ruined Christmas. Family is also returning my gifts because I didn't just \"man up\" and deal with the pain.",
   "created_utc": 1703556252,
   "score": 61,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex8cpr",
   "message": "Whoever got my wife sick. Flu and period on Christmas morning she's been absolutely miserable. I've done everything I can to make this the best Christmas. But it's not been easy. I go back to work tomorrow and I'm sad I didn't get more time with her.",
   "created_utc": 1703548545,
   "score": 205,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex9hjn",
   "message": "My parent's puppy managed to open and eat half a jar of THC body balm and had to be taken to the emergency vet at 1 am. She threw up a large mango sized menthol dog treat vomit ball in my hand. She got meds and monitored and is doing much .much better now",
   "created_utc": 1703549060,
   "score": 203,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexvd5j",
   "message": "It was a joint effort. My aunt's dog rolled onto his back for a belly rub and shot a stream of urine into the air and all over my arm and my pants. After I cleaned up enough I had to sit next to my unpleasant uncle. The first thing he asked me was \"when are you going to make me a grand uncle?\" I told him it could happen today as long as he is cool with being an accessory to kidnapping. He didn't have much to say the rest of the morning.",
   "created_utc": 1703559294,
   "score": 209,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexc78j",
   "message": "My mother-in-law decided to overwhelm our 3 year old son with shit-quality gifts in epic quantity. We were adamant in telling her she couldn’t go overboard. He got so fatigued from opening things he broke by dinner time that he didn’t open any of his (minimal) gifts from us and from Santa. It was so disappointing.",
   "created_utc": 1703550305,
   "score": 225,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexy5l9",
   "message": "Technically happened last night but my cat tripped my mother and she broke her arm on the way down.\n\nThe ER had a surprisingly short wait time though.\n\nCat is fine and he has no regrets.",
   "created_utc": 1703560628,
   "score": 103,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex7l8r",
   "message": "Ellen at my mum’s work. She went to the Christmas lunch sick, turned out she had Covid and now so does my mum and three other colleagues. Because of Ellen at least 6 high risk people have been exposed and all three family Christmases are cancelled. I’m extremely fucking unimpressed with your work ethic Ellen.",
   "created_utc": 1703548192,
   "score": 160,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex80h9",
   "message": "My mother with a barrage of profane texts about what a bad person I am.",
   "created_utc": 1703548387,
   "score": 161,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex7lpl",
   "message": "My dad just ruined Christmas dinner for me. I was switching two chairs at the dinner table -one with arms was too tight against the table and next to impossible to get into. He literally hollered at me for moving the chair. \n \nApparently he’d done some measuring and was getting a few extra chairs that he thought would only fit a certain way, and was already mad that no one had put the extra leafs in the table. Which I knew nothing about, I was just going to sit next to my kid.\n \nIt was goddamn humiliating, I know I shouldn’t be the one who was embarrassed and I tried to shake it off but found my eyes welling up with tears anyway. I’m going thru a divorce from my emotionally abusive husband of 20 years and he’s being awful about our 12 year old and I’m just more emotionally fragile than I realized.\n\nEdit: thank you so much to everyone with the supportive comments, I’m usually so late to any thread that my comments are rarely seen, so I really didn’t expect that and appreciate them so much. I hope 2024 brings you all peace and joy.",
   "created_utc": 1703548198,
   "score": 133,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexqxg2",
   "message": "My husbands mouth suddenly got very small and tight. His jaw started moving back and forth. His eyes got wide. He got very talkative and like the whole world was hysterical and perfect.He only went to the garage for less than 5 minutes and I knew. Every moment after that was tainted. And sad.",
   "created_utc": 1703557163,
   "score": 94,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex4bj6",
   "message": "My roommate. He was supposed to be gone all day but he had a hangover and told his family he had covid.",
   "created_utc": 1703546682,
   "score": 114,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex701f",
   "message": "My mother and sister clash very often. They got into a huge argument last night before I got home from shopping. The negativity drifted through to today and it’s been one of those days. Words don’t do justice to the situation. Merry Christmas everyone.",
   "created_utc": 1703547917,
   "score": 187,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex5g84",
   "message": "My 11 year old son, except he doesn’t know it. I LOVE Christmas and I tend to go over board every year with my kids.  (I over compensate for my lack of ever having a happy Christmas time growing up). My son is at the age of making inappropriate jokes all the time ( I had no idea you could make that many ball jokes in one day) Anyways we were trying to watch movies as a family and he was sent to his room due to him being asked to stop repeating the same joke over and over because he wasn’t getting a reaction. Well he went on a rant about it being child abuse and us favoriting his 14 year old sister more. This is his usual insult when punished. He screams child abuse at the littlest inconvenience. Apparently this is a trigger for me I was physically, mentally and at one point sexually abused as a child. Knowing that he had probably $1,000 worth of things under the tree for him to open the next morning just kinda broke me. I cried myself to sleep last night and I didn’t want to get up the morning.",
   "created_utc": 1703547202,
   "score": 245,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex9qo6",
   "message": "In-laws stayed up partying all night and were too hungover to even get out of bed most of the day",
   "created_utc": 1703549175,
   "score": 243,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex7zri",
   "message": "I understand the my brother's father in-law is busy denying the Holocaust, and our parents' 50 year old oven doesn't work well enough to get the turkey above ~150F. I'm thankful I'm 1000 miles away",
   "created_utc": 1703548378,
   "score": 192,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kewzwgc",
   "message": "Me. Started my period and came down with a stomach bug I think. Been puking all day 😭",
   "created_utc": 1703544666,
   "score": 213,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexau52",
   "message": "Me. I woke up sick. Ran to the bathroom to throw up almost as soon as we unwrapped. \\*Knock on wood\\* but I'm starting to feel better. Plenty of fluids. Got left out of the traditional habichi dinner, but they'll be bringing me some egg drop soup. The dog is curled up at my feet. I finally get to watch the first two *Home Alones*, because no one else in my family loves them like I do.",
   "created_utc": 1703549683,
   "score": 23,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex400b",
   "message": "We had a close call. Was pre-heating the oven this morning for breakfast and was unaware my partner had put a baguette in the oven wrapped in plastic..  fortunately we’re in a warm place so we were able to air out the place pretty easily and nothing caught on fire. Just a bit of melted plastic. :)",
   "created_utc": 1703546539,
   "score": 68,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexlw1e",
   "message": "My FIL who texted my husband this morning and asked if I was pregnant again, because the entire family decided I looked a little round at Christmas Eve dinner",
   "created_utc": 1703554806,
   "score": 5,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexscg3",
   "message": "Christmas was actually going pretty well. But after dinner my mother started screaming bloody murder from the living room. Then I heard her yell the following:\n\n\"WHY IS BIN LADEN IN MY F*#KING NATIVITY SCENE!?\"\n\nSee, she has this nativity scene with a bunch of Willow Tree figurines. The three wise men all had white robes and those style of hat/turban. And somebody had dressed up one of the wise men with an action figure's camo jacket, and taped on a cutout of Bin Laden's face onto the head of the figure. She is not one to swear - especially on Christmas - but she was *fucking furious.* She demanded to know who did this, and obviously nobody was fessing up. She started accusing people, and really going after some relatives she didn't like. Then this spawned arguments about old grudges and it got pretty heated.\n\nit was me btw, i did it",
   "created_utc": 1703557833,
   "score": 135,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex6z9p",
   "message": "Girlfriend stayed the night.  Went to her place this am.  Found her cat dead.  Had been fighting an illness but had seemed much better.  \n\nWouldn’t say ruined Christmas.  Just a sad end of the day.",
   "created_utc": 1703547907,
   "score": 204,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexcqlp",
   "message": "My two year old. When I got him up this morning, he kept saying \"A mess, a mess\". I thought he meant his toy tractor, which had something stuck to the wheels. While cleaning it, I couldn't figure out what it was, and then I thought to check his room. He had thrown up. Everywhere.\nOn his bed, blankets, pillows, play mat, rocking chair, ect. I woke up my husband and we started cleaning. Partway through it got to me and I started throwing up. (I'm three months pregnant so can't handle stuff like that) My husband had to finish cleaning alone, and shampooing the chair and mattress. Not how we imagined starting Christmas!",
   "created_utc": 1703550557,
   "score": 201,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex8rau",
   "message": "LOL. Sister egged my brother’s car the other day, he kept bringing it up, she kept yelling back that he stole her weed, and he made it very obvious that he didn’t get her a gift.",
   "created_utc": 1703548732,
   "score": 25,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexkryi",
   "message": "Brother in law is in a Christian cult that doesn’t believe in Christmas. Attends virtual mass and meetings several hours a day and won’t talk to anyone about Christmas or make it special for everyone else. Really losing his mind…",
   "created_utc": 1703554303,
   "score": 66,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexbaie",
   "message": "My adult daughter said she relapsed.  Yeah. Merry Christmas!",
   "created_utc": 1703549894,
   "score": 164,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kew5nhi",
   "message": "Dog farted in my face. But that isn't really out of character for him.",
   "created_utc": 1703531363,
   "score": 183,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexdqcr",
   "message": "My mom’s dog unfortunately. He went outside in the morning and ended up getting taken away by a coyote most likely. Only evidence we could find was a blood patch. 😕",
   "created_utc": 1703551006,
   "score": 40,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexf4oc",
   "message": "My long term partner dumped me after I called them out on not getting me a present. I had been planning for weeks to get them exactly what they wanted, and when I gave it to them, I obviously asked for my present. They said they didn’t get me one, and when I got upset they told me I had no reason to get upset and hated when I complained about things like that. Then they dumped me.\n\nHonestly, I feel kind of relieved but still hurt. It was a relationship I wasn’t allowed to have feelings in. So tired of walking on eggshells and being shut down when I try to communicate.",
   "created_utc": 1703551666,
   "score": 154,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexw9le",
   "message": "My husband by telling me at dinner that he should have been informed of all my mental health problems before we got together. He said this after I’d spent the previous three hours preparing the dinner he was eating. The irony is he’s chronically ill and hasn’t worked since 2014. Most of my current mental health issues come from being his caregiver and breadwinner.",
   "created_utc": 1703559727,
   "score": 99,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexe6ni",
   "message": "Someone in my parents’ neighborhood died of an overdose this morning. She left 4 kids: the youngest is 7. I can’t even imagine how destroyed those kids are today.",
   "created_utc": 1703551221,
   "score": 148,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexlhep",
   "message": "My appendix. Decided to rupture. We missed out on all of the fun Christmas stuff all season because we had covid and then the flu. Poor kids have been troopers!",
   "created_utc": 1703554621,
   "score": 50,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexq48o",
   "message": "I told my gf I felt neglected and unwanted. She argued with how I was feeling and put me down. I was sick in bed all day and was originally planning to go to her apartment for their Christmas party. I told her I was gonna stay home because I was sick and I also told her I felt uncomfortable hanging there because of how she feels uncomfortable about me enjoying her roommates company more than her. Not how I feel, how she feels. She ended up breaking up with me so now I'm sick and newly single on Christmas",
   "created_utc": 1703556795,
   "score": 48,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexqvp1",
   "message": "It was me. I passed out in the kitchen. Turns out I have blood clots in my lungs. Currently in the ICU.\n\nI had dislocated my knee on Thanksgiving. I have been ruining a lot of holidays as of late.",
   "created_utc": 1703557141,
   "score": 48,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexaffo",
   "message": "Kids came bounding into the bedroom at 5am. Two of mine two of gf I lived with. Ages 8 to 12. They're excited. Gf freaks out. Starts screaming at all of them. Crush Christmas and forces them to sit in their rooms for another hour. In my mind I am done. Fully realize this is my last Christmas with her. Get up and tend to all the kids. She joins us a half hour later tossing the presents and generally being a monster.\n\nThat was 19 years ago.\n\nI left a few months later.\n\nNever regretted it. Enjoyed Christmas each year with my kids.",
   "created_utc": 1703549491,
   "score": 71,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kex9zza",
   "message": "Got a massive bout of food poisoning last night that carried into today. So I would say myself after I trusted a fart around 1130AM",
   "created_utc": 1703549291,
   "score": 143,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexikdy",
   "message": "It was my year for my daughter to wake up at my house for Christmas.\n\nMy ex refused to let me pick her up.",
   "created_utc": 1703553277,
   "score": 141,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexa433",
   "message": "I decided that daughter #2 was getting short changed on presents, so I got her Awesome Tentpole Gift.\n\nShe was *not* short changed and the gift was a little too awesome and daughter #1 had a bit of a moment which was entirely my fault.\n\nYay, me.",
   "created_utc": 1703549344,
   "score": 27,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexmm1w",
   "message": "Just before dinner my aunt screamed at me for getting excited about the Giants game to the point that it got so uncomfortable my wife and son and I had to leave.",
   "created_utc": 1703555142,
   "score": 50,
   "submission_id": "18qoc27"
  },
  {
   "comment_id": "kexc2wb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qoc27"
  }
 ]
}