{
 "submission_id": "18qonvh",
 "title": "What made you go \"wow, this person's a piece of shit\"?",
 "selftext": "",
 "created_utc": 1703530799,
 "permalink": "/r/AskReddit/comments/18qonvh/what_made_you_go_wow_this_persons_a_piece_of_shit/",
 "score": 93,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qonvh/what_made_you_go_wow_this_persons_a_piece_of_shit/",
 "comments": [
  {
   "comment_id": "kewapz6",
   "message": "When my Indian immigrant boss fired another immigrant and said “look who has to go back to India while I get to stay here and do whatever I want”",
   "created_utc": 1703533541,
   "score": 217,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew8gqx",
   "message": "My sister stole 10k from her son’s Cub Scout pack. She lied for months to our family saying it was a set up and she could prove it.",
   "created_utc": 1703532562,
   "score": 127,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew4xla",
   "message": "20 mins into meeting him, he starts talking about how he cheated on his girlfriend and how in his head, it was justified.",
   "created_utc": 1703531064,
   "score": 244,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew677k",
   "message": " Most recently it was when my wife \u0026amp; I attended a school function. Met a new dad and he starts off by telling me how his first “low-grade beginner” wife and kid are back in the Midwest and how he’s loving his best life out here on the West Coast with his new silicone enhanced wife. Then states that he’s never going back. I ask him if his kid will be out for the upcoming Christmas holiday. Nope, he says, “he’ll stay where he belongs.” I turned \u0026amp; walked away.",
   "created_utc": 1703531588,
   "score": 39,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewdzwk",
   "message": "Talked about wanting to adopt for her whole life. Started fostering with her husband. 3 yo with a lot of behavior issues, came from a teen mom, history of drugs and sexual abuse. You know, a foster child. \n\nThey hated that kid. It was way harder than they expected. She really said “we just didn’t expect them to send us a kid with so many problems!” \n\nThe day I lost all respect for her was when I heard that child tell her “I love you, mommy!” And she responded “I’m not your mommy.”\n\nEdit: I should include the happy ending. This was my sister who tried to foster. Our Mom and Dad were very involved in helping with the kid at the time, and even after my sister gave up they were able to stay in touch with the next family to foster her. They are still involved to this day, and the kiddo has been adopted into a wonderful loving family and received so much love and support.",
   "created_utc": 1703534972,
   "score": 54,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew6ip0",
   "message": "He was trying to get my friend’s attention, so he began talking “at” us, telling her he’s a lawyer. Cool. So what made you get into law? “It’s a great career to get into to just fuck people over. No one can touch me”. He didn’t so much as look in my direction once. The whole time he was staring at my friend like a hungry dog looking at the dinner table. We had to leave because he creeped her out so bad.",
   "created_utc": 1703531727,
   "score": 7,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew7mp3",
   "message": "Notice they never have anything nice to say about anything ever, also they are rude.",
   "created_utc": 1703532205,
   "score": 60,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew9wf2",
   "message": "Stole their kids benefits money to fund their drug habits",
   "created_utc": 1703533177,
   "score": 181,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewamem",
   "message": "Using their child as leverage/a pawn to punish the other parent. Grade A scum.",
   "created_utc": 1703533497,
   "score": 11,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew5ns7",
   "message": "She said that it’s different when women cheat compared to when men cheat. Women cheat because men aren’t doing what they are supposed to do, while men cheat because they are dogs. \n\nI don’t know man, I’m not a psychology or sociology expert but I’m pretty sure “cheating is cheating”. But what do I know?",
   "created_utc": 1703531366,
   "score": 105,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewbwrm",
   "message": "She was beating animals, I thought I loved her, but in the end a person who hurts animals is a monster.",
   "created_utc": 1703534071,
   "score": 185,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewh2mv",
   "message": "My in laws: shared a joint account with their eldest my SIL, when she turned 18 she went to cash out and move out on her own, all $5000 she had saved was gone for “Bills”… \nMy (now)wife went to check her bank account at 5/3rd when at college, and all the money was gone because her parents account was OD and the right of transfer moved the funds over to pay back the OD balance…\nFast foreword and few years, my (now)wife graduates from college, and she looks at the billing statements for her student loans, they got some kind of loan for one single class my wife had to take but not a full semesters tuition, but only half was applied to actual tuition, we don’t know how they did it but half of that disappeared.\nAbout 6 years ago they called us and asked for us to help them out making loan payments for them, as they were on the verge of bankruptcy and might lose the house, although I know I shouldn’t have, I agreed, but only if they gave me the login info for online payments, I did not trust them to give the money directly to apply to their payments, I paid off the loan, 11k and I never got a thank you…. Guess who went on two cruises after I paid off the loan?\nMy in-laws got a “loan” from my wife’s grandpa for 10k because they were having money issues, but when asked for repayment from another family member, the response was “when he dies it’s my money anyway, why should I repay it”\nFast forward another year (none of their three children talk or communicate with their parents anymore) my wife’s sister came over for Xmas, and filled us in that: 1. They applied for a CC a few years before in their sons name and social, BIL/FIL have the same exact name, so if anyone asked to see ID it would match, BIL found out and cut off all contact with them, AND finally, my SIL was contacted by her HR dept because they were notified that somebody had applied for unemployment and listed my SIL as an at home disabled dependent.. however my SIL has also cut off all contact.\nSo yeah, my in laws are massive pieces of shit.",
   "created_utc": 1703536306,
   "score": 95,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewa4wi",
   "message": "I never paid much attention to my neighbors, they were just there and kinda trashy.\n\nThen they moved out and left their pregnant cat (that had kittens 2 days later).\n\nYup.",
   "created_utc": 1703533282,
   "score": 82,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewcrcn",
   "message": "Know a guy who told his kids they couldnt afford christmas that year so they just wouldnt celebrate. Next day he bought himself a nintendo switch and like 6 games. This was like right at launch when they were hella expensive.",
   "created_utc": 1703534441,
   "score": 176,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewbjkj",
   "message": "He was ‘kind’ to his SO to her face and as soon as she was out of earshot he would not stop complaining. We all suggested communicating to her to resolve these issues. He never did",
   "created_utc": 1703533908,
   "score": 88,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewp5d3",
   "message": "I dated a guy who seemed like Prince Charming. He had 2 young girls from a previous marriage, whom he rarely got the chance to see. \n\nFor his birthday I'd asked him what he wanted and he told me that I don't need anything I have you line. Which is obnoxious as hell, gimme something to work with or you're getting socks and underwear. He was army, so it's not like a high thread count pair of either of those would have been a bad gift. IYKYK. The only thing he really wanted was to see his girls, which his ex didn't allow.\n\nThis broke my heart and gave me an idea. I ended up buying 2 beautiful necklaces for him to give to his girls the next time he saw them. So he could see that look on their faces and maybe reclaim some of the hugs and kisses that had been stolen from him. It was my hope those girls could look at those necklaces when they were missing their daddy and know he was missing them too.\n\nI told him all of this, so he knew exactly what they were for. Fast forward and I catch him cheating on me. Whatever, she can have him as far as I'm concerned, but I'm going to let her know she's also being cheated on. She confronts him. It's not long before he shows up at her door with matching necklaces for her and her daughter...I sent a picture and receipt for the ones I'd purchased for his girls. Oh, it was them...this disgusting piece of shit forsook his own children to try and bribe his way out of a lie he'd been caught in and then kept lying. He had the audacity to pull his girls into his lies by saying he gave them the necklaces I'd given him. No folks he didn't, I had to alter the original box to fit both chains in there so I know it was the same one. \n\n\nI will never look at him and see a man again.",
   "created_utc": 1703539786,
   "score": 69,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewacc2",
   "message": "“Every time someone tells me that someone is impressive, I make it my life’s mission to tear them down.”",
   "created_utc": 1703533372,
   "score": 42,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewffjh",
   "message": "My son had a brain tumor. A year or so later after radiation and chemotherapy a guy who'd heard about it all comes up to me and says \"wow, I can't believe you stayed with them.\" Never wanted to punch a guy so hard.",
   "created_utc": 1703535589,
   "score": 123,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewftm2",
   "message": "A bully in the 4th grade picked a fight with me. He was older and bigger and it was only through luck that I managed to land a punch to the side of his head. More than forty years later, I can still feel the crunch of his eye socket cracking. \n\nHis parents sued because they didn’t have insurance to cover the surgeries he needed, even though the kid had a record of being a bully and every other kid who saw what happened said I was defending myself.\n\nThe lawsuit got dropped immediately after his dad came to school and walked into my classroom, threatening to beat me up. He got into a scuffle with my 4th grade teacher and was arrested that day. \n\nThat was the day I learned that pieces of shit don’t fall far from the assholes who made them.",
   "created_utc": 1703535759,
   "score": 61,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew55xl",
   "message": "When she threw an ashtray at my head",
   "created_utc": 1703531164,
   "score": 215,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewb50f",
   "message": "Being rude to store workers, plate carriers, or people just doing their jobs.",
   "created_utc": 1703533729,
   "score": 166,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewhpxg",
   "message": "Ex-buddy got mad at me for accidentally helping his girlfriend figure out he was cheating on her. I wasn’t cool with it to begin with but it was only a rumour to me at the time, but one day she and I met randomly out in public and were chatting and I mention what I did the night before and she goes pale and leaves. Turns out she was told by him I was with him. It all comes out after that, and the dude blows up at me for not covering for him, despite him not even giving me a heads up. Apparently I’m supposed to be psychic.\n\nWell, I lost a friend that day and she ended marrying him anyway.",
   "created_utc": 1703536583,
   "score": 108,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew6j4w",
   "message": "Told the story about how her baby was taken away because she smoked and drank during pregnancy",
   "created_utc": 1703531732,
   "score": 150,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewevfd",
   "message": "He told me he broke up with his ex-fiancée because she had a UTI and was sobbing from the pain in the toilet and he just couldn’t take her being such a pain the ass anymore.",
   "created_utc": 1703535348,
   "score": 127,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew5skb",
   "message": "When a friend told me I would get better from a life changing illness if I accepted Jesus into my heart. \n\nAs an aside never ever ever tell someone to suck it up.",
   "created_utc": 1703531418,
   "score": 254,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewd46z",
   "message": "When my ex told me that no one loves me, no one cares and out me, I have no friends and I should kill myself",
   "created_utc": 1703534596,
   "score": 70,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew9jz6",
   "message": "On a first date once the person told me how he finally came to the conclusion that he couldn't stay married to his ex wife any longer because she was such a a heartbreaking alcoholic. so he bought a copy of Divorce for Dummies and a handle of vodka and got her to sign all the paperwork and give him everything in the backyard of their home after getting her completely drunk for a couple of hours.",
   "created_utc": 1703533025,
   "score": 128,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewpkrl",
   "message": "My sister and I inherited my moms house and she utterly destroyed it and left me on the hook for tens of thousands of dollars. \n\nI already knew my sister was not a great person, but last January she texts me “hey the house has entered preforclosure and I need help to pay it” and she sends me the invoice and it’s $14,000. I get a hold of the mortgage lender and the payment had not been made in over a year. Come to find out she was pocketing the mortgage payment every month and not delivering the payment to them like she said.  I paid the entire amount to save the home, and of course then gave her until May to find a new place to live. Of course she didn’t try at all and I had to threaten her with legal action to leave. She left the night before her deadline was up. \n\nI don’t live in my hometown anymore, so I couldn’t be around the house that much, but I made the trip to verify she was gone and man she just fucking trashed this house. Garbage everywhere, dog shit everywhere, burn marks all over the place, a million holes in the walls, bathroom counter destroyed, toilets non functional, every door frame was cracked, cabinets doors ripped off the hinges, lawn was absolutely fucked, deck had rotted away, etc. It almost left me paralyzed when I walked in the first time. It really looked like an episode of hoarders. \n\nIt’s been a year and I am STILL cleaning it and fixing it up. Albeit I can only work on it in the weekend again as I live away, but right now accounting for the back pay mortgage and repairs, I have spent $35,000 in the last year and I still have to replace doorframes, cabinets, kitchen flooring, and paint. That said I’m staying positive by reminding myself how much I have gotten done so far. \n\nI am only 26 so in a weird way I am glad I learned a lot of valuable lessons early in my life in this process. She trashed the home but luckily it wasn’t passed the point of no return. I really seems like I got in there *just* in time. Contact is bare minimum right now and I’m in the process of buying her out (mind you luckily for an absolute fraction of the value of the home as I threatened litigation to sue for the whole property), but once the buy out is final, I am going to block her everywhere and not speak to her again for at the bare minimum a very long time. \n\nI want nothing to do with her ever again to be honest. In hindsight I’ve realized she’s always been a complete selfish piece of shit her whole life. She’s 30 now and she’s not going to change. She still has taken zero accountability for what happened and thinks I’m this huge asshole for kicking her out lol.",
   "created_utc": 1703539979,
   "score": 27,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew9t18",
   "message": "All of the posts about fathers/parents being assholes on that “heard while they thought you were asleep post”. Or any of the ones where friends of theirs were talking about SA. There are some fucking disgusting people out there. I hope all of the commenters are okay or better now.",
   "created_utc": 1703533136,
   "score": 105,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewhz3u",
   "message": "I work for royal mail. \n\nRecently they tried to change up how we work, prioritising parcels, new contracts working anywhere between 7am and 8pm where needed, working Sundays and a literal pay cut by getting rid of certain things. That's the general gist of it.\n\nWe went on strike to try to stop this (kept us relatively safe but unfortunately new starters have been shafted).\n\nOne guy in our office called himself a hero for coming in over the strikes, essentially calling the rest of us out for striking.\n\nI understand some people can't afford to strike as we don't get paid, I still talk to some of the guys who didn't strike, but don't fucking try to belittle those of us who are fighting and loosing out on money to keep everyone in a better contract.",
   "created_utc": 1703536692,
   "score": 47,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kew7l2b",
   "message": "Elon Musk calling a rescue diver a pedophile. Elon was repeatedly told that a rigid capsule would not work for the mission, but he kept bragging about it's development like he was helping.",
   "created_utc": 1703532185,
   "score": 212,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewbm99",
   "message": "When I was checking my hair in the mirror",
   "created_utc": 1703533942,
   "score": 20,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "keweyps",
   "message": "Talking about how her parents were really the ones who wanted a child so it was fine that they raise him while she got high. Latest update on her has her in a different country with a new man and a new baby, not one word on her socials about the first child.",
   "created_utc": 1703535387,
   "score": 18,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewgddo",
   "message": "When someone talks friendly infront of certain people but then when theyre not around shit talks behind their back.",
   "created_utc": 1703536002,
   "score": 38,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewk8iv",
   "message": "I know someone who's mother really wanted to adopt, got custody of 2 kids and then shortly after separated from their dad and left the kids with him ... He was a raging alcoholic. I get wanting to get away from that but leaving the children you went out of your way to adopt behind is just terrible",
   "created_utc": 1703537682,
   "score": 15,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewop7i",
   "message": "My sister decided to never have kids. She's married, 40yo. On Christmas day my son and his fiance announced they were pregnant. We were ecstatic! My sister made it all about herself, crying, and had the rest of the family comforting her, taking away my son's special moment.",
   "created_utc": 1703539585,
   "score": 14,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewe7j7",
   "message": "I definitely will judge someone for how they treat waiters, retail and fast food workers. If someone treats someone like shit for things they can’t control I can’t help it but be extremely disgusted \u0026amp; want nothing to do with the person. I’m not a snob and I don’t think I’m better than others. I am not perfect either but I definitely do judge people for particular things.",
   "created_utc": 1703535064,
   "score": 57,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewi7xa",
   "message": "This guy my boyfriend is kinda friends with. He gave him a place to stay to get back on his feet after a divorce, he gave him a job and overpays him and we see him at happy hour often. Turns out he’s a habitual liar, has done nothing but take advantage of boyfriend and others, consistently cheated on girlfriend of two years and he was divorced after his wife found out he was cheating with a handful of women. Hes a user and abuser but boyfriend is worried he’ll end up on suicide watch if he cuts him completely loose. Ugh.",
   "created_utc": 1703536800,
   "score": 13,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewztoe",
   "message": "My Grandpa Joe laid in bed for 20 years and only got up when I found a golden ticket for the Wonka Chocolate factory. He then proceeded to dance around stating that he had the golden ticket. Man I hate him.",
   "created_utc": 1703544630,
   "score": 37,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewb1bf",
   "message": "Everything Chris Brown.",
   "created_utc": 1703533683,
   "score": 45,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewjpv9",
   "message": "When I was younger(7) and some kid broke my glasses and my mom picked new ones out for me. They were these ugly massive things and she proceeded to walk around for months hooing at me like I was an owl. Yep my mother is the POS.",
   "created_utc": 1703537453,
   "score": 14,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewrocq",
   "message": "When my exwife thanked me for everything, for being me, for her life experience with me, and her apologizing and admitting she pushed me to leave with her abuse and manipulation. then, she made a stupid tik tok dancing full on smear campaign video calling me a narcissist, manipulator, abuser, and addict. No one talks to me anymore and I was left in ruins. She kept the house and everything. Piece of shit apple falls from a piece of shit tree father. Good riddance.",
   "created_utc": 1703540922,
   "score": 12,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewdagt",
   "message": "he only texts me whenever he wants to have sex but i continuously refused to. whenever i refuse to do so he'll immediately get angry and will eventually block me.",
   "created_utc": 1703534669,
   "score": 31,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewjlnm",
   "message": "If someone tells you they are an empath, fucking run.",
   "created_utc": 1703537402,
   "score": 33,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewtgfm",
   "message": "My DADS girlfriend found a photo album in a photo vault of several women who were changing, showering, or using the bathroom in his bathroom. He had a hidden camera in the form of a wax warmer that he would download videos from and then take screenshots. My fiancé at the time was among some of them. As well as several of my exes all the way back to when I was 15. Also his girlfriend was 17 and he’s 52. I’m 23. This all screams sex offender VIP",
   "created_utc": 1703541723,
   "score": 36,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewho1k",
   "message": "when her filet mignon arrived, she asked for some ketchup.",
   "created_utc": 1703536560,
   "score": 52,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewcfim",
   "message": "My ex got upset about my contacts on WhatsApp and demanded I delete some of my oldest friends. Needless to say the relationship didn't last more than a month after this.",
   "created_utc": 1703534297,
   "score": 31,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewi32g",
   "message": "My dad, sending me the 2nd message of the year (as always), but even with the wrong name. Said something about it, and he said I should be thankful to get a message at all",
   "created_utc": 1703536742,
   "score": 8,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewn437",
   "message": "Leaving a grocery cart in the parking lot.",
   "created_utc": 1703538916,
   "score": 11,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewaqwh",
   "message": "Treating me differently after losing weight and hitting a growth spurt along with taking more care of myself all together. \n\nMost people at my school were superficial af.",
   "created_utc": 1703533553,
   "score": 40,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kex94f6",
   "message": "Lady who used to share stories online about the troubles women frequently face and how no one regardless of gender should be treated that way, one day goes on a massive rant about how literally all men are evil by birth and are inherently meant to be monsters.\n\nFastest respect-to-disappointed flip, I swear.",
   "created_utc": 1703548895,
   "score": 7,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewglxp",
   "message": "There's a guy I know. He married a single mother and tried to be a parent to the kid, but failed, and the relationship ended up abusive to that kid. Years later, the kid graduated and, through some bad luck, had to move as an emergency while across the state. The kid tries to move back in after setting up a lease/agreement with his mother. Not even within 24 hours after the son moved in, he threw a fit, tried to change the terms of the lease, and then got violent when the son decided to try to move out, not wanting to deal with the nonsense of changing a deal. This all happened within 24 hours after moving in. This \"father\" sees absolutely no problem in his actions or in completely overriding an agreement his wife made. He made his son homeless and tries to call himself a father.",
   "created_utc": 1703536109,
   "score": 21,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewto16",
   "message": "Used to knock around with the same group of friends for years, one day someone brings a new girl round, seems really nice, friendly talkative giggly nothing out of the ordinary, she knocked about with us for a number of years then went her own way, fast forward 6 years and she's in the local papers and allover social media for stealing thousands from the parents of her dance class she teaches organising fake trips to Disneyland, proven guilty but only paid some of the money back, fast forward another 2 years and she's got a decent job in local council and she's scamming people for thousands yet again, somehow got away with it, fast forward to 8 month ago and her name pops up again for scamming the elderly with some fabricated bullshit thing she's made up, justice system proving it's utterly shit and her proving she too is a shit human",
   "created_utc": 1703541819,
   "score": 15,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewt44s",
   "message": "My ex-wife put me through weeks of hell when she told me she thought she wanted a separation. Many reasons were erratic and false. Eventually said she wanted a divorce. Like a simp, I gave her a sweetheart deal (basically I took the debt and she took everything in the house). \n\nThis is what I found out and figured out (some before divorce):\nShe was cheating on me\nWanted divorce only after securing the new relationship\nShe literally wrote me a Dear John letter and watched me read it - the lie that stuck out was \"neither of us have anyone\"\nShe had me help her with her UTI - she got from fucking the dude in his car\nShe covertly flirted with him in front of me in my house under the guise of D\u0026amp;D\n\n.....after much thought, I have decided she was using me most of our marriage, if not our entire relationship. She never forgave me for forcing her to close her business (I worked two jobs to support her unprofitable business for three years) and used me since. Waiting until I spent all of my mother's inheritance (about 150k). Literally six weeks before she called it off, she wanted me to spend 6,000 on a bed for her. I said no, and magically she ended it. She told me she wanted a divorce for years, yet we sold a house and moved less than a year before this, which would have been the perfect time to breakup. But, then she wouldn't have gotten a new living room set....\n\nFour years ago, and still angry about it...\nTl;Dr Ex-wife is gutter trash",
   "created_utc": 1703541568,
   "score": 13,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewhbmr",
   "message": "Ex girlfriend. Got invited to a bon fire. Show up to what I thought was the bonfire but it was next door neighbors, this was my first time going to this place. Neighbors were friendly. Offered us a cupcake even. Both of us said no for the moment. Our friend came and greeted us and we went next door to the place we were supposed to be. Couple hours go by. It's time to go and we're walking back to the car. She's like \"ya know I really want to take them up on that offer for the cupcake\". \"But I don't want to go alone\"\n\nIn my head I'm just like... The cup cake you were offered two hours ago? You're trying to cash in on that offer now?\n\nSo I said fuck it and walked with her back to the neighbors who were in the middle of some games. We walk up to their fire, and they're all friendly still, like, oh hello again! Want to play this game? And my now ex was like \"oh no I just came for the cupcake!\"\n\nAnd then we left \n\nIt was so awkward. It just kinda felt like.... The cupcake was offered to you in the moment and you should've grabbed it then. To walk back up to a strangers bonfire hours later, and take a cupcake, and leave.... It's just.... Something \n\nThat wasn't what ended it, but that was the beginning for me of realizing what kind of a person she was. It seems so small but it was just painfully awkward and for me said a lot in a small action",
   "created_utc": 1703536411,
   "score": 27,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewj438",
   "message": "Talking about wanting to become a cop so he could beat people and plant evidence on them.",
   "created_utc": 1703537187,
   "score": 12,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewke4v",
   "message": "My best friend kept banging my wife for 6 years",
   "created_utc": 1703537750,
   "score": 7,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewl4w9",
   "message": "My little sister faked having cancer in order to create a go fund me. She stole money from family and family friends.",
   "created_utc": 1703538073,
   "score": 5,
   "submission_id": "18qonvh"
  },
  {
   "comment_id": "kewmimo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qonvh"
  }
 ]
}