{
 "submission_id": "18qqktp",
 "title": "People who had one baby and then decided \"never again\" . What happened?",
 "selftext": "",
 "created_utc": 1703536706,
 "permalink": "/r/AskReddit/comments/18qqktp/people_who_had_one_baby_and_then_decided_never/",
 "score": 39,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qqktp/people_who_had_one_baby_and_then_decided_never/",
 "comments": [
  {
   "comment_id": "kewsevw",
   "message": "The pregnancy unlocked/unleashed/triggered some chronic mental health issues for my wife AND she was terribly sick for the first 7 months of the pregnancy. If we try for another, she’ll have yo go off her meds for it and that’s a whole another issue.\n\nEdit: The issue was not portpartum depression, although she did suffer that as well (and likely is related to her proper diagnosis, which she received years later after much hardship). \n\nThe issue I was thinking of was *not* an auto-immune issue, although she *also* suffers from one of those, diagnosed separately. I hadn’t really connected that to the pregnancy in the same way, but that could be a thing 🤷‍♂️",
   "created_utc": 1703541256,
   "score": 136,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewjz4q",
   "message": "My sister had an exceptionally difficult pregnancy that nearly killed her.  Her doctor told her a second pregnancy would be even riskier.",
   "created_utc": 1703537564,
   "score": 32,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewiavs",
   "message": "We were good. One healthy baby is to be thankful for. Families are expensive.",
   "created_utc": 1703536834,
   "score": 226,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewp59w",
   "message": "Didn't get the help I expected from my other half. Plus kids are expensive. I've also been able to stay home for almost 2 years. Wouldn't be able to do that with a second.",
   "created_utc": 1703539784,
   "score": 135,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewu2sk",
   "message": "Pregnancy was perfect. Baby was healthy according to the gyn. Had traumatic birth that ended with an emergency c-section. Kid is now twelve and has multiple handicaps and won't ever be able to take part in society. She'll need life long care. Never again.",
   "created_utc": 1703542002,
   "score": 116,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewssax",
   "message": "I would have loved to have had more than one baby, but we were broke. Daycare is so expensive. Healthcare is so expensive. Clothes and activities and lessons and all the things are so expensive.\n\nQuitting after my first was 100% due to financial reasons.",
   "created_utc": 1703541422,
   "score": 75,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewqzbc",
   "message": "We both nearly died in childbirth (didn’t fancy doing that again), she then didn’t sleep for more than three hours for the next 5 years. Oh and no family support whatsoever. \n\nFuck doing all that again!",
   "created_utc": 1703540609,
   "score": 173,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewinyv",
   "message": "My sister was going to have a second baby, but he passed away while in the womb. And from there she decided never again. And is just raising my nephew.",
   "created_utc": 1703536988,
   "score": 200,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kews6hr",
   "message": "The first year of sleep deprivation absolutely wreaked me. I swore never again",
   "created_utc": 1703541150,
   "score": 204,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewpqgl",
   "message": "One and done. \n\nWe don’t live near any family and are in a HCOL area. One kid means we can go on fun vacations. \n\nI also had a traumatic birth and still remember that doctor telling me to not let this impact my decision on future kids…\n\nMy kid is great. She calls our dog her sister.",
   "created_utc": 1703540051,
   "score": 135,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewpvxc",
   "message": "Infertility.. went through IVF.. got one embryo and she is now a few months old and is perfect. Tough pregnancy physically but also emotionally. My mom died suddenly when I was 15 weeks.. my dad got diagnosed w stage 4 cancer the day my daughter was born. Traumatic labor and delivery.. induced and needed blood transfusion. Would have to go through IVF again most likely. It has been a YEAR. Sometimes I feel like the universe required me to sacrifice my parents in order to have a perfect baby (I rationally know this is not true and not how it works lol) but sometimes my mind goes there",
   "created_utc": 1703540119,
   "score": 43,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewmjo7",
   "message": "If I have another baby I'll need to work double to give both kids a good life. More work means less quality time with my kids and I don't want my kids to have the same childhood I had: my parents worked their asses off to give my brother and I a good life (good food, school, clothing etc) but they were always working or too tired to play with us or even to have a good family time, they never took us for a walk in the park, never had a movies night at home or anything but Sunday lunches in family where we were supposed to eat quickly without talking, do the dishes and spend the rest of the day without making any noise because dad needed to rest.\nI am very thankful for my parents and all their sacrifices, but I want my child to have parents that aren't exhausted all the time.",
   "created_utc": 1703538679,
   "score": 33,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewt50u",
   "message": "We are one and done (kiddo is 11). A few factors that went into the decision:\n\n- I absolutely hated being pregnant. I was so uncomfortable the entire time. She was situated so high my boobs were practically at my chin. \n\n- I had a horrible, scary labor and delivery. Had to be induced because I was overdue. Labored 36 hours before getting to 10cm. Pushed for 4 hours but couldn’t get her out. Ended up with an emergency c-section. I was so out of it after I didn’t even realize I’d given birth until a few hours later (I was wondering why everyone was talking so loudly but it was the doctors trying to keep me alive). Had some complications after due to my ulcerative colitis and ended up staying in the hospital for 6 extra days. My recovery took a lot longer. \n\n- Honestly though, I could have surmounted those things. The biggest issue for me was I wasn’t making a huge salary at the time and daycare cost pretty much my entire take home pay each month. (Husband’s salary paid the rest of the bills.) I quite literally couldn’t afford a second kid. \n\n- That said, when kiddo was 3, I switched jobs and ended up tripling my salary. (Same position but now I worked in tech.) I wasn’t eligible for (unpaid!) maternity leave until I’d been there for a year and by the time I was eligible, I was rocketing up the career ladder at my company and didn’t want to mess it up (I still work here and I am now exec level). \n\n- Also, my child didn’t sleep through the night until she was 18 months old. I never once pulled an all nighter in college but there were so many times I had to get on that train to NYC for work without ever having closed my eyes the night before. \n\n- My husband was okay with whatever I decided. \n\nAnyway, all of those reasons factored into why we only have one kid. We are a very happy family though and I’m super glad we made the decision we did!",
   "created_utc": 1703541579,
   "score": 24,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewygnf",
   "message": "I don’t have children, but I am an only child and I absolutely loved it. I don’t understand why only children/one and done families sometimes get judged so hard. I really think it can be one of the best family dynamics. Obviously there are downsides, just like with everything, but I have zero complaints and never wanted a sibling! If you’re feeling bad about wanting to be one and done, don’t!!",
   "created_utc": 1703544000,
   "score": 107,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewp8xj",
   "message": "I knew I always wanted one kid. Can’t afford to have a second and I had bad postpartum. Im at a good place in my life and I feel if I have another kid, I would be miserable. I’m happy with one.",
   "created_utc": 1703539829,
   "score": 198,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewu494",
   "message": "Short answer: I like sleep.\n\n\nLong, more serious answer: pregnancy is rubbish, birth is horrible, post-birth is horrific, babies are stressful! I decided I never wanted to put my body through pregnancy again, plus I'd have to look after my existing child whilst going through it. \nMy baby had a lot of minor issues, but together, they meant a frequently unsettled, windy baby who would cry for long periods (or so it felt) and was hard to get to sleep. I would not be surprised if it's had a deep effect on my mind somewhere as I don't like not being able to hear him if we're both in the house (now a toddler, able to make enough noise in several ways!)",
   "created_utc": 1703542020,
   "score": 3,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewtllj",
   "message": "I had a 4th degree tear and then an RVF and then correctional surgery, pelvic floor therapy, PPA and other general anxiety that wasn’t so bad until I had a kid. I’d rather be alive and well for one than not around for 2.",
   "created_utc": 1703541788,
   "score": 170,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewznry",
   "message": "Because it turns out that it’s not “worth it in the end” or the “best thing that ever happened to me.” \n\nI love my one toddler, but I also loved my old self who was able to do what she wanted when she wanted. I now have no time or energy to do anything outside of my routine day of work + take care of toddler and house. My husband is an active parent and takes the lion’s share of some of the responsibilities, but it’s still a lot. An overwhelming a lot. \n\nThe lack of time + constant having to think about/care for someone else + anxiety + chronic lack of sleep = no desire to start again with another kid. By all accounts, my pregnancy and toddler are/were “normal,” but damn I couldn’t do it again and it’s not like you can walk away because it turns out it’s not for you. \n\nOF COURSE I love my child and do all that I can to make them happy and healthy, but that doesn’t mean I’d want to do this again.",
   "created_utc": 1703544556,
   "score": 241,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewqk3b",
   "message": "I’m pregnant with our first and only. I loathe being pregnant and never want to do this again.",
   "created_utc": 1703540420,
   "score": 102,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewm8ee",
   "message": "We always knew we would have only one. Being pregnant sucked, he ended up being premature and then there was a whole other stuff because he was premature.",
   "created_utc": 1703538545,
   "score": 153,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewuzn9",
   "message": "Lots of reasons.\n\n- morning sickness for 20 weeks at the start\n- sick for the last 4 weeks\n- undiagnosed preeclampsia leading to preemie birth\n- week stay in hospital (baby was in the NICU for 3 nights) \n- kidney damage and almost ended up in the ER from blood pressure issues\n- Developed Hashimotos after my thyroid completely died \n- Extremely severe PPD\n- loss of self\n- Loss of connection with my husband\n- Everything is so god damn expensive\n- Only just diagnosed with ADHD which explains why I hated breastfeeding and the baby stage so much. Super sensory overload \n- Can’t deal with more noise\n- Want my life back\n- Sleep. For about 3 months recently my son woke up at 4am every day. Every day we woke up we looked at each other and said “when will this nightmare end”\n\nOur son is the absolute centre of our universe and we feel so complete as a family.\n\nI’m still being pressured to have more and now I say “you can have two grandchildren, but you will no longer have a daughter” because my postpartum depression was that serious.",
   "created_utc": 1703542414,
   "score": 86,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewkfak",
   "message": "I never actually intended to have any (my daughter is the product of ONCE without protection) and it was the most miserable experience I have ever had. I was sick for the entire pregnancy.. I lost so much weight.. And then at the end she started literally killing me so I had to be induced early. First opportunity I had, I had my falopian tubes removed (high risks of cancer in the family so the docs wants to remove them rather than tie them) so that mistake could never be repeated.\n\n\u0026amp;#x200B;\n\nTo be clear, I love my kid. I have fought to keep my kid. The custody battle with her father was a bitch. I do everything in my power to give her the best that I can and make sure she knows she is loved.",
   "created_utc": 1703537764,
   "score": 223,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewu3ml",
   "message": "I got postpartum preeclampsia and was hospitalized for 3 days a week after my baby was born. I almost had HELLP. And, I had to see a cardiologist because they thought I might have had postpartum cardiomyopathy. \nSo, never again.",
   "created_utc": 1703542012,
   "score": 73,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewr3vi",
   "message": "Postpartum depression, anxiety and psychosis.  It was enough to scare us into never trying again.  That was truly the most terrifying time in my life and it took away my desire to love my newborn.  \n    I still have guilt to this day (13 years later ) for not giving our son a sibling.  I got pregnant while on birth control (nuva ring) when he was 5, but miscarried at 14 weeks.  It may sound weird, but I took that as a sign that we did the right thing by not having anymore.",
   "created_utc": 1703540666,
   "score": 220,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewrjud",
   "message": "I had placenta previa and bled 4 times before having to stay at the hospital for the remainder of my pregnancy. That lasted about 4 days because I bled two more times and had to have a csection at almost 31 weeks. Baby was in the nicu growing ( no medical issues thank god) for 7 weeks. \n\nI'd rather not try again. We're happy with one and we don't have room in our house for another.",
   "created_utc": 1703540865,
   "score": 128,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewllia",
   "message": "Got cheated on when baby was 5 months old.",
   "created_utc": 1703538271,
   "score": 109,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewubku",
   "message": "So my brain herniated out of my skull when I had my son. I had to have a craniotomy to decompress the back of my skull. It's called a Chiari malformation and I spent 5 years waiting to be better before having another kid. Still I wanted another kid though. \n\nTwo days before our \"let's start trying\" date I had a massive panic attack and realized I was also slowly self sabotaging my life and realized this is not what I wanted anymore. As much as I wanted a kid right after my first but had to wait, now I didn't want another one. Our family was complete and I had this feeling that we might be taking on more than we can handle.\n\nWe have more money, freedom with only one kid, and our son is happy and loved and never feels neglected. I feel like an amazing mom who rarely fails her one child. If I had had 2-3 like my original plan, I'd be worn out by now. I surprised everyone with this choice, family and husband included. But it was the best choice we ever made.\n\nMy husband got a dog instead of more kids and himself says he is the envy of his multi kid friends haha he is very happy I changed my mind since he was just going with the flow.",
   "created_utc": 1703542111,
   "score": 172,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex7s8x",
   "message": "*gestures vaguely at everything*",
   "created_utc": 1703548281,
   "score": 55,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewpii2",
   "message": "Well nothing happened.\n\nI have always been on the fence on how many kids I'd want to have. One, maybe two, that was always the thought. I had one and felt that was enough and I am happy. Spouse has 2 children and he also feels he is content.\n\nSo there's no need to have more.",
   "created_utc": 1703539949,
   "score": 158,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewzqja",
   "message": "Well, it was twins. Also, they were born at 25 weeks and spent 6 months in the hospital. \n\nNever again.\n\n(They're doing good now- totally toddler terrorists.)",
   "created_utc": 1703544591,
   "score": 113,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewkoju",
   "message": "Our closest friends had one kid,  the wife told my wife her husband didn't help at all so she avoids sleeping with him because he wants another",
   "created_utc": 1703537877,
   "score": 27,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewtag9",
   "message": "Being pregnant sucks. I had a healthy pregnancy but it’s just physically difficult to get through.",
   "created_utc": 1703541647,
   "score": 105,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "keww30k",
   "message": "It’s actually so fucking difficult, even with plenty of finances and support. From pregnancy to birth to baby phase, fuck me. We’re 6.5 months in and we’re happy, not doing that again.",
   "created_utc": 1703542907,
   "score": 54,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewxzv8",
   "message": "We almost lost our son at 4 weeks. He's 13 now but his kidneys are already on their way out. He doesn't deserve such bad luck. We couldn't risk another poorly child so we called it at one.",
   "created_utc": 1703543785,
   "score": 50,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewqukl",
   "message": "I'm a single mom. When I gave birth in 2020, it was so traumatic that I developed PTSD and am still in therapy for it.  I also have ADHD and autism and have realized that being a mom leads me to be way more overstimulated than I anticipated.  Finally, I'm at a \"cheap\" daycare and pay $240 per week for one preschooler, no way I can afford a second kid.  My current kid deserves the best childhood possible and that requires a financially and mentally stable parent.",
   "created_utc": 1703540549,
   "score": 65,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewyts5",
   "message": "Colic. Holy. Crap. Never again.",
   "created_utc": 1703544169,
   "score": 48,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex0wdp",
   "message": "Had a healthy pregnancy but we had complications during delivery. I had an emergency c-section without any anesthesia and felt/ heard everything. Had PTSD from the surgery afterwards, getting sliced open, hearing the anesthesiologist curse out my doctor, feeling them pull the baby out, and then not hearing my baby crying was pretty traumatic. Was told by my doctors my little girl would have trouble walking, talking and would have deficits from lack of oxygen. I prepared myself for a complete lifestyle change, new life with a disabled child. Thankfully my little girl beat the odds and she’s doing wonderful but I have a deep fear of having another baby and not being as lucky. I’m happy the doctor didn’t hesitate to take her out, she saved my baby in the end but that whole experience has made me and my husband stop at one child.",
   "created_utc": 1703545120,
   "score": 44,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewt40o",
   "message": "Morning sickness, wanted to be able to travel easily with my child, wanted to be a mom but didn’t want kids to completely take over my life.",
   "created_utc": 1703541567,
   "score": 45,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewuwxa",
   "message": "Pelvis separated (3m on crutches), nearly died after c-section, hellish sleep deprivation, followed by miscarriages and genetic news that sealed the decision to stop.",
   "created_utc": 1703542380,
   "score": 41,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewv88h",
   "message": "We were one and done by choice. It was either zero or one for us. We had our one and that was it.\n\nI never wanted an extended kid-centric lifestyle. I enjoy free time, down time, and money lol.  My boy is 11 now and having one is a breeze.",
   "created_utc": 1703542519,
   "score": 44,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewu9ij",
   "message": "53 hour labor ending with emergency c section.",
   "created_utc": 1703542086,
   "score": 38,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewsfng",
   "message": "We knew we wanted one OR two. I got pregnant with twins. Pregnancy has been *ROUGH* and I’m likely to have multiples again if I get pregnant again. It’s in my chart to remove my ovaries when I give birth. There’s no way we are doing this again.\n\nCan’t wait to love the boys when they come, but I’m not going interested in collecting kids.",
   "created_utc": 1703541265,
   "score": 196,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvml2",
   "message": "Not me, but my uncle and aunt are probably the happiest married couple I’ve ever seen. High school sweethearts, still deeply in love.  \n\nDuring the birth there were many complications. IIRC my uncle had to be restrained by security and locked in another room. He tried to punch out some folks, tried to throw a chair… I think at one pint. She was gonna bleed out on the table and he was ready to kill the doctor.  \n\nEverything ended up being fine, but they both basically said they’re never having kids again and they didn’t. My cousin is almost 30 now",
   "created_utc": 1703542699,
   "score": 63,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewz6k8",
   "message": "I didn't get more than 4 hours of unbroken sleep for almost 10 months and could not deal with the sleep deprivation again.\n\nI could do pregnancy again. I can't do those newborn months again.",
   "created_utc": 1703544334,
   "score": 65,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex1ly0",
   "message": "My kid is a fucking nightmare. Seriously, I love him, but it’s so incredibly exhausting.",
   "created_utc": 1703545445,
   "score": 63,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewsgau",
   "message": "Currently 30 weeks pregnant and have already decided I'm not doing this again. \n\nWe went through infertility over the course of 3 years to get pregnant and the slew of tests, procedures and medications were actually quite traumatizing and I still haven't gotten to a point were I feel excited about this pregnancy. I still have to take it one day at time, one milestone at a time.\n\nI've been nauseous everyday since about 7 weeks and have been medicated since 12 weeks. Thankfully I did not suffer from HG and my vomiting was relatively mild.\n\nI recently was diagnosed with gestational diabetes and have been struggling to manage my sugars and ended up needing medication for that as well.\n\nNot to add the general discomforts of pregnancy while also working shift work and being a nurse so knowing all that can go wrong.\n\nI'm also 35, so don't want to do this again closer to 40. If in 4-5 years we as a family decide we would like another child, my partner and I would love to adopt.",
   "created_utc": 1703541273,
   "score": 118,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewzorz",
   "message": "My daughter is autistic. It was, and it still is exhausting. We love her so much, and we are extremely happy to have her, but for the sake of our mental health, we can't have another one.",
   "created_utc": 1703544569,
   "score": 30,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex0ike",
   "message": "We experienced secondary infertility, and decided that ART was not for us. That the child we had was plenty.\n\nAnd then last year, I had to have yeeterus surgery because I had one fibroid the size of a fucking Wiffle Ball growing attached to my uterus, and one fibroid the size of a golf ball in my uterus, and a uterine polyp.\n\nNow, at 48, I am menopausal, and my husband, at 54, is completely unwilling to consider anything involving starting over.",
   "created_utc": 1703544945,
   "score": 32,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex11mp",
   "message": "She wasn’t an easy newborn, but that wasn’t all of it. I decided *very* early on that I didn’t want to have any more children with her father, and I just haven’t bothered with relationships since then. Now I’m 42 and the thought of starting over with a newborn gives me hives.",
   "created_utc": 1703545185,
   "score": 30,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "keww3cl",
   "message": "Have you ever raised a kid? They are exhausting. I don't fault anyone who goes one and done.",
   "created_utc": 1703542911,
   "score": 85,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewtw0u",
   "message": "Pregnancy lol. Its the worst. Never again.",
   "created_utc": 1703541918,
   "score": 55,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewq7co",
   "message": "It was difficult conceiving the first. The second would have most likely required IVF and we weren't about to spend that kind of $.",
   "created_utc": 1703540260,
   "score": 27,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewtbm0",
   "message": "My wife had a lot of health problems and complications during her pregnancy, we were very lucky that she and our baby were both healthy afterwards.  Neither of us wanted to risk trying for another.",
   "created_utc": 1703541662,
   "score": 28,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewshhp",
   "message": "I had a baby lol",
   "created_utc": 1703541288,
   "score": 91,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex1k9z",
   "message": "I was forced into having a baby. Minors don’t have access to birth control or abortion. I never wanted kids at all. As an adult, I will never willingly have a child.",
   "created_utc": 1703545424,
   "score": 41,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewtxmt",
   "message": "My wife wasn’t supposed to be able to get pregnant so one was unlikely and two would be just as unlikely. We also couldn’t afford a second one and I couldn’t do the constant panic attacks during her pregnancy again.",
   "created_utc": 1703541939,
   "score": 20,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewuf3x",
   "message": "I turned 45 and have a 7 year old...hits different.",
   "created_utc": 1703542156,
   "score": 23,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewuj69",
   "message": "Like many others here, I had a traumatic birthing experience and almost died, but in addition to that, my pregnancy was also *really* rough and I knew I wouldn't be able to parent my *first* the way I wanted to, if a second pregnancy was similar.  I had morning sickness all through the first and second trimester and fought dehydration throughout the pregnancy, because of that.  Also, with the exhaustion, I was basically working and sleeping. I realized that a repeat of that experience would take me almost fully away from my first, for nearly 9 months and I honestly couldn't bear the thought.",
   "created_utc": 1703542209,
   "score": 21,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewup7k",
   "message": "Ppd",
   "created_utc": 1703542283,
   "score": 21,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewv0si",
   "message": "One and done. Babies take a lot of money and time.",
   "created_utc": 1703542427,
   "score": 22,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewv3no",
   "message": "I asked this question to a good friend of mine and his answer really suprised me:\n\nThey didn‘t want to be forced to spread the love for their girl between two children.\n\nI never even thought of this being a possibility!",
   "created_utc": 1703542462,
   "score": 20,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewv7kd",
   "message": "Almost died at birth",
   "created_utc": 1703542511,
   "score": 24,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvzxn",
   "message": "I adore my baby girl. \n\nI hated HATED being pregnant. She is absolutely worth it, but I would not do it again \n\nKids are expensive and I’d want my second to have every opportunity my first had. Right now, that wouldn’t happen. \n\nShe’s a lottery win, she sleeps well, eats well, is happy, smiley and healthy … I don’t want to role the dice again. \n\nMy husband, my little girl and my dog take up all my time. I don’t want my free time divided up any more \n\nI want a career, which is currently on hold. When my daughter is at school I’ll be able to focus on that, having another would delay that another 2 years minimum \n\n\nPregnancy suuuuuuuuucks.\n\nEdit- a few typos",
   "created_utc": 1703542867,
   "score": 21,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewz7q4",
   "message": "My husband at the time, her father. The day my child came home from the hospital was the day I started learning how I made a huge mistake having his child. Having a second was unfathomable.",
   "created_utc": 1703544349,
   "score": 23,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex0wi6",
   "message": "My pregnancy was absolutely hell on earth. Vomiting daily, lost 1/4 of my body weight while pregnant. Extreme vertigo. I could go on and on. I was fairly certain this pregnancy would be my one and only. Three weeks after I delivered, I was diagnosed with stage 4 cancer. And that diagnosis pretty much settled that debate for me.",
   "created_utc": 1703545121,
   "score": 21,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewriuu",
   "message": "I didn't want any children, puked myself inside out for 3 months, baby was 2 months early, quite hefty depression and anxiety and none of that sits well with my autism.\n\nI love my child with everything I have and they were worth every second of it but I knew I couldn't do it again",
   "created_utc": 1703540852,
   "score": 59,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewx4r4",
   "message": "We had 2, but people don’t realize how extremely difficult having a baby is. We intended on having 3 but it’s just too much (and my kids are pretty darn good by most standards, zero health, behavioral, mental, learning etc issues). The first few months are a total shock to the system and it’s completely understandable why someone would not want to go through it again.",
   "created_utc": 1703543385,
   "score": 60,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewsxdh",
   "message": "Not me but my aunt broke her tailbone giving birth to her son and was like “yeah, never again”",
   "created_utc": 1703541484,
   "score": 42,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewuzpf",
   "message": "Became a single parent. I just don't have patience for more than one kid. Plus, I have health problems and cost of taking care of  kids. I love my kid, but I'm so over it. No more babies.",
   "created_utc": 1703542414,
   "score": 19,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex1i0a",
   "message": "My wife had hormone related breast cancer due to being pregnant. It wasn’t worth trying and risk her going through all that again. We are the closest little family of three. I do love when people ask why we only had one child,and insist on an answer,I just love to see them squirm when we do tell them. If only a hole would open up for them to be swallowed up. If you don’t want to know the answer,don’t ask,mind your own business. We never know what people have gone through.",
   "created_utc": 1703545395,
   "score": 20,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewxm18",
   "message": "I spent my entire pregnancy terrified something would happen to the baby and I wouldn’t be able to help them. Some people feel empowered but I felt so vulnerable the whole time. \nThen two months after I had my (safe, healthy) baby, my friend’s baby died in the third trimester. \n\n\nAlthough I would like another child, the thought of pregnancy makes me terrified.",
   "created_utc": 1703543606,
   "score": 17,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewyxps",
   "message": "Wanted more, but my child has been diagnosed with severe, non-verbal autism and I cannot risk having another child with autism.",
   "created_utc": 1703544220,
   "score": 18,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewzea1",
   "message": "I wanted very badly to kill myself 7 months post-partum because of severe PPD and I knew I wouldn’t survive it twice.",
   "created_utc": 1703544433,
   "score": 17,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewu906",
   "message": "Got divorced. Don't need another baby mama and my daughter is perfect.",
   "created_utc": 1703542079,
   "score": 34,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewusiv",
   "message": "I have very bad older siblings. I decided when I was in my teens that if I ever had a child, I would not give them siblings. My beat gift to them would be that they would be an only child and live in peace.",
   "created_utc": 1703542325,
   "score": 37,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvf1r",
   "message": "I only wanted one. Loved being pregnant. Kiddo has had a happy and healthy childhood, just turned 17. Loved going through all the stages (this far) with the kiddo, and moving on to the next. No bad or sad reasons, just got my happy, loving kiddo and was very happy with him being my only.",
   "created_utc": 1703542603,
   "score": 37,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex0blm",
   "message": "My child was absolutely miserable for the first two years of her life. The first 6 months she had colic and other issues. She did nothing but cry the entire time. Everyone was at wits end and we could not satiate her no matter what. The only peace we got was when she was asleep. Then she didn't follow a normal development path. She was very slow to communicate both verbally and physically. She seems to have had an instant gratification thing baked into her personality. If she didn't get exactly what she wanted in a moment (pointing to something) she would immediately drop to the floor and have a holy meltdown. She didn't say her her first words until 3.5-4 years old. Not due to a lack of trying of course. I would read and talk to her all the time. \n\nThat entire experience put all parties involved not wanting another kid at all. Any desire was completely removed. \n\nShe is now 9, and I'm pretty sure has ADHD, and is a 1000% pure energy machine. She talks so much it drives everyone up the wall, but is insanely curious. We are always building things/models etc. she also reads several books a week (age rated).  I think she will do just fine, and I honestly regret not having a sibling close to her age to alleviate the attention she demands from the adults. But it is what it is.",
   "created_utc": 1703544857,
   "score": 34,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex0d8f",
   "message": "My son was born at 28 weeks.  Barely survived, 93 days in the NICU, went through sepsis twice, lucky there is no developmental damage aside from a slight speech impediment (he's almost 17 now).  He also has a fatal (if not managed properly) rare fatty oxidation disorder (genetic, no cure). \n\nYeah, no more after that for sure.",
   "created_utc": 1703544878,
   "score": 16,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex10vr",
   "message": "Autism.",
   "created_utc": 1703545176,
   "score": 16,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex1qy6",
   "message": "I felt like I won the lottery with my kid. Didn’t need to roll the dice again.",
   "created_utc": 1703545509,
   "score": 15,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex1rdi",
   "message": "Baby ripped my cervix during vaginal delivery. Would have died during child birth if I had not been at a hospital. Needed 4 blood transfusions. One beautiful healthy baby was enough for me!",
   "created_utc": 1703545514,
   "score": 14,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex2emf",
   "message": "Nothing in particular, just felt the family was complete after my daughter was born, when I'd picture ourselves in the future I didn't see anyone else in my mind, also she is such a chill kid that we can't risk having another one, statistically the next would be the devil himself",
   "created_utc": 1703545804,
   "score": 15,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvogt",
   "message": "A few things...\n\nA very rough pregnancy, which I did not enjoy. I was very uncomfortable the whole time and it caused more damage to my hips than anticipated. (Like, I'm not quite 40 and am looking at a replacement in the next 2 years because of the damage).\n\n\nOur girl is a spit fire. I absolutely LOVE her wild personality but she is plenty for us. She is so used to being an only child that to have one now would cause a lot of chaos. \n\n\nCost. As it stands, we can't afford daycare for 1 (well. We can. Its just that essentially my whole paycheck would go to daycare). \n\n\nIt's just easier. We are done with diapers and bottles, forever. We can travel easily-don't need an overly large vehicle for transport, etc.",
   "created_utc": 1703542723,
   "score": 13,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvrxt",
   "message": "Severe pregnancy sickness for the whole damn time. \nNot bad enough to be HG (all the women with HG are incredible, I don’t know how you did it) but bad enough to basically make me a hermit for my whole pregnancy. Massively detrimental to my mental and physical health, and my husband/families wellbeing. \nBaby is due soon, and I love him so much I know it will be with it, but I don’t think I can do it again.",
   "created_utc": 1703542767,
   "score": 13,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewurlo",
   "message": "Dad of 2yo over here, working from home. I'm taking care of most house stuff (exceptions are dinner and laundry, the rest is all on me) and the kid. I don't feel my wife is doing enough and she can't be reasoned with. Told her I'm never having another kid like this yet she doesn't understand why. I love being a dad, but 0 support really wears you down. I was on the brisk of a meltdown several times, another baby would probably destroy me.",
   "created_utc": 1703542313,
   "score": 32,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvvrf",
   "message": "Severe morning sickness followed by post-partum hemorrhage and severe post-partum depression; wasn't going to risk my physical or mental health when we already had such a happy, healthy baby.",
   "created_utc": 1703542814,
   "score": 15,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewy2m8",
   "message": "My wife was having very bad labor pains with or first and only child, made me promise right then we would never do this again and I did.",
   "created_utc": 1703543819,
   "score": 14,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewzul6",
   "message": "Had a magnificent daughter and didn't feel a need for another child.",
   "created_utc": 1703544643,
   "score": 12,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kex2l4v",
   "message": "I had multiple dangerous complications during childbirth and even though I really would have loved more ,it wouldn't have been right to risk leaving my existing child without a mother.",
   "created_utc": 1703545888,
   "score": 14,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvq9w",
   "message": "My dad was an only child but my grandmother said she regretted not having one more. She felt like he needed a sibling as he got older and having to do more for her.\n \nEdit: She only wanted one to start with because my grandfather was not a good provider. They wouldn’t be able to afford more, even with her working. She didn’t think it was right to have a bunch of kids and then have someone else keeping them because she had to work.",
   "created_utc": 1703542746,
   "score": 11,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "kewvvlq",
   "message": "I nearly died. One was plenty.",
   "created_utc": 1703542812,
   "score": 12,
   "submission_id": "18qqktp"
  },
  {
   "comment_id": "keydby4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qqktp"
  }
 ]
}