{
 "submission_id": "18qsd9l",
 "title": "What’s one thing you accidentally found out that now everyone has to know?",
 "selftext": "",
 "created_utc": 1703542260,
 "permalink": "/r/AskReddit/comments/18qsd9l/whats_one_thing_you_accidentally_found_out_that/",
 "score": 237,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qsd9l/whats_one_thing_you_accidentally_found_out_that/",
 "comments": [
  {
   "comment_id": "kexpwzj",
   "message": "[Sudden hearing loss](https://www.nidcd.nih.gov/health/sudden-deafness). It happens overnight in one ear, can happen at any age and they don’t know the cause. But if they treat it in 48 hours you have a good chance of it returning- the longer you wait the less likely you’ll recover anything.",
   "created_utc": 1703556697,
   "score": 146,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexe3g2",
   "message": "I saw an article the other day that said Christmas Day Emergency Rooms see the largest uptick of broken dicks than any other day of the year. Ya’ll stay safe out there today.",
   "created_utc": 1703551179,
   "score": 230,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexejfn",
   "message": "Brass doorknobs sanitize themselves. Glass doorknobs hold bacteria.",
   "created_utc": 1703551388,
   "score": 106,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexu7e3",
   "message": "Only one in ten family fortunes survive to be passed to a third generation.",
   "created_utc": 1703558738,
   "score": 100,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kewuwgi",
   "message": "Cows have best friends",
   "created_utc": 1703542374,
   "score": 226,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key0mcs",
   "message": "That the Mission Impossible theme song is literally the letters M.I. In Morse code.\n\nI’m telling everyone— with my trivia-obsessed family, how did I not know 5 decades ago about Dash Dash Dot Dot Dash Dash Dot dot….",
   "created_utc": 1703561780,
   "score": 1,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexogl1",
   "message": "You have to get revaccinated for whooping cough as an adult. I didn’t know this until I caught whooping cough in my late 30s. It was honestly one of the worst things I’ve ever been through. I slept outside in a tent as I was keeping everyone awake. I would cough until I either vomited or passed out, and this went on for weeks. I broke a rib and split intercostal muscles. You’re supposed to have boosters every 8 - 10 years as an adult, and it really made me understand how babies and small children can and do die from the infection. \n\nIt starts out very much like a simple cold, slightly sore throat and runny nose. It then progressively gets worse with a cough and tightness in the chest. \n\nNow, every time I get a slight cold, I produce a horrible cough that sounds like a braying donkey, even when I feel fine. I wish I knew about needed to get a booster vaccine, now I tell everyone!",
   "created_utc": 1703556010,
   "score": 157,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexydf7",
   "message": "A million seconds is eleven days. A billion seconds is around thirty years.",
   "created_utc": 1703560727,
   "score": 243,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kex4s10",
   "message": "The first land predators were probably big marine scorpions.",
   "created_utc": 1703546891,
   "score": 69,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexcwnp",
   "message": "Robins see their reflection in your glasses and go into attack mode.",
   "created_utc": 1703550633,
   "score": 163,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key176o",
   "message": "If there’s some sort of horrific injury at an accident scene, like a limb sliced off or a decapitation, emergency workers who are first on the scene will warn the other workers on their way so they can mentally prepare for it.\n\nSo if you’re reporting an accident, be explicit in describing injuries so your people can prepare.",
   "created_utc": 1703562059,
   "score": 94,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kex98w1",
   "message": "The deadliest cat in the world is also the tiniest.\\*\n\nThe African Black-footed cat has an average success rate of 60% when hunting, more than twice that of a lion. \n\n\\*Ok, *technically* the tiniest cat in the world is the Rusty-Spotted cat, with an average weight of 3.5 lbs/1.59 kg. But the average African Black-Footed cat weighs in at 3.6 lbs/1.62 kg, so suck it, Trebek!",
   "created_utc": 1703548952,
   "score": 243,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexlaeo",
   "message": "You can ship bees in the mail!!!\n\nI was waiting in line at the post office, and the clerk came back with a package, and the customer says, “No, these aren’t my bees. Is there another one back there?” And I thought, “Holy shit. Not only can you ship bees but enough people do this that it could result in a bee mixup. What in the actual eff.”\n\nI got on the phone and told everyone I could think of.",
   "created_utc": 1703554532,
   "score": 103,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kext17c",
   "message": "i don't know why this blows my mind. but if you have a problem with working out a percentage, flip the numbers and see if it makes more sense.\n\n5% of 200 is the same as 200% of 5,\n80% of 50 is the same as 50% of 80.\n\nTry it. It's awesome!",
   "created_utc": 1703558163,
   "score": 189,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kewyfa4",
   "message": "Not everyone has internal monologue",
   "created_utc": 1703543982,
   "score": 12,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexsqr3",
   "message": "blue men group is not the same three men. the few major cities with regularly scheduled blue men group shows, have 7-9 men",
   "created_utc": 1703558021,
   "score": 59,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexsaqp",
   "message": "A hot spoon on a bug bite distroys the protein that makes it itchy and subsequently the itching stops!",
   "created_utc": 1703557812,
   "score": 90,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexmxfj",
   "message": "Buffalo sauce is just hot sauce with butter.",
   "created_utc": 1703555294,
   "score": 255,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexwhcl",
   "message": "on average, 79% of U.S. adults are literate in 2022. 21% of adults in the US are illiterate in 2022. 54% of adults have a literacy below sixth-grade level.",
   "created_utc": 1703559832,
   "score": 109,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexraig",
   "message": "Woody Harrelsons dad was the first man to assassinate a federal judge.",
   "created_utc": 1703557329,
   "score": 83,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kex80m0",
   "message": "When putting your fitted sheet on your bed go opposite corner to opposite corner. Like youre making an x. All my life I’ve struggled with the fitted sheet coming off the mattress and my bed sheets becoming a mess until a few weeks ago when I read a comment on Reddit. It’s changed my sleep and comfort in my bed.",
   "created_utc": 1703548388,
   "score": 146,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexwevk",
   "message": "Geese use the stars to navigate, because they are intelligent birds.",
   "created_utc": 1703559799,
   "score": 60,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexkcll",
   "message": "Anyone old enough to remember when old dog shit will turn white? It doesn't happen anymore because they made a change to the dog food.",
   "created_utc": 1703554115,
   "score": 203,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexxjd9",
   "message": "People who use sign language have accents.",
   "created_utc": 1703560339,
   "score": 180,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexfert",
   "message": "Sharks are older than trees",
   "created_utc": 1703551801,
   "score": 194,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexype2",
   "message": "If you want to reheat white rice and have it be just as tasty as the first time you cooked it put it into a strainer and pour hot water over it. It comes out like you just cooked it and all fluffy again. (Preferably really hot water from like a kettle)",
   "created_utc": 1703560870,
   "score": 13,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key0axh",
   "message": "I forget the exact percentage, but a ridiculous number of those diagnosed with ADHD as adults are diagnosed after their child receives a diagnosis first.",
   "created_utc": 1703561629,
   "score": 142,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexivkx",
   "message": "When a woman goes under anesthesia for surgery, the doctors can - without your express consent or knowledge - perform a vaginal exam on you for PRACTICE and it’s legal, at least in some places in the US.  This applies even if your surgery has nothing to do with your genitals or reproductive organs.",
   "created_utc": 1703553425,
   "score": 220,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key96t6",
   "message": "Snakes can fart and it's incredibly loud.",
   "created_utc": 1703566103,
   "score": 115,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexibt3",
   "message": "Dolphins fuck the corpse of dead fish for fun",
   "created_utc": 1703553162,
   "score": 175,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexnb5a",
   "message": "Allergy medication can cause depression and  self harm impulses.",
   "created_utc": 1703555471,
   "score": 163,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexxn0j",
   "message": "Over 50% of holiday shoppers have not paid off their credit card purchases from last Christmas.",
   "created_utc": 1703560387,
   "score": 45,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key1nbp",
   "message": "The state of Oregon is about 10k square miles bigger than the United Kingdom",
   "created_utc": 1703562279,
   "score": 183,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kextlvt",
   "message": "To mute the sound on gas pumps playing ads you press the second button down from the top on the right side of the screen…no one wants to hear that shit.",
   "created_utc": 1703558442,
   "score": 151,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexy132",
   "message": "Facetious has all of the vowels in alphabetical order.\n\nFacetiously if you want to count the y.",
   "created_utc": 1703560572,
   "score": 80,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key1aih",
   "message": "The difference between a macaroon and a macaron.\n\nMacaroons are a type of cookie that are made with shredded coconut and egg whites.\n\nMacarons are a type of cookie that is jam, ganache, or buttercream that is sandwiched between two almond flour cookies.",
   "created_utc": 1703562103,
   "score": 123,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexcmz9",
   "message": "You can't spell homeowner without meow.",
   "created_utc": 1703550511,
   "score": 227,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key0c22",
   "message": "Quarter life crises are developmentally appropriate. Emerging adulthood is super interesting.",
   "created_utc": 1703561644,
   "score": 23,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key58sn",
   "message": "A group of Penguins on land are called a Waddle.  A group in water is called a Raft",
   "created_utc": 1703564042,
   "score": 212,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexrq4l",
   "message": "Rabbits eat their poop at night.",
   "created_utc": 1703557533,
   "score": 72,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexbrla",
   "message": "Most birds mate for life.",
   "created_utc": 1703550105,
   "score": 6,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexfoqn",
   "message": "Warm water on a jellyfish sting not pee",
   "created_utc": 1703551929,
   "score": 101,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexq3k6",
   "message": "The melted acetate that a cigarette smoker inhales from the filter of a cigarette could be a substantial driver of lung cancer. Tobacco isn’t good for you either, but medical researchers have known for decades that the filters don’t do a damn thing to reduce the health impacts of tobacco, and in fact they may be introducing carcinogens.",
   "created_utc": 1703556786,
   "score": 213,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexuw8t",
   "message": "That plants take in CO2 and break it apart and take the carbon and turn it into stems, leaves etc. they literally build themselves out of the carbon in the air. This is how plants are carbon sinks, and why burning plants (fossil fuels) releases the carbon back into the atmosphere. I actually didn’t realize they built their bodies with the Carbon they take in from the air!",
   "created_utc": 1703559066,
   "score": 5,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "keyjdzk",
   "message": "The actual things that happen when you declaw a cat. It’s like amputating fingers. They often get early arthritis and back problems because it changes the way they walk completely. It’s insanely barbaric and any vet who participates in the practice knowing the results is immoral and evil.",
   "created_utc": 1703572470,
   "score": 59,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexv897",
   "message": "The Catholic Church used to consider beavers as a type of fish for lent meals, due to their aquatic lifestyle and scaly tails.",
   "created_utc": 1703559226,
   "score": 163,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key7l2x",
   "message": "When I was working in the psych. industry with children, the amount of child pornography that was based off stolen photos from Mom and Dad socials was terrifying. \n\nProtect your kids, folks.",
   "created_utc": 1703565244,
   "score": 160,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexf7xc",
   "message": "The fuel gauge on a car’s dashboard often has a little arrow on one side of it. It indicates which side the fuel cap is on .",
   "created_utc": 1703551710,
   "score": 249,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexgn8g",
   "message": "When Americans refer to the 'midwest' they're referencing the states EAST OF THE MID",
   "created_utc": 1703552370,
   "score": 145,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kex8cvi",
   "message": "Blippi is a very popular youtuber that makes videos for children. Before he did that he made a video called the Harlem poop where he is fully naked and shits into another naked mans ass in the style of the Harlem shake as a comedy video. He has went as far as changing his full name to distance himself from it. Here's a link: https://archive.org/details/harlem-shake-poop",
   "created_utc": 1703548547,
   "score": 31,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key1pe1",
   "message": "While leap years happen every four years to off-set the time disparity between a calendar day and Earth day, it doesn’t off-set time perfectly. The official rule behind leap years is:\nA year that is divisible by four, but not 100. Exceptions are 400s. So the year 2000 was a leap year, as it was divisible by 400, but the year 2100 will NOT be a leap year.",
   "created_utc": 1703562307,
   "score": 93,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexq9o6",
   "message": "RFK jr would be the first Heroin addict president if elected.",
   "created_utc": 1703556868,
   "score": 241,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexqlzy",
   "message": "Technically speaking, cupboards don’t have moveable shelves. Cabinets do.",
   "created_utc": 1703557024,
   "score": 242,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexbegz",
   "message": "Eduardo Franco aka Argyle from Stranger Things voices a singing animated cat, DJ Catnip",
   "created_utc": 1703549944,
   "score": 77,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexs9nl",
   "message": "Ooh, I've got one! If you vomit hard enough that it comes out your nose, it is possible to get partially digested food in your sinus cavities. Guess how I know.",
   "created_utc": 1703557798,
   "score": 232,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexhyp1",
   "message": "Your AK mags can hold AA batteries but its really not a good idea.",
   "created_utc": 1703552989,
   "score": 150,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexf7kp",
   "message": "That any A.I. smart enough to pass a turing test is smart enough to know to fail it on purpose.",
   "created_utc": 1703551705,
   "score": 67,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kexty60",
   "message": "That The Lion Costume From The Wizard Of Oz Was Made Out Of Real Lion's Fur",
   "created_utc": 1703558611,
   "score": 181,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "key1fw3",
   "message": "To shop in incognito mode. Retailers have dynamic pricing so will charge more or less depending on the time of day, the neighborhood you are in, etc.",
   "created_utc": 1703562176,
   "score": 77,
   "submission_id": "18qsd9l"
  },
  {
   "comment_id": "kewuwfa",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qsd9l"
  }
 ]
}