{
 "submission_id": "18qx451",
 "title": "What's the point of working if minimum wage doesn't cover rent?",
 "selftext": "",
 "created_utc": 1703556659,
 "permalink": "/r/AskReddit/comments/18qx451/whats_the_point_of_working_if_minimum_wage_doesnt/",
 "score": 201,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qx451/whats_the_point_of_working_if_minimum_wage_doesnt/",
 "comments": [
  {
   "comment_id": "kexu0ii",
   "message": "I’d rather cover half my rent and share an apartment than give up completely.",
   "created_utc": 1703558644,
   "score": 225,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexu8os",
   "message": "Because you don't have a choice, unless you want to be homeless",
   "created_utc": 1703558755,
   "score": 95,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexyhkt",
   "message": " don't know of a single person renting an apartment making minimum wage. Factories in my area startout at about double minimum wage.",
   "created_utc": 1703560776,
   "score": 115,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexyli7",
   "message": "You know what else doesn't cover rent,  or buy you food?  Not working.  \n\nGet a roommate.",
   "created_utc": 1703560824,
   "score": 66,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexpww4",
   "message": "Because not all jobs pay minimum wage. I love working because my job pays well enough to live quite well.",
   "created_utc": 1703556695,
   "score": 143,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexs6wq",
   "message": "Zero dollars definitely doesn't cover rent or any other basic needs.  All I can say is don't wait to look for better paying work.  I waited (because I was going to college) and passed up some great opportunities.",
   "created_utc": 1703557762,
   "score": 17,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexvh12",
   "message": "Why live shitty and work when you can live shitty and not work.",
   "created_utc": 1703559347,
   "score": 49,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexrdnq",
   "message": "The question assumes that all jobs pay minimum wage. The question should be, “why should I work if my wages are the minimum required by law”. \n\nMy answer would be that your labor is worth exactly what someone is willing to pay. I don’t mean to sound insensitive and  I too would be unmotivated by minimum wages. However, I would be motivated to improve my skills so that someone would be forced to pay beyond the minimum required by law so that I could live more comfortably.",
   "created_utc": 1703557369,
   "score": 83,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key47r6",
   "message": "It's a way to make sure people don't have a choice.",
   "created_utc": 1703563535,
   "score": 6,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexwjrr",
   "message": "Do you just plan on rolling over and dying then? There are things you can do",
   "created_utc": 1703559864,
   "score": 12,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexsox8",
   "message": "I didn’t know not working was an option.  If you don’t work, where do you live?  How do you eat?  These questions make me drag my sorry behind to work",
   "created_utc": 1703557996,
   "score": 9,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key7rqd",
   "message": "exactly. general strike now.",
   "created_utc": 1703565339,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexs3xr",
   "message": "Gotta start somewhere",
   "created_utc": 1703557722,
   "score": 16,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexq2fm",
   "message": "Not all jobs start at minimum wage. Both jobs I've had so far started me at $15 an hour, $2.50 above minimum wage where I'm at. The first one I got promoted to over $20 after a few months.",
   "created_utc": 1703556770,
   "score": 10,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexvxev",
   "message": "Roommates. Nobody is making only minimum wage and living by themselves.  You don't have to make rent, you just have to cover your room.",
   "created_utc": 1703559565,
   "score": 18,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexzkff",
   "message": "The age-old question. Do I really deserve to live, or must I be forced to have multiple jobs. This is why voting matters",
   "created_utc": 1703561275,
   "score": 10,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexukcb",
   "message": "Aim higher than a minimum wage job there boss",
   "created_utc": 1703558911,
   "score": 19,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexu8yp",
   "message": "Most people work for more than minimum wage, for starters. Most people working MW may not be able to avoid it without being in a far worse position.",
   "created_utc": 1703558759,
   "score": 4,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kextl6n",
   "message": "Only around 1% of workers receive minimum wage. Many of them may be eligible for social programs. Others may be teenagers who have other expenses covered by their parents. Others may have spouses. For some, it's the only job they can currently land and it's better than nothing.",
   "created_utc": 1703558433,
   "score": 10,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexpz62",
   "message": "don't work there, go work at a better paying job... or don't live in a place with that high rent",
   "created_utc": 1703556727,
   "score": 17,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexpygd",
   "message": "It covers rent if you share it with a partner or roommates.",
   "created_utc": 1703556717,
   "score": 8,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key0agl",
   "message": "You'll at least have some sort of income while you look for a better job.\n\nPlus, being homeless and employed is better than being both homeless and jobless.",
   "created_utc": 1703561623,
   "score": 2,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key1j2e",
   "message": "And that’s Bai Lan.\n\nLet it rot.  Why bother.  If you can get by without having to deal with a day job, remove yourself from the workforce.   Do gig work, live light, have fun.  Minimum wage isn’t worth the hours of life you’ll lose for it.",
   "created_utc": 1703562221,
   "score": 2,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key5032",
   "message": "To figure out your breaking point and at what point you’re willing to steal tiny Tim’s crutches to pawn for more boot straps to pull up.",
   "created_utc": 1703563921,
   "score": 3,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "keyb1tz",
   "message": "Most jobs pay more than minimum wage. Even if you do get a minimum wage job, keep looking for one that pays more.",
   "created_utc": 1703567144,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "keyd9di",
   "message": "You are not meant to stay at minimum wage. Build your skills get promoted or look for better paying work. Actively look to improve your job stop waiting for things to improve themselves.  \n\nBut yes you likely need a roommate",
   "created_utc": 1703568436,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexx48v",
   "message": "To gain skills and experience so someday you make more than minimum wage?",
   "created_utc": 1703560137,
   "score": 4,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key4jra",
   "message": "The world is incredibly unfair.  \n\nIt’s really sad.  Most people who think they made it don’t realize they were born on third base",
   "created_utc": 1703563700,
   "score": 3,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key63pe",
   "message": "I suppose it depends on where you live, but here in the upper Midwest there are plenty (and I mean plenty) entry level jobs (with training) in the industrial sector that offer livable wages with good benefits. It may not be the best hours and you have to make sure you are able to make it to work on time (seems like a major problem with the younger crowd nowadays). But it will get your foot in the door, earn a living and build up your resume.",
   "created_utc": 1703564477,
   "score": 3,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key2n8f",
   "message": "Love how people are giving 💩 to those making minimum wage saying they're lazy, selfish, crazy, etc for expecting to have a decent existence, yet they're not giving 💩 to all those corporations that have had record profits during horrible economic times thanks to their greedflation and price gouging.\n\nIt's amazing how people have been brainwashed. The poor fighting the poor in defending the rich! The world has gone mad",
   "created_utc": 1703562760,
   "score": 4,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexvxws",
   "message": "Get a better job than minimum wage",
   "created_utc": 1703559572,
   "score": 0,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key9l5y",
   "message": "Minimum wage is intended as the stepping stone from a teenager having a job to that same teenager becoming an adult with a career. Minimum wage was never meant to be a living wage. Rather, what the United States as a government entity considers the cheapest legal labor. The idea that minimum wage is the minimum needed to survive is most likely a recent misunderstanding of what it is as well as meant to be.\n\nI could be wrong. If I am, I hope someone brings me some convincing sources.",
   "created_utc": 1703566321,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "keycoxr",
   "message": "Minimum wage was never met to be lived off of its for teenagers to make some money over the summer not to pay rent",
   "created_utc": 1703568096,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexwacm",
   "message": "The concept on minimum wage was for people starting at a job (ie teenagers) - the idea it either you work your way up to a better pay or you go get more education and get a better job... that's not how it works today but that's where it came from",
   "created_utc": 1703559738,
   "score": 2,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key40up",
   "message": "The point of working minimum wage is to make rich people richer. We all need to join unions to stop them.",
   "created_utc": 1703563443,
   "score": 2,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kextka6",
   "message": "What grown adult makes minimum wage?",
   "created_utc": 1703558421,
   "score": 251,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexxrut",
   "message": "Having nothing to do when you live on the street is boring, especially for those of us who practice sober living.\n\nPlus, it gives plenty of reasons to complain, something we all love to do.",
   "created_utc": 1703560451,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexzsk0",
   "message": "My kid works minimum wage while at school for goofing off money.\n\nDuring summer she makes 17-20 working at different places.  I'm not sure why any full-time person would work  for minimum wage.",
   "created_utc": 1703561382,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key62d8",
   "message": "MINIMUM wage\n\nNot LIVING wage",
   "created_utc": 1703564458,
   "score": 255,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexrug5",
   "message": "Ideally, nobody would apply to it and the company would be forced to increase the wage. \n\nHowever, in the real world, people need to eat and live. And sometimes you take what you are able to get. Thats why you see people with 2 jobs, or a side hustle. I prefer crypto as my side hustle.",
   "created_utc": 1703557593,
   "score": 0,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexwup6",
   "message": "Should actually ask yourself why are you still in a minimum wage job",
   "created_utc": 1703560010,
   "score": 255,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexpyv1",
   "message": "Next meal.",
   "created_utc": 1703556722,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexxaqe",
   "message": "I mean technically, it's a stepping stone. Work one now and gain experience and you can get a better job later. But it sucks. It really does",
   "created_utc": 1703560221,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key64ms",
   "message": "\"Minimum wage\" used to mean the minimum for a person to love on and provide for a family, but somewhere along the way it became \"the minimum they can pay you legally but if it were up to the business they'd actually pay much less.\"",
   "created_utc": 1703564490,
   "score": 2,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "keya7fs",
   "message": "According to Republicans, you need to get a better job.",
   "created_utc": 1703566669,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "keyaami",
   "message": "Don't work for minimum wage",
   "created_utc": 1703566722,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "keyb91r",
   "message": "Don't work minimum wage. \n\nOr if your only option is minimum wage, then get roomates, live with parents or whatever you need to survive, while you can find something better. But think about your situation as temporary and actively try to find a better job.",
   "created_utc": 1703567254,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "keybc4t",
   "message": "LOL, maybe get your skills right before trudging into another minimum wage jobs.",
   "created_utc": 1703567301,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key4wsf",
   "message": "Had plenty of entry level jobs. None of them pay min wage. Actually work",
   "created_utc": 1703563877,
   "score": 0,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key59o5",
   "message": "Minimum wage jobs aren’t for people who need to work to live. Teenagers, significant others working for extra cash, retirees etc. learn a bankable skill and get paid more.",
   "created_utc": 1703564054,
   "score": 255,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key8y5r",
   "message": "Minimum wage isn't designed to cover rent. Minimum wage is designed for teenagers living at home to gain basic job skills to enter the work force. If you're paying your own rent you need to find a job paying more than minimum wage. This is a workers economy right now, it shouldnt be difficult.",
   "created_utc": 1703565971,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexv23g",
   "message": "To increase shareholder value ofc :)",
   "created_utc": 1703559143,
   "score": 1,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexq9w0",
   "message": "Learning from the bottom up. Once you reach the top, you’ll be an expert and worth more than anyone else at the company",
   "created_utc": 1703556871,
   "score": 253,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "kexxsa6",
   "message": "To get the experience to no longer have zero skills. You get what you’re worth.",
   "created_utc": 1703560456,
   "score": 253,
   "submission_id": "18qx451"
  },
  {
   "comment_id": "key0ykd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qx451"
  }
 ]
}