{
 "submission_id": "18qyf13",
 "title": "What is it that you invested thousands of hours and now is pointless?",
 "selftext": "",
 "created_utc": 1703560810,
 "permalink": "/r/AskReddit/comments/18qyf13/what_is_it_that_you_invested_thousands_of_hours/",
 "score": 165,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qyf13/what_is_it_that_you_invested_thousands_of_hours/",
 "comments": [
  {
   "comment_id": "kexz2la",
   "message": "20+ years of guitar. I have carpal tunnel and can no longer play.",
   "created_utc": 1703561036,
   "score": 21,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key5xg3",
   "message": "Business degree. Got into management and found out that I fucking hate business",
   "created_utc": 1703564391,
   "score": 144,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexz9f3",
   "message": "Developing film and making prints in a darkroom.",
   "created_utc": 1703561127,
   "score": 237,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexzix2",
   "message": "Marriage\n\n(Sad Trombone)🫤",
   "created_utc": 1703561256,
   "score": 132,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keycyg3",
   "message": "In the 90s I worked (7 straight years I ain't doin the math on the hours) in live radio broadcasting. Hit radio. Niche genre but hit format. I spent 4 hours minimum 6 days a week manually loading CDs into cue players, hitting buttons to play them and pulling sliders on sound boards to segue from song to jingle to song. I was really, really fucking good at it. My segues were flawless. Never a milisecond of dead air. I could read a live weather forecast and current temperature in 17 seconds or less. I was that jerk DJ who talked through the intro of the song you were trying to record on your boom box. I really wanted to make it my career, I loved working this side of the music industry.\n\nBy 2002 most hit radio stations in all but the smallest markets were being sold to satellite conglomerates. Those that weren't had everything but the voice pre-loaded into a computer that did the segue for you. Radio is a sad, sad shell of what it used to be and I'm lucky I got out in '99 before everything started going south. There was an actual skill involved that required practice and refinement, and split-second live improv, that just can't be recaptured. It's useless skill that I wasted on an industry that collapsed in the '00s. At best, I can use my fly editing skills to make good video clips but even that's being automated to where hands-on skill isn't in demand.",
   "created_utc": 1703568254,
   "score": 218,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key3aie",
   "message": "Pokemon games on the ds/3ds. I use to breed competitive pokemon and shiny pokemon. With the new generation changes and limitations, many of them can't be imported or used. A huge portion of my collection is stuck in pokemon home and it's only a matter of time they all get deleted because they can't be moved.",
   "created_utc": 1703563082,
   "score": 178,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexzxfo",
   "message": "Attempting to reach the highest rank in pvp modes of sports games such as 2k or fifa. You reach rank 1 and it literally means nothing but that you play good and beat your peers. But drops back down as each new game approaches so it’s very pointless. But nevertheless I play the fuck outta it",
   "created_utc": 1703561447,
   "score": 54,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexzasl",
   "message": "Pokémon Go…..too many cheaters and I work too much to maintain it anymore",
   "created_utc": 1703561146,
   "score": 146,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key1bvt",
   "message": "Archery. Spent years trying to make it to national level, got really close too. Did my shoulder, can't shoot anymore",
   "created_utc": 1703562121,
   "score": 130,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexz2o9",
   "message": "Played online poker for a living for 15 years, studied everything I could get my hands on, then ran out of cash. Haven't played in 5 years, pretty sure every site is infested by AI poker bots.",
   "created_utc": 1703561037,
   "score": 34,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keybrpt",
   "message": "My PhD... I dropped out after 4 years.",
   "created_utc": 1703567547,
   "score": 111,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexz4jd",
   "message": "What do you mean by \"Pointless?\" I played World of Warcraft a lot, raided a lot, and eventually stopped. It wasn't pointless though, because I had fun doing it.",
   "created_utc": 1703561061,
   "score": 84,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyd3ij",
   "message": "I have adhd. lots of stuff I hyper fixated on tha no longer interest me",
   "created_utc": 1703568340,
   "score": 220,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key5jgv",
   "message": "Relationships with people I later regretted having",
   "created_utc": 1703564191,
   "score": 81,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexynwy",
   "message": "I got a B.S. in biochemistry, then drove a forklift for 14 years. Now I am an electrician.",
   "created_utc": 1703560852,
   "score": 77,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key7ivt",
   "message": "Scuba diving. Thousands of hours of training and experience, down the drain thanks to a lung injury.",
   "created_utc": 1703565213,
   "score": 75,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyhwmu",
   "message": "So there was this game called Eve online:.. we don’t talk about it anymore",
   "created_utc": 1703571432,
   "score": 32,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key3whq",
   "message": "I spent 10+ years learning how to draw, worked as an illustrator for a bit and realized I hated it. I'm not even a particularly good artist. Now I work as a software developer and occasionally doodle for fun.",
   "created_utc": 1703563385,
   "score": 100,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key8qkl",
   "message": "I'll of my awesome skills at picking up chicks are useless now that I'm married.",
   "created_utc": 1703565855,
   "score": 68,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyjqal",
   "message": "25000 hours in world of Warcraft (I made the mistake of adding it all up lol). I don’t really regret it or count it wasted, bc I made some cool friends and had good times. At one point WoW genuinely saved my life by providing a much needed escape at an extremely dark time. But god damn it why couldn’t I have picked something more practical lmao",
   "created_utc": 1703572711,
   "score": 23,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key7i1g",
   "message": "I worked in a very specialized field for 15 years. Now I’m disabled and can’t work in that field. Everything I know is useless.",
   "created_utc": 1703565202,
   "score": 41,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyiz6n",
   "message": "Neopets.\n\nI had a really good time though and have fond childhood memories of it. I also learned a decent amount about money and the economy from it, strangely. It was not an educational game, but there are many things that I look back at and realize I learned about them because of Neopets.",
   "created_utc": 1703572177,
   "score": 29,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key5v2w",
   "message": "Years ago… world of Warcraft… glad I quit",
   "created_utc": 1703564358,
   "score": 14,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyl28g",
   "message": "I want to tell everyone that investing hours into something that you can still enjoy right now isn’t “pointless” \n\nFinding things that makes you happy is literally the point of life. \n\nThis question more relates to thing you can either 1) no longer do because of circumstances or 2) something you know how to do but the usefulness of it is no longer relevant \n\nDo what you love and never let anyone tell you it’s pointless to find enjoyment in life",
   "created_utc": 1703573696,
   "score": 38,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexytj8",
   "message": "Vb6",
   "created_utc": 1703560921,
   "score": 23,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexzk0f",
   "message": "Stardew Valley",
   "created_utc": 1703561270,
   "score": 24,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key95lc",
   "message": "I dedicated thousands of hours to perfecting a specific software skill, only to find that the industry shifted towards a different technology.",
   "created_utc": 1703566084,
   "score": 23,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keygj6x",
   "message": "Grinding for hours to unlock or trade for skins and items for games I haven’t played in years, at least I had fun for the most part tho",
   "created_utc": 1703570516,
   "score": 12,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key6zpu",
   "message": "I don’t know about thousands, but I was obsessed with HTML as a teenager and building websites in my free time. They were never live, I just saved them to floppy disks, as you do. \n\nTook a computer class for fun  in college and the teacher strictly forbade me from using HTML since it is obsolete. So whatever four years of teenager free time adds up to, all that wasted.",
   "created_utc": 1703564938,
   "score": 43,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key2u5v",
   "message": "Ex wife",
   "created_utc": 1703562855,
   "score": 24,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyahh7",
   "message": "Life🫠",
   "created_utc": 1703566833,
   "score": 22,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyqbdl",
   "message": "Learning how to do flash animations and ActionScript throughout all of high school and partially university.\n\nThen the world unanimously decided to cancel flash.",
   "created_utc": 1703577870,
   "score": 10,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyksvf",
   "message": "Guitar Hero. If I'd dedicated the time I put into that game into learning a real guitar...",
   "created_utc": 1703573501,
   "score": 18,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keytozt",
   "message": "Nothing is pointless if you find joy in doing it.",
   "created_utc": 1703580733,
   "score": 9,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keygihn",
   "message": "Going to church as a kid/young adult. Spend on average maybe 10 hours per week for about 25 years. It wasn't all bad, but overall a pointless exercise because it turns out I don't believe in god.",
   "created_utc": 1703570502,
   "score": 36,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key752d",
   "message": "Runescape",
   "created_utc": 1703565016,
   "score": 14,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyepk7",
   "message": "had a pretty extensive education in programming and since finishing school i've been in other areas of IT that have nothing to do with programming.",
   "created_utc": 1703569330,
   "score": 7,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyah97",
   "message": "Video games",
   "created_utc": 1703566830,
   "score": 8,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyb61v",
   "message": "Sports. \n\nFootball from 11-18, (from which I probably developed some mild CTE), and baseball from 5-21. \n\nI could’ve learned another language, how to play an instrument, a trade, or anything in that amount of time.",
   "created_utc": 1703567208,
   "score": 11,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexzcdv",
   "message": "Ah, college, man! Spent thousands of hours hitting the books, and now I'm just out here telling jokes! That's what happens when the investment doesn't match the return!",
   "created_utc": 1703561167,
   "score": 32,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key8ehc",
   "message": "Spent countless hours completing designations and certifications that I don't use anymore.  And they never gave me any \"edge\" in the job market.",
   "created_utc": 1703565671,
   "score": 10,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyeqgq",
   "message": "I devoted my life to learning the art of making luxury glass bongs. Now I can't break even on one.",
   "created_utc": 1703569345,
   "score": 9,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key0gq2",
   "message": "15 years of Yahoo Pool... I became the Greatest of all time for Yahoo to close it down in 2014.",
   "created_utc": 1703561705,
   "score": 5,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key23tk",
   "message": "Free throws.",
   "created_utc": 1703562500,
   "score": 4,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kez786n",
   "message": "My Master's degree. Companies are now requiring certificates.",
   "created_utc": 1703591945,
   "score": 5,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key2hdt",
   "message": "I got into mobile games like star trek fleet command and the whole time playing them i didnt stop to think how fucking awful and not fun it was. Ive yet to play a mobile game that is truly fun in my entire life.  Its all just \"grinding\" with very little pay off then they want you to spend an absurd amount of money to advance.",
   "created_utc": 1703562680,
   "score": 9,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key6co9",
   "message": "Some of stocks plunge after a while left without being touched.",
   "created_utc": 1703564605,
   "score": 5,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key6t9p",
   "message": "My college degree.",
   "created_utc": 1703564846,
   "score": 5,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key84we",
   "message": "College",
   "created_utc": 1703565528,
   "score": 4,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key9836",
   "message": "My ex husband.",
   "created_utc": 1703566122,
   "score": 4,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyhnvl",
   "message": "Reddit",
   "created_utc": 1703571265,
   "score": 4,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyr7t7",
   "message": "I carefully and meticulously updated all my ID3 tags on my expansive MP3 collection.\n\nI’m talking artist name, album name, album year, song title, album artwork, etc. It was beautiful and I even wrote an app to help visualize the whole collection.",
   "created_utc": 1703578619,
   "score": 4,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key5eto",
   "message": "Honestly, I went to catholic school K-12. Had religion class every day. Took a world religions class in college. Still don’t remember shit about my religion.",
   "created_utc": 1703564126,
   "score": 10,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kexzkhr",
   "message": "Probably my MSW.",
   "created_utc": 1703561276,
   "score": 7,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key3si1",
   "message": "a narcissitic mother and narc boyfriends",
   "created_utc": 1703563330,
   "score": 6,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keypdhn",
   "message": "Nothing. If we consider that every part of life is to set the stage for what's about to come next, nothing is truly pointless. It comes down to what we value more and the choices that are available to us at that time.\n\nAnd just because we don't value now what we did in the past, doesn't make that activity pointless, because that could be perceived instead as growth and change of perspective.",
   "created_utc": 1703577091,
   "score": 6,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key7hdm",
   "message": "My ex husband.",
   "created_utc": 1703565192,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyc8jx",
   "message": "My life.",
   "created_utc": 1703567826,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyd64x",
   "message": "Arithmetic with pre-decimal currency and imperial measures. £17 13s 11d divided by 7 to the nearest farthing. 4 gal 6 pints and 7 fl oz. Ugh.",
   "created_utc": 1703568383,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyehhu",
   "message": "FF14",
   "created_utc": 1703569191,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyfo97",
   "message": "Student athlete. I'm retired and don't do my sport anymore. \n\nDefinitely value in the experience, but the actual skill of what I did is useless.",
   "created_utc": 1703569947,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyj1uj",
   "message": "call of duty over the past 15 years or so. i’ve played so many thousands of hours competitively just for fun, i haven’t played in a couple years but could probably hop right back on and continue clapping cheeks just based off muscle memory. an incredibly useless thing to be top .01% in the world at.",
   "created_utc": 1703572229,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyjfrz",
   "message": "more like 20 years \u0026amp; countless hours being in retail management…total friggin waste. It pays crap. In my case I got transferred every year or 2 so no way to buy a home or plant roots. I’m good now with a whole new career/wife/home but damn those 20 years were a total loss lol",
   "created_utc": 1703572506,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keynnue",
   "message": "RuneScape. But you never really quit… so I’ll be on again later today. Took a nice 12 hour break.",
   "created_utc": 1703575707,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keysw2i",
   "message": "Porn",
   "created_utc": 1703580039,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyvakv",
   "message": "You know, I was in a slump for a while about this: I’ve been composing music for about 22 years. To date I think I’ve sold maybe 15 albums. I had a pretty good following on SoundCloud back when the site first started but I took way too damn long releasing my first album because I am foolishly a perfectionist and by the time I released it SC was dead and the genres I wrote fell out of favor. I also go back once every few years and listen to my first album and it is definitely far from perfect and I should have just released it. It felt like a giant waste of time. \n\nThen it dawned on me a few years ago that I love writing music and fulfilling the need to create is very important. Now I’m back in it and love it again despite just writing for myself.",
   "created_utc": 1703582109,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kez1yvl",
   "message": "I used to love to skateboard and have skated for years since I was 11. I'm 33 now and haven't skated in years.",
   "created_utc": 1703587781,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kez6tim",
   "message": "Trying to get my first crush into the sack... gave up after 30 years.",
   "created_utc": 1703591631,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kez7h08",
   "message": "My degree, \nMy marriage",
   "created_utc": 1703592131,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "kez84uk",
   "message": "My relationship to my ex",
   "created_utc": 1703592617,
   "score": 3,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "keyh0mb",
   "message": "Golf, since my cunt-of-a-stepmother is going to push my father to move to Florida the second she retires and the majority of her family is down there. \n\nSuffice to say, she's the devil incarnate. My dad had a small heart attack months ago and she, not jokingly, said to the paramedics, \"He can't die, I have no one to cook for me.\" Dad's in denial, saying she was joking.\n\nShe'll put him in a home as soon as it's convenient.\n\nShe has her sister where we currently live and that bitch will move to Florida eventually as well.\n\nMy friends are not athletic. I only play golf with him. They know my feelings on them moving (I live on my own) and it doesn't matter.\n\nAlso found out my brother is moving to Florida separately so I'm pretty fucking depressed. \n\nSo, yeah, golf.",
   "created_utc": 1703570830,
   "score": 5,
   "submission_id": "18qyf13"
  },
  {
   "comment_id": "key6kde",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qyf13"
  }
 ]
}