{
 "submission_id": "18qzj7h",
 "title": "What rumor in your school turned out to be true?",
 "selftext": "",
 "created_utc": 1703564445,
 "permalink": "/r/AskReddit/comments/18qzj7h/what_rumor_in_your_school_turned_out_to_be_true/",
 "score": 109,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qzj7h/what_rumor_in_your_school_turned_out_to_be_true/",
 "comments": [
  {
   "comment_id": "key6841",
   "message": "Oh man, so there was this gossip going around about our quiet math prof being in a rock band. Everyone thought it was just a silly story, right? Turns out, he's actually the lead guitarist in this low-key indie group. Blew our minds when we spotted him at a local gig shredding it on stage! 🎸",
   "created_utc": 1703564540,
   "score": 76,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key815h",
   "message": "That this girl everyone called \"the giraffe\" because of her really long neck was having an affair with a professor (small college). He was a fairly known poet (I mean, fairly known, for a *poet*, mind you). He was also married and so was she, though she was maybe 22? They both disappeared for a while and then turned up married to each other in East Anglia.",
   "created_utc": 1703565473,
   "score": 96,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key7bl5",
   "message": "A married teacher was cheating on his wife with a female student. Teacher left his wife and kids, lost his job and the female student dropped out of school.",
   "created_utc": 1703565110,
   "score": 83,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyo3wm",
   "message": "Rumour was, one of our hs phys ed teachers was a roaring drunk. Totally true: about ten years after i had last attended he got busted sleeping in a storage room in the school. He'd go straight from last call at the bar, break into the school, \u0026amp; have a nap 'til awoken by the PA system doing morning announcements. Cops figured out just who it was breaking in all the time and basically stood back \u0026amp; let him get caught by custodial staff as he got increasingly bold.",
   "created_utc": 1703576066,
   "score": 115,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keym8l8",
   "message": "There was in fact a secret pool table in the dark scary basement of my elementary school",
   "created_utc": 1703574595,
   "score": 110,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyeboh",
   "message": "My school had a very successful marching band; they won state championships virtually every year, and even placed highly at nationals most years. \n\nThe rumor was that the band director was banging his students, and that certain coveted positions (drum major, for instance) were selected via a “casting couch” of sorts. \n\nA few years after I graduated, it came out that all of the rumors were true. The band director was fired (though I don’t believe he faced any legal repercussions), and that schools band hasn’t won a damn thing since.",
   "created_utc": 1703569090,
   "score": 50,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keydb88",
   "message": "I asked my daughter what stories were going around and she told boring stuff like a fellow a couple of years ahead of her had gotten a young girl pregnant. Plot twist - the fellow was her older brother, and several months later we found out it was true (guess I shouldn’t have laughed it off and forgotten it).",
   "created_utc": 1703568468,
   "score": 228,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keylvdd",
   "message": "Female volleyball coach was having an affair with female superintendent whose husband also worked for the school district. Superintendent also did some shady money shit (can’t remember exactly but she was definitely using school funds for personal use). She ended up leaving before they could fire her and now works for a different district. She’s still married to her husband.",
   "created_utc": 1703574315,
   "score": 68,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyiamd",
   "message": "I heard whispers the first week or so of freshman year my locker mate (too many students, too few lockers) was secretly selling drugs out of our locker as we were pretty far away from the main drags where the teachers monitored the hall. That said, my school had an IEP set up for me where within the week, it took effect and I was moved to a single locker.\n\nLo and behold, near the end of the second semester, they found a small-ish stash of drugs in my old section of the locker that obviously was not there when I was there. Kid was kicked out, and I suspect I was saved from this guy trying to blame me.",
   "created_utc": 1703571697,
   "score": 118,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyh6pj",
   "message": "My senior year of high school (2016), we all thought that our female English teacher was having sex with one of our 17-year-old male classmates. It started out as a joke among the kids because we noticed they were a little too close. But right after we graduated in the spring, the news came out that our predictions were in fact true. She got arrested, etc. It was jarring, but at the same time satisfying because we were right.",
   "created_utc": 1703570944,
   "score": 140,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keybe4k",
   "message": "One of our teachers was rumored to drink on the job and spike his coffee. Once when he stepped out of the room someone ran up and rooted around his desk. They found a hidden flask and held it up for all to see and then put it back. As far I know no one ever ratted him for that.",
   "created_utc": 1703567331,
   "score": 193,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez5crv",
   "message": "That we had tunnels under the school. You’d randomly hear noises or smell cigarette or weed smoke in the school and nobody knew where it was coming from. \n\nAll the band kids knew it was true because the hatch was in the middle of the storage room and of course we went down there. Fuckin Charlie ruined it though. He went in, smoke a bunch of weed, got too high to remember how to get out, and was screaming under the math classroom for two hours until the fire department got him out. They blocked the tunnels off and as far as I know nobody has been down there yet",
   "created_utc": 1703590505,
   "score": 86,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyrzar",
   "message": "That I’m gay",
   "created_utc": 1703579263,
   "score": 113,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key9eyk",
   "message": "Devon shot his dad and ended up in an institute.",
   "created_utc": 1703566228,
   "score": 33,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keygnep",
   "message": "Pete really was pounding our English teacher in her Honda Civic.",
   "created_utc": 1703570593,
   "score": 40,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyjcfg",
   "message": "My old high school had an actual secret website of girls nudes, and raunchy pictures on it. Made the news in Chicago spanning back to when I was in high school. (2007-2011)",
   "created_utc": 1703572440,
   "score": 61,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyj9b5",
   "message": "A teacher sleeping with a student. He was her phone wallpaper lol. He was arrested and his wife for some reason stood by him in court.",
   "created_utc": 1703572377,
   "score": 33,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyt39e",
   "message": "In the science lab there was a little jar of white powder in the glass cupboard, everyone was making jokes about it being cocaine. Later that year the maths teacher was fired on account of being under the influence while teaching and hiding drugs in the science lab.",
   "created_utc": 1703580215,
   "score": 32,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keylost",
   "message": "The chemistry teacher was sleeping with a student. She moved in with him after graduation. \n\nCreepy classmate was raping his younger sister. His parents called me which was strange because I don't think I ever gave him my number. One time he snuck into my house when I walked home and hid. Thankfully my Doberman bit him in the ass. He thought it was funny and I was too young/scared to speak up.",
   "created_utc": 1703574175,
   "score": 87,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyrgza",
   "message": "There were scandalous rumors about a female student and male band director.\n\nThey got married about a year after she graduated and AFAIK are still married 20+ years later.",
   "created_utc": 1703578833,
   "score": 25,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keytvtq",
   "message": "During the handover thing of the new principal, word was going around that he’s a bit of a creep. Rumor had it that he got transferred here from his previous school due to him being involved in some very weird shit in his previous school\n\nApparently he did turn out to b somewhat of a creep….cuz 10 different (female) teachers came forward w/ sexual harassment allegations against him\n\n^(fwiw the cops didn’t believe them so nothing happened \u0026amp; the teachers just got fired)",
   "created_utc": 1703580897,
   "score": 25,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key99ow",
   "message": "My elementary school was a couple of blocks away from an overpass and every year they would tell kids the tale of the boy who fell off of it trying to spit on cars. When the principal told my class he pointed to me and asked me to confirm the story because that kid was my older next door neighbor.  The kid was decapitated by the car that hit him and the driver of that car was decapitated when he got out to try to help him. My cousin was that poor kids partner in crime and saw the whole thing. It ruined his life.",
   "created_utc": 1703566147,
   "score": 117,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez8uub",
   "message": "Not bad like these other ones, but there was a rumour for years that these two history teachers were dating. Within the time I was at high school, they then got engaged, got married, and had two kids. Everyone loved them so it was so cute. Everyone was really invested in their relationship in the best way. They’re still together as my friend sometimes sees them when she’s at work and they come into her store.",
   "created_utc": 1703593132,
   "score": 20,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keybh1q",
   "message": "Shop teacher was a pothead. \n\nRumor confirmed when his stash was found. Nobody narc'd, they all got A's.",
   "created_utc": 1703567375,
   "score": 58,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keypsc3",
   "message": "That a teacher was a major stoner: turned out he had a medical card and even hot boxed the teacher's lounge once.",
   "created_utc": 1703577435,
   "score": 20,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezqu3i",
   "message": "A girl in our class got pregnant in the first month of high school. She named the guy but he was a popular athlete and he said she was a liar. He was so well liked that the popular girls bullied her until she ended going to a different school for the rest of highschool.  The guy ended up getting 3 of the popular girls pregnant with a total of 5 children before he graduated.  ANyway, I worked with the first girl a few years later and learned he had raped her on her first date. SHe showed me a picture of the baby, spitting image of the guy.  People are horrible.",
   "created_utc": 1703603150,
   "score": 16,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyjees",
   "message": "A teacher was sleeping with a sixth form student. A lot of people were already gossiping because she was fairly friendly with all the male students while being distant to all her female students. Turned she'd gotten pregnant to the sixth form student and was fired just before my year's GCSEs (she was our English teacher). So many people flopped the course because the teacher that replaced her was shit.",
   "created_utc": 1703572479,
   "score": 17,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keybfdv",
   "message": "Said teacher/asst football coach was sleeping with the cheerleaders. 5 were pregnant on graduation day. He was recently jailed for CSAM. 😩",
   "created_utc": 1703567349,
   "score": 43,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyi2pi",
   "message": "Spanish teacher was banging male students on study abroad trip to Spain. She was also caught drinking/drunk at school multiple times but never fired. Apparently hooking up with students was the red line. \n\n\nDon’t think she was ever formally charged with anything because she was young and pretty. And there were a bunch of red flags that the school/district ignored which would have made them look more incompetent.",
   "created_utc": 1703571548,
   "score": 27,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyvjpn",
   "message": "I had a female friend give me an old fashioned one day after school. The next day she went in and told everyone I had a gigantic dong. By the end of the day the entire school had heard it. There are much worse rumors to have circulate about you.",
   "created_utc": 1703582330,
   "score": 30,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezg3bi",
   "message": "The school’s priest would make jokes about how “there’s candy in my office *wink* *wink* *nudge* *nudge*. Don’t worry I won’t bite.” \n\nWhole school would laugh at his joke.\n\nWellll anyways it turned out to be true and someone got diddled. \n\nPriest got arrested and killed himself awaiting trial.",
   "created_utc": 1703597686,
   "score": 13,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyqe8a",
   "message": "90% of these are gonna be stories about teachers banging students.\n\nAnyway so at my high school there were rumors that one of the Spanish teachers was doing drugs. he was arrested early in my 10th grade for, you guessed it, drug possession. later found out that he was in jail in the past for drunk driving and breaking \u0026amp; entering into his ex wife's house.",
   "created_utc": 1703577936,
   "score": 43,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyt4pc",
   "message": "There were rumours that a teacher was close to (kind of a mentor to me and a few others) was sleeping with a student. Nothing was ever proven, everything was denied and we all kind of moved on. 20 years later, the teacher has plead guilty to sexual assault charges against one of his students, making us all rethink what might have been happening back when we were in high school",
   "created_utc": 1703580250,
   "score": 9,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keygf7b",
   "message": "I really did have a permanent record.",
   "created_utc": 1703570443,
   "score": 22,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyndwr",
   "message": "Biology/gym teacher was growing weed, he got fired for reasons (growing weed) the year after we graduated.",
   "created_utc": 1703575486,
   "score": 8,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez15x8",
   "message": "That the Dean's son banged my girlfriend while I was on holiday.",
   "created_utc": 1703587114,
   "score": 9,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyvoiu",
   "message": "In 12th grade, there was a rumor that a teacher/coach was molesting students.  Soon after, my government teacher was replaced by a substitute.  She was the girls' volleyball coach, and she molested a member of the team.\n\n\u0026amp;#x200B;\n\nShe got a plea deal that only got her sent to jail for a year.",
   "created_utc": 1703582441,
   "score": 8,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez5u3y",
   "message": "At my school the male Russian teacher, married to a junior school teacher, was having an affair with, and then shacked up with, the male IT teacher. It was pretty awful and she passed away from illness just a couple of years afterwards.",
   "created_utc": 1703590878,
   "score": 8,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez6fam",
   "message": "That the band director was a pedophile. It was a rumor that came out because some students didn’t like him. Well fast forward 7 years later he’s arrested for child pornography. Now, the good news is none of it(that we know of) was of the students nor did he do anything to any student he worked with. The bad news is, well everything else.",
   "created_utc": 1703591334,
   "score": 8,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyzsxx",
   "message": "That one student dropped out because they were going hard on the drugs and alcohol and then fathered two kids before they were 17.\n\nThe kids part was just rumors and I’ve cleaned my act up re the drugs \u0026amp; booze.",
   "created_utc": 1703585973,
   "score": 13,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez5yqv",
   "message": "My principle my freshman year was sleeping with a student.",
   "created_utc": 1703590980,
   "score": 6,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key8d6a",
   "message": "There was a teacher that was accused of sexual assault after a cheerleader from another school passed out and he “preformed,” cpr. He continuously proclaimed he was innocent until one day he stopped showing up to school and everyone’s parents received a phone call about him being terminated",
   "created_utc": 1703565652,
   "score": 16,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyev8p",
   "message": "10ish years after graduation a woman told me she slept with the history teacher/ volleyball coach to get a's. She said she wasn't the only one. She had no reason to lie about it so I guess it's true. He married the 11th grade math teacher. Hands down the hottest teacher you can imagine.",
   "created_utc": 1703569429,
   "score": 18,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keygh4l",
   "message": "That shitty dick Claudia actually did shit on a guys dick.\n\nAnd heroine Heather actually was a heroine addict",
   "created_utc": 1703570477,
   "score": 20,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez6na7",
   "message": "Fiona was cheating on Scottie with a Vocalist from a Rock Band\n\nEveryone knew but were told ”Don’t tell Scottie, Scottie doesn’t know”",
   "created_utc": 1703591500,
   "score": 12,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key6y19",
   "message": "There was a rumor that a local woman was being held hostage as a bed ridden cripple. The whole town apparently knew that she was being used for sex. The gangs covered it up by having another woman use her identity. A bunch of women were jealous of her because she was skinny, and a lot of guys thought she was cute. While she was being held hostage, some other woman was being crowned homecoming queen her senior year, while using her identity.",
   "created_utc": 1703564915,
   "score": 27,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key6568",
   "message": "Bella was dating 5 different guys",
   "created_utc": 1703564497,
   "score": 15,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezcjej",
   "message": "Oh my school was a hotspot for this kind of story lol. \n1. The band teacher was rumored to be sleeping/screwing around with his male students in the band for years…turns out that was true and he was finally fired right after I graduated \n2. When I was a sophomore, an ag teacher was politely asked to resign over a legitimate romantic relationship with a senior girl. They weren’t even trying to hide it because she was 18 and he had never been HER teacher. \n3. There’s more but the best one is that when I was a freshman, an English teacher was well-known to be sleeping with the assistant principal. Both were married with children and they had been caught before. They’d been caught the year before by his older daughter who went to the school, and to keep her quiet he sent her to another school under the pretense that she was a troubled kid.",
   "created_utc": 1703595574,
   "score": 6,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keztyg9",
   "message": "That our 24yo female French teacher was a stripper at an all-nude strip club.  Aaaaaand, yes, there she is on the main stage.  It’s true.  11th grade high school.",
   "created_utc": 1703604565,
   "score": 5,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keympa0",
   "message": "Shop teacher (married) and math teacher(single) were bangin it out on the regular. A year after I dropped out it all came to light. Lots of rumors while I was in school. They were regularly hanging out in eachothers rooms, always talked about spending weekends together hiking and such. Was pretty obvious",
   "created_utc": 1703574955,
   "score": 12,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keylomt",
   "message": "The security guy walking the halls wasn't there for us but a narc against us lol",
   "created_utc": 1703574172,
   "score": 8,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keypb9i",
   "message": "some guy ate a girls ass in the janitors closet because he wanted her rice krispie treat… there was a video",
   "created_utc": 1703577041,
   "score": 8,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyx8sa",
   "message": "Two married teachers were having orgy parties with students. A video posted on facebook was revealed at the husband's court trial for statuary rape. Somehow, he still got away with it.",
   "created_utc": 1703583786,
   "score": 4,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezh1ii",
   "message": "Our junior high (now called middle school) math teacher always kept this one kid who everyone thought was gay after class. Everyone thought something strange was going on, but we couldn’t figure out what. Some kids were saying she was having sex with him. Then one day several of us were visited at home by a detective. The detective asked us if we knew about anything strange going on with this kid and the teacher. A week later she’s working at Hardee’s and her husband (the science teacher) divorced her. So I’m guessing that one was true.",
   "created_utc": 1703598211,
   "score": 4,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key7xm1",
   "message": "The football team is trash garbage",
   "created_utc": 1703565422,
   "score": 7,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyw0sm",
   "message": "The groundskeeper did in fact sell drugs to students and was fired for it.",
   "created_utc": 1703582728,
   "score": 3,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez9cd1",
   "message": "Bumming in the old PE block and this one’s really dark, a group of guys raped one of their old friends with a dog and filmed it.",
   "created_utc": 1703593472,
   "score": 3,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyzqms",
   "message": "The girl who was always hanging out in the environmental science class between classes was sleeping with the teacher\n\nAnd sure enough he had been sleeping with her and another student as well. He got fired and charged. The teacher was fairly young, late 20s/early 30s, and both girls were around 18. No one was surprise when he was missing at the start of the second semester. His mugshot still pops up on google when you search our high school\n\nIt honestly kinda sucked because he was an awesome teacher and coach and his replacement wasn't good at either",
   "created_utc": 1703585922,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezcovh",
   "message": "The principal and one of the math teachers were having an affair. They were caught banging on her desk one night by the janitor. He quit and she got to keep her job.",
   "created_utc": 1703595670,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezdbpn",
   "message": "Our math teacher had been in Playboy in the 70s",
   "created_utc": 1703596056,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezdzj7",
   "message": "Jenni was banging the young English teacher, and the men's swim coach was touching inappropriately - boys and girls\nLast i heard, he lost everything when he was arrested. This was the 80s, so he probably got a slap criminally",
   "created_utc": 1703596460,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezkdjv",
   "message": "A drama teacher at my high school used to invite students to her house for parties and underage drinking. The students knew what was going on, but most parents just thought it was a rumor. One of the students she invited ended up reporting her and it made it to our local paper. She lost her job but didn't get arrested cause all the students were 18 yrs old",
   "created_utc": 1703599980,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezm7is",
   "message": "The rumor was that of our gym teachers was a pro wrestler on the weekends. \n\n….so we just asked him and sure enough, he was a pro wrestler. He worked local backyard and tiny indie shows.",
   "created_utc": 1703600906,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezxuc4",
   "message": "Female health teacher was raping a student on the regular, nobody knew for sure until the kid tried to kill himself and told his parents.  She got fired, lost her teaching license, got divorced and lost custody of her kids, but was acquitted of criminal charges on a \"lack of evidence\" which really means her dad was the assistant principal and he interfered in the investigation to benefit her.",
   "created_utc": 1703606220,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kf006zw",
   "message": "The French immersion teacher really was sleeping with her students.",
   "created_utc": 1703607196,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kf00rbz",
   "message": "A science teacher was infertile and was adopting a pregnant student’s baby.",
   "created_utc": 1703607428,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kf02s02",
   "message": "That I was pregnant. In the grand scheme of things though, at least it was by a same age bf and not a teacher based on some of these stories.",
   "created_utc": 1703608256,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez23kp",
   "message": "Catholic boys school. The Headmaster and a number of teachers were Pedos, as rumoured.",
   "created_utc": 1703587885,
   "score": 2,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyaoi4",
   "message": "A girl sent nudes to most of her classmates through group chat.",
   "created_utc": 1703566946,
   "score": 4,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key8gas",
   "message": "That my brother was fucking the sexy new math teacher.",
   "created_utc": 1703565698,
   "score": 4,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kf0376y",
   "message": "Male Teacher touched girls. Many years later same teacher gets arrested after a few of his victims came out on it.\n\nTeacher got a lengthy sentence in prison",
   "created_utc": 1703608429,
   "score": 1,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez1t7k",
   "message": "The RE teacher (a hot woman in her 30s) sleeping with the Literature teacher. Both were married at the time.\n\nThe Ancient Greek teacher being a bit too friendly with good-looking female students. He had married one already and had affairs with a few more. Extra grades were given to female students wearing revealing outfit during oral tests at his desk.\n\nPhilosophy teacher popping pills and smoking weed with her \"inner circle\" after class.",
   "created_utc": 1703587654,
   "score": 1,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyng4b",
   "message": "That the principal's son (who is also my classmate), had sex with both genders. He had sex with the boy in a different house but definitely close to his house. He had sex with the girl in a hotel when the families were on vacation and a year later the girl got hit by a truck and died...",
   "created_utc": 1703575533,
   "score": 252,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key69zr",
   "message": "Tf",
   "created_utc": 1703564566,
   "score": 248,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyghj3",
   "message": "Artistes her was an alcoholic",
   "created_utc": 1703570485,
   "score": 255,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez4fm9",
   "message": "The IT teacher actually was a nonce and had cameras in his pens which he used to film boys in the shower",
   "created_utc": 1703589776,
   "score": 0,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezcwrn",
   "message": "That the vice principal was sexually assaulting young boys.",
   "created_utc": 1703595806,
   "score": 0,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezde7x",
   "message": "“I heard you were a rapist” nah nah I’m kidding",
   "created_utc": 1703596099,
   "score": 0,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezucvy",
   "message": "Middle school, early 2000's. There was a rumor the art teacher was a creep and liked young girls. All the girls in my middle school were not afraid to tell him off and be rude to him because of this. I was scared of him too. My dad came to parent teacher night and remembered the art teacher from when he was in school and he said the art teacher was really popular back in his day (but I don't tend to necessarily believe my dad's perception of things). Anyway, the art teacher told my dad he thought I was afraid of men when I first came to his classroom.\n\nThe whole time in middle school I thought people might have been just making it up, because there WERE girls who spread false rumors, it was middle school, and I would know because they spread false rumors about me (I stole one of their boyfriends - which was laughable because most boys thought I was hideous) and wild rumors about other girls. \n\nFast forward 10-11 years later, working as a waitress. I run into my 8th grade English teacher. My shift ends and we get a drink. We get to talking and I ask him about the rumors of the art teacher, they were TRUE. He got in trouble (arrested maybe? can't remember) for stalking a student and the principal at the time would have had to go through so much red tape to get rid of the teacher because he was tenured. By the time I was in middle school, the art teacher was close to retirement and the principal elected to just keep a very close eye on him.\n\nAnd come to think of it, usually students got in trouble for mouthing off to teachers, or at least scolded, but no one EVER got in trouble for disrespecting the art teacher, not even the art teacher scolded them.",
   "created_utc": 1703604741,
   "score": 0,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keydewf",
   "message": "When I was in 7th grade I knew this one girl, super popular and pretty. Typical middle school girl, she was very narcissistic and plain rude. I didn’t like her and hardly any sane kid did. It was a pretty typical school with rumors everywhere. So we’re clear, this girl was 12 possibly just barely 13. It all started when I was walking with my friend group at the time, down the school corridor. They were plainly gossiping and suddenly one of them blatantly said something that was so absurd to me. Apparently this 12 year old girl gave ‘head’ to a boy during school, in some private area after school. Never found out who the boy was, and I wasn’t sure if it was true. Turns out it was in fact true. I also heard that another girl that went to that same school gave her own brother ‘head’ too, not sure if it was true but I wouldn’t be surprised if it was. Remember, this is a school for only 6th-7th graders.",
   "created_utc": 1703568531,
   "score": 252,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyw9h1",
   "message": "The principal's daughter really was a poopoohead. Go figure.",
   "created_utc": 1703582938,
   "score": 252,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key67p4",
   "message": "Oof that's gonna affect the kid hard hope the kid is okay",
   "created_utc": 1703564534,
   "score": 245,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "key6pmo",
   "message": "Oof that's gonna affect the kid hard hope the kid is okay",
   "created_utc": 1703564791,
   "score": 246,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kezd5ry",
   "message": "The one with your mom",
   "created_utc": 1703595956,
   "score": 255,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "keyzz8f",
   "message": "The history teacher was fucking a student. Big scandal.",
   "created_utc": 1703586118,
   "score": 1,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez0j6k",
   "message": "Several of the teachers were paedophiles.",
   "created_utc": 1703586589,
   "score": 1,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez0plq",
   "message": "Gym teacher kept getting fired for “apparently”molesting young girls and boys (around 12-15 in age) but kept getting rehired as they could not find someone as qualified as him to replace them.\n\nNo one took the allegations seriously until he impregnated two 14 yr old girls.\n\nThe rumours had been going around for years, even when my older siblings were in the school before me",
   "created_utc": 1703586740,
   "score": 1,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez0szq",
   "message": "Male cheerleader did actually only do it because his dad (who worked for the school \u0026amp; was tired of his delinquent behavior) promised him a car",
   "created_utc": 1703586819,
   "score": 1,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez5haf",
   "message": "Oh i used to hear in my secondary school that a girl in the same grade was pregnant. I had thought it was a myth until 2 years later i came across her on th street with her 2 years old baby. Lol.. i was frozen for about 5 mins.",
   "created_utc": 1703590602,
   "score": 1,
   "submission_id": "18qzj7h"
  },
  {
   "comment_id": "kez9ijr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18qzj7h"
  }
 ]
}