{
 "submission_id": "18qza4w",
 "title": "(serious) what’s the best way to get over an ex an stop crying and hurting?",
 "selftext": "",
 "created_utc": 1703563619,
 "permalink": "/r/AskReddit/comments/18qza4w/serious_whats_the_best_way_to_get_over_an_ex_an/",
 "score": 14,
 "url": "https://www.reddit.com/r/AskReddit/comments/18qza4w/serious_whats_the_best_way_to_get_over_an_ex_an/",
 "comments": [
  {
   "comment_id": "key4dta",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1703563620,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key56iz",
   "message": "Give yourself the right to grieve and to heal, every person's time table in doing so differs.  Try not to isolate yourself too much.  Wishing you the very best!",
   "created_utc": 1703564010,
   "score": 22,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key65ic",
   "message": "Let yourself grieve and take it day by day. Then week by week. I went through a rough breakup earlier this year after 9 years with my ex and the best thing for me was just to allow myself to hurt. But I took care of myself and nurtured myself, especially during the days I didn’t want to — cooking lazy but nutritious meals, going on lots of walks, calling and hanging out with friends, reading lots of books, listening to podcasts, thinking about the ways I could grow from pain, exerting a lot of my nervous energy and discomfort by working out. I had a friend that said the good ol’ “time heals all,” and I would get so annoyed lol but it truly does. Almost a year later and I feel so much better. Therapy helped too. It still hurts sometimes but it’s much easier to sit with now.",
   "created_utc": 1703564503,
   "score": 11,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key5dt4",
   "message": "convince yourself you don’t like them by remembering all their flaws",
   "created_utc": 1703564112,
   "score": 7,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key744d",
   "message": "Remember that life is very short and we only get this experience once. Don’t throw too much time away fretting over things you can’t change. I also tried to remind myself that obsessing over someone else isn’t really fair to them, like we’re all just ppl on our own journeys and some ppl come and go. Trying to force someone into your life isn’t fair to them and wishing it isn’t fair to either you. Focus on your own journey and where it will take you now. Your future is up to you.",
   "created_utc": 1703565003,
   "score": 7,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key7zvi",
   "message": "Only time my friend. \n\nIn the meantime, remember to be your own best friend. Do the things for yourself you would for someone you love who was hurting this deeply in this way.\n\nGood luck.",
   "created_utc": 1703565453,
   "score": 5,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key98nb",
   "message": "Your thoughts have inertia.\n\nIf you’re thinking about it now, you’ll continue to think about it for the rest of the day, unless you make the effort to focus on something else to break that train of thought.\n\nFind something mentally stimulating that you enjoy doing, playing a video game, reading a book, working, cooking, socialising etc.\n\nWhen you slip back into ruminating about your ex, know that you have to make a physical effort again to distract yourself. It won’t go away by itself for quite some time. Also, avoid alcohol, it makes it worse.",
   "created_utc": 1703566131,
   "score": 7,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key5tv5",
   "message": "Wait. Time will help. In the meantime, try to avoid things that remind you of them",
   "created_utc": 1703564342,
   "score": 4,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key68qa",
   "message": "Grieve your loss but focus your energy on learning to improve, accept, and love yourself.",
   "created_utc": 1703564549,
   "score": 4,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key7wnh",
   "message": "Stay busy and surround yourself with people who love you.",
   "created_utc": 1703565408,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key4r7i",
   "message": "Find someone new to fall for",
   "created_utc": 1703563803,
   "score": 7,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key5bh5",
   "message": "Absorb yourself in the things you loved doing before the relationship. Try new things you always wanted to try, and push yourself in it.\n\nI’ve been through one hell of a breakup that pretty much left most of my 20s null and void, and that’s what I did.\n\nAlso have a close friend that did the same. He started painting, writing, and putting everything he has into his job and got to a place in which his bosses are fighting over what area they want him in.\n\nIt’s all about taking that pain and molding it into something worthwhile. (Which also is great for telling yourself “pfft, let them see what they missed out on”)",
   "created_utc": 1703564079,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key5r1t",
   "message": "Good luck friend, try to keep your mind busy, set new goals for yourself. The end of every relationship is a new beginning as sad as it is. Just focus on yourself and you’ll be the shining star we all know you’ll be! \nP.s it’s okay to have days where you isolate and take time to relax and clear your head. Two steps forward and one step back is still progress!",
   "created_utc": 1703564301,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key60kv",
   "message": "Actually cry and feel the pain",
   "created_utc": 1703564434,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key6qnk",
   "message": "Accept that a failed relationship is a part of you, your history, and your growth. You can try to put it behind you, forget it and distract yourself. But the tail end of your healing process should involve going \"that happened, that passed. What have I learned about myself, and about relationships from this?\" And you take that knowledge and you just keep living. You do work, try out hobbies, make new friends, you just keep going.",
   "created_utc": 1703564806,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key94ig",
   "message": "1. Get a therapist. \n2. Don’t drink alcohol. \n3. Write down their flaws. \n4. Delete them from social media and get rid of photos and reminders of them. \n5. Start working out. \n6. Do something you’ve never done before. \n7. Reach out to your friends and stay active with them. \n8. Meditate. \n\nThis is my protocol right now.",
   "created_utc": 1703566067,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyb1e7",
   "message": "Get under someone else! Everyone knows this right?",
   "created_utc": 1703567138,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyic6u",
   "message": "Forcing yourself back into hobbies your ex didn't get, but that you love.",
   "created_utc": 1703571727,
   "score": 3,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key6cle",
   "message": "honestly, you gotta let it out. cry until you can’t anymore. pushing those feelings down will do more harm than good. feel all of the bad. then, when the time is right (and you will know when), you pick yourself back up. you will heal :) sending love",
   "created_utc": 1703564604,
   "score": 4,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyaduf",
   "message": "It aint healthy, but it helps.\n\nThe best way to cure a hangover? Start drinking again. That morning even.\n\nBroken heart? Start banging. Text that ex, get on the apps, meet a stranger. \nIt's temporary relief, dont follow it.",
   "created_utc": 1703566774,
   "score": 2,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keybfl2",
   "message": "Everyone is going to have a different timetable for those feelings to go away, but the most important thing is to move on. This means don't be checking their socials, don't be looking at old pictures of you both together, and also start reaching out to friends, finding time to hang out, try out some new hobbies or meetup groups, join some online communities (obviously with a rule of not brining up your ex around any of those people.)\n\nBeyond that you can see a therapist, maybe try mindfulness to catch the unhealthy thoughts about your ex and redirect them.  It's natural and okay to wallow in it sometimes, but work on moving on little by little every day.",
   "created_utc": 1703567352,
   "score": 2,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keybp16",
   "message": "I feel like everything I’m gonna say is bullshit because I think the only way you really can cope with it is simply experience loss in your life so that it doesn’t affect you as much anymore.",
   "created_utc": 1703567502,
   "score": 2,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyg54g",
   "message": "Realize your self worth",
   "created_utc": 1703570254,
   "score": 2,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyg5y4",
   "message": "To be real the best thing you can do is just move on I know it’s hard but try to get up and become the best version of yourself become so good they’ll want you back that’s really all you can do",
   "created_utc": 1703570270,
   "score": 2,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key4ly6",
   "message": "Watching Shrek",
   "created_utc": 1703563730,
   "score": 2,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "key7rif",
   "message": "Personally, I always have other options",
   "created_utc": 1703565336,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyb42s",
   "message": "To move on from another person you have to focus and get yourself distracted to another one. Distracting yourself with friends, people or thinge to do is a great way to forget about him slowly. Socializing can also work so yoh focus on the new people on your life not your x.",
   "created_utc": 1703567178,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyd50e",
   "message": "I surrounded myself with my friends. Always found something to do to keep my mind off things. My friends were my lifeline.",
   "created_utc": 1703568365,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyoczb",
   "message": "Having gotten over many exes at this point:\n\nBy FAR the easiest way to get over someone is to have multiple options. Losing someone you really liked/loved hurts many multiples worse if you view them is irreplaceable. Likewise, if you know with conviction that you can find someone that is just as good or better, it can sometimes cause very little pain at all to have to get over someone.",
   "created_utc": 1703576267,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keysi0h",
   "message": "Dive into activities you enjoy, whether it's a new hobby, catching up with friends, or learning a new skill. Keeping your mind engaged can help",
   "created_utc": 1703579705,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyv3es",
   "message": "Give yourself time. It will pass.",
   "created_utc": 1703581940,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keywr66",
   "message": "Time.\nMake sure you actually cry and process the emotions.. but mainly time. Try to stay sober, don’t attempt to drink it away or use drugs. And don’t use anybody else as a rebound",
   "created_utc": 1703583360,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "keyz4pg",
   "message": "Honesty, become the best version of yourself go to the gym, focus on studies, show love to family, friends and let time do its thing",
   "created_utc": 1703585408,
   "score": 1,
   "submission_id": "18qza4w"
  },
  {
   "comment_id": "kezbtjo",
   "message": "Time. \n\nTime is your friend. Each day will hurt less. Thoughts of the other will stop consuming you and begin to decrease. Eventually there will come a day where you haver no hurt and you realize you had no thoughts of the other. \n\nFor some, talking about it with others may help. For others it may be best to just cut the cord and not talking about it. Each person will have their own way of best dealing with the situation. \n\nSome may find it best to fully engage with hobbies or other activities while others may need the time to think about it. \n\nPoint is, everyone will handle this in their own way but time is the constant. \n\nIt's a temporary problem. No need for permanent solutions....",
   "created_utc": 1703595126,
   "score": 1,
   "submission_id": "18qza4w"
  }
 ]
}