{
 "submission_id": "18r1udh",
 "title": "Empty nesters, how did your Christmas traditions change now that the children are out of the house?",
 "selftext": "",
 "created_utc": 1703572226,
 "permalink": "/r/AskReddit/comments/18r1udh/empty_nesters_how_did_your_christmas_traditions/",
 "score": 10,
 "url": "https://www.reddit.com/r/AskReddit/comments/18r1udh/empty_nesters_how_did_your_christmas_traditions/",
 "comments": [
  {
   "comment_id": "keyjb18",
   "message": "Bought more gifts for myself. Didn’t have to wrap any. Or pick up any trash.",
   "created_utc": 1703572412,
   "score": 5,
   "submission_id": "18r1udh"
  },
  {
   "comment_id": "keyjs1g",
   "message": "I’m not an empty nester, but Christmas is so different without my grandparents and a huge family around. It’s just a part of getting older",
   "created_utc": 1703572746,
   "score": 3,
   "submission_id": "18r1udh"
  },
  {
   "comment_id": "keylwqa",
   "message": "i now aggressively spam my children’s fb walls",
   "created_utc": 1703574342,
   "score": 2,
   "submission_id": "18r1udh"
  },
  {
   "comment_id": "keynyop",
   "message": "\r  \nChristmas got a bit cozier without the kiddos. We traded the chaos for a quieter vibe. Instead of Santa wrappings, it's more about reminiscing and maybe sneaking in a nap after the feast. Ah, the simple joys of an empty nest.",
   "created_utc": 1703575949,
   "score": 2,
   "submission_id": "18r1udh"
  },
  {
   "comment_id": "keyoied",
   "message": "I didn’t make any Christmas cookies and didn’t buy any candy.   Instead of spending a lot of time picking out and wrapping gifts, each kid got some cash.  I had a full night’s sleep.",
   "created_utc": 1703576388,
   "score": 2,
   "submission_id": "18r1udh"
  },
  {
   "comment_id": "kezcdya",
   "message": "This year, I tried to do everything the same down to having both boys come over and spend the night to be with us Christmas morning. I realized that some tweaks definitely need to be made. Starting with a small dinner and no mornings! One son woke up at 5:30 and talked to me nonstop including playing deer hunting videos for me while I tried to fix breakfast (bless him) until 9:00 which is when we said we would wake the other. Exhausted!  I like how simple most of y'all are!",
   "created_utc": 1703595481,
   "score": 1,
   "submission_id": "18r1udh"
  }
 ]
}