{
 "submission_id": "18r52f9",
 "title": "What would be different if Covid had never happened?",
 "selftext": "",
 "created_utc": 1703585579,
 "permalink": "/r/AskReddit/comments/18r52f9/what_would_be_different_if_covid_had_never/",
 "score": 18,
 "url": "https://www.reddit.com/r/AskReddit/comments/18r52f9/what_would_be_different_if_covid_had_never/",
 "comments": [
  {
   "comment_id": "keyzwxz",
   "message": "Less home office and online meetings",
   "created_utc": 1703586064,
   "score": 241,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez087j",
   "message": "Stores would still be open 24 hours",
   "created_utc": 1703586329,
   "score": 191,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez9il4",
   "message": "WFH wouldnt have been as widely accepted.",
   "created_utc": 1703593594,
   "score": 40,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez9z4z",
   "message": "We wouldn’t have gotten an email from every organization on Earth that started with “During these difficult times…”",
   "created_utc": 1703593914,
   "score": 138,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez31k3",
   "message": "I would not have bought as much crap on the internet",
   "created_utc": 1703588653,
   "score": 218,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf0ctc7",
   "message": "We might still have All-Day Breakfast at McDonald's",
   "created_utc": 1703612248,
   "score": 201,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezi0lr",
   "message": "A lot of people wouldn’t have lost their sanity.",
   "created_utc": 1703598731,
   "score": 98,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez0p58",
   "message": "You’d be less aware of how many stupid assholes are out there",
   "created_utc": 1703586729,
   "score": 223,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez6w03",
   "message": "All the momentum in my career wouldn't have been shattered.\n\nPeople would probably be marginally less shitty",
   "created_utc": 1703591685,
   "score": 155,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf06dwn",
   "message": "QR codes wouldn’t have made the comeback they did.",
   "created_utc": 1703609708,
   "score": 40,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez34gn",
   "message": "My brother would be alive.",
   "created_utc": 1703588719,
   "score": 125,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezpilh",
   "message": "A few more years of a livable middle class.",
   "created_utc": 1703602525,
   "score": 115,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez54o9",
   "message": "Politicians would not have had an excuse to give away a trillion$$$ of our money to their rich friends through PPP loans.",
   "created_utc": 1703590332,
   "score": 40,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez9by9",
   "message": "All of the world?\n\nIt quite literally decimated economies, whole families and a lot of industries.",
   "created_utc": 1703593464,
   "score": 166,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezig2e",
   "message": "The collectors market. Some people don’t know this but the reason resell on collectibles like trading cards \u0026amp; video games is so high is because during Covid so many people started collecting stuff and buying things with their stimulus that prices were sky high on everything. Now a few years removed the prices are down but still much higher then what they were before Covid",
   "created_utc": 1703598961,
   "score": 117,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezhzmk",
   "message": "People would not be so entitled, rude, and self-centered.  I truly believe the restrictions mentally damaged some people.  And it concerns me.",
   "created_utc": 1703598717,
   "score": 171,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezj6tw",
   "message": "I might be able to afford things.",
   "created_utc": 1703599360,
   "score": 121,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezvjcp",
   "message": "I'd be pretending to work in an office building today instead of at home.",
   "created_utc": 1703605251,
   "score": 64,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezeqiy",
   "message": "I might have properly graduated university and gotten a different job.",
   "created_utc": 1703596899,
   "score": 37,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezc5p9",
   "message": "- doctors wouldn't have started wearing masks when seeing sick patients.  Some don't, but I've seen a lot more that do. \n\n- same with people out in public\n\n- Trump may not have lost\n\n- working remotely wouldn't have gotten the big push it did \n\n- inflation wouldn't have happened the way it did\n\n- supply chain issues that are still ongoing wouldn't have happened\n\n- going to a buffet wouldn't feel as icky as it did before \n\n- curbside and pickup ordering wouldn't have been kicked into the forefront\n\n- business which were barely hanging on would have had a slightly longer chance to hang in there\n\n- the brief new appreciation for teachers and health care workers wouldn't have happened\n\n- bidets wouldn't have become as popular\n\n- the benefits of school lunch programs and child tax credits wouldn't have been so up front",
   "created_utc": 1703595338,
   "score": 160,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf06a7f",
   "message": "We would not have gotten buttfucked by inflation for the last 18 months.",
   "created_utc": 1703609667,
   "score": 125,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez5n82",
   "message": "Not sure if the Twin Cities riots would have happened on as large a scale.",
   "created_utc": 1703590730,
   "score": 77,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezeb41",
   "message": "I’d still be making about $40k a year more ☹️",
   "created_utc": 1703596650,
   "score": 75,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezthe5",
   "message": "Probably a lot of less mental health issues. Plenty of people didn't recover from the isolation. And the politicization of the virus, and its policies are still seen to this day.",
   "created_utc": 1703604353,
   "score": 17,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "keyzxf8",
   "message": "I would still be able to smell and taste food. I can only taste very sweet or salt. I had Covid summer of 22.",
   "created_utc": 1703586076,
   "score": 182,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf0hbnm",
   "message": "Trump would have been reelected president. I don’t think there is any way Biden wins without the pandemic.",
   "created_utc": 1703613996,
   "score": 107,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezuukk",
   "message": "For me, I know this sounds selfish, but COVID was a blessing in disguise for me. I never would have been able to spend the last few years with my dog as closely as I did because of all the hours I saved not being in the office or commuting. He could have suffered from his illness alone and I could have came home to my dog collapsed and dead already instead of the few years I got to spend with him by his side at every hour.",
   "created_utc": 1703604954,
   "score": 75,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez5nd9",
   "message": "Trump would still be president",
   "created_utc": 1703590733,
   "score": 33,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez34k5",
   "message": "In California: thousands of people wouldn’t have realized just how shitty it was commuting to their jobs every day and the magnitude of time spent on the road.",
   "created_utc": 1703588721,
   "score": 253,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezdaix",
   "message": "Prices of many things would have not been this high as we see today.",
   "created_utc": 1703596036,
   "score": 23,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezhofh",
   "message": "My dad would be alive.",
   "created_utc": 1703598554,
   "score": 27,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf07nsi",
   "message": "I would own a home and could buy groceries after 8.",
   "created_utc": 1703610217,
   "score": 28,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez7quq",
   "message": "My will for actually going to places more and stay home less. 😑  \nAt first I complained about I don't want to stay home this much, but I ended up \"crossing the line\" and now I rarely go to places with/without my family (usually I only go to work).",
   "created_utc": 1703592332,
   "score": 41,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezvdp8",
   "message": "Trump would still be president. Elon, Bezos would have way less money.",
   "created_utc": 1703605184,
   "score": 38,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf0f58m",
   "message": "Not as many homeless,cars would be cheaper, housing would be cheaper,car repose off the charts,groceries,its all documented",
   "created_utc": 1703613154,
   "score": 9,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezf7hv",
   "message": "Housing would be less unaffordable. People wouldn’t have gotten rich off COVID relief, work from home wouldn’t be a thing.",
   "created_utc": 1703597174,
   "score": 17,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf0cb6o",
   "message": "my favorite restaurant that was designed like an old timey diner would still be open",
   "created_utc": 1703612053,
   "score": 8,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "keyze4w",
   "message": "I would probably be done with my PhD but also i would lack one of the best friends i now have. Fucking worth it!",
   "created_utc": 1703585632,
   "score": 59,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf0sepb",
   "message": "People were much nicer to strangers pre-Covid. I notice this particularly on the roads, people drive significantly more aggressively and selfishly. People are also ruder in setting such as grocery stores, etc. I only have antidotals around this, but most folks I talk to seem to agree.",
   "created_utc": 1703618266,
   "score": 6,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezek1r",
   "message": "The NHL salary cap and floor would be substantially higher.",
   "created_utc": 1703596794,
   "score": 12,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezh84j",
   "message": "I’d still have the belief that despite our differences, if humanity were faced with a global threat (aliens, zombies, other apocalypse), we would set aside those differences and work together for the common good.  Nope.  We’re selfish assholes regardless of the situation.",
   "created_utc": 1703598309,
   "score": 34,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezzs7f",
   "message": "The mental health and education of American kids would be far, far better.  I worked in schools during the pandemic, and so I watched as the fragile systems we had in place were taken away.\n\nNo Child Left Behind and the factory education model meant that nobody wanted to hold back the kids who didn't learn for a couple years.  In my area, more kids regressed than progressed their education over the first years of the pandemic, but got put ahead by multiple grades anyways.  Different kids got affected different amounts (usually based on parental involvement), so now teachers are in a predicament where there's literally not a lesson that's on-level for the majority of their class.  This causes educational disparities to widen, which makes the problem even worse.\n\nMeanwhile, schools in America were unable to provide the wide variety of services that they've been forced to provide.  For many kids, school was where they socialized, school was where they accessed mental healthcare, their clothes came from school, and it was where they went to get away from their abusive families.  Now kids are years behind on socialization while having mental health difficulties piled onto the already difficult process of growing up.  If they're still going to school, they have to spend hours per day bored while their teacher gives lessons not at their level (see previous paragraph), and the kids who are too behind on the fundamentals to grasp the lessons are just stuck in an activity all day that tells them, \"you're stupid\".  All this leads to major behavior issues and an overwhelming of America's mental health system, which then makes everything else harder, which makes the problem even worse.\n\nSo now America's youth are stuck in multiple snowballing problems that can't be fixed without multiple major institutional changes that lack the political will to be implemented.",
   "created_utc": 1703607025,
   "score": 6,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf0c6py",
   "message": "My local Chinese buffet would still be open. I miss you, China taste...",
   "created_utc": 1703612004,
   "score": 5,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf0coy9",
   "message": "Many many people would never have exposed their ugly traits",
   "created_utc": 1703612201,
   "score": 6,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezja1w",
   "message": "We'd all be still going to the office every day.",
   "created_utc": 1703599408,
   "score": 20,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez3oap",
   "message": "I wouldn't be wheezing and miserable for Christmas.",
   "created_utc": 1703589169,
   "score": 32,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezdt8u",
   "message": "I wouldn’t have failed so many classes and remained smart",
   "created_utc": 1703596355,
   "score": 8,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez74xx",
   "message": "A HermanCainAward would likely involve pizza.",
   "created_utc": 1703591876,
   "score": 25,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kez3dxw",
   "message": "The handshake would remain a symbol of connection rather than a memory, and the phrase \"new normal\" would be a stranger to our lexicon.",
   "created_utc": 1703588932,
   "score": 42,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kezikc4",
   "message": "Wouldn’t know how glorious working from home is",
   "created_utc": 1703599026,
   "score": 16,
   "submission_id": "18r52f9"
  },
  {
   "comment_id": "kf03o19",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18r52f9"
  }
 ]
}