{
 "submission_id": "18r9a8e",
 "title": "Redditors who used a gloryhole, what happened?",
 "selftext": "",
 "created_utc": 1703600986,
 "permalink": "/r/AskReddit/comments/18r9a8e/redditors_who_used_a_gloryhole_what_happened/",
 "score": 101,
 "url": "https://www.reddit.com/r/AskReddit/comments/18r9a8e/redditors_who_used_a_gloryhole_what_happened/",
 "comments": [
  {
   "comment_id": "kf0gqdv",
   "message": "\"It's gonna be a lady right?\"\n\n\"You see any other cars in the parking lot Junior?\"",
   "created_utc": 1703613769,
   "score": 54,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0aunl",
   "message": "The thought of what the person working the glory hole does in between jobs captivates me. Like do they just do crossword puzzles or play cards until all the sudden a dick emerges in the hole? \n\nThese thoughts keep me up at night.",
   "created_utc": 1703611478,
   "score": 246,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0bzyu",
   "message": "Found a hole and put it in, but my dick just touched another dick coming from the other side.\n\nHeadbump",
   "created_utc": 1703611928,
   "score": 118,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0q6eb",
   "message": "Sophomore year of college. I am on Craigslist casual encounters, back when it existed. I see an ad saying “I admit to loving to suck dick.” I’d never done anything in my life (head included) so I figured why not. Got a reply. Eventually set up a time and date to go to their house. \n\nWhen I go there I have to go through the side gate, the basement door is open and a light is on inside. I walk in and see a giant bedsheet with a hole cut in the middle and a hear a raspy “get over here” in the distance. \n\nI was hella nervous. I was worried it would be a sting operation (even though I wasn’t doing anything illegal) or worse, that they’d cut my dick off. I asked to put a finger through first and the voice was like “no, your dick.” So I obliged and it felt pretty good, like I said I’d never gotten head before… since then I’ve gotten better head, but at the time it felt really good. \n\nI told my buddies about it and they were like “dude that’s a man.” I kept insisting it was a woman because the ad on Craigslist said so. I took some of my friends there and one of them pulled back the sheet one day going by themselves and… they were right. It was a man the whole time. \n\nYou live and you learn.",
   "created_utc": 1703617400,
   "score": 104,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezmsgi",
   "message": "turns out it was just a hole in the wall the rats made",
   "created_utc": 1703601199,
   "score": 153,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0chhx",
   "message": "I would be scared to death to put my dick in a gloryhole. There could be a crazy person with a machete on the other side, with a collection of severed dicks.",
   "created_utc": 1703612121,
   "score": 143,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0gbyp",
   "message": "Met a girl who had a glory hole fetish at a hotel. She had taped up a blanket and cut a hole in it so as soon as you walk in there’s just a blanket with a hole covering the walls. I put my dick in half worried it was a trap and my dick would get cut off. Instead I got a really good blowjob and she swallowed. She handed me a napkin thru the hole to wipe off, I awkwardly said thanks and left lol.\n\n10/10 would nut again. She had a Snapchat that I followed and she would frequently upload her GH escapades. Mine wasn’t on there unfortunately 😞\n\nEdit jesus h Christ that’s a lot of likes batman\n\nEdit again there was another hole closer to my eyes that allowed me to see what was going on so I knew the person was at minimum petite and feminine. I’m also bi so even if it was a dude I could care less tbh",
   "created_utc": 1703613614,
   "score": 227,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf04kss",
   "message": "where do glory holes even exist, and where do u find them in the uk (asking for a friend) \n\nEDIT: location",
   "created_utc": 1703608983,
   "score": 148,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0ab7z",
   "message": "Turned up,  got some head, the other party got really horny and asked me to fuck her ass, I obliged. Went home. Wore a mask in case they were recording, made sure my tattoos were covered with a long sleeve tee for the same reason.",
   "created_utc": 1703611266,
   "score": 83,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0hkk1",
   "message": "Wasn’t exactly a hole but a blanket put up over a doorway. Anyways linked up on Reddit, shout out R4R Orlando, and went to their house. Followed their instructions and walked in, sat in a chair and pulled my pants down. They lifted the curtain over my legs and I just tried to relax as they went down on me.\n\nI didn’t finish the first time, nerves got me, but I went like 4-5 more times and it was a very enjoyable experience every time. Didn’t need to talk if I didn’t want to, they said nothing. Just two people enjoying each other.",
   "created_utc": 1703614090,
   "score": 125,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0ldy5",
   "message": "I’m a woman. My experience was actually pretty fun, but I’m in the minority. There was a “door guy” who essentially was just monitoring who was going in which booths. I was happily sucking on a quick succession of cocks when one guy was being pushy (making demands before poking through and not leaving after he came). So I excited my booth and gave the door guy a little hand gesture to signal that I didn’t want to interact with that last guy anymore. I slank back into another dark, seedy booth and never got the demanding weirdo again. Though before I left I was told he was kinda pissed that I left him hanging. A fist bump and head nod to the dude that understood and kept me safe. \nIt showed me that even though it’s probably a place most people wouldn’t go or would have a totally negative view of, I was pleasantly surprised by the courteousness of all that worked there and have returned a number of times since.",
   "created_utc": 1703615561,
   "score": 58,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0qvse",
   "message": "I was on holiday in Europe and met a guy on a dating app who took me to a sex club. There were “open” rooms (where anyone could walk in and out) and “closed” rooms for couples (where you could look in but not enter without the couple’s permission). We were in an open room at first but there were several single guys who basically followed us everywhere we went and wouldn’t keep their hands off me no matter how many times we told them to back off, so we moved to a closed room. That room did have glory holes in the walls. It didn’t take long until some guys stuck their dicks through the holes. The guy I was with asked me if I wanted to suck one, but I said no; wasn’t quite comfortable with that. But I did end up giving them hand jobs while I had sex with the guy I was with.\n\nIt was weird but a fun experience overall. Mostly I’m just super grateful to the guy I went with for not murdering or raping me.",
   "created_utc": 1703617671,
   "score": 163,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezv5op",
   "message": "I have a hard time imagining the physical part. Don’t you run the danger of banging your nose into a wall? And doesn’t the receiver have to stand in such a way they’re likely to be uncomfortable and lose their balance?",
   "created_utc": 1703605088,
   "score": 45,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf05270",
   "message": "It was at a party, not like some random hole in a public bathroom. I think they set it up as a joke, not really expecting anything to happen.\n\nBut ya it went pretty much how you'd expect, I didn't get any warning when cum was on its way lol\n\n\u0026amp;#x200B;\n\nCollege was fun",
   "created_utc": 1703609176,
   "score": 237,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf07aj7",
   "message": "I actually set up a secret glory hole at work then spread \"rumors\" about it over a weekor two. When I finally saw someone going to check it out, I slipped on to the other  side and stuck my dick through. Unfortunately, it didn't work out because I work in a bank and the walls are very thick.",
   "created_utc": 1703610070,
   "score": 70,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezmlj1",
   "message": "[deleted]",
   "created_utc": 1703601103,
   "score": 76,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezmu53",
   "message": "I’m interested in seeing one in person lol",
   "created_utc": 1703601223,
   "score": 109,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf059vq",
   "message": "I made a really cool glass sculpture",
   "created_utc": 1703609262,
   "score": 126,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0btzd",
   "message": "I (m, 27) sucked a guy off at a college restroom. Then I recognized his shirt while he was boarding the subway holding his girlfriend's hand",
   "created_utc": 1703611862,
   "score": 211,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0il1l",
   "message": "I worked at an adult bookstore in the mid-90s that had video booths. I did not partake but got to know enough of the people.\n\n1. There was a full-time janitor, but we still had to do a mopping (I was NOT meticulous) once during overnight shifts.\n2. Once I had a guy take a dump in one of those booths. I still hold a grudge.\n3. Dudes used to buy VHS cleaner and then get stoned in those rooms and spill the shit. It was awful when they spilled the shit.\n4. Women at these things did happen, but it was *very much* a rarity. Very, very much. Almost never.\n5. We predrilled the holes in the wall, otherwise the would wreck the walls making thier own glory holes.\n6. Some of the regulars were upstanding citizens with real normie lives. I would pass bye them in public with thier normie families and I would generally just say high. Almost always they would look away.\n7. It was a combination of regulars, after-bar drunk people looking for thrills, or sometimes bachelorette parties -- but they rarely went in back and I never ever heard of porn shit happening. lol. \n8. I worked on commission. Some guy was asking me about the difference between the rubber dolls. Fuck all if I know, but that 10% on the $300 doll was a pretty sweet check. lol. \n9. Gum Me Bear was the best movie title I remember from that time. Probably tame stuff now, but porn just wasn't available the way it is now.",
   "created_utc": 1703614481,
   "score": 84,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0aef0",
   "message": "*Speak into the hole*\n\n“Are you ready for a foot long?”\n\n“Yes daddy!”\n\n*proceeds to shove subway  meatball marina through hole into mouth.*",
   "created_utc": 1703611301,
   "score": 218,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezy652",
   "message": "I was giving an amazing blowjob until I heard them moan. It was a man's moan. I had been sucking a guy's dick the whole time. Bamboozled!",
   "created_utc": 1703606358,
   "score": 5,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "keztvx1",
   "message": "There was actually a homophobic person with a rat trap on the other side.",
   "created_utc": 1703604534,
   "score": 214,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0df1p",
   "message": "There is one in the mens toilets at my local pub. The ladies was closed one night so I had to go in the mens, literally the only time I had been in there and who would’ve guessed it some guy came in after me and poked his little friend through the hole for me. I gave him a handy while I finished my business and left. Never told my friends what happened.",
   "created_utc": 1703612484,
   "score": 163,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0a6ne",
   "message": "OP forgot the serious tag again",
   "created_utc": 1703611218,
   "score": 72,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezyh4t",
   "message": "How thick is Wall?",
   "created_utc": 1703606484,
   "score": 1,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezmonw",
   "message": "i never used on but there are only 2 anwers:  \n\n\\- it got sucked\n\n\\-i sucked",
   "created_utc": 1703601146,
   "score": 236,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0z8o1",
   "message": "Pink eye....I got pink eye. Shouldn't have peeked through the hole. Thought I might see boobies on the other side. Nope just a cheese cock supreme.",
   "created_utc": 1703620928,
   "score": 52,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0ddo0",
   "message": "Never used one, but I have seen one in real life. I was all of 18 years old and using a cubicle toilet in a very well knows gay pub. I noticed the hole and wondered 'wtf is that all about?'\n\nTook me about ten years to remember it and go 'Ahhhh... now I get it.' Looking back on it my naivety was painful.",
   "created_utc": 1703612469,
   "score": 94,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0lixm",
   "message": "I like to suck. I messaged a guy who said he had one on Grindr. Set up a time and showed up. Texted him when I got there and he said I can come inside. There was a dark sheet covering the doorway with a hole in it. I'm a freak so in my case I handed him a handcuff key and then cuffed my own hands behind my back (we agreed on this ahead of time.) After that he put his cock through the hole and I sucked it until he finished. Then I turned around and he uncuffed me through the hole and I left.",
   "created_utc": 1703615615,
   "score": 8,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0ip02",
   "message": "Stuck my dick in one once. Dude on the other side slipped a chinese finger trap on it with his in the other end. We're still locked in 7 years later and do everything together. Steve's a good dude, we just met under weird circumstances",
   "created_utc": 1703614524,
   "score": 213,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0gtkf",
   "message": "This website has been around for years, not sure if this place is real but gave me a good laugh. Must be “well endowed”\n\nhttps://www.fairbanksgloryhole.com",
   "created_utc": 1703613803,
   "score": 90,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf08znp",
   "message": "I vist them frequently. Its a good time. I fuck and suck their cocks. About what you expect to happen happens",
   "created_utc": 1703610746,
   "score": 159,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kezvn4v",
   "message": "Had one fella come in and his load was so viscous I had to chew. 2/5 ⭐'s. Won't do again.",
   "created_utc": 1703605296,
   "score": 124,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0g4id",
   "message": "I’ve hosted one but I was too scared to do the whole anonymous, never see the guy thing. So we chatted a bit. He sent photos of himself. Even doing a thumbs up to prove it was him 😆 it was hot but I think the hottest part was knowing he was there but pretending he was some random dude. Turns out he was a cop lol. Good looking married cop too. Eek. But it was hot. We met up multiple times until eventually he pulled the curtain and just let me have it. I made my glory hole with a thick curtain, tape and etc.",
   "created_utc": 1703613535,
   "score": 207,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0rgbt",
   "message": "So I matched with this girl on tinder and she said she was into glory hole stuff and she had a glory hole set up at her house. I drove over there and texted her I was there and she said come in the door is unlocked. I went up to the door and it was like cracked open a little and the house was dimly lit. I saw her “glory hole” and all it was was a sheet with a hole ripped in it and it was push pinned to the top of an entrance to a hallway in her house. I walked closer to it and considered sticking my dick in it but then multiple scenarios ran through my head. Could be a weirdo looking to chop off my cock on the other side or maybe a really hungry dog looking to bite my dick off and the best scenario I could come up with was that there was a dude on the other side of the curtain and I said outloud “nah fuck this” and left",
   "created_utc": 1703617892,
   "score": 158,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0m0xi",
   "message": "Obligatory mention of the tiktok story where it was the girls dad on the other side",
   "created_utc": 1703615807,
   "score": 125,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0o4p6",
   "message": "He was pretty big so it was uncomfortable sucking him. He asked if he could fuck me with a condom, it was more comfortable. I was so close to orgasm but he finished first so.......",
   "created_utc": 1703616614,
   "score": 120,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf186e5",
   "message": "I’ve been to several glory holes, each one located in the arcade of an adult store. I’ve visited three different locations for a total of five times. \n\nThe first two times were to meet a married couple. The husband arranged it so that he could watch his wife perform oral sex on anonymous men (anonymous to his wife) who he screened in advance — I was one of those anonymous men. Both times, the woman gave five strangers blowjobs. She did this, one after the other, while her husband recorded the action on their side of the wall.\n\nThe third time, I went with a married woman who picked me up at a bar. Her husband was traveling and gave her a homework assignment to give a stranger a blowjob and have it recorded. She gave me a blowjob in a booth that we shared, and then I fucked her from behind while she gave a stranger a blowjob through the glory hole. I recorded the whole thing for her husband. \n\nThe fourth and fifth times were with a partner. She likes getting fucked while people watch. The first time, she gave me a blowjob and I fucked her tits while strangers in the neighboring booths watched us and jerked off. The second time was similar to the first, except I also fucked her and the strangers were allowed to grope her tits and ass through their respective glory holes.",
   "created_utc": 1703624383,
   "score": 30,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf045m6",
   "message": "I didnt put it all the way through cause i didn't really trust it, and i had to pull it back out when i felt the teeth biting the tip, didn't bleed but stang for a few hours",
   "created_utc": 1703608814,
   "score": 27,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0ezfd",
   "message": "Bees. I will not elaborate.",
   "created_utc": 1703613092,
   "score": 221,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "keztegw",
   "message": "Vidi, vici, veni",
   "created_utc": 1703604317,
   "score": 60,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf1mta2",
   "message": "Working on the Alaskan pipeline in the 70s was lonely. We were sleeping in a barracks type set up. No women around. Guys were going crazy. Lots of fights broke out. I told the foreman that I wasn’t gonna make it. I asked if there were prostitutes within 50 miles. \n\n\nHe told me that behind one of the buildings that there was a wooden barrel with a knothole in it for people like me. Anyway I didn’t care who was in the barrel. First time I tried it I went weak in the knees and collapsed when I was finished. The foreman asked how did I like it. I told him it was the most fun I ever had, and if I could I’d like to go every night. He looks at me and said “ every night, except Wednesday’s “ I asked him “ why not Wednesday” he said “that was my night in the barrel “ \n\n\nNo one ever explained that there were rules. Be careful what you wish for",
   "created_utc": 1703630103,
   "score": 125,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf04ddi",
   "message": "Sucked dicks \u0026amp; got sucked",
   "created_utc": 1703608899,
   "score": 9,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0d9wu",
   "message": "I once sucked cock in the glory hole at a swinger party. Super hot, I bathed in cum and stuff like that. However, I am afraid that the gloryhole is an invention of the porn industry. Or swingers. Or companies that make holes.",
   "created_utc": 1703612429,
   "score": 141,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0771c",
   "message": "The handjob was so rough, it was like sandpaper on my penis. I was like \"slow it down! Stop being so rough!\" And I heard a noise like a chipmunk. I was like \"excuse me?\" And all I heard was \"nothing is better than cheddar!\" And it is was the Cheddar Goblin.",
   "created_utc": 1703610031,
   "score": 29,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf07oh0",
   "message": "Glory.",
   "created_utc": 1703610225,
   "score": 186,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf1mt1w",
   "message": "I stopped at a small, out of the way rest area. Went in to take a leak and while at the urinal I noticed a glory hole. And a finger came through the hole motioning for me. I was in my twenties, single, curious and up for anything those days so I obliged. I was getting a great blowjob and someone opened the door. So I yanked my dick out and turned towards the urinal. Then I felt a hand on my shoulder. He said he was with the guy in the stall. I thought I was about to get robbed but he reached around and grabbed me. Then he turned me back to the hole and put it back in. He gave me a great shoulder rub while his guy sucked me off. It was my one and only glory hole experience. In my 50+ years it's in my top ten hottest sexual experiences of my life.",
   "created_utc": 1703630100,
   "score": 53,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf1zifq",
   "message": "It is probably too late to have this seen, but I figured I'd share my tale, despite being on mobile. It all occurred  several years ago in Tampa, Florida. In an adult movie theater known as Fantasyland. It is a long story of nervous voyeurism, but ends with some action.\n\nI'm something of a supressed deviant- in to a lot of things, but held I'm check by societal and professional pressures and fears about health safety.  Not to mention a slight oral fixation. Yet my curiosity got the better of me. I'd always been interested in sexually charged locales, and had heard about this one through some porn video online. Well one Friday I decided to bite the bullet and travel out to see the place myself.\n\nThe whole ride there I was a bundle of excitement and nerves. I must have considered turning around a hundred times, even as I pulled in to the parking lot. The place looked smaller and more unassuming than I thought... nobody outside, but a pretty full parking lot telling me that the place was 'active'.\n\nGetting inside was the next psychological hurdle. I wanted to be safe and unrecognized, fearing video or images of me in the place.  This was at a time when you could reasonably wear a mask without everyone thinking you're sick, though most folks were through with them. Wearing one as I got out and headed in bolstered my courage. I had heard of people having bad experiences with aggressive folks when dresses provocatively so I had chosen simple jeans and a t-shirt rather than something overtly sexy to wear.\n\nI finally made my way inside to the shop area and the shopkeep was a nice fellow who gave me the rundown on the way the place worked... private video booths on one side, a well lit pool table lounge spot,  a few more open theater rooms on the other, and a few specialty rooms- some couples rooms with doors and a exhibition room with glass walls. I meekly decided to slip in to the private booth area first.\n\nThe area was super dark, which was comforting, but several of the booths didn't have working screens in them. Most did have holes connecting two together. There was someone moaning lewdly in a far booth that made my ears, face, and elsewhere tingle. My heart was pounding so I just wanted a moment to stabilize so I slipped in to a dead one and closed the door. Outside I heard someone leave booth and go in to another one, seemingly looking for the person who just came in- me. Well... I wasn't quite ready to participate at that point. When they went into a nonconnected booth I slipped out and went back to the central store area.\n\nMy face must have been bright red, but the whole thing was so exciting that I didn't want to chicken out. So I made my way to the theater area. Well... it was still dark, but there were more people lingering around the adjoining rooms and in seats. It felt like they were all looking at me and following as I found a seat in the back corner of the main theater room.\n\n A man sat down with a seat between us and I just sat tense and frozen, glancing over a few times and seeing he had pulled his cock out and was stroking himself to stiffness. They weren't particularly attractive but the entire situation with the sexual charge of the place was keeping me excited enough to stay and act the voyeur. I'm pleased to say that everyone was 'polite' in that they didn't force any engagement with my obvioysly nervous, shy-ass self. \n\nShortly after a couple strode in and sat near the middle of the room. His arm was over her shoulder and his hand had slid in to her top. The next thing I know her blouse is open and he's toying with her nipples. She wore a skirt with no panties, and in no time she was rubbing her bare crotch while the room watched. I have to admit I was rubbing myself through my pants at that point too, emboldened by it all. A rather confident fellow wat next to the couple and quiet words were exchanged... then the woman's face was in his lap. \n\nI moved closer, as did everyone else in the room. My mouth was watering as I watched her bobbinh up and down on that glistening cock. Her man's hand was between her legs and it wasn't long before the stranger asked if he could cum in her mouth. How polite... and the answer was yes. This woman sucked the life out of him, and before long another exchange had someone slipping on a condom and taking her from behind.\n\nIt was so fucking hot. This couple just confidently started a whole damn orgy. She had cocks all around her. Some folks just were fully dressed except for their exposed dicks, a few stripped naked including one goddamn Adonis that still gives me naughty shivers to think about. I was so horny, fighting against my inhibitions, hang ups, fears. I kept thinking ridiculous thoughts, so the most I could do at first was bite my lip, slide my hands under my shirt and into my panties ,and shake my head when folks offered to 'help'. At first.\n\nThen I got involved with the couple. The whole thing was a blur of hormones and adrenaline and even now I feel the need to hide and censor, so I'm going to skip ahead to after the party died down.\n\nOnce the couple left I ended up back in the private booths, much less tense and nervous.  I took a seat in a booth with an active video screen, and it wasn't long before the partner booth got an occupant. I had read the etiquette, so I slipped a finger through the hole to invite them through. I'm honestly surprised that the thing that came through wasn't stiff yet, but maybe that is because of how horned up I was (and how hot I get thinking about that night).\n\nOh God, how I wanted to lick and slurp it... but instead I poured a hefty glob of lube on to my hands and began to stroke, lightly grabbing the base and squeezing gently while moving down to the tip. Feeling a cock stiffen in one's hands is such a weird, kind of fun feeling. I... have to confess I wanted it throbbing against my tongue, but I had no plans to. I fought with my urges over returned fears of some disease. I didn't have to fight very long, as a knock on the wall told me he was about to cum. I scooted out of the splash zone and went harder, pumping my hands around him as his dick jumped and spasmed, making a gooey mess on the already filthy floor and my hand.\n\nAnd that was the lead up to my first real gloryhole experience. Of the night. But this whole thing is far too long as-is, and I've been typing it on my phone which has taken forever. So that is all. If anyone sees this and got a little thrill from it I'd kind of like to know my efforts weren't in vain! Just don't blow up my inbox if this gains any steam.",
   "created_utc": 1703635409,
   "score": 147,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0fv2k",
   "message": "Just wanted to throw out that there's a Lovecraftian movie about a glory hole god voiced by J.K. Simmons called Glorious, from 2022:\n\nhttps://www.imdb.com/title/tt12724306",
   "created_utc": 1703613434,
   "score": 21,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0t9gq",
   "message": "Junior year of college I was going through things, getting into bad situations and whatnot. Somehow added a gal on Snapchat who was set up at a hotel and had taped a blanket across the bathroom door. \n\nYou’d walk in, she had a laptop with pornhub pulled up so you could pick a video if you wanted, then you’d stick your wiener through the hole and she’d go to completion and swallow. She recorded from her side and regularly posted the videos to her Snapchat. \n\nI did it once and then got scared I’d get in trouble somehow so I blocked her.",
   "created_utc": 1703618592,
   "score": 22,
   "submission_id": "18r9a8e"
  },
  {
   "comment_id": "kf0dk97",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18r9a8e"
  }
 ]
}