{
 "submission_id": "18rblzd",
 "title": "What are red flags you didn’t notice while dating at a younger age that you see instantly now?",
 "selftext": "",
 "created_utc": 1703607455,
 "permalink": "/r/AskReddit/comments/18rblzd/what_are_red_flags_you_didnt_notice_while_dating/",
 "score": 162,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rblzd/what_are_red_flags_you_didnt_notice_while_dating/",
 "comments": [
  {
   "comment_id": "kf0j234",
   "message": "The way they argue.  There's a lot of things you'd put up with in a high school relationship that you shouldn't put up with in your 30's.",
   "created_utc": 1703614663,
   "score": 75,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0bsxl",
   "message": "Not having a general feeling of being safe when with the person.  I didn't listen to that little voice in my head when I was younger.",
   "created_utc": 1703611851,
   "score": 150,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0k1rg",
   "message": "When someone rushes relationship milestones too fast!!",
   "created_utc": 1703615042,
   "score": 21,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0kw3x",
   "message": "More my own red flags. Like falling more for a person's potential than for who they actually are. Or falling for someone I wanna \"fix\" or help (ties into the first one). I still am super into the damaged ones but I keep myself from falling into the same pattern.",
   "created_utc": 1703615371,
   "score": 215,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0ueqg",
   "message": "If you have to explain basic empathy with kindergarten teacher “how would that make you feel?” language every time they do something obviously hurtful run. Golden rule is supposed to come preinstalled. They will not improve.",
   "created_utc": 1703619036,
   "score": 192,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0eoxk",
   "message": "Fast developing relationships tend to crash and burn.",
   "created_utc": 1703612981,
   "score": 236,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf02fbw",
   "message": "They like you and nobody else (everyone else is evil)",
   "created_utc": 1703608112,
   "score": 166,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf01z2n",
   "message": "Trying to push for marriage only one month into the relationship. That happened in two separate relationships that went on for far too long and only got way worse after that red flag.",
   "created_utc": 1703607926,
   "score": 195,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf08hpn",
   "message": "\"I don't really like commiting to labels,\" \"I love you, but I don't feel ready for a relationship,\" \"We're basically dating already, why do you need the title?\"\n\nYou can believe whatever you want and date whatever way you want, but I'm never going to accept any of the above phrases ever again. If you can't figure out if you want to officially date me after a month, I'm not wasting my time. I don't want a permanent situationship.",
   "created_utc": 1703610547,
   "score": 178,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1mbyg",
   "message": "\"If you ever left me, I'd kill myself/end up in jail/become an alcoholic/etc.\". Felt like a compliment at the time, but just kept me around way longer than I should have stayed",
   "created_utc": 1703629908,
   "score": 111,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0g1s2",
   "message": "Always talking about how messed up or depressed they are, looking for constant sympathy. Those are the types of people who will suck the life out of you and then attack you out of insecurity.",
   "created_utc": 1703613505,
   "score": 190,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0ml4d",
   "message": "Always being too busy to text/call/show their face on a regular basis. Life gets busy but we all know we make time for the things that matter to us. Totally falls into the vein of “if they want to, they will”\n\nEven when I’m busy and can’t be physically present, I find other ways to be available. If someone can’t make themselves available to you a lot of the time it means you are low on the priority list.",
   "created_utc": 1703616026,
   "score": 51,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0eknm",
   "message": "Expecting me to make all the compromises. I’ve moved for men, entirely changing my whole life while not once having one be like “hey maybe I should be the one to relocate or we could compromise and move somewhere in the middle.” \n\nNow it’s non-negotiable. If I’m ever in a position where moving is necessary, either we work it out in advance as far as one of us securing a job and the move making sense or we meet in the middle and keep our jobs and family/friends equal distance. Or nothing.",
   "created_utc": 1703612935,
   "score": 235,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0ovp2",
   "message": "Not communicating and instead expecting someone to read their mind (and if you don’t it’s because you don’t care about them).",
   "created_utc": 1703616902,
   "score": 161,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf18qga",
   "message": "When they seem to enjoy making you uncomfortable. Edit: but if you decide to call them out on it it's all \"just a joke\".",
   "created_utc": 1703624598,
   "score": 73,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf09111",
   "message": "Saying “I have never wanted a kid with anyone until I met you, we should have one” not even a month in. \n\nStating how IN LOVE they are 24/7 \n\nUsing their deceased family as some sort of manipulation to make you understand the love and security you now bring them since that deceased family member left. ( my ex loved to do this )",
   "created_utc": 1703610761,
   "score": 160,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0m0vr",
   "message": "If they ditched their previous significant other for a new hookup, there is a high probability that they will do the same to you someday.",
   "created_utc": 1703615807,
   "score": 157,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf12fhl",
   "message": "People who only talk about themselves and show absolutely no interest in the other person. It's because they're not interested, and are looking for attention. Who they get it from is interchangable. Don't try harder, thinking it will make them notice you, it won't. Just walk away.",
   "created_utc": 1703622174,
   "score": 54,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf16tz8",
   "message": "Not being able to identify what they bring to the relationship that you value.\n\n\nI always thought this was selfish thinking. But now I look carefully, because eventually if someone isn't contributing, they're just taking.",
   "created_utc": 1703623862,
   "score": 54,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf08z3z",
   "message": "That men who are 5-10 years older than you, when you are 14 tell you that you are so mature for your age, and are interested in you.",
   "created_utc": 1703610740,
   "score": 215,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf11i0p",
   "message": "Anything that resembles \"I like/love you more than you like me\" guilt tripping",
   "created_utc": 1703621817,
   "score": 46,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf22kee",
   "message": "They say “ givers attract takers” and there’s definitely truth in that! There is a subtle but important difference between:\n\nSomeone being interested in you as a person.\nSomeone being interested in what you can do for them.",
   "created_utc": 1703636706,
   "score": 44,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1h5jx",
   "message": "One sided communication and constantly flaking out on plans.",
   "created_utc": 1703627856,
   "score": 41,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0sy6q",
   "message": "A person who is nice to you but isn't nice to the waiter, the counter help at the dry cleaners, or just any random person who is in a service position isn't a nice person.\n\nIf a person has constant drama with her family, friends, employer, the credit card company, the bank, the landlord, the mechanic, and coworkers, then that person is the common denominator in all those problems.",
   "created_utc": 1703618471,
   "score": 36,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0kir8",
   "message": "The ability to differentiate between a girl wanting my attention specifically, and a girl that just wants attention.",
   "created_utc": 1703615226,
   "score": 71,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf011wl",
   "message": "Look how you SO treats kids and animals",
   "created_utc": 1703607552,
   "score": 97,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf04hef",
   "message": "Shaming what you love because it is too childish. You'll eventually slow down on anime/comics t-shirts, but taking away the joy they bring you is plain toxic.",
   "created_utc": 1703608945,
   "score": 58,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1l2o6",
   "message": "Controlling or obsessive about you....like \"why would you want to go out with your friends when you have me\"",
   "created_utc": 1703629401,
   "score": 37,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1m9ix",
   "message": "Huge personality changes in private vs public. Dated a few men like this and knew it was bad when I wanted to be in public with them so they would be less abusive.",
   "created_utc": 1703629881,
   "score": 31,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0bwpj",
   "message": "Love bombing. It can feel romantic and like you’re special but it’s really just a cover for insecurity and clinginess at best, and a narcissist at worst.",
   "created_utc": 1703611892,
   "score": 80,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf26lf4",
   "message": "If someone says “I’m no good for you” “I’m not a good person” or anything like that, I don’t argue.  I say “thanks for letting me know!” and walk away.",
   "created_utc": 1703638417,
   "score": 31,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0gz6b",
   "message": "Disrespect. Negging. Subtly pressure or manipulate me into being sexual with them.",
   "created_utc": 1703613864,
   "score": 90,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf125gk",
   "message": "Not being able to do basic shit by themselves, like dr appointments, laundry, cooking.",
   "created_utc": 1703622069,
   "score": 54,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf13rlf",
   "message": "They don't regulate their emotions well. The minute I see that, I'm out. That's it. I ain't got time for that nonsense from a grown ass man anymore. No moping, sulking, slamming doors, yelling. You don't have to be a robot or Mr. Spock (although I do think he's hot). But please grow past tantrum stage. Own your feelings. Say \"hey, I'm getting upset so lets take a break and come back to the topic when I've had time to process my feelings and turn down the temperature a little.\" And leave and go for a walk, eat some ice cream, pet your cat. It's not that difficult. Don't make me or anyone else responsible for your feelings. It's a delusion that is a waste of my time and energy.",
   "created_utc": 1703622678,
   "score": 51,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0evkj",
   "message": "No self awareness. If you blame everything and everyone on your own situation, you are a VERY immature and quite possibly extremely toxic person. \n\nBecause if I date you guess who’s going to suddenly be the culprit of all of your problems now? \n\nYeah, once I hear a woman start blaming things on their situation, I’m out.",
   "created_utc": 1703613052,
   "score": 71,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf10mw1",
   "message": "Jumping into a relationship with you with very little time between the last one and you…. Always, always a recipe for disaster. People who can’t stay single are red flags",
   "created_utc": 1703621475,
   "score": 79,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0t68m",
   "message": "Just because you are together doesn't mean you can't do things separately.\n\nYou don't need to change your hobbies/habits because they don't match your partner's.",
   "created_utc": 1703618557,
   "score": 20,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf21a6t",
   "message": "Sharing **everything** with mommy. No, mommy doesn't need to know how and when we have sex, what her opinion is to whatever you think I should do and any other aspect of our personal relationship. It's our life not hers.\n\nDue to that, I never felt I could say anything critical or else I would have mommy and friends hunting for my flesh.\n\nThat was proven when I broke up. Mommy and daddy where quick to come at location and took everything they deemed was hers. Even stuff I bought for myself but let her use it.\n\nTo give an idea to how intimidating it was, after the last wordt left my mouth, my home was raided in about 45 minutes. 30 of which where the ex and her mommy on the phone.\n\nFuck you for doing that.",
   "created_utc": 1703636163,
   "score": 19,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf09t8d",
   "message": "Controlling , manipulating, non logical, behaviors. \n\nYou can tell when someone wants to change you vs accepting who you are",
   "created_utc": 1703611070,
   "score": 62,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0taw4",
   "message": "Weaponized incompetence. I can quickly spot a man who is unwilling to do his fair share of adult tasks and who thinks that having a job should be his only contribution. In that same vein, I don’t need a “but just tell me what I should be doing!” partner either. I’m not the task manager for the household.",
   "created_utc": 1703618608,
   "score": 82,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf05d7q",
   "message": "Using tears and emotion to manipulate you",
   "created_utc": 1703609300,
   "score": 90,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0mkqz",
   "message": "Drama with ex girlfriends. Only having negative things to say about past partners. \nHuge red flag.",
   "created_utc": 1703616021,
   "score": 37,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0hx98",
   "message": "this wasn’t while I dated, but with family: being nice and unreasonable at the same time, manipulation (“just joking”, “I’m being honest / just an opinion / they mean well”)",
   "created_utc": 1703614227,
   "score": 14,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0icie",
   "message": "girl trying to figure out if i was gay because i wasn’t blatantly hitting on her at work",
   "created_utc": 1703614390,
   "score": 14,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0ttmo",
   "message": "not seeing their child because their baby mama is \"crazy\"",
   "created_utc": 1703618808,
   "score": 44,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf17t32",
   "message": "When the other person has no opinions about where to go or what to do, expects you to plan things and make all the moves. I want a partner, not someone who thinks just barely being there mentally is enough.",
   "created_utc": 1703624239,
   "score": 45,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0qt1r",
   "message": "When they align themselves with all of your interests early on and turn on you when life gets hard independently of what you do. Fucking run.",
   "created_utc": 1703617642,
   "score": 14,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0v32x",
   "message": "Controling behavior, making fun of everything I liked and trying to make me only like what he liked.",
   "created_utc": 1703619300,
   "score": 13,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0ynyz",
   "message": "Someone who lies to appear secure or stable. \n\nJust tell the truth, if they don’t like it upfront they won’t like it later. \n\nGirls that try to “Team Test” Guys and Vice versa. \n\nGirls who use other people as an aphrodisiac, i. e. Leading people on and then running them off. Guys who do it are labeled players.",
   "created_utc": 1703620698,
   "score": 13,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2ilv2",
   "message": "The guy that is obsessed with you off the bat. Declares love within a few weeks, treats you like princess, needs to be near you constantly. you think he must really love you, my soulmate crap. but really it is just their obsessive personality type. They are a red flag for me now. Because as soon as you want some space or focus on your own life they become unbearable.",
   "created_utc": 1703643664,
   "score": 13,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0f5qb",
   "message": "Unnecessary drama to get words of reassurance and validation",
   "created_utc": 1703613159,
   "score": 12,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1gw7f",
   "message": "If a man tells you that you're mature for your age, he's a predator.",
   "created_utc": 1703627754,
   "score": 37,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf10hu3",
   "message": "Very alarmed/curious/and or demanding, if your phone goes off while you're together.\n\nI had an ex that would literally rip my phone from my hand or pocket if I got a text and would read it before I even knew who it was. I was super young so I figured this was normal in a relationship.",
   "created_utc": 1703621421,
   "score": 9,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2ddkb",
   "message": "Constant snarkiness and cynicism. I used to think it was a sign of intelligence or that they were “woke” by being blunt and tearing down things that people love.\n\nExcept being around people like that is emotionally and intellectually exhausting. You can never feel vulnerable or open with them, due to the fear of being ridiculed or belittled. Nothing is ever good enough for them, and they conveniently never have solutions or alternatives. They’re never happy for other people. They see the worst in every situation. They’ll manipulate your emotions to keep you close to them, while simultaneously destroying your self esteem.",
   "created_utc": 1703641348,
   "score": 9,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0n2m6",
   "message": "Getting way too in to everything you're in to. They hear I like BritComs, they binge 3 series in a week. They hear I like a band, they buy all their albums and a couple shirts. They see me smoke Camels, they pick up the habit. It's flattering to think someone is forming their personality around you, but it's unlikely that you're *that* special and interesting.",
   "created_utc": 1703616214,
   "score": 19,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0yze7",
   "message": "Bad mouthing their ex spouses. I ignored that, and I’m now paying the price.",
   "created_utc": 1703620824,
   "score": 16,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1ps6k",
   "message": "Talking smack about his ex, calling her a crazy bitch. Now that he and I are divorced, guess how he refers to me…",
   "created_utc": 1703631310,
   "score": 18,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1wyn3",
   "message": "Being helpless. This is one that took me a few rolls of the dice, and still have to be consciously aware to not go down that path. But in short, I want to feel wanted, not needed.",
   "created_utc": 1703634321,
   "score": 8,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0f4pb",
   "message": "This is more of a pet peeve for me. Disorganization, loosing keys or debit cards constantly. This will spill over into ever aspect of their lives. From bills to doctor appointments to retainers. It is beyond frustrating for me some days.",
   "created_utc": 1703613148,
   "score": 39,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0xy37",
   "message": "Their family members are allowed to be toxic due to their old age (some kind of wonky cultural thing was the excuse). Turns out my ex partner developed into quite the toxic woman herself eventually.. rip relationship.",
   "created_utc": 1703620413,
   "score": 7,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0zy8r",
   "message": "Co-dependency between girlfriend and her mother  evolved to become my marriage of misery. Now divorced.",
   "created_utc": 1703621207,
   "score": 7,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1nc9k",
   "message": "That jealousy is not flattering and does not mean they love you really hard. It does not always, but definitely can, be a preamble to violent and possessive behavior.",
   "created_utc": 1703630316,
   "score": 7,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf27n2n",
   "message": "If someone is over the age of 18 and you’re under 16, they are not right in the head",
   "created_utc": 1703638861,
   "score": 8,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0z72j",
   "message": "Just because someone tells me they don’t like something doesn’t mean I need to stop enjoying it.\n\nExample:\nShe hated the sound of people eating pickles.\n\nMe then: oh lemme not eat them.\n\nMe now: Oh well I’m gonna eat them.",
   "created_utc": 1703620910,
   "score": 15,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf041k6",
   "message": "Being indirect and avoidant, especially when trying to discuss compromise or their needs/wants. I don’t read minds and it can’t be all on me to make accommodations. At this point, I just move on instead of trying to coerce someone into communicating directly and putting effort in.",
   "created_utc": 1703608769,
   "score": 22,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf213gd",
   "message": "I noticed them when I was younger, but was told by literally everyone that I was being dramatic, high maintenance, hysterical, and just a stupid girl. \n\nThe only difference is that I ignore other people now. Please quit telling girls their instincts and feelings don't matter. In a relationship YOU are in, YOUR comfort and happiness are kind of all that matter. Otherwise, why are you even in it? Why would you be with someone who makes you uncomfortable or unhappy? There is no valid reason.",
   "created_utc": 1703636084,
   "score": 15,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1zjh5",
   "message": "Being attracted to the “chip on his shoulder” type of guy. I thought it was quirky to help someone get better and reach their full potential, but I usually just got stepped on. Now in my late 20s I steer clear and look for emotionally available partners.",
   "created_utc": 1703635422,
   "score": 7,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf24gtz",
   "message": "A girl / woman who would not sleep with me until I shaved my (very modest) beard.  (I was somehow motivated to shave it.)  But that demand elaborated into many others-- don't go out running in the morning, etc.  Finally  *re*fused a demand and she broke up with me.  Should have heeded the *first* red flag!",
   "created_utc": 1703637511,
   "score": 7,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0cony",
   "message": "Them sneakily going through your phone and social media is not an act of endearment like they do it because they care about you",
   "created_utc": 1703612198,
   "score": 13,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0ueuc",
   "message": "If I was angry because of something she did, she would always say she loved me and expect that to calm me down.",
   "created_utc": 1703619038,
   "score": 6,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1mab1",
   "message": "When they want to be your BEST friend when they just met you \n\nIf it sounds too good to be true, it probably is",
   "created_utc": 1703629890,
   "score": 6,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1mivo",
   "message": "Ex is crazy = he’s crazy / obsessive / stalker \n„Since ex left I haven’t allowed myself to feel again“ = only wants casual and blames you if anything goes wrong \nNo idea what else \nOh any mention of hating drama = they are drama",
   "created_utc": 1703629987,
   "score": 6,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1vz9p",
   "message": "Religious ferver without the scruples.",
   "created_utc": 1703633904,
   "score": 6,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf26u6o",
   "message": "Any kind of manipulation/game playing - I have ended a lot of things early in the last 5-10 years because they started up that sort of bullshit and I honestly wish I’d done the same when I was younger",
   "created_utc": 1703638521,
   "score": 6,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf129vt",
   "message": "They feel things “too much” and they “say what they think”",
   "created_utc": 1703622116,
   "score": 11,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf02q5r",
   "message": "Being super clingy",
   "created_utc": 1703608235,
   "score": 21,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0cwzx",
   "message": "I actually just posted about this ex....\nHe got mad that I danced with friends at prom. He was throwing a tantrum that music wasn't classical and I guess wanted me to sit out with him the whole time. He also got mad one time that I didn't hear my instant messenger chime (RIP AIM) and respond to his message right away while I was watching a movie on my laptop. Wouldn't get a job for months and played WoW for days on end instead.\n\nIN HIS DEFENSE I was his first girlfriend and he outgrew the controlling behaviors over time. We're no longer together and he's a great dad to our 2 kids. \n\nHowever, as I said, we're no longer together for other reasons. Other than the 2 children, it was pretty much 13 years wasted.",
   "created_utc": 1703612288,
   "score": 14,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf07vcu",
   "message": "How they treat strangers. My wife is flat out rude to people and when I call her out on it, she doesn't care.",
   "created_utc": 1703610301,
   "score": 10,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0xmuy",
   "message": "Lovebombing early on, overly gentlemanly, overly complimentary, looking at your phone when your typing out a message, being the loudest person in the room.",
   "created_utc": 1703620293,
   "score": 11,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf21bsc",
   "message": "Every activity or means of socializing is predicated on needing to drink booze.",
   "created_utc": 1703636181,
   "score": 4,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2ay5p",
   "message": "Every one of their past relationships ending terribly and all their exes being horrible in some way (according to them). No sweety, you will not be his first good one, he will find some way to paint you as the terrible one next. And probably cause a lot of damage to you as he does.",
   "created_utc": 1703640291,
   "score": 7,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0twyo",
   "message": "Well, I suppose, \"I'm going to kill myself\" if I didn't come to her house in the middle of night should have been a clear indicator.",
   "created_utc": 1703618844,
   "score": 4,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0xecx",
   "message": "greed and deceit",
   "created_utc": 1703620202,
   "score": 4,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1i3w6",
   "message": "Love bombing, “negging”",
   "created_utc": 1703628229,
   "score": 4,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1i8ya",
   "message": "Insecure, immature, emotional toxicity. Alcoholism. Bidrunkular disorder.",
   "created_utc": 1703628283,
   "score": 4,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0uhps",
   "message": "An unbridled fetish for cockgobbling other men",
   "created_utc": 1703619068,
   "score": 7,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1g4x1",
   "message": "Texting you on date day to tell you they don't appreciate you not texting or calling them leading up to the first date you had both agreed on just days previously.",
   "created_utc": 1703627458,
   "score": 8,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf15fs2",
   "message": "I have become very good at noticing when they are after my money. Sadly, most of them are after my money :-( I guess it was easier to not notice this.",
   "created_utc": 1703623327,
   "score": 5,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf07gcs",
   "message": "I have to admit that I was very insecure when I was younger and that isn't very sexy. I'm not saying I was like controlling or anything, but I certainly projected my own insecurities to my partner. So... yeah.",
   "created_utc": 1703610136,
   "score": 8,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0xufg",
   "message": "Him wanting to know where I was all the time.",
   "created_utc": 1703620375,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf0yr51",
   "message": "Anger issues.",
   "created_utc": 1703620733,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf10se8",
   "message": "not being realistic",
   "created_utc": 1703621536,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1bdok",
   "message": "Heavy drinking in social situations. That will usually get worse long before it gets better.",
   "created_utc": 1703625626,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1chko",
   "message": "Her dad was completely non-interactive.",
   "created_utc": 1703626056,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1eqs1",
   "message": "love bombing and baseless compliments/over the top statements or gestures.",
   "created_utc": 1703626928,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1gmmf",
   "message": "Mean cheap addictions",
   "created_utc": 1703627650,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1o3ij",
   "message": "She was an incredibly weak person.",
   "created_utc": 1703630625,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf1ttid",
   "message": "If they feel familiar and comfortable right away: beware! My son’s father and I were inseparable within weeks. After we split, and months of therapy, I realized he’s an emotionally abusive narcissist exactly like my mother. My ex and my mother stayed BFFs for a long time after we split up. They both said there was something wrong with me that I didn’t like it. I’m sure there are healthy relationships that feel right, comfortable from the beginning, but not for me.",
   "created_utc": 1703632993,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf22r2y",
   "message": "She tried stabbing me in the neck…. Needless to say I dipped she actually is in prison for shooting the dude she started dating after me so ….",
   "created_utc": 1703636784,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2gf8y",
   "message": "The energy of mental instability.",
   "created_utc": 1703642685,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2tr3j",
   "message": "“Geez, it’s just a joke, you’re so sensitive.” Meanness isn’t a joke, and no, I’m not too sensitive.",
   "created_utc": 1703648757,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2wiui",
   "message": "Respect for time. I don't have to date now fortunately but I can see it when my younger co workers talk about their dating experiences. Back in my 20's I would accomodate flakiness but in retrospect the flaky dates and relationships never worked out. I think it's because if someone isn't going to respect your time then they're not going to respect you and also probably not really ready for a relationship.",
   "created_utc": 1703650084,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2zlzd",
   "message": "Putting in no effort. For example:\n\n\nHim: We should meet up.\n\nMe: Okay, what's your schedule like? \n\nHim: Open. \n\nMe: Okay, I work Monday to Friday 9-5, does Saturday at noon work for you? \n\nHim: Sure.\n\nMe: What do you wanna do?\n\nHim: Whatever you wanna do.\n\nMe: Do you wanna get coffee?\n\nHim: Sure.\n\nMe: Do you have anywhere in particular that you like?\n\nHim: Not really.\n\n\nLike, go off king. Give me less. This is the kind of person that gets into a relationship with someone they don't like, but stays in it for two and a half years because they don't want to go back to making their own decisions.",
   "created_utc": 1703651646,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf347ll",
   "message": "Oh man, I have a handful!\n\n- when he says all his exes are crazy (he's the problem)\n\n- when he's resentful towards every ex, regardless of how amicable the breakup was (emotional immaturity)\n\n- clearly has mental health problems he is refusing to address (you cannot \"fix him\" and you're just asking for a stalker and/or harassment)\n\n- he's super, super clingy, to the point of getting upset if you don't reply to a text within 5 minutes (he'll try to control you)\n\n- for you 15 year olds or close to that age... that man in his 20's is not it. Don't even entertain the thought just because you enjoy the attention he's giving you edit: man, woman, whatever the hell they are",
   "created_utc": 1703654058,
   "score": 3,
   "submission_id": "18rblzd"
  },
  {
   "comment_id": "kf2nydf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rblzd"
  }
 ]
}