{
 "submission_id": "18rbiqq",
 "title": "What was the “…seriously?” gift you opened this Christmas?",
 "selftext": "",
 "created_utc": 1703607208,
 "permalink": "/r/AskReddit/comments/18rbiqq/what_was_the_seriously_gift_you_opened_this/",
 "score": 90,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rbiqq/what_was_the_seriously_gift_you_opened_this/",
 "comments": [
  {
   "comment_id": "kf10x6g",
   "message": "When my wife and I first got married her parents hated me. One year they got me a woman's sweater. It was very obviously a woman's sweater too. The next Christmas I wore it over and my MIL asked my wife why I was wearing a woman's sweater.",
   "created_utc": 1703621588,
   "score": 114,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0nh3k",
   "message": "I got put into a 10k run. Unbeknownst to me",
   "created_utc": 1703616364,
   "score": 189,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0r1un",
   "message": "My grandparents gave my parents a framed picture of a random little boy and nobody knows who it is\n\nEdit: no it’s not the one that came with the frame",
   "created_utc": 1703617736,
   "score": 180,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0mhlt",
   "message": "A shoe size measuring tool. Like a full on metal one that’s you’d see at a shoe store.",
   "created_utc": 1703615987,
   "score": 85,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0nyuh",
   "message": "A company Christmas party at restaurant by the canyon. . Great prime rib dinner and open bar. Only this year the announcement was made at the end of the night that everyone had to pay for their own stuff this year. Seriously, no warning lol.",
   "created_utc": 1703616552,
   "score": 146,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0n0zc",
   "message": "A personalized gift with my name misspelled",
   "created_utc": 1703616197,
   "score": 191,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0nlqx",
   "message": "My sister and I bought each other the same orchid Lego set 🤣 it was a good \"seriously\" moment lmfao",
   "created_utc": 1703616412,
   "score": 174,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0lt20",
   "message": "A bar set with very nice glasses from someone who knows I quit drinking after 30 years of alcohol abuse and a fatty liver disease diagnosis.  It was my mom. My family just cannot process the idea of not consuming liquor every day.",
   "created_utc": 1703615723,
   "score": 198,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0fzws",
   "message": "Two headbands bought at a craft fair. I'm 35 and have never worn headbands in my life. That was the only thing I got. Which is fine, just confusing. Thanks, mom.",
   "created_utc": 1703613486,
   "score": 98,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0op6q",
   "message": "My mom made pineapple upside down cake for dessert because she said she knows it’s my favourite… I’m allergic to pineapple",
   "created_utc": 1703616831,
   "score": 125,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0e0pp",
   "message": "I keep getting kitchen appliances every year, despite making it very well known I don't have a square inch of countertop space to spare in my kitchen.",
   "created_utc": 1703612719,
   "score": 229,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0h2m4",
   "message": "12 baking sheets.",
   "created_utc": 1703613899,
   "score": 8,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0gbn8",
   "message": "I once got a beard trimmer only to discover that it had been used and put back in the box with curlies!",
   "created_utc": 1703613611,
   "score": 57,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf01s7p",
   "message": "Whitening toothpaste. That's all I got.",
   "created_utc": 1703607849,
   "score": 252,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0tb7n",
   "message": "Okay mine was a good \"seriously?\"\n\nMy boyfriend's grandma is getting me a diamond ring. NOT AN ENGAGEMENT RING. \n\nShe and I had gotten dinner while he was on a 3 week trip. She had a really unique diamond ring and I complimented the setting. So we got lunch on the 23rd so she could give me my Christmas present. I opened the box and was really confused because it was little plastic rings. I thought it was maybe something craft related (I crochet). Turns out it was for sizing a ring. And a piece of paper under it showing me the ring that was being custom made. \n\nSo yeah. She said it's a good \"every day diamond\". So now I'm apparently a woman who has every day diamonds.",
   "created_utc": 1703618611,
   "score": 216,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0j9hu",
   "message": "Recovering gambling addict here, thankfully I managed to kick the habit before it totally ruined my life. This year I got a bunch of lottery scratch off cards. Had my wife do the honors with them, and joke is on my family, they actually won a decent amount of money. Nothing life changing but will definitely pay for some bills we knew were on the way. \n\nYes, they knew about my addiction. They still have gotten me Texas hold-em poker sets when those were en vogue, and other gambling related stuff over the years. Despite my continued insistence they not, and pointing out that some of these would be like giving a recovering alcoholic a gift card to the liquor store.\n\nAh, the gift of not being heard",
   "created_utc": 1703614742,
   "score": 35,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0flgw",
   "message": "3 bottles of wine. Every year for the past eight years I work in to a conversation with this person that I don’t drink.  Usually at a dinner or party “can I get you a drink?”  Thank you, I’m good with water, I don’t drink alcohol.  \n\nEvery year I get wine.",
   "created_utc": 1703613329,
   "score": 179,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0fctd",
   "message": "I'm bald. I got shampoo...",
   "created_utc": 1703613236,
   "score": 160,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0nai6",
   "message": "The ai generated targeted shirts my grandparents order off of Facebook",
   "created_utc": 1703616297,
   "score": 56,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0gic4",
   "message": "A bird house made out of bird seed.\n\nThe premise of the gift is for the birds to eat themselves into homelessness?",
   "created_utc": 1703613682,
   "score": 84,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf06y7p",
   "message": "Cheese slicers...didn't have any until now. For some reason my family thought it would be funny to get me FIVE different ones..",
   "created_utc": 1703609934,
   "score": 125,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0bkz2",
   "message": "Case of toilet paper?  \nSo 2020.",
   "created_utc": 1703611765,
   "score": 204,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf00brn",
   "message": "Bag of pretzels from MIL",
   "created_utc": 1703607250,
   "score": 198,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0q95d",
   "message": "This was an internal \"seriously\" that is now a running joke. I love whiskey and Star Wars. A few years ago, my wife got me a really cool Stormtrooper decanter and I absolutely love it! Then a few months later I got a promotion and my old branch gave me the same decanter as a going away gift. Then I got one from secret Santa last year. Now my Brother in Law is 21 and he is excited. He got me the same decanter.\n\nThe great part is I love Star Wars and always have room for duplicates. Now I have a stormtrooper army to hold my whiskey. Plus somehow the original my wife got me is a higher quality so I will never mix it up with the others. I love them all but have to laugh at it lol.",
   "created_utc": 1703617429,
   "score": 248,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0czp0",
   "message": "First gift I opened said it was from my mom. There was a small jewelry box which I opened to find FOUR MOLARS. \n\nMy sister starts cracking up. They’re her wisdom teeth LMAO. Her husband even found something with my mom’s handwriting on it to make the tag believable.",
   "created_utc": 1703612317,
   "score": 219,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0plol",
   "message": "My sister got a book from my grandmother titled “Proper Etiquette.”\n\nShe proceeded to tell her in front of the whole family that “She’ll be more likely to make the boys stay after reading it!”\n\nMy sister just smiled and carried on.",
   "created_utc": 1703617178,
   "score": 17,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0kpwm",
   "message": "A $50 visa gift card from an extended family member. You see, I had also gotten her a $50 visa gift card. We basically both made it harder for ourselves to spend the money we already had.\n\nEdit: I'm normally known for giving very thoughtful and personalized gifts, so I kind of hate that this comment is blowing up, lol. This person is on my partner's side of the family, and I was very specifically instructed to get her a visa gift card, as \"she is very picky\" and apparently often does not like the gifts that she receives... :') looks like the joke is on me, I guess. and her. and NOT on visa.",
   "created_utc": 1703615303,
   "score": 90,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0lxs6",
   "message": "My dad gave me a hammer and pliers from his extensive tool collection. Wrapped it and everything 🤣\nPut it the gift bag with the baking dish he got me( which I wanted).\n\nI was like wtf until I realized the other day I told him I don’t know what happened to my pilers or hammer.",
   "created_utc": 1703615774,
   "score": 10,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf05ix3",
   "message": "Something they knew I'm allergic to",
   "created_utc": 1703609364,
   "score": 168,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf06k83",
   "message": "Not me but my husband... his mom got him a tshirt with an ugly monkey in an army uniform on it, weird but whatever, that is until she told him she got it because she thought it looked like him. 😂",
   "created_utc": 1703609778,
   "score": 192,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf099r0",
   "message": "A Blu Ray movie we aren’t equipped to watch.",
   "created_utc": 1703610858,
   "score": 106,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf09p1q",
   "message": "My brother gave me a bright orange wallet. Because you like orange so much, he said while flashing the wallet I gave him a few years ago. It's red. He's colour blind.",
   "created_utc": 1703611024,
   "score": 81,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0e9ig",
   "message": "The same holiday set of shitty body wash I’ve been throwing away since I was like 17\n\nEdit: to stop the notifications the throwing away bit was for dramatic flair- it’s already in the donate bag with some other well-meant but not useful to me gifts that I’ll donate next week.",
   "created_utc": 1703612815,
   "score": 82,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0a9jr",
   "message": "I got pants that are like eight sizes too big from my dad, again. The same thing 4 years in a row. Even though we have the size discussion every year and I buy the majority of my pants from their stores for like $4.00 because I destroy them at work anyway. 😔",
   "created_utc": 1703611248,
   "score": 25,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0a6nb",
   "message": "My husband knows I'm a huge health nut, so he had several gifts for me and one of them included this big 10 lb bag of wheat grass. He even put a red bow on it and everything....",
   "created_utc": 1703611218,
   "score": 138,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf09v4h",
   "message": "My MIL,  is very much a theme giver.  My husband gets all things WVU because we’re alumni.  My son gets everything saxophone related because that is what he plays.  My daughter gets gifts with cats be he likes cats.  I have been dealing with breast cancer for the past year.  My birthday and Mother’s Day gifts were breast cancer related.  I told  to please not do that for Christmas.  Well, she didn’t listen.  She got me a breast cancer awareness shirt, Christmas ornament (because nothing screams  Christmas like cancer), and a table top snow man decorating a Christmas tree with breast cancer ribbons.  🤦‍♀️. I was polite and said thank you but inside I wanted to scream ‘are you kidding me!’.   I’m not sure if it is all going to good will or the trash.",
   "created_utc": 1703611090,
   "score": 139,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0bkbx",
   "message": "I got a REALLY nice whiskey set from the MIL. Four tumblers, 12 bullet ice cubes, a decanter, and a high priced bottle of whiskey.\n\n\n\nI don't drink.....",
   "created_utc": 1703611758,
   "score": 149,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0in6b",
   "message": "[deleted]",
   "created_utc": 1703614504,
   "score": 202,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0m0gq",
   "message": "My boss regifted me a book that she’d never read. I had given it to her last year for Christmas.",
   "created_utc": 1703615803,
   "score": 174,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0gulg",
   "message": "my brother and i got each other baldur’s gate 3 for christmas. that was hilarious.",
   "created_utc": 1703613814,
   "score": 106,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0bnsj",
   "message": "I asked for some new tool for my hobby. Opened it, happy. Next gift is apparently a companion - open it - same thing. My parents didn’t understand what they bought so I got two custom sets of the same thing. It was funny but unfortunately not useful to have two of them.\n\nEdit just because I’ve responded a few times to comments: my parents are trying so hard and they’re so well meaning but it was hilarious all around. They are also very generous about returns and whatnot, and always have been. I didn’t only get the two things so there was a lot more to enjoy while I laughed some more. They’ve had some hard times recently so they’re a bit stressed and distracted, which makes it harder for them to understand the finer points of my hobby.\nAdded edit: Something like this happens pretty much every year. My dad always gets some article of clothing that is accidentally comically small or large and for some reason it is impossible to avoid. He got a small tee shirt instead of XL this year which was also hilarious. Years ago he got a pair of 4x pants (how???) and we still laugh about it. He’s a magnet for mislabeled packages of clothing.",
   "created_utc": 1703611796,
   "score": 180,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0floa",
   "message": "a 20 year old oster hand blender that was won in a golf game and kept in a storage room until I decided to move out",
   "created_utc": 1703613331,
   "score": 34,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0mgew",
   "message": "My in-laws usually give us a gift card to my favorite restaurants (a group with a seafood place, an Italian place, a BBQ place, etc) and a note that they'll babysit the kids so we can have a date night. I look forward to it every year. \n\nThis year, they gave us a certificate to go to a religious couples retreat. We are not at all religious.",
   "created_utc": 1703615974,
   "score": 235,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf03p6v",
   "message": "Cheap bath set I'm allergic to every year twice a year for 20 years\n\nEdit:\n\nMy God! Thank you everyone for all your kindness and sharing! I cannot believe how this blew up!",
   "created_utc": 1703608630,
   "score": 84,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0jvyy",
   "message": "My ex gave me a calendar with pictures of dogs pooping for my very uptight/conventional office at work",
   "created_utc": 1703614978,
   "score": 119,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0cmpx",
   "message": "I have a 6 month old daughter. Brother figured an age appropriate gift would be a skateboard. Go figure",
   "created_utc": 1703612177,
   "score": 146,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0ybf1",
   "message": "I got my wife a 375 count pail of Reese Cups. Next year I might get her the 5 gallon bucket of pickles I found on Walmart. I'm still chasing the reaction I got the year I got her the book \"How to Talk to Your Cat About Gun Safety: And Abstinence, Drugs, Satanism, and Other Dangers That Threaten Their Nine Lives\"",
   "created_utc": 1703620560,
   "score": 9,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf03o96",
   "message": "A pair of coasters. I still live with my parents, so I don't really know why I alone was given coasters when I don't drink anything in my room besides bottled water, so these would just end up in the den with all the other coasters.",
   "created_utc": 1703608620,
   "score": 159,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0c0oa",
   "message": "I got a bottle of non-alcoholic sparkling wine from my father where the expiration date had already passed.",
   "created_utc": 1703611936,
   "score": 208,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0altt",
   "message": "I got a positive one that made me say \"seriously???\" in an excited way. My husband got me a ring with our kids birthstones and it was so unexpected and touching. I also made a comment about the stocking thing going around about mom's having empty stockings. He tries and puts a couple small things in. I mentioned it was such a fond memory having an over-stuffed stocking with a couple small gifts and loads of candy. My stocking was comically stuffed this year with some items even having to sit beside it. Bless this man.",
   "created_utc": 1703611381,
   "score": 232,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0fcme",
   "message": "I worked at an affluent condo on Palm Beach island when I was in my early 20s. Most of the residents would give cash, but one lady would wrap something from her apartment to gift us. I got a book about Egypt one year and a wooden piggy bank that smelled musty and had rusted screws the next.",
   "created_utc": 1703613234,
   "score": 70,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0bp8i",
   "message": "Rub on tattoos….I have real tattoos.",
   "created_utc": 1703611811,
   "score": 103,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0iowd",
   "message": "This wasn't a gift I got, but a gift that my aunt got. She unwrapped a knife set from my grandma. I was confused at first because I had out a knife set on my Christmas list, but i assumed that she also wanted one. Plus, I already got some smaller gifts from my grandma, so while I was confused, I wasn't upset. After the aunt left, she confided in me that she wrote the wrong name on the box but was too embarrassed to take the set back 🤦‍♀️",
   "created_utc": 1703614523,
   "score": 179,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0hh6q",
   "message": "I asked for a Ring doorbell and received the cheap version that is a \"decoy\" ring doorbell.\nIt doesn't function in anyway except hang out by the door.\nNext year I'm buying what I want for myself and wrapping it up and putting it under the tree.",
   "created_utc": 1703614055,
   "score": 129,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0hyrv",
   "message": "My mother got my husband a spirograph kit. We're in our forties. She's also obsessed with Kohls.\n\nEdit: I'm really charmed by everyone's anecdotes about enjoying these things as an adult. My relationship with my mother is uhhhhh contentious and it felt very much like a saving throw gift, but dammit, I'm gonna go buy some colored pens.",
   "created_utc": 1703614243,
   "score": 141,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0oq1z",
   "message": "A book from family dollar “everything you need to know about cats” written in size 87 font. I am a 30 year old woman.",
   "created_utc": 1703616841,
   "score": 150,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0nzsz",
   "message": "My sister gave my 15 yo son a flame thrower. 🤨",
   "created_utc": 1703616562,
   "score": 211,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf079r9",
   "message": "Nothing. I got nothing for Christmas this year at all.",
   "created_utc": 1703610061,
   "score": 101,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf08gh5",
   "message": "my MIL gave us homemade applesauce and strawberry jam. she lives in Seattle, we’re in Boston. the applesauce was in a  tupperware and the jam was in jars with wax seals topped with aluminum foil. there was a packet of “blue ice” included, but everything was room temperature by the time we got it. based on the postage label, it was in transit for a week. my husband insists it’s fine to eat.\n\nedits: MIL is 90. She’s preparing to move into a senior living facility in a few months - she’s spry enough for her age, but honestly thought this was a lovely gift. She won’t be doing any cooking once she moves, so this is a one-time thing. \n\nThere is no chance the jam was canned in a hot water bath, she told me years ago that she only makes freezer jam. \n\nI’ve put everything in the freezer while my husband insists this is safe to eat. I’m not willing to risk it, but he’s an adult who can make his own gastrointestinal choices.",
   "created_utc": 1703610533,
   "score": 86,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0f1co",
   "message": "My MIL gifted my BIL and nephew toilet paper. No one else, just them, for whatever reason. I can only hope it was some kind of inside joke between them, but knowing her, it was just a bitch move.",
   "created_utc": 1703613112,
   "score": 126,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0j8zb",
   "message": "MIL got me an ugly boxed up purse with the TJMaxx clearance sticker still attached. The box it came in was dusty and damaged. \n\nShe got our family of five an expired popcorn assortment and a container of Jolly Rancher lollipops. \n\nMeanwhile, I gave her an engraved bracelet with her late husband's handwriting on it.\n\nPlease don't gift just to gift. Put a *little* thought into it or don't give anything.",
   "created_utc": 1703614737,
   "score": 253,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0lsk9",
   "message": "I asked for a jigsaw puzzle that had 300-1000 pieces. \n\nI received three jigsaw puzzles with 100 pieces each.",
   "created_utc": 1703615718,
   "score": 167,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0i9f7",
   "message": "A 10kg sack of rice",
   "created_utc": 1703614357,
   "score": 112,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0i5rd",
   "message": "my poor mom's name is joy and everything she got from my grandma was christmas themed with her name on it. i feel so bad bc i know she hates it, and who gives people christmas themed gifts ON christmas?",
   "created_utc": 1703614318,
   "score": 216,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0ayb2",
   "message": "No Christmas bonus from corporate. We had to buy our own drinks at the Christmas outing.",
   "created_utc": 1703611518,
   "score": 27,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0dx52",
   "message": "I used to give family friends gift cards to Nordstrom or whatever and I always without fail, got the Ghirardelli peppermint bark squares. Now I love those… but like the jumbo bags, the snowman variation and the minis… for years…. Annoying. I stopped giving them gifts lol",
   "created_utc": 1703612680,
   "score": 50,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf07ixi",
   "message": "A mini jewelry box for traveling from my mother. She gets me cheap jewelry every Christmas (because she likes it) and the only jewelry I wear is my wedding ring and occasional necklace. And I never travel. Lol oh well. She tries.",
   "created_utc": 1703610164,
   "score": 14,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0fh4p",
   "message": "Recently was talking with my mom about how I've cut back pretty significantly on scented products of any kind for my health as I have allergies and asthma that has gotten worse. She got me scented shower steamers because she felt I must miss the fun scented stuff. \n\n\u0026amp;#x200B;\n\nAlso, for some reason, there was an orange scented and mint scented steamer in the same box, right next to each other, so when I opened the box it smelled AWFUL. (Individually they smell fine)",
   "created_utc": 1703613282,
   "score": 219,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0gjvl",
   "message": "I didn’t get a Christmas gift…again. Nothing. Seriously? My husband promised ski lessons last year that never materialized. This year he claimed (on Christmas Day morning) that the new coat I bought on sale two months ago was my gift. Sigh. 😔",
   "created_utc": 1703613699,
   "score": 179,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0j6aq",
   "message": "A fly swatter. She told me she got it for free. Still not the worst gift I’ve ever gotten",
   "created_utc": 1703614709,
   "score": 16,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0in4o",
   "message": "Not that it actually bothers me, but it was funny that my wife got me a book that I told her I had already read and didn't particularly like.",
   "created_utc": 1703614504,
   "score": 92,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf08mg3",
   "message": "I sent my husband a screenshot of what I wanted. He got something very similar instead.",
   "created_utc": 1703610599,
   "score": 166,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0bqlp",
   "message": "A notepad with a Guinea pig wearing heart glasses that says “Guinea be productive”. I mean, it’s cute I guess, it’s just one of those things I’ll toss in my junk drawer and move around for the rest of my life.",
   "created_utc": 1703611826,
   "score": 207,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0bxvp",
   "message": "Another lynx set. Just a different brand would be good at this point. I haven't used lynx Africa since I was 14, I haven't wanted lynx since I was 14. Dove is cheap and smells loads nicer. Even pants and socks are better.",
   "created_utc": 1703611905,
   "score": 168,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0d4zq",
   "message": "A couple’s massage from my sister. My divorce is almost finalized and I’m not seeing anyone.\n\nETA: I’ve only ever gotten couples massages with my STBXH. It’s not something I’d think to do with a friend, you know? But perhaps I’ll take that route.\n\nETA: STBXH = soon-to-be-ex-husband",
   "created_utc": 1703612375,
   "score": 51,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0vl4j",
   "message": "Here's a positive one! My boyfriend got me an iPad! I still live at home and had told my parents I wanted one but they told me it was out of their price range so I thought it wasn't happening. I really wanted it to get back into drawing/animating because I was originally supposed to go to art school but I couldn't afford any of the schools I got in. I couldn't believe he got me that and he told me he did because he wanted me to follow my passions.",
   "created_utc": 1703619495,
   "score": 159,
   "submission_id": "18rbiqq"
  },
  {
   "comment_id": "kf0dum1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rbiqq"
  }
 ]
}