{
 "submission_id": "18rc52t",
 "title": "What is your favourite NSFW joke?",
 "selftext": "",
 "created_utc": 1703608888,
 "permalink": "/r/AskReddit/comments/18rc52t/what_is_your_favourite_nsfw_joke/",
 "score": 49,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rc52t/what_is_your_favourite_nsfw_joke/",
 "comments": [
  {
   "comment_id": "kf0lnbf",
   "message": "A man comes home after a day of work at the pickle factory.\n\nHis wife asks \"How was your day?\"\n\nHe replies, \"Well, I got fired.\"\n\n\"What?\" His wife asks. \"What happened?\"\n\n\"Well,\" he says, \"I just had this uncontrollable urge to stick my penis in the pickle slicer. The boss found out and he fired me on the spot.\"\n\nHorrified, the wife immediately pulls down her husband's pants to assess the damage, but everything is completely in tact down there.\n\n\"I don't understand,\" she says. \"What happened to the pickle slicer then?\"\n\nThe husband replies, \"She got fired too.\"",
   "created_utc": 1703615662,
   "score": 96,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0k01r",
   "message": "Guy comes home from the dr and says \"honey, my doctor gave me a note that says I can masturbate whenever I want\" she grabs the note from him, reads it and says \"you idiot, this says you could have a stroke at any moment\"",
   "created_utc": 1703615023,
   "score": 58,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0gerp",
   "message": "I went to a paraplegic strip club last night, \nThe place was crawling with pussy.",
   "created_utc": 1703613644,
   "score": 215,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0auxj",
   "message": "I'm slowly getting over my addiction of bestiality with wolves.\n\nI'm down to one pack a day",
   "created_utc": 1703611481,
   "score": 96,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0hse8",
   "message": "A man walks into a bar and sees a tiny man playing a tiny piano. He says to the bartender \"Hey, where did you get that?\"\n\"There's a genie in the bathroom granting wishes\" the bartender says.\nSo the man walks into the bathroom up to the genie\n\"Your wish is my command\" says the genie.\n\"I wish for a million bucks\"\n\"Wish granted\" and a million ducks appear.\nThe man leaves the bathroom and goes back up to the bartender \"that genie is hard of hearing, I asked for a million bucks not a million ducks\"\n\"Yeah, you think I wanted a 12\" pianist?\"",
   "created_utc": 1703614175,
   "score": 233,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ioph",
   "message": "Three larger women walk into a bar. A guy overhears them speaking in a thick accent, so he goes up to them and asks them “Hello! Are you three fine ladies from Scotland?”\n\nOne of the women turns around and responds in an aggressive tone “It’s Wales, you idiot!”\n\nThe man gets a look of apology, as he responds “Oh, I’m so sorry! Are you three *whales* from Scotland?”",
   "created_utc": 1703614521,
   "score": 24,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0pmfy",
   "message": "A family enters a hotel for their holiday, the father goes up to the receptionist and says: \"I hope the porn here is disabled.”\n\nTo which the receptionist replies: “It’s just regular porn, you sick fuck.”",
   "created_utc": 1703617186,
   "score": 154,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0azmi",
   "message": "A four-year old boy \u0026amp; a forty-year old man are walking through the woods at dusk.  The boy says:\n\n\u0026gt; “Wow, it’s dark and scary out here.”\n\nThe man replies:\n\n\u0026gt; “You’re telling me, kid.  I gotta walk back alone!”",
   "created_utc": 1703611531,
   "score": 132,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf09w50",
   "message": "The farmer's wife wakes up to the sound of her drunk, stumbling husband knocking their bedroom door open. He's holding a sheep under one arm. He says \"Honey, this is the pig I've been fucking.\"\n\nThe farmer's wife says, \"You drunk idiot, that's a sheep.\"\n\nThe farmer says \"I was talking to the sheep.\"",
   "created_utc": 1703611101,
   "score": 45,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf06dze",
   "message": "A guy walks into a diner.\n\nThere's a sign on the wall that says\n\nCheese sandwich - $2\n\nHandjobs - $10\n\nThe guy calls the lady over from behind the table.\n\n\"Excuse me, miss. Are you the one who gives the handjobs?\"\n\n\"Yes, I am.\"\n\n\"Well go wash your hands and make me a cheese sandwich.\"",
   "created_utc": 1703609709,
   "score": 138,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0pti8",
   "message": "A woman comes in from the golf course and tells an employee, “I got stung by a bee.” \n\n“Where?” Asks the employee.\n\n“Between the first \u0026amp; second hole” she says. \n\n“Well” the employee says, “your stance is too wide.”",
   "created_utc": 1703617262,
   "score": 251,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0gib8",
   "message": "You gotta hand it to blind prostitutes",
   "created_utc": 1703613682,
   "score": 34,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0f1ji",
   "message": "A guy is working in the produce section of a grocery store when a lady interrupts him, asking \"Where's the broccoli?\"\n\nThe guy replies \"Sorry ma'am, we're out of broccoli\". And the woman walks off.\n\nA few minutes later he's filling the potato bin and the same woman interrupts him asking \"Where's the broccoli?\"\n\nHe looks at her and says politely \"I'm very sorry ma'am, we've run out of broccoli, we'll have some more tomorrow. \"\n\nAnd the woman walks away.\n\nMinutes later the guy is interrupted for the third time by the same lady asking \"Where's the broccoli?\"\n\nThe man looks at her and says \"Humor me for a minute. Spell 'cat' like in catastrophe \".\n\nC A T the woman replies.\n\n\"Good\", says the man. \"Now spell 'dog', as in dogmatic.\"\n\nD O G says the woman.\n\n\"Perfect\", says the ma'am with a smile. \"Now spell 'fuck', as in broccoli.\"\n\n\"There is no fuck in broccoli!\" Cries the woman.\n\nAnd the man yells \"That's what l keep telling you!\"",
   "created_utc": 1703613114,
   "score": 178,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf05s10",
   "message": "What happens when you cross human sperm with a goat? You get kicked out of the petting zoo!",
   "created_utc": 1703609465,
   "score": 200,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0gski",
   "message": "“Dad, why did you name my sister Teresa?”\n\n“Your mom did. It’s an anagram for Easter, which is her favorite holiday. We named all you kids with an anagram of something she loves.”\n\n“Oh. Ok, thanks dad!”\n\n“No problem, Alan!”",
   "created_utc": 1703613792,
   "score": 210,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0bxh7",
   "message": "The captain of the Titanic, a lawyer, and a priest are on the bridge of the ship as it’s sinking. Knowing there’s no other choice the captain issues the order, “Abandon ship! Women and children first!”\n\nThe lawyer says, “Fuck the children!”\n\nThe priest says, “Do we have time?”",
   "created_utc": 1703611901,
   "score": 84,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0bjg7",
   "message": "What's better than roses on a piano?     Tulips on my organ.",
   "created_utc": 1703611749,
   "score": 138,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0eqdj",
   "message": "A young boy is sitting on the porch with his grandpa and lights up a cigar. The little boy asks if he can have one and the grandpa thinks for a moment and asks “can you dick touch your assholw”? The little boy confused says no. Grandpa says then you are too young now scram. The little boy comes back a while later and grandpa is drinking a beer. The boy asks if he can have one and the grandpa asks the same question “can your dick touch your asshole”? And again the boy says no and is told he’s too young and to scram. Later on the boy comes back with some freshly baked cookies. Grandpa says hey can I have one or those? The boy answers with the question “can your dick touch your asshole”? Grandpa proudly exclaims that it can. The little boy then says “then go fuck your self! Grandma said these cookies are mine”!",
   "created_utc": 1703612996,
   "score": 32,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0id6v",
   "message": "If storks bring boy babies and herons bring girl babies, what type of bird brings no babies?\n\n\u0026gt;! A swallow !\u0026lt;",
   "created_utc": 1703614397,
   "score": 74,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0jrj2",
   "message": "So this guy is stranded on a desert island with Cindy Crawford. As you might guess things work out well for him, minus being stranded. But one day she finds him sitting off by himself, staring at the ocean. \n\nC: Whats wrong?\n\nG: I don’t know…look, I shouldn’t complain. It’s just, sometimes I miss talking and hanging out with the guys. It’s not you, but it’s just different. \n\nCindy thinks for a second. \n\nC: Look, there’s not much I can’t do. How about I just pretend and talk like a guy. Would that help?  We can at least try. \n\nG: Yeah. Okay. It can’t hurt. \n\nC: \u0026lt;lowers voice\u0026gt; Hey, dude. What’s goin on?\n\nG: OMIGOD YOU WONT BELIEVE THIS I’M TOTALLY BANGING CINDY CRAWFORD.",
   "created_utc": 1703614932,
   "score": 99,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0h5dk",
   "message": "What do you do when you come across a bear in the woods?\n\nWipe it off and apologize.",
   "created_utc": 1703613928,
   "score": 147,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0q1q5",
   "message": "Superman is flying over metropolis when he sees Wonder Woman completly naked sun bathing on the roof of a building. He gets really horny and decides to fly down and have a quicky. Superman does the deed in the blink of an eye then flies away just as quick. Wonder Woman sais, what was that? The Invisible Man replies, I don't know but my ass sure hurts.",
   "created_utc": 1703617351,
   "score": 212,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0dfp7",
   "message": "A Holocaust survivor dies and is in line waiting to meet god, he finally gets to the front of the line and to lighten the mood he tells god a Holocaust joke. God says that isn’t funny and the survivor says, I guess you had to be there.",
   "created_utc": 1703612491,
   "score": 19,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0jquz",
   "message": "Guys, this is serious. My grandpa just confessed that he's an addict. He's addicted to viagra.  \n  \nNobody took it harder than Grandma.",
   "created_utc": 1703614925,
   "score": 25,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0g6mj",
   "message": "Did you know, in the UK, when you turn 100 years old, you get a letter from the King?\n\nWhen you turn 14, you get a text from Prince Andrew.",
   "created_utc": 1703613558,
   "score": 3,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf06g17",
   "message": "What is the difference between Jack Daniel’s and John Wayne?\n\nJack Daniel’s is still killing Native Americans.",
   "created_utc": 1703609732,
   "score": 246,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0rty5",
   "message": "A backpacker is traveling through Ireland when it starts to rain. He decides to wait out the storm in a nearby pub. The only other person at the bar is an older man staring at his drink. After a few moments of silence, the man turns to the backpacker and says in a thick Irish accent:\n\n\"You see this bar? I built this bar with my own bare hands. I cut down every tree and made the lumber myself. I toiled away through the wind and cold, but do they call me McGreggor, the bar builder? No.\"\n\nHe continued, \"Do you see that stone wall out there? I built that wall with my own bare hands. I found every stone and placed them just right through the rain and the mud, but do they call me McGreggor, the wall builder? No.\"\n\n\"Do ya see that pier out there on the lake? I built that pier with my own bare hands, driving each piling deep into the ground so that it would last a lifetime. Do they call me McGreggor, the pier builder? No.\"\n\n\n\"But ya fuck *one* goat..\"",
   "created_utc": 1703618040,
   "score": 143,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ef9r",
   "message": "What’s the difference between a chickpea and a garbanzo bean?\n\nI wouldn’t pay to have a garbanzo bean on my face…",
   "created_utc": 1703612877,
   "score": 33,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ccxi",
   "message": "A man walks into a bar with a large bag. Inside the bag is an alligator. He removes the alligator from the bag and places him on a table, people start to gather round to see what’s going on. \n\n“Ladies and gentlemen, what I have here is a perfectly tame alligator. I can do whatever I like to him, he won’t harm me, I just have to do one simple thing to make him let go.”\n\nHe puts his arm in the alligator’s mouth. Gator gently closes his jaws around the limb, and to make him release his grip, the man taps the alligator sharply on the head with a beer bottle. The crowd are enthralled. The man does it again, but puts his leg in the alligator’s mouth. Whack with the beer bottle, gator lets go. He sticks his head in the alligator’s mouth. Gets someone else to tap it with the bottle, but it still releases.\n\nFinally, he unzips his trousers and puts his penis in the alligator’s mouth. The alligator closes its jaws, and the man whacks it with the bottle. It lets go, and the man tucks himself in and zips back up.\n\n“Would anyone else like to try that?”\n\nA woman raises her hand and steps forward.\n\n“Only if you promise not to hit me on the head with the bottle to make me let go.”",
   "created_utc": 1703612071,
   "score": 198,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0l3nt",
   "message": "Why didn't Barbie ever have kids?\n\n\n\nBecause Ken came in a different box.",
   "created_utc": 1703615452,
   "score": 92,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0oqq7",
   "message": "A man walks into a bar and orders 10 shots of vodka.\n\n\"Hold on,\" the bartender says. \"That's a lot of vodka... what's the special occasion?\"\n\nThe man responds, \"My first blowjob!\"\n\n\"Hey, that IS a special occasion,\" the bartender says. \"Tell you what, after the first 10 shots, I'll give you 5 more, on the house!\"\n\n\"Thanks,\" the man says, \"but if the first 10 don't get the taste out of my mouth, nothing will.\"",
   "created_utc": 1703616848,
   "score": 147,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0l6et",
   "message": "Why does batman wear a half face mask?\n\nTo let the police know that he is white.",
   "created_utc": 1703615481,
   "score": 35,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ut7j",
   "message": "Man goes to see a doctor and says \n\n“Yo-y-you-y-you’ve g-got-got t-t-t-to h-hel-help me. I-I-I-I h-ha-h-hav-h-have t-this t-t-t-te-terri-terrible s-stutter” \n\nThe doc says \n\n“okay let’s run some tests.” \n\nThey run the tests and the doc comes back and says\n\n“Well we’ve determined the cause of the stutter. It turns out that all of the blood that your brain should be using for speech is actually in your penis which is significantly larger than the average and that’s why you’re having such trouble speaking. I can shorten your penis and that should fix the issue”\n\nThe man thinks it over and agrees to have his penis shortned. \n\nA few weeks pass and the guy returns to the doctors office \n\n“Doc you’ve got to give me back my old penis. I wanted my speech fixed so I could talk to women but now we get home and they think my penis is small and weird” \n\nThe doctor says\n\n“G-g-g-go f-f-fu-fuck y-y-yo-yourself”",
   "created_utc": 1703619192,
   "score": 35,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0o4ro",
   "message": "I got fired from the sperm bank yesterday. \nApparently you're not allowed to nudge the nearest co-worker and say \"get a load of this guy\" every time someone walks in.",
   "created_utc": 1703616615,
   "score": 121,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ht8b",
   "message": "Did I tell you about the blind girl I have been fucking?\n\nShe told me that I have the biggest cock she ever had her hands on.\n\nI told her she was pulling my leg!",
   "created_utc": 1703614184,
   "score": 115,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0npnj",
   "message": "A man has been declared the most eligible bachelor on earth, women from all around are vying to marry him. He sees many women but narrows it down to 3 women and they plead their case as to why they should be chosen. \n\nThe first woman is a CEO. She says “if you choose me, you will never worry about money again - you will live out the rest of your days in luxury.“\n\nThe second woman is a famous chef. She says “if you choose me, I will cook all of your meals every day - anything you want to eat at your fingertips.”\n\nThe third woman is an explorer. She says “if you choose me, we will travel the globe together - I will show you the wonders of the planet.”\n\nThe man considers his options, he thinks long and hard. Finally, he comes back and picks the one with the biggest boobs.",
   "created_utc": 1703616454,
   "score": 115,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0mllr",
   "message": "A kid and his grandpa are sitting on a bench, overlooking the park.  Grandpa says, \"You know, son, this park was dedicated to all of the soldiers from World War I.\". Kid rolls his eyes and goes, \"Yeah.  Tell me something I don't know, Grandpa.\". Grandpa says, \"Did you know I can stick my entire fist into your Grandmother's asshole?\"",
   "created_utc": 1703616031,
   "score": 134,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0izem",
   "message": "Q: What’s the first thing to come out of a boy’s penis when a girl touches it?\n\nA: The wrinkles.",
   "created_utc": 1703614634,
   "score": 62,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf091lu",
   "message": "Dracula walks into a bar and sits down in an exhausted manner tired and ready to head into his coffin.\n\nThe bartender comes up and says \"Hey, Drac....what will you be having today? The usual?\n\nDracula says \"Nah, just a cup of hot water please.\"\n\nThe bartender says \"Just hot water? OK. Let me know if you want anything else.\n\nSo the bartender brings over the cup of hot water, sets it down in front of Dracula and says \"Are you sure I can't get you anything else?\n\nDarcula takes a used tampon out of his pocket and puts it in the cup of hot water and says \"Nope, just tea for me tonight.\"",
   "created_utc": 1703610768,
   "score": 100,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0q49f",
   "message": "Gynaecologist wants to change career path to become a car mechanic.\nHe goes through school and what not and eventually it is time for the final test. \nTear down an engine and put it back together. Said and done the teacher comes back with the results and congratulates the gynaecologist  for receiving 150% correct on the test.\n\nThe gynaecologist is confused, -how could I have gotten 150% on a test?\n\nWell, said the teacher. You got 50% for tearing the engine down, 50% for putting it back together. And another 50% for doing it all through the exhaust pipe, astonishing work!",
   "created_utc": 1703617377,
   "score": 81,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0k34r",
   "message": "How can you tell when a car mechanic is in love?\n\nTwo clean fingers.",
   "created_utc": 1703615057,
   "score": 77,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0a4jf",
   "message": "A blonde, a redhead, and a brunette are sitting in a coffee shop after a night of heavy drinking at the bar.\n\nThe blonde says, \"I got so drunk last night, I went home and blew chunks!\"\n\nThe redhead says, \"You think that's bad? Remember the creepy old guy at the bar? I got so drunk I took him home and fucked him!\"\n\nThe brunette says, \"That's nothing! I was so drunk I took the whole band home last night and let them run a train on me!\"\n\nThe blonde says, \"Nah, you don't get it! Chunks is my dog!\"",
   "created_utc": 1703611195,
   "score": 21,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0i6v3",
   "message": "A guy is out hunting with his buddy and he is looking through the scope of his gun and says \"Hey I can see your house from here and your wife is cheating on you with another man.\" The other guy says \"oh that's it I've had it with her. Shoot her in the head and him in the Johnson\". The first guy says \"I'll get that in one shot\".",
   "created_utc": 1703614330,
   "score": 157,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0hwm5",
   "message": "What’s reverse exorcism? It’s when the devil tells the priest to get out of the child.",
   "created_utc": 1703614220,
   "score": 190,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0dtgi",
   "message": "my penis is only six inches     \n     \nbut it smells like a foot",
   "created_utc": 1703612641,
   "score": 176,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf09j6x",
   "message": "What’s the difference between a lightbulb and a pregnant woman?\n\nYou can unscrew a lightbulb.",
   "created_utc": 1703610960,
   "score": 138,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0swc2",
   "message": "What do you call a discount circumcision?\n\nA rip off",
   "created_utc": 1703618450,
   "score": 41,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0so7m",
   "message": "are limericks allowed?\n\nThere was a young vampire called Mable,\n\nWho's periods were incredibly stable.\n\nEach night of the full moon,\n\nShe took out a spoon, \n\nand drank herself under the table.",
   "created_utc": 1703618364,
   "score": 52,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0cn1d",
   "message": "What do a burnt pizza, a frozen beer and a pregnant woman have in common? They all involve an idiot who forgot to pull out on time",
   "created_utc": 1703612181,
   "score": 91,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0p0i3",
   "message": "A pirate walks into a bar wearing an eye patch, a peg leg, and a steering wheel. Bartender says, “I understand the eye patch and the peg leg, but what’s with the steering wheel?” Pirate responds, “Arr it drives me nuts.”",
   "created_utc": 1703616953,
   "score": 33,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0snpl",
   "message": "One day a teenage boy is in the garden and pulls a bunch of carrots out. He puts them in the kitchen and, tired, decides to go for a nap.\n\nThat evening he’s in his room and hears some strange noises coming from his older sister’s bedroom. He sneaks up, opens the door and spies her masturbating with one of the vegetables he pulled out of the ground earlier that day.\n\n“Awww, I was going to eat that later,” he grumbles, “and now it’s going to taste like carrot.”",
   "created_utc": 1703618359,
   "score": 45,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0guyc",
   "message": "How many police officers does it take to change a lightbulb? \n\nThey don’t. They arrest the lightbulb for being broke and beat the room for being black",
   "created_utc": 1703613818,
   "score": 197,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0l9c7",
   "message": "\"I bet you can't tell me something that will make me both happy and sad at the same time,\" a husband says to his wife. She thinks about it for a moment and then responds, \"Your penis is bigger than your brother's.\"",
   "created_utc": 1703615512,
   "score": 69,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0wrq2",
   "message": "A man and wife are driving to a dinner reservation when they hit a skunk. \n\nWife: \"OMG! stop we hit something!\" \n\nThey exit the car...\n\nWife: \"It's a skunk, we have to take it to the vets!\" \n\n*The husband knows his wife is animal-obssessed, and will lose the argument so agrees*\n\nWife: \"It's so cold, what should I do?!\" \n\nHusband: \"Just put it between your legs.\" \n\nWife: \"What about the smell!?\" \n\nHusband: \"Just hold its nose.\"",
   "created_utc": 1703619957,
   "score": 15,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf1dipm",
   "message": "A farmer confides in his friend that his prized bull seems to have lost all of its libido, it won’t impregnate the cows. His friend says, “just play some regular porn in the barn all night. Sounds weird but trust me.” The farmer tries it and the very next morning the bull mounts a cow. The farmer is ecstatic until the bull pulls out and cums on the cow’s face.",
   "created_utc": 1703626455,
   "score": 16,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0iqd9",
   "message": "What does a pizza delivery person have in common with a gynecologist?\n\nThey both can smell it but can’t eat it.",
   "created_utc": 1703614539,
   "score": 55,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0lgv7",
   "message": "Someone I knew in college came up with this one: \n\nWhat do you call a lactose intolerant masturbator?  \n\n\n\n\n\nA non- dairy creamer.",
   "created_utc": 1703615593,
   "score": 51,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0p06n",
   "message": "A man sees a gorgeous nun walking up the street and being a lusty pervert, he tails her to a bus stop and eventually into a city bus. \n\nThe man, seated near the front of the bus, is eyeing the demure nun, herself seated near the rear, when a voice says to the man, “psst - hey pal!  You wanna fuck that nun?  I can tell you how for $200.”\n\nThe man turns to see the bus driver of all people, a kindly looking fellow, was who spoke up.  The man quickly forks over $200 and demands the driver reveal how it’s done. \n\n“At midnight on Thursdays,” the driver says, “she takes the bus to the city park, kneels in front of the statue of St Michael, and prays for confession. If you were to look like a priest and show up, she’d do anything, and I mean *anything!*”\n\n\nThe man quickly heads home and by the time Thursday night came around he made his way to the park, hiding in the shadows in his recently-rented priest costume, and sure enough the nun came walking toward the dark outline of the statue of St Michael.  \n\nThe “priest” approaches, hearing the gentle sobs mixed with lusty moans from the nun in twisted prayer.  The man says, “my child, it appears you are in need of confession…”\n\nThrough the shadowy gloom, the man sees the nun’s startled eyes. She says “oh yes, father, I … I confess that I need … my ass fucked, hard!”\n\nThe man smiles wickedly as the nun lifts her habit, and in the darkness he plunges into her asshole.  \n\nAfter he’s finished, the man laughs proudly, rips off his priests collar and says, “you stupid bitch!  I’m not a priest!  I’m the guy from the bus!”\n\nThe nun rips off her habit and says, “joke’s on you, pal; I’m the bus driver!”",
   "created_utc": 1703616950,
   "score": 54,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0qc0x",
   "message": "\n\n\nAs Mickey and Minnie were before the judge in divorce court, the judge looked at Mickey and said, \"Listen here, Mr. Mouse, I cannot grant you a divorce from Minnie.\"\n\"But why not, Your Honor?\" a stunned Mickey asked.\n\"I have reviewed all the information you submitted to the court and I can find no evidence to support the allegation that she's crazy,\" explained the judge.\n\"Your Honor,\" Mickey exclaimed, \"I didn't say she was 'crazy', I said she was fucking Goofy",
   "created_utc": 1703617460,
   "score": 46,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0s01h",
   "message": "Saw in the video the other day,\n\nHow does a deaf gynaecologist communicate?\n\nHe reads lips.",
   "created_utc": 1703618107,
   "score": 14,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0nsb1",
   "message": "What's green and smells like pork? \n\nKermits fingers",
   "created_utc": 1703616482,
   "score": 14,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf08kf7",
   "message": "What did the elephant ask the naked guy?\n\n\"How do you breathe with such a small trunk?\"",
   "created_utc": 1703610577,
   "score": 112,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0fx7j",
   "message": "How does every racist joke start out? -Looks over right shoulder then left.-",
   "created_utc": 1703613457,
   "score": 37,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0j2qo",
   "message": "A hillbilly girl goes to her father and asks to borrow his pickup truck.\n\nDaddy says; \"You know what you have to do\", and starts unzipping his fly.\n\nThe daughter goes down on him and quickly spits it out and exclaims; \"Oooh, it tastes like shit\"\n\nThen Dad slaps his forehead and says; \"Oh year, your brother already borrowed the pickup.",
   "created_utc": 1703614670,
   "score": 36,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf09c4v",
   "message": "Why necrophiliacs have such a frustrating sex life?\n\n\n\n\nSuitable partners are hiding under a rock.",
   "created_utc": 1703610884,
   "score": 75,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0gvdg",
   "message": "What's the difference between jelly and jam?\n\nI can't jelly my dick in your ass.",
   "created_utc": 1703613823,
   "score": 47,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0qyo9",
   "message": "What is the difference between a tribe of Pygmies and a woman's track team?\n\nOne is a cunning bunch of runts...",
   "created_utc": 1703617701,
   "score": 12,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0hjo4",
   "message": "What’s the hardest part about being a pedophile? Fitting in.",
   "created_utc": 1703614081,
   "score": 65,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0kah1",
   "message": "What do you get when you fingerbang a Gypsy on her period?\n\nYou get your palms red.",
   "created_utc": 1703615136,
   "score": 23,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0iczz",
   "message": "What do you call cumming inside a woman?\n\nLoading the dishwasher",
   "created_utc": 1703614395,
   "score": 33,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0gwv6",
   "message": "Girl, are you from Ireland? Because every time I see you my penis be Dublin",
   "created_utc": 1703613840,
   "score": 78,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf04te3",
   "message": "How do you make a woman scream twice?\n\nFuck her in the ass then wipe your dick on her curtains.",
   "created_utc": 1703609079,
   "score": 86,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ghwo",
   "message": "It's the 1700s and a British anthropologist is doing some research on Native American tribes.\n\n\nHe settles next to a friendly tribe and begins writing notes on their garments.\n\n\nHe goes to one man and asks about the 3 feathers in his hair.\n\"This?\" asks the Native. \"This means I have fucked 3 women!\"\n\n\n\"Oh my!\" says the anthropologist. He writes his notes and moves on.\n\n\nHe goes to a Native woman with numerous feathers in her hair and asks about them.\n\"This means I have fucked many men!\" she proudly proclaims.\n\n\"Oh goodness gracious,\" exclaims the anthropologist. And he moves on.\n\n\nThe anthropologist then comes across the chief wearing a headdress with countless feathers along with necklaces of all kinds.\nHe goes to the chief and asks, \"what does all this mean?!\"\n\n\nThe chief smiles broadly and says, \"it means I have fucked MANY women!\"\n\n\n\"And the necklaces with the bones and teeth?\" asks the anthropologist.\n\n\n\"These? These mean I have fucked many dogs and cats.\"\n\n\n\"Oh dear!!!\" grimaces the anthropologist.\n\n\nThe chief shakes his head. \"Nonononono... deer no good. Run too fast, pussy too high.\"",
   "created_utc": 1703613677,
   "score": 43,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0lekf",
   "message": "In their divorce case, Mickey says he never said Minnie was crazy - he claimed she was fucking goofy.",
   "created_utc": 1703615568,
   "score": 44,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0h0zp",
   "message": "What’s the difference between my wife and my sunglasses?\n\nMy sunglasses sit higher on my face.",
   "created_utc": 1703613882,
   "score": 31,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0kbju",
   "message": "What do 9 out of 10 people enjoy?\n\nGangrape",
   "created_utc": 1703615147,
   "score": 34,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0kwvm",
   "message": "A Priest and a Rabbi escape death from a head on collision between them . To celebrate this miracle the Rabbi suggests we must take a shot each to thank God. The priest drinks and tells the Rabbi to take his. The Rabvi replies, 'nope I'll wait for the cops'",
   "created_utc": 1703615379,
   "score": 34,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0j9sr",
   "message": "This joke is awful to hear, but it's my favorite. Read at your own risk.\n\nA man walks into a brothel. He approaches the woman at the front desk and says,\n\n\"Excuse me, I'd like to have sex in exchange for $5\"\n\nThe receptionist thinks for a second and replies,\n\n\"You want Brenda, she's down for anything. Head to third floor, first door on the left.\"\n\nThe man makes his way to Brenda, he meets her in her room. She's not much to look at but she'll do he thought. He gives the five dollars and they get to work. As soon as he gets in, it's awful. It feels like sand paper and gravel. He says to her,\n\n\"I'm sorry this feels awful. Is there anything you can do about it?\n\nBrenda replies,\n\n\"For an extra five dollars I'll fix it.\"\n\nThe man says to himself \"why not\" and gives Brenda the five dollars. Brenda gets up and goes to the bathroom. She's in there for fifteen minutes before she comes back out and spreads her legs for the man. He goes back in and it feels amazing. It's the best sex he has ever has and comes in a minute. Lays on the bed panting,\n\n\"Wow that was incredible! What did you do?\"\n\nBrenda replies,\n\n\"For an extra five dollars, I pick out the scabs\"",
   "created_utc": 1703614746,
   "score": 27,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0nyl1",
   "message": "Two guys walk up to a dog that is licking its balls. \n\nGuy 1 says: “Sure wish I could do that.”\n\nGuy 2 says: “You might try petting him first.”",
   "created_utc": 1703616549,
   "score": 31,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0fkq4",
   "message": "What part of the vegetable don't you eat? The wheelchair.",
   "created_utc": 1703613321,
   "score": 19,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0jvuo",
   "message": "I have a half brother.\nHe’s only 3 feet tall.",
   "created_utc": 1703614977,
   "score": 18,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0luqu",
   "message": "Little boy and his father are chatting.\n\nBoy says, “Dad, what does a vagina look like?”\n\nFather looks at his young son and says, “Well, before sex, a vagina is an incredibly beautiful sight. Think of an opening rose in the morning sunlight with dew about the petals. It’s an amazing vision.”\n\nHis son replies, “That sounds awesome. You said, ‘before sex’. What does it look like afterwards?”\n\nDad looks at him and gruffly says, “You ever seen a bulldog eating a jar of mayonnaise?”",
   "created_utc": 1703615742,
   "score": 20,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0nakz",
   "message": "Boy comes home from school with his homework assignment. Tells his dad he has to describe the difference between potential and reality. Dad says a few things and the kid runs off. \n\nThe kid goes up to his mother and asks her, \"Mom, would you sleep with Robert Redford for a million dollars?\". She looks around, and says quietly, \"Yes, of course, but don't tell your father\".  The boy is satisfied and approaches his sister. \n\n\"Sis, would you sleep with Brad Pitt for a million dollars?\" She responds, \"OMG, yes.. Of course\". Kid says OK and runs off. \n\nThe father asks the kid if they both answered yes. He says they did. So his dad tells him this: \n\nThe difference be potential and reality is this: Potentially, we're sitting on $2M dollars, but in reality, we're living with a couple of whores.\"",
   "created_utc": 1703616298,
   "score": 23,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ovte",
   "message": "What's the difference between a drug dealer and a prostitute? \nA prostitute can wash her crack and sell it again.",
   "created_utc": 1703616903,
   "score": 17,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0rnip",
   "message": "Barbara, Alice, and Mildred were sitting on a bench outside a retirement home when a pervert walked up and flashed them. Barbara immediately had a stroke. Alice also had a stroke. But Mildred's bursitis was hurting her that day, and she couldn't raise her arms enough.",
   "created_utc": 1703617970,
   "score": 20,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0zr1t",
   "message": "Kinda long but my dad told me.  I miss you dad.\n\nA drunk guy approaches a lady sitting at the bar.\n\n\"Hey...\" He slurs, \"Canni buy you a drink?\"\n\nThe lady turns, disgusted, says, \"No, my boyfriend is in the washroom he'll be right back.\"\n\nA second later he appears at her shoulder, \"excuse me miss.... Canni kiss u?\"\n\nthe lady turns, repulsed, \"No!  my boyfriend is really tough he's gonna be right back.  leave me alone!\"\n\nA minute after that he stumbles to her side, \"Hey lady, Canni lick you all over?\"\n\n\"get lost creep!\" She exclaims.\n\nWithout leaving her side, he continues, \"Canni tip you upside down, fill your pussy full of beer and drink you?\"\n\nshe throws her drink in his face and says she's gonna tell her boyfriend. \n\nHer boyfriend returns, she tells him that some drunk guy over there wants to buy me a drink, the boyfriend looks and says \"well, it's a bar, that's what happens.\" \n\nthen she says he wants to kiss me.  well the boyfriend says \"can't blame him, you're pretty.\"\n\nShe says, \"no, you don't understand.  he said he wants to lick me all over\"\n\nnow the boyfriend rolls his sleeves and is not quite angry enough to confront the drunkard.\n\nSeeing this, she continues, \"there's more.. He said he wants to flip me upside down, fill my pussy full of beer and drink me!\"\n\nThe boyfriend rolls his sleeves back down and sits at his stool and continues sipping his drink.  \n\nUpset and confused, the lady says, \"well aren't ya gonna kick his ass?\"\n\nThe boyfriend says, 'I'm not fighting anybody that can drink that much beer.\"",
   "created_utc": 1703621129,
   "score": 18,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0ph58",
   "message": "What’s the difference between a Ferrari and a dead hooker?\n\nI don’t have a Ferrari in my garage.",
   "created_utc": 1703617130,
   "score": 10,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0dno4",
   "message": "What’s the worst thing for a woman to hear after giving Willie Nelson a blowjob?\nI’m not Willie Nelson….",
   "created_utc": 1703612579,
   "score": 17,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0823q",
   "message": "2 tramps standing at a fire, first tramp says ‘i think your dog is gay.\nSecond tramp: how can you tell?\nFirst tramp: his cock tastes like shit.",
   "created_utc": 1703610374,
   "score": 51,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0pcsx",
   "message": "Your momma is sooo fat, I pulled her panties down to her knees...... \n\n\nAnd her pussy was still in them.",
   "created_utc": 1703617084,
   "score": 29,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0iigp",
   "message": "What's the difference between a jacuzzi and a pile of dead babies? \nI don't have a jacuzzi in my bathroom",
   "created_utc": 1703614453,
   "score": 14,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0o64z",
   "message": "What’s worse than ants in your pants?\n\n\nUncles.",
   "created_utc": 1703616629,
   "score": 17,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0n44v",
   "message": "Two friends, one rich one poor, both married meet each other after a long time. After a while they talk about their wifes\n\nPoor Friend: So what did you buy your wife?\n\nRich Friend: A mercedes and a diamond ring.\n\nPoor Friend: Ok, interesting? Why those two?\n\nRich Friend: Well, if she does not like the ring, she can take the car and bring the ring back to by a better one. But what about you? What did you buy your wife?\n\nPoor Friend: Oh, thats funny. I bought my wife a dildo and some flippers.\n\nRich Friend: Ok? Do elaborate?\n\nPoor Friend: Well... If she doesn't like the flippers, she can at least wear them and go fuck herself.",
   "created_utc": 1703616231,
   "score": 8,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0noiz",
   "message": "What do you call two lesbians in a closet?\n\nA liquor box",
   "created_utc": 1703616442,
   "score": 9,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0o1k5",
   "message": "Whyd the guitar teacher go to jail?\n\nFor fingering A minor",
   "created_utc": 1703616580,
   "score": 8,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0pd6h",
   "message": "Whats the worst part about having sex with your grandma?\n\nYou keep banging your head against the lid of the coffin.",
   "created_utc": 1703617088,
   "score": 8,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0wr83",
   "message": "My dad told me this yesterday on Xmas.\n\n\"What is the benefit of being a Dr who operates on newborns giving them cirsumsicions? ...They make good money and get to keep all the tips.\"\n\nYeah he's 65 and I'm at that point where I just roll my eyes.",
   "created_utc": 1703619951,
   "score": 8,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0hd87",
   "message": "[Funkhouser telling Jerry Seinfeld a joke in Curb Your Enthusiasm](https://youtu.be/yqBPJPzehZE?si=i9_dWZjyTowrEO_0) is pretty hilarious.",
   "created_utc": 1703614012,
   "score": 35,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0lfj6",
   "message": "What do alcoholics and necrophiliacs have in common? They both like to crack open a cold one.",
   "created_utc": 1703615579,
   "score": 13,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0k6sm",
   "message": "Hot sweltering day two guys working see a dog licking it’s balls. One guy says I wish I could do that! The other guy says I’ll hold his head he look’s viscous",
   "created_utc": 1703615096,
   "score": 23,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0pvjj",
   "message": "What does my Toyota and my arsehole have in common?\n\n\nThey’re both leaking trans fluid",
   "created_utc": 1703617285,
   "score": 23,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0egjr",
   "message": "What’s the difference between a joke and two dikks?   \n\nYour mom can’t take a joke.",
   "created_utc": 1703612891,
   "score": 42,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0py90",
   "message": "Bit of a racist joke...\n\n\u0026gt;!Two black guys are walking down the street when they come across a chinese laundromat. There's a sign on the top that says \"make anything white, 50 cents\"!\u0026lt;\n\n\u0026gt;!One of the black guys says to the other, \"hey bro, let's do it.\" \"do what?\" the other responded. The first black man explains that in this current socio-political climate, life as a white man would be much easier. No more experiencing systemic racism, no more automatic jail sentences, no more getting arrested for being black on a Friday night... So the second guy says \"okay, but you first.\" The first guy walks up to the counter and says \"okay, I want you to make me white.\" The Chinese lady says \"okay okay, come this way.\" She whisks the black man to the back, and his friend could hear all manner of sprays and hydraulic movement, the occassional screams. The man come back out and admires his arms. \"My god, it actually worked....!\" The second guy open his wallet and realizes he's flat busted. \"Hey man, my turn. Let me get 50 cents.\" And the first guy responds \"get a job, n\\*\\*\\*\\*r\"!\u0026lt;",
   "created_utc": 1703617314,
   "score": 37,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0mi4s",
   "message": "Why do women have foreheads? \n\nSo you have somewhere to kiss them after you've just cum on their face.",
   "created_utc": 1703615993,
   "score": 7,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0xtqe",
   "message": "What is brown and sticky?\n\n\n\n\nA stick.",
   "created_utc": 1703620367,
   "score": 7,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0nu8v",
   "message": "Why was the Maybelline saleswoman walking funny? \n\nHer lipstick",
   "created_utc": 1703616502,
   "score": 13,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0gsz0",
   "message": "so last night i woke up in the middle of the night as i heard a noise coming from downstairs\n\n* *smack smack smack* *\n\nthe fuck is that? i thought to myself\n\n* *smack smack smack* *\n\nbetter go check it out.\n\nas i get down the stairs i notice it seems like it’s coming from the kitchen.\n\n* *SMACK SMACK SMACK* *\n\nit’s in the freezer!!\n\n* *SMACK SMACK SMACK SMACK SMACK* *\n\nI open the freezer\n\n**WHAT THE FUCK**\n\nInside the freezer is an alien masturbating!\n\nHe says: I cum in peas.\n\n\n*ta da*",
   "created_utc": 1703613797,
   "score": 31,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf0rnx2",
   "message": "I got a vasectomy because I didn't want children. When I got home they were still there.",
   "created_utc": 1703617975,
   "score": 6,
   "submission_id": "18rc52t"
  },
  {
   "comment_id": "kf2br32",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rc52t"
  }
 ]
}