{
 "submission_id": "18reh1o",
 "title": "Women in your 40s, would you be open to a long term commited relationship where you and the partner did not live together?",
 "selftext": "",
 "created_utc": 1703614886,
 "permalink": "/r/AskReddit/comments/18reh1o/women_in_your_40s_would_you_be_open_to_a_long/",
 "score": 24,
 "url": "https://www.reddit.com/r/AskReddit/comments/18reh1o/women_in_your_40s_would_you_be_open_to_a_long/",
 "comments": [
  {
   "comment_id": "kf0m6r6",
   "message": "Not quite 40 but yes, I like having my own space",
   "created_utc": 1703615869,
   "score": 23,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf0s00v",
   "message": "If I want to have children, then no. If I'm not having kids then yes. I really like my own space and not having to manage another adult.",
   "created_utc": 1703618106,
   "score": 19,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf0yui9",
   "message": "I'm past my forties, but yes. I like having my own space where I control how it looks, how clean it is, who comes over, etc.",
   "created_utc": 1703620770,
   "score": 13,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf0mnai",
   "message": "I’m not the demographic you’re looking for, but I just want to say that there’s someone for everyone out there. You can absolutely find people that are in their 40s and beyond that do not want to or care to share a living space with a long term partner. Honestly I’d argue that it gets easier the older you get because people get settled in their own home and their own ways and changing heir whole life is not as easy.",
   "created_utc": 1703616049,
   "score": 11,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1ae34",
   "message": "Yes, this is the dream.",
   "created_utc": 1703625246,
   "score": 8,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf15vvk",
   "message": "Definitely, for the same reasons as many here in that I like my space. My then-BF-now-husband only moved in after 7 years because it made no sense to pay two mortgages when he spent most of his time at my place and my place was much more convenient for work and socializing. His dog “moved in” with me long before he did so she could play with my dog instead of being home alone during the day.",
   "created_utc": 1703623501,
   "score": 7,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1al70",
   "message": "My (m44) partner (f48) and I have been together nearly 10yrs, live separate, and are fine with it. We both like our independence and space.",
   "created_utc": 1703625322,
   "score": 6,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1abw8",
   "message": "Mid-40s F. Absolutely. No kids and no particular urgency for marriage. I had contemplated renting a house with my partner. We would be able to rent a house bigger than both our condo and apartment combined. But I still like having my own space. We see each other 2-3x per week and it’s working for us.",
   "created_utc": 1703625221,
   "score": 3,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1ff8a",
   "message": "It would be preferred. At this point in life, everyone is pretty set in their habits, and you get to the point where you like your own space. Less reasons for conflict and you don’t have to change the way you like to live.",
   "created_utc": 1703627184,
   "score": 3,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1rvvs",
   "message": "This is what the world is shifting towards.",
   "created_utc": 1703632181,
   "score": 3,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf20pl7",
   "message": "I would almost certainly prefer it. Over many years I have developed a unique schedule that works for me and like my freedom, I can't imagine finding a partner that wouldn't infringe on that if we lived together.",
   "created_utc": 1703635921,
   "score": 3,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf18jol",
   "message": "It could work.",
   "created_utc": 1703624525,
   "score": 2,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1dieq",
   "message": "It’s the only type of long term committed relationship I’d consider at this point.  \n\nMy college aged kids still live at home and I won’t subject them to living with another man (I did live with someone for 12ish years) after their experiences with my ex.  And when they eventually get out on their own I will happily live alone with my dogs and not worry about taking care of anyone else. \n\nI’m enjoying my independence and freedom, and would want to spend time someone who also enjoys theirs as much as we could enjoy being together.",
   "created_utc": 1703626451,
   "score": 2,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1vrn6",
   "message": "I did like 8 years living “together apart” with apartments in the same building. We live together now and honestly that was pretty good in retrospect.",
   "created_utc": 1703633814,
   "score": 2,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf23ox3",
   "message": "no i would not. i want to live w my partner. i like sleeping in a bed w my partner \u0026amp; waking up beside him. i don't care abt marriage, but i want a home that's both of ours. eventually i would anyway. i'd be fine w separate homes at first or even for 4-5 years. this is all theoretical however bc im not currently in a relationship. but i'd have serious issues w a man who wanted a separate home long term. i'd wonder why or what they are hiding",
   "created_utc": 1703637182,
   "score": 2,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf16ayb",
   "message": "Already in one. My boyfriend is in Scotland, I am in the US. We have been together almost 4 years.",
   "created_utc": 1703623662,
   "score": 1,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1vx96",
   "message": "I'm well over 40 but wouldn't have accepted that at any age.",
   "created_utc": 1703633880,
   "score": 1,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1y5uj",
   "message": "Already in one",
   "created_utc": 1703634828,
   "score": 1,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf1yra7",
   "message": "Hell yes!",
   "created_utc": 1703635081,
   "score": 1,
   "submission_id": "18reh1o"
  },
  {
   "comment_id": "kf2b1xv",
   "message": "This is the dream.",
   "created_utc": 1703640337,
   "score": 1,
   "submission_id": "18reh1o"
  }
 ]
}