{
 "submission_id": "18rgrzl",
 "title": "What made you breakup with your therapist?",
 "selftext": "",
 "created_utc": 1703620849,
 "permalink": "/r/AskReddit/comments/18rgrzl/what_made_you_breakup_with_your_therapist/",
 "score": 196,
 "url": "https://www.reddit.com/r/AskReddit/comments/18rgrzl/what_made_you_breakup_with_your_therapist/",
 "comments": [
  {
   "comment_id": "kf0zzu0",
   "message": "She ghosted me lol",
   "created_utc": 1703621225,
   "score": 121,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf0zsmm",
   "message": "After I had finally come up with the courage to speak about one of my traumas, she responded emphatically with, \"You're lying?!\"",
   "created_utc": 1703621146,
   "score": 207,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf108qr",
   "message": "She baby talked me",
   "created_utc": 1703621323,
   "score": 98,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf0z6oa",
   "message": "She was also secretly dating my wife.",
   "created_utc": 1703620905,
   "score": 198,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf13t3l",
   "message": "That getting molested as a child isn't as a big deal for men like it is for women.\n\nTo a me, a man, that was molested as a child and was going to therapy because of rage issues related to that.",
   "created_utc": 1703622693,
   "score": 140,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf15lfa",
   "message": "She was not helping, like at all. I would talk about my traumas, and her response would be: \"You should try getting 15 mins of sunlight each day.\" I'm not saying that won't help, but that certainly won't cure my trauma, and I'm also not going to give you $200 a week to tell me shit I can find on webMD.",
   "created_utc": 1703623388,
   "score": 70,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1d028",
   "message": "He invited me for a drink…..directly after session.",
   "created_utc": 1703626256,
   "score": 55,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf13juv",
   "message": "She told me my hallucinations were actually the result of beings from the other side trying to contact me. She said she could help protect me from these beings for an additional fee.",
   "created_utc": 1703622595,
   "score": 177,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf103zn",
   "message": "She changed my schedule without giving me a choice to 7 am calls because her other client wanted my 1pm ones",
   "created_utc": 1703621271,
   "score": 50,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf12rpn",
   "message": "She didn’t take me seriously and also overlooked what I said about my parents. My next therapist took me seriously, gave me the help I needed called cps on my parents and even though cps didn’t do anything it still made me realise I hadn’t been making stuff up or overreacting. She also helped me get an ADHD-diagnosis. She helped me more in 6 months than any other therapist did in the 7 years I was treated. I can never thank her enough❤️.",
   "created_utc": 1703622303,
   "score": 72,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf10djw",
   "message": "I felt comfortable pursuing life on my own and understood that I am in fact an alcoholic. \nBroke down some barriers I had with myself and I was able to start to turn things around. \n\nI found that some people I’ve spoken to about their therapists is that they either are too close minded or they think therapy will magically solve their issues. \n\nMy therapists didn’t have all the keys to unlock the doors I needed, but he did absolutely show how to find some of them and why I should unlock them.",
   "created_utc": 1703621375,
   "score": 34,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1dx2t",
   "message": "She couldn't keep her religion out of my therapy sessions.",
   "created_utc": 1703626606,
   "score": 56,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1plh3",
   "message": "She told me my sons brain tumour was caused by wifi.",
   "created_utc": 1703631233,
   "score": 26,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf19irq",
   "message": "I’ve left three different therapists for the same reason. Felt like I couldn’t actually tell them everything. Was afraid of judgement or just didn’t feel safe opening up completely. \n\nFinally landed with a perfect fit. Took a frustrating amount of time and money in the process, but worth it.",
   "created_utc": 1703624906,
   "score": 19,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1lasq",
   "message": "The first words out of her mouth were constantly \"I need your payment\".  She'd then end sessions over 15 minutes early.\n\nBrought her personal drama (husband abusing her, and a cancer scare) into my therapy to the point sessions were spent entirely talking about her problems.\n\nWould forget to schedule future sessions then claim she'd asked I said not to.\n\nTold me CSA couldn't have happened like I remembered it.  Cautioned me later that \"some things\" should only be talked about with her and never anyone else.\n\nStarted behaving flirtatious and wearing inappropriately revealing outfits during the times she had kicked her husband out.\n\nFinal straw was her starting to change my appt times on a whim.  Multiple times she'd text me 3-4 hrs before my scheduled time saying \"If you want a session this week you have to be here in 20 minutes.\"",
   "created_utc": 1703629491,
   "score": 23,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf16e04",
   "message": "Turned 26, no more health insurance",
   "created_utc": 1703623695,
   "score": 39,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1iwf3",
   "message": "I said that I have a problem with amphetamine use. He told me that I should switch to cocaine because the comedown is easier.",
   "created_utc": 1703628538,
   "score": 19,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf19dqz",
   "message": "When he stopped listening to what my concern were and instead chastised me about how my problems weren’t worthy. I came to him two years prior for help with anxiety and anger as the reason for starting therapy. But I was going through a privileged transaction where it all was highlighted and was using it as examples as to how each emotion manifested. I felt like when he switched to teletherapy during Covid and he was at home in a work office I felt like he just stopped listening to me and just judged by the scenario.",
   "created_utc": 1703624852,
   "score": 16,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf17tau",
   "message": "My 3:00 appointments would start at 6:30",
   "created_utc": 1703624242,
   "score": 15,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf14twy",
   "message": "Kept dumping me to the students in training—some weren’t bad…others not so much. The final straw was getting told she “didn’t know what to do with me.”",
   "created_utc": 1703623089,
   "score": 12,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1d1c1",
   "message": "Never acknowledged that I was begging to meet in person and the video session were not working at all. \n\nI’m far worse now than before.",
   "created_utc": 1703626269,
   "score": 11,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf17t0v",
   "message": "He didn't believe some of the things I told him about feeling sick. Then I got diagnosed with the medical illness. Done!!",
   "created_utc": 1703624239,
   "score": 10,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf176ed",
   "message": "Initially dismissed my suicidal thoughts as a means for garnering attention instead of it being a legitimate cry for help. She only took them seriously after I failed my second attempt. By then I basically moved on and never seen a therapist since. \n\nAlso, because financially speaking, therapy is expensive and I don't have a lot. Even with a corporate job, can't afford shit.",
   "created_utc": 1703623994,
   "score": 22,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1az29",
   "message": "She could not provide me with coping skills for depression.",
   "created_utc": 1703625470,
   "score": 9,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1ihwk",
   "message": "After venting a bit I was stressed to the point of crying and she said, “I don’t even know what you’re crying about”. I immediately stopped crying, got up, and walked out. Never saw her again. I’ve been seeing a new therapist the last few years and he’s waaayyy better.",
   "created_utc": 1703628381,
   "score": 9,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1iy76",
   "message": "He invited me to dinner at Ruth’s Chris Steakhouse following our session.  Then proceeded to order my dinner and drinks like I was his date.  \n\nShared the details of the evening with friends.  Realized it was weird.",
   "created_utc": 1703628557,
   "score": 9,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1hlkw",
   "message": "Two sessions in, before we'd even really scratched the surface of all the things I wanted to address he looked me dead in the eye and said \"You don't really want to change\" in the same tone as someone saying \"Oh come on, you're pulling my leg.\" \n\nI was floored, like... wtf do you think I'm doing in therapy if that was the case my dude!?",
   "created_utc": 1703628029,
   "score": 15,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1ar0x",
   "message": "Not me but my wife was married twice before. On numero dos husband she gets the divorce but tried marriage counseling prior to that. Went a few times alone as she couldn't talk in front of the therapist with him as he'd talk over her. Cue after divorce and the therapist wouldn't leave my wife alone. Weird late calls, full on \"you go girl\" energy, just strange. So the wife quit two people that year.",
   "created_utc": 1703625383,
   "score": 7,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1dcxq",
   "message": "She said she became a ''confort beacon'' and was no longer able to help me, because our conversation got to personal and she felt that she was the only professional that would ever be able to help me, so she choose to avoid the possibility of me having a hard time fiding another therapist in case she was no longer available for whatever reason",
   "created_utc": 1703626393,
   "score": 6,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1lg3r",
   "message": "Dozed and nodding off during session",
   "created_utc": 1703629551,
   "score": 6,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf0zol0",
   "message": "because his office sign had space after \"the\" in therapist.",
   "created_utc": 1703621103,
   "score": 34,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1o40v",
   "message": "She asked if I was ever worried about od'ing on THC. She's an addiction therapist and doesn't know wtf she's talking about when it comes to drugs. That's a deal breaker.",
   "created_utc": 1703630631,
   "score": 6,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1upgy",
   "message": "When I was 13, my stunning therapist moved to Canada to work there. I got assigned a new therapist. Which is already an issue. Getting a new therapists when you've already had one that was so great absolutely suck. Anyway, it was this lady who on THE FIRST SESSION told me that I was choosing to be queer, because she chose to be gay. Like babe, you should have unpacked that internalized homophobia long ago. She also told me I attracted bad people to me because of the way I acted. I changed therapists immediately\n\nEdit to add another story: \nWhen I was 11, I was taken away from my family my CPS all this stuff ensues. I act out because of what I was experiencing so I got a psych eval and mandatory therapy. The therapist that the state sent was dog shit. She tried to get me to talk about the stuff I didn't want to, rather aggressively. I didn't know what was wrong with the way that I was raised - I didn't know what was happening was abuse. She very bluntly told me my life wasn't normal. There's most certainly a better way to do that to a kid. \nShe also tried to have me put in a psychiatric hold because I absent mindedly punched staples onto a carpet (not into a carpet but I like extended the stapler and punched it so staples made a little pile). I then stepped on them when I got up. She said it was an act of self harm and convinced my caregivers that I needed to put on a hold or they could be held accountable by the court",
   "created_utc": 1703633366,
   "score": 5,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1hemd",
   "message": "She told me that I was beyond help, that I didn't want help. She wouldn't actually delve into my trauma because I was self medicating and said if I didn't stop using self medication as a coping mechanism digging into my trauma would make things worse. I don't know if I was in the wrong but telling me I was beyond help was the straw that broke the camels back.",
   "created_utc": 1703627954,
   "score": 10,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1hmyt",
   "message": "I'm kinda on this right now...certainly not going to leave my therapist because I've only been seeing them for a few sessions but she asks me to repeat myself a lot and I feel like there's not a lot of solutions offered...I'm certainly not going to go elsewhere immediately but if this keeps up...",
   "created_utc": 1703628044,
   "score": 5,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1hvt3",
   "message": "Told me people who died on 9/11 did so because they weren’t putting good energy out into the world that day",
   "created_utc": 1703628141,
   "score": 5,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1nwer",
   "message": "I was in therapy dealing with infertility, miscarriage, and IVF trauma. Our sessions were via telehealth and her kids kept coming into the room or screaming in the background from another room. She also would talk about her kids, complain a lot about how much they cost, etc.",
   "created_utc": 1703630543,
   "score": 5,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qgyd",
   "message": "We kept treading the same ground without making progress. \n\nI asked for homework: books to read, exercises to work on, etc. and she kept saying \"let me think about it\" and never got back to me.\n\nAfter the third round of that I was done.",
   "created_utc": 1703631592,
   "score": 5,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1rqlw",
   "message": "We ended yes up taking a lot about their interests,  specifically Llamas.  I kid you not.   I watched a pretty normal human become obsessed with Llamas to the point where I felt I was witnessing a person unravel because of it. Therapy became unhelpful and bizarre.   They had been so helpful for so long and then in a short amount of time it all crumbled.  It was so upsetting.",
   "created_utc": 1703632119,
   "score": 5,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1f7o3",
   "message": "They weren’t useful or helpful.",
   "created_utc": 1703627104,
   "score": 4,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qmjv",
   "message": "I couldn't afford the copay.",
   "created_utc": 1703631655,
   "score": 4,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1rmti",
   "message": "Insinuated I let a guy assault me",
   "created_utc": 1703632075,
   "score": 4,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1ufgl",
   "message": "My brother previously went to him and he kept saying, \"This is similar to what your brother went through...\" \n\nI couldn't stand it and it was highly unprofessional.",
   "created_utc": 1703633248,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1ukwc",
   "message": "Fraudulent charges on the new credit card I had just given them the details for. They were the only person I had shared this information with. Not to mention, this happened again with the replacement card. Both times, the charges were for Door Dash. Then they double charged my copay. When I let them know it happened, they apologized and said they would talk to the front office to get it reversed. Ended up having to do a charge back.",
   "created_utc": 1703633312,
   "score": 4,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1yxbq",
   "message": "I found out that he'd also started seeing my then-girlfriend as a client, and when we used him for couple's therapy (something I've later been told he should have stopped us from doing) he started using things she'd told him about me. Hard fucking pass.",
   "created_utc": 1703635154,
   "score": 4,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf18v9s",
   "message": "He told me I had to manipulate my ex if I wanted to get back together with her",
   "created_utc": 1703624650,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1kszg",
   "message": "I did better when I wasn’t seeing her. I had blowup fights with my parents after every session. Now I see a different therapist who actually helps me diffuse fights, not start them.",
   "created_utc": 1703629293,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1l468",
   "message": "Second to last visit, most of the visit was her talking about herself and her struggles. \n\nLast visit, she spent the entire time talking about the Psych meds she was on, while showing proof, and how she used a prescription coupon card to get additional savings.  She wouldn't let me interject with anything.\n\nI was very confused when I had to pay for that visit.",
   "created_utc": 1703629417,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1oggt",
   "message": "She was incredibly judgemental and would get frustrated at me talking about my \"minor\" traumas when her other patients had \"actual\" severe traumas they needed her help working through, and I needed to just get over it. \n\nIf what she said her other patients went through was true (no idea how it was ethical for her to compare suffering of patients so explicitly like that), they indeed has worse things to sort through, but it doesn't mean I'm not struggling to get past mine or that I'm wasting her time by paying her to help me move past it.",
   "created_utc": 1703630773,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1s1u3",
   "message": "\"Isn't everyone just a little ADHD? (chuckles)\"",
   "created_utc": 1703632249,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1sq5q",
   "message": "Therapists are hard. The whole process of finding a good one that's invested in your health, and understands your unique background is super opaque. \n\nIt's basically like dating.",
   "created_utc": 1703632534,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1srrp",
   "message": "I had one small panic attack and got upset and walked out. Called and emailed back to set up another appointment, ghosted for a couple weeks then got an email saying I’m too much.",
   "created_utc": 1703632554,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1t340",
   "message": "Didn’t even listen to anything I said and told me that the reason I’m so depressed is because I don’t smile enough. Took everything in me to not slap the dog shit out of him.",
   "created_utc": 1703632688,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf212oo",
   "message": "She wasn’t giving me any tips or techniques to actually change. While it was nice to have my feelings validated, I would literally be telling her, “But I don’t want to be mad anymore and can’t get over it,” and she would just respond, “Well, you have every right to be mad.” I was stuck in a negative spiral with her.”",
   "created_utc": 1703636075,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf14vdu",
   "message": "Wait you guys see therapists?",
   "created_utc": 1703623104,
   "score": 5,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1es5v",
   "message": "My company switched insurances.",
   "created_utc": 1703626943,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1p4p4",
   "message": "The price I pay per session + the little help I received = me canceling after over a year of doing therapy. \n\nI personally struggle with digging deep and opening up emotionally (the main reason I joined therapy was to help with this to try and better my relationship). Since I struggle to do this it would have been nice if they encouraged or tried different ways to get me on path to talk about my problem. Instead we'd spend the hour doing small talk about weather, and different things to organize houses, and dogs. I will do small talk for a week straight if you don't get me on track and this is something I mentioned in the first month of sessions and not once did they ever try and get me to talk about what I needed to and I'd regret it after every session. Pretty sure they didn't care because they were still making more money in an hour than I do in 3. I can't bring myself to spend that kind of money on therapy again, but boy it would be nice to have someone to talk to since I'm alone now. Shit just kind of builds up in my mind now and I unload into a journal as a form of therapy. Doesn't help fix anything, but gets shit off my mind (for the most part).",
   "created_utc": 1703631045,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qak5",
   "message": "i was in the late teens at the time, had mad problems with social anxiety and the government told me to go to this therapist guy. this is in sweden so the program was free no cost at all for me. \n\nYet when i get there this 50 something  years old man ask me a let's say 17 year old dude to give him 75 swedish crowns (around 7.5 bucks) in cash everytime i meet him. \n\nI just laughed at him and called him out on his weirdness and yet he was adamant that it was the proper way to do things. I never returned",
   "created_utc": 1703631520,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1trhm",
   "message": "I never felt like she was actually listening to me and I always felt misunderstood. Because of that i never told her EVERYTHING because what should’ve been a safe space didn’t feel like one. It literally felt as though i was talking to my parents (and that’s no goodie).",
   "created_utc": 1703632969,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1x0xi",
   "message": "Instantly gave me her political views on COVID after I told her I was feeling overwhelmed by COVID politics.",
   "created_utc": 1703634348,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf26cc7",
   "message": "I could see her online shopping in the reflection of her glasses. I thought she was just taking notes.",
   "created_utc": 1703638311,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf26fuh",
   "message": "Just wouldn't do any of his work outside the session. Needed him to fill out some papers, never got them to this day. Thankfully my doctor was able to sign too.",
   "created_utc": 1703638351,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf279cx",
   "message": "He pushed religion on me. He was an 86 year old conservative white dude(not that it bothers me). \n\nWhen he couldn’t offer a solution or a tool to help me, he said to turn to God. That shit doesn’t belong in a therapy session unless requested. I told him previously that I wasn’t religious. Even gave it a try and read the Case for Christ. Nope. \n\nHe kept trying to push it and I ended up less politely disagreeing with him and he knew that was our last session. My current therapist and I joke from time to time. \n\nHe was also inappropriate with it. One of the things I returned for was my anger and irritability(turns out that this is due to my ADHD). I told him that when my girlfriend at the time got sassy with me, it sets me off. He didn’t offer a solution, rather a couple scriptures that basically said that women were put here to annoy men and that men were above women. I told him that I was a student making 20k a year at the time and my GF was a pharmacist making 120k a year who had busted her ass through 8 years of school and an internship. I did not see myself as her superior. We are both people and we are the same, equally as people. This was during my last session. No thanks, already.\n\nEdit: spelling.",
   "created_utc": 1703638701,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf27cqo",
   "message": "She called my ex my “Twin flame”",
   "created_utc": 1703638740,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf27m0f",
   "message": "All she talked about was her adult son that lived in her basement. I knew more about that than she knew about me",
   "created_utc": 1703638849,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf28013",
   "message": "My therapist demanded I pay her in advance for the next ten years.",
   "created_utc": 1703639017,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf28av4",
   "message": "She started saying, \"You don't have to tell me all the details.\" This was right at a crucial point in our work, and it felt like she was telling me to keep it to myself -- especially when she started repeating it. \n\nAs she had encouraged me to dig deep into my traumas, it felt like being pushed into raging waters and having a life prefer stripped from my hands.",
   "created_utc": 1703639146,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf29cee",
   "message": "She didn't know what Reddit is",
   "created_utc": 1703639598,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf29pee",
   "message": "Me and her started having romantic and sexual feelings for each other and knew it would be best to change my therapist. After she stopped being my therapist, our relationship bloomed Unfortunately she was married and her husband was getting too close to the founding out, so had to end it",
   "created_utc": 1703639755,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf14y1w",
   "message": "Therapist is often used in place of psychologist so assuming they're bundled together - because I was a very shy 18 year old and he basically scolded me and told me to get my shit together.\n\nTerribly unprofessional. I never saw him again after that session. I feel like I legitimately have a wound from this and am on edge with psychologists.",
   "created_utc": 1703623134,
   "score": 4,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf11qqe",
   "message": "He became The-Rapist.",
   "created_utc": 1703621912,
   "score": 3,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1f9ip",
   "message": "She was trying to sleep with me",
   "created_utc": 1703627123,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1nnv9",
   "message": "Betterhealth raised their prices lol.\n\nI actually felt really bad, she was a little old fashioned at times but overall was 9.5/10.",
   "created_utc": 1703630446,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1pps8",
   "message": "I’m very introverted to a point I never opened, up to them.",
   "created_utc": 1703631282,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf27tcp",
   "message": "Too self aware. Been going for months before she eventually was all “You know what the source of the issues are, you keep giving me sound solutions to address your issues, like why are you here?” And that was the last I saw of her",
   "created_utc": 1703638937,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf12efr",
   "message": "He had all these pornographic ink blots he would show me as a \"test.\"  Then he had the nerve to tell me that I was obsessed with sex!",
   "created_utc": 1703622163,
   "score": 0,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1fglp",
   "message": "She had to move to another city because of her husband's job.  It was a bummer because we worked well together.",
   "created_utc": 1703627198,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1hx4h",
   "message": "I’ve been to many different therapists and the biggest issue is the fact that they talk to me like I’m 5, also I don’t want to pay them to tell me exactly the same thing Google tells me lmao",
   "created_utc": 1703628155,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1kfdw",
   "message": "I told her I had difficulty with forming close relationships while dating and she told me to f men, they all suck anyways",
   "created_utc": 1703629143,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1nv5g",
   "message": "I found myself too attracted to her.",
   "created_utc": 1703630528,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1oakn",
   "message": "Kept canceling at the last minute due to M.S.",
   "created_utc": 1703630705,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf25r40",
   "message": "His wife caught us",
   "created_utc": 1703638061,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qe2l",
   "message": "I knocked her up",
   "created_utc": 1703631559,
   "score": 0,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1rwvn",
   "message": "Told her I tried to off myself after 2 years of her trying to get me to trust her because for some reason I was extremely worried telling her anything.\n\nShe: „so, what are you trying to get out of telling me this“ \nI was so done after that.\n\nShe was also mentioning sh tools which triggered me to try out many things I shouldn’t have. \n\n\nBtw I found another therapist now who I so much better that her.",
   "created_utc": 1703632192,
   "score": 0,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1svzz",
   "message": "She never responded to email to schedule another appointment.. actually ghosted me \n\nAnd than had the nerve to try and charge me twice \n\nI no longer trust therapist lol",
   "created_utc": 1703632604,
   "score": 0,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf11yoy",
   "message": "She wouldn't put out, Lol.",
   "created_utc": 1703621997,
   "score": 240,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1s72z",
   "message": "Experiences like these are the reason while I always smirk when I hear “You should try therapy” as advice. Too many quacks, and even when they’re not, I find it very unlikely that they are able to give much more than generic, low risk (nobody wants to get sued) advice.",
   "created_utc": 1703632311,
   "score": 255,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf14v91",
   "message": "I came in to talk about my suicidal history. But she changed the subject where it became to me listening to her. She told me about how great her ex-boyfriends were in bed and bought her whatever she wanted. It went on for hours. Past midnight when I came home, she sent me 40 texts telling me to call her. When I did, she told me everything was wrong with me and how I should be grateful for dating such a beautiful woman. I never asked her out on a date. Then I woke up and realized it was all a dream.",
   "created_utc": 1703623103,
   "score": 245,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qqhg",
   "message": "He told me I need to develop a meaningful relationship with my food.\n\nRelationship? It's food. I want to eat it, not have a relationship with it.",
   "created_utc": 1703631700,
   "score": 253,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1b8o1",
   "message": "They wouldn't look me in the eyes when they were molesting me",
   "created_utc": 1703625574,
   "score": 247,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1ku9i",
   "message": "My mother also paid for the pleasure of her company....and I'm not talking about therapy",
   "created_utc": 1703629307,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1o6uj",
   "message": "I graduated out of needing regular therapy and now reach out on as a FWC(friend with counseling) if I need help processing something difficult. \n\nREALLY came in clutch this year with validating boundaries that I continue to enforce while dealing with toxic family that refuses sobriety and treatment.",
   "created_utc": 1703630663,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1phls",
   "message": "She kept insisting that my ex boyfriend and I were still dating even though we had broken up and he MOVED OUT of our shared apartment. When I told her \"as much as I would like to get back together, I want to respect his choices,\" she told me I was being defensive and I was playing the victim. \n\nI'm proper fucked up from that session lol",
   "created_utc": 1703631189,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1pun6",
   "message": "I got fired by mine. He basically told me all I do is come to counseling and talk about how great my life is.\n\nHe said I’m welcome to come back, but didn’t think I needed to keep coming considering all the negative aspects of my life had cleared up.",
   "created_utc": 1703631338,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1pwkf",
   "message": "During the pandemic, my sessions were all virtual. He joined Zoom while driving to his office. Also, he kept telling me to checkout Tony Robbins.",
   "created_utc": 1703631359,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qct9",
   "message": "My insurance not paying anymore 😞",
   "created_utc": 1703631545,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qpad",
   "message": "Not mine, but my now wife - we hit a rough patch early in our relationship while we were long distance and we both started seeing therapists. Her therapist always brought her dog to sessions - not because he was a therapy dog, she just didn’t like to be away from him. My wife asked if she could take a picture of the dog to send to me, and the therapist freaked out at her about it. Very next session the therapist told her she was a horrible person, she was committing emotional infidelity by having positive platonic relationships with other men, and that she should start counting down the days because I was bound to leave her very soon.",
   "created_utc": 1703631686,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1qvj3",
   "message": "Your therapist should never answer your problems, I feel like they should guide you to solve it",
   "created_utc": 1703631758,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1rxvf",
   "message": "Moving",
   "created_utc": 1703632204,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1rzr1",
   "message": "She was kinda dumb. Everything I said was met with awe. WTF. I feel like I helped her, like I was the therapist instead. Fuck that shit. \n\nProfessionals should admit when they are not the right fit for your needs. Thanks to a Dr. who from one visit referred me to a different dr given my medical needs is how I ended up with fantastic drs, including my current therapist.",
   "created_utc": 1703632225,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1sgyo",
   "message": "I had several who just weren’t listening. They would let me vent the entire session and progress never really felt like it occurred because we never discussed anything other than my venting for the day. While that’s fine here and there I needed more guidance than that. The last one I had before my current one also feel asleep in a few sessions and while I liked talking to her that was just inappropriate",
   "created_utc": 1703632427,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1t5lp",
   "message": "Realizing I could get the same if not better treatment by just talking to people.  \n\nOh and the fact they were charging stupid money per hour then were like oh goodbye see u next time :)",
   "created_utc": 1703632717,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1tjni",
   "message": "She was the same age as me and it just felt like I was talking to a peer about issues vs a mental health professional. I have a great psychiatrist though :)",
   "created_utc": 1703632879,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1tyz8",
   "message": "Going through this right now. Moved out of state and switched health insurances so insurance wise I can’t see her anymore, and technically she’s not licensed to practice out of state. It really sucks because I don’t want to find a new therapist and I’m totally content and happy with her. I actually cried about it a few weeks ago because I’m scared I won’t find someone who will connect with me and understand my brain the way she does. I really don’t want to have to find someone new.",
   "created_utc": 1703633056,
   "score": 2,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1u3k1",
   "message": "I realized I felt better when I stopped going to them and learning from myself.",
   "created_utc": 1703633110,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1u9bd",
   "message": "They ghosted me lol",
   "created_utc": 1703633177,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1vav1",
   "message": "She never remembered anything about me or my case. It was like I was always the lowest priority. Like basic stuff, like what I do for a living or where I live. Shit for the first year she kept calling me by the wrong name.",
   "created_utc": 1703633616,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1vr4p",
   "message": "When I “vent”, she didn’t write down any points and at the end of the session she told me, to repeat again in next session. If you have dealt with trauma, you know how hard it is to speak or relieve it again and again. Out of courtesy, I think she should have write at least some points so jn the next session, she could bring up point and work our way from there. Not asked me to repeat A to Z again. 💀",
   "created_utc": 1703633808,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1vv2x",
   "message": "I was late (~10-15 min) to an appointment because of a combination of struggling with time management and an extended argument with a long-term abusive then-partner (who my therapist was aware of; I wouldn’t have called him abusive at that time, but most people in my life had that opinion of him at that time).\n\nI clarified with the receptionist if it was okay or if I had to pay / reschedule. The receptionist told me it was fine and that my therapist had been waiting for me. (For even more absurdity, I was probably 18 or 19 and this was at a pediatrician’s.)\n\nI went in and the first thing she said to me in the most exasperated tone was “What’s wrong this time?”\n\nI proceeded to have one of the most traumatic days of my life bc of said ex the next day.\n\nNeedless to say, I never went back to that therapist.",
   "created_utc": 1703633854,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1w18n",
   "message": "She doesn't tell me shit except questions about my juicy script life.. 😤",
   "created_utc": 1703633928,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1wazj",
   "message": "Technically he broke up with us because he said my oldest child, his client, needed inpatient treatment (true). And my ex wouldn't agree to it \n\nHowever he also said my child was a 'starseed' and that's why they were autistic and called CPS over my ex which ended up in court and essentially derailed my entire fucking life \n\nHe used my child to get approved to our insurance company and then dropped us like a hot potato while leaving a trail of devastation in his wake.",
   "created_utc": 1703634043,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1wis1",
   "message": "Our first session was a video call and as soon as the call ended I started crying because she made me feel like everything that had happened to me was entirely my fault",
   "created_utc": 1703634136,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1xoak",
   "message": "He acted like he needs help.",
   "created_utc": 1703634621,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1y5mk",
   "message": "She would frequently hint at her positions on sociopolitical issues, and while I had basically the same political stance as she did, I did not appreciate her arrogant assumption that that particular position was “right”. She seemed to think it was the default “correct” position. \n\nAn opinion is an opinion and I have difficulty respecting people who don’t think that they might be wrong. I’m absolutely not interested in surrounding myself with anything that resembles an echo chamber.",
   "created_utc": 1703634825,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1yoks",
   "message": "He retired. But we keep in touch.",
   "created_utc": 1703635049,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1yq8d",
   "message": "Ran out of money.",
   "created_utc": 1703635069,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1yuno",
   "message": "I hate it when they just look at you expecting you to say something instead of asking questions.\n\nI've had one that just stared at me for 30min, I let it keep going just to see if he would do anything\n\nlike, my guy, I'm going to therapy for social anxiety, if I knew how to talk to people or initiate and keep conversations going, with, yourself included,  I wouldn't be here.",
   "created_utc": 1703635122,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1ywz4",
   "message": "He pretty much told me just to breathe through everything. Which is fine for advice, but it’s not entirely helpful when trying to talk about something deeper.",
   "created_utc": 1703635150,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1z5mx",
   "message": "Being introduced at a social event to a friend of a friend who responded with “oh you know Dr. Whatshisname!”\n\nI was already iffy on the guy but that certainly sealed it.",
   "created_utc": 1703635254,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1z5o4",
   "message": "He told me the best way to overcome my trauma around relationships affecting my marriage was to start a secret bank account and hide money from my husband.",
   "created_utc": 1703635254,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf1zxcm",
   "message": "Sex",
   "created_utc": 1703635588,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf20de4",
   "message": "Couples therapist. First session. \"Ah yes, you're both manipulative\"",
   "created_utc": 1703635777,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf20ymw",
   "message": "There was someone else.",
   "created_utc": 1703636028,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf211ac",
   "message": "When she dismissed me when I told her abusive MIL.",
   "created_utc": 1703636059,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf21ltk",
   "message": "Kept telling me about other patients, was anti vax",
   "created_utc": 1703636300,
   "score": 1,
   "submission_id": "18rgrzl"
  },
  {
   "comment_id": "kf25pfi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "18rgrzl"
  }
 ]
}